[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451934,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Check engine light on and diagnostic test shows particular matter sensor malfunction. This is apparently under recall, but my VIN is not included",
        "vin": "Wa1cmafp8ea"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/22/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448776,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2014 Audi Q5 Premium Plus with 3.0 liter engine. I was in Wolfeboro NH this past weekend and it was very cold, -15 at night. My vehicle has 123000 miles on it and has run with no issues to this point. Luckily , I parked the car to go into store and when I came out DSC red warning light came on , could not budge the steering wheel. Looked up issue in manual and said do not drive. I am from CT so no car now in NH. I had vehicle towed to closest Audi dealer , 60 miles away for service. It turns out to be I need a whole new steering column due to cold temperatures. If this happened while driving it would have been devastating. My issue is there was a recall on the 2014 SQ5 for the exact same issue. I have found numerous complaints for the same issue for the same vehicle, why has there not been recall?  This could have ben a deadly incident in the wrong situation. Vehicle at Audi dealer to the tune of $3600 for repairs.",
        "vin": "WA1DGAFP7EA"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11446057,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Seatbelt tensioner and air bags failed to deploy when the vehicles was in a severe frontal collision when another vehicle ran a stop sign exiting the highway.",
        "vin": "Wa1lfafp4ea"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428479,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2014 Audi Q5 2.0L Turbo, at 84339 miles, is consuming oil between oil changes.  4300 miles after my last oil change by the Audi dealership, I had to add oil.  The dealership, Gwinnett Audi, 3190 Satellite Blvd, Duluth, GA 30090,  said that Audi is paying for the oil top off for all customers.  Seems odd that if this is normal that Audi would voluntarily reimburse the dealership for this expense.  I am concerned, based on internet searches, that this will continue to get worse and I will be adding more and more oil without getting the problem resolved.  The dealership told me it would cost $7,000 to fix the engine and there is no longer a warranty.  This vehicle should not be burning oil at $80,000 miles.  Audi needs to make permanent repairs to fix the problem, not just put a bandaid on it.  I am not the only Audi owner with this problem.",
        "vin": "WA1LFAFP1EA"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421907,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I am writing about an incident that happened to my wife while she was driving my car from Los Angeles, CA to Phoenix, AZ on June 16, 2021. My wife was driving the Audi Q5 at approximately 75mph and 125 miles west of Phoenix (near the CA/AZ border) when the car suddenly loss power. She stepped on the gas and noticed the speed gradually dropping. Fortunately, she had the presence of mind and barely had enough time to pull over to the shoulder. It was at this point that she called to tell me that the car would no longer start and the “check engine” and “EPC” light indicators were illuminated. This occurred at approximately 12:30 noon during a severe heatwave where the outside temperature was 117 degrees. I asked her to wait for 10 minutes to try to restart the car; the car would not restart.  She called AAA Towing and was told the wait would be over one hour because of the rural location (Quartzsite, AZ). She ended up waiting a little over 3 hours in her car, without air conditioning, in 117 degrees for a tow truck driver to arrive. The car was towed to her sister’s house in Goodyear, AZ at a cost of $673.  The next day, she had the car towed to the Audi Dealership in Peoria, AZ where it was diagnosed the car had suffered a fuel vapor lock due to the heat. The car has less than 28,000 miles on the odometer when the incident happened. Audi Peoria kept the car for a couple of days because the parts had to be ordered from Los Angeles. Ultimately, the repair bill from the dealership came to $1,983.  I felt helpless and scared for my wife that I was not able to assist her as I was 3 hours away. What if my wife (or another driver) was unable to pull over to the side of the road? The chances of an accident are dramatically increased if the vehicle was stuck on the highway. As you can imagine, my wife has been traumatized by this incident and we are both fearful that this incident can happen again. Therefore, we request that NHTSA investigate this incident.",
        "vin": "WA1LFAFP1EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421060,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "This SUV has a 2.0 engine that consumes oil. I have to add a quart every 200-300 miles as the IP light indicates the engine is at the minimum oil level. This is not normal to be adding oil this frequently. Audi/VW has had problems in the past with vehicles that used excessive amounts of oil and a settlement was reached with owners. It seems they have not fixed the issue and I believe an investigation is needed and corrective action should be taken again by Audi/VW to make owners whole and to finally fix the problem. They need to find the root cause of this problem and fix it.",
        "vin": "WA1CFAFP2EA"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "04/28/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415388,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE ELECTRONIC POWER STEERING FAILED, ALMOST CAUSING A HEAD ON COLLISION. MY DAUGHTER WAS TURNING LEFT WHEN SUDDENLY SHE WAS UNABLE TO PROPERLY STEER. THANKFULLY, SHE WAS ABLE TO VEER OFF THE ROAD SAFELY. THIS PART HAS BEEN RECALLED ON THE AUDI SQ5, BUT NOT THE Q5. ACCORDING TO MY RESEARCH, MULTIPLE AUDI Q5 OWNERS HAVE COMPLAINED ABOUT THIS SERIOUS SAFETY ISSUE.",
        "vin": "WA1LFAFP2EA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414410,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIGHT OIL LEAK FROM OIL COOLER LINE   SLIGHT LEAK AT THE COOLANT RESERVOIR. BURNS OIL QUICKLY",
        "vin": "WA1LFAFP2EA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414212,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CLOSING THE TRUNK THE DASH MARKS AS IF IT WERE OPEN. I HAVE TO OPEN AND CLOSE THE TRUNK SEVERAL TIMES SO THAT IT STOPS MARKING AS IF IT WERE OPEN.",
        "vin": "WA1LFAFP9EA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414213,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SQUEAKS AND/OR RATTLES ARE HEARD FROM THE PANORAMIC SUNROOF AREA.",
        "vin": "WA1LFAFP9EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397790,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 53661 CHECK ENGINE LIGHT CAME ON,AFTER DRIVING IT IT WENT OFF ONLY TO COME BACK ON AND STAY ON. AFTER TAKING IT TO THE DEALER \"FOUND TIMING CHAIN STRETCHED. REPLACED TIMING CHAIN AND TENSONER\"",
        "vin": "WA1LFAFP9EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "12/26/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. THE CONTACT STATED THAT WHILE REVERSING OUT OF HIS DRIVEWAY, HE LOST CONTROL OF THE STEERING WHEEL. THE CONTACT STATED THAT THE STEERING WHEEL BECAME LOOSENED. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AUDI GAINESVILLE (1920 N MAIN ST, GAINESVILLE, FL 32609) WHERE THE CONTACT WAS INFORMED THAT THE RACK & PINION AND ELECTRIC POWER ASSIST STEERING SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000. *LN  CONSUMER STATED POWER STEERING SHUTS DOWN IN COLD CONDITIONS AND SUDDEN LOSS OF POWER.*JB*LN*JB",
        "vin": "WA1DGAFP3EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/11/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384647,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SERIOUSLY DANGEROUS STEERING FAILURE IN 2014 AUDI Q5:  WARMED THE CAR UP, DROVE 15 MINUTES TO A GAS STATION, TURNED IT OFF TO FUEL UP AND WENT TO RESTART AFTER ENGINE WAS OFF FOR APPROXIMATELY 5 MINUTES, UPON START UP AND THE MESSAGE DISPLAYED \"STEERING DEFECTIVE\" DO NOT DRIVE VEHICLE. THE POWER STEERING WAS NON FUNCTIONAL AND THE WHEEL ESSENTIALLY LOCKED UP.  THIS HAS HAPPENED TWICE, BOTH AT VERY COLD TEMPERATURES (ONCE AT -40 DEGREES BELOW AND ONCE AT -15 DEGREES BELOW ZERO).  SOME QUICK INTERNET SEARCHING LEADS TO LOTS OF COMPLAINTS OF THE SAME SITUATION FOR 2014-2015 Q5'S.  THE SQ5 OF THE SAME YEAR HAS A RECALL FOR THIS VERY ISSUE BUT THE Q5'S FOR SOME REASON DID NOT GET THE RECALL.  IT SOUNDS LIKE IN SOME INSTANCES ITS A SIMPLE SOFTWARE UPDATE AND IN SOME CASES ITS AN ENTIRE NEW STEERING RACK REPLACEMENT COSTING UP TO $5,000.  IT SOUNDS LIKE AUDI HAS NOT COVERED THIS ISSUE UNDER WARRANTIES NOR HAS IT ISSUED A RECALL TO COVER THE SAME ISSUE ON THE Q5'S AS WAS EXPERIENCES WITH THE SQ5 OF THE SAME YEAR (RECALL #48M1 & NHTSA #11184036).  I AM 300 MILES FROM THE NEAREST AUDI DEALER.  AUDI SAYS THEY WILL NOT COVER IT BECAUSE ITS OUT OF WARRANTY.  I EXPLAINED IT MATCHES A RECALL FOR THE SQ5 AND BELIEVE THE Q5 WAS OVERLOOKED WITH THAT RECALL, THEY WERE OF NO ASSISTANCE.  AUDI SAYS I CAN PAY SEVERAL THOUSAND DOLLARS TO HAVE IT TOWED TO THE DEALERSHIP BUT THEY ARE NOT LIKELY GOING TO COVER ANY OF IT SINCE THERE IS NO RECALL.  SEEMS AS THOUGH THERE ARE A LOT OF US OUT THERE THAT HAVE THE SAME SAFETY ISSUE, WHAT CAN BE DONE TO GET THIS SAFETY ISSUE FIXED BY AUDI?  LUCKILY I WAS STATIONARY ON BOTH OCCASIONS OTHERWISE THIS WOULD HAVE CAUSED A SERIOUS CRASH AND POSSIBLE INJURY.  IM SCARED TO DRIVE IN COLD WEATHER ANYMORE. I WOULD THINK AUDI WOULD CARE ABOUT SUCH A HUGE SAFETY ISSUE!",
        "vin": "WA1DGAFP3EA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/06/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378271,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A REALLY STRONG ODOR OF FUEL OR GASOLINE IN THE CABIN IT'S SUPER SEVERE AND I DON'T KNOW WHERE IT'S COMING FROMDOESN'T MATTER IF IT'S RUNNING IF I'M DRIVING SUMMER STARTING IT IT'S IT'S JUST TAKES A LITTLE WHILE FOR IT TO START TO STINK AND THEN ONCE IT'S BEEN ON FOR A COUPLE MINUTES IT STARTS TO JUST WREAK",
        "vin": "WA1DGAFP4EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373451,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING ESSENTIALLY \"LOCKED\" UP FOR NO APPARENT REASON.  WARNING ALARM SOUNDED AND \"STEERING DEFECTIVE, DO NOT DRIVE\" WARNING APPEARED.  VERY DANGEROUS, CAN BARELY TURN WHEEL.  IF THIS WOULD HAVE OCCURRED WHILE DRIVING I'VE NO DOUBT ACCIDENT, POSSIBLY INJURY, WOULD HAVE OCCURRED.",
        "vin": "WA1LFAFP6EA"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11343683,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I APPROACH A CITY INTERSECTION AT THE FORT LAUDERDALE AIRPORT AND HAD NO BRAKES, STEERING, OR ACCELERATOR CONTROL. THE VEHICLE WAS COMPLETELY UNRESPONSIVE. I FLEW THROUGH THE INSPECTION HITTING THE CURB AND LAUNCHING MY VEHICLE APPROXIMATELY 50' OF DISTANCE OVER A DRAINAGE DITCH SLAMMING TO A COMPLETE STOP ON THE OTHER SIDE. THE SPEED WAS AT LEAST 40-50MPH AT THAT MOMENT, MAYBE FASTER SINCE THE VEHICLE JUST ACCELERATED BUT WOULD NOT BRAKE OR STEER.   I HAD MY SEATBELT FASTENED AND AIRBAGS WERE DEPLOYED. THE VEHICLE WAS TOTALED AND THE FRAME LITERALLY SHATTERED ON IMPACT.   I SUSTAINED SERIOUS TRAUMA TO MY FACE AND BACK AND ANKLES.",
        "vin": "WA1DMAFP5EA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331513,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING FUEL, IN THE PRESENCE OF AN IGNITION SOURCE, INCREASING THE RISK OF FIRE AND CAR STALLS ETC..  *TR",
        "vin": "WA1LFAFP5EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306151,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PANORAMIC SUNROOF IMPLODED WHILE DRIVING. GLASS SHARDS COVERED MYSELF AND BACKSEAT. LARGE HOLE IN TOP OF SUNROOF AND ALL GLASS FRACTURED. SOUNDED LIKE A GUNSHOT WHEN IT EXPLODED. IN MOTION ON SEWARD HIGHWAY. 5:15 AM ON ROAD. MINIMAL TRAFFIC.",
        "vin": "WA1CMAFP1EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301235,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT STARTED COMING ON INTERMITTENTLY AT 64683 MILES.  CAR WAS TAKEN TO AUDI DEALER TO TROUBLE SHOOT.  DIAGNOSED AS \"COLD START FUEL PERFORMANCE FAULT CAUSED BY STRETCHED TIMING BELT.\"  OUT SIDE OF WARRANTY AND CLASS ACTION LAW SUIT AUDI FOUND AT FAULT FOR EARLIER MODELS FOR THIS.",
        "vin": "WA1CFAFP5EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280881,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. WHILE THE VEHICLE WAS PARKED OUTSIDE OF THE CONTACT'S RESIDENCE, THE CHECK ENGINE OIL WARNING INDICATOR ILLUMINATED WHEN THE VEHICLE WAS STARTED. THE CONTACT STATED THAT SHE NEEDED TO ADD OIL TO THE ENGINE EVERY TWO WEEKS. THE VEHICLE WAS TAKEN TO BIENER AUDI (LOCATED AT 795 NORTHERN BLVD, GREAT NECK, NY 11021, (516) 829-2834) THREE TIMES. ON OCTOBER 13, 2019, THE CONTACT WAS INFORMED THAT THE PISTON SIZES WERE TOO SMALL AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 81,886.",
        "vin": "WA1CFAFP8EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270153,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER AUDI REPAIR THE SECONDARY WATER PUMP DUE TO RECALL  MONTHS LATER CAR THERMOSTAT RUNNING HOT AND AUDI STATES MAIN WATER PUMP LEAKING",
        "vin": "WA1LFAFPXEA"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253573,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DAYTIME RUNNING LIGHT DOES NOT WORK AND APPEARS BASED ON MY INTERNET SEARCH THIS PROBLEM IS PERVASIVE.",
        "vin": "WA1LFAFP1EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/02/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241354,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE ABOUT 350 MILES INTO A 600 MILE DRIVE.  STOPPED AT A REST AREA TO EXERCISE THE DOG AND VISIT THE RESTROOM.  OUTSIDE TEMPERATURE WAS 97 DEGREES.  THE CAR WAS RUNNING FINE WITH NO STEERING ISSUES.  THE CAR WAS SHUT OFF FOR ABOUT 7-8 MINUTES. UPON RESTARTING THE Q5 TDI, THE DASH INDICATOR FOR DYNAMIC STEERING CONTROL LIT UP ALONG WITH A DO NOT DRIVE WARNING.  WE HAD THE CAR TOWED TO AN AUDI DEALER.  THEY SAID THAT THE ENTIRE STEERING RACK NEEDED TO BE REPLACED.  TO DATE, IT SITS AT THE AUDI DEALER WITHOUT REPAIR WAITING ON THEIR CUSTOMER SERVICE TEAM TO RESPOND TO MY COMPLAINT.  THEY INITIALLY SAID THAT AUDI COULD HELP IF THEY HAD MORE \"HISTORY\" ON THE CAR.  I JUST BOUGHT IT AS AN OFF-LEASE AND POST-DIESEL QUARANTINE SIX MONTHS AGO.  THIS IS OUR FIRST AUDI AND HAVEN'T HAD REASON TO VISIT A DEALER FOR REPAIR YET.  AUDI'S SECOND COMMENT WAS THAT WE HAVE NO HISTORY AT THE LOCAL DEALER.  IT IS ODD THAT THE SAME PART ON THE SQ5 HAS BEEN RECALLED, BUT NOT ON THE Q5.  AUDI NEEDS TO OWN A BAD PART REGARDLESS OF WHICH MODEL IT IS INCLUDED.",
        "vin": "WA1CMBFPXEA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232926,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING THE VEHICLE AND PARKING, WENT TO RESTART AFTER ENGINE WAS OFF FOR APPROXIMATELY 3.5 HOURS, HEARD AN ALARM SOUND UPON START UP AND THE MESSAGE DISPLAYED \"STEERING DEFECTIVE\" DO NOT DRIVE VEHICLE. THE POWER STEERING WAS NON FUNCTIONAL HAD NO OTHER OPTION BUT TO DRIVE WITHOUT POWER STEERING AS WE WERE STRANDED OUT OF STATE, ARRIVED AT OUR DESTINATION, TURNED OFF VEHICLE, WARNING LIGHT TURNED OFF AND POWER STEERING RESUMED, CAR SAT OVERNIGHT, UPON START UP THE FOLLOWING MORNING THE ALARM WENT ON AGAIN WITH WARNING LIGHTS ILLUMINATED AGAIN, TURNED CAR OFF AND DID NOT DRIVE, CAR SAT FOR 10 HOURS AND UPON START UP POWER STEERING RETURNED AND DROVE TO DEALERSHIP WHERE PURCHASED AND THEY COULD NOT GET THE SYSTEM TO REPEAT THE DEFECTIVE STEERING WARNING ILLUMINATE, RAN THE CODES AND COULD NOT DIAGNOSE, TRANSFERRED TO AN AUDI DEALER WHO  IN TURN DIAGNOSED IT WITH A FAULTY STEERING (SAME AS THE SQ5'S WHICH HAVE THE RECALL) AUDI REFUSES TO COVER UNDER WARRANTY. CAR ONLY HAS 41K MILES ON IT.",
        "vin": "WA1CMAFP4EA"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222625,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE INDEPENDENTLY ACCELERATED UP TO 80 MPH. THE CONTACT SHIFTED INTO NEUTRAL AND THE VEHICLE GRADUALLY CAME TO A STOP WITHOUT CRASHING. THE CONTACT STATED THAT THE TACHOMETER WAS RED-LINED AT THE TIME. THE VEHICLE WAS TAKEN TO AUDI ORLAND PARK (LOCATED AT 8021 159TH ST, TINLEY PARK, IL 60477, (708) 342-0300) WHERE IT WAS DIAGNOSED THAT BOTH WATER PUMPS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.",
        "vin": "WA1WMAFP6EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221270,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN",
        "vin": "WA1CFAFP9EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196086,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER RECALL 18V229000 (AUDI RECALL 19N4) MY VEHICLE HAD THE POWER TO THE AFTER-MOTOR PUMP DISCONNECTED IN OCT. '18.  INSTRUCTIONS PER THE RECALL NOTICE AND THE DEALER WAS THAT REPLACEMENT PUMPS WOULD BE INSTALLED AS THEY BECAME AVAILABLE IN EARLY '19.  AFTER NOT RECEIVING ANY NOTICE FROM AUDI THIS SPRING, I CALLED THE DEALER TO INQUIRE ABOUT THE REPLACEMENT PUMPS.  I WAS TOLD BY THE SERVICE MANAGER THAT \"AUDI DECIDED NOT TO REPLACE THE PUMPS AFTER ALL\".    YOUR SITE CURRENTLY SHOWS THAT MY SPECIFIC VIN IS CLEAR OF ANY RECALLS, SUGGESTING THAT THE ORIGINAL RECALL NOTICE WAS MODIFIED IN SOME MANNER TO NO LONGER SHOW THAT THE PUMPS NEEDED TO BE REPLACED AFTER ALL.  YET MY VEHICLE IS SHOWING-UP ON WEBSITES LIKE CARFAX AND AUTOCHECK AS STILL HAVING AN OUTSTANDING RECALL DUE.    SO I NEED CONFIRMATION OF EITHER 1) AUDI IS STILL REQUIRED TO REPLACE THE PUMPS AS THEY AGREED TO IN THE ORIGINAL RECALL, OR 2) THEY HAVE BEEN RELIEVED OF THAT REQUIREMENT AND THAT MY VEHICLE IS TRULY CLEARED OF ANY FURTHER ACTION.    THIS IS VERY IMPORTANT AS I AM ATTEMPTING TO SELL MY VEHICLE...AND WITH THE RECALL STATUS SHOWING OPEN ON PUBLIC SITES, IT APPEARS THAT I'M TRYING TO SELL DAMAGED GOODS.    THANK YOU FOR YOUR ASSISTANCE!",
        "vin": "WA1LFAFP1EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190001,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. WHILE TURNING THE VEHICLE, THE STEERING SEIZED. THE CONTACT ALMOST CRASHED INTO AN ONCOMING VEHICLE DUE TO THE FAILURE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AUDI OF QUEENS (30-35 COLLEGE POINT BLVD, FLUSHING, NY 11354, (929) 297-0700) WHERE THE VEHICLE WAS CURRENTLY BEING DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 96,000.",
        "vin": "WA1CFAFP3EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183663,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING LOCKS-UP AND IS EXTREMELY HARD TO TURN IN EITHER DIRECTION WHILE DRIVING.  THE SAME CONDITION EXISTS IN THE STATIONARY POSITION.",
        "vin": "WA1LFAFP6EA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170672,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5 HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "100,000 KMS ON THE VEHICLE  THE HYBRID SYSTEM DOESN'T TURN ON WHEN STARTING THE VEHICLE. THE CAR GOES \"LIMP\". DOESN'T MOVE EVEN TRYING TO ACCELERATE.  RADIO, FAN ETC STILL WORKS.     HTTPS://WWW.EXPRESS.CO.UK/LIFE-STYLE/CARS/999934/VW-AUDI-PORSCHE-RECALL-HYBRID-ELECTRIC-CARS-POISONOUS-ELEMENT",
        "vin": "WA1CCCFP5EA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/19/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142182,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY VEHICLE TO AUDI AND HAD IT PARTIALLY FIXED.  THEY STATED THERE WERE TWO PARTS TO THIS PHASE.  I COMPLETED PHASE 1; HOWEVER, THE RECALL HAS NOT BEEN LIFTED BECAUSE PHASE 2 HAS NOT BEEN RELEASED BY AUDI TO THE DEALERSHIPS YET.  I WAS TOLD IT WOULD HAPPEN LATE THIS WINTER.  THE PROBLEM I FACE IS THAT I HAVE TO SHIP MY POV TO GERMANY FOR A MILITARY ASSIGNMENT THERE.  I NEED TO HAVE NO RECALLS ON MY VEHICLE IN ORDER TO DO SO.  PLEASE ASSIST.  THANK YOU.",
        "vin": "WA1CFBFP6EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133126,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. WHILE DRIVING 70 MPH, THE ENGINE TURNED OFF AND THE ELECTRONIC POWER CONTROL INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO AUDI SAN DIEGO (9010 MIRAMAR RD, SAN DIEGO, CA 92126) AND REMAINED THERE FOR THREE WEEKS. THE MANUFACTURER WAS ALSO CONTACTED AND DID NOT ASSIST. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 37,000. THE VIN WAS UNAVAILABLE.  *TR",
        "vin": "WA1LFAFP4EA"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130881,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI DEALERSHIP KEEP SAYING THERE IS NO OPEN TIME FOR APPOINTMENT ON MONDAYS; THE ONLY DAY I HAVE OFF AT WORK. I CAN ONLY TAKE THE VEHICLE ON A MONDAY.",
        "vin": "WA1CFAFP6EA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "05/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130437,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. WHILE DRIVING 70 MPH, THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD AND TOOK LONGER TO STOP THE VEHICLE WHEN IT WAS DEPRESSED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AUDI RENO TAHOE (LOCATED AT 9190 S VIRGINIA ST, RENO, NV 89511, (775) 335-1335) WHERE IT WAS DIAGNOSED, BUT THE CONTACT WAS NOT AWARE OF THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "WA1LFAFP5EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123277,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR, CAR SUDDENLY STOPPED... A LOT OF LIGHTS CAME ON IN THE DASHBOARD. THERE WAS A BURNING SMELL INSIDE THE CAR. CAR WOULDN'T START AFTER THAT AND HAD TO BE MANUALLY PUSHED TO THE SIDE OF THE ROAD.  AUDI SERVICE INSPECTED THE CAR AND SAID THAT ENGINE HAD INTERNAL DAMAGE AND I WAS ASKED TO REPLACE THE ENGINE. CAR ONLY HAD 35,000 MILES ON IT. WARRANTY HAD EXPIRED JUST FEW MONTHS EARLIER. I HAD GOTTEN SERVICE DONE EVERY YEAR AT THE SAME AUDI SERVICE DEALERSHIP AND HAD GOTTEN A SERVICE JUST A FEW WEEKS BEFORE THIS HAPPENED! I WAS ASKED TO REPLACE THE ENGINE AT MY COST!! LATER I WAS OFFERED ASSISTANCE FROM AUDI, BUT IT STILL COST ME $4,500 OUT OF MY POCKET FOR A 4 YR OLD CAR WITH 35K MILES ON IT AND SERVICED EVERY YEAR BY AUDI!! LOST FAITH IN THE AUDI BRAND AND THE LOCAL AUDI DEALERSHIP & SERVICE.",
        "vin": "WA1LFBFP8EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "06/26/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11117930,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 AUDI Q5. CONSUMER WRITES IN REGARDS TO WARRANTY START DATE. *LD  *JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "03/27/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114034,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE AND ENGINE COOLANT SYSTEM RECALL",
        "vin": "WA1LFAFPXEA"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "07/04/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111170,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"FUEL PUMP\" WHILE DRIVING HOME AFTER A ROAD TRIP ON THE HIGHWAY (IN THE LEFT FAST LANE) MY CAR SUDDENLY LOST POWER AND WOULD NOT ACCELERATE WHEN PRESSING ON THE ACCELERATOR. THE \"ECP\" WARNING LIGHT CAME ON AND I HAD TO EASE THE CAR TO A STOP ON THE LEFT SHOULDER. AFTER ABOUT 5+ MINUTES, I WAS ABLE TO START THE CAR AGAIN AND MOVE IT OVER TO THE RIGHT-HAND LANE WHEN THE CAR STUTTERED AND SHUT OFF AGAIN.  THIS TIME I WAS ON THE RIGHT SHOULDER.  AFTER ANOTHER FEW MINUTES, I WAS ABLE TO START THE CAR AGAIN AND CALLED AHEAD TO TAKE IT IN THE NEAREST AUDI DEALERSHIP (IN THE TOWN I WAS RETURNING HOME FROM).  THE CAR HAD SEEMED A LITTLE HESITANT TO START. THE NEXT DAY (JUST BEFORE CLOSING), THAT AUDI DEALERSHIP'S DIAGNOSTIC TESTS DETERMINED THE ERROR CODE TO BE '2043758/8 PUNCH 2 & 3' WHICH REQUIRED REPLACEMENT OF THE FUEL PUMP.  FOUR PARTS NEEDED: FUEL PUMP, CAP, WASHER AND 'REPAIR SET'.  SINCE THIS DEALERSHIP COULDN'T EXPLAIN WHAT THE 'REPAIR SET' WAS NEEDED FOR - THE MOST EXPENSIVE PART - I CALLED OTHER AUDI DEALERSHIPS AND SEARCHED THE INTERNET FOR INFORMATION. NO OTHER SOURCE MENTIONED A 'REPAIR SET'.  ALSO, ALL BUT ONE OTHER PARTS DEPARTMENT SAID THAT THE FUEL PUMP PART WAS BACKORDERED BY 1-2 WEEKS DUE TO MANY RECENT ISSUES WITH THE THIS PART. SINCE IT SEEMED THAT I WAS BEING TAKEN ADVANTAGE OF BY THAT FIRST DEALERSHIP, I PURCHASED THE 3 PARTS (PUMP, CAP & WASHER) AT THE ONLY AUDI DEALERSHIP THAT SEEMED TO HAVE THE PUMP (ABOUT AN HOUR AWAY FROM MY HOME TOWN) AND MADE A SERVICE APPOINTMENT AT ANOTHER DEALERSHIP NEAR THE TOWN I WAS VISITING. A CONVOLUTED PROCESS TO GET MY Q5 FIXED BUT DUE TO THE NUMBER OF REPORTED ISSUES WITH THE FUEL PUMP ACCORDING TO THE AUDI MECHANIC, THERE IS A PROBLEM WITH THE AUDI FUEL PUMP IN ADDITION TO FUEL PUMP FLANGE RECALL.",
        "vin": "WA1LFAFP8EA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104767,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE JUST BEEN TOLD TODAY THAT AUDI PREVIOUSLY ISSUED A RECALL, THEIR NUMBER 19M1, FOR THESE CARS INCLUDING MY CAR (2.0T ENGINE) TO REPROGRAM THE AUXILIARY COOLANT PUMP TO PREVENT FIRES. ALTHOUGH I HAVE HAD THE CAR MAINTAINED BY AUDI, AND HAVE HAD OTHER RECALLS PERFORMED BEFORE AND AFTER THIS PERIOD, I HAVE NEVER RECEIVED THIS RECALL NOTICE FROM AUDI. MY CONCERN IS THAT THERE ARE RECALLS THAT ARE APPARENTLY NOT BEING SENT OUT.   I'VE NEVER HAD THIS RECALL MENTIONED BY ANY DEALERSHIP WHILE I WAS THERE FOR OTHER PURPOSES, EITHER.   AUDI HAS ISSUED A NEW SECOND RECALL STATING THAT THE ENTIRE PUMP WILL NEED TO BE REPLACED BUT THEY ARE DRAGGING THEIR HEELS, CLAIMING IT WILL BE MORE THAN SIX MONTHS (2019) BEFORE THEY HAVE ANY IDEA OF A PROGRAM TO ADDRESS THE ISSUE. SIX MONTHS TO ACT ON A FIRE DANGER IS ARGUABLY IRRESPONSIBLE.",
        "vin": "WA1LFAFP6EA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104529,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PAUL MILLER AUDI (179 US-46, PARSIPPANY, NJ 07054, (973) 575-7750) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LFAFPXEA"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/18/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102721,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI Q5 DURING AFTERNOON HR'S DRIVING FROM WORK 30 MILES AND OUTSIDE TEMPERATURE 95F, INSIDE MAINTAINING TEMPERATURE AROUND 65F COOL RUNNING, AT LEFT TURN SIGNAL ABOUT TO TURN LEFT ENGINE STOOPED  AND STEERING WHEEL  LOCKED . IT'S STRUCK IN ROAD ABOUT 45 MIN AND WHEN TRIED TO START IT'S UNABLE TO START. LATER AFTER 45 MINUTES WHEN TRIED IT STARTED AND ABLE TO PULL TO PARKING LOT. ONCE I STOPPED AND START AT PARKING LOT SAME ISSUE ENGINE STOOPED ITSELF , WAITED FOR 30 MINUTES THAN TRY TO START IT STARTED - I DROVE IN PARKING LOT FOR FEW YARDS AGAIN ENGINE STOOPED AND STEERING WHILE LOCKED. I TOWED TO AUDI SHOWROOM. SHOWROOM SERVICE  SAYING IT'S WORKING FINE NO ISSUES.    THE ONLY MY CONCERN IS THAT IF IT'S HAPPEN IN FREEWAY @ SPEED 60 MPH ENGINE STOPS THAN THINK ABOUT THE CONDITION OF ACCIDENT.     LIGHT INDICATOR ON THE VEHICLE IS SHOWING ECC.    MILES ON VEHICLE : 55K",
        "vin": "WA1LFAFPXEA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11098474,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION ON A HIGHWAY WITH MY PANORAMIC MOONROOF OPEN COMPLETELY. I WAS TRAVELING IN A SAFE SPEED, NO SPEED BUMPS OR POT HOLES, NO UNDERPASSES, AND NO TRAFFIC WHEN SUDDENLY MY MOONROOF GLASS POPPED AND SHATTERED EVERYWHERE. NEXT THING I KNOW, I AM GETTING A FACE FULL OF GLASS AND MY ENTIRE BACK SEAT IS COVERED IN GLASS.  I HAVE SUSTAINED MICRO SCRATCHES FROM THE BROKEN GLASS ALL OVER MY CAR AND IT WAS UNDRIVEABLE AS I FEARED ALL THE GLASS CONTINUING TO FLY IN MY FACE. THANK GOD I WAS ALONE. I HAVE DONE MY RESEARCH AND REALIZED THAT THIS IS A RECOGNIZABLE SAFETY CONCERN WITH MY VEHICLE MAKE AND MODEL AROUND THE WORLD, BUT AUDI WILL NOT RECOGNIZE AS A SAFETY RECALL ISSUE.  I'M JUST GLAD MY MOONROOF WAS NOT CLOSED AND ABOVE MY HEAD AS I PROBABLY COULD HAVE BEEN BADLY CUT AND THANK GOD I HAD NO PASSENGERS LIKE I NORMALLY DO AND PREVENTED THOSE INJURIES AS WELL.  MY CAR IS NOW SITTING COVERED IN GLASS AS IF I WAS IN A HORRENDOUS CAR ACCIDENT WAITING FOR THE MANUFACTURE TO REPAIR THE ISSUE.",
        "vin": "WA1LFAFP3EA"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11096476,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 AUDI Q5. THE CONTACT STATED THAT THE VEHICLE WAS STRUCK BY ANOTHER VEHICLE ON THE REAR PASSENGER SIDE BUMPER. THE CONTACT'S VEHICLE ROLLED OVER SEVERAL TIMES AND THE AIR BAGS FAILED TO DEPLOY. THE CONTACT AND FRONT PASSENGER WERE INJURED AND TRANSPORTED TO THE HOSPITAL. THE DRIVER OF THE OTHER VEHICLE WAS ALSO INJURED, BUT IS WAS UNKNOWN IF MEDICAL ATTENTION WAS RECEIVED. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE DEALER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 41,296. *TT",
        "vin": "WA1LFAFP3EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096643,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS ~30000 MILES. DROVE IT FOR 120 MILES, TURNED CAR OFF AT REST STOP. STARTED CAR AND AN ERROR INDICATOR \"STEERING DEFECTIVE, DO NOT DRIVE\" APPEARED. STEERING WHEEL WOULD NOT TURN. REPAIR SHOP DIAGNOSED THE PROBLEM AS A FAILED STEERING ASSEMBLY AND NOTED THAT THIS ISSUE WAS A RECALL ITEM ON THE AUDI SQ5 BUT NOT ON THE STANDARD Q5. THEY EXPLAINED THAT IF I WERE DRIVING THE VEHICLE AT THE TIME OF THE FAILURE THAT IT WOULD HAVE BEEN VERY DIFFICULT TO STEER THE CAR TO SAFETY. CALLED AUDI AND EXPLAINED THE PROBLEM AND THEY SAID AUDI COULD NOT ASSIST OR COMMENT ON THE FAILURE SINCE THE VEHICLE WAS NO LONGER UNDER THE MANUFACTURE WARRANTY.",
        "vin": "WA1LFAFP7EA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PARTICULATE SENSOR (PARTICLE SENSOR LAMBDA DPF DIESEL AUDI A4 B9 A6 A7 A8 Q5 Q7 4G0906261B) IN THE DIESEL PARTICULATE FILTER (DPF) FILTER FAILED AT 56K MILES, 4 YEARS INTO THE LIFE OF THIS VEHICLE. THIS IS A $500 (APROX) PART, AND IT IS RELATED TO THE DIESEL EMISSIONS CONTROL SYSTEM, WHICH IS NOT YET PATCHED UNDER THE VW TDI PROGRAM. I AM BEING TOLD BY THE SERVICE THAT I CANNOT DRIVE THIS CAR UNTIL SENSOR IS REPLACED, AND THERE IS NO WARRANTY COVERAGE.",
        "vin": "WA1CMBFP5EA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078578,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A TDI. THE CAR HAS 53,000-MILES ON THE ODOMETER. THE CAR WAS PURCHASED NEW AND ONLY SERVICED BY THE LOCAL AUDI DEALERSHIP.   WHILE OPERATING UNDER NORMAL DRIVING CONDITIONS WITH THE \"AUTO STOP/START\" ENGAGED, THE CAR'S TRANSMISSION SLIPS INTO NEUTRAL WHEN STOPPED AND WHILE CRUISING, THE OCCURRENCE IS VERY INTERMITTENT. WHEN STOPPED, TO RE-ENGAGE THE TRANSMISSION, YOU MUST USE THE BRAKE (TO PREVENT ROLLING) AND MANIPULATE THE TRANSMISSION LEVER BETWEEN NEUTRAL, DRIVE AND SPORT SETTING. WHEN DRIVING, YOU MUST MANIPULATE THE TRANSMISSION LEVER BETWEEN NEUTRAL, DRIVE AND SPORT SETTING. THIS HAS BEEN OCCURRING ON CITY STREETS SINCE ABOUT 52,000-MILES (THREE-MONTHS AGO). CONCERNED ABOUT MY SAFETY!",
        "vin": "WA1CMBFP1EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/02/2018",
        "dateOfIncident": "10/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PUSH TO START BUTTON MATERIAL IS FLAKING OFF AND THE SHARP EDGES LEFT CUT MY FINGER REPEATEDLY. SERVICE TO REPLACE BUTTON IS $200+.",
        "vin": "WA1LFAFP3EA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063274,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRL (DAYTIME RUNNING LIGHTS) BURN OUT PREMATURELY.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5. WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL SEIZED WITHOUT WARNING. THE CONTACT STATED THAT THE FAILURE ONLY OCCURRED IN THE WINTER MONTHS. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (RAY CATENA AUDI TOMS RIVER EAST, 325 NJ-37, TOMS RIVER, NJ 08753), BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 48,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057997,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 AUDI Q5 3L TURBO DIESEL WOULD NOT START ON JAN 1.  VEHICLE HAD \"AUX HEATER \" RECALL PERFORMED BY DEALER WITHIN THE PRIOR WEEK.  AS THE OUTSIDE TEMPERATURE WAS FRIGID (CAR INDICATED BELOW 8F) SUSPECT DIESEL 'WAXING' MAY BE CONTRIBUTORY FACTOR.  TOWING COMPANY SUGGEST THIS IS A KNOWN ISSUE, AND OWNER MESSAGE BOARDS SUGGEST SIMILAR, BUT AUDI ARE VERY DELIBERATE IN NOT ANSWERING QUESTION.  SERVICE DEPARTMENT REP WHEN ASKED STATES THERE IS NO DIESEL ADDITIVE REQUIRED FOR SUCH COLD WEATHER AND THEY HAVE NEVER PERSONALLY SEEN DIESEL WAXING WITH AUDI. VEHICLE HAS BEEN AUDI DEALER SERVICED AT PRESCRIBED INTERVALS FROM NEW.  TRIED THE VEHICLE MULTIPLE TIMES AND EVEN IN TEMPERATURES OF 12-20F VEHICLE SUBSEQUENTLY DID NOT START - ENGINE AND BATTERY WARNING LIGHTS REMAINING ILLUMINATED. THE KEYFOB WOULD ALSO NOT RELEASE AS THE VEHICLE  'THOUGHT' THE IGNITION WAS 'ON' AND REQUESTED IT BE TURNED OFF BEFORE LEAVING VEHICLE WHICH WAS NOT POSSIBLE, THUS FURTHER DRAINING BATTERY. GIVEN THAT AUDI APPEAR TO HAVE A PREVALENT 'DON'T ASK, DON'T TELL' CULTURE ON POTENTIAL PROBLEMS AM REPORTING THIS INCIDENT SO THAT OCCURRENCE DATA MAY BE INDEPENDENTLY ANALYZED AND VERIFIED.",
        "vin": "WA1CMAFP7EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041501,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING MY CAR THE ENGINE MAKES A LOUD RATTLING NOISE.",
        "vin": "WA1DGAFP2EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006603,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEF PUMP IS BAD ON MY AUDI Q5 WITH 65K ON IT.  THE TECH AT THE DEALER REPORTED THAT THESE PUMPS ALL SEEM TO GO ON THESE TDIS AROUND THE SAME MILEAGE.  I FIND IT OBJECTIONABLE TO HAVE TO PAY $1,445 TO REPLACE A PUMP ON A VEHICLE THAT DOESN'T MEET CURRENT EMISSION REQUIREMENTS.",
        "vin": "WA1CMAFP4EA"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/11/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994353,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 AUDI Q5, HEADLIGHT LENSES CRAZING/FROSTING FROM THE INSIDE.  THIS IS NOT WATER MOISTURE, THIS IS A DEFECT IN THE LENS MATERIAL.  THE CRAZING/FROSTING OF THE LENS DECREASES LIGHT OUTPUT AND SCATTERS THE LIGHT TO WHERE IT AFFECTS ONCOMING DRIVERS.",
        "vin": "WA1CFBFP3EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "03/07/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967403,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA  RECALL   MILDEW ODOR RESULTING FROM WATER LEAKING IN",
        "vin": "WA1DGAFP4EA"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/11/2017",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954003,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR SURFACE OF HEADLIGHT ASSEMBLY COVERS (LENSES) SHOWED SIGNIFICANT PITTING AND HAZING, AS IF IT HAD BEEN SANDBLASTED, RESULTING IN REPLACEMENT UNDER WARRANTY BECAUSE THE PLASTIC HAD DEGRADED ENOUGH TO REDUCE VISION FROM HEADLIGHTS. THESE ARE SEALED ASSEMBLIES AND THERE WAS NO EXTERIOR DAMAGE. MY SUSPICION IS THAT THE UV GENERATED BY THE LED HEADLIGHT PROJECTORS IS SO HIGH THAT IT IS ATTACKING THE INTERNAL SURFACE OF THE PLASTIC. DEALER REMARKED THAT THEY HAD SEEN \"A NUMBER\" OF THESE. Q7 OWNERS WITH SIMILAR LED HEADLAMPS HAVE ALSO HAD THIS PROBLEM. PROBLEM IS ONLY REALLY VISIBLE TO OWNER IF THE HEADLIGHTS ARE ON, AND THE OWNER HAPPENS TO BE LOOKING AT THE HEADLIGHT ASSEMBLY WHILE NOT DRIVING.",
        "vin": "WA1LFAFP6EA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "01/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905130,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIPER PULLS BACK WATER TO THE WINDSCREEN THAT IMPACTS VISIBILITY CAUSING A SAFETY HAZARD. THE CAR WAS TAKEN TO THE DEALER AND VIDES WERE SHOWN. BRAND NEW WIPER BLADES WERE INSTALLED AT THE COST OF $80. THE PROBLEM CONTINUES. DEALER STATES THAT IT IS BY DESIGN. HAVE DRIVEN SEVERAL Q5'S AND SUCH A SAFETY HAZARD IS DEFINITELY NOT BY DESIGN. VIDEOS ARE POSTED ON THE AUDI FACEBOOK PAGE. NO RESPONSE OR ATTEMPT TO FIX THE ISSUE.",
        "vin": "WA1LFAFP8EA"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "11/22/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806326,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNIVERSAL JOINTS RUBBING AND NEED TO BE REPLACED. COMMON PROBLEM APPARENTLY AND NO RECALL BY AUDI. PAYING OVER $800 FOR THIS REPAIR. POWER STEERING IMPAIRED   04/27/18*JB  *TR",
        "vin": "WA1LFAFP5EA"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679163,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 AUDI Q5.  CONSUMER WRITES IN REGARDS TO VEHICLE ARM REST ISSUES.  *SMD  THE CONSUMER STATED THE ARMREST DOES NOT LOCK IN POSITION AND SLIDES OVER THE CUP HOLDER WHEN MOVED TO THE FORWARD POSITION.  THE CONSUMER STATED IF THERE IS A CONTAINER OF HOT LIQUID IN THE CUP HOLDER AND SOMEONE LEANS ON THE ARMREST, IT EASILY SLIDES FORWARD AND PUSHED INTO THE CONTAINER WHICH COULD CAUSE THE HOT LIQUID IN ALL DIRECTIONS.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/16/2014",
        "dateOfIncident": "10/23/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664729,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS HAPPENED NOW SEVERAL TIMES, WHEN THE CAR COMES TO A COMPLETE STOP OR JUST ABOUT A COMPLETE STOP, THEN TRYING TO ACCELERATE THERE IS NO THROTTLE RESPONSE INSTEAD OF ACCELERATING AS EXPECTED. IS THE ABS SYSTEM CUTTING POWER TO THE ENGINE?  THE CAR IS 'DEAD' FOR ABOUT TWO SECONDS AND THEN POWER IS RESTORED.  I WAS ALMOST HIT BY ONCOMING TRAFFIC. REPORTEDLY, THIS IS APPARENTLY WIDELY DOCUMENTED AND ONGOING SINCE AT LEAST THE YEAR 2000, AND NOT SPECIFIC TO AUDI...WHAT IS THE NHTSA DOING ABOUT THIS???  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2014",
        "dateOfIncident": "11/08/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653600,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE ON HAWTHORNE BOULEVARD CLOSE TO TORRANCE BOULEVARD LESS THAN A MILE AWAY FROM AUDI DEALERSHIP WHEN THE CAR START TO SHAKE AND ALMOST GOT REAR ENDED. I WAS ABLE TO PULL ASIDE AND AFTER FEW SECONDS THE ENGINE WAS WORKING FINE BUT A MESSAGE ON THE BOARD MENTIONING THE AUTO STOP START FUNCTION WAS NOT WORKING PROPERLY AND THE ASSOCIATED SYMBOL TURNED ON  THE DASH. I TOOK THE CAR TO AUDI DEALERSHIP AND THEY CONFIRM THAT THE FUEL PUMP NEEDS TO BE REPLACED.  *TR",
        "vin": "WA1CMAFP7EA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/09/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643647,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS AND PADS NEEDED TO BE REPLACED AT 18,000 KM , WE WERE TOLD THAT THE PROBLEM WAS THAT WE WERE USING CRUISE CONTROL AND THAT WORE OUT THE BRAKES . BRAKES WE PULSATING AND GRINDING . INSPECTION REVEALED THAT THE ROTORS WERE HOT SPOTTED AND A LOT OF MATERIAL WORN OFF THE ROTORS AND PADS . WE ARE NOT AGGRESSIVE DRIVERS AND TREATED THE CAR WITH UTMOST RESPECT . AUDI MADE US PAY FOR NEW ROTORS AND PADS . AUDI SAID IT WAS NOT COVERED UNDER WARRANTY . I DRIVE A GM THAT HAS NEVER NEEDED BRAKES BEFORE 100,000 KM .AUDI NAILED US FOR 400.00 FOR 2 ROTORS AND PADS .  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2014",
        "dateOfIncident": "08/29/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637126,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS BRAND NEW AUDI Q5 I PURCHASED ROUGHLY A MONTH EARLIER.    WHILE DRIVING ON THE FREEWAY, MULTIPLE CARS BEGAN HONKING AND WAVING AT US. I PULLED OFF THE FREEWAY AND WAS NOTIFIED THAT BLACK SOME WAS APPEARING FROM THE REAR OF THE VEHICLE.     I NOTIFIED THE MANUFACTURER OF THE ISSUE AND THEY TOWED THE CAR TO THE NEAREST DEALERSHIP FOR SERVICE. THE SERVICE CREW DID CONFIRM AN ISSUE WITH THE ENGINE. A WEEP HOLE WAS FOUND ON SIDE OF TRANSMISSIONS THAT WAS LEAKING OIL WHICH CAUSED BLACK SMOKE TO APPEAR FROM THE ENGINE. THE SERVICE TEAM ENDED UP REPLACING THE ENTIRE TRANSMISSION.  *TR",
        "vin": "WA1LFAFP7EA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "06/13/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598564,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK LEAK. WENT FOR A NORMAL UNEVENTFUL DRIVE FROM HOWARD COUNTY MARYLAND TO VIRGINIA SUBURBS AND CAME HOME BACK AND PARKED IN THE GARAGE ON FRIDAY THE 13TH!. WOKE UP IN THE MORNING TO A GARAGE THAT SMELLED VERY HEAVILY LIKE GAS. LOOKED BELOW THE AUDI Q5 AND SAW A SMALL PUDDLE OF GAS. PARKED THE CAR OUTSIDE THE GARAGE AND CALLED THE DEALERSHIP.  THEY ADVISED THAT THIS COULD BE A SAFETY HAZARD AND ASKED TO CALL AUDI ROADSIDE ASSISTANCE FOR A TOW TO THE DEALERSHIP. AUDI ROADSIDE ASSISTANCE ASKED ME TO CALL THE LOCAL FIRE DEPARTMENT TO MAKE SURE IT IS NOT A FIRE HAZARD. THE VEHICLE WAS THEN TOWED AFTER THE LOCAL FIRE DEPT. MADE SURE THIS IS NOT A FIRE HAZARD WHILE BEING TOWED. THE DEALERSHIP CALLED ME TODAY (MONDAY THE 16TH OF JULY 2014) TO TELL ME THAT THE GAS TANK WAS HIT BY SOME ROAD DEBRIS AND ALSO MENTIONED THAT THERE ARE SOME SCRATCHES IN THE FUEL TANK AND WAS NOT SURE WHY THE LEAK IS OCCURRING. EVEN THOUGH THE BRAND NEW Q5 IS JUST 2 WEEKS OLD, THE REPAIRS WILL NOT BE COVERED UNDER WARRANTY AND ITS APPROX. $5,000 TO FIX THE ISSUE. I HAVE CALLED AUDI CUSTOMER SERVICE AND WAITING TO HEAR FROM THEM AT THIS TIME. I'M ALSO FILING THE COMPLAINT HERE SINCE THIS ISSUE SEEMS LIKE A SIGNIFICANT SAFETY CONCERN. HOW COULD A LEISURELY UNEVENTFUL DRIVE IN A BRAND NEW SUV ON THE FREEWAY LEAD TO THE FUEL TANK BEING RUPTURED OR CRACKED FROM ROAD DEBRIS!  THIS JUST DOES NOT SEEM RIGHT. SINCE IT WAS PARKED OVERNIGHT IN A CLOSED GARAGE I WAS ABLE TO FIND THE ISSUE. I'M WORRIED THAT THERE MAY BE OTHERS PARKED IN THE ROAD THAT MAY NOT FIND THE ISSUE AND COULD CAUSE A FIRE WHILE ON THE MOVE OR IT COULD BURN DOWN THE HOUSE IF PARKED IN A CLOSED GARAGE FOR EXTENDED PERIOD OF TIME.   *TR",
        "vin": "WA1LFAFP9EA"
    },
    {
        "components": "VISIBILITY,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "12/17/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593742,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2014 AUDI Q5. THE CONTACT STATED THAT THE VEHICLE WAS EQUIPPED WITH AN AUTO START/ STOP FUNCTION. WHILE DRIVING FROM A COMPLETE STOP THE VEHICLE ROLLED BACKWARDS WHEN THE ACCELERATOR PEDAL WAS ENGAGED. THE AUTO/STOP FAILED TO OPERATE PROPERLY. THE CONTACT RESTARTED THE VEHICLE AND RESUMED IN OPERATION. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO WAS UNABLE TO DUPLICATE THE FAILURE. IN ADDITION, THE WINDSHIELD WASHER FLUID SENSOR WAS FAULTY. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,000.",
        "vin": "WA1CMAFP6EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575950,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q5.  THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THE STEERING WHEEL WOULD NOT EXHIBIT ANY RESISTANCE AND DID NOT ADJUST TO THE SPEED OF THE VEHICLE.  THE VEHICLE WAS TAKEN TO THE DEALER, WAS UNABLE TO DIAGNOSE THE FAILURE.  THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM.  THE APPROXIMATE FAILURE MILEAGE WAS 5,000.",
        "vin": "WA1LFAFP6EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "12/31/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568573,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BEEN REPAIRED BY AUDI FOR A SIMILAR ISSUE. REPORTING AGAIN, BECAUSE DEALER COMPLETELY REPLACED AUDI \"ELECTROMECHANICAL STEERING UNIT\". VEHICLE STEERING LOCKED UP HARD, REQUIRING VERY LARGE AMOUNT OF FORCE TO TURN EVEN A FEW DEGREES. MESSAGE ON A DISPLAY \"STEERING IS DEFECTIVE\". VEHICLE HAS BEEN REPAIRED BY AUDI FOR A SIMILAR ISSUE JUST ON 23 OCT 2013. REPORTING AGAIN AS A NEW ISSUE, BECAUSE DEALER HAS COMPLETELY REPLACED AUDI \"ELECTROMECHANICAL STEERING UNIT\" AND OTHER PARTS.  *TR",
        "vin": "WA1CGAFP5EA"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/09/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568063,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE THIRD INCIDENT WHERE THE CAR CAME TO A STOP, WITH NO THROTTLE RESPONSE, WHEN I MADE A HARD LEFT TURN (U-TURN FROM A STANDING STOP) INSTEAD OF ACCELERATING AS EXPECTED.    THERE APPEAR TO BE SEVERAL THOUSAND SIMILAR COMPLAINTS IN YOUR DATABASE, FROM MANY DIFFERENT MAKES, WHERE THE ABS SYSTEM CUTS POWER TO THE ENGINE INSTEAD OF ALLOWING A RAPID ACCELERATION FROM A STANDING START, WHEN THERE IS NO TRACTION PROBLEM, AND CUTTING THE POWER CREATES AN IMMEDIATE RISK OF CRASH BY ONCOMING TRAFFIC.    THE CAR WAS 'DEAD' FOR ABOUT TWO SECONDS AND THEN POWER WAS RESTORED, ALLOWING ME TO AVOID BEING HIT BY ONCOMING TRAFFIC. BUT THE BIGGER ISSUE APPEARS TO BE THAT THE ABS SYSTEM WILL SOMETIMES CUT POWER FOR NO REASON, ENDANGERING THE DRIVER AND VEHICLE. THIS IS APPARENTLY WIDELY DOCUMENTED AND ONGOING SINCE AT LEAST THE YEAR 2000, AND NOT SPECIFIC TO AUDI.  UPDATED 3/20/14*LJ      UPDATED 03/20/2014  *JS",
        "vin": "WA1LFAFP6EA"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "11/05/2013",
        "dateOfIncident": "11/04/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550913,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS MAKING A LEFT TURN.  THE DRIVERS SIDE MIRROR BLINDED MY VIEW OF THE CAR WAITING AT THE STOP SIGN OF THE ROAD I WAS ENTERING. MY CAR CLIPPED THE OTHER CAR.  *TR",
        "vin": ""
    }
]