[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399328,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 AUDI S4 HAS A EPC LIGHT THAT KEEPS TURNING ON WHILE DRIVING THAT CAR. THE EPC LIGHT WILL PUT THE CAR INTO LIMP MODE AND WILL HAVE A ROUGH IDLE AND CAN BARLEY DRIVE. WHEN THAT LIGHT TURNS ON YOU HAVE TO PULL OVER IMMEDIATELY AND RESTART THE CAR TO CONTINUE DRIVING AND IS A COMPLETE SAFETY HAZARD BECAUSE IT WILL HAPPEN WHEN YOU ARE ON THE FREEWAY. THE LIGHT MAINLY TURNS ON WHEN YOU ARE TRYING TO GET UP TO SPEEDS OF THE FLOW OF TRAFFIC. I HAVE TAKEN IT TO THE DEALER MANY TIMES TO GET THIS ISSUE RESOLVED AND THEY KEEP SAYING THERE IS NO ISSUE WITH THE CAR WHAT'S SO EVER. I DECIDED TO TRY TO FIGURE OUT WHAT WAS WRONG WITH THE CAR MYSELF BECAUSE THE DEALER WAS NO  HELP. WHEN I LOOK IT UP HUNDREDS OF FORUMS SHOW UP TALKING ABOUT IT AND NO ONE CAN FIGURE OUT WHAT IS GOING ON WITH THE CAR AND EVERYONE IS HAVING THE SAME ISSUE AND HOW THE DEALER IS NO HELP AT ALL. ONE PERSON SAID THEY TOOK IT TO THE DEALER AND THERE WAS A FAULTY WIRE ON THE ECU. I THINK ITS THE ECU FAILING AND DOESN'T KNOW WHAT TO DO.",
        "vin": "WAUBGAFLXEA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/26/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376444,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXHIBITS \"NOTCHY\" STEERING AT HIGHWAY SPEEDS, PARTICULARLY IN COLD WEATHER. AT OR ABOVE APPROXIMATELY 55 MPH, THE STEERING WHEEL TRIES TO \"BOUNCE\" LEFT AND RIGHT RATHER THAN MAINTAINING CENTER--EVEN WHEN TRAVELING ON A STRAIGHT, FRESHLY-PAVED SECTION OF INTERSTATE. THE DRIVER HAS TO CONSTANTLY ADJUST THE WHEEL TO KEEP THE CAR TRAVELING STRAIGHT. THE STEERING FUNCTIONS NORMALLY OTHERWISE, AND THE PROBLEM DOES NOT MANIFEST ITSELF AT LOW SPEEDS. I BEGAN TO NOTICE THE PROBLEM AROUND AUGUST OF 2020. OTHER OWNERS OF THE SAME VEHICLE HAVE REPORTED SIMILAR PROBLEMS:  HTTPS://WWW.AUDIZINE.COM/FORUM/SHOWTHREAD.PHP/690756-NOTCHY-STEERING.",
        "vin": "WAUBGAFL9EA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328789,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ENCOUNTERED THE PROBLEM OF AIR BUBBLE FORMATION IN MY FUEL SYSTEM (CODE 16903) WHEN READING CODES IN MY CAR. I THOUGHT IT WAS JUST A FUEL PUMP ISSUE SO I REPLACED IT. I THEN REALIZED IT WASN'T JUST A PUMP ISSUE AS THE CAR KEPT READING THOSE CODES AND KEPT STOPPING. I TALKED TO A LOCAL AUDI DEALERSHIP AND SAID I WOULD HAVE TO GET THE FUEL PUMP VAPOR EXTENSION. WHEN ASKED THEY SAID THAT IT'S ONLY A TSB NOT A RECALL DUE TO IT NOT BEING A SAFETY ISSUE. NOW YOU TELL ME, MY CAR WENT INTO LIMP MODE AND  STOPPED ONCE IN THE MIDDLE OF THE HIGHWAY, AND 3 TIMES IN THE MIDDLE OF TRAFFIC 2 WEEKS LATER. I BELIEVE IT'S A SAFETY PROBLEM AS ANYONE COULD'VE RAN INTO ME AND CAUSED BIGGER PROBLEMS. I DON'T THINK I SHOULD PAY 800 DOLLARS FOR MY SAFETY. THAT PIECE SHOULD'VE BEEN INCLUDED IN THE FUEL PUMP ASSEMBLY FROM THE BEGINNING. FROM MY PERSPECTIVE AND THE EVENTS THAT UNFOLDED, THIS IS A SAFETY PROBLEM AND MY CAR NEEDS TO BE FIXED ACCORDINGLY.",
        "vin": "WAUBGAFL0EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315652,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, STEERING CAN BECOME NOTCHY. STEERING INPUTS ARE NOT ALWAYS 100% TRANSFERRED TO THE FRONT WHEELS. THERE CAN BE A \"DEAD SPOT\" IN THE STEERING. THE CAR DOES NOT ALWAYS FOLLOW THE INTENDED PATH. THE PROBLEM COMES AND GOES, AND SEEMS TO BE EXACERBATED IN COLDER WEATHER.",
        "vin": "WAUBGAFL2EA"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220686,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 75MPH, UPHILL, IN 100F WEATHER THE FUEL LOW PRESSURE FUEL SYSTEM DEVELOPED A VAPOR BUBBLE THAT STALLED THE LOW PRESSURE FUEL PUMP AND STARVED THE MOTOR FOR FUEL.  THE CAR STALLED ON THE FREEWAY AND WOULD INTERMITTENTLY RESTART UNTIL THE LOW PRESSURE FUEL PUMP FAILED.  THE REPAIR REQUIRED ADDITIONAL VALVES AND HOSES HE ADDED TO THE LOW PRESSURE FUEL SYSTEM TO COMPENSATE FOR THE POOR VAPOR MANAGEMENT DESIGN.    THE CAR HAD TO BE TOWED TO A DEALERSHIP WHERE THE APPROPRIATE FIX AND TSB WAS EXECUTED.  TOTAL COST WAS ~$2200, $715 OF THAT TOTAL COST WERE THE NEW VALVES AND HOSES THAT SHOULD HAVE BEEN PART OF THE INITIAL DESIGN.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "12/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164618,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG OFF INDICATOR LIGHT IS ON. CHECKED WITH AUDI AND THEY ARE SAYING THE PASSENGER OCCUPANT DETECTION SYSTEM NEEDS TO BE REPLACED.  EAXCT SAME ISSUE AS THE AUDI RECALL 74D5",
        "vin": "WAUBGAFL5EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "07/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123120,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE MOUNTS HAVE GONE BAD. THE DEALERSHIP SAYS THEY ARE LEAKING AND THUS HAVE FAILED. THIS IS A KNOWN ISSUE WITH THIS MODEL AND SEVERAL OTHER MODELS. THE ENGINE MOUNTS FAIL AT AROUND 50000 MILES. I'VE NEVER HEARD OF ENGINE MOUNTS GOING BAD THIS EARLY IN A CARS LIFE. MAYBE AFTER 100000 MILES I WOULD EXPECT FOR THE ENGINE MOUNTS TO FAIL BUT NOT AT 50000 MILES. MANY AUDI OWNERS HAVE COMPLAINED ABOUT THIS ISSUE ON FORUMS AND AUDI GROUPS ONLINE. THIS IS A SAFETY ISSUE AND AUDI IS NOT DOING ANYTHING ABOUT THIS. THEY ARE LEAVING THEIR CUSTOMERS TO FIX A PROBLEM WHICH SHOULD NOT EXIST.",
        "vin": "WAUKGAFL1EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2018",
        "dateOfIncident": "05/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096865,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CARBON BUILD UP",
        "vin": "WAUBGAFL3EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "12/14/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937935,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2014 AUDI S4 ON THE HIGHWAY AND IN TURNS, THE STEERING GOES FROM FEELING TIGHT TO VERY LIGHT AND BACK TO TIGHT AGAIN WITHIN A MATTER OF SPLIT SECONDS.  THIS CAUSES DRIFTING ON THE HIGHWAY AND WHEN CORNERING BECAUSE YOU'RE COMPENSATING FOR THE LACK OF FEELING FOR AN INSTANT AND USING MORE INPUT THAN YOU  SHOULD, THEN THE STEERING GETS TIGHT AGAIN AND YOUR CAR STEERS MORE THAN  IT SHOULD HAVE.  NOTE THAT THE CAR GOES STRAIGHT WHEN HANDS ARE NOT ON THE WHEEL.  THIS IS MOST PREVALENT AT TIMES WHEN THE STEERING WHEEL IS IN THE STRAIGHT POSITION.  THIS SEEMS TO BE DUE TO  THE MOVEMENT OF THE STEERING WHEEL THAT HAPPENS UNDER THE FORCE OF THE DRIVERS HANDS AS THE STEERING ASSIST LEVEL FLUCTUATES.  THE CAR DOES NOT WANT TO STAY CENTERED WHEN GOING STRAIGHT AND HANDS ARE RESTING ON THE WHEEL.  THERE SEEMS TO BE EXCESSIVE ASSIST AT OR NEAR THE TOP DEAD CENTER.  NOTE THAT THIS IS AN INTERMITTENT ISSUE.  IT MIGHT BE DRIVING FINE, THEN I TURN OFF THE ENGINE TO FILL UP WITH GAS FOR EXAMPLE, RE-START THE ENGINE AND THE PROBLEM PRESENTS ITSELF.   I TOOK THE CAR TO MY LOCAL AUDI DEALER ON 14DEC2016 AT 42,430 MILES (THIS HAS BEEN HAPPENING SINCE I PURCHASED THE CAR WITH APPROX. 9,000 MILES) TO DIAGNOSE  THE ISSUE.  THE TECHNICIAN WHO TOOK IT FOR A TEST DRIVE COULD NOT REPRODUCE THE ISSUE ON THAT DAY NOR THE NEXT DAY FROM WHAT THEY TOLD ME.  THEY MENTION ON THEIR INVOICE THAT THEY SUSPECT IT COULD BE GROOVED ROADS CAUSING IT EVEN THOUGH I STRESSED TO THEM THAT THIS HAPPENS AT HIGH SPEEDS AND IS VERY DANGEROUS TO DRIVE.  I WAS FORCED NEARLY INTO A TRACTOR TRAILER ON THE HIGHWAY ONE DAY AND THAT SCARED ME ENOUGH TO FINALLY ADDRESS THIS ISSUE.  ALSO, I HAD DISCUSSED THE ISSUE WITH ANOTHER TECHNICIAN AT THE DEALER AND HE SAID THAT HE HAD A SIMILAR ISSUE WITH HIS 2013 AUDI S4 AND SOLD THE CAR BECAUSE OF THE STEERING PROBLEMS.  AUDI SAYS THE CAR IS FUNCTIONING NORMALLY.  *TR",
        "vin": "WAUBGAFL8EA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/15/2016",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916285,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, A SUDDEN BRAKE FOLLOWED BY A QUICK ACCELERATION LEADS TO BUCKING WITH ACCELERATION AND THE ENGINE REMAINING REVVED UP. WITH BRAKING, THE CAR LUNGES FORWARD. THE ONLY WAY TO CHANGE IT IS BY SHUTTING THE CAR OFF ENTIRELY. HAS OCCURRED AT LEAST 7 TIMES IN PASSED 2.5 YEARS. RESEARCH INDICATES A FAULTY MECHATRONICS UNIT, BUT 2 NY DEALERSHIPS CONTINUE TO STATE NO ISSUE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/15/2016",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916287,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PASSED 2.5 YEARS, THE HEATING SYSTEM SMELLS, BURNS MY EYES, GIVES ME A HEADACHE, AND MAKES ME NAUSEATED. REPEATED VISITS TO DIFFERENT AUDI DEALERSHIPS WITH NO CHANGE. ISSUE REMAINS, DEALERSHIPS STATE NO ISSUE. I WAS TOLD THAT EXHAUST IS PROBABLY ENTERING VIA THE AIR SYSTEM.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916288,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 2 ENGINE OIL LEAKS, IN 2.5 YEARS, I SMELLED GAS FUMES IN THE CABIN NUMEROUS TIMES, SCHEDULED AN APPT FOR A CHECK WITH THE WEST ISLIP NY AUDI DEALERSHIP. PICKED UP CAR FROM DEALERSHIP, WITH WORK ORDER AND SERVICE REP. SIMPLY STATING \"NO PROBLEM FOUND\" UNDER EACH OF MY 5 CONCERNS, WHICH TOLD ME THAT THEY DID NOT EVEN LOOK AT THE ISSUES. WITH EVERY WORK ORDER, WHICH ARE NUMEROUS ON THIS CAR, IT IS STATED WHAT WAS DONE, BUT NOT THIS \"SERVICE\". TWO DAYS AFTER PICKING UP MY VEHICLE, AUDI REPORTED A RECALL DUE TO GAS LEAKS IN THEIR VEHICLES. MY VEHICLE IS STILL UNDER LEASE AND WARRANTY, YET THIS DEALERSHIP TOOK IT UPON THEMSELVES TO IGNORE MY CONCERNS, WHICH COULD POTENTIALLY BE FATAL.? ABSOLUTELY NO INTEGRITY, AND LACKING ANY SENSE OF MORALS.",
        "vin": ""
    },
    {
        "components": "STEERING,EQUIPMENT ADAPTIVE/MOBILITY,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "02/11/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761528,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 AUDI S4 HAS DANGEROUS STEERING BEHAVIOR.  THE STEERING SLIPS AT THE CENTER POSITION, WILL NOT GO STRAIGHT ON THE HIGHWAY, AND REQUIRES CONSTANT STEERING INPUT.  THIS IS FURTHER EXACERBATED BY A CONSTANT NOTCHY FEELING AT ANY SPEED BETWEEN THE 10 AND 2 OCLOCK POSITION.  IT IS PARTICULARLY BAD IN LONG SWEEPING TURNS WHERE YOU CAN DISTINCTLY FEEL A NOTCH.  WHEN IN ONE OF THESE TURNS YOU WILL HAVE CONSTANT LINEAR STEERING FOLLOWED BY A NOTCH THAT WHEN SURPASSED RESULTS IN A LARGE STEERING INPUT WHICH IS UNEXPECTED AND DESTABILIZING TO THE VEHICLE IF AT HIGH SPEEDS.  THE PROBLEM IS WORSE DURING COLD TEMPERATURES.  THIS IS INTERMITTENT BUT REPEATABLE AND IS A KNOWN ISSUE ON ALL 2013+ S4 & S5 MODELS WITH THE ELECTRIC POWER STEERING.  AUDI SHOULD BE REQUIRED TO COME UP WITH A PERMANENT AND SAFE SOLUTION AS THIS IS VERY DANGEROUS.   ALSO, AUDIS DRIVER STEERING RECOMMENDATION (DSR) MAKES THE PROBLEM WORSE.  DSR IS AN ELECTRONIC PROGRAM THAT DETECTS WHEN THE CAR IS STARTING TO SKID AND THE STEERING'S ECU PROVIDES A PROMPT TO THE DRIVER TO CORRECT THE PROBLEM BY MAKING THE STEERING WHEEL MOVE SLIGHTLY (BUMP).  THIS I PARTICULARLY BAD IN WINTER DRIVING CONDITIONS IN WHICH THE CAR HAS LIMITED TRACTION DUE TO SNOW AND ICE AND RESULTS IN CONTINUOUS BUMPING OF THE STEERING WHEEL.  COMBINING DSR WITH THE STEERING SLIP + NOTCHY ISSUES RESULTS IN A VERY DANGEROUS STEERING SYSTEM WHICH NEEDS IMMEDIATE RESOLUTION.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "10/28/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747592,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES LIGHT CAME ON AND PADS ARE WORN AND ROTORS ARE WARPED AT ONLY 16,000 MILES.  HAD THE AUDI DEALER IN WESTLAKE VILLAGE, CALIFORNIA REPLACES BOTH PADS AND ROTORS.  SEVEN MONTHS AND 8,000 MILES LATER, WHILE DOING THE MAINTENANCE OIL CHANGE, A DIFFERENT AUDI DEALER IN WOODLAND HILLS, CA NOTIFIED THAT BRAKE PADS ARE WORN AT 4MM AND ROTORS ARE WARPED.    THIS WEAR OUT PATTERN IS BEYOND THE MINIMUM EXPECTATION OF THE LIFE OF THE BRAKES UNDER AVERAGE DRIVING CONDITION.  BRAKES PADS ARE WORN TOO SOON, AND I DON'T UNDERSTAND WHY THE ROTORS ARE ALSO WARPED AND NEEDED REPLACING TOO FREQUENT.  I LIVE IN SOUTHERN CALIFORNIA, WITH NORMAL DRIVING CONDITION, 60% FREEWAY AND 40% SURFACE STREET, I HAVE NEVER HAD BRAKES WORN OUT THIS QUICKLY IN ALL OF MY PREVIOUS 5 CARS.  AUDI DEALER AUTOMATICALLY BLAME MY DRIVING CONDITIONS AND SAID THIS IS A WEAR AND TEAR ITEM.  I FEEL THEY SOLD ME A DEFECTIVE PRODUCT AND THIS CAR IS A LEMON, BUT AUDI REFUSE TO TAKE IT BACK.",
        "vin": "WAUBGAFL1EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746892,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEPPED IN MY CAR TO GO OUT, STARTED CAR AS I PUSHED THE CLUTCH DOWN. CLUTCH PEDAL SNAPPED TO THE FLOOR.  CAR WAS TOWED TO DEALER. PART THAT FAILED WAS SLAVE CYLINDER. CAR ONLY HAS 12,200 MILES. CAR IS USED TO COMMUTE TO WORK AND BACK, NO UNUSUAL STRAIN OF ANY KIND ON THE CAR.    I WAS LUCKY THAT I WAS NOT DRIVING THE CAR WHEN THE CYLINDER FAILED. I WOULD BEEN UNABLE TO CHANGE GEARS TO SAFELY STOP THE CAR. PERHAPS I COULD HAVE PULLED IT OUT OF GEAR BUT I AM NOT SURE HOW I WOULD HAVE REACTED. MY COMMUTE TO WORK HAS ME TAKE A HIGHER WITH LOTS OF FAST MOVING CARS (RTE 17, NORTHER NJ). I COULD HAVE HIT THE BRAKES AND FORCE THE ENGINE TO STALL. IN THAT SCENARIO, I WOULD LOST POWER ASSISTED FUNCTIONS. THAT WOULD HAVE ALSO BEEN A VERY UNSAFE SITUATION.    CAR IS NOW AT THE DEALER AND IS EXPECTED TO BE THERE FOR ANOTHER WEEK OR SO. REPLACEMENT SLAVE CYLINDER IS ON BACK ORDER FROM GERMANY.     AGAIN, IN MY CASE I WAS LUCKY BUT IF THIS PROBLEM IS A RECURRING ONE IN THIS MODEL, THAT WOULD PRESENT A SAFETY PROBLEM. I AM SUBMITTED THIS NOTE OUT OF CONCERN FOR ANY OTHER DRIVER THAT MAY RUN INTO THIS ISSUE WITH THIS MODEL . I HAVE OWNED MANUAL CARS MY WHOLE LIFE AND I HAVE NEVER EXPERIENCED THIS TYPE OF FAILURE.",
        "vin": "WAUDGAFL2EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "01/04/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681722,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 AUDI S4. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 40 MPH, THE STEERING WHEEL SEIZED AND THE STOP CAR STEERING SYSTEM DEFAULT WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER, WHO DIAGNOSED THAT THE STEERING MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 5,900.",
        "vin": "WAUBGAFL3EA"
    }
]