[
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418100,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Flooding due to improper cleaning of ac valve blockage. I took the car to the dealership due to water leakage in the floorboards. They said they fixed the issue but after within a few weeks the water leakage kept pouring now due to that the water leakage has exceeded its point to which it has now put it self into the electronica areas of the car. Now the car will no longer run and it shows multiple issues with the check engine light constantly on consistent water leakage now there’s mold and water leakage in the electronica area and it’s preventing me from using my car my car is no longer able to drive and I feel it’s due to the consistency of them not being able to control the water leak damage the car has caused",
        "vin": "WA1LGAFE7ED"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403982,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PANORAMIC SUNROOF HAS A FLAW THAT CAUSES RAIN TO OR ON THE AMPLIFIER.  AUDI FUNCTIONS THROUGH FIBER OPTICS, THEREFORE WHEN THE AMPLIFIER MALFUNCTIONS, THE ENTIRE ELECTRIC SYSTEM IS INOPERABLE.  THIS INCLUDES BUT NIT LIMITED TO- THE NAVIGATION SYSTEM, THE CAR MONITORING SYSTEM THAT DISPLAYS WARNINGS FOR THE VEHICLE, THE STEREO SYSTEM ETC.  THIS IS A KNOWN DEFECT THAT HAS NIT BEEN ADDRESSED BY AUDI.",
        "vin": "WA1LGAFE5ED"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361332,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK SEAT COVER COME OFF",
        "vin": "WA1LGBFE1ED"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353854,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL LEAK",
        "vin": "WA1VMAFEXED"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343627,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CURRENT RECALL ON THE VEHICLES FOR THE FLANGE AROUND THE FUEL PUMP LEAKING. THE REPAIR DOES NOT FIX THE PROBLEM AND IT WILL REOCCUR. AUDI WILL ONLY FIX THE CAR ONCE. NEXT REPAIR IS ON THE OWNER AND COSTS $1,000 TO REPAIR. AUDI REPAIR FACILITY ADMITS IT IS THE VERY PROBLEM AFFECTED IN THE RECALL AND THAT MY VEHICLE IS LEAKING SO MUCH FUEL IT IS IN IMMINENT DANGER OF CATCHING FIRE. THEY WILL NOT EVEN LET IT LEAVE THE FACILITY UNLESS IT IS TOWED ONLY BECAUSE OF THE SEVERITY OF THE LEAK. VEHICLE WAS TAKEN BACK TO AUDI ON SEVERAL OCCASIONS AFTER THE FIRST RECALL REPAIR WAS DONE SAYING THEIR WAS A FUEL SMELL ONLY TO HAVE THE CAR RETURNED SAYING IT WAS NORMAL. ONCE THE WARRANTY EXPIRED NOW THEY SAY IT HAS A FUEL LEAK AND REFUSE TO PAY FOR REPAIRS.",
        "vin": "WA1DGAFE2ED"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "07/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340750,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GLOW PLUG LIGHT CAME ON AND OFF AND THE VEHICLE COMPLETELY LOSE ACCELERATION (NO POWER) ON THE FREEWAY DURING NORMAL DRIVING.  THIS IS THE SECOND TIME THAT THIS HAPPENS TO ME.  THE FIRST TIME THAT IT HAPPENED IN JUNE OF 2020, THE RECALL WAS DONE ON BY AUDI DEALER ASSUMING THAT THE PROBLEM WOULD GO AWAY, BUT IT CAME BACK.",
        "vin": "WA1LMAFE4ED"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/05/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337516,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SELF ACCELERATED WHILE PARKING INTO A SPACE.  IT IS A TDI VERSION WHICH HAD BEEN IN THE SHOP FOR A RECALL MODIFICATION TO COMPUTER THAT SAME WEEK. WHILE PULLING INTO A PARKING SPOT A UNDER 5 MPH THE CAR SUDDENLY ACCELERATED TO A VERY HIGH RPM, JUMPED A CURB AND STRUCK A POLE.  4 PEOPLE EXPERIENCED THE RPM INCREASES (TOW TRUCK DRIVER, AUDI DEALER REP, MY WIFE AND I.",
        "vin": "WA1LMAFE6ED"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299038,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FAMILY AND I WERE DRIVING ABOUT 55MPH AND THE GLOW PLUG WARNING LIGHT STARTED FLASHING AND THE VEHICLE STALLED AFTER A MILE OR SO. THE DEALER SAID THAT THE FUEL WAS CONTAMINATED AND THAT THE WHOLE FUEL SYSTEM HAD TO BE REPLACED AND WAS GOING TO COST MORE THAN $11000. THE SERVICE GUY SAID THE DEALER WAS PAYING FOR IT BECAUSE THEY ARE GOOD GUYS, BOLONI. WE COULD HAVE HAD AN ACCIDENT AND DIED BECAUSE IT WAS AT NIGHT ON A 2 WAY ROAD AND BARELY NO ROOM ON THE SIDE OF THE ROAD. I SAY FROM EVERYWHERE I'VE READ IT IS A FAULTY HPFP. CAR ONLY HAS 65000 MILES TOO.",
        "vin": "WA1WMAFE3ED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253603,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 40,398 MILES THE CRANKSHAFT DAMPENER PULLEY FAILED BREAKING OFF AT THE HARD RUBBER CENTER IN TURN THROWING THE SEPENTINE BELT. AT THAT POINT POWER STEERING WAS LOST ALONG WITH ALL OTHER FUNCTIONS DRIVEN BY THE SEPENTINE BELT. AN INTERNET SEARCH TURNED UP A NUMBER OF AUDI OWNERS HAVING THE SAME HAPPEN TO THEM BETWEEN 40 TO 50,00 MILES. THIS SAFETY FAILURE AT SUCH LOW MILEAGE IS UNWARRANTED. THE REPLACEMENT PART APPEARS TO HAVE BEEN REDESIGNED AND MORE ROBUST .. AUDI MUST REALIZE THAT THE ORIGINAL PART WAS FAULTY. FOR ME, THANKFULLY IT HAPPENED WHILE I WAS STOPPED AT A TRAFFIC LIGHT AND NOT TRAVELING AT SPEED ON THE HIGHWAY.",
        "vin": "WA1LMAFE0ED"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232497,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY 2019, WHILE I WAS DRIVING ON CA 110 IN EXCESS OF 60 MPH, THE AUDI Q7 TDI'S GLOW PLUG INDICATOR LIGHT CAME ON, I LOST ACCELERATION AND A FEW MINUTES LATER, MY ENGINE SHUT OFF AND I WAS STUCK IN THE LEFT LANE.  I HAD TO CALL 911 AND HAVE CHP STOP ALL TRAFFIC AND PUSH MY CAR TO THE SHOULDER WHILE I AWAITED A TOW TRUCK.  AUDI DTLA TOLD ME THAT THE HIGH PRESSURE FUEL PUMP FAILED AND THAT THERE WAS METAL SHRAPNEL IN MY FUEL LINE AND IT ALL HAD TO BE REPLACED. THEY SAID THIS WAS A DIESEL WARRANTY COVERED ISSUE AND WE DID NOT PAY ANY CHARGE.  IN JUNE 2019 WHILE DRIVING ON INTERSTATE 10 IN AZ, THE GLOW PLUG LIGHT CAME ON AGAIN AND WE LOST ACCELERATION WHILE DRIVING OVER 60 MPH.  WE IMMEDIATELY EXITED THE HIGHWAY AND SHUT OFF THE ENGINE BEFORE THE ENGINE SHUT DOWN ON US, AS IT DID IN JANUARY.  WE WAITED AN HOUR IN 105 DEGREE HEAT IN THE MIDDLE OF NOWHERE, UNTIL WE WERE TOWED 80 MILES TO AUDI PEORIA, WHO CLAIM THEY CANNOT IDENTIFY THE PROBLEM.  THEY TOLD US TO RIDE IN THE CAR ON TOP OF THE TOW TRUCK.  WE BELIEVE THERE IS EITHER AN ONGOING HPFP ISSUE, OR PERHAPS SOMETHING RELATED TO THE DIESEL MODIFICATION, OR THAT THIS PARTICULAR CAR IS A LEMON - 2 BREAKDOWNS IN 5 MONTHS, WITHIN 11,500 MILES.  THE SCARIEST PART IS THAT WE WERE DRIVING AT HIGHWAY SPEEDS WITH OUR CHILDREN IN THE CAR WHEN THE CAR LOST ACCELERATION.  WE WERE LUCKY THAT WE DID NOT GET HURT OR CAUSE ANY ACCIDENTS, BUT THE AUDI Q7 TDI, WHETHER IT'S JUST THIS VEHICLE OR ALL 2014 Q7 TDIS ARE NOT SAFE.  AUDI AMERICA, INC. HAS REFUSED TO REPURCHASE THE CAR OR PROVIDE ANY OTHER ASSISTANCE OR REMEDY.  WE REFUSE TO RIDE THE CAR BECAUSE WE ARE SCARED OF ANOTHER INCIDENT.  WE HAVE WARRANTIES ON THE CAR, BUT THAT ONLY COVERS REPAIRS, IT DOESN'T PREVENT YOU FROM GETTING KILLED ON THE HIGHWAY WHEN THEY CANNOT IDENTIFY THE PROBLEM WITH THE CAR.  NO ONE AT AUDI HAS DIAGNOSED THE JUNE 2019 PROBLEM WE EXPERIENCED.",
        "vin": "WA1LMAFE4ED"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196724,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 AUDI Q7. THE CONTACT STATED THAT RUSNAK/WESTLAKE AUDI (LOCATED AT 3832 THOUSAND OAKS BLVD, THOUSAND OAKS, CA 91362, (805) 601-8034) PERFORMED AN UNKNOWN RECALL REPAIR THAT INVOLVED A SOFTWARE UPDATE ON THE VEHICLE. AFTER THE REPAIR, THE VEHICLE STALLED WITHOUT WARNING WHILE DRIVING 45 MPH. IN ADDITION, THE VEHICLE WOULD FAIL TO START SOMETIMES AND THE FUEL GAUGE FAILED TO PROVIDE THE ACCURATE READING AFTER THE VEHICLE HAD BEEN FUELED. THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER TO BE DIAGNOSED, BUT A FAILURE CODE COULD NOT BE FOUND. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT TO TAKE THE VEHICLE BACK TO THE DEALER. NO FURTHER ASSISTANCE WAS OFFERED. THE APPROXIMATE FAILURE MILEAGE WAS 61,301.",
        "vin": "WA1LMAFEXED"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175860,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PRESSURE FUEL PUMP (HPFP) FAILED WHILE DRIVING.  CAR STOPPED INSTANTLY IN TRAFFIC AND WOULD NOT START CREATING A VERY DANGEROUS SITUATION.   CAR HAS ONLY 46,XXX MILES AND THIS IS A COMMON FAILURE WITH TDI VW CARS.",
        "vin": "WA1LMAFE1ED"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172569,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AT 55-75 MILES PER HOUR. I SAW AN ORANGE INDICATOR LIGHT FOR THE 'GLOW PLUG SYSTEM' APPEAR, WITH NO PREVIOUS WARNING. I CONTINUED TO DRIVE FOR SEVERAL MINUTES, BUT FELT A LOSS OF POWER. THE ACCELERATOR WHEN DEPRESSED DID NOT RESPOND WITH POWER. I WAS IN THE LEFT LANE OF TRAFFIC WHICH SLOWED DOWN TO A STANDSTILL, BUT WHEN TRAFFIC PICKED UP, MY CAR STALLED AND STOPPED COMPLETELY. I TRIED TO RESTART THE ENGINE UNSUCCESSFULLY. I WAS STUCK IN THE LEFT LANE OF TRAFFIC AND BLOCKING ONCOMING TRAFFIC AT HIGH SPEEDS. IT WAS VERY DANGEROUS AND I HAD TWO CHILDREN IN THE CAR. I CALLED 911 AND THE HIGHWAY PATROL HAD TO STOP ALL LANES OF THE TRAFFIC TO PUSH ME TO THE HIGHWAY SHOULDER. WE CALLED AUDI CARE AND EVEN THE POLICE URGED THEM TO SEND A TOW TRUCK IMMEDIATELY, THEY GAVE ME A 60-90 MIN WINDOW, WHICH THEY THEN PUSHED UP TO 30 MINUTES, AFTER ALREADY BEING ON A CALL WITH THEM FOR 30 MINUTES. ULTIMATELY, THE POLICE FLAGGED DOWN A AAA TO SEND ME A TOW TRUCK SINCE I ALSO HAD AAA. THE AUDI DEALER SAID THIS WAS A KNOWN PROBLEM OF THE FUEL PUMP GOING BAD AND SENDING METAL SHAVINGS INTO THE DIESEL FUEL SYSTEM, WHICH THEY REPLACED COMPLETELY UNDER THE AUDI MANUFACTURER'S WARRANTY WITH NO CHARGE TO ME, BUT IT WAS A POTENTIALLY FATAL INCIDENT AS IT OCCURRED ON A HIGH SPEED LOS ANGELES FREEWAY WITH NO WARNING.",
        "vin": "WA1LMAFE4ED"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/28/2018",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163879,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FAN BLOWER FAILED, CAUSING THE WINDSHIELD DEFROSTER TO NOT WORK.  THE WINDSHIELD BECAME FOGGY WITH ZERO VISIBILITY WHILE OPERATING THE VEHICLE. ON 2 OCCASIONS IN DECEMBER, 2018.  THIS IS A SERIOUS SAFETY ISSUE THAT NEARLY RESULTED IN A CRASH DUE TO THE INABILITY TO SEE.  NO PICTURES WERE TAKEN AS IT WOULD HAVE BEEN TOO UNSAFE TO DO SO.  SERVICE WAS REQUIRED TO REPLACE THE BLOWER ASSEMBLY TO CORRECT THE ISSUE SO IT DOESN'T HAPPEN AGAIN.",
        "vin": "WA1LMAFE3ED"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142126,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF SUDDENLY EXPLODED WHILE DRIVING ON FREEWAY ON 10/22/2018. WITH NO APPARENT WARNING AND NO EXTERNAL IMPACT.",
        "vin": "WA1DGAFE4ED"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/06/2018",
        "dateOfIncident": "08/22/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11127906,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A HEAVY RAIN, THE TWO WIPERS LOCKED EACH OTHER UP, THE DRIVER SIDE MOVED DOWN BUT THE PASSENGER SIDE DID NOT, CAUSE THE LOCKED UP, PUTTING ME IN A VERY SERIOUS SITUATION, LUCKILY, IT WAS A OVERPASS NEAR BY AND I STAYED THERE UNTIL THE RAIN WAS STOPPED. I TOOK  MY CAR TO THE BLUEGRASS AUDI IN LOUISVILLE, KENTUCKY TO REPORT THE PROBLEM, BUT THEY TOLD ME THAT I HAVE TO PAY FOR IT BECAUSE MY CAR WAS OUT OF WARRANTY. I DON'T MIND TO PAY FOR THE REPAIR, BUT THIS IS A SAFETY ISSUE, SOMEONE MAY GET INJURED OR KILLED BECAUSE OF THIS DEFECTIVE FROM AUDI.",
        "vin": "WA1VMAFE3ED"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123074,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 40-45 MPH GO STRAIGHT ON THE LEFT LANE OF TWO LANES CITY ROAD WITH 45 MPH LIMIT. ONE CAR CAME OUT FROM MY RIGHT SIDE COMMUNITY AND MAKE LEFT TURN. IT SUDDENLY APPEARED IN FRONT OF ME, I BARELY HAD TIME TO STEP ON BRAKE AND HIT HER CAR. HER CAR WAS HIT PRETTY BAD AND MY Q7 FRONT WAS MESSED UP PRETTY BADLY. THE PROBLEM IS THE AIRBAD WAS NEVER DEPLOYED.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "06/18/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102469,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE WIPER FAILED WHILE DRIVING IN HEAVY RAIN. APPEARS MANY AUDI Q7 OWNERS EXPERIENCED THIS FAILURE. NOT SURE WHAT THE PROBLEM IS. WHEN WIPER FAILED, I HAD FAMILY IN MY CAR AND I LOST VISIBILTY ON THE HIGHWAY AND ALMOST CAUSED A SERIOUS ACCIDENT AND HARM TO MY FAMILY FOR A RECURRING ISSUE THAT NEEDS TO BE RESOLVED AS IT WILL HAPPEN AGAIN.  THE WIPERS WERE ON AND THEN ALL OF A SUDDEN THE PASSENGER WIPER STOPS AND BECOMES ENTAGLED WITH THE DRIVER SIDE WIPER BREAKING THE DRIVER SIDE WIPER BECAUSE THE DRIVER SIDE WIPER CONTINUED TO OPERATE. HAD I CONTINUED OPERATING WINDSHIELD WIPERS THE DRIVER SIDE WIPER ARM WOULD HAVE SNAPPED IN HALF LIKE OTHER OWNERS WHO HAVE EXPERIENCED THE SAME PROBLEM. THIS COULD HAVE CAUSED POSSIBLE DEATH TO OTHERS ON HIGHWAY DUE TO WIPER DEBRIS HITTING OTHER VEHICLE WINDSHIELDS AND CAUSING A MAJOR ACCIDENT ON THE HIGHWAY. IN ADDITION CAUSING MY LOSS OF VISIBILTY AND CRASHING INTO HIGHWAY OBJECT OR ANOTHER VEHICLE.",
        "vin": "WA1DGAFE1ED"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083924,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY AUDI Q7 CERTIFIED PRE OWNED FROM AN AUDI DEALERSHIP.  SOON AFTER I GOT IT I REALIZED THAT THE ACCELERATOR SOMETIMES GOT STUCK ON A FAST ACCELERATION.  I CALLED THE DEALERSHIP AND ASKED THEM TO CHECK FOR A RECALL AND ALSO TOOK IT IN FOR EVALUATION.  THEY SAID IT WAS BECAUSE OF THE FLOOR MATS, THE MATS WERE REMOVED/CHANGED. THE PROBLEM STILL EXISTS, AND AS I CHECK FOR RECALLS WITH THAT ISSUE I DON'T SEE ANY IN THE SYSTEM.  THE PROBLEM IS POTENTIALLY DANGEROUS,  THE FIRST TIME IT HAPPENED I HAD TO REALLY GET THE CAR UNDER CONTROL WITH POWER BRAKING AND OTHER EMERGENCY BRAKING TECHNIQUES, OR I WOULD'VE CRASHED.  I JUST HAVE TO REMEMBER NOW TO EXPECT A RUN-A-WAY CAR SITUATION IF I HAVE TO QUICKLY ACCELERATE: FIRST TIME WAS A 0-60 MPH ACCELERATION, OTHER TIMES WAS AN THE HIGHWAY ACCELERATION TO CHANGE LANE OR OVERTAKE ACCELERATION TOOK OVER.   I AM ALSO NOT SURE WHAT TO DO ABOUT IT BESIDES GETTING RID OF THE CAR!",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "03/28/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083548,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VW/AUDI DIESEL \"FIX\" IS NOT WORKING AS PROMISED AND THE VEHICLES EQUIPPED WITH THIS \"FIX\" MAY CAUSE A SAFETY RISK TO THE PUBLIC.   2 HOURS AFTER PICKING UP MY AUDI Q7 3.0 TDI FROM THE DEALER, MY WIFE WAS DRIVING THE CAR TO PICK UP EASTER SUPPLIES WITH MY 2 YOUNG KIDS AND WHILE PULLING OUT OF BJ'S WHOLESALE STORE ONTO A 4 LANE HIGHWAY THE CARS ENGINE SUDDENLY DIED. THE CAR WAS STALLED AND LEFT UNRESPONSIVE AND SHE ALMOST GOT STRUCK BY AND LARGE TRUCK. LUCKY NOBODY WAS INJURED THIS TIME BUT THIS DIESEL \"FIX\" HAS MUFFLED THESE ENGINES REDUCING TORQUE AND CAUSES THEM TO STALL AT LOW RPM'S. THE DEALERS BLAME VW/AUDI AND AUDI BLAMES THE DEALERS. I'M NOT SURE WHEN SOMEONE WILL TAKE RESPONSIBILITY BUT I HOPE IT'S BEFORE SOMEONE DIES!!!!!!!",
        "vin": "WA1LMAFEXED"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2018",
        "dateOfIncident": "02/22/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075410,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2014 AUDI Q7 TDI AND HAVE JUST HAD THE DIESEL GATE RECALL FIX TO IMPROVE EMISSIONS. THE FIX HAS REDUCED MPG'S AND SIGNIFICANT POWER TO MY CAR. I WAS TOLD THE CAR WOULD ONLY LOSE ABOUT 2MPG BUT IT'S MORE LIKE 4-5MPG. THE POWER LOSS IS SIGNIFICANT AND MAKES THE CAR DANGEROUS TO DRIVE ESPECIALLY WHEN PULLING OUT INTO TRAFFIC. THE HESITATION PUTS ALL PASSENGERS IN DANGER. THE BIGGEST SAFETY ISSUE HAS TO DO WITH THE CAR WAS SOLD WITH A TOW PACKAGE. NOBODY TESTED THE DIESEL GATE FIX FOR OWNERS WHO PAID EXTRA FOR A TOW PACKAGE. THE CAR IS DOWN AT LEAST 10MPG WITH A LIGHT TRAILER AND THE SHIFTING AND POWER LOSS HAS MADE THIS Q7 ALMOST USELESS TO TOW. THAT WAS NOT TOLD PRIOR TO THE DIESEL GATE FIX. PUTTING AND AUDI/VW/PORSCHE ON THE ROAD WITH A LIGHT TRAILER AFTER THE DIESEL GATE FIX IS A SAFETY ISSUE FOR EVERYONE ON THE ROAD",
        "vin": "WA1LMAFEXED"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11010398,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MORNING MY WAS PARKED IN THE PARKING LOT OF ONE SUPERMARKET. I USED THE KEY TO START THE CAR AND OPENED FRONT PASSENGER SIDE DOOR TO LOAD THE STUFF. MY NANNY OPENED 2ND ROW PASSENGER SIDE DOOR TO SIT MY DAUGHTER IN THE CAR SEAT. AFTER THEN WE BOTH CLOSED THE DOORS. I TRIED TO OPEN THE DRIVER SIDE DOOR AND MY NANNY TRIED TO OPEN THE 2ND ROW DRIVER'S SIDE DOOR. BUT WE COULDN'T  OPEN BOTH DOORS! I TRIED TO OPEN THE TRUNK. BUT I COULDN'T OPEN IT. ALL DOORS JUST AUTOMATICALLY LOCKED WHEN THE CAR WAS FULLY STOPPED AND THE ENGINE WAS RUNNING. MY 16 MONTHS OLD BABY WAS LOCKED IN THE CAR!!!!!!!!!!!!!!!!!!",
        "vin": "WA1LGAFE3ED"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006680,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "06/23/2017 TOOK VEHICLE INTO DEALER FOR AIRBAG WARNING LIGHT, REPAIR FINISHED 06/30/2017 DUE TO CRACKED CONNECTOR UNDER DRIVER'S SEAT IN A WIRING BUNDLE THAT DOES NOT FLEX WITH MOVEMENT OF SEAT. CONNECTOR UNDER DRIVER'S SEAT IN A WIRING BUNDLE SHORTED ONE MONTH AFTER SEAT WAS REMOVED FOR BATTERY REPLACEMENT.  DISABLING ALL AIRBAGS AND SEAT BELT MODULE. VEHICLE WAS PARKED ON CITY STREET WHEN AIRBAG WARNING LIGHT CAME ON. MY CONCERN IS REMOVING THE DRIVER'S SEAT OR STRESS CAN CAUSE CRACKING OF THIS SEATBELT CONNECTOR DISABLING THE AIRBAGS IS A SERIOUS SAFETY ISSUE.",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995865,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOMLY, WHEN THE VEHICLE COMES TO A STOP, THE WHEEL WILL TURN TO THE RIGHT 90 DEGREES, YET THE CAR WOULD GO STRAIGHT.  THIS HAPPENS RANDOMLY WHEN DRIVING TOO.  THE WHEEL TURNS TO THE RIGHT 90 DEGREES, YET THE CAR GO STRAIGHT.  YOU HAVE TO FORCE THE STEERING WHEEL BACK TO STRAIGHT.  DEALER SAYS NOTHING IS WRONG WITH THE VEHICLE AND CAN'T DUPLICATE THE EVENTS.  A LOUD CLUNKING/BANGING NOISE WHEN THE CAR IS SHIFTED INTO REVERSE.  THE WHOLE VEHICLE WILL SHAKE. THE DEALER DID DUPLICATE THE NOISE, YET THEY COULDN'T TELL US WHAT WAS CAUSING IT SO THEY REPLACED THE DIFFERENTIAL.  THAT DIDN'T STOP THE NOISE, SO THE DEALER BROUGHT IN A TECHNICIAN FROM CORPORATE.  THIS PERSON FOUND NOTHING WRONG.    AFTER HAVING THE CAR TO THE DEALER 5 TIMES, THEY TOLD US THERE IS NOTHING WRONG.  MANY TIMES, THE BACK-UP CAMERA WILL NOT TURN OFF AFTER THE CAR GOES FROM REVERSE TO DRIVE. THIS MEANS THE RADIO/NAVIGATION CAN'T BE USED. SOMETIMES WHEN THE CAR IS PUT INTO DRIVE FROM REVERSE, THE CAMERA WOULD TURN OFF, BUT THE RADIO WOULD NOT TURN BACK ON.  WHEN THE CAR WAS IN PARK AND NOT RUNNING, THE RADIO WILL TURN ON WHEN THE CAR DOOR WAS OPENED AND CAN'T BE TURNED OFF.  TO RESET THINGS, THE CAR HAS HAVE TO BE TURNED OFF AND RESTARTED OR TURNED ON AND THEN OFF AND THEN RESTARTED. THIS IS THE ONLY WAY TO RESOLVE THIS PROBLEM.     ALSO, WHEN TRYING TO OPEN THE BACK HATCH USING THE RELEASE ON THE DRIVER DOOR, IT WOULDN'T WORK. YOU NEEDED TO TURN THE CAR OFF, THEN BACK ON, IN ORDER TO GET IT TO WORK.",
        "vin": "WA1LGAFE0ED"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/23/2015",
        "dateOfIncident": "03/22/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701109,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 AUDI Q7. THE CONTACT STATED THAT WHILE DRIVING AT 75 MPH, THE PANORAMIC SUN ROOF SHATTERED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "WA1LMAFE9ED"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "11/21/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660256,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS A COMPLAINT ABOUT OVER BRIGHT HEADLIGHTS.  WHEN CERTAIN AUTOS ARE PASSING ME WITH ONCOMING TRAFFIC I FIND CERTAIN HEADLAMPS TO BE ACTUALLY DANGEROUSLY BRIGHT AND ANGLED DIRECTLY AT MY HEIGHT ( I AM 5\"10\") IN MY MAZDA 6 STATION WAGON  (2005).  MY AUTO IS OF STANDARD HEIGHT YET THE HEADLAMPS ON THE AUDI, BMW AND OTHER SUVS ARE NOT ANGLED DOWN AND BLIND ME AT NIGHT.  WHEN THEY COME UP BEHIND ME , THEY ARE OVERBRIGHT IN MY REAR VIEW MIRROR, AND ESPECIALLY IN THE DRIVERS OUTSIDE MIRROR (WHICH I CAN'T CHANGE TO NIGHT MODE).  MANY MANY PEOPLE I HAVE SPOKEN TO ARE EXPERIENCING THIS SAME PROBLEM.  I WOULD BE WILLING TO TESTIFY TO CONGRESS OR ANYWHERE ELSE AS TO MY OPINION THAT THESE AUTOS ARE UNSAFE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626358,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUDI Q7, THERE IS A LOCK BUTTON ON THE REAR DOORS, WHICH LOCKS THE WHOLE CAR. THIS BUTTON DOES NOT GET DISABLED WHEN THE CHILD LOCK IS ENGAGED. A CHILD SEATED IN A REAR SEAT CAN KICK THE BUTTON AND EASILY LOCK THE DRIVER OUT OF THE VEHICLE, IF THE DRIVER HAS LEFT THE CAR WITH KEYS INSIDE THE CAR. THIS IS VERY COMMON FOR REFILLING OF GAS.     OUR DAUGHTER WAS LOCKED IN THE CAR FOR 1/2 HOUR WHILE I BROUGHT ANOTHER SET OF KEYS. IT WAS HOT OUTSIDE AND THE CAR WAS NOT RUNNING, SO THERE WAS NO A/C. POLICE WAS DISPATCHED TO THE SCENE TO BREAK HER OUT, BUT I MADE IT THERE BEFORE THEY DID.    CHILDREN IN THE CAR CANNOT OPEN THE DOOR, SINCE THEY ARE STRAPPED IN AND / OR THEY ARE TOO YOUNG TO RECEIVE AND FOLLOW INSTRUCTION.    THIS IS A GENERAL CHILD SAFETY ISSUE WITH THIS CAR AND LOCK. THERE ARE MANY REPORTS OF THE SAME ISSUE ON THIS WEB FORUM, REPORTED FOR ALMOST 5 YEARS. AUDI HAS NOT DONE ANYTHING. HTTP://WWW.AUDIWORLD.COM/FORUMS/Q7-DISCUSSION-112/DISABLING-DOOR-LOCK-BUTTON-REAR-DOORS-2767659/    IF THE SITUATION WE LIVED WAS AT A HIKE, WHERE THERE IS NO CELL PHONE COVERAGE, WE WOULD BE IN DEEP TROUBLE.     AUDI NEEDS TO FIX THIS BY DISABLING THE BUTTON WHEN THE CHILD LOCK IS ENGAGED, BEFORE A CHILD OR PET IS HURT IN A SERIOUS WAY OR WORSE.  *TR",
        "vin": "WA1DGAFE1ED"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2014",
        "dateOfIncident": "01/20/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567601,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR PERIODICALLY STALLS ON ACCELERATING FROM A STOP, EVEN THOUGH ENGINE IS UP TO NORMAL OPERATING TEMPERATURE. CAR WILL GET TO APPROX 10-15 MPH, THEN STALL, WITH A COMPLETE LOSS OF POWER. MUST PUSH GAS PEDAL ALL THE WAY TO THE FLOOR TO OVERCOME THE STALL, THEN THE CAR LEAPS FORWARD, SPINNING THE TIRES. THIS HAS HAPPENED SEVERAL TIMES IN THE PAST FEW WEEKS. AM VERY CONCERNED WHENEVER I START UP AT AN INTERSECTION, AS I DON'T KNOW WHEN THIS SITUATION WILL OCCUR. I THINK THIS IS A SAFETY ISSUE WHICH SHOULD BE CORRECTED.  *TR",
        "vin": "WA1DGAFE3ED"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558242,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TURNING LEFT ONTO A MAIN ROAD WHEN THE HATCHBACK SPONTANEOUSLY OPENED, I.E. THE CAR WAS MOVING AND THE DOOR TO THE BACK OF THE CAR OPENED ALL BY ITSELF.     I HAVE SUBSEQUENTLY TESTED (IN AN EMPTY PARKING LOT) IF THE KEY FOB OR THE DOOR-RELEASE WILL OPERATE WHILE THE CAR IS IN MOTION (I.E. I TESTED TO SEE IF PERHAPS I HAS INADVERTENTLY TRIGGERED THE DOOR OPENING BUTTON)-- AND NEITHER WILL OPEN THE DOOR WHEN THE CAR IS MOVING.     I HAVE CONTACTED AUDI AND THEIR FIRST RESPONSE WAS THAT I HAD PROBABLY ACCIDENTALLY HIT THE BUTTON, AND THEN THEIR NEXT REPLY WAS THAT WHAT DID I WANT THEM TO DO SINCE THERE WAS LITTLE CHANCE THEY COULD REPLICATE THE PROBLEM.     I INDICATED THAT THIS CAR WAS ESSENTIALLY UN-USABLE TO ME AT THIS TIME AS I OFTEN HAVE DOGS IN THE BACK OF THE CAR- AND CAN NO LONGER SAFELY USE THIS VEHICLE FOR FEAR THAT AT ANY MOMENT THE BACK DOOR WILL OPEN WHILE I'M DRIVING.  *TR",
        "vin": "WA1LMAFE0ED"
    }
]