[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458365,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 BMW 328i Xdrive, 62K miles. Routine oil change and filter change serviced at BMW dealership Feb 2022. March 2022 (<30 days later), suffered catastrophic engine failure related to camshaft oil starvation and sudden loss of power while driving on highway at 60 mph. Dealership investigation unable to determine the cause, ruled out N20 timing chain and oil pump chain issues. Neither BMW NA nor dealership would stand behind engine failure - BMW NA stated the \"car is too old.\" Full engine replacement completed at the expense of the customer ($11K). Very disappointing that an engine would suffer catastrophic failure related to oil starvation within one month of dealership oil service with multi-point inspection. BMW F30 N20 engines have numerous reports of failures.",
        "vin": "WBA3B3C50EJ"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447869,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "While approaching a stop light I noticed that it was much harder to stop than expected. As I let up on the brake a little I started accelerating towards the car in front of me. I reapplied the brakes much hard and was able to stop the vehicle but I could tell that I was fighting the engine. I put the car into park and the engine raced up to about 4.5k. I then just hit the off button and put my hazards on. After a few seconds, I turned the car back on and the engine behaved as expected. I drove off without incident.",
        "vin": "WBA3B5C51EP"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447662,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Inside door latches frequently do not open the locked doors - must use power door unlock first.  This creates an unsafe situation if door needs to be unlocked quickly, under restricted mobility or if power is out following an accident or sustained sitting in car that is not running and cannot be re-started.  There are two existing complaints about this issue related to this exact model and widely documented online.  Since the door latch actuator on this model is shared with other models for this and many other years of similar models BMW should replace the affected actuators as a recall.",
        "vin": "WBA3B5C57EP"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443048,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Timing Chain Guide failure after 75k miles resulting in catastrophic engine damage. I was in heavy traffic at 60 mph when the engine began to knock loudly, just as quick the drivetrain malfunction warning came on along with the oil pressure warning light. Immediately lost power & the vehicle went into “Limp Mode” and within a 3 seconds it completely shut down causing a plethora of problems that made it a nightmare to get off of this busy highway. Vehicles were narrowly missing me & blowing their horns while I was trying to coast off of the side of the roadway. All this happened in about 20 to 25 seconds.The car has been in the garage for 6 months & a confirmation was made on the timing chain guide failure. The inlet screen to the oil pump has pieces of the broken guides stuck in it which restricted the oil flow to the entire engine. Both front & rear crankshaft bearings were seized up & spun inside the engine block. Upon inspection of the top end of the engine, indicators suggesting extreme heat resulting in damage to both camshafts, connecting rods, rocker spring retainers, rocker arms, valves, & piston rings. The VIN number of the vehicle is amongst the ones included in the Class Action Lawsuit against BMW regarding the malfunction of the timing chain guides. I still haven’t heard back from BMW’s representatives to date. My vehicle needs fixed whether it’s beyond the mileage of the extended warranty or not!!",
        "vin": "WBA3A5C51EP"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428088,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 BMW 328I. The contact stated while driving 75 mph, the vehicle stalled as the drivetrain malfunction warning light illuminated. The contact managed to coast the vehicle to the shoulder of the roadway. The contact attempted to turn off and restart the vehicle which failed to resume normal operation. The vehicle was towed to an independent mechanic where the vehicle was diagnosed, and it was determined that the fuel feed pump and high pressure fuel pump needed to be replaced. The technician informed the contact that the fuel pump failed to provide the correct fuel level in the tank. No dealer was contacted. The manufacturer was notified of the failure and informed the contact that the VIN was not under recall. The failure mileage was approximately 76,802",
        "vin": "WBA3X5C58ED"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426001,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Travelling at 45 mph, engine failed and shut off. Coasted to the side of the road. Towed vehicle on a flatbed to a BMW Dealership. Dealer inspected engine and reported a Timing Chain/Timing Chain Guide failure. Recommended I replace the engine versus repair it.",
        "vin": "WBA3B3C52EJ"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421647,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 BMW 328i. The contact stated while driving at various speeds, the steering wheel locked up not allowing the contact to turn the steering wheel. The contact stated the chassis stabilization warning light was illuminated on the control panel. The vehicle was towed to a local dealer where it has yet to be diagnosed. The vehicle was not repaired. The contact was relating the failure to NHTSA campaign number: 13V454000 (Service brakes, Hydraulic). The manufacturer had not been informed of the failure. The failure mileage was approximately 68,000.",
        "vin": "WBA3A5C50EP"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398213,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, A LOUD BANG WAS HEARD AND BROKEN GLASS WAS SEEN FALLING OVER THE REAR WINDSHIELD. AFTER PULLING OVER, IT WAS FOUND THAT THE SUNROOF HAD EXPLODED, WITH A LARGE HOLE IN THE MIDDLE AND GLASS AROUND IT PROTRUDING UPWARDS.",
        "vin": "WBA3X5C51ED"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395184,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED DASHBOARD WARNINGS THAT MY LEFT REAR BRAKE LIGHT AND TURN SIGNAL WERE NOT WORKING. THIS WARNINGS WERE INTERMITTENT. I CHANGED THE BULBS, BUT THAT DID NOT FIX THE PROBLEM. I THEN LOOKED AND THE CONNECTOR TO THE LIGHT HOUSING AND SAW THAT PIN #3 HAD MELTED/CORRODED. I DID SOME RESEARCH AND FOUND THAT THIS IS A COMMON PROBLEM FOR THIS CAR, AND THAT ON A PREVIOUS MODEL YEAR, THERE WAS A RECALL . THIS PROBLEM IS CAUSED BY A DESIGN DEFECT AND IS A SAFETY HAZARD AND SHOULD BE FIXED BY BMW. THE CONSUMER COST IS IN THE HIGH HUNDREDS OF DOLLARS. THERE IS A SERVICE BULLETIN THAT DESCRIBES THE PROBLEM AT: HTTPS://STATIC.NHTSA.GOV/ODI/TSBS/2017/MC-10136736-9999.PDF",
        "vin": "WBA3B5C54EF"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390954,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "INCOMING AIR TO THE CABIN IS UNSAFE, FUMES ENTER THE CABIN.   SUSPENSIN PRESENT CONSTANT ISSUES, PARTS HAVE BROKEN WITH NORMAL WEAR.",
        "vin": "WBA3X5C52ED"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2020",
        "dateOfIncident": "11/28/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376879,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS EXPERIENCING AN ABNORMAL NOISE FROM THE MIDDLE OF THE CAR WHILE ACCELERATING AND DE ACCELERATING, BROUGHT TO BMW DEALERSHIP AND WAS TOLD I NEEDED A NEW TRANSFER CASE, WAS ALSO TOLD THIS ISSUE WAS ABNORMAL WITH MY CAR HAVING LESS MILES THAN INTENDED FOR WHAT YEAR IT WAS. THEY ALSO SAID EVENTUALLY MY AWD FUNCTION WOULD NO LONGER WORK IF NOT REPLACED IN MY 328I XDRIVE",
        "vin": "WBA3B3G55EN"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/28/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376904,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEB 20, 2020, I TOOK MY CAR TO BMW DEALERSHIP BECAUSE I HAD A LEFT REAR SIGNAL AND BRAKE MALFUNCTION. I WAS GIVEN AN ESTIMATE OF APPROXIMATELY 600.00. BASED UPON MY UNDERSTANDING OF THIS ISSUE, THIS IS A MANUFACTURER ISSUE. THE CIRCUIT BOARD, CONNECTOR, AND WIRING MUST BE REPLACED. AFTER FURTHER RESEARCH, I FOUND THAT THERE HAVE BEEN TWO RECALLS FOR THIS VERY SAME ISSUE, BUT FOR OLDER MODEL BMW'S.  PLEASE REFERENCE 13V407000 AND 17V6766000. BMW ALSO ISSUED A SERVICE BULLETIN TO FIX THIS ISSUE. PLEASE REFERENCE SIB63-0611. ALSO REFERENCE 11V-438 CAMPAIGN. IT IS APPARENT THAT BMW'S ARE STILL BEING PRODUCED WITH THE GROUND WIRING ISSUE. IF YOU VISIT BIMMERFEST, YOU WILL SEE HOW MANY BMW'S FROM 2010- 2014 ARE STILL BEING EFFECTED BY THIS ISSUE. IF OLDER MODELS WERE RECALLED FOR THIS ISSUE, NEWER ONES WITH THE SAME ISSUE SHOULD ALSO BE RECALLED, AND FIXED FREE OF CHARGE. I AM CURRENTLY DRIVING A VEHICLE WITH A FAULTY LEFT REAR BRAKE LIGHT, AND LEFT REAR SIGNAL LIGHT WHICH IS A SAFETY HAZARD. I AM REQUESTING THAT BMW PAY FOR THE REPAIRS AS THIS IS A MANUFACTURING PROBLEM, NOT OPERATOR ERROR OR WEAR AND TEAR. PLEASE REFERENCE THE COMPLAINT FILED ON 3.3.20 11315965.",
        "vin": "WBA3A5G5XEN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375575,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE BEGAN MAKING A VERY DEFINED RATTLING SOUND OVER SMALL CRACKS AND BUMPS IN THE ROAD AND THE STEERING BECAME EXTREMELY SENSITIVE AT THE SAME TIME THAT PROBLEM OCCURED. I TOOK IT IN TO GET AN ALIGNMENT AT BELLE TIRE, AND IT IS UP TO SPEC. I TOOK THE VEHICLE TO A BMW AND NOBODY IS ABLE TO FIGURE OUT THE ISSUE.     WHEN DRIVING ON A HIGHWAY OR STREET, THE CAR TENDS TO PULL IN ONE DIRECTION. THE CAR HAS NOT BEEN IN A CRASH, AND IT ONLY STARTED OCCURING AFTER A A YEAR OF OWNERSHIP. THE CAR FEELS VERY UNSAFE AND \"SENSITIVE\" TO STEERING. IT IS VERY CHALLENGING TO STAY IN THE CENTER OF THE LANE WILL SWAY LEFT AND RIGHT.",
        "vin": "WBA3B5C51EP"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364235,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 70MPH CAR WENT INTO NEUTRAL COASTING TO A STOP. I HAD NO CONTROL OF THE GAS CAUSING A DANGEROUS SITTUATION AS WE COASTED TO THE SIDE OF THE ROAD. AFTER PLACING THE VEHICLE INTO PARK, IT WOULD NOT START AND NEEDED TO BE TOWED. VEHICLE COULD NOT BE PUT INTO NEUTRAL FOR TOWING PURPOSES. REPAIR SHOP SAID THE TIMING CHAIN HAD WENT OUT SEIZING AND RUINING THE ENGINE. 15K REPAIR BILL, VERY DANGEROUS SITTUATION HAVING NO CONTROL OVER A VEHICLE AT HIGH SPEED HIGHWAY DRIVING!",
        "vin": "WBA3C1C53EK"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "05/13/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361364,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM 40MPH TO 60MPH THE STEERING WHEEL GETS A SHAKING, WOBBLE THAT DOESN'T STOP ITS A COMMON PROBLEM WITH THE 2012 TO 2014 BMWS TO THE BEST OF MY KNOWLEDGE. ON MANY BMW FORMS THERE ARE MULTIPLE OWNERS WHO SAY THEY HAVE REPLACED THE STEERING RACK, STEERING ASSEMBLY AND IT WILL FIX IT FOR THE TIME BEING BUT IT WILL EVENTUALLY DEFAULT AGAIN. WHEN TURNING THE STEERING WHEEL YOU'LL HEAR A CLUNKING NOISE FROM THE FRONT OF THE VEHICLE THAT SOUNDS AS IF THE FRONT AXLE IS GOING TO REMOVE ITS SELF FROM YOUR PRESENCE. TO HAVE THIS FACTORY PROBLEM FIXED IS UPWARDS OF 2,000$, THAT OWNERS SHOULD NOT HAVE TO WORRY ABOUT BECAUSE IT IS A PROBLEM WITH ALMOST EVERY BMW. ALSO BMW HAS HAD THE SAME ISSUE WITH THE BLOWER MOTOR OR HEATER MOTOR. IT IS A VERY COMMON ISSUE WITH THESE MODEL BMWS THAT BMW REFUSES TO RECALL. THE HEATER WILL NOT WORK AT ALL OR ONLY THE DRIVER SIDE WILL BLOW SLIGHTLY WARM AIR BECAUSE OF BMWS FAULTY BLOWER MOTOR. ALSO THE INFOTAINMENT SYSTEM WILL POWER OFF OR STOP WORKING IN GENERAL. THIS IS A PROBLEM BECAUSE IT'S THE ONLY WAY YOU CAN FIND OUT WHAT ISSUES THE VEHICLE IS HAVING. BMW HAS TO HAVE SOME ACKNOWLEDGEMENT OF THESE ISSUES BASED OFF ALL OF THE PEOPLE WHO HAVE COMPLAINED ABOUT THESE SAME ISSUES, BUT HAS REFUSED TO DO ANYTHING TO INSURE THE SAFTEY OF THE PEOPLE OPERATING THERE VEHICLES WITH THESE FACTORY DEFAULTS. MOST OF THE ISSUES THAT HAVE OCCURRED WITH THE VEHICLE WERE HAPPENING WHILE THE VEHICLE IS IN MOTION.",
        "vin": "WBA3A5G59EN"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343436,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER FRONT SEAT FASTEN SEATBELT SIGNALS WHEN I'M DRIVING AND NO-ONE IS IN THE FRONT SEAT, I HAVE TO LOCK SEATBELT TO TURN IT OFF.  IT HASN'T SIGNAL LATELY.  DRIVER'S DOOR LOCKS AND WON'T UNLOCK WHEN I'M PARKED UNLESS I USE THE REMOTE BUT, NOT ALL OF THE TIME.  BREAKS SQUEAKS ONLY WHEN I FIRST EXIT THE GARAGE AT HOME.",
        "vin": "WBA3A5C54EJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11338675,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD 4 CAR CRASHED QUIT THIS VEHICLE AND NEITHER TIME HAVE THE AIRBAGS DEPLOY AND I HAVE BECAME INJURED FROM THE CAR CRASHES IN MY AIRBAGS NEVER DEPLOYED, I CAN'T HIT A CAR FROM THE FRONT I HAVE BEEN HIT FROM THE BACK AND NEITHER AIRBAGS HAVE DEPLOYED EVEN A PASSENGER GOT IN ON THE SITE AND THAT ARE BACK DID NOT DEPLOY EITHER.  MY VEHICLE IS IN MOTION EVERY TIME THAT I CRASHED OR WAS CRASHED,",
        "vin": "WBA3C1C56EK"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324114,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT ELECTRONIC MODULE KEEPS GETTING WET AND FAILING ON THESE CARS. (FEM)  *TR",
        "vin": "WBA3A5G58EN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323257,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING CHAIN STRETCHED DUE TO KNOWN USE OF INFERIOR PARTS RESULTING IN IT HAVING TO BE PREMATURELY REPLACED AT A COST OF $3,000 TO AVOID TOTAL ENGINE FAILURE.",
        "vin": "WBA3C1C57EK"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321678,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES THERE IS A SIGNIFICANT REDUCTION OF BRAKING POWER. IT IS MUCH WORSE WHEN THE BRAKES ARE WET(RAIN OR SNOW).  AT TIMES THE PEDAL GOES ALL THE TO THE FLOOR LEAVING THE CAR UNABLE TO STOP WITHOUT THE USE OF THE EMERGENCY BRAKE. SEVERAL TIMES I WAS AFRAID I WOULD BE UNABLE TO STOP & HAVE AN ACCIDENT. I AM A RN ON THE FRONT LINE TREATING PATIENTS IN THE ICU WHO HAVE CONTRACTED THE CORONAVIRUS (COVID-19) AND CANNOT AFFORD TO BE AWAY FROM MY JOB. THIS CONDITION FIRST HAPPENED IN OCT 2019 AND CONTINUES TODAY.",
        "vin": "WBA3B5G50EN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321701,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SYMPTOMS ARE THE SAME AS THOSE REFERENCED IN RECALL #13V454000& 14V627000 THE BRAKING POWER IS LOST UNEXPECTEDLY RESULTING IN INCREASED VEHICLE STOPPING DISTANCE OR NO BRAKES AS WELL WHEN THE PEDAL GOES ALL THE WAY TO THE FLOOR. THIS HAS OCCURRED ON BOTH LOCAL AND HIGHWAY DRIVING ESPECIALLY WHEN THE PAVEMENT IS WET.. THIS CONDITION FIRST HAPPENED IN OCT OF 2019 & CONTINUES TODAY. I AM AN RN ON THE FRONT LINE TREATING PATIENTS IN THE ICU WHO HAVE CONTRACTED THE CORONAVIRUS(COVID-19)AND I CAN'T AFFORD TO BE ACCIDENT FROM WORK DUE TO AN ACCIDENT. I HAVE HAD SEVERAL INSTANCES WHERE THE BRAKES HAVE FAILED. BMW STATED MY CAR IS NOT ON THE RECALL LIST AND REFUSES TO REPAIR IT UNDER THE RECALL. PLEASE ADVISE WHAT FURTHER ACTION I CAN TAKE AS THIS IS MY ONLY MEANS OF TRANSPORTATION.",
        "vin": "WBA3B5G50EN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315965,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, I RECEIVED AN ERROR MESSAGE THAT MAY LEFT REAR LIGHT HAD MALFUNCTIONED. A FEW DAYS LATER, I TOOK IT TO THE BMW DEALERSHIP FOR BULB REPLACEMENT AND MY YEARLY OIL CHANGE. THE DEALERSHIP INFORMED ME THAT IT WASN'T JUST THE LIGHT BULB THAT NEEDED REPLACING THE ENTIRE REAR LIGHT SYSTEM HAD MELTED. THE SOCKET, CONNECTOR, CONTACT POINTS ALL BURNT. THERE MUST BE A DEFECT IN THE ELECTRICAL SYSTEM. BMW RECALLED EARLIER YEAR VEHICLES FOR THE EXACT SAME PROBLEM. I BELIEVE MY CAR SHOULD BE FIXED AT BMW'S EXPENSE. SINCE I CAN NOT AFFORD THE $600.00 BILL, I AM DRIVING WITHOUT A LEFT REAR SIGNAL WHICH IS NOT SAFE. I HAVE ATTACHED PHOTOS OF PARTS.",
        "vin": "WBA3A5G5XEN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311929,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR AS USUAL, MADE A LEFT HAND TURN, AND A NOTICE CAME ON THE DASHBOARD ALERTING ME THAT THE LEFT REAR TURN SIGNAL AND LEFT REAR BRAKE LIGHT WERE NOT FUNCTIONING. AS THIS IS VERY CONCERNING, I IMMEDIATELY TOOK THE CAR TO THE NEAREST BMW DEALERSHIP FOR ANALYSIS. THEY TOLD ME THAT THERE WAS AN ELECTRICAL ISSUE AND THAT THE ENTIRE WIRING HARNESS IN THE LEFT REAR WOULD NEED TO BE REPLACED AT A COST OF $905. IT WAS AT THIS POINT THAT I WANTED TO GET A SECOND OPINION, SO I HAD MY LOCAL MECHANIC TAKE A LOOK. HE TOLD ME THAT THERE WERE SCORCH MARKS WHERE THE GROUND WIRE CONNECTED INTO THE WIRING HARNESS, AND THAT THE GROUND PIN THAT IT CONNECTED TO ON THE OTHER SIDE WAS ENTIRELY ERODED. HE SUGGESTED THE REASON BEHIND THIS WAS THAT BMW USED AN INAPPROPRIATE GAUGE CONNECTOR FOR THE CURRENT THAT WAS BEING TRANSMITTED, CAUSING EROSION OVER TIME.    HE WAS ABLE TO ORDER GENUINE BMW REPLACEMENT PARTS AND INSTALLED THEM FOR A FRACTION OF THE PRICE QUOTED AT THE DEALERSHIP. THIS IS VERY CONCERNING TO ME BECAUSE OF THE RISK OF A POTENTIAL ELECTRICAL FIRE.",
        "vin": "WBA3B5C58EP"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "11/07/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309449,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK CAR IN FOR MAINTENANCE. MECHANIC TOLD ME TIMING CHAIN NEEDED REPLACED AND CAR COULD NOT BE DRIVEN OR IT WILL DESTROY ENGINE.  MECHANIC SAID THIS IS A KNOWN ISSUE DUE TO BMW USING INFERIOR PLACTIC FOR TENSIONER.  MECHANIC SAID TIMING CHAIN MEANT TO LAST 200K MILES. CAR HAS 69K MILES.  COST OF REPAIR $3200.",
        "vin": "WBA3C1C58EK"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309452,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CAR HAD MULTIPLE WARNING LIGHTS COME ON IE. DYNAMIC STABILITY CONTROL AND ABS WARNING LIGHTS. ABS AND CRUISE CONTROL NO LONGER WORKED. TOOK IT TO MECHANIC.  HE SAID THE ABS CONTROL MODULE FAILED. MECHANIC SAID THIS IS A KNOWN ISSUE DUE TO ENGINEERING.",
        "vin": "WBA3C1C58EK"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307274,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HEARING RATTLE SOUND FROM THE CHASSIS WHILE DRIVING ON CITY STREET, TOOK IT THE DEALER AND FOUND OUT THE PARK BRAKE CABLE HOLDER IS BROKEN AND WAS HITTING THE THE SHAFT. THIS WILL LEAD TO GRID THE PARK BRAKE CABLE INTO THE DRIVE SHAFT AND CAUSE ACCIDENT. THAT PIECE SHOULD BE RECALL AND REINFORCE.",
        "vin": "WBA3C1C52EK"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/11/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11298566,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TO AVOID A HEAD ON COLLISION, I WAS FORCED OFF ROAD. WHEN I MOVED OUT OF THE WAY I IMMEDIATELY APPLIED THE BREAKS WHICH THEN TOOK SOME TIME TO RESPOND AS IF IT WAS BLOCKED OR AS IF I DIDNT PRESS THE PEDAL. BY THE TIME I FELT SOME SORT OF STOPPING TENSION I WAS PUT INTO A POLE. AIRBAGS DID NOT DEPLOY.",
        "vin": "WBA3A5G50EN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265470,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SIDE PASSENGER WINDOW REGULATOR STOPPED WORKING AND THE CABLE SNAPPED WHILE STOPPED AT A RED LIGHT CAUSING THE WINDOW TO FALL DOWN INTO THE DOOR. WINDOW WILL NO LONGER ROLL UP AND I'M FORCED TO PUT A GARBAGE BAG TO COVER THE OPEN WINDOW WHICH IS A SAFETY HAZARD WHEN DRIVING. I NO LONGER HAVE VISIBILITY ON MY RIGHT HAND SIDE WHEN DRIVING.",
        "vin": "WBA3A5G52EN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254628,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW 328I. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE LOST ACCELERATION. THE CONTACT ACTIVATED THE HAZARD LIGHTS AND PULLED THE VEHICLE OVER TO THE SHOULDER. ONCE THE VEHICLE WAS TURNED OFF AND RESTARTED, IT RESUMED NORMAL OPERATION. WHILE DRIVING TO REEVES BMW (109 E FOWLER AVE, TAMPA, FL 36612, THE FAILURE OCCURRED TWO MORE TIMES. THE DEALER DIAGNOSED THAT THE FUEL PUMP FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS CURRENTLY BEING REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "WBA3A5C56EP"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "11/05/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240731,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL MALFUNCTION DUE TO A SENSOR MALFUNCTION IN THE STEERING COLUMN.  AS SOON AS I BEGIN DRIVING, THE MALFUNCTION MESSAGE BEGINS AND REPEATS CONSTANTLY AS I DRIVE.  THIS MALFUNCTION DISABLES ALL OF THE FEATURES ON THE STEERING WHEEL.  THE WARNING MESSAGE APPEARS IN THE NAVIGATION SCREEN REPEATEDLY WHEN DRIVING.  IT IS DISTRACTING AND PREVENTS ME FROM USING HANDS FREE FUNCTIONS ON THE STEERING WHEEL.  THE DEALER ADVISES IT IS $1,000 TO REPAIR.  I NEVER USED THE CRUISE CONTROL, NOR DO I NEED IT.",
        "vin": "WBA3B5C55EP"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "04/21/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11231493,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 SURGED AUTOMATICALLY IN A PARKING LOT AND THE BRAKES FAILED REPEATEDLY: IT TOOK ME OVER THE 4\" CEMENT PARKING LOT STOPPER AND INTO A WALL! THIS WAS THE ONLY WAY THE VEHICLE WOULD STOP! IWILL SAY THAT  JUST BEFORE I HAD BACKED OUT VERY SLOWLY AS I WAS IN A PARKING LOT.  I HIT SOMETHIG, PUT MY FOOT ON THE BRAKE, THEN PUT CAR IN DRIVE TO PULL A FEW FEET BACK INTO THE PARKING SPOT. I USED VERY LITTLE GAS, NOT NECESSARY OF COURSE. BMW ENGINEERS EXAMINED IT AND FOUND NO ERROR ACCORDING TO THEIR THREE STANDARD TESTS. I WAS TOLD THAT THEIR TESTS \"MAY NOT RECORD SOMETHING,\" \"COULD NOT DUPLICATE MY CONCERNS,\" AND THAT  IT WOULD TAKE \"A MORE SEVERE IMPACT TO RECORD SOMETHING.\" NOTHING COULD BE TESTED OR RECORDED FOR SPEEDS UNDER 35 MILES PER HOUR. I GOT A CONCUSSION AND THE INCIDENT COST $ 17,000 (PLUS LOSS OF CAR VALUE). BMW DID NOTHING FOR ME SO I AM OUT OF A BMW FOR GOOD.  I HAD JUST PUT THE CAR IN DRIVE TO PULL BACK INTO THE PARKING SPACE I WAS IN. IN ALL FAIRNESS I DID HIT SOMETHING, STOPPED, FOOT ON BRAKE PUT IT IN DRIVE.  THERE IS NO WAY IT OUTGHT TO HAVE SURGED OUT OF CONTROL OR FAILED TO STOP. I WAS GOING LESS THAN 5 MPH.  BMW WILL DO NOTHING FOR ME EXCEPT GIVE ME A COURTESY DISCOUNT ON A DIFFERENT BMW ONCE I'VE PURCHASED IT. THEIR DEALERS HAVE OFFERED ME LESS THAN COMPETITORS. I  WON'T BUY ANOTHER ONE.  ## VIN PASSED ## BMW 328I2014 ##",
        "vin": "WBA3A5C52EJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231507,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE HAD 5 BLOWOUTS AND 1 TIRE HAS A BUBBLE(ABOUT TO BLOW OUT) IN 13 MONTHS. I HAVE 2 SETS OF WHEELS.  THE BRIDGESTONE DRIVEGUARD TIRES HAVE HAD ALL OF THE PROBLEMS. NOT ONE PROBLEM WITH MY MICHELINS. I DRIVE ON THE SAME ROADS WITH BOTH SETS. THE SIDEWALLS ARE EXTREMELY WEAK ON THE BRIDGESTONE. IN 26 YEARS OF DRIVING, THESE ARE THE ONLY TIRES THAT I HAVE GOTTEN A BLOWOUT WITH, AND 5 IN ONE YEAR.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203519,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU ARE DRIVING OR A PASSENGER SITS IN THE PASSENGER SEAT OF THE CAR SAYS AIRBAG SYSTEM MALFUNCTION I TOOK IT TO THE DEALER AND THEY TOLD ME IT WAS THE PASSENGER SEAT OCCUPANCY SENSOR WHICH IS GOING TO BE $800 TO FIX THIS IS A KNOWN PROBLEM BY BMW  THAT THEY ARE WELL AWARE OF  MULTIPLE OWNERS ARE HAVING THE SAME PROBLEM THIS IS NOT COVERED UNDER THE WARRANTY IN MY VEHICLE IS OUT OF WARRANTY",
        "vin": "WBA3A5C5XEJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170288,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE DOOR DOES NOT RELIABLY (I.E. <50% OF THE TIME) OPEN FROM THE INSIDE USING THE DOOR HANDLE WHEN THE VEHICLE IS STATIONARY.  INSTEAD I HAVE TO PRESS THE CENTRAL UNLOCK BUTTON ON THE DASHBOARD (AN ELECTRICAL MECHANISM) TO UNLOCK THE DOOR PRIOR TO BEING ABLE TO OPEN IT WITH THE DOOR HANDLE.  THIS IS A COMMON PROBLEM WITH THESE CARS AND IS A MASSIVE SAFETY RISK - E.G. IN THE EVENT OF AN ACCIDENT THE DRIVER MIGHT BE UNABLE TO EXIT THE CAR.",
        "vin": "WBA3A5C53E "
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "12/25/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163977,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS GETTING WARNINGS ABOUT LEFT REAR BRAKE AND TURN LIGHTS MALFUNCTIONING FOR MONTHS THAT WOULD TURN ON AND THEN GO AWAY. ON CHRISTMAS DAY THE BRAKE LIGHT AND TURN LIGHT FOR LEFT REAR CAME ON AND STAYED ON. I WENT AND BOUGHT BULBS TO REPLACE THEM SINCE AT THAT POINT THE LIGHTS WERE NO LONGER WORKING (INSTEAD OF A WARNING THAT WOULD COME ON THEN GO RIGHT BACK OFF ONCE THE BRAKE WAS PRESSED OR LEFT TURN SIGNAL WAS USED). I TOOK THE TAIL LIGHT ASSEMBLY OFF TO REPLACE THE BULBS AND ONCE I DISCONNECTED THE WIRING HARNESS I DISCOVERED THAT THE GROUND PIN WAS MELTED OFF THE TAIL LIGHT SIDE OF THE CONNECTOR AND STUCK INTO THE WIRING HARNESSES. I HAVE NEVER MADE AN NHTSA COMPLAINT BEFORE, BUT FELT THIS WAS DANGEROUS BETWEEN THE FACT THAT 1 IT PULLED ENOUGH CURRENT TO MELT THE WIRING PIN INTO THE HARNESS AND 2 I WAS DRIVING DOWN THE ROAD AND LOST REAR BRAKE TAIL AND TURN LIGHTS ON THE LEFT SIDE.",
        "vin": "WBA3B5C5XEP"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "12/07/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160759,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULT IN AIRBAG ON SCREEN, COMES ON AND OFF. STARTED AROUND 61,513 MILES.  EXACT MESSAGE \"FAULT IN AIRBAG, BELT RENSIONER OR BELT-FORCE LIMITER. FEW DAYS LATER, CHECK ENGINE COMES ON, ALONG WITH HIGH RPM'S, WHILE STRUGGLING TO ACCELERATE. 12/10/2018 ENGINE IS EXTREMELY LOUD AND DROPPING OFF AT  DEALER. ALSO BACK TAIL LIGHTS HAVE MOISTURE, BACK PASSENGER WAS REPLACED A YEAR AGO. DRIVER SIDE NOW NEEDS REPLACING.",
        "vin": "WBA3B5C52EP"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/11/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150884,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH MY STEERING, ELECTRICAL AND LIGHTS ON MY 2014 328I. THERE IS A STEERING COLUMN PROBLEM THAT IS CAUSING MY ELECTRICAL SYSTEM AND MY BRAKE LIGHTS AND FOG LIGHTS TO RANDOMLY STOP WORKING AT TIMES WHEN I'M DRIVING MY CAR DOWN THE ROAD. I HAD IT TESTED AND THEY SAID IT'S A 6 PIN STEEEING COLUMN ISSUE. IT'S CAUSING MY CRUISE CONTROL TO MALFUNCTION, ALONG WITH MY BRAKE LIGHTS AND FOG LIGHTS. I HAVE THE DOCUMENTS FROM THE REPORT IN MY EMAIL. ALSO, THERE IS SOMETHING WRONG WITH MY DRIVE TRAIN/TIMING BELT OR POWER STEERING BECAUSE MY ENGINE MAKES A LOUD WHINING NOISE WHEN I TURN THE STEERING WHEEL A CERTAIN WAY AND ALSO IT'S LOUDER WHEN I HAVE THE AIR OR VENTS TURNED ON. I'M AFRAID ALL THE DEFECTS ARE GOING TO CAUSE ME TO HAVE AN ACCIDENT DUE TO MY LIGHTS FAILING AND SOMEONE RUNNING INTO ME OR MY STEERING GOING OUT ON ME OR MY ENGINE SHUTTING DOWN DUE TO THE NOISE AND IT FAILING. I'VE READ LOTS OF OTHER BMW OWNERS REPORTING THE SAME ISSUES ON DIFFERENT SITES ON GOOGLE. THEY NEED TO RECALL THESE THINGS AND CHECK INTO THEM MORE SERIOUSLY BEFORE SOMEONE GETS HURT.",
        "vin": "WBA3A5G57EN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11115231,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE PEDAL PAD CAME OFF OF MY BRAKE WHEN I WENT TO STOP BEHIND SOMEONE CAUSING ME TO GET IN AN ACCIDENT. I WAS TRAVELING ON A CITY STREET COMING UP TO TRAFFIC THAT WAS STARTING TO GO AT A TRAFFIC LIGHT THAT JUST TURNED GREEN. I BELIEVE THE RUBBER IS TOO SOFT ON THE BRAKE PEDAL PAD AND WAS NOT SEATED ON THE BRAKE ALL THE WAY DUE TO ME OR A PREVIOUS OWNER PULLING THE BOTTOM LEFT SIDE OFF OF THE BRAKE BY LIFTING THEIR FOOT UP FROM RESTING IT NEXT TO THE BRAKE. I HAVE A PHOTO OF THE PAD FROM AFTER THE ACCIDENT SHOWING INDENTATIONS ON THE BOTTOM LEFT OF THE PAD FROM WHERE THE BOTTOM LEFT CORNER WAS PULLED OFF THE BRAKE. WHEN I WENT TO SLOW DOWN IN TRAFFIC SO THE CAR IN FRONT OF ME COULD HAVE TIME TO SPEED UP, THE PAD SLIPPED OFF AND CAUSED ME TO HIT THE GAS PEDAL AND HIT THE CAR IN FRONT OF ME. MY COMPUTER REGISTERS WHAT HAPPENED FIVE SECONDS PRIOR TO IMPACT. IT SAYS THAT I WAS TRAVELING AT 21 MPH (THE SPEED LIMIT IS 35), THEN HIT THE GAS AND ACCELERATED A LITTLE BEFORE IMPACT, WHICH IS IN MY OPINION PROOF THAT MY FOOT SLIPPED OFF THE BRAKE. THE CAR IN FRONT OF ME WAS NOT STOPPED, THEY WERE ACCELERATING FROM BEING STOPPED IN TRAFFIC AT A LIGHT, BUT TRAVELING SLOWER THAN ME, WHICH IS WHY I WAS GOING 21 MPH SO CLOSE BEHIND THEM, BECAUSE I HAD APPROACHED THE TRAFFIC AFTER THEY ALREADY STARTED MOVING. I CONTACTED BMW AND THEY INSPECTED IT AND SAID THERE'S NOTHING WRONG WITH THE PAD AND THEREFORE WILL NOT BE COMPENSATING ME FOR THE ACCIDENT BY TAKING RESPONSIBILITY AND FIXING MY CAR. THAT MADE ME FEEL AS THOUGH THEY ARE NOT CONCERNED WITH MY PERSONAL SAFETY. THE DRIVER AND PASSENGER OF THE VEHICLE I HIT TOLD MY INSURANCE THEY WERE BOTH INJURED BUT I'M NOT SURE IF THEY ARE PURSUING THE INJURY CLAIM.",
        "vin": "WBA3B3C53EJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113686,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS STALLED TWICE ON THE HIGHWAY AND HAD TO BE TOWED FOR SERVICE AS IT WOULD NOT START. THE ERROR IN THE SYSTEM WAS FOR THE FUEL PUMP. THERE HAS BEEN A RECALL FOR MY SAME YEAR MAKE AND MODEL FOR THIS ISSUE RELATED TO THE FUEL PUMP, BUT MY VIN WAS NOT INCLUDED.",
        "vin": "WBA3X5C55ED"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2018",
        "dateOfIncident": "07/07/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110051,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW 328I X-DRIVE GIVING \"DRIVETRAIN MALFUNCTION\" MESSAGE WHEN THE CAR WAS RUNNING ON SPORT MODE OR ECO MODE. AFTER FEW MINUTES OF DRIVING THE CARS SHUTS DOWN. THIS HAD HAPPENED 3 TIMES BEFORE IN SAME MONTH AND EVERY TIME THE DEALERSHIP LOOKED AT IT THE REPLACED A PART(FUEL INJECTOR  AND MODULE IN FUEL TANK) NO HELP AND HAPPENED AGAIN NEXT DAY THEY DID IT. AFTER I TOPPED UP THE FUEL WITH 2 GALLONS WHEN THIS HAPPEN THIS TIME THE MESSAGE IS NOT SHOULD NO MORE AND THE CAR STARTED RUNNING NORMAL GAIN. BMW IS NOT ABLE TO FIGURE OUT THE ISSUE AND I WILL BE TURNING IT IN TOMORROW AGAIN FOR DIAGNOSIS. THE ISSUE IS STILL UN-KNOW.",
        "vin": "WBA3B5G52EN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/01/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11104945,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURSUANT TO THE NATIONAL TRAFFIC AND MOTOR VEHICLE SAFETY ACT AND THIS ADMINISTRATIVE AGENCY DUTY, I AM SUBMITTING A COMPLAINT AGAINST BMW AUTO MAKER. WE OWN A 2014 BMW 328I XDRIVE GT IN WHICH MY WIFE, (SAFE DRIVER), HAD AN ACCIDENT ON 06/26/2018 DUE TO \"SUDDEN UNINTENDED ACCELERATION\" WHILE PARKING, LEAVING TWO (2) FAMILY MEMBERS IN THE HOSPITAL WITH SERIOUS BACK INJURIES. WHILE SHE WAS PARKING AND AT FULL STOP WITH THE BRAKE PEDAL PRESSED, THE VEHICLE SUDDEN FORCEFULLY ACCELERATED AND TOOK OFF JUMPING OVER A 12 INCH PARKING LOT BARRIER WALL LANDING 4 FEET DOWN ON A FOUR (4) LANES BUSY ROAD, WATERS AVENUE (TAMPA, FL). THE VEHICLE WAS TAKEN TO THE LOCAL BMW (REEVES, TAMPA, FL) DEALER WERE WE PURCHASED THE CAR BRAND NEW AND HAVE BEEN SERVICING THE CAR. THE BMW AFTER CHARGING $190.00, CLAIMED TO BE UNABLE TO DIAGNOSE AND DUPLICATE THE PROBLEM AND WILL NOT ACKNOWLEDGE OR ADMIT HAVING THESE TYPE OF PROBLEMS THIS BMW 328I SERIES CONTRARY TO THIS AGENCY CLAIMS AND OTHER DISCLOSED IN PUBLIC MEDIA. THE DEALER DID NOT EVEN CHANGE THE ACCELERATION SENSOR FOR SAFETY UNCERTAIN. FURTHERMORE, BE AWARE, THIS IS THE SECOND TIME WE EXPERIENCE THIS VEHICLE \"SUDDEN UNINTENDED ACCELERATION\" MALFUNCTION AS IN 2016 DID IT AND THE VEHICLE CRASHED WHILE PARKING, STILL IN SLOW MOTION, ONTO A HANDICAP SIGN AND A PARKING LOT LANDSCAPE ISLAND (IN FRONT IF A BEST BUY STORE). LIKEWISE, AT THAT TIME THE DEALER (REVEES) CLAIMED TO BE UNABLE TO DUPLICATE THE PROBLEM AND THE VEHICLE'S ELECTRONIC CHECK DID NOT SHOWED ANOMALIES. WE HAVE PICTURES, POLICE REPORT, AMBULANCE REPORTS OF LATEST INCIDENT AND A BUSINESS RECORDED THE INCIDENT ON A SITE SECURITY CAMERA, SO EVIDENCES AVAILABLE UPON REQUEST.   IT IS A SAD DAY FOR US TO EXPERIENCE BMW NOT DOING ANYTHING TO RESPOND TO OUR CLAIM AND/OR AT LEAST PREVENT FURTHER SAFETY HUMAN AND PROPERTY INJURIES RESULTING IN TRAGEDIES.",
        "vin": "WBA3X5C55ED"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "05/06/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093842,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PROCEEDING AT 50 MPH ON HEAVILY-TRAVELED 2-LANE COUNTRY ROAD,  THE ENGINE CUT OUT LEAVING THE CAR WITH NO PROPULSION.  I WAS ABLE TO COAST TO THE DRIVEWAY OF A LOCAL FARM AND COME TO A STOP SAFELY OFF THE ROAD.  MY REPEATED ATTEMPTS TO RESTART THE ENGINE WERE UNSUCCESSFUL.  I THEN CALLED FOR A WRECKER WHICH TOWED THE CAR TO THE BMW DEALERSHIP.  THE DEALER SUBSEQUENTLY INFORMED ME THAT THE FUEL PUMP HAD FAILED (REPAIR WORK WAS UNDER WARRANTY).    NOTE:  I PURCHASED THIS CAR NEW IN 2014.  AFTER THIS INCIDENT, I PERFORMED A GOOGLE SEARCH AND FOUND THAT MY YEAR/MODEL BMW HAD BEEN RECALLED FOR A FUEL PUMP ISSUE [NHTSA CAMPAIGN 15V189000].  I NEVER RECEIVED THAT RECALL NOTICE AND TO THE BEST OF MY KNOWLEDGE, AM NOT AWARE THAT THE REQUIRED WORK WAS EVER DONE.",
        "vin": "WBA3G7C52EK"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091963,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME AND CAR STOPS RUNNING I MEAN COMPLETELY STOPS RUNNING CARS AND TRUCK SWERVING TO KEEP FROM HITTING ME STUCK IN THE MIDDLE OF THE ROAD. AS I LOOK UP INFORMATION ABOUT BMW RECALLS I FIND THAT A RECALL HAS BEEN GIVES NON SERVAL CARS LIKE MINE IN 2015 AND BMW WON'T FIX MY CAR UNLESS I PAY $1600 FOR A NEW FUEL PUMP. C",
        "vin": "WBA3A5G50EN"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080676,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM EXPERIENCING THE SAME EXACT PROBLEM LISTED IN NHTSA CAMPAIGN NUMBER 15V520000. I HAVE CONTACTED BOTH BMW AND NHTSA ABOUT IT BUT TTGHEY HAVE SAID MYVIN IS NOT ASSOCIATED WITH THAT PROBLEM.  I HAVE SET AN APPOINTMENT WITH BMW BUT WILL HAVE TO PAY FOR THE REPAIR BECAUSE MY VIN IS NOT ASSOCIATED WITH THE RECALL.",
        "vin": "WBA3A5G6ENP"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/19/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080289,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IF DOORS ARE LOCKED. SPORADICALLY IT IS NOT POSSIBLE TO UNLOCK AND OPEN THE DRIVER OR PASSENGER'S FRONT DOOR FROM THE INSIDE USING DOOR HANDLE. IT IS POSSIBLE TO OPEN DOORS IF UNLOCKED WITH \"DOOR UNLOCK\". THIS IS A POTENTIAL SAFETY HAZARD AS IN THE EVENT OF CRASH IT WOULDN'T BE POSSIBLE TO LEAVE THE CAR IF ELECTRICAL POWER IS LOST.",
        "vin": "WBA3C1C55EK"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078844,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED ON THE FREEWAY. DRIVETRAIN MALFUNCTION ERROR APPEARED ON THE CAR'S INFO DISPLAYED AND THEN THE CAR STOPPED COMPLETELY. IT WOULD NOT START AFTER SEVERAL ATTEMPTS. MY LIFE WAS IN DANGER SINCE MY CAR LOST POWER IN THE MIDDLE OF THE FREEWAY AT NIGHT. GAS TANK WAS ABOVE ONE QUARTER.",
        "vin": "WBA3C1C52EK"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066859,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "INABILITY TO OPEN THE DRIVER DOOR TO EXIT THE VEHICLE AFTER THE VEHICLE IS STOPPED. I WAS INFORMED THAT IT MAY REPRESENT A FAILURE OF THE DOOR ACTUATOR. TO BE UNABLE TO EXIT THE VEHICLE IN THE EVENT OF AN EMERGENCY IS UNACCEPTABLE. THEY CLAIM THAT THE PROBLEM CAN OCCUR INTERMITTENTLY BEFORE COMPLETE FAILURE AND MAY NOT BE DETECTED BY THEIR DIAGNOSTICS. IT IS NOT A COVERED PART OR REPAIR DESPITE BEING A SAFETY ISSUE IN A VEHICLE UNDER THE ORIGNAL MANUFACTURER WARRANTY AND LIKELY REPRESENTS AN INTRINSIC DEFECT IN A VEHICLE WITH 36,000 MILES.",
        "vin": "WBA3A5C51EP"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066099,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG AND SEAT BELT OF PASSENGER SIDE LED TURNED ON. PARKING LIGHT TURNS ON AND DRIVER SEAT ALIGNMENT ON WITHOUT REASON.",
        "vin": "WBA3C1C57EK"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063397,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS EXPERIENCED TWO INCIDENTS OF UNINTENDED ACCELERATION.    ON JANUARY 15, 2018 IT OCCURRED AT FREEWAY SPEEDS (55 MPH) AND THE VEHICLE ACCELERATED TO APPROXIMATELY 95 MPH.  FORCIBLE APPLICATION OF THE BRAKES SLOWED THE VEHICLE AND THE ACCELERATION REVERTED TO NORMAL.    THE SECOND INCIDENT WAS ON JANUARY 17, 2018.  THIS OCCURRED ON A SURFACE STREET AT APPROXIMATELY 40 MPH.  THE VEHICLE ACCELERATED AGAIN TO AT LEAST 90 MPH, AND UPON APPLICATION OF BRAKES, REVERTED TO NORMAL OPERATION.    THE VEHICLE HAS APPROX 40,000 MILES ON IT.    I TOOK THIS CAR TO KUNI BMW IN BEAVERTON, OREGON.  THEY CHECKED OUT THE CAR AND REPORTED THAT THEY COULD NOT DUPLICATE THE PROBLEM.",
        "vin": "WBA3B3C57EJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048011,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW 328I. THE CONTACT STATED THAT THE HEADLIGHTS FAILED TO ILLUMINATE THE ROAD. THE VEHICLE WAS TAKEN TO PATRICK BMW (700 E GOLF RD, SCHAUMBURG, IL 60173) WHERE IT WAS DIAGNOSED THAT THE HEADLIGHT CASING NEEDED TO BE REPLACED; HOWEVER, THERE WAS NO AVAILABLE REMEDY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/11/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014587,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "WBA3A5C59EF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "05/20/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010417,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 75 MPH ON THE INTERSTATE WHICH WAS THE SPEED LIMIT AND I VIVIDLY REMEMBER HAVING MY CRUISE CONTROL SET AT THAT SPEED, PLUS OR MINUS 2 MPH. I WAS DRIVING BEHIND A PICKUP TRUCK THAT WAS 8-10 SECONDS AHEAD OF ME. THE PICKUP TRUCK WASN'T EQUIPPED WITH CRUISE CONTROL LIKE MY BLACK 328I BMW WAS SO THEY (A COUPLE) WERE TRAVELING SLOWER THAN I WAS AT THAT TIME. SO AS MY VEHICLE APPROACHES 4 SECONDS AWAY FROM THEIRS TRAVELING 75MPH (+ OR - 2 MPH). THEY BRAKED TO CHANGE LANES FROM THE LANE WE WERE TRAVELING TOGETHER TO THE OTHER LINE SINCE IT WAS A TWO LANE HIGHWAY. THEY DIDN'T SLAM THEIR BRAKES, THEY LIGHTLY PRESSED THEM BECAUSE A THIRD VEHICLE THEY WERE WAITING TO PASS IN ORDER TO SAFELY SWITCH LANES AND GIVE ME THE RIGHT AWAY. QUICKLY, I REACTED BY BRAKING AS WELL AND I COULD FEEL A HYDRAULIC LOCK IN THE BRAKE PEDAL. ALMOST LIKE I WAS TRYING TO PUSH DOWN ON CEMENT AND MY PEDAL WASN'T ACTING NORMAL WHILE BREAKING BUT ONLY HALF BREAKING LIKE IT WAS FULLY APPLIED WHEN I WAS PRESSING FIRMLY. I'M CONVINCED THAT THE VACUUM PUMP THAT SUPPLIES BRAKE POWER ASSISTANCE MAY HAVE BEEN MECHANICALLY FAULTY AND/OR FAILING FOR REASONS ONLY A MECHANIC COULD UNDERSTAND. NOW, I'VE BEEN A DRIVER FOR MANY YEARS AND THIS WAS MY FIRST BMW SO I DIDN'T KNOW WHAT TO THINK OF IT. I BOUGHT IT FOR A GREAT DEAL AT A PRE-OWNED CHEVY DEALERSHIP THAT SAID IT WAS ASE CERTIFIED BY THEIR MECHANICS PRIOR TO SELLING IT TO ME. SO WHY DID THIS HAPPEN TO ME? I'M ONLY 27 YEARS OLD, WITH THREE CHILDREN AND I COULD HAVE BEEN SERIOUSLY INJURED OR WORSE. I'M VERY SHAKEN UP BY THE WHOLE SITUATION BECAUSE THE LOSS OF BREAKING POWER PROVOKED AN UNAVOIDABLE COLLISION THAT MAKES ME LOOK LIKE A RECKLESS DRIVER WHEN JUST WANTED THE CAR TO STOP. IT JUST APPEARED THAT I COULDN'T BRAKE ON TIME BUT IN ACTUALITY, THE CAR SHOULD HAVE BEEN RECALLED FOR THIS.",
        "vin": "WBA3A5C56EF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11003415,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING DOWN A 35 MPH RD..I SLOWLY BEGAN TO BRAKE AS WE WERE APPROACHING A STOP LIGHT WHEN THE BRAKES DID NOT HOLD, I HIT THE BRAKE HARDER, THE CAR BEGAN TO BUCK FORWARD, I HIT THE BRAKE AS HARD AS POSSIBLE BUT THE BRAKES FAILED TO HOLD AND ONLY  STOPPED WHEN IT HIT THE CAR IN FRONT OF US.  THE POLICE CAME AND AN ACCIDENT REPORT WAS MADE. I DESCRIBED THE BRAKE FAILURE TO THE OFFICER BUT THEY ONLY SEEMED INTERESTED IN WRITING UP THE ACCIDENT REPORT.  WE HAD THE CAR TOWED TO OUR BODY SHOP AS WE WERE AFRAID TO DRIVE IN CASE THE BRAKES FAILED AGAIN.  OUR INSURANCE COMPANY WAS MADE AWARE OF THE ACCIDENT AND BRAKE FAILURE AND A TASK FORCE IS LOOKING INTO IT.  WHEN WE RETURNED HOME WE LOOKED UP THE POSSIBLE PROBLEM WITH BRAKES FAILING ON THE YEAR AND MODEL OF MY CAR. WE IMMEDIATE FOUND THREE ARTICLES LISTING MY EXACT CAR HAVING \"RESTRICTED OIL SUPPLY FROM THE INTAKE CAMSHAFT TO THE BRAKE VACUUM PUMP,WHICH MAY CAUSE THE BRAKE VACUUM PUMP TO FAIL, RESULTING IN A LOSS OF POWER BRAKE ASSIST.\"  IT ALSO SAID IN THE ARTICLE,  BIMMERFEST, THAT BMW NOTIFIED NHTSA  OF ITS INTENTION TO VOLUNTARILY RECALL MORE THAN 75,000 3 SERIES CARS DUE TO A POSSIBLE LOSS OF POWER BRAKE ASSIST THAT COULD RESULT IN THE VEHICLES FAILING TO STOP.  A MANDATORY RECALL WAS NEVER ISSUED AND SO THIS PROBLEM STILL EXISTS.  THIS IS EXACTLY WHAT OCCURRED WHEN TRYING TO STOP OUR CAR.    WE HAVE REPORTED THE PROBLEM TO OUR INSURANCE CO AND BMW CORPORATE.  WE ARE AWAITING AN ANSWER AND SOLUTION REGARDING OUR BRAKE ISSUE AND HOPE BMW WILL FINALLY REALIZE THERE IS A MAJOR PROBLEM AND WILL ADDRESS IT PROPERLY.    AS OF NOW I WILL NOT DRIVE MY 2014 328I XDRIVE SEDAN UNTIL I AM COMFORTABLE THAT BMW CORRECTS THE ISSUE TO MY SATISFACTION AND SAFETY.",
        "vin": "WBA3B5C54EP"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2017",
        "dateOfIncident": "06/04/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993063,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECENTLY STARTED TO EXPERIENCE A SIGNIFICANT SAFETY CONCERN. THE DOORS WILL NOT ALWAYS OPEN WITH THE DOUBLE HANDLE PULL AND WILL REQUIRE THAT I HIT THE POWER UNLOCK BUTTON. I'VE  FOUND SEVERAL SITES AND BLOGS DISCUSSING THIS KNOWN ISSUE. I WOULD HOPE THAT BMW ADDRESSES THIS AS IT IS A SIGNIFICANT SAFETY ISSUE IN THE EVENT I'M IN A CRASH WITH LOST POWER.",
        "vin": "WBA3A5C55EJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/09/2017",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984436,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -- 1.4 YEARS IS LONG ENOUGH!!!!!  LACK OF INFORMATION FROM BMW, DEALER HAS NO INFORMATION ON WHEN THEY WILL BE REPLACED.  MIDDLE OF 2016 THEY SAID EARLY SPRING OF 2017 AND STILL NO INFORMATION.  PLEASEE HELP, THIS IS WHY NHTSA EXISTS TO PROTECT CONSUMERS AND PUT PRESSURE ON THE BIG MANUFACTURERS TO FIX SERIOUS SAFETY ISSUES.  WE SERVED 52+ YEARS BETWEEN THE TWO OF US IN THE MILITARY AND DON'T CHOOSE TO BE SEVERELY INJURED BY AN AIRBAG IN A LUXURY VEHICLE THAT MIGHT SPRAY SHRAPNEL.",
        "vin": "WBAWR33569P"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "02/18/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956084,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2014 BMW 328I. WHILE DRIVING 55 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED AND FAILED TO RESPOND. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE SOFTWARE IN THE VEHICLE NEEDED TO BE UPDATED. THE CONTACT WAS ALSO INFORMED THAT THERE WAS A DIAGNOSTIC CODE FOR THE DRIVE TRAIN MALFUNCTION. THE SOFTWARE WAS UPDATED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 27,564.   UPDATED 05/31/17*LJ    *CN",
        "vin": "WBA3B5C54EP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936216,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW 328I. THE CONTACT STATED THAT THE BRAKE DRUM WAS RUSTED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER, BUT NOTHING COULD BE DONE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT BACK TO THE DEALER. THE FAILURE WAS NOT REMEDIED. THE FAILURE MILEAGE WAS APPROXIMATELY 17,000.",
        "vin": "WBA3A5G53EN"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10897907,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW 328I.  THE CONTACT STATED THAT WHILE THE VEHICLE GEAR SHIFTER WAS PLACED IN THE PARK POSITION, IT SLIPPED OUT OF THE PARK  POSITION INTO NEUTRAL INDEPENDENTLY AND ROLLED DOWN A HILL AND PINNED THE CONTACT BETWEEN THE VEHICLE AND THE BUMPER OF AN INDUSTRIAL BOX TRUCK.  THE AIR BAGS HAD NOT DEPLOYED.  A POLICE REPORT WAS FILED AND UNKNOWN INJURIES WERE SUSTAINED THAT REQUIRED MEDICAL ATTENTION.  THE VEHICLE WAS DRIVEN TO THE DEALER BUT THE FAILURE WAS NOT DUPLICATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 50,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "06/19/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876590,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WENT COMPLETELY DEAD ON A 6 LANE HIGHWAY. AFTER ALMOST 3 HOURS OF WAITING FOR BMW TOW SERVICE THE POLICE HAD THE CAR TOWED. WHAT HAPPENED PRIOR TO THE TOW WAS A CAR CRASHED INTO THE BACK OF THE POLICE CAR THAT WAS BEHIND US. AFTER 4 DAYS IN THE SHOP WE WERE TOLD THE CARS \"MAIN COMPUTER HAD A \"CATASTROPHIC\" FAILURE AND NEEDED TO BE REPLACED. I HAVE CALLED AND WRITTEN BMW CORPORATE AS MY WIFE IS SCARED TO DRIVE THE CAR AND I WAS HOPING THEY WOULD DISCUSS SOME KIND OF REPLACEMENT OR BUY BACK. THE CAR WAS TOTALLY WITHOUT ANY POWER INCLUDING THE EMERGENCY FLASHERS! THERE APPEARS TO ME TO BE A MAJOR SAFETY FLAW IN THE CARS DESIGN AND WANT YOU TO REVIEW WHAT HAPPENED BEFORE ANOTHER SERIOUS BREAKDOWN OCCURS.",
        "vin": "WBA3A5G52EN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "11/07/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818723,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW 3281. WHILE AT A STOP LIGHT WITH THE BRAKE PEDAL DEPRESSED, THE VEHICLE ACCELERATED INDEPENDENTLY. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER, BUT THE FAILURE WAS UNABLE TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 8,000. THE VIN WAS UNAVAILABLE.   UPDATED 03/04/16*LJ  *TR",
        "vin": "WBA3A5G59EN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "12/29/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816915,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUT DOWN WHILE DRIVING. FIRST TIME WHEN ONLY 3 TO 4 MONTHS OLD ON A HIGHWAY WITH 55 MPH SPEED LIMIT IN HEAVY TRAFFIC, WOULD NOT ENGAGE GEAR, HAD TO COAST WHILE ON THE HIGHWAY WITH FLASHERS ON TO REACH A SAFE LOCATION.  WAS REPAIRED AT THE TIME - SUPPOSEDLY COMPUTER CHIP PROBLEM.  HAS NOW OCCURRED FOR A SECOND TIME AT 16 MONTHS OLD, ON A LOCAL ROAD WITH 45 MPH SPEED LIMIT, VEHICLE INDICATED A FAILURE AND WOULD NOT RUN AFTER PULLING OVER TO SHOULDER.  BOTH INCIDENTS WERE DANGEROUS SITUATIONS IN TRAFFIC.  INDICATOR ON VEHICLE STATED ENGINE OR DRIVE TRAIN FAILURE OF SOME SORT.",
        "vin": "WBA3B5G59EN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "12/02/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809308,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE FREEWAY WITH MY SON IN THE BACK SEAT WHEN ALL OF A SUDDEN I HEARD A REALLY LOUD EXPLOSION. I HAD NO IDEA WHAT HAD HAPPENED, IT ALMOST SOUNDED LIKE A LOUD GUNSHOT.  I HEARD PARTICLES FALLING ON MY CAR, BUT I DID NOT KNOW WHAT THEY WERE. I GOT OFF OF THE FREEWAY JUST TO MAKE SURE THAT IT WASN'T MY CAR. SURE ENOUGH, WHEN I GOT OUT, I SAW A BASKETBALL SIZE HOLE IN MY MOON ROOF. I KNEW THAT NOTHING HAD HIT THE MOON ROOF BECAUSE I HAD NOT GONE UNDER AN OVERPASS NOR I HAD I SEEN ANYTHING COMING AT ME THAT WOULD HAVE CAUSED THIS DAMAGE. I WENT HOME AND CHECKED ON THE INTERNET AND SAW DAMAGE TO ANOTHER BMW THAT LOOKED ALMOST IDENTICAL TO MINE. THE DRIVER OF THAT VEHICLE EXPLAINED THE SAME EXPERIENCE THAT I DID, THAT HE HAD HEARD A LOUD BOOM OR POP AND THERE APPEARED A HUGE HOLE IN HIS MOONROOF. THIS EXPLODING MOONROOF PHENOMENA IS NOT JUST A BMW PROBLEM APPARENTLY. I SAW VEHICLES OF ALL TYPES THAT HAVE EXPERIENCED THIS. MY SON AND I WERE LUCKY. ALL WE EXPERIENCE WAS A HUGE SCARE AND SOME FALLING GLASS, BUT HAVE THERE BEEN MORE TRAFFIC ON THAT FREEWAY, WE MIGHT NOT HAVE MADE IT. THIS IS OBVIOUSLY A PROBLEM WITH THE AUTO GLASS THAT IS BEING INSTALLED IN THESE VEHICLES AND IS A HUGE ROAD HAZARD. THE VEHICLE MANUFACTURERS HAVE KNOWN ABOUT THIS FOR QUITE SOME TIME, AND NOTHING HAS BEEN DONE ABOUT IT . UNFORTUNATELY, LIVES MAY BE LOST AS A RESULT . SOMETHING DEFINITELY NEEDS TO BE DONE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788147,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 BMW 328I WAS REAR-ENDED ON A FREEWAY RAMP DURING RUSH HOUR (AROUND 5PM OCT. 30, 2015). THE TRAFFIC WAS STOP AND GO. MY CAR WAS STILL WHEN THE CAR BEHIND HIT. THE IMPACT TO MY REAR BUMPER CAUSED THE SEAT BELT TO LOCK DOWN. THE SEAT BELT HELD ME VERY TIGHT (ALMOST STRANGLED) ME AND WOULD NOT EJECT NOR RELEASE. AFTER MORE THAN 5 MINS, I WAS ABLE TO PULLED IT OUT WHILE HOLDING THE EJECT BUTTON. ON TOP OF THE SEAT BELT LOCK-DOWN, MY CAR WOULD NOT RE-START. THE SYSTEM GAVE A \"CHASSIS STABILITY\" WARNING AND WOULD NOT RESPOND TO SHIFTING GEAR OR ANY OPERATIONS. I COULD NOT MOVE THE CAR OUT OF TRAFFIC TO THE SHOULDER. THE CAR EVENTUALLY WAS TOWED OFF THE FREEWAY RAMP.     FORTUNATELY, ALL VEHICLES WERE MOVING SLOW DUE TO THE RUSH HOUR. OTHERWISE, EITHER OF THE SITUATION (LOCKED DOWN SEAT BELT OR THE STALLED VEHICLE WITH A BUMPER IMPACT) WOULD HAVE KILLED ME ON THE FREE WAY.",
        "vin": "WBA3C1C5XEK"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/01/2015",
        "dateOfIncident": "09/28/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778977,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2014 BMW 328I XDRIVE, SLOWING FROM ~30MPH INTO AN INTERSECTION FOR A LEFT HAND TURN IN A RESIDENTIAL/SHOPPING AREA. UPON APPLYING THE BRAKES, THE BRAKE PEDAL MOVED BUT THE CAR DIDN'T SLOW. I THEN SMASHED THE BRAKE PEDAL TO THE FLOOR, STILL THE CAR DIDN'T SLOW. I CONTINUED HOLDING THE BRAKE PEDAL AND THE CAR SHOOK VIOLENTLY FINALLY STARTED SLOWING. ONCE SLOW ENOUGH TO MAKE THE TURN, I COASTED THROUGH THE INTERSECTION AND STOPPED ON THE SHOULDER.  GOING THROUGH THE TURN AND THE INTERSECTION, I WAS BEHIND A DUMP TRUCK. THE ISSUE BROUGHT ME WITHIN INCHES OF SLAMMING INTO THE BACK OF THE TRUCK, BUT LUCKILY THE TRUCK TURNED IN TIME FOR ME NOT TO HIT IT.  ONCE MY CAR WAS STOPPED ON THE SHOULDER, I CALLED THE BMW DEALERSHIP THAT I HAD JUST LEFT AND WAS ADVISED TO HIT THE SOS BUTTON AND HAVE MY CAR TOWED TO THEM. THE SERVICE ADVISOR (SA) RAN DIAGNOSTICS & TOOK THE CAR ON SEVERAL TEST DRIVES. HE SAID THAT NOTHING PINGED ON THE DIAGNOSTICS READING AND HE COULDN'T REPLICATE THE PROBLEM, SO MY CAR WOULD BE RETURNED TO ME. I CONTINUED RESEARCHING THE PROBLEM AND FOUND AN ARTICLE WHICH DESCRIBES THE SYMPTOMS THAT MY CAR HAD: HTTP://WWW.AUTOBLOG.COM/2013/09/28/BMW-3-SERIES-5-SERIES-X1-X3-Z4-BRAKE-RECALL/ AND SENT IT TO MY SA TO LOOK INTO.  THE SA TOLD ME THAT MY ACCOUNT OF WHAT HAPPENED TO ME FIT THE DESCRIPTION OF RECALL, BUT SINCE MY CAR WAS BUILT IN 09/13 IT WAS 1 MONTH OUTSIDE OF THE RECALL RANGE, AND NO PREVENTATIVE WORK COULD BE DONE UNTIL A RECALL IS ISSUED.  MY CAR WAS RETURNED TO ME WITHIN 1 DAY OF THE INCIDENT. WHEN INSPECTING MY PRINTED BMW SERVICE DOCUMENT, THE CUSTOMER SERVICE COMPLAINT IS IMPROPERLY LISTED AS 'THE CAR WAS VIBRATING BRAKING AND WOULD NOT START' (START NOT STOP). BMW ASSURED ME THAT THE PROPER PROBLEM WITH STOPPING WAS RECORDED IN THE COMMENTS SECTION OF THEIR DATABASE, BUT THAT THEY COULD NOT GO IN AND ALTER THE ISSUE DESCRIPTION.",
        "vin": "WBA3B5C5XEP"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2015",
        "dateOfIncident": "09/10/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763174,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE FREEWAY AND ALL OF THE SUDDEN ENGINE GIVES OUT AND CAR GOES INTO \"LIMP MODE\" CRUISE CONTROL WAS SET AT 76 MPH AND SUDDENLY IT GOES TO 60 MPH, I ALMOST GOT REAR ENDED BY ANOTHER VEHICLE AS I HAD NO CONTROL OVER THE VEHICLE POWER. VEHICLE CONTINUES TO DRIVE BUT DOES NOT GO OVER 60 MPH, SHUDDERS AND SHAKES THE ACCELERATION IS VERY MILD TO PUT IT LIGHTLY. POSES A MAJOR SAFETY RISK. THIS IS 3RD THAT THAT IT HAS HAPPENED TO THIS VEHICLE. THIS IS WELL DOCUMENTED UNDER BMW 328I (2012 - ONWARDS) FORUMS HTTP://F30.BIMMERPOST.COM/FORUMS/SHOWTHREAD.PHP?T=776020    DEALER REFUSES TO DO ANYTHING.",
        "vin": "WBA3C1C51EK"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2015",
        "dateOfIncident": "05/14/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724660,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG THE STREETS, WHILE IT WAS HEAVILY RAINING. WHILE I WAS STUCK IN TRAFFIC, MY CAR SUDDENLY STOPPED WORKING (NOTE: THERE WERE CARS BEHIND ME, IN FRONT OF ME, AND RIGHT NEXT TO ME). WHILE I WAS STUCK IN TRAFFIC AND STEPPING ON MY BRAKES, THE MOMENT I LET GO OF THE BRAKES TO MOVE FORWARD BY STEPPING ON THE GAS, IT WOULDN'T MOVE. THEN I TRIED STEPPING ON THE BRAKES AND THE BRAKES STOPPED WORKING TOO, SO I HAD TO PUT MY CAR ON PARK BECAUSE I WAS AFRAID IT WOULD START ROLLING BY ITSELF WITHOUT MY CONTROL. WHEN I ATTEMPTED TO PUT IT BACK IN DRIVE, IT WOULDN'T LET ME. THE SIGNAL STILL SAID P FOR PARK, AND IT WOULDN'T WORK IN REVERSE MODE NOR NEUTRAL MODE EITHER. THEN I TRIED TURNING OFF MY VEHICLE AND TRIED RE-STARTING IT. WHEN I TRIED TO RE-START MY VEHICLE, THE WHOLE VEHICLE JUST SHUT DOWN, AND WOULDN'T START UP ANYMORE.     ALL THE OTHER CARS AROUND ME WERE ABLE TO DRIVE JUST FINE, AND EVEN HAD TO DRIVE PAST ME BECAUSE MY CAR STOPPED WORKING IN THE MIDDLE OF THE STREET DURING THE RAIN. THE FIREMEN AND POLICEMEN ENDED UP COMING TO TRY TO RE-START MY ENGINE, BUT IT DIDN'T WORK, SO THEY ENDED UP HAVING TO TOW MY CAR AWAY TO AVOID TRAFFIC (SO ALL THE OTHER CARS CAN DRIVE THROUGH WITHOUT GOING AROUND ME). BMW SAID MY CAR STOPPED DUE TO WATER DAMAGE, SPECIFICALLY DAMAGING THE ENGINE, COSTING ROUGHLY AROUND $18,000. HOWEVER, ALL THE OTHER CARS AROUND ME DROVE IN THE SAME LANE, SAME SPOT, AND SAME TIME IN THIS HEAVY RAIN JUST FINE. I DON'T KNOW WHY MY VEHICLE WAS THE ONLY ONE THAT WAS SEVERELY DAMAGED BY \"WATER\" WHEN ALL THE OTHER CARS AROUND ME WERE JUST FINE. I BELIEVE THERE'S SOMETHING WRONG WITH THE CAR ITSELF, FOR THE CAR SHOULD BE ABLE TO HANDLE HEAVY RAIN LIKE ALL THE OTHER CARS THAT WERE DRIVING JUST FINE AROUND ME.  *TR",
        "vin": "WBA3C1C54EK"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2015",
        "dateOfIncident": "05/03/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715207,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED IN DRIVEWAY OF GAS STATION, JUST BEFORE I WAS ABOUT TO TURN ONTO STREET.  ENGINE WOULD CRANK WHEN START BUTTON WAS PRESSED, BUT CAR WOULDN'T START.  *TR",
        "vin": "WBA3B5G59EN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "03/08/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692999,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE LOCAL HIGHWAY AND ATTEMPTED TO STOP ON RED LIGHT, THE CAR STOPPED FIRST AND THEN UNEXPECTELY JUMPPED UP, SLIDING FORWARD AND HIT THE FRONT VEHICLE WHILE BRAKE PEDAL WAS FULLY PRESSED.   *TR",
        "vin": "WBA3A5G57EN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669900,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG WITH MY TWIN 6 YEAR OLD DAUGHTERS IN MY 4 MONTH OLD 2014 BMW 328 DRIVE M SPORT WHEN ALL OF A SUDDEN THE CAR STALLED WITH VERY LITTLE TO NO WARNING.  THE CAR WAS NOT ABLE TO START.  LUCKILY WE WERE IN A PARKING LOT WHEN THIS HAPPENED.  HAD I BEEN DRIVING ON THE HIGHWAY IT COULD HAVE BEEN A MUCH WORSE SITUATION.  HOW DOES A BRAND NEW VEHICLE HAVE THIS PROBLEM.  DEALER SAID THEY THINK IT IS A FUEL PUMP FAILURE.  A FUEL PUMP FAILURE ON A 2014 VEHICLE RECEIVED IN AUGUST OF 2014?  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2014",
        "dateOfIncident": "12/11/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668617,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES WHEN I ACCELERATE TO PASS A CAR OR SEMI TRUCK THE ENGINE STALLS OR MISFIRES.   IT GOES INTO A LIMP MODE AND SLOWS DOWN IN THE MIDDLE OF PASSING AND I'M FORCED TO PULL OF ON THE SIDE OF THE ROAD AND SHUT THE CAR OFF AND TRY TO RESET IT.   THIS IS THE SECOND 2014 BMW 328I THAT HAS DONE THIS.  THEY COULD NOT FIX MY FIRST 2014 BMW 328I THAT HAD THE SAME PROBLEM AND I HAD TO USE THE LEMON LAW TO GET THEM TO BUY IT BACK. IT IS RIDICULOUS THAT THE SECOND NEW CAR IS NOW DOING THE SAME THING.   BMW OF MACON JUST KEEPS IT AWHILE AND CHANGES A FEW PARTS AND TELL ME ITS FIXED.   WITHIN LESS THAN A WEEK OF HAVING THE CAR BACK IT IS DOING THE SAME THING.  THE PARTS THEY PUT ON LAST TIME WERE NOT EVEN NEW, THE TOOK THEM OFF OF A LOANER CAR.  I DON'T FEEL SAFE ON THE ROAD BECAUSE I NEVER KNOW WHEN ITS GOING TO STALL/MISFIRE ON THE INTERSTATE AGAIN.  WILL IT BE IN FRONT OF A SEMI TRUCK THAT REAR ENDS ME OR WILL I GET HIT TRYING TO GET OFF THE ROAD TO RESTART/RESET IT.  WILL IT RESTART AT ALL?  I FEEL LIKE THERE IS A SAFETY ISSUE WITH THIS VEHICLE MODEL. THIS IS THE SECOND CAR WITH THE SAME ENGINE DEFECT.  I FEEL LIKE THEY ARE JUST WAITING TILL MY WARRANTY GOES OUT, WHERE THEY CAN TAKE ADVANTAGE OF ME EVEN MORE.  *TR",
        "vin": "WBA3A5C51EP"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "10/30/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10659927,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 TOYOTA HIGHLANDER OBSERVED RUNNING RED LIGHT AND T-BONED THE DRIVER'S SIDE OF A 2014 BMW 328IX.  IMPACT OF COLLISION WAS MEANINGFUL AND DIRECT, GENERATING IN EXCESS OF $10,000 OF STRUCTURAL REPAIRS TO DRIVER'S SIDE ALONE.  NO AIR BAG DEPLOYMENT (FRONT, SIDE, CURTAIN, ETC) IN THE BMW DESPITE OF MAGNITUDE, FORCE AND PLACEMENT OF THE COLLISION.  DRIVER OF BMW SUSTAINED SEVERE HEAD, FACIAL AND BODILY INJURIES REQUIRING INVASIVE MEDICAL ATTENTION AND PROTRACTED PHYSICAL THERAPY.  *TR......UPDATED 12/15/15 *BF   UPDATED 9/7/2017*CN",
        "vin": "WBA3B5G59EN"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "07/04/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650556,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON INTERSTATE 10, DURING THE ACCELERATION, THE ENGINE COMPLETELY LOST ITS POWER. I HAD TO IMMEDIATELY PULL OVER BEFORE I LOST THE MOMENTUM.THE CA HIGHWAY PATROL PUSHED ME TO A SAFE PLACE. THE VEHICLE WAS TOWED TO THE DEALER AND THE DEALER REPLACED THE ENTIRE FUEL TANK. THE SECOND INCIDENT WAS ALMOST 20 DAYS AFTER AGAIN DURING THE ACCELERATION ON FREEWAY AT THE SPEED OF 70, THE ENGINE LOST ITS POWER IN A WAY THAT THE CAR DID NOT PROCEED FOR A WHILE. THE DEALER ADVISED THAT IT WAS NOTHING WRONG WITH ENGINE BECAUSE THEY COULD NOT READ ANY ERROR IN THE SYSTEM AND II HAD TO WAIT TILL I RECEIVE AN ERROR ON THE LCD. I NOTIFIED THEM THAT IT IS A SERIOUS PROBLEM SPECIFICALLY ON THE FREEWAY BECAUSE LOSS OF POWER CAN CAUSE AN ACCIDENT, BUT TO NO AVAIL.   *TR",
        "vin": "WBA3C1C54EK"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "08/07/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631073,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUG, 7TH I WAS INVOLVED IN A MINOR ACCIDENT ON THE EXPRESSWAY.  THE 1ST VEHICLE APPLIED THEIR BRAKES TO AVOID ANOTHER 2 CAR ACCIDENT, I APPLIED MY BRAKES AS WELL HOWEVER I WAS UNABLE TO SLOW DOWN IN TIME TO AVOID THE 1ST VEHICLE AND I REAR ENDED THE VEHICLE. BOTH VEHICLES HAD SLIGHT DAMAGED TO THEIR BUMPERS. NO INJURIES WERE REPORTED.  DURING THE TIME OF ME APPLYING MY BRAKES I HAD ENOUGH TIME AND DISTANCE TO MAKE A JUDGMENT CALL TO A.  HIT THE CALL IN FRONT OF ME OR B. HIT THE CONCRETE WALL MEDIUM, WHILE AT THE SAME TIME SAYING 'WOW' I AM REALLY ABOUT TO HIT THIS CAR. I WRESTLED WITH THE THOUGHT OF MY BRAKES MALFUNCTIONED THAT DAY. TAKING EVERYTHING INTO ACCOUNT ON A BRAND NEW CAR THE BRAKES FAILED. WHEN I APPLIED MY BRAKES IT SEEMS LIKE I GLIDED INTO THE OTHER CAR ALSO I HAD MY LUNCH BAG AND PURSE IN THE FRONT SEAT. NONE OF THE ITEMS IN THE FRONT SEAT WENT FLYING TO THE FLOOR. THEY WERE STILL IN TACK IN THE FRONT SEAT WHEN I PULLED OVER. FINALLY THIS IS MY 2ND BMW (1ST PURCHASE IN 2009) I KNOW HOW THEY DRIVE AND HANDLED IF THE CAR WAS OPERATING CORRECTLY I WOULD HAVE STOP WITH NO PROBLEM. I HAVE REACHED OUT TO BMW NORTH AMERICAN TO INQUIRE ABOUT RECALLS AND REPORT THE PROBLEM ON 8/25/2014 HOWEVER I HAVE NOT HEARD NOR BEEN ABLE TO GET IN CONTACT WITH MY CASE MANAGER TO DATE.  *TR",
        "vin": "WBA3A5C51EF"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2014",
        "dateOfIncident": "07/30/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618132,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST AFTER GETTING ON THE HIGHWAY, I GOT AN WARNING MESSAGE THAT READ - \"CHASSIS: DRIVE MODERATELY.  CONSULT SERVICE CENTER.\"  THIS IS THE 3RD TIME I GOT THIS WARNING.  IT HAS BEEN AT THE DEALER FOR SERVICE THE PAST 2 TIMES.  I HAVE NOT BEEN ABLE TO GET A GOOD ANSWER FROM THE DEALER AS TO WHAT PROBLEMS THIS MIGHT CAUSE.  I DO NOTICE THE SUSPENSION DOESN'T WORK AS WELL WHEN IT THROWS THIS ERROR.  *TR",
        "vin": "WBA3A5C50EJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2014",
        "dateOfIncident": "04/28/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586482,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY, THE CAR REPORTED AN ERROR \"CHASSIS: DRIVE MODERATELY. CONSULT SERVICE CENTER.\"  THERE WERE NO OTHER SYMPTOMS.  I DROVE STRAIGHT TO THE SERVICE CENTER.  THE PROBLEM WAS NOT REPRODUCIBLE AT THE SERVICE CENTER AFTER TURNING THE CAR OFF.  AFTER A COUPLE OF DAYS IN THE SERVICE CENTER THE ACCELERATION SENSOR WAS REPLACED.  THE DAY I RECEIVED THE CAR, I GOT THE SAME ERROR, THIS TIME WHILE DRIVING AT AROUND 20 MPH.  ON STOPPING AND RESTARTING, THE ERROR WAS NOT REPRODUCIBLE.  500 OR SO MILES LATER, I GOT THE ERROR ONCE AGAIN, THIS TIME AT AROUND 40 MPH.  AND AGAIN, ON SHUTTING THE CAR OFF AND RESTARTING THE ERROR WAS NOT REPRODUCIBLE.  I PLAN TO CONTACT THE SERVICE CENTER AGAIN TOMORROW.  *TR",
        "vin": "WBA3A5C50EJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/25/2014",
        "dateOfIncident": "04/24/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584790,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIGHT KNOCKING SOUND WHEN CAR IS IDLING. CAR SHAKES, WHEN IT IS AT IDLE, DURING TRAFFIC, THE COMPLETE CAR SHAKES, EVEN THE STEERING WHEEL SHAKES AND VIBRATE!  *TR",
        "vin": "WBA3A5C53EJ"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/13/2014",
        "dateOfIncident": "04/06/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579413,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TO PARK IN A CUL-DE-SAC GOING ABOUT 5 MPH, WHILE I WAS HALF WAY THROUGH THE CUL-DE-SAC THE BMW 328D HAD A SUDDEN ACCELERATION AND IN A VERY HIGH SPEED CRASHED INTO A TREE. I DO NOT RECALL THE EXACT SPEED WHEN IT CRASHED BUT IT WAS VERY HIGH, IT FELT AND SOUNDED LIKE A RACE CAR. MY FOOT WAS ON THE BREAK RIGHT WHEN IT ACCELERATED. IT SEEMS LIKE A MAJOR MECHANICAL / ELECTRICAL PROBLEM WITH THIS CAR. CALLED BMW HQ TO REPORT THE ISSUE. A CASE MANAGER HAS BEEN ASSIGNED BUT NO ONE CONTACTED ME YET.   *JS",
        "vin": "WBA3D3C53EK"
    },
    {
        "components": "EXTERIOR LIGHTING,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "03/07/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568732,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE OF THE REAR RIDE HEIGHT SENSORS CONTROLLING THE ADAPTIVE XENON HEADLIGHTS FAILED (BOLT BROKE).  THIS CAUSED THE HEADLIGHTS TO AIM DOWN AT THE LIMIT OF THEIR ADJUSTMENT, EFFECTIVELY GIVING THE DRIVER ONLY 20 OR SO FEET OF VISIBILITY AT NIGHT.  WE HAD TO USE THE HIGH BEAMS TO GET ANY REASONABLY VISIBILITY TO DRIVE SAFELY.  *TR",
        "vin": "WBA3D5C59EK"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2013",
        "dateOfIncident": "11/04/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550798,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MERGING ONTO THE INTERSTATE AND GOT INTO THE PASSING LANE. I THEN SHIFTED FROM 3RD GEAR TO 4TH AND THE CAR STARTED TO SHAKE AND LOSE POWER (LIMP HOME MODE). THE DISPLAY SAID DRIVETRAIN MALFUNCTION, DRIVE MODERATELY, ETC. AND THE CHECK ENGINE LAMP CAME ON. I SHIFTED TO 5TH GEAR TO SEE IF IT WOULD HELP AND HAD THE SAME LOW POWER ISSUE. I THEN CHANGED TWO LANES TO GET ONTO THE SHOULDER. I TURNED THE CAR OFF AND WAITED BRIEFLY AND RESTARTED THE CAR. THE LAMPS WERE OFF AND THERE WAS NO ISSUE. I PHONED THE DEALERSHIP AND THEY STATED THEY GET THIS TYPE OF CALL OFTEN AND IT IS A 'NORMAL GLITCH.' I SHOULD DRIVE IT AND SEE IF IT HAPPENS AGAIN AS IT USUALLY DOESN'T OR I COULD BRING THE CAR IN.  *TR",
        "vin": "WBA3A5C50EJ"
    }
]