[
    {
        "components": "STEERING,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406219,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335XI",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN AN ACCIDENT YESTERDAY AT MY JOB PULLING INTO A PARKING SPACE FOOT ON BRAKE PEDAL, WHEN MY CAR ACCELERATED INTO A PARKED TRUCK. I AM STILL IN DISABLED THIS HAPPENED. I KNOW I DID NOT BIT THE GAS BY MISTAKE AS THAT I WASN'T USING THE GAS PEDAL I WAS PULLING IN THE SPACE USING THE BRAKE I DRIVE WITH MY RIGHT FOOT ONLY AND CAN'T PUSH TWO PEDALS AT ONCE. I TURNED THE CAR OFF IMMEDIATELY AND THEN STARTED IT AGAIN AND BACKED OFF THE TRUCK . I'VE PARKED IN PARKING SPACES FOR YEARS AND NEVER EXPERIENCED ANYTHING LIKE THIS BEFORE .",
        "vin": "WBA3X9C55ED"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "12/13/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384029,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335XI",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW 2014 335XI GT 63900 MILES  VIN:[XXX]    SHIFTED TO NEUTRAL WHEN DRIVING IN MOTION ON HIGHWAY AND LOSE POWER WITHOUT WARNING LIGHT AND STUCK ON ROAD AND TOWED TO THE DEALER AND THEY SUGGEST TO REPLACE THE ENGINE COST 23K, AND  THE REPORTS SAID THE REASON MAY BE DUE TO FUEL PUMP OR PREVIOUS OIL LEAK. THIS ISSUE IS INCREDIBLY DANGEROUS AS IT CAN LEAVE ANYONE STRANDED ANYWHERE. THIS CAR IS ONLY 6 YEARS OLD. NO WARNING LIGHT SHOWED PREVIOUSLY.  I WAS DOING REGULAR OIL CHANGE AND MAINTENANCE AND FIXED THE OIL LEAK. I THOUGHT IT DUE TO THE RECALL CASE BELOW: IMPROPER PLATING ON FUEL PUMP MAY RESULT IN STALL  IF THE FUEL PUMP FAILS, THE VEHICLE MAY STALL WITHOUT WARNING, INCREASING THE RISK OF A CRASH.  NHTSA CAMPAIGN NUMBER: 15V189000  MANUFACTURER BMW OF NORTH AMERICA, LLC  COMPONENTS FUEL SYSTEM, GASOLINE  MY CAR IS EXPERIENCING THE SAME SYMPTOMS AS INDICATED IN NHTSA CAMPAIGN NUMBER: 15V189000 (FUEL SYSTEM, GASOLINE) BUT VEHICLE IS NOT INCLUDED IN THAT RECALL OF BMW  POTENTIAL NUMBER OF UNITS AFFECTED 18,054    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBA3X9C55ED"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2017",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969839,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335XI",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED ON ROAD WAY WHILE GOING 50 PLUS MILES AN HOUR. SHUTTING OFF COMPLETELY. POLICE WERE CALLED. COULD NOT GET CAR TO SHIFT AND MOVE. NEEDED TWO DIFFERENT TOW TRUCKS TO GET DOLLIES TO MOVE CAR. BMW REPLACED FUEL PUMP. BMW SAYS WARRANTY ON NHTSA FOR MY YEAR MAKE AND MODEL DOES NOT APPLY TO MY VEHICLE. I AM SCARED FOR MY LIFE. FELT LIKE I WAS GOING TO GET KILLED AS CARS HONKED GOING 60 MILES AN HOUR AROUND ME AT 830 AT NIGHT ON BEACH BLVD.",
        "vin": "WBA3A9G57EN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2015",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811186,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335XI",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SUPPLY MODULE (FUEL PUMP) FAILED IN MY 2014 BMW 335I XDRIVE. MY WIFE WAS DRIVING TO WORK WHEN ENGINE COMPLETELY QUIT. CAR STOPPED IN THE LEFT LANE DUE TO THE STALLED ENGINE. SHE WAS LUCKY THAT POLICE OFFICER WAS ABLE TO STOP TRAFFIC AND PUSH THE CAR TO THE SHOULDER. CAR WAS TOWED TO BMW DEALER. DEALER REPLACED FUEL SUPPLY MODULE UNDER WARRANTY. REPRESENTATIVE MENTIONED THAT THERE'S NO OPEN RECALLS FOR MY CAR'S VIN. I ATTACHED A PICTURE OF REPAIR INVOICE THAT LISTS VIN AND PART NUMBER OF THE FAILED FUEL PUMP.",
        "vin": "WBA3B9G56EN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/2015",
        "dateOfIncident": "01/06/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693912,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335XI",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW 335XI. THE CONTACT STATED THAT THERE WAS A LEAK IN THE ROOF OF THE VEHICLE. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE RUBBLE DRAINAGE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 9,000.",
        "vin": "WBA3X9C52ED"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/25/2015",
        "dateOfIncident": "12/31/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678804,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335XI",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE VEHICLE ON A HEAVY TRAFFIC HIGHWAY. ROAD CONDITION IS DRY, CLEAN. THE CAR IN FRONT OF ME SLOWED DOWN, THEN I PRESSED BRAKE. I DIDN'T FEEL ANY SPEED DECREASE SO I PRESSED THE BRAKE EVEN HARDER. I FELT THE BRAKE WAS VERY HARD EVEN IMPOSSIBLE TO PRESS DOWN, WHICH IS VERY STRANGE. BUT MY CAR STILL BUMPED INTO THE FRONT CAR AND STOPPED. THERE WAS SUFFICIENT DISTANCE BETWEEN THE TWO CARS AND I SHOULD HAVE TOTALLY STOPPED MY CAR IN TIME.   I CONTACTED MY DEALERSHIP AND BMW MANUFACTURER IMMEDIATELY AFTER THE ACCIDENT AND SENT MY CAR BACK TO THE DEALERSHIP A COUPLE OF DAYS LATER. NOW BMW IS MAKING AN INVESTIGATION ON MY CAR TO DIAGNOSE THE PROBLEM. I HAVE NOT RECEIVED ANY DIAGNOSIS YET.  *TR",
        "vin": "WBA3B9G51EN"
    }
]