[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/18/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375897,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "750I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE DOORS SOMETIMES WILL NOT OPEN FROM THE INSIDE WHEN USING THE DOOR HANDLE FORCING ME TO RESET THE AUTOMATIC LOCKS FROM THE CENTER DASHBOARD CONTROL. I BROUGHT IT TO MY BMW DEALER AND WAS TOLD THAT DOOR CABLES CAN STRETCH EVEN WITH NORMAL USE AND NEED TO BE REPLACED AT A COST OF $580. I HAD A SIMIALR PROBLEM WITH PREVIOUS 2012 BMW 7 SERIES AND ONE ONE OCCASION I HAD TO DRIVE HOLDING THE DOOR SHUT UNTIL I REACHED THE SERVICE CENTER. I ALSO HAD TO REPLACE A HOOD CABLE ON MY 2012BMW 750 AS THAT CABLE FAILED AS WELL AND I COULD NOT OPEN THE HOOD. THE  PROBLEM WITH MY DOOR IS INTERMITTENT AND MY CONCERN IS THAT  IF THERE IS AN ACCIDENT OR FIRE I MAY BE TRAPPED IN THE VEHICLE IF I AM UNABLE TO QUICKILY OPEN THE DOOR.. BMW WAS UNWILING TO COVER THIS AS MY WARRANTY HAD JUST EXPIRED. I WOULD THINK THAT MANY OWNERS MAY NOT KNOW OF THIS POTENTIAL PROBELM UNTIL IT IS TOO LATE AND SOMEONE IS INJURED DUE TO THE POOR QUALITY CABLES THAT BMW SEEMS TO BE USING IN ITS VEHCLES.",
        "vin": "WBAYB6C57ED"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "07/31/2015",
        "dateOfIncident": "05/27/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10745428,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "750I",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 (NA) BMW 750I. WHILE THE VEHICLE WAS AT A STOP SIGN, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE. AS A RESULT, THE DRIVER SIDE HEAD REST BLEW UP AND IMPACTED THE BACK OF THE CONTACT'S HEAD AND NECK. THE CONTACT SUSTAINED HEAD AND NECK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS NOT DIAGNOSED. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE HEAD REST WAS PERFORMING AS DESIGNED. THE APPROXIMATE FAILURE MILEAGE WAS 7,000.",
        "vin": "WBAYB6C57FD"
    }
]