[
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110811,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "G 650 GS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW G 650 GS. WHILE DRIVING AT AN UNKNOWN SPEED, THE MOTORCYCLE STALLED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT STATED THAT THE MOTORCYCLE WAS UNABLE TO RESTART. THE CONTACT ALSO STATED THAT THE MOTORCYCLE FAILED TO STOP WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE MOTORCYCLE WAS TOWED TO CROSS COUNTRY BMW (911 MIDDLESEX AVE, METUCHEN, NJ 08840, (732) 635-0094), BUT THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 6,700.",
        "vin": "WB1018902EZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825378,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "G 650 GS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW G 650 GS. WHILE RIDING AT 5 MPH, THE MOTORCYCLE STALLED WITHOUT WARNING. THE MOTORCYCLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 15V537000 (ELECTRICAL SYSTEM, ENGINE AND ENGINE COOLING), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE FAILURE RECURRED INTERMITTENTLY. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 4,000.",
        "vin": "WB1018909EZ"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2015",
        "dateOfIncident": "12/10/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809569,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "G 650 GS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY MOTORCYCLE IN FOR THE RECALL, #15V537 ENGINE CONTROL UNIT SOFTWARE (REPROGRAMMING TO ELIMINATE A HAZARDOUS STALLING PROBLEM) IN OCT 2015. THE REQUIRED REPAIR WAS DONE.  THE VEHICLE EXHIBITED THE SAME PROBLEM AFTER APPROXIMATELY TWO WEEKS.  I BROUGHT THE VEHICLE BACK AND THE RECALL REPAIR WAS COMPLETED AGAIN.  AFTER ABOUT TWO WEEKS ON A HEAVILY FOGGY DAY THE VEHICLE EXHIBITED THE SAME PROBLEM.  I RODE IT FOR A FEW MORE DAYS (CLEAR WEATHER) WITH NO PROBLEM AND THEN ON ANOTHER HEAVILY FOGGY DAY I RODE AND HAD THE SAME PROBLEM.  I CONTACTED THE DEALERSHIP AND BROUGHT THE BIKE IN FOR DIAGONOSTICS.  THEY MADE NUMEROUS TEST RIDES ON A BEAUTIFUL SUNNY DAY AND COULD NOT DUPLICATE THE PROBLEM.  SINCE I REPORTED TO THEM THE PROBLEM OCCURRED ON FOGGY DAYS THEY SAID THERE WAS NOTHING THEY COULD DO.  THEY SUGGESTED THAT IF IT HAPPENED AGAIN TO BRING THE MOTORCYCLE BACK AND THEY WOULD TRY A DIAGNOSTICS CHECK AGAIN. THIS IS A VERY DANGEROUS PROBLEM.  IN ONE INSTANCE I PULLED OUT AND THE MOTORCYCLE STALLED WHILE A CAR WAS APPROACHING.  I THOUGHT I WAS GOING TO GET RUN DOWN BECAUSE I COULDN'T DRIVE THE MOTORCYCLE OUT OF THE SITUATION. IF THE STALLING OCCURS IN A CRITICAL ATTITUDE, LIKE A TURN, THERE IS A VERY REAL POSSIBILITY OF FALLING OVER AND CRASHING. THE MOTORCYCLE HAS 2848 MILES ON IT. THESE EVENTS OCCURRED OVER A THREE MONTH PERIOD FROM OCT 2015 TO DEC 2015.",
        "vin": "WB1018907EZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "11/30/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10784999,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "G 650 GS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BMW G 650 GS. THE CONTACT STATED THAT WHILE STOPPED, THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO A DEALER TO BE REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 4,300.",
        "vin": "WB1018909EZ"
    }
]