[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Condensation inside both headlights. We didn't notice the problem until we moved from the warm west coast weathe to the midwest where the climate is colder.",
        "vin": "2G4GN5EX9E9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "After buying car from Car dealer named Carizona in Mesa Arizona. 1 week later car needs new engine. Initially message appeared stating Engine Performance reduced after leaving the car dealer. How is it that a car dealer purchases a car not ensuring safety of its vehicles. Was there even a safety check. What if I or someone else got hurt after driving that vehicle. There are multiple safety reports but they are still selling cars.",
        "vin": "2G4GN5EX8E9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER COLD START THE BRAKE SYSTEM IS WEAK TO NON EXISTENT. WE HAVE A SLOPE OF APPROXIMATELY 25-30 DEGREES AND THIS CAUSED US TO GO INTO OUR NEIGHBORS YARD WHEN THE BRAKES ONLY SLOWED THE VEHICLE AND COULD NOT BRING IT TO A COMPLETE STOP. WE ARE CURRENTLY WORKING WITH OUR LOCAL DEALERSHIP TO GET THE PROBLEM FIXED, HOWEVER DIAGNOSIS IS PROBLEMATIC DUE TO THE FACT THAT IT ONLY OCCURS ON A COLD START AND THEN BECOMES A NON ISSUE. CURRENTLY YATES BUICK IN GOODYEAR AZ HAS BEEN DISMISSIVE AND UNHELPFUL WITH THIS PROBLEM AND BUICK CUSTOMER CARE LINE IS EQUALLY UNHELPFUL. I WILL UPDATE IF I CAN FIND A MECHANIC THAT CAN DIAGNOSE THE PROBLEM.",
        "vin": "2G4GK5EX7E9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402919,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED IN JAN 2021 WITH 94K MILES AND AS OF MAR 2021 96K MILES A CATASTROPHIC ENGINE FAILURE OF THE #4 CYLINDER. CRACK IN THE PISTON RING GROOVES AND NOW HAS ZERO COMPRESSION. WHILE DRIVING THE HIGHWAY AT 74 MPH. LOSS OF ENGINE POWER AND CHECK ENGINE LIGHT IS ON AND WILL STALL AT IDLE EVEN IN NEUTRAL WHILE SITTING AT A STOP LIGHT OR STOP SIGN. ENGINE OIL FOUND UNDER THE CAR AS WELL BUT NOT SURE SPECIFIC LOCATION AT THIS TIME. HEAVY BLUE SMOKE FROM EXHAUST AND VERY ROUGH IDLE WITH LACK OF RESPONSE FROM THE TURBO ALONG WITH THE TRACTION CONTROL LIGHT ON AS WELL.",
        "vin": "2G4GN5EX9E9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BUICK PURCHASED NOVEMBER 2019 HAS THE MISFORTUNE OF HAVING THE 2.0 LTG 4CYL TURBO. THROUGH RESEARCH I HAVE LEARNED THAT CATASTROPHIC FAILURE WITH THE PISTONS IS A COMMON OCCURRENCE ACROSS THE GM PLATFORM WITH SAME ENGINES. THIS IS LIKELY CAUSED BY A MISFIRE OR PREIGNITION IN THE CYLINDER WHICH WHICH FEEDS ON ITSELF AS IT GETS WORSE. ALSO THE PCV SYSTEM DESIGNED FOR A NATURALLY ASPIRATED ENGINE NOT A TURBO ENGINE. THIS SYSTEM FUNCTIONS ONLY WHEN THERE IS NO BOOST FROM THE TURBO. THIS CAUSE GUNK TO BUILD UP EVENTUALLY BACK FLOWING INTO #1. SINCE LIQUID WILL NOT COMPRESS IT CREATES PRESSURE IN THE CYLINDER DAMAGING THE RINGS. I PURCHASED MY CAR USED WITH NO WARRANTY AND EXACTLY 100K. EVEN ON THE TEST DRIVE I FELT A MISFIRE BUT WAS TOLD IT'S NOTHING. MAYBE MY FOOT SLIPPED. FIVE DAYS LATER THE PREIGNITION HAPPENED AGAIN. CHANGE THE PLUGS AND WIRES AND THE PROBLEM WENT AWAY FOR AWHILE. THREE WEEKS LATER WHEN I COLD START THE ENGINE IN THE MORNING TO WARM UP. IT WAS EXHIBITING THE SAME MISFIRING ALONG WITH A FLUCTUATING IDLE AND EXCESSIVE FUEL BEING BLOWN OUT THE EXHAUST. PULLED THE CODES ALL IT SAID WAS MISFIRE IN #2. BROUGHT IT IN TO SERVICE SHOP. THEY PULLED THE CODES WITH NOTHING REPORTING. I WAS TOLD IT WAS A NORMAL SITUATION IN THE BUICKS. BEING NAIVE AND UNFAMILIAR WITH THE MOTOR I BELIEVED THEM. I DID FIND A GM SERVICE BULLETIN THAT DID SUPPORT WHAT THEY SAID. CLAIMED IT WAS DOUBLE IGNITING TO HEAT THE CATALYTIC CONVERTOR UP FASTER. THE ENGINE CONTINUED TO EXHIBIT THE SAME ISSUES ALL ALONG IM BEING TOLD NOTHING IS WRONG. FAST FORWARD TO LAST WEEK THE PROBLEM EXPONENTIALLY INCREASED. BROUGHT IT INTO THE DEALER. THEY COULDN'T \"FIND\" ANYTHING THOUGH THEY AGREED WASN'T RUNNING RIGHT. MARCH 7 ANOTHER DEALERSHIP. YEP SOMETHING IS WRONG BUT THE CAR IS NOT SAYING ANYTHING. THE TECH WENT FOR A TEST DRIVE AND THE MOTOR FAILED. A BORE SCOPE REVEALED SEVERE PISTON DAMAGE.",
        "vin": "2G4GN5EX7E9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING HAS STOPPED WORKING. I HAD TO REPLACE THE BATTERY ON THE CAR. AFTER I REPLACED THE BATTERY, THE POWER STEERING HAD STOPPED WORKING. THE VEHICLE WAS STATIONARY.",
        "vin": "2G4GL5EX6E9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271243,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BACKING MY CAR INTO MY DRIVEWAY AND THEN I SHUT OFF ENGINE, RADIO STILL PLAYING, THEN ALL OF A SUDDEN LIGHTS STARTED DIMMING AND THE ANTI THEFT WENT INTO ACTION. WHOLE CAR SHUT DOWN, NOT EVEN REMOTES WOULD WORK. GOT THE HOOD OPENED AND DISCOVERED A MELTING WIRE CONNECTED TO THE NEGATIVE SIDE. THANK GOD I WAS HOME WHEN IT HAPPENED. COULD THIS HAVE CAUGHT FIRE INSIDE MY GARAGE? MY CAR IS CURRENTLY AT TURNER TOYOTA IN MONTROSE COLORADO. WAS INQUIRING IF THIS IS A MALFUNCTION WITH WIRING HARNESS. SO FAR ITS COSTING US 800.00 DOLLARS IN REPAIR, WHICH I DONT HAVE MY CAR BACK AS OF TODAY. I WOULD LIKE THIS MATTER CLOSELY LOOKED AT FOR A SAFETY RECALL DUE TO THE MATTER THINGS COULD HAVE BEEN ALOT WORSE.",
        "vin": "2G4GN5EX8E9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ABOUT 35 MPH ON CITY STREET AND MY CAR STARTING JERKING I LOOKED AT THE DASH THE GEAR HAD SHIFTED IT SAID 'MD' WHEN I LOOKED AT WHAT GEAR MY CAR WAS IN . THE CAR WAS JERKING MORE AND THERE WAS A LOT OF SMOKE COMING FROM MY CAR THE ENGINE LIGHT ALSO CAME ON . I PANICKED THIS HAS NEVER HAPPENED . I TURNED ON A SIDE STREET AND INSTANTLY PULLED OVER AND TURNED THE CAR OFF. GOT OUT THE CAR AND OPENED THE HOOD , LET IT COO OFF AND STARTED IT BACK UP THE ENGINE LIGHT WASN'T ON . DROVE THE CAR TO MY DESTINATION HAD NO PROBLEMS . I USE THIS CAR AS MY DAILY DRIVER TO WORK I HAVE TO TRAVEL 15 MILES TO AND FROM WORK . I LEASE THIS CAR FROM A LOCAL DEALERSHIP IN MY CITY I OWE ABOUT 12 THOUSAND AND I MAKE MONTHLY PAYMENTS . PLEASE HELP. I BELIEVE THERE IS STILL A WARRANTY ON MY CAR I WILL HAVE TO FIND OUT MORE ABOUT IT . MY SON WAS IN THE CAR WITH ME WITH THIS HAPPENED I WAS TERRIFIED DIDN'T KNOW WHAT TO DO . THE CAR HAS 69,3772 MILES ON IT .",
        "vin": "2G4GN5EXXE9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BUICK REGAL. WHILE APPROACHING THE DRIVEWAY OF HER HOME, THE CONTACT ATTEMPTED TO ENGAGE THE SHIFTER INTO THE PARK POSITION; HOWEVER, THE VEHICLE SEIZED WITHOUT WARNING WHILE THE KEY WAS STUCK IN THE IGNITION. THE CONTACT ATTEMPTED TO DEPRESS THE SHIFTER LEVER AGAIN, BUT THE FAILURE RECURRED. THE CONTACT DID NOT ENGAGE THE EMERGENCY BRAKE. THE FOLLOWING DAY, THE CONTACT ATTEMPTED AGAIN TO PLACE THE SHIFTER IN THE PARK POSITION WITH THE KEY STILL IN THE IGNITION OVERNIGHT. THE CONTACT MANAGED TO GET THE GEAR TO SHIFT AND, ONCE RESTARTED, THE VEHICLE RESUMED NORMAL OPERATION. THE VEHICLE WAS TAKEN TO PAHRUMP VALLEY AUTO PLAZA (2060 E CHARLESTON PARK AVE, PAHRUMP, NV 89048, (775) 990-4402) WHERE IT WAS DIAGNOSED THAT THE SHIFTER LEVER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "2G4GK5EX0E9"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BUICK REGAL. THE CONTACT STATED THAT THE VEHICLE HAD A SUDDEN LOSS OF POWER. THE CHECK ENGINE LIGHT FLASHES OFF AND ON. IDEAL BUICK GMC (5871 URBANA PIKE, FREDERICK, MD 21704, 301-663-3121) AND AN INDEPENDENT MECHANIC DIAGNOSED THAT CYLINDER FOUR WAS AT 75% PSI AND THE REST OF THE CYLINDERS WERE AT 160 PSI. THE DEALER AND THE INDEPENDENT MECHANIC WERE UNABLE TO PROVIDE A SPECIFIC REMEDY TO PREVENT THE LOSS OF POWER. THE VEHICLE HAD TO BE TOWED MORE THAN ONCE TO THE DEALER AND THE INDEPENDENT MECHANIC, BUT NO REMEDY WAS PROVIDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES AND INDICATED THAT THERE WAS A POWER TRAIN WARRANTY THAT MAY COVER THE REPAIR. THE MANUFACTURER STATED THAT THEY WOULD FOLLOW UP REGARDING THE REPAIR PROCESS. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 42,225.  *TR",
        "vin": "2G4GR5GXXE9"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OFF AND ON OVER THE PAST 6 MONTHS, THERE WAS A LOSS OF BRAKES DIRECTLY AFTER STARTUP.  AFTER 30 SECONDS OR SO,  THE BRAKES WOULD FUNCTION NORMALLY.   THIS CAR IS NORMALLY GARAGE KEPT.  WALKING TO THE CAR AT NIGHT TO LEAVE, I NOTICED OIL ON THE GARAGE FLOOR COMING FROM UNDER THE CAR.  AFTER OPENING THE HOOD, I NOTICED OIL IN THE ENGINE COMPARTMENT COMING FROM THE TOP OF THE ENGINE.   AFTER REMOVING THE PLASTIC ENGINE COVER, I SAW THAT THE OIL WAS COMING FROM WHAT I LEARNED IS THE VACCUM PUMP.  THERE WAS A VISIBLE BREAK IN THE PUMP HOUSING.  I WENT TO MY LOCAL DEALERSHIP TO INQUIRE ABOUT GETTING THIS SERVICED UNDER WARRANTY.   THEY STARTED THAT THIS PART IS ONLY COVERED UNDER THE BUMPER TO BUMPER WARRANTY AND NOT POWERTRAIN WARRANTY, EVEN THOUGH THE VACUUM PUMP IS DIRECTLY MOUNTED TO AND CONNECTED TO THE INTAKE CAMSHAFT.   MY BUMPER TO BUMPER WARRANTY HAD EXPIRED 3 1/2 MONTHS OR 219 MILES PRIOR, YET THE CAR IS STILL UNDER THE POWERTRAIN WARRANTY.   THE DEALERSHIP WAS UNWILLING TO HELP AND QUOTED ME $104 FOR A NEW AC DELCO VACUUM PUMP.   I WAS ABLE TO ORDER A NEW AC DELCO VACUUM PUMP FROM ROCK AUTO FOR $43.  AFTER RECEIVING THE NEW PUMP, A MECHANIC FRIEND WAS HELPING ME TO REPLACE THE PUMP.  WHEN THE OLD ONE WAS REMOVED, IT WAS SHOWN TO HAVE DISINTEGRATED.  THE INSIDE OF THE PART WAS IN MANY PIECES.  THE PART THAT ENGAGES THE CAMSHAFT WAS ALSO BROKE INTO PIECES AND AT THIS POINT I BELIEVE THAT SEVERAL OF THOSE ARE NOW INSIDE THE ENGINE.   AT THIS POINT I AM GOING TO TAKE THE OLD PART TO THE DEALERSHIP, ALONG WITH PHOTOS OF THE ENGINE AND DEMAND THAT THIS IS NOW FIXED UNDER THE POWERTRAIN WARRANTY, AS THE POWERTRAIN IS DIRECTLY AFFECTED.   HAD THIS HAPPENED WHILE DRIVING, THE LOSS OF BRAKES COULD HAVE BEEN CATASTROPHIC.",
        "vin": "2G4GL5EX7E9"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FULE TOP LINE BUST GAS STARTED TO LEAK SPRAYING GAS EVERY WHERE CAR CONTINUED RUNNING CHECK ENGINE LIGHT NEVER CAME ON CAR WOULDNT TURN OFF EVEN TOOK KEY OUT CAR CONTINUED TO REV UP  HAD TO CALL  FIRE DEPT TO HAVE THEM TURN OFF THE CAR BY UNPLUG THE BATTERY THERE SHOULD BE A SAFTEY FEATURE WHERE CAR WILL TURN OFF IF THERE IS A GAS LEAK I AM SO LUCKY TO BE ALIVE THE CAR COULD OF BLEW UP ON ME AND I WOULD BE DIED RIGHT NOW.",
        "vin": "2G4GV5EK1E9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO STATIONS RANDOMLY GO OUT OF RECEPTION, WHEN CLEARLY WITHIN THE CITY LIMITS OF THE STATION.",
        "vin": "2G4GN5EX1E9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081098,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD TEMPERATURES, THERE IS A CREAKING OR RUBBING NOISE WHEN TURNING THE STEERING WHEEL.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "03/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VACCUM PUMP FALLS APART INSIDE OF ENGINE.  THIS CAUSES BRAKES TO NOT WORK AS INTENDED AS THERE IS NO BOOST.  REPLACED OLD OEM WITH NEW OEM AND WITHIN 2 MONTHS HAPPEND AGAIN.  AT START UP AND FOR ABOUT TWO MINUTES YOU HAVE NO BRAKE ASSISTANCE.  EVENTUALLY YOU WILL HAVE NO BRAKE ASSISTANCE.  PLEASE BE CAREFUL",
        "vin": "2G4GN5EX8E9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048313,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY , MY SUNROOF EXPLODED. LUCKILY THE SUNROOF COVER WAS ON AND SUNROOF WAS NOT IN USE.  BAD DESIGN? I HAVE BEEN PLANNING ON ANOTHER BUICK , BUT THIS WILL DETER ME AWAY. >1500$ FOR REPAIR.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2017",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BUICK REGAL. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WHEN ATTEMPTING TO DRIVE AND THE BATTERY WARNING INDICATOR ILLUMINATED. THE FAILURE RECURRED TWICE. THE VEHICLE WAS TAKEN TO STERLING MCCALL BUICK GMC (LOCATED AT 10422 SW FREEWAY, HOUSTON, TX 770744, PHONE NUMBER: (713) 776-4600), BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE BATTERY FAILED AND NEEDED TO BE REPLACED. THE BATTERY WAS REPLACED. THE MANUFACTURER WAS CONTACTED AND INFORMED THE CONTACT THAT ONE OF THE SENIOR ADVISORS WOULD CALL HER BACK. THE APPROXIMATE FAILURE MILEAGE WAS 16,129.",
        "vin": "2G4GK5EX5E9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "04/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUNROOF SHATTERED WHEN DRIVING. SHARDS OF GLASS FELL DOWN ON THE DRIVER AND PASSENGER.",
        "vin": "2G4GT5GX4E9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/12/2017",
        "dateOfIncident": "09/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE NORMALLY DRIVING ON AN INTERSTATE HIGHWAY AND ATTEMPTING TO PASS A SEMI TRUCK, THE VEHICLE SUDDENLY WENT OUT OF CONTROL. THE VEHICLE WENT TO MAXIMUN ACCELERATION AND THE BRAKES AND STEERING BOTH FAILED TO RESPOND. THE VEHICLE WENT INTO A SPIN AND CRASHED INTO THE SEMI TRUCK'S REAR TRAILER WHEELS. THE TRUCK RAN OVER THE LEFT FRONT PORTION OF THE VEHICLE, BLOWING BOTH OUTER TIRES ON THE TRUCK AND CRUSHING THE FRONT, LEFT PORTION VEHICLE IN THE PROCESS. THERE WAS NO TICKETS ISSUED BY THE POLICE AGENCY THAT INVESTIGATED THE ACCIDENT. THE INSURANCE COMPANY INVOLVED SETTLED ALL CLAIMS AND TOTALED OUT THE VEHICLE. I REPURCHASED THIS VEHICLE FROM THE INSURANCE COMPANY BECAUSE I WAS DETERMINED TO FIGURE OUT WHAT HAPPENED. IT TOOK ME 3 MONTHS TO FIGURE IT OUT, HOWEVER I HAVE. THE MAIN CAUSE OF THE ACCIDENT WAS GM'S FAILURE TO INSTALL AN ELECTRICAL GROUND STRAP FROM THE ENGINE TO THE CHASSIS. NOW THERE IS NO PATH FOR THE ELECTRICITY TO GET BACK EITHER TO THE ALTERNATOR OR THE BATTERY. WHILE THERE ARE SOME SMALL GROUND RETURNS IN THE ENGINE WIRING HARNESS, NOTHING LARGE ENOUGH FOR THE REQUIRED AMPERAGE TO GET BACK. WHEN IT CAN'T FIND A PATH, IT LOOKS FOR ANOTHER WAY THROUGH THE BODY OR THE SMALL RETURNS IN THE CABLE. THE WIRES IN THE CABLE GOT HOT AND MELTED THE INSULATION OFF AND SHORTED OUT THE OTHER WIRES. THIS DROPPED THE VOLTAGE ON THE MAIN BUSS WHICH FEEDS THE COMPUTER. THE COMPUTER CONTROLS THE POWER SETTINGS TO THE ENGINE, THE BRAKING SYSTEM, AND THE ELECTRONIC POWER STEERING,ALL FAILED. ONLY GOOD THING THAT THEY HAVE A COMPLETELY SEPARATE SYSTEM FOR THE AIR BAG CONTROLS AND SEAT BELT RETRACTORS. THEY ALL WORKED PERFECTLY, OTHERWISE MY WIFE WOULD BE DEAD.  UPDATED 07/11/17*LJ    *CN",
        "vin": "2G4GK5EXXE9"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/26/2016",
        "dateOfIncident": "12/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937412,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "SUMITOMO CORP OF AMERICA",
                "productMake": "SUMITOMO",
                "productModel": "SUMITOMO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "SUMITOMO 225/60R18 HTR A/S P02 TIRES  NO VISIBLE DOT REGISTRATION NUMBER   QUESTION AS TO THE LEGITIMACY OF TIRES BEING USED IN USA MEETING PUBLIC SAFETY STANDARDS.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907638,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE AIR CONDITIONING ON MOIST BUILDS UP ON THE OUTSIDE OF THE FRONT WINDOW CAUSING IT DIFFICULT TO SEE, IF THE WIPERS ARE USED IT EVEN MORE DIFFICULT. THE AIR THROUGH THE DASH VENTS CAUSING THE OUTSIDE TO MOIST LIKE FROST. I HAVE OWN SEVERAL CARS THIS IS THE FIRST TO HAPPEN. THIS HAPPEN WHEN I AM PARKED OR RIDING ALONG THE HIGHWAYS IT IS DIFFICULT TO SEE. I HAD TO PULL OVER TO A STORE TO WIPE THE WINDSHIELD AND TURN OFF THE A/C TO PREVENT MY SEEING THE HIGHWAY AND TRAFFIC.",
        "vin": "2G4GK5EX9E9"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "07/31/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC:2014 BUCK REGAL:HAND HELD REMOTE GARAGE OPENER : CONSUMER STATED THE HAND HELD REMOTE SHOULD ONLY OPERATE WHILE ENGINE IS ON, NOT OFF. *SS    UPDATED 03/29/2017 *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION.FAILED OIL CONSUMPTION TESTS 2.0 TURBO ENGINE. I HAD SAME PROBLEM WITH 2013 MALIBU WITH 2.0 TURBO ENGINE.WHERE IT DEVELOPED A CRACKED PISTON! AT AROUND 30 THOUSAND MILES",
        "vin": "2G4GK5EX3E9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS COMPARTMENT DOOR IS NOT LOCKING. WHEN I PURCHASED THE CAR IN 2014, THE DOOR IN QUESTION WAS LOCKING WHEN THE CAR DOORS ARE LOCKED, AND CANNOT BE OPENED UNTIL CAR IS UNLOCKED. TOOK CAR TO GM SERVICE CENTER, ALSO CONTACTED GM. CUSTOMER SUPPORT CENTER. WAS INFORMED GAS DOOR IS OPERATING AS DESIGNED. I CONSIDER THIS A SAFETY AND SECURITY HAZARD.",
        "vin": "2G4GK5EX8E9"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "04/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  THE STABILLITRAK LIGHT ON CONTINUOUSLY. DIAGNOSTIC BY ONSTAR, SUGGEST I TAKE CAR IN TO GM SERVICE CENTER TO CHECK AIR BAGS VISITED GM SERVICE CENTER ON04/22/16. FINDINGS: MULTI CODES. CORRECTED. NOTE: THE STABILLITRAK LIGHT CAME ON AFTER I STARTED ENGINE, AND STAYED ON WHILE I WAS DRIVING FOR APPROXIMATELY 1/2 MILE.(CITY STREET) SHUT OFF ENGINE, AND RESTARTED LIGHTS WENT OF. PROBLEM NOT DUPLICATED AT SERVICE CENTER.",
        "vin": "2G4GK5EX8E9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/17/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS LEFT UNATTENDED SECURELY IN OUR HOME GARAGE. UPON SEEING VEHICLE IN THE MORNING WE NOTICED THE SUNROOF WAS SHATTERED. THERE WAS NO FALLING DEBRIS TO HAVE CAUSED THIS, NO ABNORMAL WEATHER CONDITIONS, AND NO ONE AROUND THE VEHICLE THE ENTIRE TIME. VEHICLE WAS TAKEN TO DEALER WHO REFUSED WARRANTY REPAIR. UPON FURTHER INVESTIGATION THE 2015 MODEL YEAR BUICK REGALS HAVE A RECALL FOR THIS EXACT ISSUE BUT NOT THE 2014S.",
        "vin": "2G4GT5GX1E9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/16/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850101,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS LEFT UNATTENDED SECURELY IN OUR HOME GARAGE. UPON SEEING VEHICLE IN THE MORNING WE NOTICE THE SUNROOF WAS SHATTERED. THERE WAS NO FALLING DEBRIS TO HAVE CAUSED THIS. UPON FURTHER INSPECTION THE 2015 MODEL YEAR BUICK REGALS HAVE A RECALL FOR THIS EXACT ISSUE BUT NOT THE 2014S.",
        "vin": "2G4GT5GX1E9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/24/2015",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785770,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CALIPER SLIDERS LOCKED CAUSING BRAKES TO OVER HEAT/ LOCK,AND MAY CAUSE FIRE.",
        "vin": "2G4GK5EX2E9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2015",
        "dateOfIncident": "04/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10759325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED THE CAR LESS THAN ONE WEEK AND AS I WAS DRIVING ON THE I-10 THE SUNROOF EXPLODED ON ME, DEALERSHIP TRIED TO PIN IT ON ME, BUT THEY WOUND UP KEEPING THE CAR A MONTH AND FINALLY FIXED IT , I KINDA FIGURED IT WAS A MANU DEFECT, BUT THE DEALERSHIP WON'T FESS UP TO THAT",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 BUICK REGAL. WHILE ATTEMPTING TO REVERSE, THE BACKUP CAMERA FAILED TO OPERATE. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6,469.     UPDATED 7/7/15*CN  THE CONSUMER REQUESTED TO WITHDRAW HIS COMPLAINT. UPDATED 07/14/15*JB",
        "vin": "2G4GK5EX8E9"
    }
]