[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/02/2017",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949050,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE END OF THIS SUMMER I NOTICED MY FRONT STANCHIONS ON MY MOTORCYCLE COMING LOOSE IN AN AREA THAT IS CRIMPED.   AFTER TAKING IT TO THE DEALER THEY INFORMED THAT BOTH WERE LOSE AND THAT IT WOULD NOT BE COVERED UNDER WARRANTY.   THEY SAID AS I HAD DROPPED THE MOTORCYCLE IT WOULD NOT BE COVERED.         AFTER GETTING THAT RESULT FROM MY DEALER AND BMW I DID MORE RESEARCH AND FOUND THAT I AM NOT THE ONLY ONE WITH THIS ISSUE.         WHILE BMW HAS REFUSED TO REPLACE MINE I FEEL BECAUSE OF THE NUMBER OF PEOPLE EXPERIENCING THE SAME ISSUE, MANY WITHOUT DROPPING THEIR MOTORCYCLE DROPS.   IN ONE CASE THE PERSON JUST HAD THEIR FORKS REPLACED AND WITHIN 200 MILES OF OFF ROAD RIDING IT BROKE AGAIN.  THERE MAY BE A BIGGER ISSUE.  ALSO BECAUSE OF WHERE THIS FAILURE HAPPENS PEOPLES LIVES ARE IN DANGER.        YOU CAN READ MORE ABOUT OTHERS EXPERIENCES BY FOLLOWING THESE LINKS.    HTTP://ADVRIDER.COM/INDEX.PHP?THREADS/UPPER-STANCHION-CRIMPING-FAILURE.1184877/  HTTP://ADVRIDER.COM/INDEX.PHP?THREADS/BOTH-INNER-FORK-TUBE-BROKEN-AT-FIRST-DAY-OF-RIDE-150-MILLE-OF-USE.1185036/    HERE IS A PERSON TRYING TO DESIGN A FIX FOR THE ISSUE.    HTTP://ADVRIDER.COM/INDEX.PHP?THREADS/SOLVING-THE-POST-2012-1200GS-STANCHION-SEPARATION-PROBLEM.1193566/    THESE PEOPLE HAVE CONTACT ME TO ADD THEIR INFORMATION TO THIS COMPLAINT    [XXX]  [XXX]  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WB10A1100EZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731071,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING ACCELERATION UP A STEEP MOUNTAIN GRADE WITH NO SHOULDERS AND TRAFFIC BEHIND, THE CONNECTION OF THE ELECTRICAL CABLE TO THE THROTTLE TWIST GRIP UNSEATED ENOUGH TO BREAK ELECTRICAL CONNECTION. THIS CAUSED THE MOTORCYCLE TO DECELERATE TO ABOUT 5 MPH AND LOSE ALL THROTTLE CONTROL. WITH THE TRAFFIC BEHIND AND NO PLACE TO SAFELY PULL OVER I FELT I WAS AT A GREAT SAFETY RISK AS CARS AND TRUCKS ATTEMPTED TO GO AROUND ME.    THIS IS THE THIRD TIME THIS HAS HAPPENED, THOUGH NOT IN SUCH HARROWING CIRCUMSTANCES. THE SECOND TIME THIS HAPPENED, LAST YEAR, I USED ZIP-TIES TO TIGHTEN THE CONNECTOR BODY TO ITS MATE. WHEN INFORMED OF THE INCIDENT, THE LOCAL BMW SHOP (AND I) BELIEVED THIS HAD REMEDIED THE PROBLEM. OBVIOUSLY THIS WAS NOT THE CASE. I WILL BE CONTACTING THE LOCAL BMW SHOP TO SEE IF THEY WILL REPLACE THE CONNECTING PARTS WITH ONES THAT HAVE AN OBVIOUS DETENT OR LATCH TO PREVENT THIS FROM HAPPENING AGAIN.",
        "vin": "WB10A110XEZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2015",
        "dateOfIncident": "05/13/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726319,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A NEW BMW MOTORCYCLE PURCHASED IN JANUARY. AROUND 4000 MILES THE ENGINE STARTED MAKING A METALLIC NOISE AFTER WARMED UP, AND BECAME PROGRESSIVELY WORSE. MOTORCYCLE IS NOW AND HAS BEEN LOCATED AT AUTHORIZED BMW SERVICE REPAIR CENTER FOR ABOUT THREE WEEKS; THE NOISE, TO DATE, HAS NOT BEEN CLEARLY DIAGNOSED, BUT HAS BEEN ACKNOWLEDGED BY REPAIR STAFF THAT NOISE IS ABNORMAL. CONCERN IS THAT ENGINE (POSSIBLY CAM TIMING CHAIN(S)?? WILL BREAK AND MOTOR WILL INSTANTLY LOCK UP, WHICH WOULD INSTANTLY CAUSE REAR WHEEL TO LOCK/SKID, WHICH COULD EASILY LEAD TO LOSS OF CONTROL AND CAUSE PHYSICAL HARM OR DEATH FROM INABILITY TO CONTROL MOTORCYCLE; PARTICULARLY AT HIGHWAY SPEEDS.",
        "vin": "WB10A1100EZ"
    }
]