[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450519,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Car has no temperature gauge. Car had oil change. Then went to put gas. When I started in the highway. The temperature sensor turned on. This was terrifying as it was night time and I was on a highway on my way to visit family. The car could of caught on fire.  Pulled over called a tow truck. Water pump was replaced and cylinder heads and gaskets. This was done through the warranty company. Car was returned to me on 14 December 2021 and was in a repair shop the following day because of the check engine light was on.  Car now needs new motor as coolant was going inside the motor.   Sensors had never gone off before that day. Currently car is in the chevy dealer for over a month trying to figure out who will pay for the repairs  as I also had an extended  warranty. Car had 57000 miles when it failed. Chevy repairs will be of about $7000.",
        "vin": "1G1JE6SB4E4"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430135,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Chevrolet Sonic. The contact stated that after refueling the vehicle, while attempting to start up the vehicle, the vehicle would not start immediately. The vehicle was making an abnormal knocking sound. The vehicle would jerk before starting. The contact took the vehicle to an independent mechanic who inspected the vehicle and diagnosed the failure as an issue with the fuel. The mechanic attempted to change the fuel injector to fix the failure however, the fuel continued to flow. The mechanic recommended that the contact reach out to the local dealer to have the vehicle inspected and repaired. The contact reached out to the local dealer to have the vehicle inspected but the dealer informed the contact that they would need to call back in two weeks to schedule an appointment which the contact attempted several times but was never able to schedule the appointment. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 120,000.",
        "vin": "1g1ja5sh8e4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426349,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Traction contorl light and check engine light comes on and its throwing my car into limp mode. we have changed out the throttle body and the pedal sensor and still having the same problem.",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/20/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11425666,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2014 Chevrolet Sonic. The contact stated that while driving at various speeds approaching a parking lot and slowing down to turn, the vehicle behind was speeding and crashed into the rear of the vehicle. The vehicle then flew forward and crashed into a pole. No airbags deployed. The passenger in the driver's side rear seat sustained whiplash to the neck. The contact and her daughter sustained minor injuries to the right hip, right knee, and right shoulder. A police report was filed. The passenger in the driver's side rear seat was treated via ambulance and the contact and her daughter received medical attention from a chiropractor. The police towed the vehicle to a lot where it was deemed a total loss. The dealer was contacted and informed the contact that no recalls were under the VIN. The manufacturer was made aware of the failure and started an investigation. The failure mileage was approximate 88,000",
        "vin": "1g1jc5sh7e4"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/06/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Since January I’ve consistently had issues with my 2014 Chevy Sonic Hatchback, in particular, Codes 84, P2138, check engine light and traction control lights. (my job has us all working from home since March of 2020, so I only do local shopping, no long distance). Due to the codes mentioned above, my car was “repaired” at dealership on January 4, 2012. In the end of March I was constantly getting the same codes over a period of two days. I called GM (1 800 462 8782) on March 29, spoke with a woman by the name of Michelle and I explained what has been happening with the vehicle codes, along with other issues over the past year. She opened a case file # 9-6627321866 and she called the dealership to discuss my issue. I was told to drop the car off and it will be repair at no cost to me. The car was brought to dealership on April 7, 2021 and when the diagnostic was preformed, it showed no codes in the history. They did no repair at that time and gave me back the car. While running local errand on April 17, all the same codes appeared and once again I had reduced engine power. I was near the dealership and dropped off the vehicle, even though the service department was closed at that time. Once again, a new pedal and sensor was installed. I told them to please keep the vehicle for a few days, test drive it once in a while to ensure it is truly repaired. They test drove it several times during the  4 days they had it and since there were no issues, I picked the vehicle up on April 22, 2021.On June 5, while driving to a store a nearby store, I was stopped at a light to make a left turn and all the codes suddenly came on. I had very little acceleration making the left turn. The vehicle approaching me which was a block and a half away was now very closely approaching me and luckily realized I had an issue and stopped. I immediately headed back home. AutoZone ran a diagnostic and it's the same issue.",
        "vin": "1G1JE6SB1E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT USED IN AUGUST FROM A TOYOTA DEALER.CAR WAS MAKING A CHIRPING NOISE AND THE AC DID NOT WORK. DEALER. FIXED AC AND SENT TO CHEVY TO REPAIR CHIRPING NOISE.. THEN THE HEAT STOPPED WORKING AND THERE WAS NO COOLANT.. THEY FIXED SOME BRACKET OR OTHER.. NOW THE GEAR SHIFT BUTTON GETS STUCK PUSHED IN,, AND YOU CANNOT DISENGAGE TO PUT THE CAR IN PARK TO REMOVE THE KEY.. I GOOGLED THIS ISSUE AND FOUND A LOT OF COMPLAINTS ABOUT IT. THE DEALER HAS ALREADY TOLD MY 19 YEAR OLD THEY WILL NOT COVER ANY MORE REPAIRS. BUT THIS CAR IS A PIECE OF JUNK AND THEY SHOULD NOT BE ON THE ROAD ANYMORE. I SHOULD NEVER HAVE LET HER FINANCE IT. NOW I DON'T KNOW WHAT TO DO.",
        "vin": "1G1JC5SB1E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSING RADIATOR COOLANT SOMEWHERE",
        "vin": "1G1JC5SHXE4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398008,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A 1.4 TURBO ENGINE. IT HAS A NOISE DUE TO THE FRONT CRANK SEAL WITH A VACUUM LEAK AS PER A GM SERVICE BULLETIN P11297B. I \"THINK\" THIS HAS ALREADY BEEN ON A RECALL FOR THE SAME ENGINE IN THE CRUZE MODEL. IF SO WHY IS THE SONIC MODEL INCLUDED? THIS IS AN EXPENSIVE REPAIR FOR A RETIRED PERSON. ALSO THIS CAR DOESN'T HAVE 34,000 MILES ON IT YET.",
        "vin": "1G1JG6SB7E4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON, CODE IS COMING UP EMISSION FUEL LEAK. TRIED REPLACING GAS CAP, DID NOT WORK. WHEN GETTING GAS, THE CAR WILL NOT TURN BACK ON, YOU HAVE TO PUMP THE GAS PEDAL TO GET IT TO COME BACK ON. IDLES HIGH AND JUMPS AFTER TURNING BACK ON",
        "vin": "1G1JC5SH3E4"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378427,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUTTON ON MY GEAR SHIFTER WAS STUCK FOR A FEW MONTHS AND THEN IT BROKE RESULTING IN ME CRASHING INTO A PARKED CAR BECAUSE I LOST CONTROL.",
        "vin": "1G1JA5SG5E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS PREVIOUSLY HAD THE COOLANT RESERVOIR AND WATER OUTLET CHANGED NOT VERY LONG AGO. NOT I AM HAVING THE SAME ISSUE WITH BOTH OF THE PARTS AGAIN. RESERVOIR IS CRACKED MAKING COOLANT LEAK OUT AND THE WATER OUTLET IS BRAKING APART BECAUSE IT IS PLASTIC.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360593,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR BUTTON BROKE AND STICKS/IS STUCK",
        "vin": "1G1JC5SG5E4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BUTTON ON FLOOR-MOUNTED GEAR SHIFT STICKS IN.  CAN'T GET KEY FOB OUT OF IGNITION. STICKS ALL THE TIME.  SECOND INCIDENT THIS YEAR.  CAN'T TURN CAR OFF.  PROBLEM SO COMMON THERE ARE YOU-TUBE VIDEOS ON REPAIR TECHNIQUES.  CAR IS USUALLY STATIONARY, BUT SHIFTER WON'T WORK BECAUSE OF STUCK BUTTON.",
        "vin": "1G1JA5SG8E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "05/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351713,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THISNVEHICLE WAS PURCHASE ON THE YEAR 2016 OF APRIL. SO HAPPY AT FIRST BUT IN A COUPLE OF WEEKS HAVE PROBLEM WITH LIGHTS AND ONE OF TTHE COVER OF THE FRONT MIRRORS ARE MISSING  . CALLED AND WENT BACK TO THE DEALER (TOYOTA OF NORTH HOLLYWOOD ) AND SAID BRING IT TO THE CHEVY BRANCH WHERE THEY CANNCHECK AND FIX IT . IT WAS STRESSING AND DEPRESSING CAUSE EVRYWEEK PASSED YOU'LL EXPERIENCED ANOTHER PROBLEM SUCH AS AIRDCONDITION AND HEATER NOT WORKING . I'VE BEEN BACK AND FORTH TO CHEVY IN VAN NUYS , CALIFORNIA BUT THEY ARE SAYING THAT THERE'S NO WARRANTY ON THE VEHICLE . I TRIED TO RETURN THE VEHICLE TO THAT DEALER BUT THEY SAID THAT MY CREDIT SCORE STILL LOW OF COURSE IT WILL SHOW THAT CAUSE I JUST BOUGHT IT AND MY CREDIT HASN'T BEEN SMESTABLISH YET , WHEN I BOUGHT IT THEY ASKED A LARGE AMOUNT $3500 OF DOWN PAYMENT DUE TO HAVING LOW SCORE. IT DOESN'T MAKE SENSE CAUSE I WILL USE A VEHICLE THAT HAS ELECTRICAL  DISFUNCTIONAL. I HAVEN'T EVEN USE THE HEATER AND THE AIRCON ON THIS CAR EVER SINCE I BOUGHT IT CAUSE IT'S NOT WORKING . YOU CAN ASK THE DEALER HOW MANY TIMES I WENT THERE AND TRIED TO BEG TO GIVE ME A DIFFERENT CAR BUT NO LUCK INSTEAD I FOUND OUT THE SALES PERSON SOLD THE CAR TO ME WASN'T WORKING THERE ANYMORE . AND I WALKED OUT WITHOUT ANY HELP FROM THEM . YOU CAN EVEN ASK CHEVY IN VAN NUYS  HOW MANY TIME I'VE BEEN THERE TO ASK HELP CAUSE THE DEALER ALWAYS POINTING ME BACK TO THEM . IT'S HARD TO USE A FINANCE CAR PAYING $396 SOMETHING A MONTH AND THE CAR IS NOT FUNCTIONING RIGHT . THEY HAVE ADDED A GAP INSURANCE ON MY CONTRACT AND EVEN THAT COMPANY WASN'T HELPING ME AT ALL . SO I END UP USING THIS CAR WITHOUT ACCESS ON AIRCONDITION AND HEATER . SUFFER 4 YEARS WITHOUT THESE BENEFITS . I COULDN'T AFFORD FIXING THAT EVER SINCE CAUSE IT'S TOO EXPENSIVE .  YOU CAN SEE THAT I HAVEN'T PUT A LOT OF MILEAGE ON THIS CAR CAUSE I DON'T REALLY USE IT THAT MUCH. STILL PAYING THIS .",
        "vin": "1G1JC5SH8E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "07/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT STATED HE CONTINUED TO DRIVE THE VEHICLE TO HIS DESTINATION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT THE VALVE COVER, INTAKE MANIFOLD AND MASS AIR FLOW SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT CALLED BANKS CHEVROLET CADILLAC BUICK GMC LOCATED AT 137 MANCHESTER ST, CONCORD, NH 03301 (844) 511-2874, TO NOTIFY THE DEALER OF THE FAILURE. THE MANUFACTURER WAS INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 37,200.",
        "vin": "1G1JE6SBXE4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS RECALLED FOR CATALYTIC CONVERTER. RECALL WAS SERVICED BY DEALER AND PROBLEM DID NOT EXIST FOR 3 MONTHS THEN SAME ISSUE BEGAN AGAIN WITH SAME CODES BEING GIVEN BY THE VEHICLE AND EXACTLY THE SAME SYMPTOMS AND PROBLEMS AS BEFORE.",
        "vin": "1G1JC5SG3E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A PIECE OF THE BUTTON ON THE GEAR SHIFT HAD BROKEN OFF AND GOTTEN JAMMED IN THE SHIFT. CAUSING THE VEHICLE TO BE UNABLE TO SHIFT OUT OF DRIVE. THIS IS A SERIOUSLY DANGEROUS ISSUE, AND IF I WAS NOT IN THE CAR WITH ANOTHER PERSON WHO WAS ABLE TO JIMMY THE SHIFT FORWARD FOR ME WHILE I HELD DOWN THE BREAK, I WOULD HAVE ROLLED FORWARD OFF THE ROAD OR INTO THE BUILDING IN FRONT OF ME. IF YOU LOOK UP THIS ISSUE MANY SONIC DRIVERS HAVE EXPERIENCED THIS SAME ISSUE.",
        "vin": "1G1JC6SH7E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "10/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM #1  GOT THE CAR IN 2016, AFTER ABOUT A YEAR THE SHIFTING STICKS BUTTON GOT STUCK AND BROKE. PREVENTED ME FROM CHANGING GEARS OR GETTING OUT OF PARK. HAD TO CALL FOR IT TO BE TOWED AND BUY A NEW STUCK FROM DEALERSHIP.  PROBLEM #2  BEGAN GETTING A CHECK ENGINE LIGHT ABOUT A FEW MONTHS AFTER PURCHASING CAR IN 2016 DUE TO ENGINE MISFIRE, FOUND OUT IN 2020 THIS WAS DUE TO THE AIR VENT TUBE UNDER THE HOOD BEING CRACKED. BOTH THESE ISSUES ARE COMMON WITH MANY CONSUMERS I HAVE READ",
        "vin": "1G1JC5SH7E4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290822,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMP 45-50 DEGREES, DRIVING IN MODERATE RAIN FOR 20-25 MINUTES,  CRUISE CONTROL ON. ACTIVATE HIGH BEAMS, CAR SHIFTS TO 1ST GEAR AT 65 MPH, RPMS JUMP ABOVE 6000, TURN OFF HIGH BEAMS RETURNS TO NORMAL OPERATION. REPEATED 2 MORE TIMES IN NEXT 4 MILES, EVEN AT 25 MPH. WHEN END OF TRIP, SHUT OFF CAR AND COMPLETELY DEAD, NO LIGHTS, NO CRANKING. FOLLOWING MORNING (TODAY) CAR STARTS NORMALLY.  WILL REPORT ANY FURTHER FROM MY COMMUTE TODAY, IF WARRANTED",
        "vin": "1G1JC5SH4E4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287984,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ACCELERATING MY SONIC HAS LACK OF POWER AND GEARS DON'T ENGAGE OR THEY ARE DELAYED WHICH CAUSES ME TO BE VERY UNSAFE FROM ONCOMING TRAFFIC WHEN MY CAR DECIDES TO ENGAGE I CAN THEN CONTINUE DRIVING.  I ALSO HAVE A ISSUE WITH THE CAR ELECTRICAL SYSTEM REFUSING TO CHIME WHEN KEYS ARE LEFT IN IGNITION AS A WARNING  SOMETIMES I PUT MY HIGH BEAMS ON AND ALL THE LOCKS LOCK AND MY CAR DOES THE REFUSAL TO ENGAGE IN GEAR THING AGAIN AND MY LIGHTS FLICKER MY WHOLE COMPUTER SYSTEM WENT DEAD AND NO ONE CAN FIGURE OUT WHY I ONLY BOUGHT THE CAR 6 MONTHS AGO FOR 12,000 SO I COULD HAVE RELIABILITY AND I SHOULDN'T HAVE TO DEAL WITH THIS OR ANYTHING FOR QUITE SO TIME MY OLD CAR IS SAFER THAN THIS NEW ONE",
        "vin": "1G1JE6SB2E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO ACCELERATE AND AN ABNORMAL NOISE WAS HEARD. ON A DIFFERENT OCCASION, IT TOOK THE CONTACT THREE ATTEMPTS TO START THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TRANSMISSION WAS FLUSHED, BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS 93,000.",
        "vin": "1G1JE6SB2E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267878,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD SEVERAL ISSUES WITH THE CAR. THE MAIN ONE BEING THAT MY ENGINE HAS WARPED AND THE CAR IS JUNK NOW AS I CAN'T AFFORD THE 5400 TO REPLACE IT. THE COOLANT KEPT LEAKING AND AFTER WATER PUMP AND THERMOSTAT REPAIRS DID NOTHING IT FINALLY BROKE DOWN. THE SHOP SAYS THE ENGINE IS SO BADLY WARPED THEY CAN'T EVEN IDENTIFY WHERE THE ORIGINAL PROBLEM MAY HAVE BEEN.",
        "vin": "1G1JE6SB9E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/08/2019",
        "dateOfIncident": "09/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254011,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFTER BUTTON HAS CRACKED AND CAUSES THE BUTTON STUCK.  THIS ALLOWS THE SHIFTER TO BE MOVED WITHOUT PRESSING THE BUTTON AND ALSO PREVENTS THE KEY FROM BEING REMOVED.  THE CAR COULD EASILY ROLL AWAY IF BUMPED DUE TO IMPROPER SHIFT LOCKING.  THIS CAN HAPPEN WHEN YOU'RE ALREADY IN PARK OR EVEN IN DRIVE.  TONS OF COMPLAINS ONLINE THROUGH FORUMS AND VIDEOS ON YOUTUBE HOW TO REPLACE BUT COST SHOULDN'T BE UP TO OWNERS.  FIX THIS CHEVY!",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/28/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235337,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER SOLD ME CAR WITH BALD TIRES LESS THAN 2/32. DEALER SOLD CAR WITH FILTHY RUSTY AND LOOSE PARTS ON MANIFOLD. VALVES. STRUTS. AND TRANS MOUNT. SUSPENSION PIECES WERE BROKEN AND OLD. THE THERMOSTAT WAS PUT IN WRONG AND CAUSED DIVID IN MANIFOLD. BATTERY AND ELECTRICAL SYSTEM ALSO HAD ISSUES. ALL ISSUES WERE FROM MILE 1 TO 200 OF OWNING CAR.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233263,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CANNOT TAKE THE KEY OUT WHEN CAR IS IN PARK.",
        "vin": "1G1JC5SH2E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229083,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A RECALL ON A COMPONENT OF MY CATALYTIC CONVERTER THAT WAS CAUSING IT TO MOVE AT A LOW EFFICIENCY. I TOOK IT IN TO MOSS BROTHERS CHEVROLET TO BE REPAIRED. IT SEEMED FINE UNTIL 1-2 DAYS LATER WHEN THE CHECK ENGINE LIGHT CAME BACK ON. I CALLED MOSS BROTHERS TO INFORM THEM OF THIS SITUATION, HOWEVER, THEY TOLD ME THAT IF I WANTED TO GET IT DIAGNOSED AND THE PROBLEM IS NOT COVERED UNDER WARRANTY, I WOULD HAVE TO PAY THE DIAGNOSTIC FEES. HOWEVER, I DID NOT HAVE ANY OTHER ISSUES WITH MY CAR BEFORE TAKING IT TO THEM. IT WASN'T UNTIL AFTERWARDS. SO IF SOMETHING OTHER THAN THE RECALL IS WRONG, I WOULD BE WILLING TO BET THAT IT WAS DUE TO NEGLIGENCE ON THEIR PART. I TOOK IT INTO AUTOZONE TO RUN A DIAGNOSTICS AND IT SAID 'CATALYST SYSTEM LOW EFFICIENCY' WHATEVER THEY DID, DID NOT FIX MY CAR BUT ONLY MADE IT WORSE. I CALLED GMC TO SEE IF THERE WAS A WAY AROUND THE FEE SHOULD IT BE A DIFFERENT CAUSE(IF IT IS, I BELIEVE IT WAS CAUSED BY MOSS BROTHERS) AND THEY WERE NOT HELPFUL TO ME AT ALL.",
        "vin": "1G1JC5SG6E4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222996,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR USED BACK IN OCTOBER 2017, I'VE HAD OVERHEATING PROBLEMS, THE DEALERSHIP FIXED TWICE UNDER AN EXTENDED WARRANTY THE THIRD TIME I HAD TO FIX MYSELF (THEY SAID MY EXTENDED WARRANTY EXPIRED). I NOTICED MY KEY WOULD GET STUCK IN THE IGNITION AFTER PUTTING THE GEAR IN PARK, I DISCOVERED THE BUTTON ON MY GEAR SHIFT IS CRACKED AND I HAVE TO PULL IT ALL THE WAY PUT TO REMOVE THE KEY. THE LATEST ADVENTURE IS I WAS DRIVING ON THE HIGHWAY IN THE FAST LANE AT ABOUT 75 MPH WHEN MY CAR MADE A POP NOISE THEN SLIGHTLY JERKED THEN STARTED TO SLOW DOWN. THE CHECK ENGINE LIGHT CAME ALONG WITH THE TRACTION LIGHT, I WAS ABLE TO SAFELY GET OVER TO THE SHOULDER I PARKED AND CUT THE CAR OFF. AFTER A FEW MINUTES I WAS ABLE TO START MY CAR BACK UP AND GET IT TO AN AUTO STORE TO FIND OUT WHY THE CHECK ENGINE LIGHT WAS ON. THE CODES THAT CAME BACK STATED COMMUNICATION WAS LOST WITH THE TCM AND THE TCM INTERNAL TEMPERATURE WAS TOO HIGH. I WAS TOLD THE MOST LIKELY SOLUTION IS FAULTY WIRING AT THE TCM. THIS IS BECOMING A HEADACHE I'M STILL PAYING ON THIS CAR AND DOING MORE REPAIRING THAN SCHEDULED MAINTENANCE",
        "vin": "1G1JC5SHXE4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218195,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE USED IN 2016 FROM A CAR DEALERSHIP. A COUPLE OF MONTHS AGO MY KEY WOULD NOT COME OUT OF THE IGNITION AND I HAD TO WAIT A FEW MINS THEN TRY AGAIN. NEXT TIME IT DID THAT IT TOOK 30 MINS TO REMOVE THE KEY UNTIL FINALLY THE LAST TIME IT WOULD NOT COME OUT PERIOD AND I HAD NO CHOICE BUT TO LEAVE THE VEHICLE AND HAVE IT TOWED TO THE SHOP. I HAD TO REPLACE A PART OF THE SHIFTER. THERE WAS A METAL PIECE  RIGHT UNDER THE SHIFTER KNOB THAT FAILED. I HAD AUL INSURANCE VINTAGE NOW AND HAD TO PAY 500,000 DOLLARS FOR THIS REPAIR BECAUSE HE STATED THAT IT WAS NOT COVERED. PERSONALLY I DON'T BELIEVE THAT BUT I HAD NO CHOICE AND PAID TO HAVE IT FIXED. I TOOK THE VEHICLE PRIOR TO THE SHIFTER VISIT TO THE DEALERSHIL TWICE WITH A COMPLAINT OF NOT GETTING ENOUGH POWER WHEN I EXCELERATE AND IT MOVES SLOWLY AND IS AT 10-25 MPH BEFORE IT MOVES TO THE HIGHWAY SPEED OF 55MPH. THEY AGAIN SAID THEY COULD NOT FIND ANYTHING. AGAIN TODAY I EXPERIENCE THE SLOW EXCELERATION AGAIN, SO I AM MAKING A COMPLAINT THIS TIME. THERE IS A ELECTRICAL PROBLEM WITH THIS VEHICLE I 'VE HAD A COUPLE OF ELECTRICAL ISSUES AS WELL AS A REPLACED WATER PUMP. I GOT THIS IN 2016 IT SHOULD NOT HAVE THESE MANY PROBLEMS WITH THIS VEHICLE. I AM ALWAYS STOPPED AT A LIGHT IN THE TURNING LEFT LANE GETTING ON THE HIGHWAY WHEN THIS HAPPEN AND OTHER CARS HAVE ALMOST HIT ME SEVERAL TIMES. I WANTIT TO BE INVESTIGATED AND KNOWN BEFORE I GO BACK TO THE DEALERSHIP AGAIN AND TO BE TOLD THATTHERE S NOTHING WRONG. I SEE THE  DASHBOARD LIGHTS DIM QUITE A LOT WHILE I AM DRIVING. AND WHEN IT STALL LIKE THIS THE POWER LIGHTS GET REALLY DIM BUT YOU CAN STILL SEE YOUR MPH ETC. PLEASE HELP ME SOMETHING IS WRONG WITH THIS VEHICLE AND I DON'T WANT TO DIE IN IT.",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "05/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205910,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT BUTTON IS STICKING, WHICH IS POSING A HAZARD. THE CAR DOES NOT COMPLETE THE SHIFT OR RELEASE THE KEY UNTIL AFTER THE BUTTON UNSTICKS. IT HAPPENED WHEN I TRIED TO PARK AND IT HAPPENS WHEN I'M SHIFTING BETWEEN REVERSE AND DRIVE. ITS NOT A ONE TIME OCCURRENCE.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "03/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW YEARS AGO MY POWER STEERING WENT ON. IT WAS STILL UNDER WARRANTY AND I TOOK IT TO THE DEALERSHIP TO GET REPLACED RIGHT AFTER THE WARRANTY EXPIRED THE POWER STEERING WENT OUT AGAIN. CURRENTLY MY AC IS BROKEN AND I'VE SPENT A GOOD BIT OF MONEY TRYING TO FIX IT; YET IT STILL DOESN'T WORK. NOW MY CAR WON'T START. I'VE RELPALCED THE BATTERY A COUPLE YEARS AGO BECAUSE MY CAR KEPT DYING. I BOUGHT THIS CAR BRAN NEW AND IT HAD CAUSED ME NOTHING BUT FINANCIAL ISSUES. I TRIED CONTACTING CHEVY ABOUT HIS CAR A FEW YEARS AGO WHEN THE POWER STEERING WENT OUT. EXPLAINING THAT THESE ARE MAJOR COMPONENTS OF MY CAR IT'S NOT LIKE I'M COMPLAINING ABOUT CHANGING MY TIRES OR NEW BRAKES YOU NOW NORMAL WEAR AND TEAR. I SHOULDN'T HAVE TO DEAL WITH THESE ISSUES WITH A NEW CAR. I KNOW IT'S 5 YEAS OLD NOW BUT THIS IS GETTING RIDICULOUS I STILL OWE $3800 ON MY CAR AND HAVE DEALT WITH DUMPING MONEY INTO A VEHICLE THAT SHOULDN'T OF HAD ANY OF THESE PROBLEMS IN THE FIRST PLACE. THIS HAS CAUSED UNESSASACRY STRESS IN MY LIFE. ALSO TWO OF MY WINDOWS DON'T WORK. SO MY AC IS BROKE AND I CAN'T EVEN ROLL DOWN TWO WINDOWS IT'S A DEATH SENTENCE. I'VE HAD A HEAT STROKE IN MY CAR BECAUSE OF IT. LEGITIMATELY SCARED ME.",
        "vin": "1G1JC5SH1E4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIR BAG WILL NOT INDICATE WHEN THERE IS A PASSENGER IN THE VEHICLE. THIS IS SPORADIC AND ONLY WORKS WHEN IT WANTS TO. IN THE EVENT OF AN ACCIDENT THE AIRBAG MAY NOT DEPLOY IF THERE IS A PASSENGER IN THE SEAT.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191642,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE OVER HEATED AND WAS TOWED TO THE DEALER FOR REPAIR. ONE OF THE ENGINE COOLANT OUTLETS WAS MADE OF PLASTIC AND CRUMBLED INTO PIECES WHERE THE HOSE CONNECTS TO IT. THE BOLTS WERE ALSO BROKEN OFF INTO THE SIDE OF THE ENGINE. THIS REPAIR COST $1,200 AND WAS DONE TWICE WITHIN 2 MONTHS TIME.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THE ENGINE MADE AN ABNORMAL NOISE AND THE ENGINE OVERHEATED. THE CONTACT STATED THAT THE FAILURE OCCURRED TWICE. THE VEHICLE WAS TAKEN TO DYER CHEVROLET (4200 US-1, FORT, FLORIDA 34982, (772) 242-3116) WHERE IT WAS DIAGNOSED THAT THE ENGINE COOLING SYSTEM RETURN UNIT FAILED. THE VEHICLE WAS REPAIRED. THE CONTACT ALSO STATED THAT THE RADIO SOFTWARE SYSTEM FAILED AND DID NOT ALERT HIM WHEN THE TIRES WERE LOW. THE CONTACT ALSO NOTICED THAT THE FRONT OCCUPANT DETECTION SENSOR ALSO FAILED TO ACTIVATE WHEN THE FRONT PASSENGER SEAT WAS OCCUPIED. THE DEALER STATED THAT THE VEHICLE WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 16V257000 (EQUIPMENT, ELECTRICAL SYSTEM). THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191730,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING FUEL, WHICH CAUSED THE VEHICLE TO SPUTTER AND SMELL LIKE FUEL. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 96,000.",
        "vin": "1G1JE5SH4E4"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS ON &OFF (DRIVING)  THERMOSTAT NOT WORKING CAUSING ENGINE LIGHT ON",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "02/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL THE AIR BAG LIGHT COMES ON AND OFF. WHEN THE LIGHT IS ON I CALL ON STAR AND THEY SAY ITS A DEFECT IN DEPLOY DIAGNOSTIC CODE B0081 AND WHEN I TAKE IT IN THE LIGHT IS OFF. I DONT WANT TO GET IN AN ACCIDENT AND THEN THE AIR BAG NOT DEPLOY",
        "vin": "1G1JC5SH4E4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR INTERMITTENTLY ILLUMINATED. THE CONTACT WAS CONCERNED THAT THE AIR BAG MIGHT DEPLOY. THE CONTACT TOOK THE VEHICLE TO FELIX CHEVROLET (LOCATED AT 3330 S FIGUEROA ST, LOS ANGELES, CA 90007, (213) 290-1925) WHERE IT WAS DIAGNOSED THAT THE PASSENGER SIDE AIR BAG INTERNAL SENSOR HAD A SHORTAGE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 9-5085721017. THE APPROXIMATE FAILURE MILEAGE WAS 37,365.",
        "vin": "1G1JC6SH7E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182727,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2014 CHEVY SONIC WITH 70,000 MILES. SHORTLY AFTER RECEIVING THE VEHICLE, IT BEGAN DROPPING COOLANT WHILE STATIONARY OVERNIGHT AFTER BEING DRIVEN DURING THE DAY. THE DEALER REPLACED THE WATER PUMP. AFTER THE REPAIR, IT STARTED TO LEAK AGAIN. THIS TIME, THE DEALER'S REPAIR SHOP COULD NOT FIND THE SOURCE OF A LEAK, DESPITE MY SHOWING EVIDENCE OF A LEAK (PHOTOS AND COLLECTED COOLANT). SEVERAL INTERNET POSTINGS FROM DIFFERENT SOURCES INDICATED POSSIBLE PROBLEMS CAUSED BY DEXCOOL COOLANT SPECIFIED BY GENERAL MOTORS. MY OWN MECHANIC RECOMMENDED REPLACING THIS COOLANT BECAUSE OF PROBLEMS WITH THE COOLING SYSTEM.",
        "vin": "1G1JA5SG8E4"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2019",
        "dateOfIncident": "02/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERMOSTAT DAMAGE AND AIR CONDITIONER NOT START CORRECTLY ONLY START FAN",
        "vin": "1G1JB5SH4E4"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT STAYS ON. ENGINE RANDOMS SHUTS OFF.  CAR WONT START AFTER FILLING CAR UP. T/C COMES ON RANDOMLY AND CAR STARTS SHAKING. LIGHTS OF CAR DIM WHEN YOU ACCELERATE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175209,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO GARY RUSS CHEVROLET (1420 BYPASS 72 NE, GREENWOOD, SC 29649, (864) 229-2521) WHERE IT WAS DIAGNOSED THAT THE CONNECTOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED AND REFERRED THE CONTACT TO THE LOCAL DEALER. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "1G1JA5SH1E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE STARTED WITH CAR NOT RESPONDING TO FOB SPORADICALLY. NOW CAR WONT EVEN HAVE POWER UNLESS KEY IS IN IGNITION AND ALL THE DOORS ARE CLOSED. ESCALATED TO NO POWER AT ALL UNTIL I SLAMMED THE CAR HOOD DOWN, THEN THE CAR MIRACULOUSLY REGAINED POWER. NOT A BATTERY ISSUE, DEFINITELY ELECTRICAL. CAR ALSO COMPLETELY SHUTS OFF WHILE DRIVING. POWER STEERING GOES OUT, RADIO TURNS OFF, DASH TURNS OFF. MUST THROW THE CAR IN NEUTRAL AND RESTART WHILE COASTING ON THE FREEWAY. HEADLIGHTS AND DASH LIGHTS WILL DIM DURING ACCELERATION AND RADIO GOES BLACK. CAR WILL SOMETIMES SHUT OFF WHEN THROWN IN REVERSE. I FEEL LIKE MY LIFE IS IN DANGER.",
        "vin": "1G1JC6SB4E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SHIFTER KNOB ON THE CAR HAS STARTED TO STICK, WHICH MEANS IT DOESN'T LOCK THE CAR INTO WHATEVER GEAR THE SHIFTER HAS BEEN MOVED TO. THE SHIFTER CAN EASILY BE MOVED FROM DRIVE TO NEUTRAL OR MORE DANGEROUSLY OUT OF PARK. ADDITIONALLY, WHEN THE BUTTON IS STUCK, YOU CAN'T REMOVE THE KEY FROM THE IGNITION.",
        "vin": "1G1JC6SG9E4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER \"AIRBAG OFF\" REMAINS ILLUMINATED IF YOU HAVE A 100LB OR 250LB PERSON IN THE SEAT. EVERY SO OFTEN, WHEN A 200+LB PERSON SIT IN THE PASSENGER SEAT, THE LIGHT WILL EXTINGUISH INDICATING THAT THE AIRBAG IS ACTIVATED. THEN IF THAT 200+LB PERSON ADJUST POSITION WHILE IN THE SEAT , THE \"AIRBAG OFF\" LIGHT WILL ILLUMINATE AGAIN. I READ MANY SONIC OWNER COMPLAINTS FROM 2012-2016 MODEL YEARS WITH THE SAME ISSUE. I CALLED 2 LOCAL CHEVY DEALERS AND THE SERVICE ADVISORS SAID THEY WERE NOT AWARE OF ANY \"AIRBAG OFF\" LIGHT ISSUES AT ALL BUT I COULD STOP BY SO THEY DIAGNOSE A KNOWN PROBLEM FOR $140. FROM ALL THE FORUMS I'VE READ, NOT ONE, I REPEAT NOT ONE OF THESE AIRBAG LIGHT OFF ISSUES HAS BEEN RESOLVED EVEN AFTER TAKING THE CAR TO THE DEALER.     AN ATTORNEY WEBSITE DEDICATED TO SONIC AIRBAG ISSUES HAS MANY TESTIMONIALS FROM OWNERS AND STATISTICS SHOWING AT LEAST 10 INJURIES AND 1 DEATH RESULTING FROM THESE AIRBAG ISSUES. THESE ARE NOT TAKATA AIRBAGS BY THE WAY. I SINCERELY HOPE THAT NHTSA LOOKS INTO THIS ISSUE BEFORE THERE ARE ANY MORE INJURIES OR DEATHS.  *TR",
        "vin": "1G1JC6SH3E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155366,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAS BEEN GOING ON FOR 3 MONTHS NOW. I WILL BE DRIVING AND THE DOORS WILL LOCK, THE INSTRUMENT PANEL AND RADIO WILL GO BLANK AND THE CAR WILL REV LIKE ITS OUT OF GEAR. WE HAVE CHANGED BATTERY, ALTERNATOR CHECKED AND DIAGNOSTICS TEST FOUND NOTHING. TODAY I WENT TO TOWN AND GOT TO MY DESTINATION FINE. I GOT BACK IN MY CAR TO LEAVE AND NO POWER AT ALL! I WAS SITTING THERE AND CAR NOT RUNNING BECAUSE BATTERY DRAINED BUT THE RPM GAUGE WAS MOVING BACK AND FORTH ON 0. HOW WITH NO POWER? I WENT ONLINE AND WAS OUTRAGED TO FINE HOW MANY PEOPLE HAVE THE SAME COMPLAINT AND NO DEALERSHIP CAN'T FIND OUT WHAT IS WRONG. YOU CAN BE DRIVING AND IT CUT OFF AS YOU DRIVING ON FREEWAY!! DANGEROUS!!! IT HAPPENS WHEN DRIVING. WHEN STOPPED IT REALLY DOESN'T MATTER. PLEASE HELP!!",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150872,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ALMOST A YEAR SINCE ENGINE LAST STALLED WITHOUT WARNING (HAPPENED 3 TIMES IN ABOUT 3 MONTHS). WHEN PULLING INTO TRAFFIC FROM A STOP, HEARD 3 CHIMES AND SEVERAL WARNING LIGHTS LIT UP (TRACTION CONTROL, ENGINE POWER DOWN, CHECK ENGINE, SERVICE CAR ASAP). ENGINE AT LOW POWER, WAS ABLE TO DRIFT INTO PARKING LOT. RESTARTED CAR AFTER SEVERAL MINUTES, ALL LIGHTS EXCEPT CHECK ENGINE WENT OFF. CHECK ENGINE LIGHT WENT OFF AFTER I PUT GAS IN THE CAR THE NEXT DAY. I DO NOT FEEL SAFE IN THIS CAR. LONG STORY SHORT THE DEALER WAS GOING TO WORK WITH ME TO TAKE THE CAR BACK, BUT BANK WOULD NOT RELEASE TITLE (LOAN IS VERY UPSIDE DOWN) UNTIL ANOTHER MECHANIC LOOKED AT THE CAR. BANK WANTED ME TO UTILIZE MY WARRANTY PROGRAM I HAD PURCHASED WITH THE CAR LOAN. MECHANIC FOUND P2138 APP SENSOR CODE. WAS LEANING INTO THE DRIVER SIDE ON THE FLOOR TO LOOK UNDER THE DASH AND HIS ELBOW GOT WET. FOUND DRIVER FOOTWELL COMPLETELY SOAKED: CARPET, LINER, AND CARPET PAD. REST OF THE CAR WAS DRY. DISCOVERED THE SUNROOF HAD BEEN LEAKING DOWN INTO THE CAR AND NOT DRAINING OUT PROPERLY ON DRIVER'S SIDE. COULD NOT CHECK ENTIRE DRAIN SYSTEM WITHOUT REMOVING HEADLINER. FOUND WATER HAD COMPROMISED THE SIDE AIR BAG AND WIRE HARNESS; SEVERAL CONNECTORS CORRODED. SPRAYED WATER ON WIRES AND WAS ABLE TO REPLICATE ENGINE POWER LOSS. CONFIRMED THAT WATER WAS LEAKING INTO THE VEHICLE ONTO THE WIRE HARNESS. TEMPORARILY FIXED THE ISSUE WITH DIELECTRIC GREASE TO PREVENT CONNECTORS FROM GETTING WET. MECHANIC LEFT THE PANELS OFF SO I CAN MONITOR THE SUNROOF LEAKING. I DO NOT FEEL SAFE IN THE CAR BECAUSE OF THE AIR BAG BEING WET AND MAY NOT DEPLOY PROPERLY, THE WET CARPET PAD WHICH COULD CAUSE RUST AND MOLD, AND THE CORRODED WIRE TERMINALS. WILL CONTACT DEALER AND BANK TOMORROW. I AM HOPING THEY WILL TAKE THE CAR OFF MY HANDS AS IT WILL BE A FEW YEARS TIL I CAN PAY IT OFF AND I DON'T WANT AN ACCIDENT BEFORE THEN.",
        "vin": "1G1JC5SG3E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144530,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN COMPLAINING TO GM HEADQUARTERS AS WELL AS SEVERAL OF THE CHEVY DEALERSHIPS IN MY LOCAL AREA!  I HAVE BEEN TO ALMOST EVERY CHEVY DEALERSHIP IN TOWN FOR SERVICE AND NO ONE CAN FIND THE PROBLEM, OR TELL ME WHAT IS CAUSING ME THE ISSUES I HAVE BEEN HAVING WITH MY CAR SINCE NOVEMBER 2015!! I RECENTLY HAD A NEW BATTERY PUT IN (THE 5TH BATTERY ON THE CAR, THE 2ND ONE THIS MONTH!!) BUT THE BATTERIES KEEP DYING! OF COURSE I AM BEING HIT WITH COSTS WHEN THIS HAPPENS OR THE \"SEARCH\" FOR THE ISSUE IS INITIATED.  I HAVE FOUND ONLY 1 DEALERSHIP THAT ACTUALLY CARES ENOUGH ABOUT ME AND THIS CAR TO EITHER WAIVE OR MODIFY THESE COSTS.  EITHER WAY, THIS IS UNFAIR TO ME IN THAT YOU ARE NOT RECALLING THE VEHICLE, BUT I STILL HAVE TO PAY FOR IT.  I FEEL THAT YOU KNEW WHEN YOU ROLLED THE PIECE OF JUNK OFF THE ASSEMBLY LINE THAT IT WAS NOT GOING TO BE WOTH ANYTHING AFTER THAT FIRST YEAR! THOUGH MY VIN DOES NOT RENDER ANY RESULTS IN THE RECAL SEARCH PORTAL, IT SHOULD! I HAVE HAD SO MUCH MAJOR WORK DONE ON THIS CAR AND IT HAS NOT EVEN BEEN 10 YEARS YET!  I NEED GUIDANCE IN FILING A CLASS ACTION AGAINST CHEVROLET BECAUSE YOU KNOW THERE ARE MAJOR ISSUES WITH THE CRAFTSMANSHIP OF THE VEHICLE, YET YOU WON'T ISSUE A RECALL.  I HAVE READ SIMILAR COMPLAINTS FOR THIS VEHICLE AND THAT IS ENOUGH TO HAVE A RECALL ISSUED.  I CAN'T STOP FOR GAS, ERRANDS ETC WITHOUT HAVING TO WORRY IF THE CAR WILL CRANK BACK UP OR RESTART!  IT IS SO UNRELIABLE AND IT IS DEFINATELY NOT SAFE! I HAVE CALLED ROADSIDE ASSISTANCE AT LEAST 6 TIMES FOR A JUMP HELP IN THE LAST MONTH! I HAD TO CALL TWICE IN ONE DAY MOST RECENTLY!! THE DEALERSHIP GAVE ME A REPLACEMENT BATTERY OCT 4TH AND BY OCT 12TH IT HAD 5% VOLTAGE!  THE CAR WAS SITTING IN MY SON'S DRIVEWAY THAT DAY--THEN THIS HAPPENED AGAIN LATER THAT MORNING  AS I WAS LEAVING A DR APPT--I WAS PLANNING TO TAKE IT TO THE DEALER FOR SERVICE!",
        "vin": "1G1JC6SH1E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2018",
        "dateOfIncident": "10/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143540,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WON'T START IT ONLY CLICKS REALLY FAST. HAD BATTERY CHECKED AND IT'S FULLY CHARGED    ONCE I JUMP IT THE CAR WILL DRIVE UNTIL I SHUT IT OFF. IT WILL START BACK UP RIGHT AWAY BUT IF I LET IT SIT IT WILL NOT",
        "vin": "1G1JB5SH8E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "10/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE THE VEHICLE WAS ENGAGED IN THE PARK POSITION, THE KEY FAILED TO RELEASE FROM THE IGNITION SWITCH AND THE ENGINE CONTINUED TO RUN. ADDITIONALLY, AN ABNORMAL CLICKING NOISE WAS HEARD. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 82,000.",
        "vin": "1G1JC6SB1E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139235,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THE VEHICLE STALLED NUMEROUS TIMES WITHOUT WARNING. THE DEALER (VAN CHEVROLET, 8585 E FRANK LLOYD WRIGHT BLVD, SCOTTSDALE, AZ 85260, 1-480-696-5884) PERFORMED SEVERAL DIAGNOSTIC TESTS THAT INCLUDED THE WATER PUMP, A GASKET BOOT IN THE ENGINE, AND THE BATTERY LINES. THE CONTACT ALSO STATED THAT THE HEADLAMP ASSEMBLY WIRING KEPT BURNING OUT, BUT THE DEALER HAD NOT PROVIDED A REMEDY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139033,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG WILL NOT TURN ON WHEN THERE IS A PASSENGER IN THE SEAT. THIS IS A SPORADIC PROBLEM AND DOES NOT ALWAYS HAPPEN. IT WILL ALSO ILLUMINATE BOTH THE ON AND OFF LIGHTS AT THE SAME TIME. THIS IS A SAFETY ISSUE BECAUSE IF IN AN ACCIDENT THE PASSENGER AIRBAG MAY NOT DEPLOY IF THE SENSOR IS NOT WORKING TO DETECT A PASSENGER.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BUTTON ON THE SIFTER HANDLE HAS BROKEN AND GETS STUCK IN ALLOWING THE SHIFT HANDLE TO MOVE FREELY. THIS HAS CAUSED MY VEHICLE TO SHIFT INTO NEUTRAL WHILE DRIVING. IT HAS ALSO ALLOWED MY VEHICLE TO SHIFT INTO REVERSE ON ITS OWN WHILE SITTING IN THE PARKED POSITION. THIS ISSUE HAS BEEN GOING ON IN A LOT OF THE SONIC AND NEEDS TO BE RECALLED. MY VEHICLE HAS ALSO SHIFTED INTO REVERSE AND HIT ANOTHER VEHICLE PARKED BEHIND ME.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT 54 MPH THERE IS A JUMPING MOTION OF THE VEHICLE. IT FEELS LIKE I HIT THE BRAKE PEDAL. IT WILL DO THIS SEVERAL TIME WHEN DRIVING ONLY AT 54 MPH FOR MORE THEN 1/4 OF A MILE. THERE ARE NO WARNING LIGHT AND ALL FLUIDS ARE CHECKED AND ARE ADEQUATE.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139046,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WARNING CHIME THAT IS SUPPOSED TO SOUND IS NOT WORKING PROPERLY. THERE IS A RECALL FOR THIS ISSUE BUT THE DEALER SAID MY VEHICLE IS NOT INCLUDED IN THE RECALL BY THE DATE IT WAS MADE. THE WARNING CHIME WILL NOT SOUND FOR  CERTAIN WARNINGS. MY VEHICLE OVERHEATED AND NO WARNING SOUND WAS MADE. MY VEHICLE TIRE WENT FLAT A  WHILE DRIVING AND NO WARNING SOUND WAS MADE. IF THE TURN SIGNAL IS ON THE OTHER WARNING SOUNDS DO NOT WORK I.E. SEATBELT WARNING CHIME. THIS IS A MAJOR ISSUE SINCE I HAVE HAD TWO WARNINGS WITH NO SOUND TO ALERT ME.",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130734,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE OFF AND PARKED. KEY IN IGNITION. OFF POSITION. VEHICLE STARTED ON ITS OWN WITH NO OTHER MANUAL INPUT. PREVIOUSLY HAD RECALL 17130 KEY REMINDER CHIME C/W ON 4/27/2016.",
        "vin": "1G1JE6SB4E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CONCERN THAT NEEDS TO BE ADDRESS. MY PASSENGER SEAT LIGHT COMES ON AND GOES OFF ON ITS OWN. I HAD MY CAR LOOKED SOMETIME AGO AT A DEALERSHIP ALONG WITH PROBLEMS WITH THE WINDOW ON THE FRONT PASSENGER SIDE. NOW THE BACK PASSENGER RIGHT SIDE WINDOW JUST WENT OUT WITHOUT A WARNING. I AM NOW STUCK WITH A WINDOW. THAT I CANNOT ROLL UP OR EVEN MANUALLY. I AM STARTING TO BELIEVE MY CAR I PURCHASED BRAND NEW WITH 9 MILES ON IT. HAVE ELECTRICAL ISSUE, THAT HAVE NOT BEEN ADDRESS. THIS CAR IS NOT OLD ENOUGH TO HAVE THIS TYPES OF PROBLEMS. I AM JUST BAFFLED OF HOWEVER EVERYTHING IS OUT OF POCKET. LAST YEAR I SPENT OVER $200 GETTING MY CAR FIXED SOMETHING ABOUT FUEL LINE OR SOMETHING WAS CLOGGED. I AM LIKE HOW IS THAT POSSIBLE WHEN I TAKE MY CAR IN FOR OIL CHANGES ON THE REGULAR.      THIS IS NOT A 7 YEAR OLD OR PLUS CAR. I SHOULDN'T BE HAVING THESE PROBLEMS ALREADY IN MY 1ST YEAR - 4TH YEAR.     I HAD TO CHANGE BATTERIES TWICES AS WELL.  CAN YOU PLEASE ASSIST. MULTIPLE CAR PROBLEMS  FOR  A 2014 I BROUGHT NEW ARE CAUSING ME A HARDSHIP.",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   I WAS INVOLVED IN AN ACCIDENT WHERE I HIT A STATIONARY SUV FROM THE BACK, I WAS TRAVELING 30-35 MPH PER THE POLICE REPORT THROUGH A LARGE CITY INTERSECTION. MY SONIC WAS HIT HARD ON THE WHOLE FRONT LEFT (DRIVER SIDE)  THE CAR WAS TOTALED AND WAS REPORTED TO HAVE A LOT OF LEFT FRAME DAMAGE. DURING THIS ACCIDENT MY AIRBAGS DID NOT DEPLOY. NO AMBULANCE WAS CALLED BUT I WAS TAKEN TO THE VA TO RECEIVE TREATMENT FOR MY BACK PAIN FROM THE ACCIDENT.  I HAVE BEEN INFORMED THAT BASED ON THE HARD HIT AND THE AMAZING OF DAMAGE MY AIR BAGS SHOULD HAVE DEPLOYED FOR MY SAFETY. THE REASON THE AIRBAGS DID NOT DEPLOY IS UNKNOWN TO ME.",
        "vin": "1G1JC6SB5E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122796,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHEN THE VEHICLE WAS TURNED OFF AND WITH THE KEY INSIDE THE IGNITION SWITCH FOR MORE THAN TEN MINUTES, THE WARNING CHIME DID NOT ACTIVATE WHEN THE DOOR WAS AJAR. THE VEHICLE WAS NOT TAKEN TO THE DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER  WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 41,000.",
        "vin": "1G1JC5SH8E4"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121612,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT ON. RPMS GOING UP AND DOWN IN IDLE. CAR STALLS WHEN FIRST STARTED IN THE MORNING. RPMS GO VERY HIGH AFTER BEING DRIVEN WHEN SHIFTED INTO PARK. GEAR SHIFTER BUTTON STICKS AND MUST BE MANUALLY POPPED OUT. STABILITRAK LIGHT COMING ON.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2018",
        "dateOfIncident": "07/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114315,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IF I'M YIELDING AT A STOP OR SITTING IDLE IN TRAFFIC, THE MINUTE I MOVE OR TURN THE CAR SHUTS OFF COMPLETELY. SOMETIMES IN THE THICK OF TRAFFIC LIKE AN INTERSECTION. IT'S NOT SAFE AND COULD CAUSE AN ACCIDENT.",
        "vin": "1G1JC5SH8E4"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2018",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFTER BUTTON STICKS AND CAN'T PULL KEY OUT OF IGNITION....JUST BOUGHT THIS SMH",
        "vin": "1G1JC5SH8E4"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113916,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE SEAT BELT TENSIONER CABLE SNAPPED WHILE DRIVING ON THE FREEWAY.",
        "vin": "1G1JC5SH4E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/24/2018",
        "dateOfIncident": "10/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103650,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY WHEN MY STEELING WHEEL CONTROL BUTTONS JUST STOP WORKING AS WELL AS TRUCK AND OFF ROAD BUTTON IN MIDDLE STOP WORKING. AFTER STOPPING TO CHECK, A REVERSE CAMERA COMES ON NOW BUT NO CAMERA IS ON THIS MODEL. NEVER SEEN THE CAMERA BEFORE. AND TEMPERATURE IS NOT DISPLAYED ON SCREEN ANY MORE.",
        "vin": "1G1JA5SH4E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "03/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WILL STALL INTERMITTENTLY WHILE DRIVING DOWN THE ROAD FOR JUST 1-3 SECONDS AND SEEMS TO NOT BE RUNNING AND THEN IT WILL TURN ITSELF BACK ON..      THE STEREO AND DASH LIGHTS WILL GO COMPLETELY DARK AT RANDOM TIMES WHILE IN MOTION AND THEN COME BACK ON RANDOMLY OR WHEN RESTARTED.      AFTER EXITING THE VEHICLE AND REMOVING THE KEY THE STEREO WILL TURN ITSELF BACK ON SOMETIMES AND YOU WILL RETURN TO THE CAR TO HEAR THE STEREO ON.      HAVE HAD THE REMOTE CONTROL KEY STOP WORKING TO LOCK OR UNLOCK THE CAR.  IT WILL HAPPEN FOR 1 OR 2 TIMES AND THEN GO BACK TO NORMAL.      ALL OF THESE ITEMS HAVE BEEN OCCURRING FOR ABOUT THE PAST 1-1 1/2 YEARS.",
        "vin": "1G1JC6SH0E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099844,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED THIS ISSUE AFTER I CAME HOME FROM WORK ONE NIGHT. WHEN I PLACED THE CAR IN PARK THE BUTTON WOULD NOT POP OUT ALLOWING ME TO REMOVE THE KEY FROM THE IGNITION. IT ALSO WILL NOT LOCK THE GEAR SHIFTER INTO PLACE AND YOU CAN FREELY MOVE BETWEEN GEARS WITHOUT USING THE BUTTON. IT WILL EVENTUALLY COME OUT, DUE TO THE FORCE OF THE LINKAGE PUSHING AGAINST IT. DANGEROUS CONDITION AS YOU MAY ACCIDENTALLY HIT THE SHIFTER WHILE DRIVING.    ON AUTOMATIC TRANSMISSION VEHICLES, THE BUTTON THAT YOU PRESS IN TO SHIFT WILL BREAK AT THE BASE OF THE BUTTON WHERE IT IS HELD IN BY A SMALL PIN. THE ORIGINAL BUTTON IS A DESIGN DEFECT THAT GENERAL MOTORS KNOWS ABOUT. THEY HAVE RELEASED AN UPDATED VERSION OF THE KNOB THAT IS NO LONGER ONE PIECE AND IT IS SOLD AS A REPAIR KIT. THE REPAIR KIT PART NUMBER IS 4242-3234 AND COSTS ANYWHERE FROM 10-20 USD DEPENDING ON THE DEALERSHIP PURCHASED FROM. A NUMBER OF OWNERS HAVE REPORTED THIS ISSUE ON THEIR CARS WITH VARYING MILEAGE.",
        "vin": "1G1JC5SH6E4"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "04/17/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11093407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ROAD I WAS DRIVING ON IS 55 MPH ON BEAR IN.  AS I BEGAN TO BREAK NOTHING HAPPENED.  A 90 CORNER WAS IN FRONT OF ME.  55TH AVE.  I PUSHED AS HARD AS I COULD ON THE BREAKS.  IT WAS SMOOTH.. TRACTION CONTROL WAS ON.  NO BREAKING UNIT WENT INTO AFFECT.  IT WAS SMOOTH ALL THE WAY INTO A TREE HEAD ON.  ZERO SKID MARKS!  I WAS CONSCIOUS THE ENTIRE TIME CLOSED ON EYES RIGHT BEFORE IMPACT.  AIR BAGS DID WORK.    THE ENGINE STARTED ON FIRE 3X.   THEY HAD TO USE THE JAWS OF LIFE TO REMOVE THE VEHICLE FROM THE TREE.  I PUSHED SO HARD ON THE BREAK THAT IT BROKE MY ANKLE, SPLIT MY KNEE OPEN AND SPRAINED MY KNEE.  I WAS TAKEN TO THE HOSPITAL.    MILEAGE ON THE VEHICLE WAS ABOUT 56K.  THIS SHOULD HAVE KILLED ME.  THE BREAKS HAD WORKED FINE BEFORE THIS.. NO SQUEALING,  SHAKING ETC.  IN GOOD WORKING ORDER.    CONDITIONS WERE DARK, DRY ROADS, NO WIND.    I DO HAVE REPORTS BUT CAN NOT SCAN THEM. I LOADED 5 IMAGES!    PLEASE LOOK INTO THIS MATTER  IMMEDIATELY.  LIVES ARE AT STAKE.",
        "vin": "1G1JE6SB0E4"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/19/2018",
        "dateOfIncident": "03/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I CUT MY CAR OFF THE KEY WILL NOT COME OUT. IT TAKES A GOOD BIT OF MESSING WITH IT FOR IT TO COME OUT. I HAVE PUT CAR LUBE  ON IT AND IT DIDN'T WORK. IT HAS BEEN GOING ON NOW FOR OVER A MONTH.",
        "vin": "1G1JC5SH8E4"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "03/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081794,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING ISSUES: WHEN I BOUGHT THE CAR THEY HAD TO DO SOMETHING WITH THE ELECTRICAL SYSTEM BECAUSE CAR WOULDN'T DO ANYTHING THE DAY AFTER I BROUGHT IT HOME FROM THE DEALER. THIS PROBLEM IS WITH MY STEERING. WHICH HAPPENED AFTER THEY SERVICE MY CARS AIRBAG IN MY STEERING WHEEL. IT WAS FIXED TWICE, AND NOW IT'S A PROBLEM AGAIN. I SHOULDN'T BE ON THE HOOK FOR PAYING FOR THIS.",
        "vin": "1G1JC5SG2E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080796,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERMOSTAT HOUSING AND WATER INTAKE PROBLEM. THE FACTORY WATER INTAKE IS PLASTIC AND DOES NOT STAND UP TO HEAT SO IT WARPS AND STARTS LEAKING. IT LEAKS MORE WHEN THE VEHICLE IS RUNNING AND UNDER PRESSURE BUT STILL DRIPS WHEN THE VEHICLE IS PARKED THIS CAUSES THE CHECK ENGINE LIGHT TO COME ON. WENT TO THE DEALER THEY WANTED $503 TO PUT 2 GASKETS IN AND WOULD NOT GUARENTEE WHAT THEY SAID IT WAS WOULD FIX THE PROBLEM. I WENT ON YOUR WEB SITE AND SAW 18% OF THE SONICS SOLD HAVE THIS PROBLEM. THAT IS ONLY THE ONES WHO HAVE COMPLAINED. I REPLACED THE FACTORY WATER INTAKE WITH A METAL ONE AND IT WAS GOOD UNTIL THE PLUG (WHICH WAS INSTALLED BY THE MANUFACTURER) ON THE UNDERSIDE STARTED LEAKING.",
        "vin": "1G1JC6SH0E4"
    },
    {
        "components": "STEERING,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "02/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080642,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO PASS AN EIGHTEEN WHEELER ON AN INTERSTATE AND AS I ACCELLERATED, THE VEHICLE BEGAN TO FISHTAIL, WHEN I RAN OVER A BUMPY PART IN THE ROAD DUE TO A BRIDGE THAT FELL , I LOST ALL STABILITY CONTROL AND CONTROL OVER THE VEHICLE.  WE SLAMMED INTO THE CAB OF THE RITE ENTRANCE WHEELER ON THE FRONT PASSENGER SIDE IN THE FRONT.  NO AIR BAGS WERE RELEASED.  WHEN WE HIT THE EITEEN WHEELER IT  PUSHED OUR CAR TOWARDS THE CONSTRUCTION ZONE WIRE RAILING, THE BACK OF OUR VEHICLE ON THE PASSENGER SIDE HIT THE TRAILER.  NO AIR BAGS RELEASED.  WE THEN GRINNED ACROSS THE WIRE RAILING AND RAN OVER A FEW CONES ON THE DRIVERS SIDE.  ON ALL THREE IMPACTS, NO AIR BAGS WERE RELEASED.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 03/12/2018 MY CHECK ENGINE LIGHT CAME ON WHILE DRIVING ON THE ACCESS ROAD, WHILE AT A STOP LIGHT MY CAR STARTED \"BUCKLING\", WHEN LIGHT TURNED GREEN HESISTATION AND MAJOR LOSS OF POWER OCCURED. FINALLY GOT GOING AND WHEN I GOT BACK TO WORK AND PARK IT WOULDN'T START AFTER I WENT IN AND CAME BACK OUT. GOT IT JUMPED AND WENT TO BOTH NAPA AND AUTO ZONE BOTH SAID IT WAS MASS AIRFLOW SENSOR. GOT THE PART THE FROM THE DEALERSHIP AND REPLACED IT. ALL WAS WELL TILL TODAY 03/15/2018 CHECK ENGINE LIGHT COMES BACK ON AND MY CAR STARTED HESISTATING ON THE HIGHWAY AND EVENTUALLY STALLING AS I WAS PULLING OF TO THE ACCESS ROADS. PRIOR TO HOT AIR WAS BLOWING OUT OF MY A.C WHILE THE COLD SETTING WAS ON. MADE MY WAY TO AUTO ZONE AND THEY SAID IT WAS P0171 RUNNING TO LEAN/TOO MUCH AIR. IN THE PARKING LOT ENSURED THE OIL CAP, DIP STICK, AIR FILTER CABIN WERE ALL SEALED TIGHT, WIRES WERE FINE, UPON INSPECTION OF THE AIR CLEANER INTAKE DUCT HOSE FOUND OUT IT WAS BROKEN ALL THE WAY AROUND THE HOSE. CALLED MY EXTENDED WARRANTY AGENT AND HE INFORMED ME THAT IT IS A COMMON PROBLEM WITH THIS VEHICLE AND THAT IT MAY NOT BE COVERED. IF THE EXTENDED WARRANTY PEOPLE AND THE MANUFACTURES KNOW OF THIS, WHY NOT MENTION IT IN THE MANUAL OR HAVE THE TECHS WHO CHANGE OUR OIL AND AIR FILTERS LOOK AT IT AND MENTION IT TO US SINCE ITS RIGHT NEXT TO THE AIR COMPARTMENT.  AS I DROVE IT BACK HOME TO PARK, THE ENGINE STALLED ON ME AGAIN LUCKILY IT WAS AS I WAS PARKING.",
        "vin": "1G1JA5SHXE4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG ON/OFF LIGHT IS ALMOST ALWAYS OFF WITH THE PASSENGER SEAT OCCUPIED WHETHER ITS SOMEONE THAT WEIGHS 100LBS UP TO  225LBS. THIS HAPPENS WHILE STATIONARY AND WHILE DRIVING. RARELY, WITH A HEAVIER OCCUPANT OF 200LBS OR MORE, THE AIRBAG ON/OFF LIGHT WILL SAY ON. BUT MOST OF THE TIME, WITH ANY OCCUPANT, THE AIRBAG ON/OFF REMAINS OFF.",
        "vin": "1G1JC6SH3E4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "02/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11073247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING 50 MPH, THE CONTACT STRUCK A VAN DUE TO WEATHER CONDITIONS. THE AIR BAGS DID NOT DEPLOY. THE POLICE DEPARTMENT WAS CALLED TO THE SCENE AND A POLICE REPORT WAS FILED. THE AMBULANCE WAS NOT CALLED AND THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO THE CONTACT'S RESIDENCE. THE CONTACT SUSTAINED A FRACTURED NECK AND A CONCUSSION AND HER SPOUSE SUSTAINED A SPRAINED NECK AND BACK. MEDICAL ATTENTION WAS RECEIVED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 64,913.",
        "vin": "1G1JB5SH7E4"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE PARKING THE VEHICLE, THE CONTACT NOTICED THAT THE SHIFTER BECAME STUCK AND WAS NOT ABLE TO GO INTO PARK, WHICH CAUSED THE KEY TO BECOME STUCK. THE DEALER WAS CONTACTED (MOUNTAIN VIEW CHEVROLET, 890 RIVERFRONT PKWY, CHATTANOOGA, TN 37402) AND DIAGNOSED THAT THE FAILURE WAS THE SHIFTER ASSEMBLY, WHICH NEEDED TO BE REPLACED. THE MANUFACTURER STATED THAT THE VEHICLE WAS 20,000 MILES OVER THE WARRANTY; THEREFORE, THEY WERE NOT RESPONSIBLE FOR THE REPAIRS. THE FAILURE MILEAGE WAS 58,500.",
        "vin": "1G1JC5SH9E4"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2018",
        "dateOfIncident": "01/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066842,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS ALWAYS HAD PROBLEMS HARD SHIFT/NO SHIFT SLIPPING AT 60K HAD TO BE FIXED BUT STILL ACTS UP. ENGINE COOLANT PUMP HAD TO BE REPLACED WITHIN A YEAR OF PURCHASE AND IT WAS NOT COVERED BY WARRANTY AND 3 THERMOSTAT HOUSINGS HAVE BEEN PUT ON. UPON PLACING THE VEHICLE IN PARK THE ENGINE WILL REV TO ABOUT 5K RPMS. THE KEY GETS INCREADIBLY HOT WHILE DRIVING AND IT ACTUALLY BURNED MY DAUGHTER. IF THE KEY IS LEFT IN THE IGNITION AFTER PARKING THE VEHICLE WILL CONTINUALLY TRY TO CRANK IT'S SELF. IF THERE IS ANY KIND OF WIND THE VEHICLE WILL SWAY AND BECOMES DIFFICULT TO CONTROL.",
        "vin": "1G1JC5SH1E4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/28/2017",
        "dateOfIncident": "10/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057205,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THE AIR BAG INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (JOHN BOWMAN CHEVROLET INC, 6750 DIXIE HIGHWAY, CLARKSTON, MICHIGAN 48346) DIAGNOSED THAT THE CLOCK SPRING NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND OPENED CASE NUMBER: # [XXX]. THE CONTACT WAS REFERRED TO NHTSA. THE FAILURE MILEAGE WAS 67,000.   *BF    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G1JF6SB5E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "11/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044020,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLED GOING OVER A SPEED BUMP WHERE ALL THE LIGHTS ON THE DASH WENT OFF THEN BACK ON. AFTER COASTING TO THE SIDEWALK, TURNED VEHICLE OFF AND THEN BACK ON. VEH SURGED FORWARD AFTER MAKING A LEFT HAND TURN, IT'S ALSO DONE THAT ON A RIGHT HAND TURN. ALSO TIRE ON DRIVERS SIDE LOCKED UP. FINAL TIME OCCURRED WITH VEH SURGING WAS RECENTLY AS IT SURGED AND ALL THE LOCKS WERE GOING UP AND DOWN. HA E HAD CONCERNS WHILE BACKING OUT AND LOOSING POWER TO STEERING.",
        "vin": "1G1JC5SH4E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044011,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I HAVE ENCOUNTERED A PROBLEM WITH OUR 2014 CHEVY SONIC. IT WAS GETTING HOT TOOK IT TO THE DEALER TO DIAGNOSE THE PROBLEM. THEY SAID THAT THE RADIATOR HAD A CRACK ON THE SEAM. MYSELF, I AM A WELDER KNOWS THAT IN ORDER FOR A SEAM TO CRACK AFTER WELDED, 3 MAIN AND EASY ISSUES HAD TO HAPPEN SUCH AS, A. WELD GOT TOO HOT WHEN WELDED B. WHEN WELD WAS GROUND DOWN IT WAS TAKEN TOO CLOSE TO THE ROOT OF THE WELD C. THE WELD DIDNT HAVE ENOUGH PENETRATION. I PERSONALLY BELIEVE THIS IS A MANUFACTURED PART DEFECT. EXPECIALLY ONLY BEING 65000 MILES",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING 30 MPH, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC AND THE FAILURE CODE FOR THE CATALYTIC CONVERTER APPEARED. THE CODE WAS CLEARED, BUT IT RE-ILLUMINATED. THE LOCAL DEALER (DEPAULA CHEVROLET, 785 CENTRAL AVE, ALBANY, NY, 12206) WAS CONTACTED AT 518-278-6036 AND STATED THAT THEY SERVICED THE VEHICLE FOR THE SAME FAILURE IN JUNE OF 2017. NO ADDITIONAL ASSISTANCE WAS OFFERED. THE CONTACT STATED TO THE DEALER THAT SHE WAS UNAWARE THAT HER VEHICLE WAS SERVICED AT THE TIME FOR THE FAILURE BECAUSE THE VEHICLE WAS TAKEN IN FOR AN OIL CHANGE AND TIRES. THE VEHICLE WAS NOT REPAIRED OR DIAGNOSED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 19,000.",
        "vin": "1G1JA6SG2E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "08/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE INDEPENDENTLY ACCELERATED. THE CHECK ENGINE AND TRACTION WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 68,516.",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL FEELS TOO SOFT AND CAUSES THE CAR TO HAVE PROBLEMS WITH MAKING SMOOTH STOPS. I NOTICED THIS CHANGE IN OCTOBER 2016. THIS PROBLEM IS PARTICULARLY DANGEROUS WHEN YOU ARE REQUIRED TO MAKE SUDDEN STOPS AT INTERSECTIONS OR IN HEAVY TRAFFIC. THIS HAPPENS WHEN DRIVING ON CITY STREETS, NEIGHBORHOOD STREETS AND ON HIGHWAYS. I AM CONCERNED THAT THIS COULD RESULT IN ANOTHER VEHICLE FROM STRIKING MINE IN THE REAR OR A CHILD BEING HURT OR KILLED WHEN I DRIVE THROUGH MY NEIGHBORHOOD STREETS. IT IS VERY UNPREDICTABLE.     I TOOK IT TO MY CHEVROLET DEALER AND THEY SAID THEY WERE UNABLE TO DUPLICATE THE PROBLEM AT THAT TIME. I AM INCLUDING AN IMAGE OF THE DEALER'S SERVICE REPORT FROM 11/09/2016. THE PROBLEM STILL CONTINUES TO THIS DATE, 8/8/17.  SINCE THE PROBLEM IS ONGOING, I CANNOT REPORT AN ACTUAL DATE, MILEAGE, OR DRIVING SPEED.",
        "vin": "1G1JC5SH1E4"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006715,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BUTTON ON GEAR SHIFT SELECTOR WILL DEPRESS, BUT WILL NOT RELEASE, MAKING IT VERY EASY TO ACCIDENTALLY BUMP THE KNOB AND PUT THE CAR INTO ANOTHER GEAR WHILE THE VEHICLE IS IN MOTION.",
        "vin": "1G1JC6SH4E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GEAR SHIFT BUTTON STICKING. CAN BE BARELY TOUCHED TO MOVE OUT OF PARK AND UNABKE TO REMOVE KEY!!!",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "05/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992882,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT BUTTON IS STICKING MAKING IT ABLE TO SHIFT INTO GEAR WITHOUT DEPRESSING IT MANUALLY",
        "vin": "1G1JC5SB3E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/13/2017",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985502,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO A DEFECT IN MANUFACTURING RAIN WATER WAS FLOODING INSIDE PASSENGER COMPARTMENT FRONT AND BACK, PASSENGER SIDE. CAR WAS AT DEALER TWICE TO REPAIR LEAK. DEALSHIP DETERMINED THIS LEAK IS CAUSED BY FAULTY MANUFACTURING.REPAIR WAS NOT COVERED BY CHEVROLET AND COST ME AND INSURANCE COMPANY UNDUE EXPENSE.",
        "vin": "1G1JC6SHXE4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981145,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER AIR BAG DOES NOT WORK.",
        "vin": ""
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE IN ONE MONTH THE CAR ENGINE SHUT OFF WHILE I WAS DRIVING. POWER STEERING WAS ALSO LOST. MILEAGE APPROX. 31,000. I WAS ABLE TO RESTART THE CAR AFTER PUTTING IT IN PARK. THE FIRST TIME, I WAS TURNING, PULLING INTO A PARKING LOT, SO I WAS ABLE TO DRIFT INTO A PARKING SPOT SAFELY. SECOND TIME I WAS IN SMALL TOWN BUMPER TO BUMPER TRAFFIC. TOOK MY FOOT OFF THE BRAKE AND STEPPED ON THE GAS AND NOTHING HAPPENED, SO I PUT IT IN PARK AND RESTARTED IT AND IT SEEMED FINE AFTER THAT. TOOK IT TO DEALER WHERE I BOUGHT IT, THEY DID NOTHING AS THE CAR WAS NOT THROWING ANY CODES AND NO WARNING LIGHTS WERE ON. SECOND GARAGE I WENT TO ALSO COULD NOT FIND AN ISSUE SO THEY DID NOTHING. TOOK IT TO ANOTHER DEALERSHIP AND THE CAR STALLED ON THEM AS THEY WERE PARKING IT, RIGHT AFTER I HAD DROPPED IT OFF. THEY KEPT IT FOR ALMOST A WEEK AND DROVE IT 61 MILES AND COULD NOT RECREATE THE STALLING. THEY CHECKED THE CAR THOROUGHLY AND NOTHING APPEARED TO BE WRONG WITH IT. THEY CHECKED ALL RECALLS AND BULLETINS, NOTHING MENTIONED IN THOSE. THE CAR WOULD ALSO \"BOUNCE\" UP AND DOWN WHEN I WAS STOPPED AT A RED LIGHT. THAT WAS HAPPENING MORE FREQUENTLY ONCE THE ENGINE TROUBLES STARTED. I GOT MY CAR BACK LAST NIGHT FROM THE OTHER DEALER AND DIDN'T NOTICE ANY \"BOUNCING\" SO MAYBE THEY FIXED SOMETHING WHEN THEY WERE CHECKING THE CAR, HOWEVER THE INVOICE STATED ALL THEY DID WAS A 27-POINT INSPECTION AND ALIGNMENT CHECK. NO CHARGE TO ME AS CAR IS STILL UNDER WARRANTY BUT WARRANTY RUNS OUT IN 5 MONTHS.",
        "vin": "1G1JC5SG3E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "01/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948901,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 2 WEEKS AGO, MY AIRBAG WARNING LIGHT CAME ON. THE MANUAL SAID TO TAKE IT TO THE DEALERSHIP IMMEDIATELY AS THE AIRBAG COULD FAIL TO DEPLOY IN AN ACCIDENT OR COULD DEPLOY FOR NO REASON CAUSING SEVERE INJURY. I NOTICED THERE HAD BEEN A RECALL ISSUED FOR THIS VEHICLE IN 2014 FOR THIS ISSUE. ACTIONS: GM WILL NOTIFY OWNERS, AND DEALERS WILL TEST THE TERMINALS IN THE IP HARNESS CLOCK SPRING COIL CONNECTOR AND REPLACE ANY LOOSE TERMINALS, FREE OF CHARGE. THE RECALL BEGAN IN OCTOBER 2014. OWNERS MAY CONTACT CHEVROLET CUSTOMER SERVICE AT 1-800-222-1020. GM'S NUMBER FOR THIS RECALL IS 14537. FOR DETAILED INFORMATION & SUPPORTING DOCUMENTS, SEE THE OFFICIAL NHTSA PAGE CONCERNING RECALL #14V543000 . I CALLED THE NUMBER AT CHEVY CUSTOMER SERVICE, AND THEY WERE NO HELP-SAID MY VIN NUMBER WASN'T LISTED IN THE RECALL. I AM VERY CONCERNED ABOUT THIS AS IT SEEMS A COINCIDENCE THAT I HAVE THE EXACT VEHICLE AND THE EXACT PROBLEM.......THE DEALERSHIP IN PROVO, UTAH, DID A DIAGNOSIS AND SAID SINCE THE LIGHT WASN'T ON AT THE EXACT TIME OF THE DIAGNOSIS THAT THEY COULDN'T TELL. I CAN'T PREDICT WHEN IT WILL COME ON, AND WHEN IT DOES COME ON IT IS USUALLY OFF BY THE TIME I FIND A DEALERSHIP. I AM CONCERNED THAT I COULD BE SEVERELY INJURED DUE TO THIS PROBLEM AND FEEL IT COULD BE TAKEN CARE OF IF I COULD FIND SOMEONE THAT GAVE A HOOT. IT COMES ON WHEN I AM DRIVING.  *TR",
        "vin": "1G1JE6SB5E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "11/24/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928576,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING LAST TWO MONTHS WE HAD GO TO THE DEALER FOUR TIME AND THREE OF THESE DUE TO THE  ENGINE NOISE AND OVERHEATING. LAST WEEK SMELLED LIKE FIRE AND DUE TO THE GAS INSIDE THE CAR WE HAD TO PARKING. WHEN REVIEW THE ENGINE, THERE WAS NOT COLANT IN IT.  THE NOISE NEVER STOPPED AND SOME  SENSOR  WERE ON DURING SOME DAYS.  THIS CAR IS USED FOR A PREGNAN WOMAN AND GIRLS AND ARE NOT SAFETY FOR US FOR THIS REASON WE WENT TO THE DEALER TO SEE THE POSIBILITY TO CHANGE THE CAR. SO FAR, WE WAITING FOR THE SOLUTION.",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928303,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE MADE AN ABNORMAL NOISE COMING FROM THE TRANSMISSION AND ENGINE. THE DEALER DIAGNOSED THE VEHICLE, BUT COULD NOT FIND A FAILURE. IN ADDITION, WHILE DRIVING 45 MPH, THE ENGINE SENSOR AND TEMPERATURE WARNING INDICATOR ILLUMINATED. THE VEHICLE STARTED TO EMIT SMOKE UNDER THE HOOD AND WAS TAKEN BACK TO THE DEALER WHERE IT WAS DIAGNOSED, BUT NOT REPAIRED. THE FAILURE RECURRED NUMEROUS TIMES. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 42,000.",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/01/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2014 CHEVROLET SONIC. THE RADIO NO LONGER WORKS AND I HAVE NO AUDIBLE WARNING CHIMES FOR KEYS IN IGNITION, DOOR OPEN, TURN SIGNAL, SEATBELT. ALSO NO DASH LIGHTS. I SEE THERE IS A RECALL 17130. I HAVE SPOKE WITH THE DEALERSHIP IN MY AREA, THEY REFUSE TO DO THE REPAIRS BECAUSE I DO NOT HAVE A RECALL LETTER. WHEN CHECKING MY VIN, THERE ARE NO REPORTED RECALLS. I NEED A RECALL LETTER SO I MAY HAVE THIS REPAIRED. THANK YOU",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910151,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD RECALL 17130 INSTALLED IN THE VEHICLE.  AFTER INSTALLATION THE FOLLOWING PROBLEMS WERE NOTED: 1) RADIO WILL NOT SHUT OFF IF KEY IS LEFT IN IGNITION. 2)  IF KEY IS REMOVED AND REINSERTED WITHOUT EXITING THE VEHICLE THE VEHICLE STILL NOT COMPLY WITH FEDERAL/CANADA MOTOR VEHICLE SAFETY STANDARD NO 114 AS THE VEHICLE DOES NOT PROVIDE AN AUDIBLE WARNING/REMINDER CHIME WHEN THE DRIVER, AFTER TURNING OFF THE IGNITION AND LEAVING THE KEY IN THE CYLINDER, EXITS THE VEHICLE.",
        "vin": "1G2JC6SB6E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SIFTER BUTTON STICKS AND BREAKS.  KEY WILL NOT RELEASE.  VEHICLE CAN SHIFT FROM PARK TO DRIVE WITHOUT STEPPING ON THE BRAKE.  BUTTON IS PLASTIC AND BREAKS CAUSING SAME ISSUES.",
        "vin": "1G1JA5SG4E4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906958,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFTER BUTTON STUCK.  KEY WILL NOT RELEASE AND VEHICLE WILL SHIFT FROM PARK TO DRIVE WITHOUT PRESSING BRAKE.",
        "vin": "1G1JA5SH5E4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ANOTHER CAR RAN A RED LIGHT & MY SON, IN THE SONIC RAN INTO THE SIDE OF THE OTHER CAR. HIS SONIC WAS TOTALED & DESPITE THIS FACT THAT THE OTHER CAR'S SIDE AIRBAGS DEPLOYED UPON IMPACT, HIS SONIC AIRBAGS DID NOT. MY SON WAS ACCELERATING FROM STOP LIGHT ON A CITY STREET WHEN THE OTHER CAR RAN THE RED LIGHT. THE IMPACT WAS SEVERE ENOUGH TO BEND 2 OF THE 4 FRAME RAILS. THE ENGINE COMPARTMENT BUCKLED DOWN AS THEY SHOULD HAVE, BUT THE CONCERNING THING IS AIRBAGS DIDN'T DEPLOY WITH A SIGNIFICANT IMPACT. MY SON NOW HAS A REPLACEMENT SONIC BUT CONCERNED DUE TO THE RECENT RECALL OF SEVERAL MILLION CARS/TRUCKS WITH DEFECT IN AIRBAG DEPLOYMENT MECHANISM OF GM PRODUCTS.",
        "vin": "1G1JB5SH7E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING 45 MPH, THE RADIO BACK LIGHT TURNED OFF FOLLOWED BY THE ENTIRE INSTRUMENT PANEL. ALSO, THE LOCKS REPEATEDLY UNLOCKED AND LOCKED, AND THE ENGINE STALLED. ONCE THE VEHICLE WAS RESTARTED, ALL OF THE PANEL LIGHTS ILLUMINATED. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "1G1JC6SG5E4"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/25/2016",
        "dateOfIncident": "07/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888497,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LIST OF POWER BRAKE BOOST UNDER SEVERAL CONDITIONS.   1. WHEN ENGINE IS WARM, AFTER SHIFT INTO REVERSE, LIST OF POWER BRAKE BOOST  2. WHILE ACCELERATOR WAS DEPRESSED, AND AT THE SAME TIME APPLIED BRAKE, RESULTS IN LOST OF VACUUM BOOST    IN BOTH CONDITIONS, CAR IS IN MOTION AND UNABLE TO STOP WITHOUT THE USE OF EXTRA BRAKE EFFORT, COMPRISING STOPPING DISTANCE AND SAFETY, ON SEVERAL OCCASIONS VEHICLE WILL NOT STOP WHEN APPLYING BRAKE, DUE TO EXTREME STIFFNESS OF THE PEDAL",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY CAR IN TO DEALERSHIP FOR RECALL 17130.  AFTER RECEIVING CAR BACK, BACK UP CAMERA INOPERABLE AND VOLUME CONTROLS ON STEERING WHEEL FOR PHONE AND RADIO DO NOT WORK.",
        "vin": "1G1JE5SH4E4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10872005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING APPROXIMATELY 30 MPH, ANOTHER VEHICLE SUDDENLY STOPPED AND CAUSED THE CONTACT TO CRASH INTO THE PRECEDING VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE DRIVER OF THE OCCUPANT OF THE OTHER VEHICLE SUSTAINED A BACK INJURY THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "1G1JE6SB6E4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/26/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT GOES OFF AND ON WHILE DRIVING, ALL DIFFERENT TIMES AT ALL DIFFERENT SPEEDS INTERMITANTLY.  BROUGHT CAR TO DEALER THE CAR HAS 40,500 MILES ON IT, DEALER SAID IT CAME UP WITH A COUPLE OF CODES SAID NOTHING IS WRONG.  DROVE CAR TO WORK THE NEXT MORNING LIGHT BACK ON AND OFF.  CALLED 800 CHEVROLET NUMBER THEY TELL ME IT IS NOT A RECAL.  IT HAS BEEN COMING ON MORE FREQUENT BY THE DAY CAN YOU GUIDE ME THROUGH WHAT TO DO.",
        "vin": "1G1JE6SB5E4"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "12/02/1919",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846487,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LUNGES AT A STOP WHEN IN FIRST GEAR.",
        "vin": "1G1JC6SB8E4"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2016",
        "dateOfIncident": "01/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821396,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I CALLED CHEVROLET TODAY (JAN. 21, 2016 )TO ASK IF MY 2014 CHEVROLET SONIC IS EQUIPPED (OEM) WITH TAKATA AIRBAGS.  I WAS TOLD THAT THE INFORMATION IS NOT AVAILABLE AND IS PROPRIETARY.  I ASKED IF OTHER OEM INFORMATION IS AVAILABLE SUCH AS TIRE OEM INFORMATION , AND WAS TOLD THAT, YES, TIRE OEM PROVIDER INFORMATION IS AVAILABLE, JUST NOT AIRBAG OEM INFORMATION.  I LIVE IN A SEA COAST ENVIRONMENT AND AM CONCERNED THAT, AS THE YEARS WEAR ON, MY AIR BAGS WILL BE AT RISK FOR CORROSIVE DAMAGE DUE TO SALT AIR.",
        "vin": "1G1JA5SG8E4"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CUTS OUT, GRINDING NOISE FROM ENGINE.  HAD IGNITION COIL REPLACED BUT STILL DOING THE SAME THING. LOOSES POWER GOING UP STEEP HILL. ONLY HAD CAR ABOUT SEVEN MONTHS. ONLY HAS SIXTEEN THOUSAND MILES ON IT. SOMETIMES WHILE I AM DRIVING CAR JUST LOOSES POWER AND ALMOST GOT HIT IN THE BACK.  I FEEL ONE OF THESE DAYS SOMEONE WILL HIT ME.  TOOK IT BACK TO DEALERSHIP AND THEY SAY NOTHING IS WRONG BUT THE PROBLEM IS GETTING WORSE.  THE CAR DOES HAVE WARRANTY ON IT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2015",
        "dateOfIncident": "11/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED MY 2014 CHEVY SONIC LT HATCHBACK A MONTH AGO. FIRST THE DAY I BOUGHT IT I FOUND OUT I HAD A REVERSE LIGHT OUT. THE DEALER SAID THEY WOULD FIX IT WHEN THE LICENSE PLANT COVER BRACKET COMES IN. THE SAME DAY I GOT THE CAR I SMELLED SOMETHING BURNING. I TOLD THEM ABOUT IT AN THEY SAID IF IT KEEPS DOING IT TO LET THEM KNOW AN MY PASSENGER SIDE BRAKES FELL LIKE THEY ARE DRAGGING. THEY SAID IT SHOULD COME OUT OF IT DO TO SITTING FOR AWHILE. WELL I'M STILL EXPERIENCING IT. MY OIL PERCENTAGE DROPS FAR DOWN WHEN DRIVING FOR 2 HRS ON THE HIGHWAY. THE BURNING SMELL COMES IN THREW THE VENTS AN OUTSIDE EVEN WHEN THE AC OR HEATER IS ON. SOMETHING IS NOT RIGHT. I ONLY HAVE 39,000 MILES WHEN I BOUGHT IT A MOTH AGO WITH 32,000 MILES. THE DEALER SAID IT WENT THROUGH AN EXPECTATION AN EVERYTHING CAME BACK OK WHEN I PURCHASED THE CAR THAT DAY. HOW CAN THAT BE WITH BURNING SMELL,LIGHTS OUT AN ONLY ONE SIDE OF WHEEL THAT I'M GETTING A DRAGGING, GRINDING NOISES. THEY WELL BE LOOKING AT IT IN THE NEXT 2WEEK. WHEN I'M DRIVING MY TRANSMISSION FEELS LIKE ITS SKIPPING. THE ACCELERATION IS SO OFF.",
        "vin": "1G1JC6SH2E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2015",
        "dateOfIncident": "09/12/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785823,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD TAKEN THE KEY OUT OF THE IGNITION AND IT WAS VERY HOT ABOUT THE END OF JULY. ON FRIDAY AUGUST 11, I NOTICED A PAUSE IN THE CAR STARTING THE A SOUND OF A KNOCK LEAVING WORK. I ARRIVED HOME AROUND 6:00 P.M. PARKED IN MY DRIVE WAY FOR THE DAY. I WAS AWAKEN SATURDAY MORNING BY MY NEIGHBOR BE MADE MY CAR WAS ON FIRE. THIS WAS DETERMINED BY LAWRENCE FIRE DEPARTMENT OF AN ENGINE FIRE.",
        "vin": "1G1JC5SHXE4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/25/2015",
        "dateOfIncident": "02/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759269,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT WHEN THE AIR CONDITIONER OR THE HEATER WAS TURNED ON, AN UNUSUAL ODOR EMITTED THROUGH THE VENTS. THE CONTACT MENTIONED THAT HE SUFFERED FROM HEADACHES DUE TO THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO LOCATE THE SOURCE OF THE ODOR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 12,852.",
        "vin": "1G1JC5SB1E4"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "08/24/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759006,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED EARLIER WHEN I WENT INTO THE STORE. BEFORE I COULD MAKE IT BACK TO THE CAR TO TURN THE CAR ON OR EVEN UNLOCK THE DOORS WITH MY KEYS THE CAR WAS PLAYING MUSIC AND THE LIGHTS WHERE FLASHING ON AND OFF. I ACTUALLY KNEW WHAT TO DO BECAUSE THIS HAS HAPPENED BEFORE AND THE CAR RETURNED BACK TO NORMAL. LATE ON TODAY I PARKED MY CAR TURNED THE WHEELS TOWARDS THE SIDEWALK BECAUSE THE CAR WAS ON A HILL GOING DOWNWARDS. I GOT OUT THE CAR LOCKED ALL OF THE DOORS WENT INTO THE COMMUNITY CENTER WHERE I REMAINED FOR ABOUT AN 1HR CAME OUT UNLOCKED THE CAR DOORS GET IN THE CAR WHERE THE RADIO AUTOMATICALLY COME ON THE LIGHTS IN THE CAR STARTED FLASHING ON AND OFF. THAT'S WAS PRETTY WEIRD I PUT THE CAR IN THE IGNITION AND THE KEY WOULD NOT TURN NOR WOULD THE STEERING COLUMN MOVE. I COULDN'T EVEN TURN THE WHEEL I CALLED THE DEALERSHIP AND THE CUSTOMER SERVICE TELEPHONE NUMBER FOR CHEVY AND I WAS ADVISED THAT THEY NEEDED TO TOW MY CAR TO THE CLOSEST DEALERSHIP",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/03/2015",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723264,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THE WIRING UNDER THE HOOD HAD A SOY BASED COATING ON IT, WHICH ATTRACTED ANIMALS TO CHEW THREW THE WIRING. AS A RESULT, ALL THE LIGHTS AND GAUGES ON THE INSTRUMENT PANEL FAILED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE WIRES AND CORDS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 9,205.   MA 10/8   UPDATED 3/22/16*JS    UPDATED 10/18/2017*CN",
        "vin": "1G1JD5SH1E4"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRADED IN MY ORIGINAL RECALL CHEVY COLBALT 2005 IN APRIL 2014. I WAS GIVEN A TRADE IN AMOUNT WHICH I USED TO PUT DOWN ON A NEW CAR, CHEVROLET SONIC 2014. I HAD IT ALL OF A WEEK WHEN SUDDENLY I WAS DRIVING AND STEPPING ON THE GAS PEDDLE IT BEGAN TO SLOW DOWN TO NOT MOVING REGARDLESS TO HOW MUCH I STEPPED ON THE GAS. NATURALLY, I WAS VERY UPSET. I CALLED FOR HELP.THEY TRANSFERRED ME INTO A DIFFERENT 2014 SONIC. FROM DAY 1 I NOTICE PROBLEMS NOT CONCERNED ONLY BECAUSE THE ISSUE LASTED 10-15 MINUTES AND THEN IT WAS FINE. THE PROBLEM BEGAN WITH NOT BEING ABLE TO OPEN TRUNK,DOORS LOCK OF STEERING WHEEL WHEN EXITING  THE CAR AND THE BEEPING SOUND AS IF SOMETHING WAS LEFT ON IN THE CAR. AS TIME PASSED IT WAS HAPPENING MORE FREQUENT. FINALLY IN APRIL 2015 THE BEEPING AND STEERING WHEEL AND ALL THE ABOVE NOW WOULDNT STOP. I RAN IT TO SERVICE. THEY DID A TOTAL GLOBAL DIAGNOSTIC SAID ALL WAS NOW FINE. I LEFT WITH EASE, WITHIN 3 WEEKS ON MAY 9TH  MY DAUGHTER AND I WERE COMING HOME AND JUST PARKED. I COULDNT OPEN ANY LOCKS REMOTE DIDN'T WORK MANUAL LOCKS DIDN'T WORK THE CAR WAS IN TOTAL SHUT DOWN. I DIDN'T HAVE MY CELL PHONE, I BELONG TO ONSTAR AND CALLED THEM FOR HELP. TO MY SURPRISE THEY REFUSED ME ROADSIDE ASST SAYING ITS AN ELECTRICAL ISSUE THEY DON'T GET INVOLVED . THAT'S ANOTHER ISSUE. BEING IN FLA STUCK IN A HOT CAR FOR OVER AN HOUR OF FEAR IN A STATE OF PANIC, I TRIED PUSHING EVERY BUTTON POSSIBLE OUT OF FEAR, AND CRAZY AS IT SOUNDS I TURN THE BUTTON HEADLIGHTS FROM AUTO TO OFF { TAKE NOTE THE LIGHTS WERE NOT ON } AND SUDDENLY THE LOCKS OPENED.  STRANGE.TOWED CAR TO SERVICE AGAIN, HELD IT FOR A WEEK AND CANT FIND ANY ISSUES. NOT SATISFIED DUE TO THE ISSUES IN THE PAST AND MOST RECENT. I KNOW SOMETHING IS SERIOUSLY WRONG. SPOKE TO CORPORATE AND NO ONE WANTS TO DO ANYTHING .THEY ARE ONLY OFFERING ME 11,000 AND I HAVE AN OUTSTANDING LOAN FOR 13,200. SO I WILL BE WITHOUT A CAR.",
        "vin": "1G1JC5SH7E4"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/04/2015",
        "dateOfIncident": "11/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST NOTICED THIS HAPPENING ABOUT 1 MONTH AFTER THE PURCHASE OF THIS CAR. WHEN STOPPED AT A STOP SIGN OR RED LIGHT, WITH MY FOOT ON THE BRAKE THE CAR FEELS LIKE IT WANTS TO LUNGE FORWARD OR TAKE OFF. OR, WHEN GOING FROM MY FOOT ON THE BRAKE TO THE GAS THE CAR WANTS TO LUNGE FORWARD ONCE I PRESS ON THE GAS JUST A LITTLE BIT.  *TR",
        "vin": "IGIJG6SB6E4"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/17/2015",
        "dateOfIncident": "05/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT A STOP LIGHT/SIGN WITH MY FOOT ON THE BRAKE THE CAR WILL START TO SHAKE/LUNGE FORWARD LIKE THE CAR IS TRYING TO GO BUT CANT BECAUSE MY FOOT IS ON THE BRAKE. IT WILL HAPPEN WITHIN A MILE AFTER STARTING AND DRIVING MY CAR AND WHEN IT STARTS TO SHAKE IT WILL LAST MAYBE 5 SECONDS. IT HAPPENS 2 OR 3 TIMES A WEEK ESPECIALLY WHEN ITS COLD OUTSIDE.   *TR",
        "vin": "1G1JG6SB9E4"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/01/2015",
        "dateOfIncident": "12/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10703066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING 20 MPH, THE STEERING WHEEL SEIZED. THE VEHICLE WAS TAKEN TO A DEALER, WHO DIAGNOSED THAT THE ALTERNATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. HOWEVER, THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN MULTIPLE TIMES TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE OR REPAIR THE VEHICLE. THREE MONTHS LATER, WHILE DRIVING AT 20 MPH, THE STEERING WHEEL SEIZED AND THE BRAKE PEDAL WAS DEPRESSED. AS A RESULT, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE AND THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED BACK INJURIES, BUT DID NOT REQUIRE MEDICAL ATTENTION. THE REAR DRIVER SIDE PASSENGER DID NOT SUSTAIN ANY INJURIES, BUT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 200.",
        "vin": "1G1JC6SH9E4"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/17/2015",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694942,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAS HAPPENED OFF & ON SINCE I BOUGHT CAR OCTOBER 2014. WHILE AT A COMPLETE STOP CAR WILL ROCK BACK AND FORTH AS IF THE BRAKE PEDAL ISN'T PUSHED DOWN ALL THE WAY & THE CAR ISN'T SURE IF IT IS TO BE DRIVING FORWARD SLIGHTLY OR STOPPED. EVEN WITH ME PUSHING THE BRAKE PEDAL ALL THE WAY DOWN TO FLOOR, CAR STILL ROCKS BACK & FORTH. IF AT STOP LIGHT WHILE DOING THIS ISSUE & LIGHT TURNS GREEN FOR ME TO DRIVE AHEAD CAR WILL NOT MOVE TILL DONE HAVING ITS ROCKING BACK & FORTH FIT. IT ONLY LASTS 15-20 SECONDS BUT CAN NOT DRIVE FORWARD WHILE CAR IS HAVING FIT. IS THIS THE COMPUTER/STABILITITRACK NOT COMMUNICATING PROPERLY?  *TR",
        "vin": "1G1JC6SB4E4"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT THERE WAS A GLARE ON THE DASHBOARD IN SUNNY WEATHER THAT CREATED POOR VISIBILITY. THE DASHBOARD HAD A VENT ACROSS IT THAT PREVENTED THE CONTACT FROM MAKING ADJUSTMENTS TO BLOCK THE GLARE. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN.   UPDATED 04/06/15*LJ",
        "vin": "1G1JC5SB1E4"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2015",
        "dateOfIncident": "03/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. WHILE DRIVING AT LOW SPEEDS IN INCLEMENT WEATHER, THE BRAKE PEDAL WAS DEPRESSED BUT THE VEHICLE FAILED TO STOP. THE CONTACT WAS ABLE TO AVOID A CRASH. IN ADDITION, THE WHILE VEERING TO THE RIGHT, THE VEHICLE UNINTENTIONALLY VEERED TO THE LEFT WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 300.   UPDATED 03/24/15*LJ  UPDATED 12/09/15.*JB    UPDATED 9/20/2017*CN",
        "vin": "1G1JA5SG8E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2015",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678597,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. IN ADDITION, THE CONTACT STATED THAT THE INSTRUMENT PANEL BECAME INOPERABLE INTERMITTENTLY. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE IGNITION SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6,520.",
        "vin": "1G1JC5SH4E4"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/28/2014",
        "dateOfIncident": "12/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO ADJUST THE TEMPERATURE GAUGE TO DEFOG MY FRONT WINDOWS AND I COULDN'T MOVE THE KNOB. I ALSO TESTED THE VENTS TO FIND OUT WHERE THE AIR WAS COMING OUT OF AND THERE WAS PRACTICALLY NOTHING COMING OUT OF THE VENTS. IT TOOK A WHILE FOR MY WINDOWS TO GET CLEAR WHILE I WAS DRIVING ON THE HIGHWAY.   *TR",
        "vin": "1G1JC6SHXE4"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY, GOING APPROXIMATELY 65MPH, THE DASH LIGHTS INCLUDING SPEEDOMETER TURN OFF AND RESET. THEY STAY OFF FROM 10-20 SECONDS THEN RESET BACK ON. THIS HAS HAPPENED MULTIPLE TIMES IN THE LAST 3 MONTHS. HAS ONLY HAPPENED IN 6TH GEAR AND IS VERY DANGEROUS KNOWING THE REPAIR DEALERSHIP CAN NOT FIGURE OUT WHAT TRIGGERS IT.   *TR",
        "vin": "1G1JH6SB3E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 SONIC AFTER BEING DRIVEN FOR 40 MIN FAILED TO START, A CHECK OF THE BATTERY INDICATED FULL VOLTAGE. CALLED FOR ROADSIDE ASSISTANCE AFTER THEY TAPPED ON THE STARTER THE CAR WOULD START. THIS HAS BEEN A RECURRING PROBLEM. THE DEALER HAD THE CAR FOR 3 DAYS AND COULD NOT REPEAT THE PROBLEM, WAS TOLD TO BRING IT BACK WHEN I HAD THE PROBLEM AGAIN. I HAVE HAD TO TAP ON THE STARTER ONCE BECAUSE I WAS TOO FAR FOR ROAD SIDE ASSISTANCE. AT 1974 MILES I HAD THE PROBLEM AGAIN CALLED ROADSIDE ASSISTANCE, WHEN THE TOW TRUCK DRIVER PUT THE KEY IN THE RUN POSITION AND WIGGLED THE STEERING WHEEL THE CAR STARTED ON ITS OWN. BECAUSE THE CAR WILL NOT START EVEN WITH THE REMOTE STARTER I DON'T THINK IT'S A KEY SWITCH PROBLEM. THE WORST PART OF THE ISSUE IS BEING STUCK IN LESS THAN SAFE PLACES WITH A CAR THAT WON'T START.  *TR",
        "vin": "1G1JC6SBXE4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "07/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643955,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IM ONLY GETTING ABOUT 14 TO 16 MPG ON MY CAR.I WENT TO THE DEALER AND I WAS TOLD THAT IT WAS NORMAL.I SAID THAT ITS IMPOSSIBLE TO GET SUCH LOW MPG WHEN THE PAPERWORK SAYS THAT I SHOULD GET 25/35.KNOW I SPOKE TO THE SERVICE MANAGER AND HE SAID THAT ITS NORMAL TO GET 14 TO 16 MPG.I TOLD HIM YOU TELLING MY 2005 ALTIMA 3.5 GETS BETTER GAS MILEAGE A DODGE DURANGO GETS BETTER GAS MILEAGE?? WELL THE SERVICE DEPARTMENT CANT SEEM TO FIND THE PROBLEM.THEY RECALIBRATED EVERYTHING AND ITS EVEN WORSE.I SPEND 300 IN GAS A MONTH WHICH IS UNHEARD OF..PLEASE HELP...  *TR",
        "vin": "1G1JC5SHXE4"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/04/2014",
        "dateOfIncident": "09/29/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I UNDERSTAND THAT NHTSA HAS MANDATED FORWARD-LEANING HEAD RESTRAINTS ON ALL LATE-MODEL VEHICLES. THE HEAD RESTRAINT IN MY 2014 SONIC IS TERRIBLE; IT SHOVES MY HEAD FORWARD, FORCING ME TO EITHER STARE AT THE INSTRUMENT CLUSTER OR RAISE MY EYES IN A KUBRICK STARE TO SEE THE ROAD. IT WASN'T IMMEDIATELY APPARENT DURING THE TEST DRIVE, BUT AFTER 200+ MILES OF DRIVING IN LESS THAN A WEEK, MY NECK IS STIFF AND SHOULDERS FEEL LIKE ROCKS. ALL THIS PAIN AGAINST THE STATISTICALLY UNLIKELY OCCURRENCE OF BEING REAR-ENDED (TWICE IN 30 YEARS OF DRIVING)? FAIL. ABSOLUTE, 100%, TOTAL FAIL. MY 2012 CRUZE HAD STRAIGHT HEAD RESTRAINTS THAT DIDN'T CAUSE ME PAIN AND WERE STILL AVAILABLE WHEN I NEEDED TO BRACE (SEEING SOMEONE RACING UP BEHIND ME, FOR INSTANCE).    PLEASE, FOR THE LOVE OF G-D, RECONSIDER THIS IDIOTIC AND OVERBEARING REGULATION.  *TR",
        "vin": "1G1JC5SH0E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2014",
        "dateOfIncident": "01/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616472,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION KEY GETS HOT AFTER DRIVING THE CAR FOR MORE THAN 5 MILES.  THERE IS A STRANGE WHIRRING NOISE COMING FROM THE FRONT OF CAR WHEN DRIVING. IT STARTED ON THE PASSENGER SIDE FRONT AND IS NOW ON BOTH SIDES. IT ONLY HAPPENS WHILE CAR IS IN MOTION.  *TR",
        "vin": "1G1JA6SH1E4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "05/31/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS GETTING BETWEEN 19-21 MPG AT THE MOST, INCLUDING HIGHWAY, WHICH IS EXTREMELY LOW COMPARED TO OTHER SIMILAR SONIC VEHICLE MODELS AND THE ESTIMATED 25/35 MPG FOR THIS VEHICLE.I AM WONDERING IF IT IS LEAKING FUEL. I HAVE NEVER OWNED A CHEVY REQUIRING THIS MUCH GAS. I AM CONCERNED THAT IT MIGHT BE AFFECTED BY THE FUEL RECALL BUT MY VIN IS NOT INCLUDED. GM AND THE LOCAL DEALERSHIP HAVE DISREGARDED MY CONCERNS, TELLING ME MY VEHICLE IS OPERATING NORMALLY. I WOULD LIKE MY VEHICLE INSPECTED FOR SAFETY.  *TR",
        "vin": "1G1JC5SH4E4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2014",
        "dateOfIncident": "07/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608902,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SONIC. THE CONTACT STATED WHILE STARTING THE IGNITION, A STRONG ODOR OF FUEL EMITTED INSIDE OF THE VEHICLE. IN ADDITION, THE ENTIRE FUEL LEAKED OUT OF THE FUEL TANK ONTO THE GROUND. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER. THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 13V464000 (FUEL SYSTEM, GASOLINE). HOWEVER, THE VIN WAS NOT INCLUDED. THE VEHICLE WAS CURRENTLY BEING DIAGNOSED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 3,080.",
        "vin": "1G1JA5SH7E4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2014",
        "dateOfIncident": "07/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS STARTED LEAKING FROM BOTTOM OF GAS TANK.   *JS",
        "vin": "1G1JA5SH7E4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "06/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605510,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN 70MPH TRAFFIC, MY WIFE JOSTLED THE KEY IN THE IGNITION WHILE REACHING UP TO ADJUST WINDSHIELD WIPERS.  THE CAR STALLED.  A TRUCK WAS BARRELING DOWN ON US.  FORTUNATELY WE WERE ABLE TO GET TO THE SIDE OF THE ROAD IN TIME.  THE VEHICLE RESTARTED WITH NO TROUBLE.  THIS WAS A RENTED CAR.   *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "04/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "HANKOOK TIRE MFG. CO.",
                "productMake": "HANKOOK",
                "productModel": "HANKOOK",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "NEW HANKOOK OPTIMO H428 TIRE ON MY 2014 SONIC DEVELOPED A BULGE ON THE FRONT DRIVER TIRE.  DEALER CLAIMS IT WAS DUE TO ROAD HAZARD.  RESEARCH SHOWING THAT THIS IS A COMMON COMPLAINT FOR THIS COMPANY'S TIRE.  NO KNOW HAZARD WAS HIT TO CAUSE THIS.  TIRE WILL HAVE TO BE REPLACED BEFORE A BLOW-OUT OCCURS, POSSIBLY CAUSING AN ACCIDENT.   *JS",
        "vin": "1G1JE5SB3E4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "01/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A LONG, STEEP BRIDGE AT A CAUTIOUS SPEED AND REACHED OVER TO ADJUST THE RADIO VOLUME.  WHEN I PLACED MY RIGHT HAND BACK ON THE STEERING WHEEL SOMETHING DIDN'T FEEL RIGHT SO I QUICKLY VERIFIED THAT I HAD BRAKES AND LIGHTS, BUT NO ENGINE POWER.  I SHIFTED INTO NEUTRAL AND RESTARTED THE ENGINE.  THE ONLY REASON FOR THE ENGINE FAILURE THAT I COULD FIGURE OUT AT THE TIME WAS THAT I HAD JARRED THE KEY CHAIN WITH MY COAT SLEEVE, INADVERTENTLY TURNING OFF THE ENGINE.  THIS WAS A RENTAL CAR AND THE TWO SETS OF KEYS HAD BEEN PERMANENTLY CRIMPED TOGETHER BY A CABLE.  I HAD CALLED THE RENTAL COMPANY A FEW HOURS AFTER PICKING UP THE CAR AT THE AIRPORT TO FIND OUT HOW TO SEPARATE THE KEYS AND WAS TOLD THIS WAS INTENTIONALLY DONE TO KEEP THE SETS TOGETHER IN CASE THE CAR WAS DROPPED OFF AT A DIFFERENT LOCATION.  A MONTH OR SO LATER I LEARNED OF THE GOVERNMENT INVESTIGATION OF THE DEFECTIVE IGNITION SWITCH IN GM VEHICLES THAT COULD TURN OFF THE CAR IF JOSTLED OR WEIGHED DOWN BY A HEAVY KEY RING.   THE CAR WAS A 2014 CHEVROLET SONIC.  FORTUNATELY IT DIDN'T LEAD TO AN ACCIDENT, BUT IT WAS A CLOSE CALL AND WAS MADE EVEN MORE FRIGHTENING DUE TO THE POSITION ON THE BRIDGE.  FROM NOW ON I WILL NOT RENT ANY GM CARS AND WILL INSIST THAT THE KEY CHAINS BE SEPARATED.  *TR",
        "vin": "1G1JC6SG4E4"
    },
    {
        "components": "SUSPENSION,WHEELS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/04/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577515,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER BACKED OUT ONTO THE  RESIDENTIAL STREET. THE DRIVE ALIGNED THE WHEELS TO POINT STRAIGHT DOWN THE STREET. THE DRIVER SHIFTED INTO DRIVE AND PRESSED PRESSED THE ACCELERATOR. THE CAR RAPIDLY ACCELERATED AND SWERVED TO THE LEFT. IT GRAZED THE BUMPER OF A PACKED CAR AND CAME TO REST ON A TREE. UPON LEAVING THE FRONT LEFT TIRE WAS DEFLATED. THE REPAIR SHOP REPORTED LEFT SUSPENSION DAMAGE.   *TR",
        "vin": "1G1JA5SH9E4"
    }
]