[
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11458197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Chevrolet Silverado 2500. The contact stated while driving at 45-49 MPH, with cruise control mode, he sustained a seizure and became unconscious. The vehicle veered off the road, drove over a curb and landed into a 6-foot ditch. The vehicle then drove over three driveways and crashed into a tree while the contact was unconscious. The air bags failed to deploy. There was no further information provided.  The contact stated that the incident occurred within 175 yards. The contact was transported out of the vehicle and to the hospital by emergency units. The contact sustained a broken sternum caused by the seat belt. The contact was unsure whether a police report was filed. The vehicle was towed to a body shop; however it was not repaired.  An unknown dealer was notified of the failure and contacted the manufacturer. The vehicle was not diagnosed or repaired. The contact referenced NHTSA Campaign Number: 21V054000  (Air Bags).The manufacturer contacted the contact and advised him that the issue would be submitted to another claim department. The contact was awaiting a call back from the manufacturer. The failure mileage was approximately 233,000.",
        "vin": "1GC1KXC82EF"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/20/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457851,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "While I was pulling my trailer up a grade on my 2014 Chevy Silverado 2500HD diesel truck, the fuel pump had catastrophic failure resulting in total loss of power. I had to unsafely maneuver to the shoulder of the 10 freeway west near Cabazon, CA and exit the truck near high speed traffic. I was lucky to make it to the shoulder without getting run over by the trucks in the slow lane. Had to wait hours for a tow and now have a roughly $10k repair bill. This is a known issue with the Bosch CP4 fuel pumps that Ford and GM refuse to address. Ram/Stellantis recalled their diesel trucks for 2019 and 2020 using this fuel pump. Dealer has confirmed total failure of the Bosch CP4 high pressure fuel pump as the reason for total loss of power. No warning signs whatsoever, just immediate loss of power while traveling 55 mph.",
        "vin": "1gc1kxc88ef"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/17/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444182,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "the Silverado 2500hd and I think 3500 work duty pickups some don't come with a stabilizer damper for steering my 2014 work truck with only 19k miles has a shake so bad you can't drive on the highway, I first noticed the shimmer at 2 yrs the deal did alignments and said they could not find what caused it, now I took the truck in for check engine on an o2 sensor they said catalytic converter went bad and it needed alignment so I said yes to the o2 sensor and alignment then I leave the check engine light pops on and when trying to drive over 35 mph the steering wheel violently shakes back and worth, I talked to a commercial tech he said the stabilizer always goes bad on these and so does all the youtube videos but some videos show that some trucks have a stabilizer and some don't, but do have the mounting holes.",
        "vin": "1gc0kvcgxef"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Takata Recall. The contact owns a 2014 Chevrolet Silverado 2500. The contact received a recall notification for NHTSA Campaign Number: 21V054000 (Air Bags) however, the parts for the recall repair were not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The dealer was not notified of the issue. The manufacturer was notified of the issue and informed the contact that the parts for the recall repair were not yet available. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "1GC1KXC82EF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Chevrolet Silverado 1500. The contact stated while driving at 10 MPH and making a turn, the vehicle inadvertently lost power steering and stopped on the side of the road by a curb. There were no warning lights illuminated. The contact stated the failure had been reoccurring while driving, almost causing the vehicle to crash into another vehicle. The vehicle was taken to the dealer who did not diagnose the vehicle and advised the contact that his VIN was not included in the recall for NHTSA Campaign Number: 17V414000 (STEERING). The manufacturer was not notified of the failure. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 82,100.",
        "vin": "3GCUKREC6EG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Takata Recall. The contact owns a 2014 Chevrolet Silverado 2500. The contact received notification of NHTSA campaign number: 21V054000 (Air Bags) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. Neither the dealer nor the manufacturer was made aware of the issue. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "1GC1KXC83EF"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "06/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11425813,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 CHEVROLET SILVERADO. CONSUMER STATED THAT DURING AN AUTOMIOBILE ACCIDENT THE AIRBAGS DID NOT DEPLOY.  THE CONSUMER STATED DUE TO THE AIRBAGS NOT DEPLOYING, THE DRIVERS HEAD STRUCK THE STEERING WHEEL. THE DRIVER WAS KNOCKED UNCONSCIOUS AND SUSTAINED A CONTUSION AND BRUSING ON THE FOREHEAD. THE VEHICLE HAD FRONT-END DAMAGE AND THE FRAME WAS BENT. THE CONSUMER WAS UNSURE IF THE AIRBAG RECALL REPAIR WAS COMPLETED. THE CONSUMER REQUESTED TO BE REIMBURSED FOR THE VEHICLES REPAIRS, RENTAL CAR, INSURANCE DEDUCTIBLE AND OTHER DAMAGES.",
        "vin": "1GCVKPEC0EZ"
    },
    {
        "components": "INTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Chevrolet Silverado. The contact stated while entering their vehicle after a rainstorm, they noticed water leaking into the interior of the rear section of the vehicle.  A puddle of water was on the floor. The contact stated the water seems to be seeping into the interior from the third rear brake light sealing from the outside of the vehicle.  The vehicle was not diagnosed or repaired. The manufacture was not made aware of the failure. The failure mileage was 81,000.",
        "vin": "3gcuktec7eg"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 CHEVROLET SILVERADO 2500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 21V054000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. A DEALER WAS NOT CONTACTED. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GC1CVCG0EF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363503,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FROM MICHIGAN INTO NEW YORK TO DELIVER AN RV TO A DEALERSHIP MY TRUCK EXPERIENCED A FUEL DEFICIENCY AND STALLED WHILE TRAVELING ON A HIGHWAY. I FIRST THOUGHT IT WAS THE FUEL FILTER BUT THAT DID NOT RESOLVE THE ISSUE AND IN TOWING IT INTO A SERVICE SHOP THEY DETERMINED THE BOSCH CP4 FUEL PUMP HAD QUIT DUE TO METAL SHAVINGS WHICH RESULTED IN THE ENTIRE FUEL SYSTEM NEEDING TO BE REPLACED. THIS COST ME OVER $15,000. IT'S MY UNDERSTANDING THAT THIS PUMP IS NOT COMPATIBLE WITH THE FUEL IN THE UNITED STATES AND THERE HAS BEEN A CLASS ACTION SUIT FILED IN TEXAS. IT IS ALSO MY UNDERSTANDING THAT GM TRIED TO HAVE THE CASE DISMISSED BUT THE TEXAS JUDGE DID NOT ALLOW FOR A DISMISSAL. I HAVE SEVERAL COPIES OF REPAIR AND TRAVEL EXPENSES RELATED TO THIS ISSUE AS WELL AS LOST INCOME AS I USE MY TRUCK FOR DELIVERIES. I WILL PROVIDE COPIES OF THESE WHEN NECESSARY AS MY SCANNER IS NOT CURRENTLY WORKING. THIS ISSUE SHOULD DEFINITELY BE CONSIDERED AS A RECALL ISSUE AS THIS IS A VERY EXPENSIVE REPAIR NOT TO MENTION THE DANGER OF THE FUEL SYSTEM QUITTING UNEXPECTEDLY.",
        "vin": "1GC1KXC87EF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRANSPORTING MY 27FT CAMPER TO CAMPGROUND, MULTIPLE TIME DURING TRANSPORTATION THE BREAKS HAD TO BE PUSHED CLEAR TO THE FLOOR AND WERE NOT ACTIVATING BREAK SYSTEM! VERY SCARY!! ALSO HAPPENED AGAIN AFTER RETURNING HOME AND NO CAMPER ATTACHED WHILE ON VERY WINDING AND STEEP ROUTE!!",
        "vin": "1GC1KYEG2EF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308832,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE OWNING THIS TRUCK BRAND NEW IN 2014 I HAVE REPLACED BOTH DRIVERS SIDE AND PASSENGER SIDE FRONT HEAD LAMPS A MULTITUDE OF TIMES. TOO MANY TO COUNT. SOMETIMES THEY LAST A COUPLE MONTHS, SOMETIMES LONGER. THIS IS ABSURD.",
        "vin": "1GC1KVC82EF"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE SEVERAL DTC CODES U029D U029E  P0420 P220B ON THREE OCCASIONS.  THESE CODE ARE TRIGGERING A LIMITED SPEED AND POSSIBLE POWER REDUCTION. THE DEALER SHIP STATES THAT GMC PROTOCOL IS TO REPLACE ONE SENSOR AT A TIME AND LET THE CUSTOMER GO SO THEY CAN BREAKDOWN AGAIN. THE PART THAT IS FAILING I AM TOLD IS THE DIESEL PARTICULATE FILTER, BUT GMC CAN NOT SUPPLY THE DEALERSHIPS WITH THE HIGH DEMAND. THIS SEEMS LIKE A FAULTY DESIGN THAT MAY WORK DURING THE WARRANTY PERIOD, BUT SHORTY FAILS AFTER. I DID REPORT EXHAUST SMELL IN THE TRUCK WHILE DRIVING .    I WAS GIVEN A REPORT AND A LARGE REPAIR BILL ONLY TO BREAKDOWN IN 126 MILES.",
        "vin": "1GC1KVC83EF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR COMPRESSOR MALFUNCTION. DRIVING IN A PARKING LOT AT AROUND FIVE MILES AN HOUR AND HEARD A STRANGE SOUND COMING FROM THE ENGINE. BROUGHT THE TRUCK TO A COMPLETE STOP AND SOUND STOPPED (LIKE A POP). DROVE ABOUT 200 FEET AND THE CABIN BEGAN TO FILL WITH SMOKE. DROVE THE CAR TO A PARKING LOT. ALL THE GAUGES WHERE NORMAL. TOOK TO A MECHANIC AND HE REPLACED THE BAND BUT SAID THAT IT WAS THE AIR COMPRESSOR (MOTOR). HE SAID THIS SHOULDN'T HAPPEN IN A TRUCK THIS NEW. HE RECOMMENDED CHECKING FOR ANY RECALLS. PRIOR TO THIS THERE WHERE NO ISSUES.",
        "vin": "3GCUKREC2EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT SLOW SPEEDS WHEN BACKING UP THE STEERING WHEEL GET HARD AND THEN LOOSEND UP. MOVING FORWARD AND MAKING A TURN THE STEERING WHEEL GET HARD AGAIN AND THEN LOOSENDS UP. IT BECOMES A STRUGGLE TO TURN GET HARD AND THEN LOOSENDS UP. THIS STARTED HAPPENING AT 30000 MILES AND CONTINUES. THIS PROBLEM IS VERY UNSAFE IF THAT STEERING DOES NOT LOOSEN UP AT HIGHER SPEEDS IT COULD MEAN DEATH AND INJURIES TO OTHER PARTIES. THIS PROBLEM HAS CONTINUED TO HAPPEN TO US OVER 15 TIMES. I BOUGHT THIS VEHICLE BRAND NEW OF THE LOT, IM THE ONLY OWNER.",
        "vin": "1GC1KXCG4EF"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174540,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2014 CHEVY K2500 DURMAX DIESEL 4X4 I BOUGHT IT UNDER THE IMPRESSION I WAS TOLD IT WOULD GET REALLY GOOD GAS MILEAGE AND ITS HORRIBLE THE SALESMAN SAID THE NEW REQUIREMENTS THAT GM DONE TO THE EXHAUST AND FUEL THE GOV. REQUIRED WAS TO HELP ON POLLUTION AND FUEL MILEAGE. THIS SHOULD BE LOOKED INTO THE FUEL ECONOMY IS HORRIBLE.",
        "vin": "1GC1KXC86EF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164898,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD HAS BEGUN TO CRACK. THIS CRACK IS NOT THE RESULT OF AN ACCIDENT.",
        "vin": "1GC1KYE82EF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "09/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL INJECTION PUMP NAME APART INTERNALLY CRACKING CASE SPRAYING FUEL ON HOT ENGINE WHILE DRIVING DOWN ROAD, ALSO SENDING METAL PIECES THROUGH FUEL SYSTEM TO INJECTORS MAKING THEM USELESS AND NEEDING REPLACED. THE FUEL INJECTION PUMP IS LOCATED ON TOP OF BLOCK IN FRONT OF TURBO WHICH GETS EXTREMELY HOT, LUCKILY DIDN'T CATCH FIRE",
        "vin": "1GC1KXE84EF"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115631,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TCM MALFUNCTIONED. AFTER BEING REPLACED THE VEHICLE STILL DIDN'T PERFORM AS IT DID BEFORE THE REPAIR. I HAVE RESEARCHED THIS ISSUE WITH ALL CHEVROLET TRUCKS FROM VARIOUS YEARS. THERE ARE MULTIPLE BLOGS FROM OWNERS OF THESE TRUCKS THAT SHOW THE  EXTENT OF THE ISSUE. I CANNOT AFFORD TO PAY $ 1000.00 TO FIX A PROBLEM THAT GM KNOWS THAT HAS EXISTED FOR YEARS.   THIS IS A SERIOUS PROBLEM IF YOU ARE DRIVING AND THE TRUCK LOOSES POWER; ESPECIALLY WHEN YOU'RE GOING DOWN HILL TRAVELING AT A HIGH RATE OF SPEED AND YOUR TRANSMISSION DOESN'T FUNCTION PROPERLY.  I HAVE HAD THE TRANSMISSION REPAIRED AND THE ISSUE PERSISTS; IT SEEMS AS THOUGH GM WANTS OWNERS TO PAY OUT OF POCKET. SOME MAY NOT AND THIS COULD LEAD TO UNSAFE TRUCKS BEING ON THE ROAD. THANK YOU.",
        "vin": "1GC1KYE85EF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "12/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING LOW SPEED(USUALLY LEFT) POWER STEERING WOULD STOP WORKING. THIS HAS HAPPENED ABOUT A DOZEN TIMES SINCE I PURCHASED THE VEHICLE IN 2015. I HAVE TAKEN TO THE CHEVROLET DEALER ON (3) OCCASIONS(SUBURBAN AUTO GROUP IN SANDY OREGON. TAG NUMBER ON FIRST VISIT IS #2288, 2ND VISIT #3639, 3RD VISIT #4698. THEY HAVE RECALLED 2014 CHEVY SILVERADO 1500 FOR THE EXACT SAME PROBLEM AS I AM EXPERIENCING. I WOULD HOPE THAT YOU LOOK AT THE SILVERADO 2500 WITH THE SAME SCRUTINY. THE DEALER WANTS ME TO START REPLACING PARTS AT MY COST TO REPAIR A VEHICLE I BELIEVE TO BE DEFECTIVE.",
        "vin": "1GC1KXE82EF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2017",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014898,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMPORARY LOSS OF POWER STEERING WHEN ATTEMPTING TO TURN THE STEERING WHEEL AT A LOW SPEED (I.E. BACKING INTO A PARKING SPACE, MAKING A LOW SPEED TURN INTO A GARAGE).",
        "vin": "1GC1KXC80EF"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2017",
        "dateOfIncident": "05/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE THE CHECK ENGINE LIGHT COMES ON, THE STABILITRAK LIGHT COMES ON AND THE VEHICLE SHUTS OFF. WITHIN SECONDS THE ENGINE RESTARTS. THE MOST COMMON OCCURRENCE IS WHEN TRAVELING ON BUMPY ROADS. WHEN THIS HAPPENS AT FREEWAY SPEEDS, THE SAME WILL HAPPEN, AND THE CRUISE CONTROL WILL DISCONNECT, AND CANNOT BE RESET UNTIL AROUND 30 MINUTES. AGAIN, THE ENGINE WILL DIE AND IMMEDIATELY RESTART. THIS IS HAPPENING MUCH MORE FREQUENTLY LATELY. THE VEHICLE HAS APPROXIMATELY 95,000 MILES ON THE ODOMETER.",
        "vin": "1GC1KYE87EF"
    },
    {
        "components": "TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2016",
        "dateOfIncident": "12/17/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937227,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT THE ENGINE STARTED RATTLING, AND THE ENGINE AND TRACTION WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 4,210.",
        "vin": "3GCUKSEC0EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING HAPPENED TO MY VEHICLE. I WANT TO REPORT THE ACTIONS OF A TRUCKER WHILE ON A TRIP TO NY TO VISIT RELATIVES.    WE WERE DRIVING ON 95N IN THE PASSING LANE.  A TRACTOR/TRAILER CAME ROLLING UPON US, BLOWING THE HORN FOR US TO GET IN THE SLOW LANE.  WE MOVED TO THE SLOW LANE, THE TRUCK PASSED, GIVING MY HUSBAND THE FINGER AS HE DROVE BY, THEN ATTEMPTED TO RUN US OFF THE ROAD.  HE SWERVED HIS VEHICLE TOWARDS OURS, CAUSING US TO SWERVE TO THE RIGHT.  THERE WAS NO DAMAGE TO OUR VEHICLE, BUT THIS INDIVIDUAL WAS DRIVING EXTREMELY RECKLESS AND ATTEMPTING TO RUN US OFF THE ROAD IS COMPLETELY UNACCEPTABLE.    THE VEHICLE WAS A PETERBILT, PENNSYLVANIA LICENSE TAG # PT821A1.  THE NAME ON THE SIDE OF THE TRUCK WAS \"LEE'S EXCAVATING\" AND THERE WAS A REBEL FLAG COVERING THE ENTIRE FRONT OF THE TRUCK.",
        "vin": "1GC1KYE85EF"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "07/27/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO 2500. WHILE DRIVING 30 MPH, A BURNING ODOR EMITTED INTO THE VEHICLE. AFTER INSPECTING THE VEHICLE, THE CONTACT NOTICED THAT THE GRAVEL GUARD AROUND THE FUEL TANK WAS ON FIRE. THE CONTACT EXTINGUISHED THE FIRE BY POURING WATER ON THE FLAMES. THE FIRE DEPARTMENT WAS NOT CONTACTED. THE VEHICLE WAS TOWED TO THE DEALER, BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 20,030.",
        "vin": "1GC1KYE85EF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "04/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860807,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LARGE AMOUNT OF RUST AND CORROSION ON FRAME. ONLY 9000 MILES.",
        "vin": "1GCNCPEH2EZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2016",
        "dateOfIncident": "04/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT / WAX BY FACTORY HAS TOTALLY PEALED OFF FRAME OF THE TRUCK. RUST EVERYWHERE 38000 MILES.",
        "vin": "3GCUKREC4EG"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "04/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854293,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING TO PHYSICAL THERAPY. PULLED UP TO A STOP LIGHT AND \"STABILITRACK FAILURE\" POPED UP. WAS PULLING INTO THE DOCTORS OFFICE NOT 8 MIN L8R CAME UP AGAIN BUT THIS TIME STEERING WHEEL LOCKED UP THEN UN LOCKED THEN LOCKED UP MULTIPLE TIMES WHILE I WAS TRYING TO PULL INTO A PARKING SPACE. THANKFULLY I WAS GOING AT AN EXTREMELY LOW SPEED AND I COULD CONTROL THE VEHICLE BETWEEN IT LOCKING AND UNLOCKING. WHEN I LEFT THE DOCTORS OFFICE I NOTICED MY SETTINGS RESET. EX DASHBOARD DISPLAY SHOWED THE RADIO STATION INSTEAD OF THE FUEL ECONOMY. I SIMPLY CHANGED IT AND NOTICED THE COMPUTER ERASED MY PREVIOUS FUEL ECONOMY. I'M ASSUMING THEIRS SOME MALFUNCTION BETWEEN THE COMPUTER AND THESE SYSTEMS. AND FROM THE LOOKS OF IT MY VEHICLE ISN'T THE ONLY VEHICLE WITH THIS ISSUE. NOW MY CHECK ENGINE LIGHT IS ON AND I'LL BE TAKING THIS BACK TO THE DEALER AND IT WILL BE FIXED AND NEVER HAPPEN AGAIN OR I WON'T PURCHASE ANOTHER GM VEHICLE.",
        "vin": "1GCVKSEC1EZ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854319,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING APPROXIMATELY 25 MPH, THE REAR OF THE VEHICLE VIBRATED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A LOCAL DEALER WHERE IT WAS DIAGNOSED THAT THE TIRES NEEDED TO BE REPLACED. THE CONTACT REPLACED THE TIRES, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO ANOTHER LOCAL DEALER WHERE IT WAS DIAGNOSED THAT THE FAILURE WAS A KNOWN ISSUE WITHOUT A REMEDY. THE VIBRATION BECAME WORSE, CAUSING MOTION SICKNESS FOR THE DRIVER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT IT WAS A KNOWN ISSUE AND THAT THE REMEDY WAS NOT WORKED OUT YET. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS LESS THAN 3,000.   UPDATED 06/17/16*LJ  *TR",
        "vin": "1GCVKREC6EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HERE'S MY STORY FOR THOSE THAT WILL LISTEN. I PURCHASED THE VEHICLE BRAND NEW AND A FEW DAYS LATER I MENTIONED TO THE SALESMAN THAT IT DROVE UNUSUAL AND HE REPLIED THAT IT COULD BE FROM SITTING ON THE LOT...SO I WAITED FOR THE FIRST SCHEDULED MAINTENANCE AND LET THEM KNOW THAT THERE WAS SOMETHING NOT RIGHT WITH THE SHIFTING OF THE VEHICLE.  I NOTED THAT IT WAS LOUD CLUNKING AT DOWNSHIFT FROM 3RD TO 2ND GEAR AND ALSO A CLUNK SHIFT WHEN THE VEHICLE APPROACHES A COMPLETE STOP.  THE DOWNSHIFT IS SO HARD THAT IT IS FELT IN THE BRAKE PEDAL.  THIS IS THE PART TO ME THAT RAISES THE SAFETY CONCERN. THE RESPONSE WAS THAT THEY CHECKED IT AND THAT EVERYTHING WAS NORMAL.  I WAS INFORMED THAT IT SHOULD GET SMOOTHER AS IT BREAK IN.  THEY WENT ON TO SAY IF I BRING THE VEHICLE IN FOR THE SAME ISSUE AND NOTHING IS FOUND THAT I WOULD HAVE TO PAY A DIAGNOSTIC FEE.  SO NOW AT APPROX. 20,000 MILES AND I CONTACTED GENERAL MOTORS.  THEY AGREED FOR MORE DIAGNOSTIC AND NOW THERE IS A TECHNICAL SERVICE BULLETIN THAT STATES THAT IT IS A NORMAL CHARACTERISTIC OF THE VEHICLE.  NOW THE VEHICLE HAS FEELS LIKE IT GOT WORSE AND DRIVES TERRIBLE AND UNSAFE.  MEANWHILE THERE ARE COMPLAINTS ABOUT THIS SAME PROBLEM ON THE INTERNET AND NOBODY HAS DONE ANYTHING ABOUT IT.  IT'S FUNNY THAT 2016 SILVERADO IS THE SAME TRUCK BUT WITHOUT THE PROBLEM.  GM NEEDS TO MAKE GOOD ON THEIR PRODUCTIONS MISTAKE AND SUPPORT THERE PRODUCT.  SILVERADO DRIVERS EXPERIENCING THE SAME CONDITION SHOULD COMPLAIN TO MAKE MANUFACTURERS RESPONSIBLE.  PLEASE INVESTIGATE!!!!!!!!!!!!",
        "vin": "1GCVKREC1EZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK GOT HOT AND ENGINE POWER REDUCTION LIGHT CAME ON ALSO CHECK ENGINE LIGHT. MESSAGE RESET WHEN TURNED OFF AND RESTARTED BUT CHECK ENGINE LIGHT STILL ON AND TRUCK RUNS HOT. POWER REDUCTION WAS WHILE I WAS ON HIGHWAY AND TRUCK WOULD NOT GO ABOVE 1000 RPM",
        "vin": "1GCNCPEH2EZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850597,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHY CAN,T THE DEALERSHIP FIND THE PROMBLE",
        "vin": "1GCVKREC6EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850522,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION CLUNKS ON DOWNSHIFT(SEEMS LIKE 3RD TO 2ND SHIFT) LOUD ENOUGH THAT PEOPLE THINK I RAN OVER OR HIT SOMETHING. DEALER SAYS ITS NORMAL AND THEY ALL DO IT!",
        "vin": "1GCVKREC7EZ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2016",
        "dateOfIncident": "01/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838702,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT HAD NOT EXPERIENCED A FAILURE PRIOR TO HAVING THE VEHICLE REPAIRED FOR A MANUFACTURER RECALL CONCERNING THE 4 WHEEL DRIVE FUNCTION ABILITY. ALSO, THE ENGINE CONTROL MODULE WAS REPROGRAMMED. SHORTLY AFTER THE REPAIR BY THE DEALER, THE VEHICLE MANUALLY SHIFTED INTO 4 WHEEL DRIVE WHEN IN REVERSE OR DRIVE AND WOULD NOT DISENGAGE IN INCLEMENT WEATHER. IN ADDITION, THE VEHICLE IDLED ROUGHLY, SHUTTERED, AND THEN STALLED. THE VEHICLE WAS TOWED TO THE DEALER FOR FURTHER INSPECTION AND THE BATTERY WAS REPLACED. THE DEALER STATED THAT THERE WAS A FAULTY GROUND CONNECTION UNDER THE DASH PANEL. THE GROUND SURFACE WAS CLEANED AND THE WIRING WAS RE-GROUNDED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3GCUKREC7EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "09/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "5/15  RADIO DISPLAY LOST POWER, RECURRED AT LEAST 3 OCCASIONS;  9/15 TRAILERING IN \"TOW MODE\" ON INTERSTATE AT 58 MPH WHEN VEHICLE SLOWED DOWN AND RPMS INCREASED WHEN STEPPING ON ACCELERATOR; HAD TO PULL OVER ONTO INTERSTATE SHOULDER AND STOP.  VEHICLE BEGAN SHIFTING NORMALLY AGAIN- DEALER STATED THAT THEY UPDATED TRANSMISSION SHIFT POINTS AND TCM.  10/15 HARSH SHIFTING AND CLUNKING FROM RIGHT REAR WHEN TURNING RIGHT. 1/16  HARSH SHIFTING AND CLUNKING FROM RIGHT REAR WHEN TURNING - DEALER REPLACED \"U JOINT\" AND \"ADJUSTED COMPUTER SHIFT POINTS.  VEHICLE STILL HAS HARSH SHIFT AND CLUNK IN RIGHT REAR WHICH OCCURS DAILY.",
        "vin": "1GCRCPEC9EZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HVAC PRESSURIZES CAB CAUSING HEADACHES AND EAR PAIN.",
        "vin": "1GCNCPEH4EZ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/28/2016",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION AT HWY SPEEDS, TIRES REBALANCED ROTATED AND BALANCED AT THREE DIFFERENT PLACES INCLUDING DEALER TWICE. ALL PLACES SAY TIRES R BAD BUT WILL NOT HELP IN REPLACING THEM UNLESS I BUY OTHER TIRES. THEY ONLY HAVE 15,000 MILES ON THEM. I FEEL GOODYEAR SHOULD REPLACE THESE TIRES.",
        "vin": "1GCRCREC9EZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821233,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES WORE OUT ON BOTH OUTBOARD PADS. INBOARD PADS ARE ALMOST NEW.TRUCK HAS 32,000MI. I BOUGHT IT NEW. DEALER SAID CALIPERS WERE NOT SLIDING.  I CHECKED THE BRAKES MYSELF AND FOUND THAT NOT TRUE. I REPLACED THE PADS AND ROTORS MYSELF AND TOOK PICTURES AND SAVED ALL PARTS. THERE MUST BE  A REASON, AND I CAN'T BE THE ONLY ONE.",
        "vin": "3GCPCPEHXEG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/09/2016",
        "dateOfIncident": "12/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BETWEEN THE ROAD SPEEDS OF 45-65 MPH THE VEHICLE VIBRATES THE FRONT END SHAKES THE VEHICLE DOES IT IN ANY ROAD CONDITION AND WEATHER THE VEHICLE HAS BEEN TO THE DEALER TWICE AND TIRES BALANCED AND ROTATED 3 TIME TO NO AVAIL",
        "vin": "3GCPCREC0EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "01/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME ON THE HIGHWAY GOING 65 MPH I TRIED TO TURN FOLLOWING THE ROAD AND THE STEERING WOULD NOT MOVE, I FORCED IT TO TURN WHILE SLOWING DOWN AND ALMOST RAN INTO A DITCH.",
        "vin": "#GCPCREH8EG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "01/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818785,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING 35 MPH, THE BRAKES FAILED WITHOUT WARNING. THE BRAKE PEDAL BECAME STIFF AND UNRESPONSIVE. THE CONTACT HAD TO PLACE EXCESSIVE PRESSURE ON THE BRAKE PEDAL JUST TO GET THE VEHICLE TO SLOW DOWN. THE CONTACT ALSO STATED THAT THE BRAKES MADE A GRINDING NOISE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE VACUUM PUMP ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 43,000.",
        "vin": "3GCUKREC2EG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2015",
        "dateOfIncident": "12/11/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THE STEERING WHEEL SEIZED. IN ADDITION, THE VEHICLE STALLED. AFTER SEVERAL ATTEMPTS, THE VEHICLE WAS ABLE TO RESTART AND THE STEERING WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, WHO DIAGNOSED THAT THE ANTI- THEFT MODULE AND THE STEER-ASSIST NEEDED TO BE REPROGRAMMED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 78,000.   UPDATED 04/08/16*LJ",
        "vin": "1GCVKREC8EZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/15/2015",
        "dateOfIncident": "11/27/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810222,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING AT APPROXIMATELY 5 MPH, THE ENGINE STALLED AND CAUSED THE VEHICLE TO CRASH INTO A FIRE HYDRANT. THE VEHICLE WAS ABLE TO RESTART. NO POLICE REPORT WAS FILED. THE CONTACT DID NOT SUSTAIN ANY INJURIES. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "1GCVKREC1EZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "11/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2014 CHEVY SILVERADO, I HAVE HAD 3 INSTANCES WHERE THE STABILITY CONTROL LIGHT CAME ON AND I SUDDENLY LOST LOST ALL STEERING AND BRAKES.  WITHIN A 2-3 SECONDS THE CLUSTER AND RADIO WENT DEAD AND THEN THE ENGINE STOPPED.  I HAD NO ABILITY TO CONTROL THE VEHICLE.    I TOOK THE VEHICLE TO THE DEALER AND THEY STATED THE LOGS SHOWED 1 1/2 PAGES OF VEHICLE COMMUNICATIONS ERRORS INCLUDING LOSS OF COMMUNICATIONS TO STEERING, LOSS OF COMMUNICATIONS TO BRAKES, ETC.     AFTER 8 DAYS OF ANALYSIS, THE DEALER NOTIFIED ME THAT THIS WAS A KNOWN ISSUE WITH GM AND THAT THERE IS AN ACTIVE PI NUMBER FOR THE ISSUE.  HOWEVER, THERE IS NO KNOWN RESOLUTION FOR THE ISSUE.  BECAUSE THERE IS NO KNOWN SOLUTION, THEY ASKED ME TO COME PICK UP THE VEHICLE AND CONTINUE DRIVING IT AND THEY WILL CONTACT ME WHEN A SOLUTION IS FOUND.  WHEN I ASKED IF THEY UNDERSTOOD THAT I COULD LOSE CONTROL OF THE VEHICLE AND POTENTIAL KILL MYSELF, A FAMILY MEMBER OF ANOTHER DRIVER THEY ONLY TOLD ME THAT THEY HAD NO OTHER SUGGESTIONS.    I ESCALATED TO GM CUSTOMER CARE AND THEY ASSURED ME THAT BECAUSE THERE ARE NO OPEN RECALLS ON MY VEHICLE FOR THIS ISSUE, IT WAS COMPLETELY SAFE TO DRIVE AND THAT I SHOULDN'T WORRY.    A SEARCH OF THE INTERNET REVEALED MANY PEOPLE WHO HAVE HAD THE EXACT SAME EXPERIENCE AND WHO WERE TOLD TO CONTINUE DRIVING THE VEHICLE.  ONE EVEN STATED THAT THEY HIT A PEDESTRIAN AFTER LOSING CONTROL OF THE TRUCK.    THIS ISSUE IS OBVIOUSLY A HUGE SAFETY RISK AS THE DRIVER CAN LOSE COMPLETE CONTROL OF THE VEHICLE AT ANY SPEED.",
        "vin": "1GCVKREC0EZ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT OBSERVED EXTENSIVE CORROSION ON THE FRONT OF THE VEHICLE'S FRAME. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FRAME WAS CORRODED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 10,200.",
        "vin": "3GCUKSEC3EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "11/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806385,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC POWER STEERING FAILED WHILE DRIVING. TRUCK TOWED TO A DEALER. AFTER REPLACING THE ELECTRIC POWER STEERING MOTOR, ELECTRICAL LOOM AND THE BATTERY, WAS INFORMED THAT THE STEERING RACK FAILED - POSSIBLY DUE TO WATER PENETRATION INTO THE RACK AND PINION DRIVE. SUSPECT A FAULTY OR BADLY DESIGNED SEAL WHICH MAY BE THE CAUSE FOR THIE FAILURES ON THE 2014 SILVERADO TRUCKS",
        "vin": "3GCUKSEC1EG"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/26/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRE AND DEATH HAZARD . STRONG UNBEARABLE TOXIC SMELL ENTERING UP INTO CAB.",
        "vin": "3GCUKTEC2EG"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS AN ESTABLISHED, MEASUREABLE AND DOCUMENTED VIBRATION PROBLEM THAT RANDOMLY INCREASES & DECREASES IN APPLITUDE & FREQUENCY AT ALL SPEEDS.  GM IS UNABLE TO RESOLVE AFTER 12 DEALER ATTEMPTS TO ADDRESS, INCLUDING MULTIPLE SETS OF TIRES, REAR DIFFERENTIAL, DRIVE SHAFTS AND SHOCK ABSORBERS ALL FAILING TO RESOLVE THE ISSUE.  GM STATED VIBRATION IS INHERENT TO THE DESIGN AND NO FURTHER ACTION NEEDED OR WILL BE TAKEN EVER FOR VIBRATION, REGARDLESS OF CIRCUMSTANCE.  SUCH A VIBRATION IS A SIGNIFICANT SAFETY DEFECT BECAUSE IT IS ESSENTIALLY LIKE CUTTING WIRES TO WARNING TELL-TALES BY REMOVING A DRIVER'S ABILITY TO DISCERN TIRE/SUSPENSION/POWERTRAIN/STEERING PROBLEMS THAT CAN ONLY BE IDENTIFIED BY FEELING A VIBRATION (SUCH AS A LOOSE WHEEL OR DAMAGED SUSPSENSION COMPONENTS) PRIOR TO A CATASTROPHIC EVENT, ESPECIALLY AT HIGH SPEEDS. NOT ONLY FOR THE VEHICLE OCCUPANTS, BUT ALSO FOR ANY ROAD USER WHEN IT RESULTS IN THE DRIVER LOOSING CONTROL OF THE VEHICLE.  GM'S OWN ATTEMPTS TO FIX THE VEHICLE WITH THE LIST OF PARTS ABOVE IRREFUTABLY SUPPORTS THE INABILITY FOR A DRIVER TO IDENTIFY THE SOURCE OF A VIBRATION. IF EXPERIENCED TECHNICIANS AND SUBSEQUENT CORPORATE ENGINEERS CANNOT RECOGNIZE THE VIBRATION AS BEING DIFFERENT FROM WHEELS, SUSPENSION, POWERTRAIN; THEN A NORMAL DRIVER WILL HAVE NO SUCH WARNINGS AVAILABLE SHOULD A POTENTIALLY CATASTROPHIC SAFETY ISSUE BE PRESENT.  FURTHER, SINCE GM REFUSES TO ADDRESS ANY FURTHER VIBRATION ISSUES WITH THIS VEHCILE, IT IS LIKE HAVE A AIRBAG WARNING TELL-TALE CONTINUOUSLY ILLUMINATED WHETHER OR NOT A PROBLEM EXISTS & GM STATING TO JUST LIVE WITH IT. IN OTHER WORDS, IF I GET A LOOSE WHEEL, I GUESS GM FIGURES I WILL KNOW IT WHEN IT FALLS OFF.  IN ADDITION, TO SAFETY DEFECT DESCRIBED ABOVE, THE VIBRATION IS AN EXTREME SOURCE OF DRIVER DISTRACTION & DRIVER RAGE AS ATTEMPTS ARE MADE TO PRODUCE AND/OR REDUCE THE VIBRATION WHILE DRIVING.",
        "vin": "1GCVKREC4EZ"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2014 CHEVROLET SILVERADO 1500. WHILE TRAVELING T A A LOW RATE OF SPEED/UNDER 40 MPH, THERE IS A SUDDEN LOSS OF POWER. THE VEHICLE HESITATES NUMEROUS TIMES AND STALLS. THE VEHICLE ALMOST SHUTS OFF BUT RECOVERS JUST BEFORE SHUTTING OFF AND THE START OF LOSING POWER  THE VEHICLE JUMPS AND STOPS. CALLED DEALER SERVICE DEPARTMENT AND WAS TOLD THERE ARE NO RECALLS FOR MY VEHICLE. THIS PROBLEM STARTED ALMOST FROME WEEK ONE AFTER PURCHASE UNTIL THIS DATE OF REPORTING.",
        "vin": "3GCUKREC4EG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2015",
        "dateOfIncident": "07/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE TRAIN SHIFTS HARD & @ TIMES DOES NOT SHIFT CORRECTLY( WHILE DRIVING CITY STREETS) & ENGINE STALLS WHEN I EXCELERATE FROM A STOPING POINT & ALSO TICKING NOISE FROM EXHAUST SYSTEM ( IN MOTION & STATIONARY CITY STREETS).",
        "vin": "3GCUKSEC0EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/24/2015",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10775978,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST INCIDENT THE STABILITRACK SERVICE LIGHT FLASHED SO FAST I COULD BARELY READ IT.. SECOND INCIDENT HAPPENED ON SEPTEMBER 20,2015 AND IT HAPPENED TWICE. THE STABILITRACK LIGHT CAME ON AGAIN BUT THIS TIME THE DOOR LOCKS LOCKED AND UNLOCKED , LIGHTS WENT OFF AND ON , RADIO WENT OFF AND ON AND IT STALLED THE ENGINE ALMOST AS IF THE VEHICLE SHORTED OUT. LUCKILY I WAS PULLING INTO A PARKING LOT BECAUSE I HAD NO CONTROL. I APLLIED THE BRAKE AND PUT THE VEHICLE IN PARK AND IT RESTARTED. ABOUT 45 MINUTES LATER IT DID THE SAME EXACT THING AS I WAS PULLING INTO MY DRIVEWAY. IT IS AT THE DEALERSHIP NOW.",
        "vin": "3GCUKRECXEG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "11/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10767359,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A NEW 1500 IN MAY OF 2014 AND A FEW MONTHS LATER NOTICED THE ENGINE HAS A RANDOM MISS BOTH WHILE DRIVING AS WELL AS AT IDLE. WILL EXPERIENCE A SIGNIFICANT JERK AND WILL ALSO HESITATE TO PICK UP SPEED SHORTLY AFTER EXPERIENCING THE JERK. I HAVE REPORTED THIS PROBLEM TO CHEVROLET  ON NUMEROUS OCCASIONS, BUT ONLY HAVE 4 INVOICES (FROM 11/20/14-8/26/15) WITH THE COMPLAINT LISTED. EACH TIME CHEVROLET STATED NO PROBLEM FOUND OR PRESENT EXCEPT FOR THE MOST RECENT INVOICE DATED AUG. 26, 2015 IN WHICH AFTER CHEVROLET SERVICE MANAGER BECAME INVOLVED BECAUSE I COMPLAINED ABOUT AN UNRESOLVED ISSUE, HE DID STATE THAT THE PROBLEM WAS NOTICED BY A \"SENIOR SERVICE TECHNICIAN\" AND SINCE NO CODE WAS PRESENT TO DIAGNOSE OR CORRECT THE PROBLEM, GM WAS CONTACTED. WAS TOLD BY THE SERVICE MANAGER THAT GM STATED \"THEY ARE AWARE OF THE CONCERN BUT AS YET HAVE NOT FORMULATED A REPAIR.\" I AM PRESENTLY STILL EXPERIENCING THE ISSUE, BUT SINCE GM HAS NOT \"FORMULATED A REPAIR\" FOR AN ISSUE THAT THEY ARE UNSURE OF THE CAUSE AND IN WHICH THEY FEEL \"IS NOT A SAFETY ISSUE\" I AM DRIVING A VEHICLE THAT COULD STALL AT ANY GIVEN TIME. BE SURE EACH COMPLAINT IS DOCUMENTED VIA INVOICE NUMBER AND MAKE SURE WHAT YOU ARE TOLD VIA PHONE AND OR IN PERSON IS WHAT IS STATED ON THE INVOICE.",
        "vin": "3GCPCREC2EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD CLUNKING NOISE WHEN TURNING THE STEERING WHEEL ALL THE WAY TO THE LEFT.",
        "vin": "3GCUKREH0EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING AT APPROXIMATELY 35 MPH, THE CONTACT HEARD AN ABNORMAL NOISE COMING FROM THE FRONT WHEELS. THE CONTACT STATED THAT THIS WAS A RECURRING FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THAT IT COULD BE THE TIRES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6.",
        "vin": "1GCVKREH8EZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761471,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT THE STEERING WHEEL WAS TIGHT AND EXTREMELY DIFFICULT TO TURN LEFT AND RIGHT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO REPLACED THE POWER ASSIST MOTOR. THE SECOND REPAIR WAS THE ELECTRONIC TORQUE CONTROL SENSOR; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT WAS NOT INCLUDED IN MANUFACTURER RECALL NUMBER: 14515 FOR THE CHASSIS CONTROL MODULE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO REMEDY. THE APPROXIMATE FAILURE MILEAGE WAS 89,000.",
        "vin": "3GCUKREC1EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2015",
        "dateOfIncident": "08/28/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDERCOATING ON TRUCK FRAME IS PEELING OFF AND RUST IS PREVALENT.",
        "vin": "1GCVKREC8EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/28/2015",
        "dateOfIncident": "03/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759932,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VIBRATES AT 72-80 MPH. HAVE TAKEN IT TO THE DEALER 4 TIMES WITH NO POSITIVE RESULTS. THEY RF BALANCED ALL TIRES TWICE, REPLACED ONE TIRE, AND ON THE LAST VISIT DROVE IT 95 MILES AND DID NOTHING.  CURRENTLY DEALING WITH GM CUSTOMER CARE REP AND DEALERSHIP.  IF THEY CANNOT FIND A FIX, I WILL REQUEST THEY BUY THE VEHICLE BACK.",
        "vin": "1GCVKREC8EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. AFTER SWITCHING GEARS INTO THE DRIVE POSITION, THE VEHICLE JERKED FORWARD WHILE THE BRAKE PEDAL WAS DEPRESSED WITHOUT WARNING. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED ONLY WHEN THE VEHICLE WAS SWITCHED FROM THE REVERSE POSITION TO THE DRIVE POSITION. THE VEHICLE WAS TAKEN TO A DEALER BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 10,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/07/2015",
        "dateOfIncident": "11/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT HIGHWAY SPEEDS (ABOVE 50 MPH)  AFTER DRIVING FOR 20 MINUTES TO 1/2 HR,  A SLIGHT TURN TO THE LEFT (AT SPEED) CAUSES THE STEERING TO STICK/BIND. IT MAY BE A LOSS OF POWER STEERING ASSIST.  THIS HAPPENS INTERMITTENTLY.      THIS PREVENTS THE WHEEL FROM RETURNING TO CENTER FROM THE LEFT TURN.  THE RESISTANCE CAN BE OVERCOME BY INCREASING TO FORCE APPLIED TO EITHER RETURN THE WHEEL TO CENTER OR TO INCREASE THE LEFT TURN.  UPDATE 9/15/15*CW       *CN",
        "vin": "1GCVKREC1EZ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/06/2015",
        "dateOfIncident": "08/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT THE REAR FRAME WAS CORRODED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 8,400.",
        "vin": "1GCVKREC3EZ"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/04/2015",
        "dateOfIncident": "06/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746091,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING AT APPROXIMATELY 65 MPH, THE VEHICLE SHOOK VIOLENTLY WITHOUT WARNING. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE DRIVESHAFT FAILED AND THE TIRES NEEDED TO BE REPLACED. IN ADDITION, THE DRIVE LINE NEEDED TO BE ALIGNED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 600.",
        "vin": "3GCUKREC3EG"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745333,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY A STABILIZATION CONTROL LIGHT CAME ON BRIEFLY, THEN WENT AWAY.  APPROXIMATELY 5 MILES LATER AFTER EXITING THE HIGHWAY, AND GOING DOWN A SIDE STREET, THE TRUCK DIED AND THE STEERING WHEEL LOCKED WHEN I SLOWED AND STARTED TO MAKE A RIGHT HAND TURN INTO A PARKING LOT.   THIS HAS SINCE OCCURRED ONCE MORE UNDER SIMILAR CONDITIONS WHILE SLOWING, BRAKING AND TURNING AT LOW SPEEDS AND NOT UNDER THROTTLE.",
        "vin": "3GCUKREC1EG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2015",
        "dateOfIncident": "07/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10736084,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, THE TRAILER'S ELECTRIC SERVICE BRAKE WARNING LIGHT ILLUMINATED. THE FAILURE RECURRED INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURE WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 23,900.",
        "vin": "3GCUKREC2EG"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2015",
        "dateOfIncident": "09/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735556,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED HAVING PROBLEMS WITH THE ELECTRICAL IN THE TRUCK STARTING WITH THE WINDOWS. I INFORMED DEALERSHIP AND THAT THE STABILITRAK WAS GOING OFF SAYING THAT THE STEERING WAS FAILING. THE PROBLEM HAS CONTINUED TO PRESENT AND NOW THE TRUCK IS SHUTTING ITSELF OFF WHILE GOING DOWN THE ROAD LOSING ALL STEERING AND TURNING ITSELF BACK ON. MY FAMILY WAS IN THE TRUCK AND WE ALMOST ROLLED INTO A PARKING STRUCTURE, I LOST ALL POWER AND STEERING TO TRUCK HAD NO CONTROL AT ALL. THE TRUCK CONTINUES TO HAVE ISSUES AND THIS AFTER I TOOK IT IN TO HAVE IT FIXED. DEALER MADE PROBLEM WORSE.",
        "vin": "1GCVKREC6EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2015",
        "dateOfIncident": "10/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732166,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN TO NOTICE SEVERE VIBRATION IN THE DRIVE TRAIN AT 55 MPH, SIMILAR TO A WASHBOARD EFFECT.  IN ADDITION, THE VEHICLE DOWN SHIFTED VERY HARD WHEN STOPPING.  I REPORTED THIS PROBLEM TO THE DEALER ON THIS DATE AND THEY SAID IT WAS NORMAL OPERATION.  IN DECEMBER, OF 2014, I TRIED PASSING A VEHICLE AND EXPERIENCED A LOUD THUMP IN THE REAR END OF THE VEHICLE, I THOUGHT THE DRIVE SHAFT WAS GOING TO FALL OUT.  I TOOK THE VEHICLE TO THE DEALER AND THEY COULD NOT REPLICATE THE ISSUE.  I HAVE TAKEN THE VEHICLE TO TWO DIFFERENT DEALERSHIPS A TOTAL OF 3 TIMES TO ADDRESS THIS ISSUE.  THEY BOTH CLAIM THIS IS NORMAL.  NOW THE VIBRATION HAS GOTTEN WORSE, IT CAN OCCUR AT 40-45, 50-55, AND 60 TO 65.   I HAVE OWNED GM TRUCKS BEFORE AND THE ONLY TIME I HAD AN ISSUE LIKE THIS WAS WHEN THE DRIVE SHAFT ON A 1994 SAFARI VAN WAS OUT OF BALANCE HAD TO BE RE BALANCED.  I HAVE NOTED SEVERAL OTHER COMPLAINTS FROM OTHER 2014 -15 VEHICLE OWNERS.  THIS TYPE OF OPERATION HAS TO BE DAMAGING THE GEARS AND TRANSMISSION.  I HAVE CALLED THE GM AREA REP AND GOT AN ATTITUDE FROM HIM.  HOWEVER, I DO HAVE ANOTHER APPOINTMENT WITH THE SELLING DEALER, (3RD WITH HIM, 4TH OVER ALL) THIS WEEK.  AND WAS TOLD TO CALL THE GM REP WHEN I ARRIVE.",
        "vin": "1GCRCREH4EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2015",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731826,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE BEGAN TO VIBRATE VIOLENTLY. IN ADDITION, THE ACCELERATOR PEDAL WAS DEPRESSED AND THE VEHICLE CONTINUED TO VIBRATE. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER WHO WAS UNABLE TO DIAGNOSE OR REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100.",
        "vin": "3GCUKREC0EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2015",
        "dateOfIncident": "06/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726323,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MERGING ONTO THE HIGHWAY AND JUST ABOUT GOT UP TO SPEED AND FELT A VIBRATION THAT WITHIN A FEW SECONDS GOT REALLY INTENSE THEN HEARD A POP AND THEN SEVERAL BANGS. I THOUGHT A TIRE BLEW, SO AS I LOOKED UP IN MY REAR VIEW MIRROR TO SEE IF I WAS CLEAR TO GET OVER TO THE SHOULDER, I SAW MY DRIVESHAFT CARTWHEELING ABOUT 8 FT. IN THE AIR AS PEOPLE BEHIND ME WERE SCRAMBLING TO AVOID FROM HITTING IT. LUCKILY THE DRIVESHAFT DIDN'T LIFT THE BACK OF THE TRUCK INTO THE AIR, AND MORE IMPORTANTLY IT DIDN'T GO THROUGH SOMEONES WINDSHIELD BEHIND ME! IT TURNS OUT THAT THE KNUCKLE ON THE REAR OF THE SHAFT HAD SNAPPED, VIOLENTLY VIBRATED AND THE SHAFT DROPPED, RIPPED APART ABOUT A FOOT BEHIND THE TRANSMISSION AND CAME OUT FROM UNDER THE TRUCK. THE U-JOINT WAS STILL IN THE DIFFERENTIAL AND A FOOT OF DRIVESHAFT WAS STILL IN THE TRANSMISSION. I HAD BROUGHT MY TRUCK TO 2 DIFFERENT DEALERSHIPS FOR A VIBRATION AND CLUNKING NOISE IN THE REAR WHEN IT WAS NEW, (1900 MILES) BOTH DEALERS TOLD ME \"THEY COULDN'T DUPLICATE CUSTOMERS CONCERN\"...I'M A MECHANIC, I'VE WORKED AT DEALERSHIPS, THIS IS WHAT THEY TELL PEOPLE WHEN THEY DON'T WANT THE HEADACHE OF DEALING WITH AN ISSUE. AFTER LOOKING DRIVESHAFT VIBRATIONS UP ON THESE SPECIFIC TRUCKS, I CAME TO REALIZE THAT IT IS A COMMON PROBLEM WITH 2014 AND 2015 GM FULL SIZE TRUCKS. THIS INCIDENT COULD HAVE TURNED OUT MUCH WORSE THAN IT DID...IF YOU OWN ONE OF THESE TRUCKS AND NOTICE A VIBRATION AT ALL, GET IT INTO THE DEALER AND GET IT FIXED IMMEDIATELY, DON'T TAKE THE CHANCE OF HURTING YOUR FAMILY OR SOMEONE ELSE!",
        "vin": "3GCPCREC1EG"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2015",
        "dateOfIncident": "05/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721932,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 SILVERADO SHAKES AT VARIOUS SPEEDS.  HAS BEEN A PROBLEM SINCE THE DATE OF PURCHASE AND HAVE BEEN TOLD BY THE DEALERSHIP THAT THERE WAS NOTHING THEY COULD DO TO FIX IT.  THERE HAVE BEEN COMPLAINTS OF THIS HAPPENING ON THE VEHICLE DATING BACK TO OCT. 2013, GM HAS BEEN AWARE THAT THE VEHICLE SHAKES AND THAT HAS NOT BEEN A RECALL ISSUED.  DEALERSHIPS ARE STILL SELLING THE TRUCK KNOWING THAT THERE HAS BEEN NUMEROUS PROBLEMS REPORTED.",
        "vin": "3GCUKSEC7EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "12/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716553,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABOVE STATED VEHICLE WAS SOLD TO ME IN DEC. 2014, AND I WAS ALLOWED TO LEAVE WITH THE VEHICLE WITHOUT KNOWING THE VEHICLE WAS UNDER RECALL. (SALE AND DELIVERY ON AN UNREMEDIED RECALLED VEHICLE). THE RECALL FOR THIS VEHICLE HAD BEEN ISSUED JUNE 26, 2014. WHEN I ASKED THE SALESMAN ABOUT THIS RECALL, HE STATED TO ME HE HAD CKECKED WITH HIS SALESMANAGER AND THAT THERE WAS NO RECALL ON THIS VEHICLE. AFTER CHECKING WITH THE NTHSA DATABASE AND FOUND THE RECALL, I HAD IT FIXED ON MAY 5, 2015. I ASKED THE SALESMAN WHY MY VEHICLE HAD NOT BEEN FIXED DURING THE 6 MONTHS PRIOR TO THE SELL TO ME, HIS REPLY WAS THAT THE VEHICLE HAD BEEN SOLD IN JULY OF 2014 AND THAT THE BUYER HAD THE VEHICLE FOR 7 DAYS AND RETURNED IT FOR LACK OF FUNDS. THAT MEANS THEY SOLD THIS VEHICLE TWICE WHILE THE RECALL WAS UNREMEDIED.",
        "vin": "3GCUKREC5EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "12/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABOVE STATED VEHICLE WAS SOLD TO ME, AND I WAS ALLOWED TO LEAVE WITH THIS VEHICLE BEFORE A RECALL THAT HAD BEEN ISSUED JUNE 26 2014 HAD BEEN REMEDIED. ( SALE AND DELIVERY OF AN UNREMEDIED RECALLED VEHICLE).  UPON REPORTING TO THE SALESMAN ABOUT THE RECALL, HE AND HIS SALESMANAGER STATED TO ME THAT THERE WAS NO RECALL ON THE VEHICLE. I CHECKED WITH THE NTHSA FOUND THE RECALL AND HAD IT FIXED MAY 5, 2015. AFTER ASKING THE SALESMAN WHY MY VEHICLE HAD NOT BEEN FIXED DURING THE 6 MONTHS PRIOR TO THE SALE OF THE VEHICLE TO ME, HIS ANSWER WAS THAT THE VEHICLE HAD PREVIOUSLY SOLD IN JULY OF 2014. THE BUYER HAD THE TRUCK FOR 7 DAYS AND COULD NOT AQUIRE FINANCING AND THE VEHICLE WAS RETURNED. HENCE THIS ONE VEHICLE HAS BEEN SOLD AND ALLOWED TO LEAVE THEIR LOT TWICE WITHOUT THE RECALL BEING FIXED. THE DEALER IS NORMAN FREDE CHEVROLET IN HOUSTON TX.",
        "vin": "3GCUKREC5EG"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2015",
        "dateOfIncident": "08/31/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE 2014 CHEVY SILVERADO CREW CAB LT TEXAS EDITION FROM RELIABLE CHEVROLET IN RICHARDSON,  TX.  IMMEDIATELY AFTER PURCHASING WITHOUT A TEST DRIVE IT NOTICED THAT THERE WAS A VIBRATION, STEERING PROBLEM, AND SCRATCHES ON THE BED.. BECAUSE IT WAS A DEMO OF WAS TOLD BY THE NEW CAR SALESMAN THAT THEY HAD  MADE SURE THE VEHICLE WAS INSPECTED AND THAT THE SCRATCHES WERE SUPERFICIAL AND IT'S A DEMO SO THAT'S HOW IT IS. I SPOKE WITH THE BUSINESS MANAGER AND THEY PUT A SPAY IN BED LINER TO FIX THE SCRATCHES AND DID A BALANCE ON THE TIRE. I PICKED THE TRUCK UP AND THE STEERING AND VIBRATION PROBLEMS WERE STILL THERE. IT WENT BACK INTO THE SHOP  AGAIN AND THEY COULDN'T DUPLICATE ANY PROBLEMS. THE STEERING IS ALMOST IMPOSSIBLE TO KEEP IN A STRAIGHT LINE IT SWERVES AS IF THE TRUCK HAD A FEW DRINKS. I TOLD THEM IT DON'T FEEL SAFE DRIVING IT AND I'M AFRAID I'M GOING TO HIT SOMEONE. I WILL NOT DRIVE IN THE MIDDLE LANES. I HAVE TO DRIVE ON EITHER FAR LEFT OR RIGHT LANES TO ALLOW FOR SWERVING.  I COMPLAINED TO GM.. GOT EXCITED BECAUSE THEY SENT ME TO ANOTHER DEALERSHIP AND SAME THING HAPPENED.. WENT FOR A TEST DRIVE.. THEY FELT SOMETHING WRONG BUT MECHANICS CAN'T  \"DUPLICATE\" THE PROBLEM. THEY SAID THEY TEST DROVE IT AGAIN BUT IN DON'T SEE HOW WHEN THE ROADS WERE ICED OVER. I CALLED GM AGAIN AND I'M AT A NEW DEALERSHIP THEY TEST DROVE IT WITH ME AND HEADED A NEW POPPING NOISE WHEN THE WHEELS IS TURNED AND FELT STEERING AND SUSPENSION ISSUE. THEY KEPT THE TRUCK BUT ONCE AGAIN NOT ABLE TO DUPLICATE. I'VE HAD A FEW LOANERS AND NONE OF THEM DRIVE LIKE MINE. THE TRUCK HAS ALSO HAD PROBLEMS WITH AC AND WHINY NOISE IN ENGINE.  I'M WAS SUPPOSED TO PICK UP THE TRUCK TODAY BUT I COMPLAINED AND THEY WERE GOING TO TEST DRIVE IT AGAIN. THEY DON'T FACTOR IN THE TIME AND INCONVENIENCE OF HAVING TO TAKE OFF WORK PLUS GAS AND MILES IN TRYING TO GET THIS FIXED. NOT HAPPY WITH THIS TRUCK.  *TR",
        "vin": "3GCPCREH5EG"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2015",
        "dateOfIncident": "02/16/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFTED TRUCK INTO REVERSE WHILE PLOWING MY DRIVEWAY, TRUCK MADE A LARGE SNAP SOUND IN FRONT END AND WOULDN'T MOVE - OIL WAS DISPERSED ALL OVER THE GROUND.  IN THE END - FRONT YOKE BROKE, CAUSING DRIVE SHAFT TO HIT OIL FILTER AND BUSTING IT OFF.  TRUCK WAS UNDER WARRANTY SO NO COST BUT THIS IS DANGEROUS.  HAD I BEEN MOVING THIS COULD HAVE CAUSED A TRUCK TO FLIP END FOR END.  *TR",
        "vin": "1GC1KYE86EF"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/23/2015",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RECEPTION FOR THE RADIO IS HORRIBLE IN BOTH FM AND FM-HD.  GM SUPPOSEDLY HAS A REPROGRAM FOR FM ONLY BUT NOT HD...  *TR",
        "vin": "3GCUKTEC4EG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/22/2015",
        "dateOfIncident": "03/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712235,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING AT APPROXIMATELY 70 MPH, THE VEHICLE STRUCK A DEER ON THE HIGHWAY. THE FRONT AND REAR AIR BAGS FAILED TO DEPLOY. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 8,000.",
        "vin": "1GCVKREC0EZ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/21/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHEN DRIVING AT VARIOUS SPEEDS, THE VEHICLE VIBRATED IN A STRONG MANNER. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE TIRES AND TORQUE CONVERTER NEEDED TO BE REPLACED. THE REPAIRS WERE MADE, BUT THE FAILURE STILL PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIBRATION WAS FROM THE DESIGN OF THE VEHICLE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1GCNKPEHXEZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "11/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS WAS HAPPENING IN COOLER WEATHER. I HAVE A 2014 CHEVROLET SILVERADO. WHEN STARTING THE VEHICLE, THE IGNITION KEY WOULD STICK IN THE START POSITION AND THEN RETURN TO THE RUN POSITION. THIS HAS HAPPENED PROBABLY HALF A DOZEN TIMES.  I SEE THAT THERE IS A RECALL ON OLDER MODELS, BUT APPARENTLY SOME NEWER ONES , SUCH AS MINE SHOULD BE INCLUDED.   *TR",
        "vin": "3GCUKREC1EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE NEW 2014 CHEVY SILVERADO 1500 4X4 5.3 ENGINE. IN JANUARY I WENT TO GET IN MY TRUCK TO GO TO WORK AND THERE WAS A SERVICE POWER STEERING WARNING. I THEN NOTICED I HAD NO POWER STEERING.(4000 MILE) THEY TOWED MY TRUCK TO DEALERSHIP AND THEY SAID THEY REBOOTED THE COMPUTER AND IT WAS OK NOW. THIS PAST WEEKEND MARCH 28TH 2015, IT DID THE SAME THING AT THE BOAT RAMP IN A HIGH SCHOOL FISHING TOURNAMENT. WENT TO GET TRUCK TO LOAD BOAT AND COULD NOT MOVE IT.(6500 MILE) AFTER ABOUT AN HR. IT WAS OK. I AM CONCERNED OF THIS TRUCK LOOSING POWER STEERING WHILE DRIVING IT THE MOUNTAINS. I HAVE GOOGLED THIS ISSUE AND SOME PEOPLE HAVE REPORTED THAT THEY HAVE LOST POWER STEERING WHILE DRIVING. HAVING 2 HIGH SCHOOL STUDENTS IN MY TRUCK IS A GREAT CONCERN.  *TR",
        "vin": "1GCNKPEC0EZ"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/20/2015",
        "dateOfIncident": "12/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY TRUCK IN FOR A VIBRATION PROBLEM TO THE DEALERSHIP THAT I PURCHASED IT FROM. THE TRUCK WAS MUDDY AND THE DEALERSHIP TOLD ME THAT IT WAS FROM ALL THE MUD ON THE TRUCK. BUT THEY DID NOT EVEN WASH THE TRUCK AND TEST DRIVE IT. THEN I BROUGHT IT INTO A DIFFERENT DEALERSHIP TO HAVE IT CHECK FOR THE SAME THING. THEY FORCED BALANCE MY TRUCK AND THEY FOUND SOMETHING SO THEY ROTATED MY DRIVE SHAFT 180 DEGREES AND SAID IT WAS FIXED. ABOUT 30 DAYS LATER IT STARTED AGAIN AND BROUGHT IT BACK TO BE CHECKED. THEY FORCED BALANCE IT AGAIN AND FOUND A BAD TIRE SO THEY REPLACED THE ONE TIRE WHILE THE OTHER THREE TIRE HAD ABOUT 12,000 MILES ON THEM. SO IT HAPPENED AGAIN SO BROUGHT IT AGAIN FOR THE 4TH TIME FOR THE SAME PROBLEM. THEY AGAIN FORCED BALANCED THE TRUCK AND COULD NOT PIN POINT THE PROBLEM SO THE SERVICE MANGER TOOK A 2015 SILVERADO 1500 AND TOOK OFF THE TIRES AND RIMS AND PUT IT ON MY TRUCK. NOT DIDN'T FIX IT SO THEY PUT ALL NEW SHOCKS AND STROUTS ON IT AND TOLD ME IT WAS FIXED AND THEY WANTED TO BRING THE TRUCK TO MY HOME AND I DECLINED AND I WANTED TO TEST DRIVE THE TRUCK. I DROVE THE TRUCK WITH THE SERVICE MANAGER AND FOUND THAT IT DIDN'T CHANGE ANYTHING.SO I ASKED HIM THAT I WANTED AN APPOINTMENT WITH THE DISTRICT MANAGER OF GM. SO WHEN I MEET WITH HIM IN THE SERVICE MANAGERS OFFICE WITH THE SERVICE MANAGER. THE FIRST THING OUT OF THE DISTRICT MANAGERS WAS I AM HERE TO HELP YOU AND THE SHOWED HIS TRUE SELF. WITHIN THE FIRST 9 MINUTES HE ASKED ME HOW I WOULD FIX THE PROBLEM AND THEN HE TOLD ME TO HIRE AN ATTORNEY. BECAUSE THAT WAS THE ONLY WAY YOU ARE GOING TO GET THE TRUCK BOUGHT MAKE FROM GM. AFTER I LEFT THE OFFICE AFTER 9 MINUTES I TRIED TO MAKE AN APPOINTMENT AT THE DEALERSHIP I BOUGHT THE TRUCK AND I HAD AN APPOINTMENT THE FOLLOWING DAY. THE SAME DAY THE DEALERSHIP INFORMED THAT NIGHT THAT THEY COULDN'T SEE OR WORK ON MY TRUCK I CALLED GM CUSTOMER SERVICE.  *TR",
        "vin": "1GCVKREC6EZ"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "02/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10695408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 CHEVROLET SILVERADO. WHILE DRIVING APPROXIMATELY 60 MPH, THE CONTACT REACHED OVER TO TURN THE HEAT OFF AND THE VEHICLE WENT OFF THE ROAD, DOWN A HILL, AND INTO A DITCH. THE VEHICLE CONTINUED ON UNTIL IT CRASHED INTO A CABLE THAT WAS CONNECTED TO A TELEPHONE POLE. THE TELEPHONE POLE SPLIT IN HALF. THE SEAT BELT FAILED TO RESTRAIN THE CONTACT AND THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED INJURIES TO HIS BACK, KNEE, AND HIP THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO A LOT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 7,956.",
        "vin": "1GCNCPEHXEZ"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "07/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693235,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APPROXIMATELY JULY 19, 2014, THE HILL DESCENT MODE FAILED ON MY 2014 SILVERADO 1500 AS I WAS DRIVING DOWN A MOUNTAIN IN THE STATE OF WASHINGTON. THE TRUCK TOOK OFF WHEN THIS FAILED AND I HAD TO MANUALLY USE MY BRAKES IN ORDER TO AVOID CRASHING INTO ANY VEHICLES AHEAD. I TOOK THE VEHICLE IN TO THE DEALER WHO, AND I QUOTE 'THEY COULDN'T DUPLICATE THE CONCERN AND THERE WERE NO CODES STORED IN THE SYSTEM'. ONLY FOUR MILES WERE PUT ON THE TRUCK WHILE IT WAS IN THEIR SHOP. HOW CAN YOU POSSIBLY TEST THIS FAILURE IF YOU DIDN'T DRIVE IT IN THE MOUNTAINS? NEXT MAJOR ISSUE WAS THE ONSTAR ANTENNA BEGAN TO LEAK INTO THE CAB, SOAKING THE HEADLINER, THE FLOOR AND LEAKING INTO THE DASH WHERE ALL THE ELECTRICAL COMPONENTS ARE. DEALER 'DIDN'T HAVE THE PART TO FIX THIS' AND IT CONTINUES TO LEAK TO THIS DAY. AND FINALLY, HAVING NOTICED ALL THE POSTS ABOUT RUST UNDERNEATH THIS TRUCK, I TOO, DISCOVERED THAT THE 'WAX' COATING HAD DETERIORATED AND MAJOR RUST ISSUES HAD DEVELOPED. I HAVE OWNED CHEVROLET TRUCKS FOR NEARLY 20 YEARS AND I HAVE NEVER, EVER FOUND THEM TO BE THE PIECE OF JUNK THIS VEHICLE IS. THE HILL DESCENT MODE IS A SERIOUS AND POTENTIALLY DEADLY PROBLEM. THESE ISSUES HAVE BEEN REPORTED TO THE CEO OF GM IN A DETAILED LETTER WITH PICTURES TO PROVE EVERYTHING THAT IS WRONG WITH THIS TRUCK. CAUTION*****BEFORE YOU SHELL OUT FIFTY GRAND FOR THIS TRUCK, READ EACH AND EVERY POST ON THIS WEBSITE IN ORDER TO MAKE AN INFORMED DECISION.   *TR",
        "vin": "3GCUKSEC3EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": true,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "02/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT WHILE BACKING OUT OF A PARKING SPACE AT APPROXIMATELY 5 MPH, THE POWER SEATS AND MIRRORS BEGAN TO MOVE WITHOUT WARNING CAUSING THE CONTACT TO CRASH INTO A TELEPHONE POLE. THE CONTACT DID NOT SPECIFIED IF THERE WERE ANY INJURIES OR IF A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT A WIRE CONNECTED TO THE SEAT MODULE WAS PINCHED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 12,855.   UPDATED 04/10/15*LJ    UPDATED 9/27/2017*CN",
        "vin": "1GCVKSEC0EZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "08/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690607,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS MILEAGE COMPLAINT .   STATED MILEAGE (HWY ) IS 22 MPG , THE FIRST SIX MONTHES OF DRIVING DID ACHIEVE THIS STATED MILEAGE ,OCCASIONALLY  AS MUCH AS 23 MPG .AFTER 2 RECALL SERVICE VISITS AND AN OIL CHANGE , THE MILEAGE ABRUPTLY DROPPED TO 18 MPG I COMPLAINED TO CHEV. SERVICE IN COTTAGE GROVE ,OR SEVERAL TIMES OVER THE COURSE OF 4 MONTHES THEY ADVISED ME TO CHANGE FUEL (SERVICE STATIONS ,) PUT A FUEL BOOSTER ADDITIVE IN THE TANK ,CHECK TIRE PRESSURE .THEY ALSO STATED THAT THE FUEL MNFRS.  CHANGING THE FUEL BLEND FOR THE WINTER SEASON MAY BE THE CAUSE. NO SERVICE CODES IN THE COMPUTER . NONE OF THE SUGGESTED \"FIXES\"  HAVE CHANGED THE MILEAGE ,STILL AT AROUND 18 MPG .  SOMETHING CAUSED THIS SUDDEN DROP IN MPG .I HAVE A COUPLE OF IDEAS ,   1. ONE RECALL WAS A COMPUTER SOFTWARE UPGRADE ,WRONG SHIFT PARAMETERS INSTALLED ?  2. AT PRESCRIBED OIL CHANGES ,06/03/14 &12/18/14 , ( TRUCK REQUIRES DEXOS 0-20 OIL ) MAYBE WRONG OIL WAS  INSTALLED ? ONE INVOICE SHOWS 5W-30 WAS INSTALLED .  HOWEVER DEALERSHIP DENIES INSTALLING WRONG OIL .  HOW CAN I HAVE THE OIL ANALYZED TO DETERMINE WHICH IS IN THE TRUCK ?   *JS",
        "vin": "1GCVKEC7EZ2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2015",
        "dateOfIncident": "12/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682628,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT WHILE DRIVING AT 85 MPH, THE SHIFT LEVER SHIFTED INDEPENDENTLY FROM HIGH TO LOW GEAR. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 8,685.",
        "vin": "3GCUKSEC0EG"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/30/2015",
        "dateOfIncident": "01/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680094,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SILVERADO DOESN'T HAVE CHILD DOOR LOCKS, AND EVEN WHEN THE DOORS ARE LOCKED, IF YOU PULL THE HANDLE TWICE IT OPENS THE DOOR. MY TWO YEAR OLD OPENED THE DOOR ON THE HIGHWAY AND SCARED US SO BAD WE NEARLY WRECKED. NOW HIS CAR SEAT IS IN THE MIDDLE BUT THIS IS A VERY UNSAFE DESIGN.   *TR",
        "vin": "3GCUKREC2EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679302,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING AT APPROXIMATELY 20 MPH, THE VEHICLE AND THE STEERING WHEEL VIBRATED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THERE WAS A VIBRATION IN THE ACTING FUEL MANAGEMENT MODE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 9,000.",
        "vin": "1GCVKREH7EZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 CHEVY SILVERADO CONSUMER STATED THE VEHICLE WAS LEAKING OIL",
        "vin": "1GCVKPEH4EZ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "01/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676691,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT WHILE REVERSING, THE DRIVER'S SEAT BECAME UNLATCHED AND MOVED FORWARD INDEPENDENTLY CAUSING THE CONTACT TO BE THROWN AGAINST THE STEERING WHEEL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 22,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "01/30/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THIS 2014 CHEVY SILVERADO CREW CAB IN JANUARY OF 2014 IT WAS DRIVEN BY THE GENERAL MANAGER OF THE LOCAL CHEVY DEALERSHIP IT HAD APPROXIMATELY 3500 MILES ON IT ,THE ISSUES STARTED AS SOON WE GOT IT HOME  1)THE ALARM WENT OFF WHILE SITTING IN OUR DRIVE WAY (NO ONE AROUND IT  DAYLIGHT) 2)THE HEAD LIGHTS WENT OUT WHILE DRIVING IT AT NIGHT  3)THE SPEAKER WOULD CRACKLE WHEN YOU OPEN THE DOORS 4)THE DOORS WOULD NOT UNLOCK WHEN VEHICLE WAS PUT IN PARK 5) NOISE FROM THE TRANSMISSION BUT THE DEALERSHIP CALLED IT NORMAL 6)TRANSMISSION WOULD SHIFT WITH A THUD SOMETIMES  DEALERSHIP SAID TRANSMISSION HAD TO LEARN OUR DRIVING HABITS 7)HORN WOULD START OFF STRONG THEN DIE TO A MUFFLE 8)FILM ON THE INSIDE OF THE WINDSHIELD AND THE SMELL OF COOLANT INSIDE THE VEHICLE BUT THE DEALERSHIP SAYS IT CAN'T DUPLICATE THE PROBLEM BUT CAN SEE THE FILM ON THE WINDSHIELD  8)4 WHEEL DRIVE WAS MAKING A RUMBLING NOISE   THE BEARING HAS TO BE SHIPPED FROM GM BECAUSE THE PART IS NOT AVAILABLE YET 9 )THE HEATED SEATS QUIT HEATING 10) THE DOORS COULD NOT BE UNLOCKED FROM INSIDE THE VEHICLE  I HAD TO USE THE REMOTE ENTRY TO GET IN  THE PERSON INSIDE THE VEHICLE COULD NOT GET THE DOORS TO UNLOCK 11)THE TURN SIGNALS QUIT WORKING   THE SOCKETS HAD TO BE REPLACED  12) I AM SURE I FORGOT SOMETHING BUT THIS IS THE LIST OF ISSUES THAT I COULD REMEMBER   . WE HAVE CONTACTED GM DIRECTLY BUT THEY ARE PRETTY MUCH WORTHLESS AT THIS POINT  NO  ONE HAS DIED YET  THAT I KNOW OF AND UNTIL THEN GM WILL NOT TAKE OWNERSHIP OF THESE ISSUES      [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BACKED MY TRUCK OUT OF THE GARAGE AND PARKED IN THE DRIVEWAY. I PUT IN PARK AND HAD MY KEYS IN MY HAND. I WENT TO WALK BACK INSIDE THE HOUSE WHEN I TURNED AROUND AND SAW MY TRUCK ROLLING DOWN THE DRIVEWAY. I STOPPED IT AND PULLED BACK UP IN THE DRIVEWAY AND PUT IN PARK AGAIN JUST FOR IT ROLL BACK DOWN THE DRIVEWAY. AFTER I COUPLE TIMES OF REPEATING THIS THE TRANSMISSION FINALLY ENGAGED INTO PARK.    *TR",
        "vin": "1GCRCREC3EZ"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/16/2015",
        "dateOfIncident": "01/14/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10673007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING NORTH WHEN A VEHICLE SUDDENLY STOPPED IN FRONT OF ME. I BRAKED AS QUICKLY AS POSSIBLE, THE 2014 CHEVY SILVERADO THAT I WAS DRIVING ONLY SLOWLY CAME TO A STOP. UNFORTUNATELY, I REARENDED ANOTHER VEHICLE. THANKFULLY I HAD NOT GOTTEN UP TO THE SPEED LIMIT (30MPH) AND WAS ONLY GOING 20MPH.  MY TRUCK WOULD NOT BRAKE QUICKLY. NO SCREECHING TIRES, NO BLACK MARKS ON THE ROAD. THE STOP WAS SO SLOW THAT I HAD TIME TO TURN THE STEERING WHEEL AND ONLY DAMAGE PART OF MY FRONT END. THE GRILL, BUMPER, AND HOOD WERE SMASHED IN. NO AIRBAGS CAME OUT OF THE TRUCK, AND MY ONSTAR SERVICE SENSOR DID NOT GO OFF. AFTER COLLIDING WITH THE VEHICLE MY 2014 CHEVY SHUT OFF BY ITSELF. I HAD THE BRAKE STILL DEPRESSED & PUT THE TRUCK INTO PARK.  *TR",
        "vin": "1GCRCREC8EZ"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/16/2015",
        "dateOfIncident": "01/14/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10672998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING NORTH WHEN A VEHICLE SUDDENLY STOPPED IN FRONT OF ME. I BRAKED AS QUICKLY AS POSSIBLE, THE 2014 CHEVY SILVERADO THAT I WAS DRIVING ONLY SLOWLY CAME TO A STOP. UNFORTUNATELY, I REARENDED ANOTHER VEHICLE. THANKFULLY I HAD NOT GOTTEN UP TO THE SPEED LIMIT (30MPH) AND WAS ONLY GOING 20MPH.  MY TRUCK WOULD NOT BRAKE QUICKLY. NO SCREECHING TIRES, NO BLACK MARKS ON THE ROAD. THE STOP WAS SO SLOW THAT I HAD TIME TO TURN THE STEERING WHEEL AND ONLY DAMAGE PART OF MY FRONT END. THE GRILL, BUMPER, AND HOOD WERE SMASHED IN. NO AIRBAGS CAME OUT OF THE TRUCK, AND MY ONSTAR SERVICE SENSOR DID NOT GO OFF.  *TR",
        "vin": "1GCRCREC8EZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/16/2015",
        "dateOfIncident": "06/12/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10673070,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT THE ELECTRICAL COMPONENTS INTERMITTENTLY FAILED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE AIR BAG SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 8,000.",
        "vin": "1GCRCPEH2EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "01/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671982,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT AFTER PARKING AND EXITING THE VEHICLE, THE VEHICLE ROLLED DOWN A HILL AND CRASHED INTO A TREE. THE AIR BAGS FAILED TO DEPLOY. AFTER INSPECTING THE VEHICLE, THE CONTACT NOTICED THAT THE GEAR SHIFTED FROM PARK TO NEUTRAL INDEPENDENTLY. THE CONTACT WAS AWARE OF NHTSA CAMPAIGN NUMBER: 14V374000 (POWER TRAIN) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 34,000.",
        "vin": "3GCUKSEC9EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "12/29/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I STILL GET RECALL LETTERS BUT THE DEALER (AUTONATION WEST HWY 50 ORLANDO TELLS ME IT IS COMPLETE  BUT THE CARDS SAYS INCOMPLETE THAT I GET FROM GM.  MY ONSTAR ALSO TELLS ME TO GET IT FIXED..WHAT MUST I DO TO FEEL SAFE ?  THIS IS MY 3RD SILVERADO BUT WHAT A PROBLEM !!!!!  *TR",
        "vin": "3GCPCSEC5EG"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/26/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668396,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MOVING FROM A STOP THE TRUCK SOMETIMES LAGS IN ACCELERATION WHICH MAY CAUSE THE OPERATOR TO DEPRESS THE ACCELERATOR FURTHER THAN REQUIRED TO ENTER TRAFFIC. THIS CONDITION ALSO MAY CAUSE A SHORT ACCELERATION DELAY WHEN PULLING INTO TRAFFIC THAT CAN BE UNEXPECTED BY THE OPERATOR.  I HAVE BEEN SURPRISED MANY TIMES BY THIS OPERATOR DISCONNECT ACCELERATING FROM A STATIONARY POSITION.   AFTER DRIVING MY NEW TRUCK 900 MILES I INVESTIGATED THE ACCELERATOR PEDAL ASSEMBLY BRACKET TO FIND THAT THE ENTIRE BRACKET IS NOT PROPERLY FASTENED STRUCTURALLY TO THE FIRE WALL BY DESIGN.    I INSPECTED MY TRUCK ON 12/23/14 AND FOUND THIS PROBLEM, THE ACCELERATOR PEDAL BRACKET FLEX ON MY TRUCK LOOKS TO BE ~3/4\" TO 1\" BEFORE THE ELECTRONIC LINKAGE ENGAGES. THE PEDAL TIP-IN ENGAGEMENT HAS TO FLEX THE MOUNTING BRACKET BEFORE THE ELECTRONIC ACCELERATION SWITCH ENGAGES.  I CAN'T BELIEVE THE GM ENGINEERING AND DESIGN TEAM'S WOULD APPROVE OF SUCH A FLIMSY MOUNTING BRACKET FOR THIS IMPORTANT PART OF BASIC MOTOR VEHICLE OPERATION.   I FEEL OVER TIME AND USAGE THAT THIS BRACKET MAY COMPLETELY FAIL AS CURRENTLY DESIGNED.  I COULD SHIM AND INSTALL ADDITIONAL HARDWARE TO CORRECT THIS SAFETY ISSUE, BUT I FEEL THIS DESIGN ISSUE SHOULD BE ADDRESSED WITH GM BEFORE SOMEONE HAS A CRASH OR WORST.  *TR",
        "vin": "1GCVKREHXEZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2014",
        "dateOfIncident": "12/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKED MY TRUCK DOWN A BOAT RAMP. PUT MY TRUCK IN PARK WHILE APPLYING PARKING BRAKE TRUCK ROLLED BACK INTO WATER. WHEN PULLED OUT I NOTICED MY TRUCK WAS BACK IN PARK. I BELIEVE TRUCK JUMPED OUT OF GEAR.  *TR",
        "vin": "1GCVKREC0EZ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "11/27/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662045,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 55 MPH, THE CONTACT CRASHED INTO A DEER. THE AIR BAGS DEPLOYED HOWEVER, THREE MINUTES LATER THE DRIVER'S SIDE AIR BAG DEPLOYED A SECOND TIME WITHOUT WARNING. IT WAS UNKNOWN IF THE CONTACT SUSTAINED ANY INJURIES AND A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": "3GCUKSEC3EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2014",
        "dateOfIncident": "11/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD AT ABOUT 45 MPH WHEN MY VEHICLE SUDDENLY JUMPED OUT OF GEAR INTO NEUTRAL.  AFTER ABOUT 20 SECONDS IT WENT BACK INTO GEAR.  *TR",
        "vin": "3GCUKRECXEG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "10/21/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 21, 2014 THE ENTIRE FUSE PANEL MELTED DOWN AND CAUGHT FIRE.  THE TRUCK HAD STOPPED RUNNING.  THE HOOD WAS ABLE TO BE RAISED AND THE FIRE WAS PUT OUT WITH FIRE EXTINGUISHER.  THE TRUCK WAS TOWED TO THE DEALERSHIP WHERE IT WAS PURCHASED.  GM HAS TAKEN NO RESPONSIBILITY IN THE REPAIR OF THIS VEHICLE.  MY INSURANCE COMPANY HAS AGREED TO PAY THE REPAIR BILL.  THE CLAIM 048186-GB HAS BEEN SENT TO GM FOR REPAYMENT.  I STRONGLY FEEL THAT THIS IS A MANUFACTURING DEFECT BY GM.  THERE IS ALSO A SAFETY RECALL ISSUED FOR THIS VEHICLE #14515 WHICH I BELIEVE IS DIRECTLY RELATED TO THE INCIDENT THAT HAPPENED TO MY TRUCK.  TO THIS DAY THE TRUCK IS STILL AT THE REPAIR SHOP WAITING ON PARTS.  *TR",
        "vin": "1GC1KXC85EF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED SILVERADO NEW OCT 2014. DRIVING DRY CLEAN HIGHWAY, APPROX. 35 MPH, REAR RIGHT TIRE COMPLETELY EXPLODED.  DID NOT HIT ANYTHING OR ANYONE, JUST BLEW.  TIRE WAS A BRIDGESTONE H/L 684 II THAT CAME ON TRUCK AT TIME OF PURCHASE FROM CHEVROLET DEALERSHIP.    OF COURSE TIRES ARE NOT COVERED UNDER WARRANTY.    *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 CHEVROLET SILVERADO. CONSUMER WRITES IN REGARDS TO FAULTY HEADLIGHTS. *TGW  THE CONSUMER STATED THE HEADLIGHTS WENT OUT, WHILE HER SON WAS DRIVING. *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2014",
        "dateOfIncident": "08/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WAS TOOK TO GM SHOP FOR VIBRATION IN POWER TRAIN REPLACED REAR PROPELLER SHAFT. I DROVE TRUCK 60 MILES HOME SAME VIBRATION TOOK BACK TO SHOP. TOOK INST. TEC. AND TRANSMISSION TEC. FOR RIDE BOTH SAID YES YOU HAVE A VIBRATION AND A HARD UP AND DOWN SHIFT AT 20 TO 30 MPH. NOTHING DONE AT THIS TIME CALLED SHOP FOREMAN AND HE SAID WOULD GET FIELD ENGINEER INVOLVED NOT HEARD FROM THEM SINCE. FILED A COMPLAINT WITH GM CASE # 71-1359113487 HAVE NOT HERD FROM THEM. VIBRATION HAS GOT WORSE IT WILL VIBRATE AT ANY CONSTANT SPEED FROM 0 TO 60 ALONG WITH A RUMBLING SOUND PLUS THE HARD DOWN AND UP SHIFT. 7117 MILES ON TRUCK NOW I FEEL IT IS GETTING UNSAFE TO DRIVE. FOR IF IT LOCKS UP GOING DOWN THE ROAD AT 60 MPH IN HEAVY TRAFFIC WHAT IS GOING TO HAPPEN AM I GOING TO KEEP IT UNDER CONTROL.  *TR",
        "vin": "1GCVKRECOEZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK ENGINE COMPLETELY SHUT OFF WHILE DRIVING IN NORMAL TRAFFIC. COASTED TO SIDE OF THE ROAD AND RESTARTED THE TRUCK. CHECK ENGINE LIGHT WAS ON SOLID. TOOK TO A CHEVROLET DEALER WHO REFUSED TO WORK ON IT BUT TOLD ME THE 3 CODES SHOWING RELATED TO THE CAMSHAFT. DROVE THE TRUCK HOME AND IT FELT LIKE IT WAS MISFIRING AS IT WAS JERKING AROUND THE ENTIRE TIME. CHEVROLET HAD IT TOWED TO ANOTHER DEALER WHO SAID, AGAIN, THERE IS NOTHING WRONG. TOLD THEM THIS IS A CLEAR SAFETY ISSUE AND THE DEALERS ARE JUST CLEARING THE CODES BECAUSE THEY DO NOT WANT TO TAKE ON THE WARRANTY WORK. AWAITING RESOLUTION FROM GENERAL MOTORS. THEY TOLD ME FOR NOW, I JUST NEED TO DRIVE IT UNTIL IT HAPPENS AGAIN.   *TR",
        "vin": "1GCVKRECXEZ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT THE TRUCK, FIRST DAY OR TWO DROVE SLOW NO ISSUES. ONCE I GOT COMFORTABLE DRIVING AROUND 65-70 MPG I START TO GET A VIBRATION AND SHAKING TO THE POINT IT FEELS  NOT SAFE AT ALL. I LOOKED UP ON THE INTERNET AND TONS OF PEOPLE ARE HAVING THIS PROBLEM. TRUCK IS BRAND NEW TRUCK.  *TR",
        "vin": "1GCVKREC8EZ"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/06/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653207,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2014 CHEVROLET SILVERADO ON 7/11/14. ON THE WAY HOME I CALLED THE DEALER TO TELL THEM THAT IT HAD A BAD VIBRATION WHEN DRIVING AT HIGHWAY SPEEDS. THE FIRST REPAIR  WAS ATTEMPTED ON 7/25/14 WITH 1207 MILES. I HAVE HAD THE TRUCK BACK AT LEAST 8 TIMES FOR A REPAIR. THE DEALER HAS REPLACE TIRES. THEY HAVE BALANCED THE TIRES AT LEAST 6 TIMES THAT I KNOW ABOUT. THEY HAVE REPLACED THE DRIVE SHAFT. THE HAVE REPLACE THE RING GEAR AND PINION. REPLACED THE ENTIRE DIFFERENTIAL ( THEY SWAPPED IT FROM ANOTHER NEW TRUCK) THEY HAVE REPOSITIONED THE MOTOR MOUNTS. NOW THEY ARE WANTING  TO REPLACE THE REAR DIFFERENTIAL AGAIN. I HAVE BEEN PATIENT WITH THEM TRYING TO LET THEM FIX THE CONCERN. THEY HAVE A GENERAL MOTORS SERVICE ENGINEER INVOLVED AND HE HAS SEVERAL PARTS ORDERED FOR IT. THE DEALERSHIP HAD TALKED TO THEIR FACTORY REP AND AT ONE TIME THEY TALKED ABOUT GM BUYING THE TRUCK BACK AND GETTING ME ANOTHER TRUCK. I DON'T FEEL THE TRUCK I HAVE IS SAFE. IT HAS HAD THE WHEELS OFF MORE TIMES THAN I WOULD HAVE ROTATED MY TIRES IN 150000 MILES.   *TR",
        "vin": "3GCUKREC1EG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "10/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10652894,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS ENGAGES AT SLOW SPEEDS INCLUDING DRY CONDITIONS, LEADING TO TOTAL LOSS OF BRAKING AND INCREASED STOPPING DISTANCES.  *TR",
        "vin": "1GC1KXCGXEF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHEN SHIFTING INTO REVERSE, A LOUD NOISE EMITTED FROM THE TRANSFER CASE AND THE VEHICLE VIOLENTLY JERKED FORWARD. THE CONTACT MENTIONED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V614000 (POWER TRAIN). HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER SEVERAL TIMES AND, AFTER MULTIPLE REPAIRS, A TECHNICIAN FROM THE MANUFACTURER INDICATED THAT THEY WERE NOT ABLE TO REPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 12,000.",
        "vin": "1GCVKREC1EZ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2014",
        "dateOfIncident": "10/30/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651759,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED HEARING SOME TICKING. AND NO BIG DEAL THE NEXT DAY THE MOTOR JUST VIBRATED AND THEM STOPPED ACCELERATING, STARTED RATTLING. FREAKED ME OUT BIG TIME, I'VE ONLY HAD THE VEHICLE FOR ABOUT 2 MONTHS. I'M NO MECHANIC, BUT THIS AIN'T NORMAL. I FEAR THE WORST.  *TR",
        "vin": "3GCPCREC3EG"
    },
    {
        "components": "WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649412,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE HOME FROM DEALER ON HIGHWAY, VERY NOTICEABLE PULSING VIBRATION FELT IN GAS PEDAL ONCE I HIT 65MPH.  VEHICLE ALSO \"SHAKES\" AT A CONSTANT RATE AT 50MPH, AND MORE VIOLENTLY AT 82-85MPH.  DROVE UP TO 500 MILES PER DEALERS DIRECTION, PROBLEM STILL EXISTS AND HAS NOT GONE AWAY AT ALL.  *TR",
        "vin": "3GCUKREC1EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649416,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE HOME FROM DEALER ON HIGHWAY, VERY NOTICEABLE PULSING VIBRATION FELT IN GAS PEDAL ONCE I HIT 65MPH.  VEHICLE ALSO \"SHAKES\" AT A CONSTANT RATE AT 50MPH, AND MORE VIOLENTLY AT 82-85MPH.  DROVE UP TO 500 MILES PER DEALERS DIRECTION, PROBLEM STILL EXISTS AND HAS NOT GONE AWAY AT ALL.  *TR",
        "vin": "3GCUKREC1EG"
    },
    {
        "components": "STEERING,SUSPENSION,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/22/2014",
        "dateOfIncident": "07/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS A SHAKE AND VIBRATION IN THE SEATS, STEERING AND SUSPENSION AT INTERSTATE SPEEDS OF 65 MPH AND ABOVE ON SMOOTH ROADS IT HAS HAD THE SHAKE AND VIBRATION SINCE THE DAY I BOUGHT IT NEW.  *TR",
        "vin": "3GCPCREC1EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "09/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE FAILED TO ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE CONTACT SHIFTED THE VEHICLE INTO PARK AND THE VEHICLE RESUMED NORMAL OPERATION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 700.",
        "vin": "3GCUKREC2EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE FAILED TO CHANGE GEARS PROPERLY. THE DEALER STATED THAT THE FAILURE WAS NORMAL. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 2,400.",
        "vin": "3GCUKREC6EG"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "09/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT LOWER CUSHION ROCKS LEFT AND RIGHT AS WELL AS FRONT TO BACK.  TOOK VEHICLE IN TO DEALER ON 9/3/14 AND WAS FIXED ON 9/5/14.  THE SEAT FELT STURDY UPON PICK UP FROM DEALER.  HAVE DRIVEN APPROX 30 MILES SINCE PICKING UP ON 9/5/14.  SEAT IS NOW DOING SAME MOVEMENTS AS BEFORE.  I HAVE FILED A CLAIM WITH GM CUSTOMER CARE AND THEY STATE THERE IS NOT A FIX FOR THE SEATS AT THIS TIME.  I FEEL THIS IS A SAFETY HAZARD AND POTENTIAL CRITICAL FAILURE DURING A CRASH.  *TR",
        "vin": "3GCPCREC6EG"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2014",
        "dateOfIncident": "05/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED THIS VEHICLE IS HAS HAD A VIBRATION FROM 5-20, 40-50, AND 68-78. IT HAS BEEN IN THE SERVICE DEPARTMENT 4 TIMES FOR THIS PROBLEM ALONE WITH NO RESOLUTION. GENERAL MOTORS UNDERSTANDS THEIR IS AN ISSUE WITH THIS MODEL TRUCK BUT DOES NOT HAVE A SOLUTION. THE VIBRATION IS FELT IN THE SEAT, THE GAS PEDAL, THE STEERING WHEEL AND THE REST OF THE TRUCK. TIRES WERE INDEXED, ROTATED, AND BALANCED, ALONG WITH THE DRIVE LINE SPECIFICATIONS INSPECTED AND WERE FOUND WITHIN NORMAL LIMITS EVEN THOUGHT VIBRATION PERSISTS. OTHER ISSUES I HAVE HAD WERE THE EXHAUST SQUEAKING NOISES WHEN TRANSFERRING FROM V8/V4 MODE, IN WHICH THE ENTIRE EXHAUST SYSTEM WAS REPLACED, WATER LEAKING FROM THE SUNROOF AND WINDSHIELD, FRAME COATING PEELING OFF CAUSING THE FRAME TO RUST, THE SEAT FRAME SHIFTING, MOVING AND CLICKING WHEN TURNING THE VEHICLE, HD RADIO LOSES SIGNAL INTERMITTENTLY, RADIO AND HVAC KNOBS WERE NOT LIT, HEADLIGHTS WERE MISALIGNED FROM THE FACTORY, AND 4 OTHER RECALLS SUCH AS, OVERHEATED EXHAUST COMPONENTS, UNWANTED TRANSFER CASE SHIFT TO NEUTRAL, PEEK IN ODOMETER DISPLAY INCORRECT, AND TRANSMISSION OIL COOLER CONNECTIONS POSSIBLY BEING BAD. THIS VEHICLE CURRENTLY HAS 6500 MILES AND HAS BEEN IN THE SERVICE DEPARTMENT A TOTAL OF 30 DAYS SO FAR.   *TR",
        "vin": "3GCUKSEC0EG"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/11/2014",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631830,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 CHEVROLET SILVERADO.  CONSUMER WRITES IN REGARDS TO SERIOUS ISSUE WITH LIGHTS ON THE CLIMATE CONTROL KNOBS.  *SMD  THE CONSUMER STATED AT NIGHT, THE LIGHTS ON THE CLIMATE CONTROL KNOBS WOULD REFLECT IN THE REAR WINDOW AND BOUNCE BACK INTO THE INSIDE MIRROR MAKING IT IMPOSSIBLE TO SEE ANYTHING IN THE INSIDE REAR VIEW MIRROR. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/11/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER VEHICLE SITS IN HOT SUNLIGHT FOR EXTENDED PERIOD OF TIME, AND AC IS RAN-- THERE IS A LOUD \"POPPING NOISE\" FROM THE CENTER AREA OF THE DASH.  THE SOUND IS VERY SIMILAR TO A ROCK OR OBJECT HITTING THE WINDSHIELD.  THIS ISSUE HAS CONTINUED AND RECENTLY TOOK VEHICLE IN FOR OTHER RECALL ISSUE AND HAD THEM CHECK THIS.  THE SERVICE ADVISER FIRST TOLD ME THEY DUPLICATED THE ISSUE AND WOULD HAVE TO DISMANTLED THE DASH FOR FURTHER DIAGNOSTICS.  THE VEHICLE WAS IN THE SHOP FOR OVER A WEEK, AND THEY TOLD ME THE ISSUE SEEMED CORRECTED.  THE COMPLETED SERVICE TICKET INDICATES PROBLEM COULD NOT BE DUPLICATED OR DETERMINED.  THE DAY I DROVE HOME FROM THE SHOP THE VEHICLE MADE THIS SAME NOISE THREE TIMES.  I WILL BE TAKING VEHICLE TO DIFFERENT GM DEALER FOR FOLLOW UP.  *TR",
        "vin": "3GCUKSEC3EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/09/2014",
        "dateOfIncident": "08/27/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10631884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2014 CHEVROLET SILVERADO. WHILE IN THE PARK POSITION, THE VEHICLE ROLLED BACKWARDS AND KNOCKED DOWN THE CONTACT. A POLICE REPORT WAS FILED AND INJURIES WERE SUSTAINED. MEDICAL ATTENTION WAS RECEIVED. THE VEHICLE WAS RETURNED TO THE RENTAL OFFICE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 1,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER STARTING TRUCK AND DEPARTING TO LOCAL STORE I NOTICED A STRONG FUEL ODOR. AFTER DRIVING APPROXIMATELY 3-4 MILES MY GAS TANK WENT FROM 3/4 FULL TO NEARLY EMPTY, AROUND THE SAME TIME PASSERBY'S STARTED FLAGGING ME DOWN STATING THAT MY TRUCK WAS LEAKING FUEL AND SMOKING FROM UNDERNEATH. I IMMEDIATELY PULLED OVER TO CLOSEST PARKING LOT TO REALIZE THE TRUCK WAS MASSIVELY LEAKING FUEL FROM DIFFERENT AREAS AND WAS INDEED SMOKING AS IF IT WAS ABOUT TO CATCH FIRE. I TURNED THE TRUCK OFF AND MOVED AWAY. THE FUEL LEAK STOPPED AND THE SMOKE EVENTUALLY DISSIPATED. IT WAS BEEN TOWED BACK TO DEALER BY CHEVROLET ROAD SIDE AND IS CURRENTLY BEING CHECKED FOR THE PROBLEM.   *TR",
        "vin": "1GCRCPEH8EZ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/01/2014",
        "dateOfIncident": "07/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629864,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BAD VIBRATION ,I TOOK IT TO DEALER AND THEY TOLD ME THAT IT WAS NORMAL BUT ITS NOT .I HAVE CALL GM 3 TIMES AND EMAIL BUT THEY DO NOTHING.  *TR",
        "vin": "1GCRCREC9EZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2014",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626048,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 14V301000 (ELECTRICAL SYSTEM: SOFTWARE, SEAT BELTS:FRONT:WARNING LIGHT/DEVICES). THE DEALER UPDATED THE RADIO SOFTWARE. AFTER THE RECALL REPAIR WAS PERFORMED, THE ENTIRE ELECTRICAL SYSTEM BEGAN TO MALFUNCTION. THE VEHICLE WAS NOT REPAIRED AGAIN. THE APPROXIMATE FAILURE MILEAGE WAS 4,913.",
        "vin": "3GCPCPEH8EG"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/15/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME ON MY BRAND NEW 2014 SILVERADO HAS MAJOR RUST ISSUES,  CHEVY DEALERS SAY OH IT'S NORMAL. IT'S NOT NORMAL FOR A VERY EXPENSIVE TRUCK TO RUST WHILE SITTING ON A LOT. I'M NOT SURE IT WILL BE SAFE IN A FEW YEARS AT THE RATE IT'S RUSTING.  THIS IS A BIG ISSUE ON SEVERAL PLACES ON THE NET.  *TR",
        "vin": "1GCVKREH5EZ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 CHEVROLET SILVERADO.  CONSUMER WRITES IN REGARDS TO IMPROPERLY FUNCTIONING AIRBAGS.  *SMD  THE CONSUMER STATED THE VEHICLE WAS TAKEN TO THE DEALER THREE TIMES, ALL WITHIN THE MONTH OF JUNE FOR THE SAME SAFETY ISSUE REGARDING THE AIR BAGS. JUNE 3, 2014, THE CONSUMER WAS TOLD UPON PICKING UP THE VEHICLE, THE AIR BAG WIRES UNDER THE SEAT HAD JUST BEEN DISCONNECTED. THEY SAID IT WAS A SIMPLE FIX OF PUSHING THE WIRES BACK TOGETHER. ON JUNE 17, 2014, WHEN THE CONSUMER PICKED UP THE VEHICLE, THE CONSUMER WAS INFORMED THE WIRES WERE FRAYED. ON JUNE 20, 2014, THE AIR BAG LIGHT ILLUMINATED, AND THE VEHICLE WAS RETURNED TO THE DEALER. *JB",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/03/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619602,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD SHAKE AT HIGHWAY SPEEDS, BALANCING TIRES DIDN'T HELP, FAULTY STEERING COMPONENTS COULD BE A SAFETY ISSUE.",
        "vin": "1GCVKREC5EZ"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607936,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE VIBRATIONS AT SPEEDS BETWEEN 58-70 MPH.  VIBRATIONS PULSATE.  VIBRATIONS TRAVEL THROUGH FLOOR BOARDS STEERING WHEEL AND GAS PEDAL. TRUCK WAS TAKEN TO DEALERSHIP.  TIRES WERE ROTATED AND BALANCED   DRIVE SHAFT WAS DETERMINED TO BE THE PROBLEM. NEW DRIVE SHAFT WAS ORDERED.  DRIVE SHAFT INSTALLED YESTERDAY.  THE VIBRATIONS IS WORSE.  TAKEN BACK TO DEALERSHIP TODAY.  TRIP NUMBER THREE TRUCK HAS ONLY 1400 MILES ON IT. INFORMED GM. THEY SENT ME BACK TO THE DEALERSHIP WITH NO SOLUTION.    *TR",
        "vin": "3GCUKPEC2EG"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/29/2014",
        "dateOfIncident": "09/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606754,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING THE SEAT POPS AND MOVES IN THE DIRECTION YOU ARE TURNING. THE DEALER COULD NOT DUPLICATE. I ADDRESSED IT AGAIN 7-8 MONTHS LATER AND THE DEALER STATED THERE IS NO FIX. THEY SAID IT ONLY HAPPENS WHEN THE SEAT IS IN THE TOP ADJUSTMENT POSITION, THIS IS INCORRECT, IT HAPPENS AT ALL ADJUSTMENTS AS I HAVE TRIED THEM ALL. NEEDLESS TO SAY, THIS WILL GET YOUR ATTENTION ENOUGH TO THINK SOMETHING IS HAPPENING AND YOU JUST CANNOT GET USED TO IT ALMOST A YEAR LATER. IT SCARED MY WIFE AND DAUGHTER ENOUGH TO WHERE THEY WILL NOT DRIVE IT ANY LONGER.  *TR",
        "vin": "3GCPCSEC9EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2014",
        "dateOfIncident": "09/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606756,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORWARD COLLISION ALERT SYSTEM IS NOT SAFE. I HAVE HAD THIS GO OFF ON ME OVER 100 TIMES IN 25,000 MILES AND ALMOST CAUSING AN ACCIDENT A FEW TIMES. THE LED ON THE DASH WILL FLASH AND THE SEAT WILL VIBRATE CAUSING YOU TO REACT THINKING YOU ARE GETTING READY TO HIT SOMETHING.   THIS OCCURS IN 3 SITUATIONS:  1)  APPROACHING AN UNDERPASS WHILE THE SUN IS SHINING INTO THE WINDSHIELD, WHICH IS DAILY FOR ME DURING MY COMMUTE. 2) IN A LANE ON THE HIGHWAY CLOSEST TO THE BARRIER WALL, IT THINKS YOU ARE GOING TO HIT IT HEAD ON I GUESS. 3) ON A 2 LANE SIDE ROAD WITH APPROACHING CARS ARE THE ARE PASSING BY ON YOUR DRIVERS SIDE. I HAVE NOT BEEN ABLE TO DETECT IF THIS IS DUE TO THE SUNSHINE OR HEAD LIGHTS. SO THIS CAUSES A MAJOR ALERT REACTION TO YOU EACH TIME, THIS IS A BIG SAFETY ISSUE AS A REACTION TO NOTHING BUT ALERTS CAN CAUSE AN ACCIDENT IN ITSELF.  *TR",
        "vin": "3GCPCSEC9EG"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2014",
        "dateOfIncident": "06/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605046,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE 15 MILES TO STORE. SHOPPED. STARTED HOME ENGINE LIGHT CAME ON. TCL LIGHT STAYING ON AND TRUCK SHAKING WILL BARELY RUN.  *TR",
        "vin": "3GCUKREC3EG"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M REALLY DISAPPOINTED IN HOW MY TRUCK IS RUSTING.  IT HAS THE AMOUNT OF RUST THAT I WOULD EXPECT TO SEE ON A TRUCK AFTER 7 - 10 YEARS.  THE TRUCK'S UNDERBODY INCLUDING THE FRAME IS RUSTING EVERYWHERE.  FOR A TRUCK THAT HAS ONLY 6,000 MILES ON IT THIS IS RIDICULOUS.  WHATEVER WAS SPRAYED ON THE FRAME IS JUST PEELING OFF IN CHUNKS.  I HAD THE DEALERSHIP IN ANOKA, MAIN MOTORS LOOK AT THIS WHEN I GOT AN OIL CHANGE TODAY AND THEY AGREED THE RUST IS EXCESSIVE BUT GM HAS TOLD THEM TO DO NOTHING ABOUT IT BASED ON PI0281D.  GM CLAIMS THIS IS SUPPOSED TO BE THE MOST RUST RESISTANT TRUCK EVER.  *TR",
        "vin": "3GCUKREH0EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 40MPH, THE VEHICLE STALLED AND NO WARNINGS LAMPS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT STATED THAT SHE WAS ABLE TO RESTART VEHICLE. THE RENTAL CAR COMPANY WAS MADE AWARE OF THE FAILURE, HOWEVER NO SOLUTION WAS OFFERED. THE APPROXIMATE FAILURE MILEAGE WAS 2,000.",
        "vin": "3GCUKREH3EG"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599029,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE & SISTER WERE RUN OFF THE ROAD . THEY WENT UP A DITCH & HIT A COLVURT . THE SEATBELTS DID NOT LOCK IN PLACE & AIR BAGS DID NOT INFLATE . THIS WAS A LOANER TRUCK FROM DEALER . IT WAS A 2014 4 DOOR CHEVY SILVERADO FROM LUCAS CHEVY IN COLUMBIA TN. 38401 . I THINK THE WAS SOME SORT OF TROUBLE WITH THIS HAPPENING . PLEAS CALL FOR COMPLETE INFO ON THIS .  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2014 CHEVROLET SILVERADO.  THE CONTACT STATED THAT WHILE DRIVING AT LOW SPEEDS, THE TRANSMISSION JUMPED AND SURGED WITH OUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN STATED THAT WHAT THE VEHICLE WAS WORKING UP TO STANDARDS.   THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  UPDATED 10/7/14*CN",
        "vin": "3GCUKSEC5EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/03/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595846,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS SHAKING ON THE HIGHWAY AT NORMAL HIGHWAY SPEEDS. IT MAKES FOR POOR CONTROL OF THE VEHICLE. IT IS A BRAND NEW CHEVROLET SILVERADO HIGH COUNTRY. IT HAS BEEN SERVICED 3 TIMES AND THE DRIVETRAIN HAS BEEN BALANCED, THE TIRES REPLACED, FORCED BALANCED THE WHEELS, REPLACED THE TIRES AND STILL THE PROBLEM PERSISTS. IT CAUSES LANE WANDER AND DOES NOT FEEL SAFE AT NORMAL SPEED.  *TR",
        "vin": "3GCUKTEC9EG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I DON'T LIKE THE AUTO LOCKS ON ALL THE DOORS. IF YOU DON'T PUT THE TRUCK IN PARK, THE DOORS WILL NOT UNLOCK, AND IF THE KIDS PULL THE HANDLE BEFORE I PUT IN PARK, YOU HAVE TO GO OUTSIDE THE TRUCK AND OPEN THE DOOR. I HAVE TURNED OFF ALL THE LOCKS AND IT STILL DOES IT, AND THE DEALERSHIP SAYS THAT IS JUST THE WAY THEY ARE MADE NOW. IF I WAS IN AN ACCIDENT AND THE CAR WAS STILL IN GEAR, MY KIDS WOULD BE TRAPPED IN THE TRUCK, BECAUSE EVEN HITTING THE UNLOCK BUTTONS WILL NOT OPEN THE DOORS. THIS IS VERY CONCERNING, I CAN'T EVEN DROP THE KIDS OFF AT SCHOOL IN THE LINE BECAUSE I HAVE TO PUT THE TRUCK IN PARK   IN ORDER FOR THE DOORS TO UNLOCK AND THAT IS AFTER I HIT THE UNLOCK BUTTON TO GET THEM TO UNLOCK. THIS IS VERY SCARY TO MY WIFE AND I. WHAT CAN BE DONE? THANKS.   *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/25/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY MAY 23, 2014, I WAS BACKING AN EMPTY BOAT TRAILER DOWN MY PRIVATE BOAT LAUNCH WITH MY NEW 2014 CHEVROLET SILVERADO 1500 PICKUP.  WHEN I PUT THE TRANSMISSION INTO REVERSE WITH MY FOOT ON THE BRAKE THE ENGINE SUDDENLY REVVED UP, STARTED SPINNING WHEELS, AND SHOT DOWN THE RAMP HITTING THREE BULKHEAD PILINGS EIGHT FEET APART, FINALLY WEDGING THE TRUCK INTO THE LAST PILING AND STOPPING BEFORE GOING INTO THE WATER.  THE INCIDENT LASTED LESS THAN FIVE SECONDS AND MY FOOT NEVER LEFT THE BRAKE AS WITNESSED BY A THIRD PARTY VERIFYING THE BRAKE LIGHTS NEVER WENT OFF.     I FEEL OBLIGATED TO REPORT THIS TO BOTH CHEVROLET AND THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION. HAD THIS OCCURRED IN A PUBLIC PARKING AREA, SERIOUS INJURIES AND DAMAGE TO OTHER VEHICLES COULD HAVE RESULTED.  AN INSURANCE CLAIM HAS BEEN MADE, AND AFTER REPAIRS HAVE BEEN COMPLETED, THE VEHICLE WILL BE TAKEN TO MY CHEVROLET DEALER FOR ANALYSIS FOR POSSIBLE DEFECTS.  *TR",
        "vin": "3GCPCSEC4EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2014",
        "dateOfIncident": "05/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTUP, MY TRUCK'S CHECK ENGINE LIGHT ILLUMINATED.  THE CAR WAS RESTARTED AND THE LIGHT DID NOT CLEAR.  CAR WAS TAKEN TO DEALER AT 10,383 MILES.  THEY CHECKED THE CODES AND RECEIVED A HARD CODE P0420 BANK 1, CATALYTIC CONVERTER FAILURE.  THE CATALYTIC CONVERTER WAS REPLACED AND THE CODES CLEARED OUT.    MAINLY REPORTING THIS BECAUSE THE TRUCK IS FOUR AND A HALF MONTHS OLD AND HAS 10,383 MILES UPON FAILURE.  CATALYTIC CONVERTERS SHOULD LAST LONGER.   *TR",
        "vin": "3GCPCREC1EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2014",
        "dateOfIncident": "05/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS IN A TURN LANE FOLLOWING A VEHICLE GOING SLIGHTLY UPHILL ROLLING UP TO AN INTERSECTION TO MAKE A LEFT.  THE VEHICLE IN FRONT OF ME MADE THEIR TURN AND WHILE I WAS STILL ROLLING I CHECKED ONCOMING TRAFFIC.  THERE WAS A VEHICLE COMING IN THE OTHER DIRECTION, BUT I TOO HAD TIME TO MAKE THE TURN IN FRONT OF THE ONCOMING VEHICLE.  I STEPPED ON THE ACCELERATOR AND IT DID NOTHING FOR WHAT SEEMED LIKE A HALF OF A SECOND BEFORE FINALLY ACCELERATING.  IT WAS AS IF IT WAS THE OLD DAYS WHEN WE HAD A BADLY TUNED CARBURETOR AND THE ENGINE BOGGED BEFORE FINALLY TAKING OFF.  ONLY, THE TRUCK DOESN'T BOG, IT JUST DOESN'T RESPOND AS QUICKLY AS IT SHOULD ALL THE TIME.    I HAD THE VEHICLE IN \"DRIVE\" SO PERHAPS IT WAS RUNNING IN V4 AND/OR IN THE MIDDLE OF A TRANSMISSION SHIFT OR DOWNSHIFT.  REGARDLESS, AN ACCELERATOR THAT DOES NOT RESPOND THE SAME WAY EVERY TIME BUT VARIES DEPENDING ON DRIVING CONDITIONS IS IN MY OPINION DANGEROUS.  *TR",
        "vin": "1GCVKREC0EZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/17/2014",
        "dateOfIncident": "01/05/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583261,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT THE VEHICLE WOULD STALL WHEN THE GEARS WERE SHIFTED. THE VEHICLE WAS ABLE TO BE RESTARTED AND WAS NOT TAKEN TO THE DEALER FOR INSPECTION OR REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 4,000.",
        "vin": "3GCUKSEC2EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/05/2014",
        "dateOfIncident": "03/30/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOUR WHEEL DRIVE SYSTEM BROKE, THE YOKE OR UNIVERSAL JOINT GAVE OUT AT THE FRONT DIFFERENTIAL. THE DEALER AND GENERAL MOTORS ARE SAYING IT HAD TO BE DUE TO WORKING THE TRUCK TO HARD, OR BEYOND THE ABILITIES OF THE TRUCK. NO ONE TOOK ANY STEPS TO SEE IF ANY OF THESE PARTS HAD A DEFECT, THE QUESTION OF A POSSIBLE DEFECTED PART WAS RAISED, AND QUICKLY DISMISSED!!!!!! THIS MY WARNING TO ANY ONE WHO IS THINKING OF BUYING A GM TRUCK. DO YOU REALLY HAVE ANY WARRANTY COVERAGE?  *TR",
        "vin": "1GC1KXCG4EF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "02/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575813,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED WHILE DRIVING NO PARTICULAR SPEED THE TRANSMISSION TEMPERATURE GAUGE BEGAN TO INCREASE UP TO TWO HUNDRED AND FIFTEEN DEGREES WITHOUT WARNING.  THE VEHICLE WAS TAKEN TO THE DEALER WHO DID NOT DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE VIN WAS UNAVAILABLE.  THE APPROXIMATE FAILURE MILEAGE WAS 3,500.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "01/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTE:  THE TRUCK WOULD NOT CRANK TWO TIME BEFORE I STARTED TAKING IT TO THE DEALER ON THE FOLLOWING DATES.  1/21/14 TRUCK WOULD NOT CRANK, THE SEVICE DEPTMENT COULD NOT FIND ANYTHING WRONG  3/17/14 TRUCK WOULD NOT CRANK, TOWED TO DEALER, FOUND BODY CONTROL MODULE NOT WORKING PROPERLY  3/24/14 TRUCK WOULD NOT CRANK, TOWED TO DEALER, FOUND BODY CONTROL MODULE NOT WORKING PROPERLY  THIS IS GETTING OLD!!  *TR",
        "vin": "3GCPCREC3G1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "01/30/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568469,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 CHEVROLET SILVERADO.  CONSUMER WRITES IN REGARDS TO MALFUNCTION OF PEDAL ADJUSTMENT.  *SMD  THE CONSUMER STATED THE CARGO LIGHT BUTTON AND PEDAL ADJUSTMENT BUTTON DID NOT WORK, ONLY A DAY AFTER PURCHASING THE VEHICLE. THE CONSUMER AND HER HUSBAND THEN DECIDED TO TAKE A DRIVE. WHEN HER HUSBAND PUT THE TRUCK IN REVERSE, AND LIKE HE ALWAYS DID, HE SLOWLY TOOK HIS FOOT OFF THE BRAKE, AND LET THE TRUCK IDLE BACKWARDS. HOWEVER, WHEN HE DID, THE BRAKE PEDAL IMMEDIATELY ADJUSTED UP FOR A VERY SHORT PERSON AND THE ACCELERATOR PEDAL WENT TO THE FLOOR, AND THE VEHICLE SHOT OUT OF THE GARAGE VERY FAST. THE CONSUMER WAS INFORMED BOTH PEDALS ADJUSTED TOGETHER, BUT THAT WASN'T THE WAY IT SEEMED. HE IMMEDIATELY TRIED TO HIT THE BRAKE, BUT IT WAS ADJUSTED UP SO HIGH, HE COULDN'T GET HIS FOOT ON IT, UNTIL THEY WERE ALMOST THROUGH THE CARPORT AND THE VEHICLE STRUCK ONE OF THE STEEL POSTS OF THE CARPORT, DOING SEVERAL THOUSANDS DOLLARS OF DAMAGE. THE NEXT MORNING, THE VEHICLE WAS TOWED TO THE DEALER, FOR AN INSPECTION. THE NEXT DAY, THE DEALER CALLED, STATING THEY WERE UNABLE TO FIND A PROBLEM.   ALSO, THE NAVIGATION SYSTEM WOULD NOT SAVE AN ADDRESS. UPDATED 03/27/14",
        "vin": "1GCVKSEC0EZ"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/02/2014",
        "dateOfIncident": "03/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT THE HEATER DOESN'T WORK IN THE TRUCK WHEN IT IS COLD OUTSIDE.  TODAY IT IS 23 DEGREES AND IT DIDN'T WORK. SEEMS THE LOWER THE SPEED OF THE FAN THE WARMER THE AIR IS. IT ACTUALLY WARMED UP IN THE TRUCK WHILE DRIVING WHEN THE FAN SPEED WAS OFF.   *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2014",
        "dateOfIncident": "02/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566564,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED OUT OF A PARKING LOT ON TO A CITY STREET AND PRESSED THE GAS PEDAL A LITTLE, PLANNING TO GET UP TO ABOUT 25 MPH BECAUSE THERE WAS A RED LIGHT A BLOCK AWAY.  THE TRUCK RESPONDED AS IF I HAD FLOORED THE PEDAL.  I TOOK MY FOOT OFF OF THE PEDAL AND THE TRUCK KEPT ACCELERATING AT FULL THROTTLE.  I HIT THE BRAKES THINKING THE CRUISE CONTROL HAD GONE NUTS, BUT HITTING THE BRAKES WOULD NOT TURN IT OFF.  IT KEPT ACCELERATING WITH THE TACH OVER 5000.  I SHIFTED TO NEUTRAL AND THE ENGINE SPEED DROPPED DOWN TO IDLE.     THE LIGHT TURNED GREEN AND I SHIFTED BACK TO DRIVE AND THE ENGINE IMMEDIATELY STARTED ACCELERATING AGAIN AT FULL THROTTLE.  I PUT IT BACK IN NEUTRAL, MOVED OVER TO THE SHOULDER AND TURNED THE KEY OFF.  THEN I STARTED THE ENGINE AGAIN AND THE PROBLEM DISAPPEARED.  I'M 72; IF MY WIFE HAD BEEN DRIVING BY HERSELF, SHE PROBABLY WOULD HAVE HAD A SERIOUS WRECK.  THE TRUCK IS A 2014 SILVERADO, BOUGHT 4 WEEKS AGO, 6 CYLINDER WORK TRUCK.  *TR",
        "vin": "3GCPCPEH9EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2014",
        "dateOfIncident": "02/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565496,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A BRAND NEW  2014 CHEVROLET SILVERADO 1 WEEK AGO TODAY. THE VEHICLE WAS DELIVERED 2 DAYS AGO.  THE CHEVROLET  DEALER  DID NOT INFORM ME OF THE RECALL FOR POSSIBLE ENGINE FIRE. I CHECKED MY VIN NUMBER ONLINE  AND IT SHOWS THAT MY VEHICLE HAS BEEN RECALLED ABOUT A MONTH AGO AND IT STILL HAS A WARNING FOR NOT BEING SERVICED AS PER  CHEVROLET AND NHTSA WEBSITES.  BASICALLY, THE CHEVROLET DEALER SOLD ME A NEW VEHICLE ON RECALL AGAINST THE COMPANY  POLICY,   DOCUMENT DCS3115 (NOTICE TO DEALERS),  AS POSTED ON THIS WEBSITE .  THE DEALER DID NOT INFORM ME  IF THERE WAS ANY REPROGRAMMING DONE AS REQUIRED BY THE MANUFACTURER.  I CALLED THE  GENERAL SALES MANAGER WHO KNOWS MY VEHICLE  TODAY AND HE DID NOT KNOW ABOUT THE RECALL AT ALL AND STATED HE GET BACK TO ME .  ACCORDING TO GM CUSTOMER CARE AND AFTERSALES ON YOUR WEBSITE , ALL CHEVROLET AND GM DEALERS WERE SENT AND URGENT  STOP DELIVERY ORDER  ON JANUARY 10, 2014 ADDRESSED TO THE DEALER, GENERAL MANGERS, NEW VEHICLE SALES MANAGERS AND SERVICE MANAGERS  TO STOP DELIVERY OF THE CHEVROLET SILVERADO AND TO REPROGRAM THEM PRIOR TO SALES.  IN THE MEAN TIME I AM STUCK WITH THIS VEHICLE AND DO NOT KNOW WHETHER IT WAS SERVICED  OR WHETHER IT IS AT RISK OF CATCHING FIRE.  THIS HAS SHOWN LACK OF CONFIDENCE IN CHEVROLET AND ITS LOCAL DEALER IN  COMMUNICATION, TRUST, AND CONFIDENCE. IT HAS PLACED ME AND MY FAMILY AT RISK. IT HAS VIOLATED THEIR RESPONSIBILITY OF DISCLOSURE TO THE CUSTOMER AND HAS BEEN NEGLIGENT IN ITS POLICIES AND PROTOCOL IN THE HANDLING OF RECALL AS MANDATED BY ITS CUSTOMER POLICIES GM CUSTOMER CARE   DSC3115 AND US DEPARTMENT OF TRANSPORTATION NHTSA  MOTOR VEHICLE SAFETY TITLE 49, UNITED STATES CODE CHAPTER 301  OF MAY 2013, OFFICE OF THE CHIEF COUNSEL.    PLEASE INVESTIGATE .  *TR",
        "vin": "1GCNKPECXEZ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/02/2014",
        "dateOfIncident": "12/10/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS VIBRATION, MORE NOTICEABLE AT HIGHER SPEEDS. THE VIBRATION COMES UP THROUGH THE STEERING WHEEL AND ALSO CAN BE FELT THROUGH THE GAS PEDAL. THE WHEELS/TIRES ARE SUSPECT, AND I AM CONCERNED ABOUT A SLIPPED BELT AND SUBSEQUENT TIRE FAILURE. THIS HAS BEEN REPORTED TO THE DEALER WHO STATES \"VIBRATION IS NORMAL\".    *TR",
        "vin": "1GCVKREC4EZ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/14/2014",
        "dateOfIncident": "01/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE FREEWAY AT 70 MPH AND THE KID IN THE BACK OF THE CREWCAB PICKUP OPENED THE REAR DOOR. THE TRUCK LOCKS THE DOORS WHEN IT IS PUT INTO DRIVE. BUT WHEN HE PULLED ON THE DOOR LATCH IT OPENED UP.   I THOUGHT THE DOORS ARE NOT SUPPOSED TO OPEN WHILE THE VEHICLE IS MOVING.  WHEN I TESTED THIS AT HOME, WITH THE TRUCK RUNNING AND IN DRIVE, ANY OF THE DOORS WILL OPEN UP ON THE 2ND PULL ON THE LATCH. THE 1ST PULL UNLOCKS THE DOOR AND ON THE 2ND PULL IT OPENS THE DOOR.  I HAVE HAD MANY OTHER TRUCKS AND THEY NEVER DID THIS. SEEMS LIKE A SAFETY ISSUE TO ME. CAN YOUTELL ME IF THE NHTSA HAS ANY SAFETY RULES ON THIS?  I CALLED THE DEALER AND TALKED WITH THE SERVICE ADVISOR AND HE CONFIRMED THAT OTHER 2014 SILVERADOS DO THIS TO, SO HE HAD NO FIX FOR IT. THERE IS A CHILD LOCK OUT SWITCH FOR THE READ DOORS, BUT THAT WOULD HAVE TO BE MANUALLY SET EVERY TIME YOU PUT IT IN DRIVE AND WOULD NOT LOCK EITHER OF THE FRONT TWO DOORS.    PLEASE LET ME KNOW IF THERE IS A SAFETY RULE FOR THIS.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3GCUKREC9EG"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/05/2014",
        "dateOfIncident": "01/05/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUND THAT THE REAR HEAD RESTRAINTS IN THE CREW CAB WOULD NOT RAISE HIGH ENOUGH TO PROTECT AN ADULT SIZE PERSON'S HEAD FROM HITTING THE GLASS OR GETTING A SEVERE NECK INJURY IN A REAR END COLLISION. THIS IS A DESIGN FLAW FOR A VEHICLE MARKETED AS A PEOPLE MOVER. I HAVE ISSUED COMPLAINTS TO CHEVY VIA WEB AND LETTER. OLDER TRUCK (2005) DIDN'T HAVE THIS FLAW IN SAFETY AS THE HEAD RESTRAINTS COULD BE RAISED SIGNIFICANTLY HIGHER. THIS VEHICLE SHOULD BE RECALLED AND A FIX MANDATORY.  *TR",
        "vin": "3GCUKREC5EG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/20/2013",
        "dateOfIncident": "11/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHEVROLET SILVERADO. THE CONTACT STATED THAT THE WINDSHIELD SUDDENLY BECAME FOGGY. THE CONTACT ACTIVATED THE DEFROSTER BUT IT ONLY CLEARED THE DRIVER'S SIDE OF THE WINDSHIELD. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION HOWEVER, THEY WERE UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 4,600.",
        "vin": "3GCUKREC8EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/14/2013",
        "dateOfIncident": "08/18/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2014 SILVERADO CREW CAB LTZ Z71 ON AUGUST 16.   ALMOST IMMEDIATELY IT BEGAN HAVING ISSUES WITH THE SAFETY SYSTEMS THAT WERE EXTRA MODULES ON THIS VEHICLE.  PARKING ASSIST SENSORS DO NOT WORK CONSISTENTLY, LANE DEPARTURE WARNING SYSTEM FAILS TO INITIALIZE OR OPERATE CONSISTENTLY AND DOWNHILL GRADE BREAKING SYSTEM FAILS TO INITIALIZE OR OPERATE CONSISTENTLY, FORWARD COLLISION WARNING SYSTEM FAILS TO INITIALIZE AND OPERATE CONSISTENTLY.  (I HAVE PHOTOGRAPHS OF THE SAFETY FEATURES FAILING).    IN ADDITION, THE HEATED/COOLED SEATS (DRIVER SIDE) OVERHEATS WITH DRIVER WEIGHING 280 LBS - CAUSING REAR VENT /EXHAUST COVERS TO SEPARATE FROM THE SEAT.     SEAT GETS VERY HOT- PASSENGERS IN BACK OF VEHICLE COMPLAIN ABOUT EXTREME HEAT (AGAIN PHOTOGRAPHED FAILURES)    FAILURES WITH SAFETY SYSTEM FUNCTIONALITY ARE DESCRIBED BY MULTIPLE OWNERS OF THE SAME MODEL TRUCK (LTZ) THAT I PURCHASED.    SAME PROBLEMS ARE DESCRIBED THROUGHOUT THIS THREAD   HTTP://WWW.GM-TRUCKS.COM/FORUMS/TOPIC/152662-ANY-NEW-2014-SILVERADO-OWNERS-HAVING-ISSUES-WITH-THEIR-TRUCK    TOOK TO DEALERSHIP- THEY KEPT FOR TWO DAYS.   UNABLE TO REPRODUCE PROBLEMS.  BCM AND INFOTAINMENT CENTER UPDATES FAILED TO RESOLVE.     HEATED/COOLED SEAT OVERHEATING WAS NOT RESOLVED- HOWEVER, I DUPLICATED IT IMMEDIATELY UPON DEPARTING FROM THE DEALERSHIP.  MILEAGE IS NOW 4300 MILES WITH SAME PROBLEMS.    GM CASE [XXX] WAS OPENED ON 9/9/13 AND ALL ISSUES REMAIN UNRESOLVED AFTER BCM UPDATE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3GCUKSEC4EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/05/2013",
        "dateOfIncident": "07/29/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 5,
        "odiNumber": 10533778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A RED LIGHT WHEN MY VEHICLE WAS REAR ENDED    LOCAL POLICE ESTIMATED OTHER VEHICLE'S SPEED TO BE 45-50MPH UPON IMPACT.  *TR",
        "vin": "3GCUKREC0EG"
    }
]