[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204075,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMERA INTERMITTENTLY CUTS ON AND OFF. AT TIMES WHEN IT DOES COME BACK IN THE IMAGE IS INVERTED. THE PICTURE IS CLEAR BUT EVERYTHING IN IT IS ON THE WRONG SIDE. I ALMOST HIT A CAR BECAUSE THE CAMERA SHOWED IT ON MY LEFT BUT THE CAR WAS ACTUALLY ON MY RIGHT. CAMERA ALMOST ALWAYS MALFUNCTIONS WHILE REVERSING. IS NOW AN ONGOING ISSUE. BROUGHT IT TO THE DEALERSHIP WHILE UNDER WARRANTY AND WAS TOLD NOTHING WAS WRONG WITH IT.",
        "vin": "2C3CCAKT0EH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "09/23/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204076,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION COMPLETELY DISENGAGED WHILE DRIVING ON THE FREEWAY, OK TWO SEPARATE OCCASIONS CAUSING THE CAR TO HAVE TO COME TO A COMPLETE STOP BE CUT OFF AND RESTARTED IN ORDER TO RE-ENGAGE TRANSMISSION.",
        "vin": "2C3CCAKT0EH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195678,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE 215 FREEWAY IN HEAVY TRAFFIC WHEN ALL OF A SUDDEN MY CAR LOST POWER-ICOASTED DANGEROULY TO THE SIDE OF THE FREEWAY, A WARNING LIGHT \"ELECTRONIC THROTTLE CONTROL\" CAME ON. AFTER AWHILE IT WENT OFF. AS SOON AS I GOT BACK ON THE FREEWAY IT HAPPENED AGAIN.THE SECOND TIME I ALMOST GOT HIT BY SEVERAL OTHER VEHICLES.  AFTER AWHILE THE WARNING LIGHT WENT OFF AND I RESUMED DRIVING.I TOOK MY CAR TO THE CHRYSLER DEALER IN TEMECULA CA AND AFTER INSPECTION THEY SAID IT WAS MY FAULT BECAUSE I HIT THE ACCELERATOR WHILE MY FOOT WAS STILL ON THE BRAKE OR VICE-VERSA. AND SO THEY CHARGED ME $183 TO TELL ME THAT.  THIS HAS NEVER HAPPENED WITH ANY CAR I HAVE DRIVEN. THE DEALER SAYS ITS AN ISSUE WITH THE NEWER 300 MODELS. NO WARNING ANYWHERE IN MANUAL OR CAR.  THIS IS A LIFE-THREATING ISSUE THAT MUST BE ADDRESSED AND CHRYSLER MOTORS IS IGNORING IT.  PLEASE DO SOMETHING ABOUT THIS SERIOUS ISSUE. A RECALL MUST BE MADE BEFORE SOMEONE IS KILLLED!",
        "vin": "2C3CCAEG3EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189734,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA FLICKERS AND SHOWS A MIRROR FLIP IMAGE OF WHAT EXACTLY IS THERE.  IT IS NO LONGER A RELIABLE SAFETY ACCESSORY.  MANY OWNERS IN DIFFERENT CHRYSLER CAR GROUPS REPORT COMPLETE FAILURE AND ISSUES WITH THEIR BACKUP CAMERAS.  THIS IS A CONSTANT PROBLEM.",
        "vin": "2C3CCABT4EH"
    },
    {
        "components": "POWER TRAIN,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "02/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176104,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN PARK MY VEHICLE ROLLED BACKWARDS TO THE BOTTOM OF MY DRIVEWAY. I WAS ABLE TO MAKE IT HAPPEN MULTIPLE TIMES. I WAS ABLE TO HAVE MY WIFE RECORD IT ON VIDEO FROM BOTH SIDES OF THE VEHICLE. IT HAPPENED WHEN PARKING PARTIALLY ON ICE. THE PASSENGER REAR TIRE TURNED AGAINST THE ROLL OF THE VEHICLE. ALL 3 OTHER TIRES ROLLED WITH THE VEHICLE. MY VEHICLE HAS THE HEMI 5.7L, 5 SPD TRANSMISSION, AWD, AND MY SHIFTER IS NOT THE DIAL TYPE BUT A REGULAR SHIFTER TYPE. IS THE PASSENGER REAR TIRE THE ONLY ONE THAT KEEPS THE VEHICLE FROM ROLLING REARWARD WHILE IN PARK? I CAN PROVIDE THE VIDEO EVIDENCE.",
        "vin": "2C3CCAJT1EH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123603,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I LOCK MY DOORS AND WALK AWAY THEY REOPEN BY THEMSELFS. THIS HAPPENS WHILE PARKED.",
        "vin": "2C3CCAKG8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "07/06/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122074,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MODULAR FOR THE BACK UP CAMERA IS NOT WORKING.",
        "vin": "2C3CCAKG3EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "09/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031456,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ADJUSTING THE PEDALS WHILE DRIVING ON THE ROAD, USING THE SWITCH MOUNTED ON THE DRIVERS SEAT, THE PEDALS WENT DOWN TOWARD THE FLOOR AND THE ENGINE'S RPM INCREASED. I DIDN'T NOTICE WHAT WAS HAPPENING AT FIRST AND THEN THE ENGINES RPM INCREASED AND THE VEHICLE SPEED JUMPED TO 75 MPH. I TRIED BAKING AND THE CAR SLOWED DOWN TO 45 MPH. SINCE I WAS IN A 35 MPH ZONE AND WAS APPROACHING A CAR AHEAD OF ME I PUT THE CAR IN NEUTRAL AND THE ENGINE RPM INCREASED VERY HIGH. I CAN'T SAY HOW HIGH IT WENT AS I WAS BUSY TRYING TO FIGURE OUT WHAT WENT WRONG AND WHAT TO DO ABOUT IT. I TURNED INTO A PARKING LOT AND SHUT THE ENGINE OFF. I STARTED THE CAR AGAIN AND THE ENGINE RPM SHOT UP OVER 6000. KNOWING THAT THE ONLY THING I DID WAS ADJUST THE PEDALS I PUSHED THE SWITCH IN THE OTHER DIRECTION AND RAISED THE PEDALS. THE RPM WENT BACK TO NORMAL IDLE SPEED.  I PUSHED THE SWITCH TO LOWER THE PEDALS AND THE ENGINE RPM PICKED UP AGAIN AS THE PEDALS WENT DOWN SO I RAISED THE PEDALS UP AGAIN UNTIL THE RPM RETURNED TO IDLE SPEED. THE CAR CONTINUES TO DO THIS. I BELIEVE THIS IS A VERY DANGEROUS SITUATION AS SINCE THERE WAS NO WARNING THIS COULD HAPPEN WHEN ADJUSTING THE PEDALS AND IT COULD UNDER RARE CIRCUMSTANCES BE TRIGGERED IF SOME OBJECT WAS IN BETWEEN THE SWITCH AND THE FLOOR WHEN THE SEAT IS MOVED REARWARD. THERE WAS NO ACCIDENT AND NO ONE WAS INJURED.",
        "vin": "2C3CCAKT6EH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992810,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 CHRYSLER 300C. WHILE REVERSING, THE VEHICLE INDEPENDENTLY SHIFTED INTO PARK WITHOUT WARNING. ON ANOTHER OCCASION, WHILE THE VEHICLE WAS AT A COMPLETE STOP, THE VEHICLE INDEPENDENTLY SHIFTED INTO PARK WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. AS A RESULT, THE VEHICLE JERKED VIOLENTLY AND STALLED WITHOUT WARNING. THE VEHICLE WAS UNABLE TO RESTART. THE VEHICLE WAS TOWED TO THE LOCAL DEALER (GROGAN'S TOWNE CHRYSLER JEEP DODGE RAM LOCATED AT 6100 TELEGRAPH RD TOLEDO, OHIO 43612) MORE THAN TWICE, BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND SENT OUT ENGINEERS WHO COULD NOT DUPLICATE THE FAILURE AND DETERMINED THAT THE VEHICLE WAS FINE. THE FAILURE MILEAGE WAS APPROXIMATELY 25,000.",
        "vin": "2C3CCAEGXEH"
    }
]