[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "12/09/2017",
        "fire": false,
        "manufacturer": "Crossroads RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121281,
        "products": [
            {
                "manufacturer": "Crossroads RV",
                "productMake": "CROSSROADS",
                "productModel": "REDWOOD",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2014 REDWOOD GK38 THIS 5TH WHEEL RV WAS BUILT WITH 7000 POUND AXLES.  LAST DECEMBER IN THE MOBILE, AL AREA WITHIN 40 MILES OF EACH OTHER I HAD 2 LEAF SPRINGS BREAK ON THE REAR AXLE. ONE ON THE WAY DOWN TO PORT CHARLOTTE FL AND ONE RETURNING HOME TO TEXAS.  MY CONCERN IS THIS ISSUE IS NOT ISOLATED TO JUST MY REDWOOD THAT THIS IS VERY COMMON PROBLEM BECAUSE THESE 5TH WHEELS ARE ADVERTISED AND FULL TIME LIVING UNITS AND HAVE VERY HEAVY UPGRADES TO THE INTERIOR TO WITHSTAND FULL-TIME LIVING IN THEM. I AM A MEMBER OF THE REDWOOD OWNERS GROUP AND THERE HAVE BEEN NUMEROUS COMPLAINTS OF THESE SPRINGS BREAKING FOR A NUMBER OF YEARS.  WHEN THE 2016 MODEL YEAR CAME THE MANUFACTURER CAME OUT WITH 8000 POUND SPRINGS AS STANDARD EQUIPMENT.  I WAS VERY FORTUNATE THAT MY FIRST SPRING SNAPPED WHEN PULLING INTO THE CAMPGROUND 5 MPH I WAS STAYING FOR THE NIGHT.  THE SECOND SPRING SNAPPED COMING INTO MAGNOLIA SPRINGS AL I WAS TRAVELING AT AROUND 10 MILES PER HOUR. HAD I BEEN ON I-10 TRAVELING AT HIGHWAY SPEED THIS COULD HAVE BEEN CATASTROPHIC THINK ABOUT IT HAPPENING IN THE MOBILE BAY TUNNEL WHICH I TRAVELED THROUGH TWICE DURING THIS TRIP. NOW I FEEL THAT THE MANUFACTURER HAS MISS LED ITS CUSTOMERS INTO A DANGEROUS SITUATION SINCE THEY STATE ON THE CLOSET ENTRANCE DOOR THAT THE WEIGHT OF THE RV IN MY CASE IS 13700 POUNDS WITHOUT UPGRADES OR CUSTOMER BELONGINGS.  THEY ALSO STATE THE PIN WEIGHT OF THIS AROUND 3500 POUNDS.  THIS WOULD LEAD ONE TO BELIEVE THAT THE AXLES ARE WELL WITH IN THE SAFETY ZONE.  YET SO MANY PEOPLE ARE ENCOUNTERING THE SAME ISSUE WITH BROKEN SPRINGS.  I WILL POST THIS TO THE MEMBERS SIGHT AND WOULD HOPE THAT THIS ISSUE IS LOOKED INTO NOT ONLY FOR THE SAFETY OF THE OWNERS THAT HAVE THESE RV'S BUT THE GENERAL PUBLIC TRAVELING OUR HIGHWAYS AROUND US. AS A RESULT MANY OF US OWNERS ARE CHOOSING TO REPLACE THEIR CURRENT SUSPENSIONS AT GREAT OUT OF POCKET COST.",
        "vin": "4V0FC3823ER"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "06/23/2016",
        "fire": false,
        "manufacturer": "Crossroads RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899792,
        "products": [
            {
                "manufacturer": "Crossroads RV",
                "productMake": "CROSSROADS",
                "productModel": "REDWOOD",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "RADIAL TRAIL",
                "productYear": "9999",
                "size": "ST235/85R16",
                "type": "Tire"
            }
        ],
        "summary": "TRAVELING NORTH ON I-65 OUTSIDE BOWLING GREEN KY TRAVELING@60 MILES PER HOUR IN THE RIGHT LANE. REAR TIRE BLEW OUT ON PASSENGER SIDE OF RV. CAUSING 3000.00 DAMAGE TO RV. REPAIRED BY DUNCAN RV REPAIR IN ELKHART, IN. DEDUCTIBLE WAS $750. REPLACED BOTH TIRES ON THE PASSENGER SIDE WITH THE DRIVERS SIDE TIRES AND INSTALL NEW CARLISLE TIRES ON DRIVERS SIDE. TIRE TURNED OVER TO PROGRESSIVE INS. CARLISLE REFUSED TO RETURN MY DEDUCTIBLE. THAT WAS THE FIRST BLOWOUT IN JULY 23 2015 THE SECOND BLOWOUT WAS JUNE 12 2016. THIS TIME IT WAS THE FRONT TIRE ON THE PASSENGER SIDE DAME BATCH WITH A BUILD DATE OF \"0114\". THE DAMAGE TO THE RV WAS MORE EXTENSIVE SO FAR THE COST TO REPAIR IS MORE THAN $5000 WITH A $500.00 DEDUCTIBLE. HAS NOT BEEN REPAIRED YET BUT HAVE AN APT IN OCT AT DUNCANS AGAIN. BEFORE EVERY TRIP I ENSURE THAT THERE IS 95PSI IN EACH TIRE AND THAT THE TORQUE ON THE LUGS IS 110 FT LBS. ANT EVERY REST STOP THE TEMP OF THE TIRES ARE MEASURED WITH A INFRARED THERMOMETER TO ENSURE THAT EVERYTHING IS GOOD.",
        "vin": "4V0FC3620ER"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/28/2015",
        "dateOfIncident": "10/14/2015",
        "fire": false,
        "manufacturer": "Crossroads RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786774,
        "products": [
            {
                "manufacturer": "Crossroads RV",
                "productMake": "CROSSROADS",
                "productModel": "REDWOOD",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON US 89 IN CALIFORNIA, MY FRONT PASSENGER SIDE TRAILER TIRE EXPLODED. HWY 89 SECTION HAD NO TURNOUTS OR SHOULDERS FOR ME TO STOP. THE TIRE IS A MARATHON ST235/80R16 LOAD RANGE E WITH APPROXIMATELY 10,000 MILES ON IT. I AM FANATIC ABOUT VEHICLE MAINTENANCE AND TIRE SAFETY AND THE TIRES HAD THE RECOMMENDED AIR PRESSURE. I CONTACTED CROSSROADS AND WAS TOLD THAT THERE WAS NOTHING THEY COULD DO FOR ME. I SPENT $102,888.00 ON THIS FIFTH WHEEL AND I HOPE THAT I CAN AT LEAST GET A RESPONSE FROM THE MANUFACTURER. CROSSROADS KNEW OF THIS TIRE PROBLEM BECAUSE IN 2015, THEY CHANGED THE TIRES FOR ALL THE NEW MODELS TO LOAD RANGE G OR AN OPTIONAL LOAD RANGE H. MY TRAILER IS A 36RL AND IT HAS A GVW OF 16,000 POUNDS. WE BOUGHT THIS TRAILER IN FEBRUARY 2014. WE HAVE USED IT THREE TIMES AND NOW THAT I AM AWARE OF THE TIRE PROBLEM, WE ARE NOT COMFORTABLE IN USING IT UNTIL WE CAN CHANGE ALL THE TIRES TO ONES THAT WE KNOW ARE NOT PRONE TO FAILURE. THE BLOWOUT TORE UP OUR FENDER AND DID SOME DAMAGE TO THE UNDERSIDE OF THE FIFTH WHEEL. WE WERE VERY LUCKY THAT THE OTHER TIRES DID NOT FAIL ALSO BECAUSE WE WERE ON A VERY NASTY CURVY SECTION OF THE HIGHWAY. CROSSROADS, OR THE DEALER, BYOUNG RV HAVE SO FAR REFUSED TO REPLACE THE FOUR TIRES AND THE SPARE TIRE. WE WERE TRAVELING AT ABOUT 58 MPH WHEN THE TIRE BLEW. I AM A CDL CLASS A DRIVER, AND THE EXPERIENCE AS A PROFESSIONAL DRIVER, PLAYED A PART IN US NOT HAVING A MORE SERIOUS SITUATION. THE TIRE IN QUESTION (MARATHON ST235/80R16 LOAD RANGE E) HAS HAD MANY MANY COMPLAINTS AND DOCUMENTED FAILURES LISTED IN MANY PUBLICATIONS. THE FOLLOWING WEBSITE IS ONE OF THEM:  HTTP://WWW.AMERICANARV.COM/GOODYEARS4AMERICANAS.ASP",
        "vin": "4VOFC3623ER"
    }
]