[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "01/12/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456080,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Fluctuating Speedometer dropping from driving speed to zero once the engine warms up. Especially bad at highway speed. When speedometer drops suddenly the brake light, ABS light and driver seat belt warning light flash on then off. Also hear a clicking noise from the gear shift when the speedometer fluctuates. Issue has been continual since beginning in January.",
        "vin": "2C3CDYAG8EH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/13/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451982,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Oil housing adapter has failed and needs replacing. I went to two different shops (independent and dealership) that stated the part is made of plastic and has a tendency to fail. Yes my safety is at risk due to the fact the car can run hot at any given time. Yes the car has been inspected and no there hasn't been any warning lights. When I took the car in for another problem, the tech noticed that the part was cracked and needs replacing. I am not sure why Chrysler would make a plastic part this close to an engine and now it is causing problems for customers. The part is currently on backorder because so many have failed.",
        "vin": "2c3cdyag0eh"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447895,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Dodge Challenger. The contact stated while the vehicle was stationary in the carport, he became aware that the front driver’s side window was opening and closing independently. The contact stated that no warning light was illuminated. The contact stated that he had to jumpstart the battery to start the vehicle. The contact took the vehicle to the local dealer, where it was diagnosed with needing the window regulator motor, the door module, the front driver door handle sensor, and the battery to be replaced. The vehicle was repaired. The manufacturer had been informed of the failure. The failure mileage was 61,971.",
        "vin": "2C3CDYBT6EH"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439925,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Dodge Challenger. The contact stated that while driving at 40 MPH, she smelled a burning oil odor. There were no warning lights illuminated. The contact was able to continue to drive the vehicle. The vehicle was taken to an independent mechanic who diagnosed that the oil filter housing adapter was leaking and needed to be replaced. The dealer and the manufacturer were not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 102,000.",
        "vin": "2C3CDYAG2EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422340,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Dodge Challenger. The contact stated that there was an abnormal sound coming from the steering wheel. The steering wheel felt loosened at one moment and then grabbed the next. The warning light that referred to the vehicle's ability to steer with the road conditions may be compromised. The contact had taken the vehicle to the dealer however, the vehicle was not diagnosed. The vehicle was not repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 74,000. Consumer stated her car was not part of a recall.",
        "vin": "2c3cdybt1eh"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420964,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR AND THE GAS PEDAL QUIT WORKING AND COASTED IN GAS STATION PARKING LOT. WAITED FOR A FAMILY MEMBER, AFTER 15 MINUTES I DROVE A 1/2 MILE TO WORK. UPON PARKING, I REVERSED TO ALIGN BETTER, AND THE THROTTLE WENT OUT AGAIN ALONG WITH HORN GOING OFF AND THE WINDOWS GOING UP AND DOWN. IN THIS TIME ALL LIGHTS WERE FLASHING ON DASH. IT WAS TAKEN TO MECHANIC, WHO WORKED FOR DODGE FOR 14 YEARS AND HE SAID THIS IS A PROBLEM WITH MANY CHYSLER, DODGE, AND JEEP VEHICLES. HE IS REPLACING THE LIPM TO CORRECT THE PROBLEM. I BELIEVE THIS HAS BEEN RECALLED IN MANY OTHER MOPAR VEHICLES AND IS UNACCEPTABLE AS THIS IS MY TEENAGE'S CAR. I POS TO THE CEO OF DODGE TO PUT HIS  CHILD BEHIND THE WHEEL OF THIS CAR. WHAT IF THIS TIPM BURNS/MELTS THE BOARD AGAIN? NO WARNING, MY CHILD WAS ON WAY TO WORK ON A BUSY ROAD, SPEED LIMIT 55MPH AND IT A GAS STATION WAS NOT TO HER RIGHT, WHO KNOWS WHAT THE OUTCOME COULD HAVE BEEN THE CAR WOULD NOT GO AND THERE WAS NO SHOULDER EITHER. YOU CAN DO THE SPECULATION. I HAVE NOT RECEIVED INVOICE YET BUT THE PRICE FOR TOW AND FIX IS $751.00.",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405373,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY 2014 DODGE CHARGER CAR AND THE ELECTRIC POWER STEERING CAUSE MY STEERING HARD TO TURN. WITH NO WARRANT. GOOD THING I WAS NOT ON I-10 HWY. I WAS ON THE STREET.I COULD HAVE BEEN KILL. I ALMOST HIT A CAR. THINKING IT WAS GOING TO GO AWAY BECAUSE IT WAS WORKING FINE. THEN THE DEALER SAID THE POWER STEERING NEED CHANGING. THOUSAND OF PEOPLE IS HAVING THAT SAME PROBLEM.",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11404705,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE HER HUSBAND WAS DRIVING OUT OF THE DRIVEWAY AT APPROXIMATELY 20 MPH, THE VEHICLE INDEPENDENTLY ACCELERATED AND DROVE FOR APPROXIMATELY 3/4'S OF A MILE DOWNHILL. THE DRIVER STATED THAT THE BRAKES FAILED TO SLOW THE VEHICLE. ADDITIONALLY, THE DRIVER WAS UNABLE TO SHIFT GEARS TO SLOW THE VEHICLE. THE CONTACT STATED THAT HER HUSBAND WAS UNABLE TO CONTROL THE VEHICLE AND CRASHED INTO SOME TREES. THE AIR BAGS DEPLOYED. THE CONTACT STATED THAT HER HUSBAND SUSTAINED BRUISES AND SCRATCHES TO HIS LEFT ARM AND ALSO SUSTAINED INJURIES TO HIS BACK AND NECK. THE DRIVER WAS TAKEN TO THE HOSPITAL BY AMBULANCE TO SEEK MEDICAL ATTENTION. THE CONTACT WAS UNSURE IF A POLICE REPORT WAS FILED SINCE THE FAILURE OCCURRED ON A PRIVATE ROAD. THE VEHICLE WAS TOWED TO A TOW YARD. THE VEHICLE WAS NOT YET DIAGNOSED, NOR REPAIRED. NEITHER A DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 61,000.",
        "vin": "2C3CDYBT7EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403479,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITH SEVERAL UNKNOWN WARNING LIGHTS ILLUMINATED. DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED TO AN INDEPENDENT MECHANIC WHO INFORMED HER THAT AFTER THE VEHICLE WAS TEST DRIVEN, HE DETERMINED THAT THE FAILURE WAS LINKED TO A DEFECTIVE ALTERNATOR. THE CONTACT THEN CALLED SALSBURY'S CHRYSLER DODGE JEEP RAM (13939 AIRLINE HWY, BATON ROUGE, LA 70817) WHO INFORMED HER THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V741000 (ELECTRICAL SYSTEM) HOWEVER, THE RECALL WAS SERVICED IN 2018. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 118,000.",
        "vin": "2C3CDYAG6EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397800,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 DODGE CHALLENGER OVER HEATED WHILE I WAS DRIVING. I PULLED OVER AND FILLED THE RESERVOIR WITH ANTIFREEZE. I DROVE LESS THAN A MILE DOWN THE ROAD AND IT OVER HEATED AGAIN.WHEN I CHECKED THE RESERVOIR IT WAS EMPTY. SO I PULLED OVER AND CALLED A TOW TRUCK TO TAKE IT TO THE MECHANIC.  THE MECHANIC DETERMINED THAT I NEED TO HAVE THE OIL FILTER/ OIL COOLER ADAPTER HOUSING, INTAKE MANIFOLD GASKET REPLACED. THIS WILL COST ME $788. THE PART I NEED IS ON BACK ORDER FROM THE MANUFACTURER. IN FACT THERE ARE OVER 34,000 OF THIS PARTICULAR PART ON BACK ORDER BECAUSE THIS IS SUCH A COMMON ISSUE WITH CHRYSLER, JEEP, AND DODGE CARS. HE WAS SHOCKED THAT THIS PART HAD NOT BEEN RECALLED YET. PLEASE LET ME KNOW WHEN THIS PART IS RECALLED. IF I PAY OUT OF POCKET TO FIX THIS VERY COMMON ENGINE ISSUE, WILL I GET REIMBURSED ONCE IT IS RECALLED?",
        "vin": "2C3CDYAG8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394905,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS OFF AT APPORXIMATELY 45MPH. ALMOST WRECK AND THEN FLICKERS BACK TO NORMAL OPERATING AND DRIVE HOME(5)MINUTES AND PARK. WILL NOT START BACK UP. TOWED THE CAR TO A DODGE DEALER WHO REPLACED THE ALTERNATOR RECALL AND TELLS ME TO PICK IT UP. I GO PICK IT UP AND NOW IT WILL NOT CHANGE GEARS, OVER HEATS IN DEALERSHIP PARKING LOT AND FANS WILL NOT OPERATE. DEALER KEEPS CAR AND SAYS IT'S A BAD WATER PUMP AND THERMOSTAT. AT THIS POINT I DO NOT TRUST DEALER AND REPLACE THE WATER PUMP, THERMOSTAT, IDLER PULLEY, TEMP SENSOR, BELT TENSIONER MYSELF. START CAR AND SOUNDS GREAT BUT OVERHEATS AGAIN. NOW WILL NOT START AT ALL. I SEE MANY MANY COMPLAINTS ABOUT THIS AND DODGE DOES NOTHIGN BECAUSE IT IS OUT OF WARRANTY. NOTE TO SELF....GOVERMENT STILL NOT PROTECTING THE LITTLE GUY. SIDE NOTE....WILL NEVER BUY ANOTHER DODGE!",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "11/08/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385453,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE HIS GIRLFRIEND WAS DRIVING 70 MPH, THE INSTRUMENT PANEL LIGHTS ILLUMINATED. THE VEHICLE THEN STALLED, AND CONTINUE TO ROLL, THE DRIVER WAS ABLE TO COAST TO THE SIDE OF THE ROAD. THE CONTACT STATED THAT HIS GIRLFRIEND NOTICED A LIGHT COMING FROM THE REAR, AND WHEN SHE HAD EXIT THE VEHICLE, SHE NOTICED SMOKE AND FLAME COMING FROM THE TRUNK OF THE VEHICLE. THE CONTACT STATED THAT THE WHOLE REAR OF THE VEHICLE WERE IN FLAME. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE POLICE WAS AT THE SCENE BUT DID NOT FILE A REPORT NEITHER WAS THE FIRE DEPARTMENT. THE VEHICLE WAS TOWED TO A TOW LOT AND LATER TOWED TO AN INSURANCE TOW LOT. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATELY UNKNOWN.",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383479,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS SHUTTING OFF WHILE DRIVING.. I DO RECALL THAT THERE WAS A RECALL ON MY CAR CONCERNING THIS ISSUE IT WAS NOT FIXED..",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365706,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS MAKING A TICKING NOISE. I HAVE CHANGED THE OIL WITH A BETTER BRAND AND THE TECHNICIAN EXPLAINED IT COULD BE THE ARM ROCKER THAT GOES BAD WITH THAT SPECIFIC ENGINE",
        "vin": "2C3CDYAG4EH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362540,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH LESS THAN 30,000 MILES WE NOTICED A STRONG GASOLINE ODOR INSIDE AND AROUND THE VEHICLE. SUSPECTING THAT THE FUEL ODOR WAS RELATED TO THE UB4 RECALL FOR THE EVAPORATIVE EMISSIONS CANISTER WE TOOK TO VEHICLE TO A LOCAL DEALER SHIP. THE PROBLEM WAS FOUND TO BE A CRACKED PLASTIC FITTING THAT CONNECTS THE FUEL FILL TUBE WITH THE FUEL TANK. THE REMEDY BEING REPLACEMENT OF THE FUEL TANK AT A COST OF OVER $2600. THE VEHICLE HAS NEVER BEEN ABUSED OR IN AN ACCIDENT SO, IT IS MY OPINION THAT THE FUEL TANK AND FILL TUBE ARE A POOR DESIGN AND COULD FAIL CAUSING EXTREME HARM. THE DEALERSHIP DID TAKE PHOTOS OF THE CRACKED PART BUT I DO NOT HAVE COPIES OF THEM. THE REPAIRS WERE COMPLETED AT CHAPMAN CHRYSLER JEEP, LOCATED AT 930 AUTO SHOW DRIVE, HENDERSON NV 89014. PHONE 702-558-3000.",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362543,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN TRYING TO RESOLVE RECALL UB4 FOR THE EVAPORATIVE EMISSIONS CANISTER SINCE 6/4/2020. SINCE THAT TIME I'VE BEEN \"PUT ON AN WAITING LIST\" FOR THE PART NEEDED TO RESOLVE THE RECALL. INITIALLY I WAS TOLD THAT IT WOULD BE 3 OR 4 MONTHS WAIT FOR MY PLACE IN ON THE LIST. I BEGAN FOLLOWING UP WITH THE DEALERSHIP ON 9/22/2020 AT WHICH TIME I WAS TOLD TO CALL BACK IN 2 WEEKS AND THEY WOULD BE ABLE TO ORDER THE PART AND SCHEDULE THE REPAIR. ON 10/2/2020 I CALLED AGAIN AND WAS TOLD THE SAME THING. ON 10/3/2020 I CALLED THE NUMBER ON THE REMINDER CARD THAT I RECEIVED ON 102/2020 AND WAS TOLD THE PARTS WERE IN SHORT SUPPLY AND \"IT'S A MESS\". I AGREE, I DON'T THINK CHRYSLER IS TAKING THIS RECALL SERIOUSLY BECAUSE IT SHOULDN'T TAKE 4 MONTHS, AND COUNTING, TO RESOLVE AN ISSUE. THE DEALERSHIP THAT I'VE BEEN COMMUNICATING WITH IS CHAPMAN DODGE CHRYSLER JEEP, AT 3175 E. SAHARA AVE, LAS VEGAS, NV 89104. PHONE 702-457-1061.",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "07/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351916,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF MARCH 2020 MY CAR HAS JUST GONE DOWN HILL. IT STARTED WITH THE ENGINE NOT HEATING AND COOLING PROPERLY, I SPENT OVER $1300 GETTING IT FIXED A FEW MONTHS LATER MY DAY TIME RUNNING LIGHTS WILL NOT TURN OFF AFTER 10 MINUTES THE FACTORY AUTOMATIC SHUT OFF WILL HAPPEN AND THE LIGHTS WILL GO OFF, BECAUSE OF THAT I HAD TO HAVE MY BATTERY REPLACED.  NOW MY AC JUST STOPPED WORKING IT NO LONGER BLOWS COLD AIR. I'VE HAD A DIAGNOSTIC DONE ON THE CAR AND THEY CAN'T FIGURE OUT WHAT THE PROBLEM IS, SPOKE TO OTHER PEOPLE WHO HAVE THE SAME CAR AND THEY ALL SAY THE SAME THING HAS HAPPENED TO THEM AND NO ONE KNOWS WHATS THE PROBLEM IS.",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348855,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT IN THIS CAR STARTED SHEDDING BEARING COMPONENTS WHILE UNDER WARRANTY. DEALER WAS INFORMED, BUT EXPLAINED THAT THE SEAT WAS FUNCTIONING AND ADJUSTABLE AND SO NO REPAIR WAS DONE. LATER, JUST AFTER THE WARRANTY EXPIRED, THE SEAT FAILED TO LATCH PROPERLY AND IS LOOSE BECAUSE THE BEARINGS ON SEAT TRACK HAVE FAILED TO STAY IN PLACE. THE SEAT IS NO LONGER SAFE TO SIT IN AND DOES NOT ADJUST OR LATCH PROPERLY. THE SEAT TRACK IS AN EXPENSIVE REPAIR AND THE PART IS NOT IN STOCK FROM LOCAL DEALER AND IS BACK ORDERED. THEY ARE NOT CERTAIN WHEN THEY CAN FIND A REPLACEMENT. THE PASSENGER SEAT IS NOT SAFE FOR AN OCCUPANT UNLESS REPAIRS ARE MADE. THIS SHOULD BE A RECALL ISSUE AS IT IS A SAFETY PROBLEM. THE DEALER WILL NOT REPAIR IT BECAUSE IT IS OUT OF WARRANTY AND PARTS ARE NOT AVAILABLE.",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "07/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE HER SON WAS DRIVING, THE VEHICLE STALLED. THE VEHICLE WAS RESTARTED WITH SEVERAL WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED TO THE CONTACTS RESIDENCE AND LATER TOWED TO PROGRESSIVE CHRYSLER DODGE JEEP RAM DEALER (7966 HILLS AND DALES RD NW, MASSILLON, OH 44646) AND WAS DIAGNOSED THAT THE ENGINE CEASED AFTER DRIVING THROUGH A POOL OF WATER AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED YET. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THERE WERE NO OPEN RECALLS ON THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 102,300.*DT*JB",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "08/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343468,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE STARTED WITH POWER STEERING GOING OUT FOR A FEW SECONDS IN 2014 DODGE CHALLENGER ONLY 38,000 MILES (HAPPENED TWICE) THEN BEFORE IT COULD GET SERVICED POWER STEERING WENT OUT WITH SERVICE LIGHT ON (POWER STEERING RESUMED IN ABOUT 5 MINUTES WHILE I WAS TRYING TO GET TO A SAFE PLACE, SERVICE LIGHT WENT OUT ALSO).  I WAS IN A DRIVE THRU LANE, AS I LEFT IT AND APPROACHED ROAD TO TURN RIGHT ON A 45 MPH RD IS WHEN THE STEERING WENT OUT FOR THE 5 MINUTES.  REALLY DANGEROUS, SHOULD BE RECALLED FOR FREE REPAIR",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "01/04/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342858,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "??? WHAT CAN I DO WHEN A DEALER SERVICE DEPT. LIE ABOUT REPLACEMENT DUE TO RECALL. ON 01/04/18 MY DODGE CHALLENGER WAS TOW TO THE DEALER, ALTERNATOR & BATT WERE REPLACED. I ASK IF THE AIR BAGS COULD BE REPLACE DUE TO ANOTHER RECALL, I WAS TOLD YES. PICKED UP THE CAR ON 1/08/18  ASK ABOUT THE A/BS AND WAS TOLD YES. 6 MONTHS LATER (O/A 6/7/18) WHEN I FILED THE PAPER WORK AWAY I NOTICE NOTHING ABOUT THE A/B. WENT BACK TO THE DEALER AND WAS TOLD BY ANOTHER ADVISOR THAT IT COULD NOT HAVE BEEN INSTALLED BECAUSE THAT THEY JUST GOT THE A/BS THAT WEEK. THAT THE LIE. THAT LIE COULD OF RESULTED  IN SOMEONE'S DEATH.    PLACE ADVISE.",
        "vin": "2C3CDYBT7EH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE STOPPED ACCELERATING WHILE AT AN INTERSECTION RED LIGHT 7-3-20. MANAGING TO GET IT TO A MECHANIC SHOP I WAS TOLD MY TRANSMISSION IS NO GOOD. MY POWERTRAIN WARRANTY EXPIRED IN 1-2020. MY CAR WAS INSPECTED AND DIAGNOSIS TEST WERE PERFORMED  ON IT AND NEVER DETECTED ANY PROBLEMS WITH THE TRANSMISSION DURING 2019 OVER THREE DIFFERENT TIMES BECAUSE OF MY CONCERNS ABOUT HOW MY CAR WAS DRIVING. UNDER THE DEALERSHIP POSSESSION THEY FAILED TO IDENTIFY THE PROBLEMS THAT EXISTED WITHIN THE TRANSMISSION NEVER MAKING THE APPROPRIATE REPAIRS OR REPLACING PARTS COVERED UNDER WARRANTY. I KNEW MY CAR WAS NOT DRIVING PROPERLY THAT'S WHY I TOOK IT TO THE DEALERSHIP AND EVERY TIME THEY FAILED TO DETECT THE PROBLEMS WITH MY TRANSMISSION ALLEGING THAT THERE ARE NO PROBLEMS AND CLAIMS TO HAVE FIX PROBLEMS THEY DID SEE BUT NEVER ADDRESSING THE TRUE PROBLEMS WITH THE TRANSMISSION KEEPING ME UNINFORMED ABOUT THE CONDITIONS OF MY VEHICLE WHILE UNDER WARRANTY BY MISLEADING INFORMATION THAT'S INACCURATE. CHRYSLER REFUSED TO ASSIST ME WITH REPLACING THE TRANSMISSION THAT SHOULD HAVE BEEN REPLACED WHEN I TOOK MY VEHICLE IN UNDER WARRANTY WITH CONCERNS HOW THE CAR DRIVES. CHRYSLER CLAIMS HOW WERE THEY SUPPOSED TO KNOW ABOUT THE TRANSMISSION IF I DIDN'T TELL THEM BUT I'M NOT A MECHANIC AND I TOLD THEM IT WAS DRIVING AND SHIFTING PROPERLY WHAT ELSE AM I'M SUPPOSED TO DO BESIDES BRING IT TO THE DEALERSHIP TO BE INSPECTED. I HAVE RECORDS OF MY MAINTENANCE HISTORY FOR ALL OF 2019 SHOWING EACH TIME I TOOK MY CAR TO THE DEALERSHIP FOR INSPECTION AND THEY FAILED TO MAKE THE TRANSMISSION REPAIRS. THESE SAME RECORDS ARE AVAILABLE FOR CHRYSLER TO REVIEW AND THEY STILL DECIDED TO NOT ASSIST ME WITH THE REPLACEMENT OF THE TRANSMISSION THAT THEY FAILED TO REPLACE WHILE UNDER WARRANTY BECAUSE THEY INTENTIONALLY IGNORED THE PROBLEMS AND ACKNOWLEDGE THAT REPLACEMENT WAS NEEDED.*DT*JB",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/10/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS TAKEN TO EDWARDS CHRYSLER DODGE JEEP RAM FIAT (1010 34TH AVE, COUNCIL BLUFFS, IA 51501) AS THE MECHANIC WAS ABOUT TO PERFORM NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM) THE VEHICLE CAUGHT FIRE. THE DEALER EXTINGUISHED THE FIRE. THE DEALER INFORMED THE CONTACT THE FIRE WAS DUE TO THE ALTERNATOR. THE CONTACT WAS UNAWARE IF THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED THE CONTACT A CASE NUMBER. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2C3CDYBT0EH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339753,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE VEHICLE FAILED TO RESPOND WITH THE ACCELERATOR PEDAL DEPRESSED. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO MIDWAY DODGE (4747 S. PULASKI RD, CHICAGO, IL 60632) TO BE DIAGNOSED. THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE CONTACT STATED THAT THE VEHICLE WAS PICKED UP AND THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE MANUFACTURER RECOMMENDED THAT THE VEHICLE BE TAKEN BACK TO THE DEALER AND FOR A TECHNICIAN TO DO A DRIVE ALONG TO SEE IF THE FAILURE WOULD RECUR. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 73,300.",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "12/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319157,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE DASHBOARD ON THE PASSENGER'S SIDE OF THE VEHICLE WAS DETACHED. THE VEHICLE WAS TAKEN TO SCOTT ROBINSON CHRYSLER DODGE JEEP RAM SERVICE CENTER LOCATED AT (20900 HAWTHORNE BLVD, TORRANCE, CA 90503, BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 33,000.",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317152,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 DODGE CHALLENGER WITH 50K MILES STARTED LEAKING OIL FROM THE HOUSING OIL FILTER WHICH IS MADE OUT OF CHEAP PLASTIC (68105583AF)",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316793,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN PARK FOR A FEW MINUTES, THE INTERIOR LIGHTS WILL DIM, THEN THE ENGINE SOUNDS A LITTLE ROUGH FOR A COUPLE OF SECONDS.  WITHIN A FEW OF MINUTES OF THAT HAPPENING, THE ENGINE WILL TURN OFF BY ITSELF. IT'S HAPPENED SEVERAL TIMES. I CHANGED THE AIR FILTER AND USED FUEL INJECTION CLEANER. HOWEVER, IT DID IT AGAIN ABOUT A WEEK OR TWO LATER.  I'M WONDERING IF THE ALTERNATOR IS GOING BAD. THE LAST TIME IT HAPPENED WAS 3/5/2020",
        "vin": "2C3CDYCJ1EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315828,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING FLUID EVAPORATES IN THE RESERVOIR (THE DODGE DEALER TOLD ME THIS AFTER I HAD THE FLUID CHECKED AND FILLED IN 2018 BECAUSE OF STEERING PROBLEM) AND CAUSES THE STEERING TO BECOME VERY RIGID WITH QUICK TURNING. I HAD TO MAKE A SUDDEN QUICK RIGHT TURN TO AVOID A CAR IN FRONT OF ME (LOCAL STREET) AND THE CAR WOULD NOT TURN AS I NEEDED. THE STEERING GROANED. THE STEERING FELT VERY DANGEROUS AND THIS WAS TOTALLY UNEXPECTED. I AM HAVING IT SERVICED THIS WEEK AGAIN TO CHECK THE STEERING FLUID.*DT     THE CONSUMER HAD A SECOND OPINON WHO ADVISED THE POWER STEERING FLUID WAS LEAKING. *JS",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "STEERING,INTERIOR LIGHTING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307547,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED WHILE DRIVING AT 25 MPH, WHEN THE VEHICLE STALLED AND LOST MOTIVE POWER IN THE ROADWAY. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED SHE WAS ABLE TO RESTART THE VEHICLE AND THE VEHICLE OPERATED AS INTENDED. THE VEHICLE WAS TAKEN TO HANLEES CHRYSLER DODGE JEEP RAM OF NAPA LOCATED AT 333 SOSCOL AVE, NAPA, CA 94559, WHERE THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT STATED THE FAILURE WAS INTERMITTENT. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 57,362. *DT*JB*DT  CONSUMER STATED WHEN THE VEHICLE DIES, LIGHTS, POWER STEERING AND POWER BRAKES ALL SHUT DOWN.*JB",
        "vin": "2C3CDYBT6EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307564,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 DODGE CHALLENGER DIES WHEN I'M DRIVING IT. THE MOST RECENT WAS WHEN I WAS DRIVING DOWNHILL ON A WINDING MOUNTAIN ROAD.  IT DIED, AND THERE WAS NO PLACE TO GET OFF THE ROAD. WHEN IT DIES, THE LIGHTS, POWER STEERING AND POWER BRAKES ALL QUIT. VERY DANGEROUS!!!  THE DEALER COULD FIND NOTHING WRONG.  THERE ARE MANY COMPLAINTS ABOUT THIS ON THE INTERNET, AND DODGE IS DOING NOTHING TO FIX THIS.  LIKE ME, OTHERS HAVE TAKEN THEIR CARS TO DEALERS, AND THEY FIND NOTHING WRONG.  SOMETHING IS VERY WRONG!  DODGE NEEDS TO GET BUSY AND FIX THIS MOST DANGEROUS DEFECT BEFORE SOMEONE GETS SERIOUSLY INJURED OR KILLED.    *JS",
        "vin": "2C3CDYBT6EH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302486,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING LIGHT CAME ON UNEXPECTEDLY WHILE DRIVING 55 MPH ON INTERSTATE",
        "vin": "2C3CDYAG2EH"
    },
    {
        "components": "TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298329,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, THE CHECK ENGINE LIGHT AND TRACTION CONTROL WARNING LIGHT ILLUMINATED AND REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER BROWNS DODGE/JEEP (483 MEDFORD AVE, PATCHOGUE NY) WHERE IT WAS DIAGNOSED THAT THE STEERING CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER (CAS-71808384) WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 19,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "12/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297023,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY LIFTERS HAVE DAMAGED THE CAMSHAFT, CAUSING MISFIRING AND THOUSANDS OF DOLLARS OF REPAIR COSTS FOR A CAR WITH ONLY 76,000 MILES.  LIFTERS ARE ON BACK ORDER FOR 6-8 MONTHS.",
        "vin": "2C3CDYCJ2EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280246,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A 2014 CHALLENGER 60,900 MILES AND THE OIL FILTER HOUSING ASSEMBLY STARTED LEAKING OIL. HAD TO BE REPLACED. ALSO THE TRANSMISSION IS NOW STARTING TO NOT SHIFT PROPERLY.",
        "vin": "2C3CDYAG0EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2019",
        "dateOfIncident": "11/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279365,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDOW HAS SMART GLASS. THERE IS A SENSOR IN THE DOOR WHICH ALLOWS THE WINDOW TO AUTOMATICALLY SLIDE UP OR DOWN ABOUT 1\\4 OF AN INCH SO THE DOOR CLOSES COMPLETELY. ABOUT 4 DAYS AGO THE WINDOW BEGAN SLIDING UP AND DOWN ON ITS OWN AFTER TURNING THE CAR OFF. I THOUGHT MAYBE IT WAS ACTING UP DUE TO AN OLD BATTERY SO I BOUGHT A NEW ONE BUT THE WINDOW STILL SLIDES UP AND DOWN ON ITS OWN CONSTANTLY BUT ONLY WHEN THE CAR IS OFF. I HAVE TO LEAVE THE WINDOW ROLLED DOWN A FEW INCHES TO MAKE IT STOP. I HAVE READ REVIEWS WHERE OTHER PEOPLE HAVE HAD THE SAME PROBLEM WITH SOME OLDER MODELS AND EVEN AFTER REPLACING THEIR WINDOW SENSOR THE SAME PROBLEM STILL CONTINUED.",
        "vin": "2C3CDYAG6EH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11277383,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A VIOLENT AUTO ACCIDENT AND NOT ONE AIRBAG DEPLOYED!?!? DRIVING EASTBOUND AT SPEED LIMIT AND A STOLEN EXITING OFF THE HIGHWAY HIT THE REAR PASSENGER SIDE OF THE CAR WHICH SPIN THE CAR AROUND AN HIT A POLE, GUARD RAIL AND SLAMMED INTO A ROCK RAVINE. AGAIN, NOT ONE AIRBAG DEPLOYED.*DT*JB",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268267,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY I TRY TO TURN ON MY CAR, AND IT WAS NOT TURNING TYLER WAS A MESSAGE TO CHECK THE STEERING WHEEL FLUID, THE STEERING WHEEL WAS SO HARD TO MANEUVER, I TOOK IT TO THE DEALER AND THEY TOLD ME IT WAS THE STEERING WHEEL PUMP, WHICH WAS REALLY ODD OF THEM BECAUSE MY CAR IS A LOW MILEAGE CAR STILL. I HAVE SEEN THERE IS A SIMILAR RECALL FOR CARS THE SAME YEAR AND MAKING MODEL AS MINE.",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/06/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266829,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE CRUISE CONTROL FAILED TO DISENGAGE WHEN THE CONTACT'S FOOT DEPRESSED THE BRAKE PEDAL. WHEN THE CRUISE CONTROL WAS APPLIED WHILE DRIVING 65 MPH, THE RPMS INCREASED AND THE VEHICLE ACCELERATED TO 114 MPH. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD AND DISCONNECTED THE CRUISE CONTROL. AS THE CONTACT CONTINUED DRIVING WITHOUT THE CRUISE CONTROL ACTIVATED, THE VEHICLE PROCEEDED TO ACCELERATE AND DECELERATE SIMULTANEOUSLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION AND THE MECHANIC STATED THAT THE POWER TRAIN CONTROL MODULE AND THE ALTERNATOR GENERATOR REGULATOR FAILED. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 18E053000 (VEHICLE SPEED CONTROL) AND NHTSA CAMPAIGN NUMBER: 17V741000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 64720021. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 91,099.",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265393,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 DODGE CHALLENGER SRT WITH 17505 MILES ON IT FROM NEW.  WITHOUT WARNING, FUEL PUMP CUT OUT WHILE DRIVING ON HIGHWAY AT 65 MPH; MOTOR DIED AND THE CAR SHUT DOWN (INCLUDING POWER STEERING).  LUCKILY, WAS ABLE TO COAST TO STOP ON HIGHWAY SHOULDER WITHOUT CRASH.  HAD IT NOT BEEN A WEEKEND WITH LIGHT TRAFFIC, COULD HAVE BEEN VERY BAD.  FUEL PUMP DIAGNOSIS PROVIDED BY DEALER TWO-DAYS LATER AFTER CAR WAS TOWED TO SHOP.",
        "vin": "2C3CDYCJ4EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253258,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SHUT DOWN AFTER EVERY LIGHTS ON MY DASHBOARD APPEARED. WOULD CRANK AND THERE WAS NO WARNINGS AHEAD OF TIME TO LET ME KNOW THERE MAY HVE BEEN ANY ISSUES. WHEN MY CAR SHUT DOWN I WAS IN DRIVE ON MY BRAKES AT A LIGHT. HAD TO HAVE MY CAR TOWED TO DEALERSHIP TO FIND OUT IT WAS THE ELECTRONIC POWER STEERING PUMP $1800.00 LATER.",
        "vin": "2C3CDYAG7EH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244495,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COVER OF THE AIR BAGS IR GOING LOST IN THE AREA OF THE AC VENTS THIS PART IS BETHER NOW AS DASH  IS PREOCCUPYING THAT IN THE CASE OF THE DEPLOY OF THE AIR BAGS DOUND OPEN CORRECTLY . I SEE OTHERS OWNERS WITH THE SAME COMPLAINT OF THE DODGE CHALLENGER 2014",
        "vin": "2C3CDYBT8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "07/07/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221602,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I  WAS NEVER REIMBURSED FROM MY LAST RECALL WITH RECEIPTS FAXED AND UPLOADED ON SITE,  AND NOW I MAY BE KILLED BUY MY AIRBAG, STILL WAITING FOR REIMBURSEMENT ON ALTERNATOR RUINING MY BATTERY AND BEING STRAINED MANY TIMES FOR THIS PROBLEM, I SHOULD REPORT YOUR LACK OF RESPONSIBILITY SINCE REPLACEMENT PART WASN'T AVAILABLE PROMPTLY",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "05/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING OCCURRED DURING NORMAL DRIVING CONDITIONS OVER A PERIOD OF TWO WEEKS WITH WARNING LIGHTS ON:  VEHICLE DISPLAYED ABS AND TRACTION CONTROL WARNING LIGHTS SIMULTANEOUSLY.  THEN SUDDENLY THE CAR, AN AUTOMATIC TRANSMISSION, WOULD NOT SHIFT OUT OF FIRST GEAR. LOCAL DEALERSHIP SERVICE DEPT STATED THE COMPUTER SENSED BRAKE MALFUNCTION AND CAUSED A \"LIMP MODE\" CAUSING THE TRANSMISSION NOT TO SHIFT. THIS IS SO THE CAR WOULD NOT REACH NORMAL SPEEDS BECAUSE THE BRAKES WERE MALFUNCTIONING. DEALER SHOP REPORTS SPEED SENSORS ON BRAKES FAILED DUE TO EXCESSIVE HEAT. THIS IS ODD BECAUSE INVOICE REPORTS THE REAR SENSORS FAILED WHEN NORMALLY THE MAJORITY OF BRAKING, PRODUCING HEAT, IS FROM THE FRONT BRAKES. RESULTING REPAIRS INCLUDED REPLACING BOTH FRONT ROTORS AND LEFT FRONT CALIPER AND BOTH REAR SPEED SENSORS, AND FLUSHING FLUID ALL DUE TO EXCESSIVE HEAT. THIS IS A CONTRADICTION THAT THEY REPORT THE REAR SPEED SENSORS FAILED. PERHAPS A CLERICAL ERROR. ALL IS DOCUMENTED ON ED VOLYES CHRYSLER DODGE DEALERSHIP SERVICE INVOICE # 883127, IN MARIETTA, GA.  SEARCHING THE INTERNET SHOWS NUMEROUS  BRAKE FAILURE STORIES DUE TO SPEED SENSORS IN THIS MAKE AND MODEL CAR. SOME ARE EASILY \"NEAR DEATH EXPERIENCES\". I CAN ONLY HOPE THEY FILED NHTSA REPORTS AS WELL. FINAL SYSTEMS FAILURE OCCURRED ON MAY 27TH.  WE'VE HAD LENGTHY EXPERIENCE WITH MUCH OLDER ANTILOCK CARS OF OTHER MAKES WITH NO HINT OF FAILURE LIKE THIS !  I FAIL TO SEE WHY A CRITICAL FAILURE SUCH AS THIS WOULD BE ACCEPTABLE ON ANY SAFETY STANDARDS.",
        "vin": "2C3CDYAG6EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196148,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING A TURN THE STEERING WHEEL LOCKS  UP MAKING IT VERY HARD TO TURN",
        "vin": "2C3CDYBT8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193849,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS INTERMENT STARTING. ONCE STARTING STATED THE \"KEY FOB NOT DETECTED\", WHICH COULD CAUSE THE VEHICLE TO UNEXPECTEDLY CEASE MOTION. 2 MONTHS EARLIER, I HAD THE RECALLED; REPLACED ALTERNATOR FAIL UNEXPECTEDLY WHILE I WAS DRIVING THE CAR.",
        "vin": "2C3CDYAG0EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11190592,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE AT A STOP, THE CONTACT'S VEHICLE WAS REAR ENDED BY ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DAMAGED AND TOWED BY THE INSURANCE COMPANY TO AN INDEPENDENT AUTO BODY SHOP IN PITTSBURGH, CALIFORNIA. THE BODY DAMAGE WAS REPAIRED. A FEW DAYS LATER, WHILE DRIVING APPROXIMATELY 72 MPH, THE VEHICLE SHUT DOWN AND SEVERAL INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL, INCLUDING THE SEAT BELT, AIR BAG, AND CHECK ENGINE. THE VEHICLE WAS TAKEN BACK TO THE INDEPENDENT MECHANIC WHO REFERRED THE CONTACT TO ANTIOCH CHRYSLER JEEP DODGE RAM (925-778-9700, LOCATED AT 1810 AUTO CENTER DR, ANTIOCH, CA 94509) WHERE IT WAS DIAGNOSED THAT THE WIRING INSIDE THE DRIVER'S DOOR WAS NOT CONNECTED, CAUSING THE CONTACT TO USE THE REMOTE TO UNLOCK THE VEHICLE. THE TECHNICIAN REPLACED THE WIRE AND THE CONTACT WAS ABLE TO UTILIZE THE PUSH BUTTON TO UNLOCK THE VEHICLE; HOWEVER, THE FAILURE RECURRED.  THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER, BUT WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 56,931.",
        "vin": "2C3CDYAG1EH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185060,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V018000 (AIR BAGS). THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO BROOKLYN CHRYSLER JEEP DODGE RAM (718-713-3000, LOCATED AT 2286 FLATBUSH AVE, BROOKLYN, NY 11234) FOR THE RECALL REPAIR; HOWEVER, THE FAILURE RECURRED AFTER THE REPAIR. THE CONTACT CALLED THE DEALER AND WAS INFORMED TO BRING THE VEHICLE BACK. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 36,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183463,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS AGO I NOTICED THE PASSENGER SEAT WOULD SHAKE WHILE CAR WAS IN MOTION AND ANY SPEED. THEN SUDDENLY THE SEAT STARTED HAVING TROUBLE SLIDING BACK AND FORTH WHEN TRYING TO GAIN ACCESS TO THE REAR SEAT. THEN THE SEAT STOPPED LOCKING IN PLACE AND MY HUSBAND OFTEN COMPLAINED THAT HE WAS FEELING THE SEAT SLIDE BACK AND FORTH. THEN FINALLY, ABOUT 3 WEEKS AGO DURNING A RAIN STORM ON THE WAY TO WORK JUST ABOUT TO MERGE ONTO THE HIGHWAY WHEN TRAFFIC SUDDENLY STOPPED, I WAS UNABLE TO STOP STOPPING TIME AND I HAD A MINOR FENDER BENDER (10MPH OR LESS). THE SMALL IMPACT MADE THE PASSENGER SEAT MOVE ALL THE WAY FORWARD, THE SEATBELT MANAGED TO DIG INTO THE SEAT POSSIBLE STOPPING THE SEAT FROM GOING EVEN FURTHER BUT THEN AGAIN THE SEAT MIGHT HAVE JUST RAN OUT OF TRACK. WHATEVER THE CASE MIGHT HAVE BEEN, I CAN'T IMAGE THE INJURIES THIS MIGHT HAVE CAUSED IF I HAD A PASSENGER SITTING IN THIS SEAT THEY POSSIBLY WOULD HAVE FACE PLANTED ON THE DASHBOARD OR MUCH WORSE. MY CHALLENGER IS CURRENTLY IN THE SHOP FOR A NON FUNCTIONING PASSENGER SEAT I HOPE THEY FIX THE SEAT BECAUSE I HONESTLY DON'T FEEL COMFORTABLE HAVE ANYONE SIT IN THE SEAT.",
        "vin": "2C3CDTAGXEH"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181973,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE DRIVER'S SIDE WINDOW CONTINUOUSLY ROLLED UP AND DOWN ON ITS OWN AND THE DOOR LATCH DID NOT FUNCTION PROPERLY. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED GATOR CHRYSLER (840 S HARBOR CITY BLVD, MELBOURNE, FL 32901, (877) 707-5664), BUT THEY DID NOT ASSIST. THE CONTACT WAS A MECHANIC AND PERFORMED HIS OWN DIAGNOSTIC TEST, WHICH INDICATED THAT A NEW DOOR SENSOR WAS NEEDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 40,254.",
        "vin": "2C3CDYBT0EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/20/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171059,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING MY HOUSE BACKING OUT TO TURN LEFT THE STEERING WHEEL WAS VERY TIGHT AND HARD TO TURN WHILE MAKING A LOUD NOISE AND AS I LEFT THE STORE IT DID IT AGAIN. I WENT HOME TO TURN INTO THE LANE THE SAME PROBLEM THIS. I WORLD LOVE TO ENJOY MY CAR SOMETIMES.",
        "vin": "2C3CDYAG9EH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/12/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166613,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK LEAK WHERE THE FILL LINE GOES INTO THE GAS TANK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "01/16/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166354,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY ACCELERATE THE CAR'S RPM RISES BUT THE CAR DOESN'T ACCELERATE. IT IS SIMILAR TO BEING IN NEUTRAL. I HAVE TO PUT THE CAR IN NEUTRAL AND BACK TO DRIVE WHILE I'M ALREADY IN MOTION TO FIX IT. IT HAS DONE THIS SINCE I BOUGHT THE CAR. I HAVE FILED A COMPLAINT WITH DODGE AND DODGE CORPORATE.",
        "vin": "2C3CDYAG4EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160969,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE VEHICLE LEAKED OIL FROM THE OIL FILTER ASSEMBLY WITHOUT WARNING. THE CONTACT CALLED MOTORWORLD CHRYSLER DODGE JEEP RAM AT 888-459-2493 (LOCATED AT 150 MOTORWORLD DR, WILKES-BARRE, PA 18702), BUT WAS UNABLE TO SPEAK WITH A SERVICE TECHNICIAN. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 32,300.",
        "vin": "2C3CDYAG8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "10/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151762,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTERIOR LIGHTS FLASH CONSTANTLY WHEN CAR IS PARKED AND TURNED OFF. SOMETIMES THE LIGHTS DON'T FLASH, THEY SIMPLY WILL NOT TURN OFF AT ALL AFTER CAR IS TURNED OFF. HAS HAD A RELAY REPLACED 3 TIMES SINCE THE CAR WAS PURCHASED AT THE END OF 2014, THE ISSUE DESCRIBED HAS KILLED THE BATTERY NUMEROUS TIMES. NOWADAYS THE INTERIOR LIGHTS FLASH CONSTANTLY AS WELL WHEN THE CAR IS TURNED ON. NO RECALL HAS BEEN ISSUES ON THIS VIN BUT THIS 4 YEAR OLD CAR WITH 65000 MILES HAS BEEN WORKED ON 6 TIMES IN JUST THE LAST TWO YEARS DUE TO COUNTLESS ISSUES THAT INCLUDE THE WORST AND MOST PERSISTENT ISSUE, BEING THE FAULTY LIGHTING. OTHER ISSUES INCLUDE THE OXYGEN SENSOR MALFUNCTIONING RESULTING IN THE ENGINE RATTLING WHEN SLOWING DOWN OR ACCELERATING AND HIGH FUEL CONSUMPTION ( A FULL GAS TANK WOULD BE EMPTY WITHIN THREE DAYS DRIVING LOCALLY IN A FIVE MILE RADIUS) AS WELL AS TRACTION CONTROL FAILING RESULTING IN NEAR ACCIDENTS.",
        "vin": "2C3CDYAG6EH"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151532,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE FRONT PASSENGER SEAT WOULD NOT REMAIN SECURE, CAUSING THE OCCUPANT TO SLIDE FORWARD WHEN STOPPING THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE LOCAL DEALER GWINNETT CHRYSLER DODGE (5054 HWY 78 EAST, STONE MOUNTAIN, GA) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 34,000.",
        "vin": "2C3CDYBT1EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "11/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150257,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAR A TAPPING IN THE ENGINE SO I TOOK IT TO THE DEALERSHIP AND THEY TOLD ME THAT THE LIFTERS NEED TO BE REPLACED AND THAT MY WARRANTY EXPIRED 2 MONTHS AGO. THEY ALSO SAID THAT IF I KEEP DRIVING IT THE CAM SHAFT WILL BREAK AND MOTOR WILL SEIZE AND THEY ALSO TOLD ME THEY ARE HAVING A LOT OF THESE 5.7 LITER ENGINES WITH THE SAME PROBLEM.",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144094,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE DRIVING ABOUT 40 MPH, THE VEHICLE LOST POWER AND ALL THE WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS PUSHED TO THE SIDE WITH THE HELP OF THE POLICE. THE VEHICLE  WAS LATER TOWED TO THE DALLAS DODGE CHRYSLER JEEP RAM DEALER (214-327-9361, 11550 LYNDON B JOHNSON FWY, DALLAS, TX 75238) WHERE IT WAS DIAGNOSED THAT THE ALTERNATOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 66,800.",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "10/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141039,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MOPAR SAFETY RECALL FOR ALTERNATOR DIODE IS NOT BEING CHECKED OR REPAIRED BY MY LOCAL DEALERSHIP.     FUEL LEAK: I HAVE NOTICEABLE AMOUNT OF FUEL LEAKING FROM BENEATH MY CAR. I BROUGHT THE CAR INTO THE LOCAL DEALERSHIP AND ARE TELLING ME THAT A NEED A NEW FUEL TANK ON A2014 DODGE CHALLENGER WITH 33K ORIGINAL MILES. THE FUEL LEAK IS VISIBLE WHILE THE VEHICLE IS STATIONARY AND YOU CAN SMELL GAS WHILE DRIVING.",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124511,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT DO NOT LOCK INTO PLACE WHEN TAKEN TO THE DEALERSHIP I WAS TOLD THAT IT WAS VERY COMMON ON THAT CAR LOTS OF PEOPLE HAD THE SAME ISSUE. SEAT SLIDES BACK IN FORTH AND IS A SAFETY ISSUE ESPECIALLY IF YOU WERE INVOLVED IN A ACCIDENT.",
        "vin": "2C3CDYAG6EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115191,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED ELECTRICAL FAILURES THAT PROGRESSED. THE INTERNAL AND EXTERNAL LIGHTING FLICKERED AND VARIOUS WARNING INDICATORS FLASHED ON THE INSTRUMENT PANEL. IN ADDITION, WHEN THE PUSH TO START BUTTON WAS APPLIED, THE VEHICLE SHUT OFF AND, AT TIMES, WOULD NOT RESTART. THE DEALER (PERRIS VALLEY CHRYSLER DODGE JEEP RAM, 707-A E 4TH ST, PERRIS, CA 92570, (951) 657-7371) DID NOT VERIFY IF THE VEHICLE HAD A 160, 180, OR 220 AMP ALTERNATOR IN RELATION TO NHTSA CAMPAIGN NUMBERS: 17V435000 (ELECTRICAL SYSTEM) AND 14V634000 (ELECTRICAL SYSTEM). THE CONTACT WAS INFORMED BY THE DEALER THAT THE VEHICLE WAS EXCLUDED FROM THE RECALLS. THE MANUFACTURER INFORMED THE CONTACT TO HAVE THE DEALER REPLACE THE PART. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 41,000.",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111215,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS AND TRACTION CONTROL LIGHT CAME ON AFTER STARTING THE CAR. A FEW DAYS LATER, THE LIGHTS ARE STILL ON BUT IS MAKING A LOUD CLICKING SOUND WHEN MAKING TIGHT RIGHT TURNS. DAY AFTER THE CLICKING, THE CHECK ENGINE LIGHT CAME ON WHILE DRIVING 45 MPH. THE CAR WAS STILL ON BUT WITH NO ACCELERATION. PRESSING ON THE GAS PEDDLE WOULD REV THE ENGINE WITH NO PROGRESS. I  STOPPED THE CAR, TURNED IT OFF AND CHECKED MY FLUIDS UNDER THE HOOD. ALL LOOKED FINE. AFTER RESTARTING THE CAR, IT WOULD RUN THEN LOSE ACCELERATION AGAIN. CAR THEN BECAME UNRESPONSIVE AND TOWED TO THE DEALER. THE DEALER HAS HAD THE CAR FOR 2 DAYS AND STILL DON'T KNOW WHAT IS WRONG. SERVICE ADVISER SAID THE CAR IS NOT \"COMMUNICATING.\"  I AM CURRENTLY PAYING FOR A RENTAL OUT OF POCKET. FCA SAID THERE ARE NO RECALLS BASED ON MY VIN. BASED ON MY RESEARCH, IT SOUNDS LIKE THE P60/ALTERNATOR RECALL.",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103859,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY CAR IN BACK ROW OF A PARKING LOT TO AVOID DINGS. SET PARKING BRAKE.   APPROXIMATELY 1 HR LATER MY CAR WAS SEEN ROLLING ACROSS PARKING LOT AND IMPACTED ANOTHER PARKED VEHICLE. I WENT TO DEALER WHO AFTER I EXPLAINED WHAT HAPPEN SAID HE SAW NO RECALLS AND  WOULD NOT COVER.  I THEN CALLED DODGE SRT AND EXPLAINED WHAT HAD TRANSPIRED. ON HOLD 2 SEPARATE TIMES .  DODGE SRT PREMIUM ISSUED ME A CASE# OF 34483211 ON JUNE 6 2018 AND ASKED ME TO BRING CAR INTO DEALERSHIP TO BE REPAIRED.  ONCE CAR WAS AT DEALERSHIP THE SERVICE MANAGER CALLED AND  I WAS TOLD THEY COULD NOT TELL ME WHY THE BRAKE CAME OUT OF ADJUSTMENT WHILE PARKING BRAKE WAS SET, BUT HAD NO EXPLANATION BEYOND THAT. I AGAIN EXPRESSED MY CONCERNS THAT THIS IS NOT NORMAL HAVING OWNED NUMEROUS DODGES OVER THE LAST 5 YEARSI THAT I COULD NOT EXCEPT THAT AND DODGE AGREED AND SAID THAT  THIS WAS MOVING UP TO SPECIAL INVESTIGATIONS, AND SOMEONE WOULD BE IN CONTACT. THE INSPECTION WAS DONE LAST TUESDAY THE 19TH THE INSPECTOR INFORMED ME HIS INSPECTION WAS COMPLETE AND I COULD PICK UP MY CAR. HE ASSURED ME THE BRAKE WAS WORKING AND THAT I COULD BRING IT HOME AND WAIT FOR THE INVESTIGATION BEFORE REPAIRING THE BUMPER AND GRILLE. I ARRIVED LAST WEDS TO GET MY CAR AND WAS TOLD UNLESS I PAY THE REPAIR BILL I WOULD NOT BE ALLOWED MY CAR BACK.  I HAVE SINCE CALLED DODGE 2 MORE TIMES AND I AM TOLD THIS IS A SEALED FILE AND THEY CAN NOT TELL ME ANYTHING AND HAVE NO PERSON I CAN CONTACT TO RESOLVE THIS. MY COLLECTOR CAR IS CURRENTLY STILL AT THE DEALERSHIP OUTSIDE IN A PARKING LOT EXPOSED TO WEATHER AND WHO KNOWS WHAT, AND I STILL HAVE NO RESPONSE FROM DODGE OTHER THAT THIS IS UNDER SPECIAL INVESTIGATION AND THEY WILL CONTACT ME.  I DO NOT HAVE ANY PAPERWORK FROM THE INSPECTORS REPORT AND THE DEALERSHIP WOULD ONLY GIVE ME THE BILL THEY SAY I AM TO PAY BECAUSE THE CASE# IS NOT SHOWING UP ON FILE DUE TO BEING SEALED.",
        "vin": "2C3CDYCJ8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11094030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE BATTERY FAILED TO WORK AS DESIGNED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (PERRY CHRYSLER DODGE JEEP RAM, 2340 NATIONAL CITY BLVD, NATIONAL CITY, CA 91950) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 14,300. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076780,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD THE RECALL FOR ALMOST 1 YEAR AND STILL NO PARTS AVAILABLE AT DEALER.  MADE 1 250 MILE ROUND TRIP TO FIX BUT NO PARTS THERE SO REQUIRE ANOTHER TRIP.",
        "vin": "2C3CDYBT3EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/11/2018",
        "dateOfIncident": "02/04/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072180,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING BECOMES VERY RIGID AND DIFFICULT WHEN MAKING A QUICK OR SLOW LEFT TURN WHEN DRIVING ON THE ROADWAYS. IN A PARKING LOT THE STEERING WHEEL BECOMES DIFFICULT TO TURN LEFT AS YOU MANEUVER OUT OF A SPACE. THE STEERING BECOMES RIGID AS THE CAR MAKES A GROANING/GRINDING NOISE. THE CAR ALSO MAKES A WHINING/HIGH PITCH NOISE WHILE TURNING. NO CAR I HAVE EVER OWNED PERFORMED LIKE THIS. IT HAS GOTTEN SLOWLY BUT STEADLIY WORSE AND NOW I HAVE BECOMED CONCERNED FOR MY SAFETY. THE CAR ONLY HAS 48,800 MILES. THE PROBLEM STARTED ABOUT 8 MONTHS AGO. I WILL NOW HAVE IT LOOKED AT BY A MECHANIC THIS WEEK. ITS POSSIBLE THE POWER STEERING IS FAULTY, OR THE RACK AND PINION. THE POWER STEERING FLUID HAS NOT BEEN CHECKED BY ME SINCE OWNING IT AT 38,000 MILES. I NEED TO CHECK ASAP. THE STEERING FLUID RESERVOIR IS HIDDEN BEHIND THE FRONT PASSENGER WHEEL WELL, SO THIS MAKES IT MORE DIFFICULT FOR THE AVERAGE PERSON TO CHECK QUICKLY.",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "01/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067375,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OIL COOLER FAILURE CAUSING A MAJOR OIL LEAK; RIGHT BLINKER BLINKING TOO FAST- THIS ISSUE COMES AND GOES AND I HAVE REPLACED THE BULBS SEVERAL TIMES",
        "vin": "2C3CDYAGXE1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "01/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066439,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED FIVE STAR CHRYSLER DODGE JEEP RAM WARNER ROBINS AT (478) 412-4003 (LOCATED AT 2817 WATSON BLVD, WARNER ROBINS, GA 31093) WHERE IT WAS CONFIRMED THAT PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2C3CDYBT3EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066017,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. GRESHAM CHRYSLER DODGE JEEP RAM (855 NE BURNSIDE RD IN GRESHAM, OR) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS RECALL INCOMPLETE, REMEDY NOT YET AVAILABLE.",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2018",
        "dateOfIncident": "11/14/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065931,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED BOB MOORE DODGE CHEVROLET AT (888) 379-3252 (LOCATED AT 7420 NW EXPRESSWAY, OKLAHOMA CITY, OK 73132) AND  WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER STATED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER DID NOT OFFER FURTHER ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2C3CDYBT1EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "01/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065560,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WILL STALL OUT AND THEN RAPIDLY ACCELERATE. RECALL FOR FAULTY ALTERNATOR RELEASED IN JUNE. THERE HAS YET TO BE A REMEDY OFFERED TO FIX IT.",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "01/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061565,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS APART OF THE T36 RECALL FOR FAULTY ALTERNATORS; MY ALTERNATOR DIED LAST FRIDAY WHILE I WAS DRIVING IT ON THE ROAD, I WAS ABLE TO GET TO A SAFE PLACE BEFORE IT ACTUALLY DIED, BUT DUE TO THERE BEING NO \"GENUINE PARTS\" AVAILABLE I AM STUCK PAYING FOR A RENTAL. I AM ACTIVE DUTY AIR FORCE STATIONED IN ENGLAND, AND THE GARAGE ON BASE CAN ORDER A NEW ALTERNATOR AND INSTALL IT, BUT I HAVE BEEN TOLD BY THE MOPAR CERTIFIED GARAGE OFF BASE THAT SINCE THE PART IS NOT A GENUINE PART THEN I AM UNABLE TO RECEIVE A REIMBURSEMENT. I VERIFIED THIS WITH THE MILITARY AUTO SALES MAIN OFFICE IN GERMANY AND WAS TOLD THAT I COULD STILL SUBMIT THE RECEIPTS WITH HOPES OF BEING REIMBURSED. BEFORE I TELL THE GARAGE ON RAF LAKENHEATH TO GO AHEAD WITH ORDERING THE PART I WANTED TO HEAR FROM THIS OFFICE IF I WILL BE REIMBURSED OR NOT. KEEP IN MIND MY ONLY MODE OF TRANSPORTATION IS DEAD AND I AM PAYING FOR A RENTAL OUT OF POCKET, IF THE GENUINE PARTS WERE TO BECOME AVAILABLE WITHIN THE NEXT WEEK I COULD HOLD OUT AND WAIT BUT THE LONGER I WAIT THE MORE IT SEEMS LIKE JUST TAKING THE PART THAT IS AVAILABLE IS THE CHEAPER OPTION AS THERE IS NO DATE ON WHEN GENUINE PARTS WILL BECOME AVAILABLE.    THANK YOU,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056616,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL T36. DODGE DEALERSHIP TELLS ME THEY STILL DO NOT HAVE THE PARTS TO FIX THE RECALL.  IT HAS BEEN FIVE MONTHS SINCE I RECEIVED MY RECALL LETTER. WHAT IS BEING DONE TO CORRECT THIS PROBLEM?",
        "vin": "2C3CDYBT3EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/24/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL FROM JUNE 2017 FOR THE ALTERNATOR DIODE HAS NOT BEEN DONE DUE TO LACK OF PARTS AS OF 12-24-2017.",
        "vin": "2C3CDYBT7EH"
    },
    {
        "components": "STEERING,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055885,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2014 DODGE CHALLENGER. I WAS DRIVING AND MADE A LEFT HAND TURN AND THEN MY ABS CAME ON AND NOW I CANT USE MY CRUSE CONTROL AND I CANT TURN THE TRACTION CONTROL OFF OR ON . CALL DODGE AND THEY ARE TELLING ME IT IS A CLOCK SPRING IN THE STEERING COLUMN AND THE PRICE IS $589.00 AND THE LABOR WILL BE ABOUT $300.00. I THINK THAT'S IS A BAD PART TO PUT IN A CAR.",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048203,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE DRIVING 35-40 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE. CROWN CHRYSLER DODGE JEEP RAM (3710 W WENDOVER AVE, GREENSBORO, NC 27407, (336) 790-9850) STATED THAT THE PART WAS NOT YET AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 70,119.",
        "vin": "2C3CDYBT3EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "11/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044263,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -      NHTSA RECALL NUMBER - 17V-435    MANUFACTURER RECALL NUMBER - T36    THE ALTERNATOR MAY EXPERIENCE DIODE THERMAL FATIGUE FAILURE DUE TO CYCLICAL LOADS INDUCED BY ELECTRO-HYDRAULIC POWER STEERING.",
        "vin": "2C3CDYBT8EH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "09/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039492,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT NOTICE ON RECALL OF ALTERNATOR WITH POSSIBLE STEERING MALFUNCTION, WAS TOLD THAT REMEDY WON'T BE FOR 5 MONTHS . SEEMS LIKE THIS SHOULD BE ADDRESSED ASAP.",
        "vin": "2C3CDYBT7EH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/21/2017",
        "dateOfIncident": "10/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035420,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S RECALLED NEED IT FIXED SO I DON'T HAVE A WRECK",
        "vin": "2C3CDYAG8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2017",
        "dateOfIncident": "02/15/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034635,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ALTERNATOR DIODES NEED REPLACEMENT OR WHOLE ALTERNATOR. NOTHING HAS HAPPENED YET.",
        "vin": "2C3CDYBT8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032788,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE DRIVING 55 MPH, THE HEADLIGHTS DIMMED AND THE VEHICLE STALLED. THERE WERE NO WARNING INDICATORS ILLUMINATED; HOWEVER, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED THREE WEEKS PRIOR. THE VEHICLE WAS TAKEN TO BREEDEN DODGE CHRYSLER JEEP RAM (5900 US-71 BUS, FORT SMITH, AR 72908 (479) 646-4731) FOR THE CHECK ENGINE INDICATOR WARNING AND DIAGNOSED THAT THE OTC SENSOR FAILED. THE VEHICLE WAS NOT REPAIRED AND WAS INFORMED THAT THE VEHICLE WOULD BE FINE FOR A FEW WEEKS. THE VEHICLE WAS TOWED TO BREEDEN DODGE CHRYSLER JEEP RAM (5900 US-71 BUS, FORT SMITH, AR 72908 (479) 646-4731) WHERE IT WAS DIAGNOSED WITH A FAULTY BATTERY. THE CONTACT WAS LATER INFORMED THAT A PROPER DIAGNOSIS COULD NOT BE PERFORMED UNTIL THE BATTERY WAS REPLACED. THE CONTACT STATED THAT THE TECHNICIAN INFORMED HER THAT SHE WOULD NEED TO BRING THEM A BATTERY. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V435000 (ELECTRICAL SYSTEM), BUT THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 63,000.",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022790,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE USED 8/16/2017.  ON 9/7/2017 VEHICLE WAS IN MY DRIVEWAY AND WOULD NOT START.  CODES APPEARED ON DASHBOARD AND SERVICE ENGINE SYMBOL FLASHING WHICH MEANS DO NOT USE THE VEHICLE !!!  VEHICLE HAD TO BE FLATBEDDED TO CARSENSE IN HATFIELD PA.  CARSENSE DETERMINED FAILED TPIM.  TPIM WAS REPLACED BY SANDS DODGE QUAKERTOWN PA.",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "06/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005352,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE THE CONTACT WAS ADJUSTING THE FRONT PASSENGER SEAT TO MOVE THE TRACK BACK AND FORTH, THE PARTS FRACTURED AND THE SEAT FAILED TO SECURE BACK ON THE TRACK. THE DEALER (CHRYSLER IN OTTAWA, 510 E NORRIS DR, OTTAWA, IL 61350, (866) 374-5828) INDICATED THAT THE SEAT TRACK NEEDED TO BE REPLACED. THE MANUFACTURER PROVIDED NO RECALL SOLUTION OTHER THAN THE PART BEING REPLACED BY A DEALER. THE APPROXIMATE FAILURE MILEAGE WAS 65,000.",
        "vin": "2C3CDYBT0EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/08/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003280,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO REPLACE RACK & PINION STEERING AT 40,000 MILES.  DIFFICULT TO STEER ESPECIALLY TO THE LEFT.  ON ONE OCCASION WHEN EXITING A LEFT HAND CURVE THE VEHICLE DID NOT WANT TO TURN BACK TO THE RIGHT.  I HAVE GOOGLED THE PROBLEM AND HAVE LEARNED THAT THERE HAVE BEEN NUMEROUS REPORTS OF SIMILAR PROBLEMS BUT DODGE HAS NOT ISSUED A RECALL.  I WAS ADVISED THAT MINE WAS NOT COVERED UNDER WARRANTY SO I HAD IT REPLACED VIA AN INDEPENDENT MECHANIC.  I HAVE ATTEMPTED TO RECEIVE REIMBURSEMENT FROM DODGE BUT THEY REFUSE.  AT TIMES WHEN THE VEHICLE WAS STOPPED OR MOVING SLOWLY, IT LITERALLY TOOK BOTH HANDS TO TURN THE STEERING WHEEL.  THE VEHICLE HAD 22,000 MILES WHEN I PURCHASED IT.  I THOUGHT THE STEERING WAS JUST \"STIFF\" BUT NOW I REALIZE THAT THERE WAS A PROBLEM WITH THE STEERING WHEN I BOUGHT THE VEHICLE.  I COULD NOT BELIEVE THE DIFFERENCE AFTER REPLACEMENT OF THE RACK & PINION.  I CAN NOW TURN THE WHEEL WITH ONE FINGER.  THIS APPEARS TO ME TO BE A SERIOUS SAFETY ISSUE AND QUESTION WHY DODGE HAS NOT ISSUED A RECALL, PARTICULARLY WITH AS MANY CASES I ALONE HAVE FOUND OF SIMILAR PROBLEMS.",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002679,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON LOST POWER WHILE DRIVING, LIGHTS AND STEREO WENT CRAZY. CAR SHUT DOWN AND LIGHTS AND STEREO STILL GOING WHEN TOW TRUCK ARRIVED TO TOW TO HOUSE 40 MINUTES LATER. HAD TO DISCONNECT BATTERY TERMINAL TO SHUT EVERYTHING DOWN. FORTUNATELY MY SON WAS NOT HURT OR ANY ONE ELSE.",
        "vin": "2C3CDYAG0EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "07/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002684,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MORNING WHILE I WAS DRIVING DOWN A CURVY DARK COUNTRY ROAD AT ABOUT 60 MILES PER HOUR, THE CAR JUST SHUT OFF, ALL POWER WAS LOST. LIGHTS AND EVERYTHING. LOST POWER STEERING, POWER BRAKES, ALL LIGHTING. WE WERE VERY LUCKY WE DID NOT CRASH, BUT THIS ISSUE IS VERY DANGEROUS. I BELIEVE THAT THIS VEHICLE SHOULD BE INCLUDED IN THE FOLLOWING RECALL AS IT DESCRIBES SPECIFICALLY WHAT HAPPENED TO MY VEHICLE. P60/NHTSA 14V-634",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2017",
        "dateOfIncident": "05/12/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986152,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. AFTER DRIVING THE VEHICLE, THE CONTACT PARKED IN THE GARAGE. THE CONTACT NOTICED SMOKE EMERGING FROM THE ENGINE COMPARTMENT. THE HOOD WAS OPENED AND THE CONTACT DISCOVERED THAT THE ALTERNATOR WAS  SMOKING. THE VEHICLE FAILED TO START AFTERWARDS. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DETERMINED THAT THE ALTERNATOR NEEDED REPLACEMENT; HOWEVER, IT WAS NOT PART OF THE WARRANTY. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,072.",
        "vin": "2C3CDYAG1EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980971,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE DRIVING OVER 40 MPH AND ATTEMPTING TO STOP THE VEHICLE, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED OR DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 31,555. [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "2C3CDYBT6EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2017",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978518,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH SPEED/ACCELERATION/AND CASUAL SPEED STALLING. FREEWAY SPEED CAUSES STALLING/BUCKLING HESITATION, THE ENGINE LIGHT WILL GO ON, AND THE CAR WILL CONTINUE TO REDUCE SPEED UNTIL IT IS STOPPED/OFF. AFTER A SHORT TIME (UP TO TWO DAYS), THE ENGINE LIGHT WILL GO OFF BEFORE I GET TO THE SERVICE CENTER, WHICH LEADS TO THE DEALERSHIP TELLING ME \"IF WE CANNOT RE- CREATE THE PROBLEM, THEN WE CANNOT FIX IT.\"  THE PROBLEM HAS HAPPENED OVER 10 TIMES, AND HAS NOW PROGRESSED TO HAPPENED WITH A CASUAL/ OR ISLE SPEED AS WELL. THE LEVEL OF SEVERITY HAS ALSO INCREASED AS WELL AS THE TIME FRAME OF THE STALLING",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/04/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10958644,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS INVOLVED IN A FRONT END CRASH AND AIR BAG DID NOT DEPLOY.CAR WAS MOVING.",
        "vin": "2C3CDYAGOEH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897220,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE VEHICLE STALLED MORE THAN TWICE. THE VEHICLE WAS TAKEN TO THE DEALER WHO REPROGRAMMED THE KEY FOB AND INDICATED THAT THERE HAD BEEN AN ELECTRICAL CONNECTION FAILURE BETWEEN THE KEY AND THE IGNITION. AFTER THE REPAIR, THE VEHICLE CONTINUED TO STALL. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS NOT AVAILABLE. ...UPDATED 10/19/16 *BF  *TR",
        "vin": "2C3CDYAG4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886019,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED EXITING  INTERSTATE IN TRAFFIC WITHOUT WARNING AND WOULD NOT RE-START/ TURNOVER.  VEHICLE IS PUSH BUTTON START.  VEHICLE WAS TRAVELING AT APPROXIMATELY 60 MPH.  VEHICLE MILEAGE AT FAILURE WAS 3, 657 MILES.   DEALER REPLACED PCM & WIRELESS IGNITION",
        "vin": "2C3CDYAG6EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/04/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882453,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN TRYING TO GET A SAFETY RECALL REPAIRED ON MY DODGE CHALLENGER'S ALTERNATOR FOR THE LAST FOUR MONTHS FROM SOUTH POINTE CHRYSLER/JEEP/DODGE LOCATED ON 9240 S MEMORIAL DR, TULSA, OK 74133. I'VE CALLED THE DEALERSHIP ON FIVE DIFFERENT OCCASIONS EACH TIME NO INFORMATION CAN BE GIVEN TO ME ON WHY MY RECALL ISN'T BEING REPAIRED OR HOW LONG IT WILL TAKE. THE LAST TIME I CALLED ON 6/22/16  I HAD TO LEAVE A MESSAGE WITH THE SERVICE MANAGER, THAT HAS STILL NOT RETURNED MY CALL. I'M GETTING THE RUN AROUND AT THIS DEALERSHIP AND FEEL AS IF MY SAFETY AND THE SAFETY OF OTHERS IS NOT IMPORTANT TO THEM. I WOULD THINK SOMETHING AS SERIOUS AS MY ALTERNATOR FAILING CAUSING MY VEHICLE TO SHUTDOWN WHILE I'M DRIVING OR AN UNDER HOOD ELECTRICAL FIRE WOULD BE OF CONCERN BUT APPARENTLY IT ISN'T TO SOUTH POINTE. PLEASE HELP ME GET THIS RECALL REPAIRED BEFORE SOMEONE IS SERIOUSLY INJURED DUE TO THE RAPID ALTERNATOR FAILURE THAT I MAY EXPERIENCE WITH MY VEHICLE.",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "06/17/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875907,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE JANUARY 2014.  AT 7000 MILES, REAR ENGINE SEAL BEGAN LEAKING.  REPLACED UNDER WARRANTY.  VALVE ROCKER ARM GUIDES REPLACED UNDER SERVICE BULLETIN FOR TICKING NOISE AT 9000 MILES. LEAKING VALVE COVER GASKET REPLACED AT 10,000 MILES (RESULT OF PREVIOUS REPAIR). CHECK ENGINE LIGHT AT 11,750 MILES - OVER-REV CODE - THIS CONDITION OCCURRED AT 70 MPH, ACCOMPANIED BY A SUDDEN DECELERATION AND \"CHIRPING\" OF REAR TIRES.  VEHICLE HAS NOT BEEN ABUSED IN ANY WAY.  CURRENTLY HAVE 12,000 MILES ON VEHICLE AND DREADING WARRANTY EXPIRATION IN 6 MONTHS...",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873633,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS FOR THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AFTER REPLACING THE BATTERY, THE BATTERY WARNING LIGHT ILLUMINATED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 36,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CDYAG8EH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/06/2015",
        "dateOfIncident": "03/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788902,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE RIMS WERE CRACKED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN VERIFIED THE FAILURE AND STATED THAT THERE WAS NO SIGN OF IMPACT. AS A RESULT, THE RIMS NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 20,000.   UPDATED 1/14/16 LN  *TR",
        "vin": "2C3CDYBT9EH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780815,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A \"SERVICE POWER STEERING SYSTEM\" MESSAGE APPEARED ON THE EVIC SCREEN WHILE DRIVING AT 40 MPH WITH CRUISE CONTROL ENGAGED WITH FAILURE OF THE ELECTRO-HYDRAULIC STEERING MOTOR.  MANUAL STEERING REMAINED FUNCTIONAL WITH SIGNIFICANTLY HIGHER TURNING RESISTANCE (AS STATED IN OWNER'S MANUAL) FOR RECOVERY TO A NEARBY PARKING LOT.  VEHICLE WAS TOWED TO A LOCAL DODGE DEALER SERVICE CENTER FOR REPAIR.  INVESTIGATION REVEALED FAILURE OF THE ELECTRONIC POWER STEERING HYDRAULIC UNIT CONTROL, WARRANTING REPLACEMENT OF THE RACK AND PINION ASSEMBLY UNDER WARRANTY.  THE FAILURE WAS PRECEDED BY AN ASSOCIATED MIL APPROXIMATELY 4 DAYS PRIOR, WITH COMPLETE FAILURE OCCURRING THEREAFTER WHILE (WHILE WAITING FOR NEXT AVAILABLE DODGE SERVICE APPOINTMENT OPENING).",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/24/2015",
        "dateOfIncident": "09/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10776411,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE F1 SUPERCAR",
                "productYear": "9999",
                "size": "245/45ZR20",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER EQUIPPED WITH GOODYEAR EAGLE F1 SUPERCAR TIRES, SIZE: 245/45ZR20. WHILE DRIVING 45 MPH, THERE WAS A VIBRATION IN THE TIRES AND THE VEHICLE VEERED TO THE LEFT. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS CONFIRMED THAT ALL FOUR TIRES WERE CRACKED ABOVE THE SIDEWALLS AND THE DRIVER SIDE FRONT TIRE WAS FLAT. THE TIRES WERE REPLACED. THE TIRES WERE THE ORIGINAL TIRES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE DOT NUMBER WAS UNKNOWN. THE APPROXIMATE TIRE AND VEHICLE FAILURE MILEAGE WAS 20,100.",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10765177,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE STALLED WITHOUT WARNING. IN ADDITION, THE CONTACT MENTIONED THAT WHEN THE VEHICLE WAS ON OR OFF, THE FRONT DRIVER SIDE WINDOW OPERATED INDEPENDENTLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE ALTERNATOR AND THE BATTERY NEEDED TO BE CHARGED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 32,000.",
        "vin": "2C3CDYAG4EH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "11/21/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10762177,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 DODGE CHALLENGER. WHILE DRIVING 20 MPH, ANOTHER VEHICLE CRASHED INTO THE DRIVER'S SIDE OF THE CONTACT'S VEHICLE. THE CONTACT WAS TRAPPED INSIDE THE VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED MULTIPLE INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 28,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/19/2015",
        "dateOfIncident": "08/04/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10749783,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT'S VEHICLE CRASHED INTO THE FRONT PASSENGER SIDE OF ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE FRONT SEAT OCCUPANT SUSTAINED INJURIES TO THE HEAD AND LEFT KNEE THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC FOR EXTERIOR BODY DAMAGE REPAIRS. THERE WAS SEVERE FRONT END DAMAGE TO THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2015",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748216,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT AN UNKNOWN SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 40,000.",
        "vin": "2C3CDYBT7EH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "03/26/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744923,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DRIVE HOME FROM PURCHASING VEHICLE WE NOTICED A LOUD CLUNKING IN THE REAR END WHILE IN STOP AND GO TRAFFIC.  CALLED DEALERSHIP IMMEDIATELY.  SALES MANAGER SAID IT WAS NORMAL, THEY ALL DO THAT.  TOOK IT IN FOR SERVICE, TECH TEST DROVE IT AND SAID IT WAS NOT NORMAL & SEEMED TO BE PROBLEM IN THE REAR DIFFERENTIAL.  WHEN BROUGHT IN FOR REPAIRS THEY ONLY UPDATED COMPUTER SYSTEM.  PROBLEM PERSISTED WITH LOUD CLUNK AND HARD SHIFTING AT ABOUT 1500 RPM AND SLOWING AND ENGAGING GAS AT LOWER SPEEDS, TYPICALLY BETWEEN 30-40 MPH.  TOOK BACK IN, AFTER SOME TIME INVESTIGATING AND COMING UP WITH NO DIAGNOSIS THEY CONTACTED MANUFACTURERS \"STAR CENTER\" AND WERE ADVISED IT WAS A SHIFT BINDING PROBLEM IN THE REAR DIFFERENTIAL.  THEY REPLACED THE VALVE BODY & RESET THE TRANSMISSION SHIFT ADAPTIVE.  PROBLEM STILL PERSIST WHILE THE DEALERSHIP & MANUFACTURER INSISTS IT MEETS MANUFACTURER SPECS.  CONCERN IS WITH THE REAR DIFFERENTIAL BINDING AND LOCKING UP CAN & MAY LOCK THE REAR END UP BRINGING THE CAR TO AN IMMEDIATE & ILL TIMED STOP IN TRAFFIC.",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10736116,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED NOTICE OF THE RECALL ON THE ALTERNATOR SEVERAL MONTHS AGO AND HAVE CONTACTED THE DEALERSHIP MULTIPLE TIMES. EACH TIME THE DEALERSHIP STATES THAT THE DO NOT HAVE THE NEEDED PART IN STOCK AND THAT THEY WILL RETURN OUR CALL. WE HAVE NEVER RECEIVED A RETURN CALL. THE VEHICLE HAS COMPLETELY STOPPED WORKING ELECTRONICALLY ON THE HIGHWAY GOING APPROXIMATELY 60 MPH TWICE. THANK YOU.",
        "vin": "2C3CDYAG0EH"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "07/15/2015",
        "dateOfIncident": "05/26/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10734150,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A CAR CRASH WHERE I DID NOT HAVE TIME TO APPLY THE BREAKS BEFORE HITTING ANOTHER CAR. THE CAR MADE A SUDDEN LEFT TURN IN FRONT OF ME AND I T-BONED THE CAR AT A RATE OF ABOUT 45MPH. AT HE TIME OF THE CRASH MY AIRBAGS DID NOT DEPLOY, SO I CONTACTED CHRYSLER ABOUT THIS, AND THE SENT A INVESTIGATOR TO LOOK AT MY CAR. IN A LETTER THEY SAID, THE CONCLUSION OF THE INVESTIGATION IS THAT THE RATE OF DECELERATION NECESSARY TO ACTIVATE THE AIR BAG SYSTEM WAS NOT PRESENT DURING THE ACCIDENT.  HOW MUCH DAMAGE DO YOU HAVE TO DO TO THE FRONT OF A CHALLENGER IN A CRASH FOR THE AIRBAGS TO WORK. THERE IS OVER $12000 IN DAMAGE TO MY CAR, NOT TO MENTION THE THOUSANDS OF DOLLARS IN MEDICAL BILLS I HAVE ALONG WITH THOUSANDS OF DOLLARS IN LOST WAGES. I NO LONGER FEEL SAFE DRIVING THIS CAR ONCE IT IS REPAIRED, AND NO LONGER WANT TO OWN A CHRYSLER PRODUCT.",
        "vin": "2C3CDYBT7EH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/14/2015",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10733918,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE DRIVING APPROXIMATELY 25 MPH, ANOTHER VEHICLE LOST CONTROL AND CRASHED INTO THE FRONT DRIVER SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED BACK AND LEG INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 17,000.",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725846,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ALTERNATOR RECALL WAS REPLACED AND THREE WEEKS LATER ON 5/1 THE CALL STALLED OUT QUIT IN THE MIDDLE OF THE ROAD AND TOWED THE CAR TO THE DEALER ON THE NEXT DAY (SATURDAY).  DEALER COULD NOT GET TO IT UNTIL TUESDAY.  AGAIN, I NOTICE FLUCTUATIONS IN THE FUEL SYSTEM WEEK OF JUNE 7TH.  GAS GAUGE  DID NOT MOVE FOR WEEK FROM DRIVING IT A FEW TIMES. ALTHOUGH THE CAR SHOWS 214 MILES TO EMPTY.  ON 6/17, THE CAR HAD TO BE TOWED AGAIN SHOWING SAME SYSTEMS AS BEFORE WITH THE FUEL PUMP.",
        "vin": "2C3CDYAG6EH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "05/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10715640,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE VEHICLE CRASHED INTO A POLE CAUSING SIGNIFICANT DAMAGE TO THE FRONT END. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUSTAINED INJURIES TO THE NECK, BACK, AND KNEES. MEDICAL ATTENTION WAS RECEIVED AND A POLICE REPORT WAS FILED. THE EXTENT OF THE DAMAGE TO THE VEHICLE WAS NOT YET DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 13,000.",
        "vin": "2C3CDYAG8EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2015",
        "dateOfIncident": "04/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705226,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED ON CAR AND CHECK ENGINE LIGHT CAME ON IT SHOWS TROUBLE SHOOTING CODE P0520 OIL PRESSURE SENSOR MY CAR BARELY HAS 8100 MILES ON IT AND IT'S 1 YEAR AND 4 MONTHS OLD ALSO THIS PROBLEM IS ALSO CAUSING  INTERFERENCE WITH MY REMOTE START.  *TR",
        "vin": "2C3CDYBT5EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "03/26/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702035,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM) HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR . THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.    UPDATED 5/11/15*CN  THE CONSUMER STATED THE DEFECTIVE PART WAS REPLACED ON 4-7-15*JB",
        "vin": "2C3CDYAG9EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "12/30/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701548,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHRYSLER CORP. SENT ME A \"RECALL NOTICE\" MID DECEMBER 2014 FOR NUMBER P60 ALTERNATOR. THE LAUNCH DATE WAS DECEMBER 1, 2014. THE ALTERNATOR DIODES IN MY VEHICLE COULD EXPERIENCE A RAPID FAILURE. VEHICLE ELECTRICAL SYSTEM VOLTAGE MAY DROP TO CRITICAL LEVELS, DISABLING ABS, ESC, ECM ( COMPUTER) AND CBC. THE DRIVER WILL HAVE ALMOST NO WARNING, RESULTING IN VEHICLE SHUTDOWN WHILE DRIVING AND MAYBE UNDER-HOOD ELECTRICAL FIRE. I HAVE EXPERIENCED THIS ALTERNATOR FAILURE...BREAKDOWN.. BEING STRANDED ON A 1989 OLDSMOBILE I OWNED YEARS AGO. I HAVE CALLED THE RECALL ASSISTANCE CENTER THREE OR FOUR TIMES, THE RECORDED MENU OR LIVE PERSONS KNOW NOTHING ONLY TO SAY THEY ARE SORRY FOR THE ISSUE AND LONG WAIT. I HAVE CALLED MY HOMETOWN DODGE DEALER, WHERE I PURCHASED THE CAR AND THEY HAVE EXPRESSED BEING SORRY FOR LONG WAIT ( ALMOST 4 MONTHS). I HAVE BEEN RENTING CARS FOR PAST THREE MONTHS WHEN TAKING TRIPS LONGER THAN 60 MILES ONE WAY. I HAVE REAL FEAR OF BEING BROKE DOWN WITH ASSOCIATED WRECKER, MOTEL AND REPAIR COSTS. IN SUMMARY, THIS WHOLE THING HAS TAKEN TOO LONG SO I AM FILING MY COMPLIANT TODAY.  *TR",
        "vin": "2C3CDYAG1EH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/16/2015",
        "dateOfIncident": "03/05/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10694718,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A RED LIGHT, WHEN IT TURNED GREEN I SLOWLY STARTED TO GO. MY WINDSHIELD WAS FOGGING UP AND A SAW A LITTLE BIT OF SMOKE. BEFORE I KNEW IT MY AIRBAGS DEPLOYED AND I HIT THE CAR IN FRONT OF ME. DRIVER AIRBAG AND THE PASSENGER AIRBAG DEPLOYED. I WAS THE ONLY PERSON IN THE VEHICLE.   *TR",
        "vin": "2C3CDYAG4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "02/07/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693313,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED AND ATTEMPTING TO BRAKE, THE BRAKES FAILED AND THE ELECTRONIC STABILITY CONTROL WARNING LIGHT ILLUMINATED. AS A RESULT, THE CONTACT CRASHED INTO AN ANIMAL AND INTO A RETAINING WALL. THE CONTACT DID NOT DISCLOSE IF A POLICE REPORT WAS FILED OR NOT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THE ELECTRONIC STABILITY CONTROL FAILED. THE VEHICLE WAS REPAIRED BUT THE REPAIRS TO THE VEHICLE WERE UNKNOWN. THE CONTACT RECEIVED NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 13,000.",
        "vin": "2C3CDYAG4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693026,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM). HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2C3CDYAGXEH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2015",
        "dateOfIncident": "12/08/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692085,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED A NOTICE FOR NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2C3CDYAG3DH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690038,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WANTING TO COMPLAIN ABOUT HOW LONG THIS PART IS TAKING TO FIX THE RECALL P60 ALTERNATOR PROBLEM. CHRYSLER KNOWN ABOUT THIS PROBLEM JULY LAST YEAR, FINALLY ISSUED A RECALL END OF NOVEMBER AND STATES THAT THERE IS NO PART TO FIX AT CURRENT TIME. MY CHALLENGER IS AN EVERYDAY DRIVER. I DRIVE ON INTERSTATES AND HWYS EVERYDAY. KNOWING MY CAR COULD STALL AT ANYTIME WITHOUT WARNING ISN'T A GOOD FEELING TO HAVE EVERYDAY. THIS COULD CAUSE INJURIES OR EVEN WORSE FATALITIES ON THE INTERSTATES IF THIS OCCURS. I THINK MANUFACTURER HAS HAD PLENTY OF TIME TO GET A PART TO FIX THE PROBLEM BY NOW. I HAVE TRIED CALLING THE HOTLINE NUMBER ON THE RECALL AND THEY JUST SAY THEY HAVE NO IDEA WHEN THE PART WILL BE AVAILABLE. I'M SORRY BUT IF THIS IS SOMETHING THEY MAKE EVERYDAY IN A PLANT THEY SHOULD OF ALREADY HAD THE PART OR THE ALTERNATOR TO FIX THE PROBLEM. THERE SHOULD BE NO REASON THIS PART IS TAKING SO LONG TO GET.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "02/11/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681003,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2014 DODGE CHALLENGER R/T 6 SPEED MANUAL TRANSMISSION ON JANUARY 6TH 2014. THIS WAS MY DREAM CAR AND I NEVER THOUGHT I COULD AFFORD ONE. SO IT SADDENS ME TO HAVE TO GO TO THIS EXTREME TO GET SOME INVOLVEMENT ON A ISSUE THAT IS BEING IGNORED. MY FIRST SERVICE WAS ON FEBRUARY 11TH.I TOOK THE CAR IN BECAUSE OF ENGINE NOISE. THE DEALER REPLACED THE CATALYTIC CONVERTER THINKING THAT WAS THE NOISE. ON MAY 31ST AT 5,000 MILES THE DEALER REPLACED THE LIFTERS ON THE CAR. THESE DID NOT SOLVE THE ISSUE AND IT WAS GETTING LOUDER. YOU CAN HEAR IT INSIDE THE CAR WHILE DRIVING. I TOOK THE CAR TO ANOTHER DEALER AT AROUND 10,000 MILES WITH THE SAME NOISE COMPLAINT ON NOVEMBER 8TH. I CALLED DODGE CUSTOMER SERVICE AFTER NO RESOLUTION. THEY REFERRED ME BACK TO THE DEALER TO DO A DIAGNOSIS ON THE CAR. I PICKED THE CAR BACK UP ON NOVEMBER 11TH AND THE DEALER INFORMED ME THAT THIS NOISE IS AND I QUOTE \"AGREE THAT NOISE IS LOUDER THAN A 15 MODEL BUT NOISE IS STILL THERE IN A 15 MODEL. COMMON NOISE THAT DIFFER SLIGHTLY FROM VEHICLE TO VEHICLE. REVIEWED TSB AND STAR CASE. LIFTERS HAD BEEN CHANGED BY ANOTHER DEALERSHIP. CONDUCTED PROCEDURE IN STAR CASE [XXX] AND INSPECTED COMPONENTS FOR FAILURES LISTED IN STAR CASE [XXX]. CONTACTED STAR AND THERE REPLY WAS SLIGHT VALVE TRAIN NOISE/CLATTER IS CHARACTERISTIC OF HEMIS. IF LIKE VEHICLE HAS COMPARABLE NOISE LEVEL NO REPAIR TO PERFORM. NOISE MAY INCREASE SLIGHTLY WITH MILEAGE. I HAVE BEEN BACK TO THE DEALER RECENTLY TO HAVE THIS LOOKED INTO AGAIN WITH NO LUCK. THERE ARE 60+ OF THIS ISSUE DOCUMENTED WITH VIN #S ON A FORUM WHICH I AM A MEMBER OF AND WE ALL WOULD BE MORE THAN HAPPY TO PROVIDE INFORMATION FOR.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2C3CDYBT9EH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10676609,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT AFTER SHIFTING THE VEHICLE INTO DRIVE, IT ACCELERATED WITHOUT WARNING AND CAUSED THE CONTACT TO CRASH INTO A BUILDING. THE CONTACT SUSTAINED A FRACTURED THUMB AND WHIPLASH THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE ACCELERATOR PEDAL FRACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 6,316.    UPDATED 4/27/15*CN",
        "vin": "2C3CDYAG2EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672247,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM); HOWEVER, THE PART WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "01/20/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668901,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 CHALLENGER R/T HAS HAD A BAD TICKING VALVE TRAIN SINCE ABOUT NEW. THE TICKING, CLIPPING, SEWING MACHINE NOISE IS ON THE PASSENGER SIDE,IT'S LOUD AND CLEARLY HEARD IN THE CAB AT AROUND 1500RPM AND UP. STAR CASE TAB REMOVAL WAS PERFORMED, NO GOOD.NEXT LIFTERS AND MDS SOLENOIDS WAS REPLACED STILL NO GOOD. NOW ALONG WITH THE TICKING NOISE I HAVE LOUD SPARK KNOCK IN MDS MODE ON PASSENGER SIDE. HAVE BURNT OIL SMELL AFTER ATTEMPTED REPAIRS. DEALER AND DODGE REP SAYS ALL IS NORMAL. WHY WAS ALL THESE REPAIRS ATTEMPTED   TO FIX MY ENGINE NOW ALL OF A SUDDEN IT'S ALL NORMAL? WHAT'S NORMAL ABOUT LOUD TICKING VALVE TRAIN THAT CAN BE HEARD IN THE CAB, LOUD SPARK KNOCK AND BURNING OIL SMELL? IT'S NOT, THEY WANT ME TO GO AWAY! WELL I'M NOT! I QUALIFY FOR LEMON LAW BUT JUST WANT MY CAR REPAIRED. ISN'T THAT WHAT A WARRANTY IS FOR? COME ON DODGE STEP UP AND REPAIR MY ENGINE! GIVE ME WHAT I PAID FOR! DON'T TREAT YOUR CUSTOMERS LIKE DIRT!  *TR",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2014",
        "dateOfIncident": "04/08/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667169,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW CAR DELIVERED HAD A TICKING SOUND ONLY WHILE DRIVING AT APROX 1800 RPM'S AND ABOVE..  COMPLAINED TO DEALER AND WAS TOLD \"NORMAL\" FOR NEW CAR UNTIL ENGINE BREAK-IN.  WEEKS LATER STAR CASE [XXX] PERFORMED ON CAR TO REMOVE TABS LEFT ON LIFTERS AT ENGINE ASSEMBLY.  TABS REMOVED, NO RELIEF FROM TICKING.  CHRYSLER REP AUTHORIZED DEALER TO CHANGE REGULAR OIL TO SRT PENZOIL 0W40 FULL SYNTHETIC WITH COST BEING BILLED TO CHRYSLER FOR NEXT 5 YEARS.  TICKING IS STILL HEARD INSIDE VEHICLE WHILE DRIVING.  DEALER REFUSES TO SERVICE CAR FOR \"TICKING\" ENGINE. I WAS TOLD DODGE WOULD NOT PAY FOR THEIR TIME TO CHECK THE CAR.  I TOOK CAR OUT OF STATE TO ANOTHER DEALER WHO WAS NOT ABLE TO REPAIR TICKING PER DODGE. THIS IS NOT THE HEMI TICK.  SOME CUSTOMERS ARE GETTING THEIR CARS REPAIRED, OTHERS ARE BEING BRUSHED OFF AS \"NORMAL\".  SOME HAVE HAD ENGINES REPLACED AND ANOTHER HAS HAD HIS VEHICLE REPLACED.  IF THIS IS \"NORMAL\" WHY AREN'T ALL 5.7 ENGINES DOING THIS?  THEY'RE NOT!  IT IS EXTREMELY ANNOYING TO LISTEN TO THE TICKATICKATICKA CONSTANTLY WHILE DRIVING.  IT IS EMBARRASSING TO HAVE PASSENGER'S HEAR THE TICKING.  I HAVE GATHERED ABOUT 60 OTHER HEMI 5.7 OWNERS TOGETHER ALL WITH THE SAME PROBLEM.  WHY WON'T CHRYSLER/DODGE FIX OUR CARS?    AN EMAIL FROM CHRYSLER STATED \" \"TO REVIEW OF OUR RECORDS INDICATES THAT THE CONDITION IN QUESTION IS A FUNCTION OF YOUR VEHICLE'S DESIGN AND IS NOT A DEFECT IN MATERIALS, WORKMANSHIP, MANUFACTURING, OR FACTORY PREPARATION. THESE ARE THE ONLY TYPES OF DEFECTS COVERED UNDER THE NEW VEHICLE LIMITED WARRANTIES.\"  WHAT THEY ARE TELLING ME IS THAT THEY KNEW THIS PROBLEM EXISTED AND IT'S A FUNCTION OF MY VEHICLE'S DESIGN?  THERE IS NOTHING IN ANY DOCUMENTS I HAVE THAT STATE THIS CAR WILL TICK AS IT DOES.  I WOULD NOT HAVE PURCHASED THIS VEHICLE IF TICKING WAS PART OF THE CAR'S DESIGN.  FIX IT CHRYSLER!!!!!  *TR",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2014",
        "dateOfIncident": "11/24/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662717,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2014 DODGE CHALLENGER. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V634000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 13,000.",
        "vin": "2C3CDYAG4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER 14V634000 (ELECTRICAL SYSTEM) AND WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/06/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653218,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WASHING MY CAR AND WHEN IT CAME DOWN TO THE TIRES THE SIDEWALL HAD CHUNKS OF RUBBER COMING OFF THE TIRES AFTER LOOKING ALL 4 TIRES WAS DOING IT. TO ME IT IS A SAFETY ISSUE COULD CAUSE A BLOWOUT IF I TAKE A EXIT RAMP HARD. THE SIZE 245/45/ZR 20 GOODYEAR EAGLE F1 SUPERCAR TIRES.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "09/12/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643270,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. WHILE DRIVING APPROXIMATELY 115 MPH, THE VEHICLE SHOOK VIOLENTLY. THE FAILURE OCCURRED ON THREE OCCASIONS. THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 500.",
        "vin": "2C3CDYBT1EH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640703,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A WHINE WHICH COMES AND GOES AS THE CAR HITS AND MAINTAINS A CRUISING SPEED.  TOOK TO DEALER SEVERAL TIMES AND THEY HAVE STATED THAT IT IS A NORMAL CONDITION.  ALSO CAR HAS A HESITATION UPON START FROM A STOP AND HAS TICKING FROM THE ENGINE BAY.  TICKING WAS CALLED \"NORMAL\" BY DEALER.  AM NOW WORKING WITH DODGE DIRECTLY TO NO AVAIL TO HAVE ISSUES RESOLVED.  *TR",
        "vin": "2C3CDYBT4EH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/23/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628557,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2014 CHALLENGER SHAKER HAS OVER 6\" OF WATER IN TRUNK'S SPARE TIRE CAVITY THAT SPLASHES ON BATTERY AND REAR FUSE BOX. THE TRUNK LEAKS ON BOTH TIRE WELL SEAMS AND INSIDE DRIVER'S REAR FENDER TO THE SPARE TIRE CAVITY ON INCLINE, DECLINE AND FLAT SURFACES. POSSIBLE ELECTRICAL SHORT WAITING TO HAPPEN. CHECK YOUR TRUNK UNDER THE SPARE TIRE FOR WATER.  *TR",
        "vin": "2C3CDYBT2EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "08/21/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627160,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 'OIL CHANGE RECOMMENDED' LIGHT COMES ON AT START UP AND GOES OFF.  AFTER I RECEIVED THE OIL CHANGE THIS MORNING THE LIGHT NEVER WENT OFF, I SAW THE MECHANIC AT THE DEALERSHIP FOR THIS PROBLEM HE WILL FIX IT FIRST THING IN THE MORNING.  HE DID INFORM ME HE JUST REPAIRED THE SAME PROBLEM FOR TWO CHALLENGERS THIS WEEK. I'VE ONLY HAD MY VEHICLE 7 1/2 MONTHS.  *TR",
        "vin": "2C3CDYAG5EH"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617024,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLS WHILE DRIVING,PULLS RIGHT,SATELLITE RADIO GOES OUT.IT HAS HAD A TIPM AND TWO COMPUTERS IN ADDITION TO TWO WIRING REPAIRS ALONG WITH GAS IN THE OIL.THERE HAS BEEN FOUR OIL CHANGES IN LESS THAN 3 MONTHS  ALONG WITH FOUR TIRE ROTATIONS.THE CAR HAS BEEN IN THE DEALERSHIPS FOR OVER THIRTY FIVE DAYS AND OUT OF SERVICE FOR OVER SIXTY DAYS FROM FEBRUARY 2014 TO IN THE SHOP AT PRESENT JULY 28TH 2014.I HAVE BEEN LIED TO .ASSULTED AND LEFT IN UNSAFE CONDITIONS ALONG THE HIGHWAY IN 110 DEGREE TEMPS.  LEFT WITHOUT TRANSPORTATION AND I AN AN AMERICAN ON DISABILITIES AS I HAVE STATED TO CHRYSLER AND NEED MY CAR FOR MEDICAL REASONS.LAST WEEK I COLD NOT GET MY MEDICATIONS AND WENT INTO A SERIOUS MEDICAL CONDITION CAUSING ADMITTANCE TO THE EMERGENCY ROOM AT THE LOCAL HOSPITAL BECAUSE I HAD NO WAY TO GET MY MEDICATIONS.AUTO NATION DID OVER $2000.00 DAMAGE TO MY VEHICLE AT THE FIRST REPAIR.   *JS",
        "vin": "2C3CDYBT9EH"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607440,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DID A CURB CHECK AND THE STEERING KNUCKLE BROKE ALONG WITH EVERYTHING ELSE ON THE PASSENGER FRONT SIDE WITH THE WHEEL FALLING OFF AND FOLDING UNDER THE CAR TAKING OUT THE FRONT WHEEL WELL FENDER AND CRACKING THE WINDSHIELD.  *TR",
        "vin": "2C3CDYBT7EH"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595696,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HESITATES WHEN TAKING OFF SOMETIMES AND THE ENGINE IS TICKING LIKE IT HAS BAD VALVES.  *TR",
        "vin": "2C3CDYAG3EH"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/28/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594640,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "5 DAYS AFTER PURCHASING A BRAND NEW CHALLENGER, WHILE ON THE WAY TO WORK THE ENGINE LIGHT CAME ON AND ABOUT 2 MINUTES AFTER THE CAR SHUT OFF WHILE IN THE CARPOOL LANE GOING BOUT 63 MILES/HR. THE CAR WAS READING ABOUT 200 MILES TO EMPTY. THE FUEL SENSORS /PUMPS WERE NOT WORKING AND HAD TO BE REPLACED. AT IDLE IT RUNS ROUGH, WAS COMPARED TO LIKE VEHICLE THE IDLE IS NOT CORRECT. THE MILEAGE PER GALLON IS WAY UNDER THE ADVERTISED. ADVERTISED FUEL ECONOMY SHOWING 21 MPG COMBINED CITY/HWY. WE GET ABOUT 16 MPG CITY/HWY. WE HAD NOTHING BUT TROUBLE SINCE WE PURCHASED THE VEHICLE AND NO ONE IS TAKING RESPONSIBILITY FOR THE ISSUES AS THE CAR SEEMS TO BE A LEMON. WE HAD IT IN THE SHOP 4 TIMES NOW. WE PURCHASED A BRAND NEW CAR SO THAT WE WOULDN'T HAVE ISSUES. VERY UPSET, FRUSTRATED, UNHAPPY.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/18/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10583529,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE CHALLENGER. THE CONTACT STATED THAT WHILE TRAVELING VARIOUS SPEEDS, THE CONTACT SWERVED TO AVOID ANOTHER VEHICLE AND CRASHED INTO A GATE. UPON IMPACT, THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED BACK, NECK, AND SHOULDER INJURIES. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE AND VIN WAS NOT AVAILABLE.",
        "vin": ""
    }
]