[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Ducati North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398693,
        "products": [
            {
                "manufacturer": "Ducati North America",
                "productMake": "DUCATI",
                "productModel": "MULTISTRADA 1200",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BRAKE FLUID WILL TURN A DARK COLOR AFTER LESS THAN 1000 MILES OF HAVING BEEN REPLACED AND BLED. THIS RENDERS THE REAR BRAKE ALMOST USELESS. THE REAR PEDAL WILL FEEL SPONGY AT FIRST, THEN I START TO NOTICE A LACK OF REAR BRAKING PERFORMANCE. IF I LEAVE IT FOR MORE THAN 1500 MILES WITHOUT ADDRESSING THE ISSUE, I WILL LOSE ALL REAR BRAKING PERFORMANCE/FUNCTION.",
        "vin": "ZDM12BSW7EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Ducati North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11398804,
        "products": [
            {
                "manufacturer": "Ducati North America",
                "productMake": "DUCATI",
                "productModel": "MULTISTRADA 1200",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORCYCLES REAR BRAKE POWER IS VERY POOR AND IN MANY REPORTED CASES NON-EXISTANT.  THE REAR BRAKE IS SO WEAK AS TO BE NORMALLY INCAPABLE OF EVEN ACTIVATING THE ABS SYSTEM AT THE REAR WHEEL.  STOPPING THE MOTORCYCLE USING THE REAR BRAKE IS EFFECTIVELY IMPOSSIBLE IN NORMAL TRAFFIC CONDITIONS.  I HAVE A DEGREE IN MECHANICAL ENGINEERING AND HAVE BEEN A MOTORCYCLE RIDER FOR OVER 50 YEARS.  I AM QUALIFIED AND ABLE TO DIAGNOSE THIS REAR BRAKE AS POORLY DESIGNED AND INCAPABLE OF PRODUCING PROPER STOPPING POWER.  THE BRAKE HAS BEEN PROPERLY BLED, ABS SYSTEMS PROPERLY PRIMED AND BLED, ONLY THE HIGHEST QUALITY BRAKE FLUIDS HAVE BEEN USED (I.E. CASTROL SRF), THE VERY POOR BRAKING POWER PERSISTS.   THIS IS A WELL KNOWN ISSUE WITH THESE MOTORCYCLES AND IS DISCUSSED IN LENGTH ON PUBLIC FORUMS WHERE OWNERS ARE TRYING TO FIND A FIX.  NO SUITABLE FIX TO THE EXISTING SYSTEM IS KNOWN TO MY KNOWLEDGE OR SUBSTANTIAL RESEARCH.  THIS IS A DESIGN DEFECT IN MY PROFESSIONAL OPINION.",
        "vin": "ZDM12BSW9EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "03/24/2015",
        "fire": false,
        "manufacturer": "Ducati North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762570,
        "products": [
            {
                "manufacturer": "Ducati North America",
                "productMake": "DUCATI",
                "productModel": "MULTISTRADA 1200",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DUCATI MULTISTRADA 1200 MOTORCYCLE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH, THE FRONT FORK SEALS AND REAR BRAKES BECAME INOPERABLE AND COULD NOT STOP THE VEHICLE. THE FAILURE RECURRED ON EIGHT OCCASIONS. THE MOTORCYCLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FORK SEALS WAS FRACTURED AND NEEDED TO BE REPLACED. THE MOTORCYCLE WAS REPLACED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,000.",
        "vin": "ZDM12BSW7EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Ducati North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705061,
        "products": [
            {
                "manufacturer": "Ducati North America",
                "productMake": "DUCATI",
                "productModel": "MULTISTRADA 1200",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY-LESS IGNITION FAILED TO OPERATE. EMERGENCY MODE HAD TO BE ACTIVATED. THIS WAS IN A PARKING LOT WITH HIGH RF INTERFERENCE.  *TR",
        "vin": "ZDM12BSW3EB"
    }
]