[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/13/2021",
        "dateOfIncident": "11/18/2021",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443676,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "STORM",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Fleetwood Storm RV. The contact stated that while driving there was wind in entering into the vehicle. The contact stated that the sidewalls were separating from the floor. The brackets and bolts on the side walls moved 1 to 2 inches. The vehicle was taken to an independent mechanic who informed the contact that the vehicle might be dangerous to drive. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was notified however, no further assistance was provided. The approximate failure mileage was 49,900.",
        "vin": "1f65f5dy7d0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350432,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "STORM",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "APPARENTLY, THE HOUSE PART OF THE RV SEPARATED FROM THE CHASSIS. THE BRACKETS ON BOTH SIDES OF THE RV CHASSIS BACKED OUT WHICH CAUSED THE BOLTS TO BREAK ALL THE WAY BACK TO THE ENTRY DOOR.",
        "vin": "1F65F5DY7E0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "08/24/2017",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032790,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "STORM",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CAME LOOSE AND IS SETTING ON TOP OF THE STEERING COLUMN. HEAT AND FUMES COMING FROM ENGINE COMPARTMENT INTO CAB. IT PULLED HEAT AND AIR DUCTS LOOSE UNDER THE DASH. INSIDE WALL WHERE THE REFRIGERATOR IS MOUNTED PULLED APART FROM EXTERIOR WALL AND CEILING. THIS UNIT HAS 6092 MILES ON IT. FLEETWOOD HAS REFUSED TO HELP US.",
        "vin": "785ME441599"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621972,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "STORM",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 11, 2014 WE TOOK A TRIP OUR NEW FLEETWOOD STORM RV TO NC, 850 MILES FROM HOME. WHILE DRIVING THERE I NOTICED FUMES COMING IN FROM THE ENGINE COVER AND FRONT DASH. THERE WAS HOT AIR FLOWING IN FROM THE FRONT DASH AND ENGINE COVER CAUSING THE DRIVER'S SIDE TO GET EXTREMELY HOT. REACHING DOWN I FOUND A GAP AROUND THE ENGINE COVER THAT I COULD PUT MY FINGERS IN. THIS WAS DIRECTLY OVER THE ENGINE SO THE HEAT AND FUMES POURED IN FROM THIS SPOT. I ALSO FELT HOT AIR COMING IN FROM UNDER THE DASHBOARD. I FOUND A GAP IN THE FRONT LEFT FIREWALL TO THE ENGINE COMPARTMENT THAT I COULD STICK MY FINGERS THROUGH. THIS UNIT WAS NOT CONSTRUCTED PROPERLY AND WAS A SAFETY ISSUE. BEING FAR FROM HOME, WE PURCHASED AN OSCILLATING FAN TO BLOW ON ME WHILE I DROVE TO HELP WITH HEAT AND FUMES. OCCUPANTS IN THE CAB BECAME NAUSEATED AND SICK FROM THE FUMES.  FLEETWOOD RV AND LA MESA RV HAVE ATTEMPTED TO REPAIR THE ISSUE BUT HAVE BEEN UNSUCCESSFUL ON 4 ATTEMPTS AS OF THIS DATE AUGUST 12, 2014. THE FUMES POSE A DANGEROUS SITUATION FOR THE DRIVER.  *TR",
        "vin": "1F65F5DY7E0"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "07/21/2014",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618536,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "STORM",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE DATE OF THIS INCIDENT, WE HAD JUST PURCHASED THE MOTORHOME JUST A WEEK BEFORE. DRIVING AT APPROXIMATELY 35 MPH ON A VERY BUSY FOUR LANE ROADWAY, JUST FOUR MILES FROM HOME, THE MOTORHOME ENGINE JUST SHUT OFF COMPLETELY WITHOUT WARNING. VERY SCARY, SINCE I WAS UNABLE TO STEER OR BRAKE.  NOTHING I COULD DO BUT LET THE MOTORHOME COAST, AND THEN IT CAME TO A COMPLETE STOP AS IT APPROACHED A SLIGHT INCLINE IN THE ROADWAY. ENGINE WOULD NOT START AND NONE OF THE WARNING LAMPS, GAUGES, ETC. WORKED. TRAFFIC WAS BLOCKED FOR A COUPLE OF HOURS BEFORE FORD HAD THE COACH TOWED TO A SAFE LOCATION. THE FOLLOWING DAY FORD HAD THE MOTORHOME TOWED TO A LOCAL REPAIR SHOP, NOT THE FORD DEALERSHIP. THE PROBLEM WAS DIAGNOSED AS ELECTRICAL (ELECTRONIC CONTROL MODULE AND IGNITION SWITCH). DUE TO PARTS NOT BEING AVAILABLE LOCALLY, THIS ELECTRICAL PROBLEM WAS NOT FIXED UNTIL THE 5TH DAY AFTER THE INCIDENT OCCURRED. APPARENTLY, ONLY ONE ECM WAS AVAILABLE IN THE ENTIRE COUNTRY AND HAD TO BE SHIPPED FROM THE EAST COAST. THE REPAIRMAN AT THE SHOP STATED THAT ALL IS WORKING FINE, HOWEVER, WE ARE NOW VERY RELUCTANT TO DRIVE THE COACH AND STILL DON'T KNOW IF ALL THE ELECTRICAL SYSTEMS ARE WORKING. WE HAVE BEEN UNABLE TO TEST EVERYTHING ELECTRICAL.  *TR",
        "vin": "1F65F5DY3E0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/13/2014",
        "dateOfIncident": "12/05/2013",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569008,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "STORM",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A NEW 2014 FLEETWOOD STORM MOTORHOME IN DECEMBER 2013.  THE FOG LIGHTS ONLY WORK WHEN THE HIGH BEAMS ARE ENERGIZED.  WHEN THE LOW BEAMS ARE ON THE FOG LIGHTS DO NOT COME ON.  THIS IS THE OPPOSITE OF ANY OTHER VEHICLE I HAVE OWNED OR SEEN.  WHEN I COMPLAINED OF THIS, THE DEALERSHIP THAT I PURCHASED IT FROM,  FLAGG RV, 1-888-352-4478 CONTACTED FLEETWOOD AND WERE TOLD BY FLEETWOOD THAT THIS IS THE WAY THE LIGHTS ARE SUPPOSED TO BE WIRED.  I CONTACTED CUSTOMER SERVICE AT FLEETWOOD AND WAS TOLD THE SAME THING.  THE DEALERSHIP I FEEL HAS BEEN VERY SUPPORTIVE, BUT I DO NOT THINK THEY CAN DO ANYTHING ELSE TO HELP ME IF THE MANUFACTURER SAYS THAT'S THE WAY THE LIGHTS ARE SUPPOSED TO BE CONFIGURED.  ANY ASSISTANCE YOU  CAN PROVIDE WILL BE GREATLY APPRECIATED.  *TR",
        "vin": "1F65F5DY9D0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "07/06/2013",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560231,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "STORM",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FLEETWOOD STORM. THE CONTACT WAS DRIVING 50 MPH WHEN THE VEHICLE BEGAN TO SHAKE VIOLENTLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION BUT A CLEAR DIAGNOSIS WAS NOT NOTED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE INCIDENT. THE APPROXIMATE FAILURE MILEAGE WAS 350.",
        "vin": "1F65F5DY7D0"
    }
]