[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002038,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN WANDERS BACK AND FORTH AT HIGHWAY SPEEDS (> 60MPH).  I HAD THE FRONT END ALIGNMENT AND SUSPENSION CHECKED OUT - ALL OK.  PROBLEM GETS WORSE WHEN PULLING A 5000 LB CAMPER - ALMOST A SAFETY ISSUE.",
        "vin": "1FMNE1BL0ED"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839848,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I ONLY HAVE 8000 MILES ON IT, AND THE STEERING WHEEL IS SHAKING WHEN I TOUCH THE BRAKES. IT ALSO HAS SQUEAKED FROM THE DAY I BOUGHT IT. I TOOK IT BACK TO THE DEALER, THEY DIDN'T HEAR THE SQUEAK. IT IS ONLY WHEN I BACK UP.",
        "vin": "1FTFW1CT9EK"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2016",
        "dateOfIncident": "04/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839717,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD E-I50. THE CONTACT STATED THAT THE FRONT BRAKE PAD WAS GRINDING THE ROTOR AND CAUSED THE STEERING TO PULL TO THE LEFT AND RIGHT. THE DEALER SHAVED THE ROTOR AND REPLACED THE PADS, BUT THE FAILURE RECURRED A MONTH LATER. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THEY SHAVED THE ROTOR AND REPLACED THE PADS AGAIN, BUT THE FAILURE RECURRED. WHEN THE VEHICLE WAS TAKEN BACK TO THE DEALER, THE CONTACT WAS INFORMED THAT THE VEHICLE WAS OPERATING THE WAY IT SHOULD. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 11,426.",
        "vin": "1FTFW1CF4EK"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "03/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722873,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTED 3 SEPARATE TIMES 4X4 WAS ENGAGED BY ITSELF  JUST BARELY TOUCHED 4WHEEL DRIVE SWITCH AND IT WENT OFF ALSO DID IT AGAIN WHEN I WAS DRIVING",
        "vin": "1FTFW1EF6EF"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/02/2015",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 (NA) FORD E-150. WHILE THE VEHICLE WAS IN PARK, THE CONTACT HEARD A LOUD NOISE AND NOTICED THAT THE REAR DRIVER SIDE WINDOW FRACTURED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT ALL THE REAR WINDOWS NEEDED TO BE REPLACED. THE VEHICLE WAS  REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 23,000.   UPDATED 4/7/15*CN  UPDATED 04/09/15*JB",
        "vin": "1FTFW1EF9DF"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "06/10/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598091,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 10, 2014  I LEFT MY OFFICE AND TRAVELED ACROSS THE PARKING DRIVEWAY AT ABOUT 7 MPH, A DISTANCE OF ABOUT 150 FEET WHERE I ATTEMPTED TO STOP(USING MY RIGHT FOOT ON THE BRAKE) BEFORE MAKING A RIGHT HAND TURN ONTO A BUSY FAST MOVING STREET. AT THIS POINT MY FOOT HIT THE BRAKE AND ACCELERATOR AT THE SAME TIME (THEY ARE EXTREMELY CLOSE) CAUSING ME TO SUDDENLY LURCH FORWARD TOWARD THE ONCOMING TRAFFIC COMING FROM MY LEFT.  FORTUNATELY I WAS ABLE TO QUICKLY USE MY LEFT FOOT TO POWER BRAKE AND SAFELY STOP MY VEHICLE.  THIS WAS THE THIRD TIME IN 250 MILES OF CITY DRIVING MY NEW VEHICLE THAT THIS HAD HAPPENED, BUT THE FIRST TIME I RECORDED THE TIME AND DATE OF THE INCIDENT, REALIZING THERE WAS A DESIGN ISSUE.  THIS IS A SERIOUS SAFETY PROBLEM, I CAN SEE MANY REAR END ACCIDENTS BEING CAUSED BY THIS DESIGN.   SINCE I STILL OWN A 2004 FORD E150 VAN, SIDE BY SIDE MEASUREMENT COMPARISONS WERE EASILY MADE AND I THINK I CAN SEE WHAT HAS HAPPENED.  THE ACCELERATOR PEDAL HAS BEEN RAISED ABOUT AN INCH AND A QUARTER HIGHER THAN MY 2004 VAN AND IS APPROXIMATELY ONE QUARTER INCH CLOSER TO THE BRAKE PEDAL. IN ADDITION BECAUSE OF THE LARGE ENGINE COWLING, THE BRAKE PEDAL IS LOCATED MOSTLY TO THE LEFT OF CENTER OF THE CENTER LINE OF THE STEERING WHEEL WHICH FORCES THE DRIVER TO EFFECTIVELY CROSS OVER AWKWARDLY TO HIT THE CENTER OF THE BRAKE PEDAL. THIS IS A VERY UNNATURAL MOTION NOT REQUIRED ON ANY VEHICLES THAT I LOOKED AT BEFORE CONTACTING YOU. IF THE BRAKE PEDAL IS PUSHED DOWN EVEN SLIGHTLY FROM THE RIGHT HAND SIDE/EDGE OF THE BRAKE PEDAL (NORMAL HABIT BY MOST DRIVERS REVIEWING WEAR PATTERNS ON BRAKE PEDALS OF MANY VEHICLES AT MY OFFICE COMPLEX) THE BOTTOM OF A MAN'S RIGHT SHOE WILL ALMOST ALWAYS BE SOMEWHAT OVER THE ACCELERATOR, AND THE POTENTIAL FOR DUAL/SIMULTANEOUS BRAKE AND ACCELERATOR PUSHING IS CREATED.     *JS",
        "vin": "1FMNE1BL9ED"
    }
]