[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319063,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WHERE GOING TO FILL PROPANE UP FOR MOTOR HOME ABOUT 8 MILES AWAY  TO GET READY TO TAKE A VACATION.ON THE WAY HOME TO LOAD UP FOR A TRIP. MOTOR HOME STARTED RUNNING RUFF. .THE ONLY DEALER THAT COULD WORK ON FORD ENGINE WAS  GATOR FORD SEFFNER FL. CLASS A MOTOR HOME HAD ONLY 23,946 MILES ON IT. HAD TO HAVE IT TOWED TO GATOR FORD ACROSS FROM LAZYDAYS RV. IF I DIDN'T HAVE GOOD SAME THAT WANTED ME TO PAY 720.00 TOWARD THE TOW.  THE POLICY WAS TO TOW MOTOR HOME TO NEAREST REPAIR FACILITY THEY HAD TO REPLACE THREE COIL PACKS ON # 6,8,AND 10 CYLINDER. 148.00 EACH.TO ME THEY ARE DEFFECTED.  $445.77. THE LABOR WASN'T BROKEN DOWN FOR EACH JOB.TOTAL COST FOR LABOR WAS$1159.71.  INVOICE# F0CS24510. 3/19/2020 .THE NORMAL PREVENTED MAINTENANCE IS  10 SPARK PLUGS PLUS FUEL SYSTEM CLEANING.  THANK GOD WE WERE NOT FAR FROM HOME WHEN MOTOR HOME ENGINE ACTED UP.  NOW THE CONCERN IS THE OTHER 7 COIL PACKS GOING TO GO BAD WHILE WE ARE OUT ON A TRIP.  I THINK WE SHOULD BE REIMBURSED FOR THE THREE COLI PACKS AND LABOR AND THE OTHER 7 COIL PACKS REPLACED     AGAIN ENGINE ONLY HAS 24,000 MILES ON ENGINE NOW SINCE I DROVE IT HOME FROM DEALER. THE MOTORHOME HAS ALWAYS BEEN PLUGGED IN AT HOUSE FOR EITHER A/C OR HEAT.. ALWAYS SERVICED AT LAZYDAYS SEFFNER FL. ARTIE GRANT",
        "vin": "1F66F5DY5D0"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "04/09/2017",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041231,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 BOUNDER RV 35K. CONSUMER WRITES IN REGARDS TO THE 12 VOLT SYSTEM MALFUNCTION. *LD    THE CONSUMER STATED THE 12 VOLT SYSTEM MALFUNTIONED CAUSING THE WINDSHIELD WIPERS TO FAIL. THE MANUFACTURER WAS NOTIFIED, BUT DID NOT OFFER ANY ASSISTANCE. UPDATED 11/06/2017*JS",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/11/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597745,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO POOR ILLUMINATION PRODUCED BY MY MOTORHOME HEADLAMPS WE HAVE STOPPED NIGHT DRIVING UNTIL A FIX IS FOUND. FMVSS 108 REQUIRES PHOTOMETRIC TESTING OF LAMPS AT 12.8V +/- 20MV, OR 12.78 TO12.82 VOLTS. I PURCHASED A VOLT TESTER AND TESTED OPERATING VOLTAGE AT THE HEADLAMPS AS DIRECTED BY A AUTOMOTIVE LIGHTING CONSULTANT. VOLTAGES FOR LOW BEAMS WERE 12.16V FOR THE PASSENGER SIDE AND 12.49V FOR THE DRIVERS SIDE. VOLTAGES WERE FOUND WITH ENGINE RUNNING, LIGHTS ON,AND BATTERY 14.17V. I CONDUCTED A VOLTAGE DROP TEST WITH ENGINE OFF AND FOUND VOLTAGE DROP TO THE PASSENGER SIDE LOW BEAM TO BE1.53V TO THE POSITIVE TERMINAL AND .21V TO THE NEGATIVE TERMINAL FOR A COMBINED VOLTAGE DROP OF 1.74V. THE AUTOMOTIVE LIGHTING CONSULTANT CONSIDERS THIS A SIGNIFICANT DROP IN VOLTAGE.THIS LEADS ME TO QUESTION IF THE TURN SIGNAL LAMPS MEET MAXIMUM ALLOWED VOLTAGE DROP OF 0.8V REQUIRED BY FMVSS 108. AS DESIGNED MY ELECTRICAL SYSTEM DOESN'T SUPPLY ENOUGH VOLTAGE TO REACH RATED OUTPUT OF EACH BULB CREATING AN UNSAFE AND DANGEROUS DRIVING ENVIRONMENT. USING MARKINGS LOCATED ON EACH HEADLAMP I DISCOVERED THAT THE COMPLIANCE CERTIFICATIONS OF MY HEADLAMPS ARE QUESTIONABLE AND POSSIBLY FRAUDULENT. THE MANUFACTURER IS DEPO, WHO HAVE BEEN INVOLVED IN 19 RECALLS FOR HEADLAMPS OVER THE LAST 7 YEARS. I HAVE REACHED OUT TO OTHER OWNERS OF FLEETWOOD BOUNDERS AND ALL RESPONDED THEY BELIEVE THEIR LIGHTING TO BE POOR. THIS LEADS ME TO BELIEVE THAT THIS ISSUE IS SYSTEMIC ACROSS THE BOUNDER LINE GOING BACK TO AT LEAST MODEL YEAR 2012. I AM REQUESTING FLEETWOOD RV OR NHTSA ISSUE A RECALL TO INSPECT ALL BOUNDERS FROM YEAR 2012 TO 2014 AND DETERMINE A REMEDY TO INCREASE VOLTAGE AT THE HEADLAMPS TO A MINIMUM OF 12.8V  AS WELL AS HAVE THE DEPO HEADLAMPS TESTED FOR COMPLIANCE WITH FMVSS 108. IF  PHOTOMETRIC REQUIREMENTS ARE NOT MET FLEETWOOD SHOULD ISSUE A RECALL TO REPLACE HEADLAMPS WITH COMPLIANT UNITS.  *TR",
        "vin": ""
    }
]