[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006642,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "TERRA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FLEETWOOD TERRA. WHILE DRIVING 50 MPH, THE WALLS CRACKED AND DETACHED FROM THE CHASSIS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT DID NOT OFFER ANY ASSISTANCE. THE FAILURE MILEAGE WAS 23,383.",
        "vin": "1F65F5DY9E0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/16/2014",
        "dateOfIncident": "06/14/2013",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572708,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "FLEETWOOD",
                "productModel": "TERRA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BOYFRIEND AND I PURCHASED OUR NEW RV IN MAY 2013.  WE TOOK IT FOR OUR FIRST OUTING IN JUNE 2013.  AS MY BOYFRIEND TURNED A RIGHT CORNER AT ABOUT 5 TO 7 MPH, THE SLIDE OUT COUNTER EXTENSION ROLLED OUT AND SMASHED INTO THE DINETTE SET, DIRECTLY ACROSS.  THE SLIDE OUT COUNTER IS SECURED BY A SINGLE, SLIDING LATCH. WHEN THE COUNTER IS FULLY LOADED WITH UTENSILS AND OTHER ITEMS, IT EASILY WEIGHS 70+ POUNDS.  WE IMMEDIATELY REPORTED THE PROBLEM TO THE DEALERSHIP WHO REPLACED THE LATCH WITH A NEW ONE.  ON OUR SECOND OUTING, THE EXACT SAME PROBLEM OCCURRED.  THIS TIME THE DEALERSHIP \"ADJUSTED\" THE LATCH.  DURING OUR THIRD DRIVE, THE LATCH WOULD SLIDE OPEN DURING LANE CHANGES.  WHEN WE TOOK IT BACK, WE EMPHASIZED THE FLIMSY LATCH COULD NOT SECURE THE HEAVY WEIGHT OF THE COUNTER.  IF SOMEONE (PARTICULARLY MY YOUNG GRANDSON) HAD BEEN SEATED AT THE DINETTE, ANY OF THE SEVERAL IMPACTS WOULD HAVE CAUSED GREAT BODILY INJURY OR DEATH.  THE DEALERSHIP TOLD US THAT THE MANUFACTURER, FLEETWOOD, INC, SAID THERE WAS NOTHING FURTHER THEY WOULD DO TO ADDRESS OUR CONCERN.      THERE HAVE BEEN NUMEROUS OTHER DEFECTS WITH THIS PARTICULAR VEHICLE.  WE HAVE RETAINED AN ATTORNEY AND ARE ATTEMPTING TO SETTLE FOR A DIFFERENT MODEL.  HOWEVER, FLEETWOOD REFUSES TO ACKNOWLEDGE ANY SAFETY ISSUES WITH THE ROLL OUT COUNTER ON THE TS-31 MODEL; STATING THEY ARE NOT GOING TO \"LEMON LAW\" THE RV.  WHEN WE REPORTED THE PROBLEM TO THE DEALERSHIP, ONE OF THEIR REPRESENTATIVES TOLD US HE WOULD LET HIS MANAGEMENT KNOW ABOUT THE SAFETY CONCERN AND THEY WOULD RETURN IT TO THE FLEETWOOD FACTORY, INSTEAD OF DOING A BUY BACK IF FLEETWOOD OFFERED ONE.    OUR MAIN GOAL IS TO HAVE THE NHTSA CONDUCT A SAFETY REVIEW OF THIS ROLL OUT COUNTER FEATURE.  FROM OUR OWN PERSONAL EXPERIENCE, WHEN THE ROLL OUT IS LOADED WITH UTENSILS, IT CANNOT STAY SECURED WITH JUST A FLIMSY LATCH.  PLEASE INVESTIGATE BEFORE SOMEONE GETS HURT.    *TR",
        "vin": "1F66F5DY6D0"
    }
]