[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084847,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WORK FOR THE UNIVERSITY OF CALIFORNIA SAN DIEGO FLEET SERVICES. WE HAVE SEVERAL 2014 FORD E-350'S IN OUR RENTAL FLEET. SOME TIME A FEW YEARS BACK MICHELIN RECALLED MANY OF THE LTX TIRES ON MANY OF OUR VANS. THE DOT CODE ON THE TIRES ON THIS VAN DID NOT FALL UNDER THE MICHELIN RECALL. AS YOU CAN SEE IN THE PHOTO THIS TIRE HAD A TREAD SEPARATION ON A REAR TIRE, VAN FULL OF PASSENGERS. WE ARE REALLY LUCKY THIS VAN DID NOT ROLL OVER. THIS HAPPENED TRAVELING ON THE HIGHWAY AT SPEEDS WITHIN THE POSTED LIMIT. THE TREAD AS IT CAME SEPARATED FROM THE TIRE DAMAGED THE UNDERCARRIAGE OF THE VAN & PULLED A LOOSE HEATER HOSE WHICH CAUSED COOLANT TO LEAK AND THE VAN OVER HEATED & LEFT A GROUP STRANDED IN THE DESERT. WE BELIEVE MICHELIN MAY WANT TO TAKE ANOTHER LOOK AT THE DATE CODES THAT SHOULD BE COVERED UNDER THIS RECALL. THE TIRE IN THE PHOTOS THAT STILL HAS TREAD WAS REMOVED FROM THE SAME VAN (SPARE POSITION) BEFORE IT FAILED. YOU CAN SEE IT WAS GETTING READY TO LOOSE THE TREAD AS WELL AND IT WAS NOT ON THE ROAD AND NOT EXPOSED TO EXCESSIVE SUN LIGHT.   WE WILL SEND THESE TIRES BACK TO A MICHELIN DEALER & SEE WHAT THEY WILL DO FOR US.",
        "vin": "1FBNE3BL4ED"
    },
    {
        "components": "SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "12/09/2017",
        "fire": false,
        "manufacturer": "Mobility Works (WMK Inc.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074792,
        "products": [
            {
                "manufacturer": "Mobility Works (WMK Inc.)",
                "productMake": "FORD",
                "productModel": "E350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC:MY 8 YEAR OLD GIRL SOMEHOW WRAPPED THE SEAT BELT AROUND HER WAIST. WHEN SHE UNBUCKLED, IT  TIGHTENED UP. THE MORE SHE STRUGGLED THE TIGHTER IT GOT. I FINALLY HAD TO CUT THE SEAT BELT OFF.*DT  *JS",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "10/31/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054998,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEEL RIM FAILURE. PURCHASED VEHICLE WITH 8000 MILES ON ODOMETER OCTOBER 2014. AS OF TODAY DECEMBER 2017 THE ODOMETER READS 141,000 MILES . I HAVE REPLACE ALL FOUR RIMS ON THIS VEHICLE ONE BY ONE. FIRST ISSUE I WAS LOOSING HUB CAPS WHILE DRIVING CONTINUOUSLY,I FINALLY GAVE UP AND TOOK ALL OFF,LEFT BARE RIMS. THEN THE SECOND ISSUE WAS RIMS CRACKING AND FAILING AT THE WELDED POINT  WHERE THE SPOKES/STRUTS ARE ATTACHED. THE SAME FAILURE IS THE SAME PLACE OVER AND OVER. NOTICED THIS ISSUE WHILE DRIVING AND TPMS LIGHT WOULD COME ON,I WOULD PULL OVER AND BY THE TIME I GOT STOPPED THE TIRE WAS COMPLETELY FLAT. VERY DANGEROUS ISSUES FOR OTHER DRIVERS ON THE ROAD AS WELL AS MYSELF AND FAMILY .",
        "vin": "1FDWE3FL4ED"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/02/2017",
        "dateOfIncident": "03/30/2017",
        "fire": false,
        "manufacturer": "Mobility Works (WMK Inc.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969981,
        "products": [
            {
                "manufacturer": "Mobility Works (WMK Inc.)",
                "productMake": "FORD",
                "productModel": "E350",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire & Technology Co., Ltd.",
                "productMake": "HANKOOK",
                "productModel": "DYNAPRO",
                "productYear": "9999",
                "size": "AT P225/70R17",
                "type": "Tire"
            }
        ],
        "summary": "WIFE DRIVING VEHICLE AND LEFT REAR HANKOOK DYNAPRO AT LT245/75R16 EXPLODED. THIS CAUSED TIRE TO COME APART.TIRE EXPLODED",
        "vin": "1FTSS3EL1ED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/06/2016",
        "fire": false,
        "manufacturer": "Mobility Works (WMK Inc.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893894,
        "products": [
            {
                "manufacturer": "Mobility Works (WMK Inc.)",
                "productMake": "FORD",
                "productModel": "E350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS FOUND TO HAVE SEVERE VERTICAL PLAY IN ALL FOUR TIE ROD END JOINTS.  NOT TYPICAL HORIZONTAL PLAY WITH NORMAL WEAR AS SEEN IN HIGHER MILEAGE VEHICLES.",
        "vin": "1FDSS3EL0ED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "07/23/2016",
        "fire": false,
        "manufacturer": "Mobility Works (WMK Inc.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893895,
        "products": [
            {
                "manufacturer": "Mobility Works (WMK Inc.)",
                "productMake": "FORD",
                "productModel": "E350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS FOUND TO HAVE SEVERE VERTICAL PLAY IN ALL FOUR TIE ROD END JOINTS.  NOT TYPICAL WITH HORIZONTAL PLAY NORMALLY FOUND IN HIGHER MILEAGE VEHICLES",
        "vin": "1FDSS3EL6ED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883896,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A REPRESENTATIVE FROM AN AUTO REPAIR FACILITY IN CHARGE OF THE REPAIRS AND MAINTENANCE OF A FLEET OF EMERGENCY VEHICLES.  THIS IS AN AMBULANCE CONVERSION AND AT 38,323 MILES, IT WAS FOUND TO HAVE EXCESSIVE VERTICAL PLAY IN ALL FOUR TIE ROD ENDS UP TO 1/4\" AND IN THE STEERING GEAR OUTPUT SHAFT.  THERE IS NO LATERAL PLAY AS IN NORMAL WEAR OVER A LONGER PERIOD OF TIME.  IT IS BELIEVED THIS IS A DEFECT IN MANUFACTURING AND IS A SAFETY HAZARD.",
        "vin": "1FDSS3EL6ED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/09/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A REPRESENTATIVE FROM AN AUTO REPAIR FACILITY IN CHARGE OF THE REPAIRS AND MAINTENANCE OF A FLEET OF EMERGENCY VEHICLES.  THIS IS AN AMBULANCE CONVERSION AND AT 30,152 MILES, IT WAS FOUND TO HAVE EXCESSIVE VERTICAL PLAY IN ALL FOUR TIE ROD ENDS UP TO 1/4.\"  THERE IS NO LATERAL PLAY AS IN NORMAL WEAR OVER A LONGER PERIOD OF TIME.  IT IS BELIEVED THIS IS A DEFECT IN MANUFACTURING AND IS A SAFETY HAZARD.",
        "vin": "1FDSS3EL6ED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883894,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A REPRESENTATIVE FROM AN AUTO REPAIR FACILITY IN CHARGE OF THE REPAIRS AND MAINTENANCE OF A FLEET OF EMERGENCY VEHICLES.  THIS IS AN AMBULANCE CONVERSION AND AT 56,701 MILES, IT WAS FOUND TO HAVE EXCESSIVE VERTICAL PLAY IN ALL FOUR TIE ROD ENDS UP TO 1/4.\"  THERE IS NO LATERAL PLAY AS IN NORMAL WEAR OVER A LONGER PERIOD OF TIME.  IT IS BELIEVED THIS IS A DEFECT IN MANUFACTURING AND IS A SAFETY HAZARD.",
        "vin": "1FDSS3EL8ED"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785490,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE THE SPARE TIRE BROKE OFF THE UNDERSIDE OF THE VEHICLE AND LANDEDON THE ROAD. THERE WAS A VEHICLE BEHIND US AND WAS ABLE TO AVOID THE TIRE.. THE BOLT HOLDING THE TIRE IN PLACE SHEARED OFF. THE VEHICLE IS ONLY ONE YEAR OLD AND RUST WAS NOT A FACTOR AS UPON FURTHER INSPECTOIN THE BOLD IN QUESTION STILL IS HAS HALF OF IT IN THE BRACKET  A NON METAL BOLT AS IT IS WHITE IN APPEARANCE.",
        "vin": "1FDXE4FS4ED"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "09/24/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780678,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY RENTED AN RV FROM CRUISE AMERICA.  I DO NOT HAVE THE VIN BUT FOR ID IT WAS THEIR UNIT 254869.  IT WAS BUILT FOR CRUISE AMERICA BY FOUR WINDS ON A FORD E350 CHASSIS.  ALMOST IMMEDIATELY I FOUND I COULD NOT DRIVE IT AT POSTED SPEED LIMITS.  I FELT UNSAFE AT ANY SPEED OVER 60 MPH AND LESS DEPENDING ON WEATHER AND PAVEMENT CONDITIONS.  THE POSTED LIMITS WERE 65-80 IN CO, WY, MT, AND SD.  THE VEHICLE WAS LIGHT IN THE FRONT END AND NOTHING WE LOADED CAUSED THAT.  EVERY GUST OF WIND, EVERY BUMP IN THE PAVEMENT, AND EVERY TRUCK BLAST PUSHED IT OFF LINE.  ON ONE OCCASION, A TRUCK BLAST PUSHED ME ONTO THE SHOULDER AND BEFORE I COULD CORRECT IT, A SNOW POLE BROKE THE PASSENGER SIDE MIRROR.  I REPORTED THIS TO CRUISE AMERICA WHEN WE RETURNED THE VEHICLE, AND AGAIN BY EMAIL.  THEY DON'T SEEM TO BE CONCERNED THAT THIS VEHICLE AND OTHERS IN THEIR FLEET LIKE IT MAY BE UNSAFE TO OPERATE AT POSTED SPEED LIMITS.  I AM ATTACHING TWO .JPGS.  ONE IS OF THAT SPECIFIC VEHICLE AND CLEARLY SHOWS THAT IT RIDES HIGHER ON THE FRONT WHEELS.  THE OTHER IS OF THE APPROXIMATE LOCATION ON US-191 BETWEEN ROCK SPRINGS AND JACKSON WY WHERE THE TRUCK BLAST PUSHED ME ONTO THE NARROW SHOULDER.  I CONSIDER THAT VEHICLE, AND POSSIBLY OTHERS BUILT TO THE SAME SPECIFICATIONS, TO BE UNSAFE TO OPERATE AT HIGHWAY SPEEDS.  CAN YOU DO SOMETHING ABOUT THIS?  IF THIS IS NOT WITHIN YOUR JURISDICTION, WOULD YOU PLEASE ADVISE ME OF THE PROPER AGENCY TO SUBMIT THIS TO OR PASS IT ON?  THANK YOU.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2015",
        "dateOfIncident": "04/03/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722657,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A THRUWAY REST AREA IN W. VIRGINIA.  IT HAD BEEN RAINING QUITE A BIT ON THIS - OUR FIRST DAY OF VACATION.  OUR NEW 2014 FORD E-350 WOULD NOT SHIFT OUT OF PARK!  ALL OF THE DASH LIGHTS STARTED FLASHING, THEN STOPPED, THEN FLASHED AGAIN.  THIS HAPPENED A FEW TIMES.  THE TRUCK WOULD START WOULD NOT SHIFT OUT OF PARK.  AFTER DISCUSSIONS WITH FORD ROADSIDE ASSIST, THE TRUCK WAS TOWED TO A FORD DEALER.  THE MAIN ENGINE ELECTRICAL COMPONENT'S COMPARTMENT WAS NOT SEALED CORRECTLY, LETTING WATER INTO THE COMPARTMENT AND SHORTING OUT THE ELECTRICAL SYSTEM IN THE TRUCK.  THE WHOLE ELECTRICAL COMPONENT HAD TO BE REPLACED.  THANKFULLY, WE WERE STOPPED IN A REST AREA WHEN DISCOVERED AND NOT ON THE ROAD!  THIS IS A SAFETY ISSUE, SINCE THE TRUCK COULD HAVE STALLED OUT AT ANY TIME WHILE DRIVING. THE FORD DEALER HAD THE TRUCK FOR 2 WEEKS, WHILE WORKING TO FIND AND FIX THIS ISSUE.",
        "vin": "1FDWE3FS3ED"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/06/2015",
        "dateOfIncident": "07/04/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714812,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD E-350. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE SEVERELY SHOOK AND VIBRATED. THE CONTACT INDICATED THAT THE VIBRATION APPEARED TO COME FROM THE FRONT END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER ON MULTIPLE OCCASIONS. THE FAILURE WAS UNABLE TO BE DETERMINED AND THE CONTACT WAS INFORMED THAT THE VEHICLE WAS FUNCTIONING AS DESIGNED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 363.",
        "vin": "1FT8W3BT6EE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "09/11/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704640,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD E-350. WHILE DRIVING AT APPROXIMATELY 5 MPH, THE VEHICLE ACCELERATED WITHOUT WARNING. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE ACCELERATOR PEDAL NEEDED TO BE ADJUSTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 15,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "12/30/2014",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684334,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD E-350. WHILE DRIVING 65 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT SMELLED A BURNING ODOR COMING FROM THE ENGINE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE ENGINE WARNING LIGHT ILLUMINATED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 27,280.",
        "vin": "1FDWE3FSXED"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662032,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD E-350. THE CONTACT STATED THAT FUEL FUMES EMITTED INTO THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN REPLACED THE GENERATOR AND ON A DIFFERENT OCCASION THE FUEL VENTING SYSTEM WAS LENGTHENED. HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 200.",
        "vin": "1FDWE3FS1ED"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "07/12/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY THE HUB CAP ON THE DRIVER?S SIDE REAR WHEEL CAME OFF. THE TRUCK HAD A LITTLE OVER 3000 MILES ON IT. I WAS DRIVING NORMALLY AND DIDN'T EVEN NOTICE WHEN THE HUB CAP CAME OFF. I ONLY NOTICED IT WAS MISSING WHEN I REACHED MY DESTINATION. I HAVE ATTEMPTED TO WORK WITH THE DEALER AND FORD CUSTOMER SERVICE. BOTH THE DEALER AND FORD MOTOR CORPORATION REFUSE TO SEE THIS AS A DEFECTIVE PART AND REFUSE TO WARRANTY THESE PARTS. I CAN REMOVE THE REMAINING HUB CAPS FROM MY TRUCK EASILY USING MY BARE HANDS. I HAVE MADE A VIDEO OF THIS HTTP://YOUTU.BE/7WPG9XSVYOG. I HAVE ALSO DEMONSTRATED THIS TO THE SERVICE MANAGER AT BLUEBONNET MOTORS OF SAN ANTONIO. THIS IS A DANGEROUS ROAD HAZARD AS THESE DEFECTIVE HUB CAPS CAN COME OFF AT ANY POINT ON THE ROAD AND CAUSE AN ACCIDENT BY HITTING OTHER MOTORISTS OR SWERVING TRYING TO AVOID IT. FORD REFUSES TO ACKNOWLEDGE THIS.",
        "vin": "1FT8W3CT6EE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2014",
        "dateOfIncident": "04/08/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618940,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2014 FORD E-350. THE CONTACT STATED THAT WHILE DRIVING 45 MPH, THE VEHICLE TILTED SIDEWAYS AND SHOOK. THE DEALER REPAIRED THE VEHICLE, BUT THE FAILURE RECURRED. THE CAUSE OF THE FAILURE WAS UNKNOWN. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 50.",
        "vin": "1FT8W3BT7EE"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/13/2014",
        "dateOfIncident": "07/11/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610198,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BUDGET RENTAL TRUCK DID NOT INSPECT THE CAR CARRIER RENTED TO ME.  THREE HUNDRED MILES INTO THE TRAVEL, THE TIRE BLEW AND GOODYEAR DISCOVERED THAT THERE WAS NO BRAKE PAD, THE BRAKE FLUID WAS LEAKING, THE CALIBER, AND ROTOR WERE BAD.  HAD THE TIRE NOT BLOWN, THIS COULD HAVE CAUSE A FATAL ACCIDENT.  *TR",
        "vin": ""
    }
]