[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456703,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "6-2021: Crackling sound on radio, whether on or off. 2 types: Like bare wires rubbed together, or connecting/disconnecting speaker. ·Crackling persists after vehicle shut off. Eventually stops. 12-2021: ·Radio quit working, crackling sound continued, appears random.  ·Observed lights on @ distance. Then off. Vehicle was parked overnight, inactive.  2-2022: ·2-year-old battery died. Dead again in a few days. (Parasitic drain) Mechanic said it needed new radio. New radio was > $600.00, required reconfiguration of dashboard.  ·Lost many, not all functions, of SYNC System, & it goes to sleep after a few minutes. Backup camera doesn’t work if SYNC system is asleep. Sometimes revived after pushing SYNC button on steering column. ·Auto electrical mechanic said still a drain on electrical system, but not like before. Rebuilt alternator & refurbished the fuse box too. Said electrical drain was from information control module on dashboard. Said take vehicle to Ford, have them reprogram the module where display screen is located & the drain occurring while vehicle is parked, would stop. ·Ford Technician said they had “no updates” on information control module. Took care of recall & transmission issues, returned the vehicle. oParasitic drain & dead battery continued. 3-2022: ·Battery tests as good but dies in 2 days. Engine quit if jumper cables were removed. Then died before they were removed. Appeared dead, no start even though connected to a good battery via jumper cables. ·Asked dealer to reprogram information control module. ·They gave it back, saying, “It’s acceptable”.  oThey disconnected an “aftermarket” module. Went from 64 milliamps to 42 milliamps.  Drove 90 minutes & parked. 29 hours later battery died. Dlr. said turn off/disconnect everything BEFORE shutting off vehicle: No automatic lights, heater, phone charger, etc. Apparently this is a body control module (BCM) problem. Not “information control module” problem.",
        "vin": "NM0GE9G7XE1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450305,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Air bubble in coolant system caused by faulty placement of heater core allows air bubble to form there. This cause no heat or defrost in cab of vehicle. Also causes overheating which leads to cracked block, coolant leak into combustion chamber, destroying catalytic converter and emissions to soar and fuel milage to drop.  Engine stumbles and stalls and goes into fail safe mode which could cause an accident because vehicle won’t accelerate or shift.",
        "vin": "NM0LS7FXXE1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438579,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My van was running fine until the piece that goes on the transmission that makes it shift broke off after that broke I started having transmission problems when I took it to have it checked they told me the piece that broke was a recalled piece for this type of vehicle. So I know that the recalled piece is what caused my transmission to start messing up. Their saying it's going to cost me $9000 to replace the transmission. I feel like this recalled piece causes my transmission to start messing up and I shouldn't have to pay out of pocket that much money for something that was recalled anyways.",
        "vin": "NM0LS7F71E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11437778,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Seatbelt failed, did not restrain the driver. Available for inspection. Steering wheel was the only item stopping  the drivers momentum  Not at this time. No warning.",
        "vin": "NM0LS6E75E1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436826,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "T-bone a four door vehicle at 55 mph. The seat did not stop me. The belt did not catch and will not retract. It is laying on the driver seat. Air bags did not deploy. The front end of my vehicle hit the side of the other vehicle crushing the front of my vehicle. Nether safety restraint worked.",
        "vin": "NM0LS6E75E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435570,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On 9/7/21 we were retuning from NB to Colorado 0n I-80 about 30 miles east of North Plate NB the moon roof blew off off of our 2014 Ford transit Van Ford has refused to fix it but there has been over 5000 recall for this problem?",
        "vin": "NM0GE9G7XE1"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Ford Transit Connect. The contact stated that he was unable to close the front driver’s side door. The vehicle was taken to the dealer who diagnosed that the driver’s side door latch needed to be replaced. The manufacturer was notified of the failure and a case opened. The vehicle was not repaired. The approximate failure mileage was 79,006.",
        "vin": "NM0GE9G78E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431298,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On August 28, 2021, in Suisun City, CA, just prior driving, the owner discovered the front side door latch had failed, resulting in an inability to close the door.  The vehicle had been parked in the direct sunlight with ambient temperatures over 100 degrees F. No prior indication the door latch was failing. The vehicle was subsequently inspected by local Ford Dealer and side door latch was found inoperative and was replaced. Owner retained replaced side door latch.  Since the 2014 Ford Transit Connect was not built at the Valencia Assembly Plant, per Ford Recall #s 20S30, 15S16, and 16S30, the owner had to pay full the repair cost ($370.65).  The serial numbers of the failed side door latch is FoMoCo DT1A V21813-BA. 4081 4157 97142 DOPRF. Consideration should be given to include 2014-2016 Ford Transit Connects built in Turkey be added to NHTSA door latch safety recall such that Ford can notify dealers to inspect and replace those side door latches at no cost to owners.  Driving a vehicle with a front door latches that may be faulty is a safety hazard. See attached photos and document",
        "vin": "NM0AE8FX0E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430298,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The front driver-side door will not latch. The door opened while driving. The fault appeared on the afternoon of Saturday 21AUG21. My seat belt saved my life and those around me in traffic. I booked the first available appointment for my local Ford dealership to inspect on Thursday 26AUG21. No warning sounds or changes in operation to indicate there was a problem prior to the fault.",
        "vin": "NM0GE9G76E1"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423773,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Ford Transit Connect. The contact stated while driving various speeds, the hatch inadvertently opened. The contact also stated that on several occasions the hatch would lock and failed to unlock when needed. The contact stated that the door ajar warning light was illuminated. The vehicle was taken to a local dealer to be diagnosed; however, the mechanic stated that there was nothing needing to be replaced. The vehicle was not repaired. The contact was relating the failure to NHTSA campaign number: 20V331000 (Latches/ Locks/ Linkages). The manufacturer had been informed of the failure and referred the contact to another local dealer for assistance. The failure mileage was unknown.",
        "vin": "NM0GE9F72E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/10/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420430,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The door panel on the rear sliding door is falling off due to failure of the adhesive. This is an issue with other Ford Transit Connects under NHTSA campaign 14V777000 and Ford recall number 14S26 but my Transit doesn't appear to come up under that recall even though i am experiencing the issue and it was manufactured in the time period specified under the recall. The panel is still on the van with tape keeping it secured so it is available for inspection. If the panel were to fall off during driving it could cause an accident by hitting other vehicles. The panel has not been inspected by anyone yet.",
        "vin": "nm0le7f70e1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "04/12/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408232,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 12, 2015, ATTENDED A FAMILY FUNERAL IN TAMPA, FL. THE TRANSIT CONNECT STARTED TO SHIFT HARD AT HIGHWAY SPEED, IT WOULD MAKE A CLUNK NOISE. THE DEALER CLAIMED THAT RODENTS HAD DAMAGED THE WIRING HARNESS. IT WAS REPLACED BY MY COMPREHENSIVE INSURANCE, BUT MY POWERTRAIN PROBLEMS HAVE PERSISTED TO THIS DATE.  I HAVE SUBMITTED A DOCUMENT SENT TO WHITE'S TRANSMISSION OF SEBRING, FL WITH A HISTORICAL ACCOUNT OF THE POWERTRAIN ISSUES.",
        "vin": "NM0GE9F75E1"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406445,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING SEVERAL FLAT TIRES I HAD TO DRIVE OFF THE INTERSTATE AFTER THE RIGHT FRONT TIRE WENT FLAT AND THE ENGINE MUST HAVE BOUNCED UP AND DOWN TOO MUCH SO THE ACCIDENT DASHBOARD LIGHT CAME ON. THE FUEL INJECTION SYSTEM WAS AFFECTED AS WELL AND THE CAR DIDN'T WANT TO START, STARTED MISFIRING AND CONKED OUT AT LOW SPEEDS. WHENEVER I PUT FUEL IN TO THE GAS TANK THE CAR DIDN'T WANT TO START AGAIN AND SOMETIMES I HAD TO TURN THE KEY 10>20 TIMES TO START THE ENGINE. UNLESS WHEN I PUT FUEL INTO THE TANK AND I KEPT THE ENGINE RUNNING (FIRE HAZARD). AFTER SEVERAL THOUSAND MILES OF DRIVING THE CAR AFTER THE CAR ACCIDENT LIGHT CAME ON AND NO REPAIRS DONE TO THE  CAR THE MISFIRING AND STALLING OUT AT LOW SPEED WOULD DISSIPATE EXCEPT FOR THE REFUELING PROBLEM. OR AT LEAST UNTIL THE CAR WENT OVER A LARGE BUMP/POTHOLE AND THEN START ALL OVER AGAIN STALLING OUT AT LOW SPEEDS. I DID TAKE THE CAR TO A GOODYEAR AUTO REPAIR SHOP AND THEY TOLD ME IT MAY TAKE 2>3 DAYS WORTH OF REPAIRS TO FIX IT. UNFORTUNATELY I STILL DO NOT HAVE THE MONEY TO FIX IT AND PROBABLY CAN'T AFFORD TO FIX IT MULTIPLE TIMES AS THE EXPENSE WOULD AMOUNT TO TWO>.THREE TIMES THE CURRENT VALUE OF THE CAR ITSELF PLUS THE PROBLEMS WITH THE ENGINE BOUNCING TOO MUCH JUST CAUSES THE SAME PROBLEM TO REOCCUR SO IT'S BASICALLY A BOTTOMLESS PIT OF REPAIR AND EXPENSE.",
        "vin": "NM0LS7FX3E1"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "06/06/2020",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404024,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A RECALL FOR POTENTIAL ENGINE FIRE ISSUES. I TOOK THE VAN TO FOR SEVERAL TIME TO ASK ABOUT THIS AND WAS TOLD THE VEHICLE I HAD WAS NOT PART OF THE RECALL. I EVENTUALLY SOLD THE VAN TO A FRIEND OF MINE WITH ABOUT 106,000 MILES ON IT. I ALSO ADVISED HIM OF THE RECALL INFO AND TOLD HIM FORD SAID IT WAS NOT PART OF THE RECALL. THE VEHICLE BURNT TO THE GROUND WITH IN 10,000 MILES AFTER I SOLD IT TO HIM. IT WAS TRAVELING DOWN THE FREEWAY AT ABOUT 60 WHEN THEY NOTICE SMOKE COMING FROM THE COWLING AND PULLED OVER. THE VAN THEN BURST IN TO FLAME FORWARD OF THE WINDSHIELD NO ONE WAS INJURED BUT THE FIRE DID MAKE IT TO THE FRONT SEATING AREA.",
        "vin": "NM0LE7FX3E1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397560,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONARY.  TRANSMISSION SHIFT CABLE BUSHING FELL OUT WHILE SHIFTING FROM PARK, TRANSMISSION IS STUCK IN PARK AND CANNOT SHIFT.  FORD DEALERSHIP WILL NOT SELL THE PART.",
        "vin": "NM0GE9F79E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388117,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH BOARD LIGHTS AND ALL METERS INOPERATIVE. INSTRUMENT CLUSTER INOPERATIVE. MULTIFUNCTIONAL DISPLAY INOPERATIVE. CHIMES, WARNING LIGHTS AND MESSAGES OUT.  INTERMITTENT AND ALL FUNCTION COME BACK AFTER SEVERAL MINUTES OF DRIVING.",
        "vin": "NM0LS7F75E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE DOOR OF MY VEHICLE WILL NO LONGER LATCH. THIS PROBLEM APPEARED WITHOUT ANY PRECIPITATING EVENT, JUST ORDINARY USE OF THE DOOR. WHEN I RESEARCHED THE PROBLEM ONLINE, I SEE THAT THE FORD MOTOR COMPANY HAS RECALLED VEHICLES OF THE SAME MODEL AND YEAR WITH THIS PROBLEM. I CONSULTED A FORD DEALER ABOUT REPAIR OF THE PROBLEM AND THEY SAID THAT THE RECALL DID NOT APPLY TO MY CAR'S VIN. THEY ALSO TOLD ME THAT THEY HAD HAD A VEHICLE OF THE SAME MODEL AND YEAR IN THEIR SHOP THAT VERY DAY WITH THE SAME PROBLEM THAT WAS ALSO NOT COVERED BY THE RECALL. I FEEL THAT THIS PROBLEM VERY MUCH PERTAINS TO THE SAFETY OF THE VEHICLE, AS THE DOOR OF A VEHICLE WITH THIS PROBLEM MAY LATCH AFTER REPEATED ATTEMPTS TO SHUT IT, AND SUBSEQUENTLY BECOME UNLATCHED WHILE DRIVING. THIS IS CERTAINLY A FRIGHTENING PROSPECT. I FEEL THAT THE PROBLEM SHOULD BE ADDRESSED PROACTIVELY TO AVOID SERIOUS INJURY TO OCCUPANTS OF THE VEHICLE.",
        "vin": "NM0GE9F74E1"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361827,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TRANSIT CONNECT. CONSUMER WRITES IN REGARDS TO DOOR LATCH SAFETY RECALL. *LD *JS",
        "vin": "NM0AS8F74E1"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361408,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING THE VEHICLE, THE DASHBOARD DOES NOT PROVIDE INFORMATION, POWER BRAKES DO NOT SEEM TO FUNCTION, POWER STEERING QUITS AND SEVERAL ITEMS SHOW UP ON DASH. UPON CUTTING CAR OFF AND RESTARTING, THEY MAY ALL BE CORRECTED. THE NEXT TIME CAR IS STARTED, IT MAY OR MAY NOT RECUR. THIS HAS HAPPENED ABOUT SIX TIMES RECENTLY AS LATE AS TODAY. OUR FEAR IS WE WILL LOSE CONTROL OF THE CAR WHILE DRIVING AT HIGHWAY SPEEDS. IT SEEMS MANY FUNCTIONS ARE CONTROLLED BY COMPUTERS THAT HAVE A FLAW. BRAKES ALSO LOSE POWER.",
        "vin": "NM0GS9F70E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355167,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT STATED THAT WHILE REVERSING OUT OF THE DRIVEWAY, THE VEHICLE LOSS POWER STEERING WITH THE STEERING ASSIST FAULT -  SERVICE REQUIRED WARNING LIGHT ILLUMINATED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT CONTACTED NOR NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "NM0LS7EX5E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351859,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISOR BAR INTERNALLY CRACKED POSSIBLY FROM SUN AND CAUSES THE VISOR TO DROP DOWN SUDDENLY WHILE DRIVING, DANGEROUSLY OBSCURING VIEW.",
        "vin": "NM0GS9F70E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR LATCH FAILED TRAVELING 65MPH ON FREEWAY. DOOR SWUNG OPEN ON A TURN AND WOULD NOT RE-LATCH. FORD HAS DENIED THE CLAIM. FORD IS REPLACING THE LATCH AS IT HAS A 'BROKEN PAWL SPRING'. DOOR WILL NOT CLOSE UNTIL ENTIRE LATCH IS REPLACED. ACCORDING TO DEALERSHIP, THEY'VE ENCOUNTERED THIS SAME PROBLEM ON OTHER 2014 FORD TRANSIT CONNECTS. AFTER REPLACING THE LATCH, FORD INSISTED THE VEHICLE WAS SAFE TO DRIVE AND GAVE ME THE KEYS BACK. I DID NOT EVEN LEAVE THE DEALERSHIP WHEN THE LATCH FAILED AGAIN AND THE DOOR WOULD NOT CLOSE AGAIN.",
        "vin": "NM0LS6E70E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350692,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE DOOR LATCH STOPPED WORKING COMPLETELY.  NOTHING HAPPENED TO WARRANT IT BREAKING.  THE DOOR WILL NOT LATCH OR LOCK, SO IT IS A BIG SAFETY ISSUE.  IT WILL JUST OPEN AND ATTEMPT TO CLOSE WITH THE MOTION OF THE CAR.  I TOOK IT TO THE DEALER THINKING THEY WOULD FIX IT FOR FREE, AS IT IS A SAFETY ISSUE, BUT THEY WOULD NOT.  THE VEHICLE WAS STATIONARY WHEN THE LATCH STOPPED WORKING.  IN A PARKING LOT.",
        "vin": "NM0GS9F7XE1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE DOOR LATCH PAWL FAILURE, DOOR WILL NOT REMAIN IN THE CLOSED POSITION, NOR CAN IT BE LOCKED.  VEHICLE WAS STATIONARY.",
        "vin": "NM0LS7F78E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "04/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340260,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC POWER STEERING ON MY FORD 2014 TRANSIT SOMETIMES WORKS AND SOMETIMES DOESN'T, BUT IT SOMETIMES, ON THE HIGHWAY, IT SOMETIMES WORKS AND SOMETIMES DOESN'T. ON THE HIGHWAY BENDS, THE THE STEERING WOULD SUDDENLY WORK AND THE CAR WOULD FEEL LIKE IT WAS A BIT OUT OF CONTROL. IT IS FINE IF IT IS COMPLETELY BROKEN BUT IT SOMETIMES WORKS AND SOMETIMES DOESN'T. SOMETIMES WHEN I START THE CAR, IT WORKS BUT WHEN YOU GET ONTO THE HIGHWAY, IT BREAKS. WE ALSO HAVE NO MONEY TO FIX IT. THIS HAPPENS ON FORD A LOT AND MANY CARS HAVE BEEN RECALLED BUT NOT MINE.",
        "vin": "NM0GS9F78E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328018,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT STATED THAT THE INSTRUMENT PANEL WAS INOPERABLE ON EXTREMELY HOT DAYS. THE CONTACT STATED THAT ON EXTREMELY HOT DAYS, THE INSTRUMENT CLUSTER FAILED TO PROVIDE ACCURATE INFORMATION. ADDITIONALLY, THE INSTRUMENT CLUSTER LIGHTS CEASED TO FUNCTION AS DESIGNED, LEAVING THE INSTRUMENT PANEL DARK. GJOVIK FORD INC. (2600 US-34, SANDWICH, IL 60548, (815) 786-3333) WAS CONTACTED AND INFORMED OF THE FAILURE. THE DEALER ALSO CONFIRMED THAT THE VIN WAS NOT INCLUED IN NHTSA CAMPAIGN NUMBER: 15V406000 (ELECTRICAL SYSTEM). THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 68,000.",
        "vin": "NM0GE9F73E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325041,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PANORAMIC MOON ROOF (NON-MOVABLE) URETHANE SEAM SEPARATED FROM BODY AND PRESENTS AIR/WATER LEAK AT HIGHWAY SPEEDS. IF UNCHECKED, RESEARCH FOUND OTHER TRANSIT CONNECTS WHERE THE ENTIRE MOONROOF BECAME DETACHED AND FLEW OFF THE VEHICLE. HAPPENED GRADUALLY OVER THE COURSE OF A MONTH, WHILE DRIVING.    THERE IS AN EXISTING RECALL (20S22) FOR THIS CONDITION, BUT FORD REFUSED COVERAGE FOR MY VEHICLE SPECIFICALLY.  *TR",
        "vin": "NM0GE9G79E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322183,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE SLIDING DOOR LATCH NO LONGER LATCHES. THIS PREVENTS THE DOOR FROM CLOSING AND CAN CAUSE IT TO OPEN DURING VEHICLE MOTION. I PREVIOUSLY COMPLETED THE SAFETY RECALL FOR THIS ISSUE IN 2017. THIS FIX SEEMS TO HAVE FAILED THREE YEARS LATER. FORD WILL NOT REPERFORM THE RECALL BECAUSE THEY CLAIM THE ORIGINAL ONE IS STILL FINE.",
        "vin": "NM0GE9G78E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD TRANSIT CONNECT REAR LIFT-GATE WOULD NOT OPEN.  STATIONARY.  ALL DOOR LOCKS WORKED WITH THE KEY FOB EXCEPT THE REAR LIFT-GATE.  THE LIFT-GATE WOULD NOT WORK WITH THE INTERIOR DOOR LOCK ELECTRIC SWITCHES.  I WAS UNABLE TO OPEN THE LIFT-GATE IN ANY MANNER.  THE LIFT-GATE DOES NOT HAVE A LOCK OPERATED BY A KEY, JUST AN ELECTRONIC SWITCH.  I CHECKED THE 10AMP FUSE FOR THE REAR LIFT-GATE LOCK AND IT WAS DEFECTIVE.  I REPLACED THE FUSE AND THE DOOR WORKED FOR ABOUT A WEEK BEFORE BREAKING AGAIN.  I REPLACED THE 10 AMP FUSE 4 MORE TIMES, EACH TIME IMMEDIATELY BLOWING THE FUSE.  AFTER READING 2 SIMILAR ONLINE ISSUES ABOUT THIS, MY OPERATIONAL THEORY WAS THAT THE ELECTRICAL WIRES POWERING THE REAR LIFT-GATE SWITCH WERE \"SHORTING OUT\".   THE MOST LIKELY PLACE WAS THE AREA WHERE THE WIRES PASSED FROM THE CAR BODY TO THE REAR LIFT-GATE.  HOWEVER, SINCE I WAS UNABLE TO OPEN THE LIFT-GATE, I WAS NOT ABLE TO ACCESS THE WIRES.  I TOOK THE TRANSIT CONNECT TO THE CLOSEST FORD SERVICE FACILITY,  AND THEY FIXED THE PROBLEM. THE SERVICE PERSON REMOVED THE PROTECTIVE RUBBER SLEEVE COVERING THE WIRES EXITING FROM THE RIGHT SIDE OF THE TRANSIT CHASSIS TO THE RIGHT SIDE OF THE LIFT-GATE. ONE COULD EASILY SEE A NUMBER OF BLACK WIRES WITH INSULATION MISSING AND EXPOSED COPPER WIRE.  THE WIRES WERE CONTACTING EACH OTHER AND/OR THE METAL WHERE THE WIRES EXIT THE CHASSIS.  I DO NOT KNOW WHAT THE OTHER WIRES OPERATE, BUT THE REARVIEW CAMERA HAD BEEN INTERMITTENTLY MALFUNCTIONING FOR MONTHS. (CAR IN MOTION, BACKING UP)  I FEEL THIS TO BE A DANGEROUS SITUATION, FOR THE SHORTING WIRES ARE IN THE APPROXIMATE VICINITY OF THE GAS FILL SPOUT INSIDE THE CHASSIS.  GAS VAPORS COULD IGNITE.  THIS IS POTENTIALLY A DANGEROUS SITUATION.",
        "vin": "NM0GE9F78E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300396,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR HAS A KNOCKING / TAPPING NOICE THAT SOUNDS LIKE IT'S COMING FROM BETWEEN THE CYLINDERS 2 AND 3. THE CAR HAD LOW COOLANT ALSO WHICH IS A LINK TO A CRACK IN THE BLOCK. HTTPS://YOUTU.BE/N0JYS2TEXDK",
        "vin": "NM0GE9G74E1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288340,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 76K MILES THE TRANSMISSION BEGAN SLIPPING AND MISSING SHIFTS FROM BOTH REVERSE AND DRIVE SELECTIONS, EITHER HOT OR COLD. 1ST AND 2ND GEAR ARE WHERE THIS ISSUE IS MOST ACUTE. IT OCCURS WHEN ACCELERATING FROM A STOP AND ALSO WHEN DECELERATING. GATOR FORD STATED TRANSMISSION NEEDED TO BE REPLACED AT CONSIDERABLE COST. ALSO STATED FLUID WAS BURNT AND METAL FOUND IN PAN. ALL SERVICE  WITH EXCEPTION OF LAST OIL CHANGE WAS CONDUCTED AT DEALER SINCE PURCHASED NEW. AT NO TIME WERE WE INFORMED OF ANY TRANSMISSION FLUID BREAK DOWN. DEALER PROVIDED LIST OF FAULT CODES WHICH DID NOT TRIGGER DASH INDICATOR OF ANY KIND.",
        "vin": "NM0GS9F72E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282242,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE SUDDENLY STALLED AND SHUT OFF. THE VEHICLE WAS TOWED TO STAR LAKE FORD (1212 MAIN ST, BURGESS TOWN, PA) WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP WAS FAULTY. THE FUEL PUMP WAS REPLACED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO KENNY ROSS FORD (3200 LIBRARY RD, CASTLE SHANNON, PA) WHERE THE FUEL PUMP WAS REPLACED, BUT THE FAILURE CONTINUED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES AND PROVIDED CASE* NUMBERS:[XXX] AND [XXX]). THE FAILURE MILEAGE WAS 26,000. *PM  CONSUMER STATED 3 TIMES ENGINE STOPPED RUNNING TWICE ENGINE WOULD NOT START. VEHICLE WAS TOWED AWAY 5 TIMES.    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'),*JB",
        "vin": "NM0GE9F7XE1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING THIS VEHICLE THE HORN QUIT, AT 49865 MILES. I CHECKED THE INTERNET AND FOUND SEVERAL OTHER PEOPLE WHO HAD THIS PROBLEM ON A FORD VEHICLE SIMILAR TO MINE. THE REPAIR SEEMS SIMPLE BUT I FEEL THAT THIS IS A SAFETY ISSUE WITHOUT AN HORN. THE HORN STARTED NOT WORKING ON AND OFF THEN QUIT COMPLETELY. THE HORN WOULD NOT WORK WHETHER MOVING OR STATIONARY.",
        "vin": "NM0AE8F79E1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. WHILE DRIVING 60 MPH, THE LOW BEAM HEADLIGHTS FAILED TO PRODUCE ADEQUATE LIGHTING PAST SIXTY FEET. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO IRISH HILLS FORD (10405 BROOKLYN RD, BROOKLYN, MI 49230, (517) 592-2112) WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "NM0GE9G7XE1"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MIDDLE ROW SEATS ARE DEFECTIVE. THEY FOLD DOWN BUT WILL NOT COME BACK UP. THEY ARE STUCK IN THE DOWN POSITION. I BROUGHT THE CAR IN TO A FORD DEALER'S SERVICE DEPARTMENT, AND THEY'VE NOW HAD IT FOR 3 DAYS TRYING TO FIGURE OUT HOW TO FIX THE PROBLEM. AT THIS POINT THEY HAVE TOLD ME THAT THERE IS SOMETHING WRONG WITH THE MANUFACTURE OF THE MECHANISM IN THE SEATBACK THAT CONTROLS THE SEAT FOLDING FUNCTION, AND THAT THE ONLY WAY THEY CAN FIX IT IS TO INSTALL A NEW SEAT. THE DEALERSHIP'S SERVICE DEPT HAS QUOTED $2000 FOR IT AS AN OUT-OF-WARRANTY REPAIR. IN SEARCHING ONLINE, I SEE THAT THIS IS A COMMON PROBLEM WITH THIS VEHICLE MODEL. I'VE SEEN THAT THERE ARE TSBS ISSUED FOR THIS PROBLEM. BUT WHEN THE DEALER PUTS MY VIN INTO THEIR SYSTEM, MY VEHICLE DOESN'T SHOW UP AS PART OF THE RECALL. I BELIEVE THIS SHOULD BE A NEW RECALL, OR AN EXPANDED RECALL, TO FIX A PROBLEM THAT FORD SEEMS TO ALREADY KNOW IT HAS -- THEY JUST HAVEN'T ACKNOWLEDGED EVERY MODEL OR YEAR THAT IT EFFECTS.    ADDITIONALLY, THERE IS AN ISSUE WITH THE SOFTWARE RUNNING THE CAR'S CLOCK -- WHEN THE CAR BATTERY IS LOW, THE CLOCK STOPS WORKING, AND WILL NOT ALLOW THE USER TO RESET IT TO THE CORRECT TIME. THE DEALER SAID THAT THE ONLY WAY THEY CAN FIX IT IS TO DO A SOFTWARE UPGRADE AT A COST OF $140 - $280 EACH TIME. THIS IS ALSO A WELL-KNOWN PROBLEM ACCORDING TO MANY FORD CONSUMER MESSAGE BOARDS. I'M NOT SURE IF THIS QUALIFIES FOR A RECALL AS WELL, BUT IT SEEMS LIKE A KNOWN DEFECT THAT PUTS THE VEHICLE OWNER AT A FINANCIAL DISADVANTAGE.",
        "vin": "NM0GE9F74E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246506,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDOW VISORS WILL NOT STAY UP.  YOU PULL THEM DOWN TO USE AND PUT UP AFTERWARDS AND THEY FALL BACK DOWN WHILE DRIVING.",
        "vin": "NM0GE9F78E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246120,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FAMILY ENTERED VEHICLE THRU REAR SLIDING DOORS. CLOSED DOORS AND PUT ON THEIR SEAT BELTS. WE DROVE APPROX 1/3 OF A MILE AND THE REAR DRIVER SIDE SLIDER FLEW OPEN IN A CORNER.COMPLETE LATCH FAILURE! THESE LATCHES WERE REPLACED AS PART OF THE 2016 RECALL.",
        "vin": "NM0GE9F77E1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245246,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POSSIBLE BCM ISSUE. THE BATTERY DRAINS WITH THE BCM FUSE INSTALLED. THE FUSE PULLED STOPS THE BATTERY DRAIN ISSUE. THE BATTER WAS REPLACED AND SAME ISSUE OCCURS. BATTERY DRAIN OCCURS OVERNIGHT.     SECOND ISSUE. THE TRANSMISSION SHIFTS ROUGH BETWEEN FIRST AND SECOND GEAR, AND BUMPS AT HIGHWAY SPEEDS WHEN ACCELERATING. HAVE TAKEN THE VEHICLE TO THE DEALER FIVE TIMES. TRANSMISSION OVERHAULED, BUT ISSUE CONTINUES. HAVE GOTTEN TRANSMISSION FAILURE WARNING SIGN.",
        "vin": "NM0LS7E73E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. WHILE DRIVING 55 MPH, THE VEHICLE SEIZED WITHOUT WARNING. THE CONTACT ATTEMPTED TO VEER TO THE SHOULDER OF THE ROAD. THE VEHICLE WAS TOWED TO FRIENDLY FORD (2250 SOUTH RD, POUGHKEEPSIE, NY 12601, (845) 462-1900) TO BE DIAGNOSED, BUT A FAILURE CODE COULD NOT BE FOUND. THE VEHICLE WAS ALSO TEST DRIVEN AND THE FAILURE WAS NOT DUPLICATED; HOWEVER, THE IGNITION SWITCH WAS REPLACED. THE FAILURE WAS EXPERIENCED SEVERAL TIMES. THE VEHICLE WAS TOWED BACK TO THE DEALER WHERE A SECOND DIAGNOSTIC TEST DETERMINED THAT THE BODY CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 15V005000 (FUEL SYSTEM, GASOLINE), BUT THE VIN WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 32,000.",
        "vin": "NM0AS8F77E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230776,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC POWER STEERING CONTROL MODULE (PSCM) DISENGAGED WHILE STOPPED AT A GAS STATION.  A VEHICLE OPERATING ERROR/WARNING WAS DISPLAYED ON THE DASH.  THE PCSM RETURNED TO A WORKING MODE FOR A SHORT TIME (2 DAYS) AND THEN FAILED PERMANENTLY.  ALL INSTANCES OCCURED WHILE THE VEHICLE WAS STOPPED.",
        "vin": "NM0GE9G79E1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230820,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE EXITING TRAFFIC CIRCLE AT SLOW SPEEDS, TRANSMISSION DID NOT RESPOND WHEN ACCELERATING OUT OF THE CIRCLE, AND CONTINUED TO BE UNRESPONSIVE AFTER PULLING TO THE SIDE OF THE ROAD. THE ROAD WAS A CITY THOROUGHFARE WITH A 35 MPH SPEED LIMIT. DEALER SAID THAT SIGNICANT DAMAGE WAS DISCOVERED UPON INSPECTION, \"PROBABLY DUE TO A TRANSMISSION OVERFILL.\" AS THE TRANSMISSION HAD NOT PREVIOUSLY BEEN SERVICED, THIS WAS CERTAINLY A FACTORY ISSUE. THE VEHICLE WAS NOT UNDER WARRANTY, AND NO COMPENSATION WAS OFFERED.",
        "vin": "NM0GS9F78E1"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/04/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229495,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAS BEEN BLOWING THE BACKUP CAMERA 5 AMP FUSE, INTERMITTENTLY FOR THE PAST FEW MONTHS. LAST FEW DAYS THE HILL ASSIST LIGHT AND THE ABS LIGHT COME ON  ALSO THE POWER STEERING GOES AWAY NOT A GOOD THING, WHEN I SHUT THE IGNITION OFF THEN BACK ON AGAIN MOST OF THE TIME THE LIGHTS GO OFF AND THE STEERING IS BACK,  I BOUGHT THIS VEHICLE NEW , IT WAS NEVER IN AN  ACCIDENT . THE ONLY REPAIR WAS DONE BY THE LOCAL DEALER THEY REPLACED  THE FUEL PUMP AND SENDING UNIT THAT WAS A RECALL..ALSO THE SLIDING DOOR LOCKS THAT WERE A RECALL .    I FOUND WIRES GOING TO THE LIFT GATE HAVE HAD THE INSULATION SKINNED OFF BECAUSE THEY RUB ON THE INNER BODY PANEL HOLE.. AS YOU CAN SEE IN THE PICTURES I USED LIQUID ELECTRICAL TAPE ON THE WIRES AND PUT  PLASTIC SPLIT WIRE LOOM TUBING OVER THE WIRES. ALSO TOOK WHITE RUBBER TUBE AND SPLIT IT AND PUT IT ON THE INNER PANEL OPENING THAT CAUSED THE WIRE INSULATION TO GET RUBBED OFF.  THIS FORD TRANSIT CONNECT VAN HAS 32,000 MILES....I THOUGHT FIXING THESE WIRES WOULD CURE THE PROBLEM , AFTER GOING FOR A COUPLE RIDES AND LIFTING THE TAILGATE IT STILL BLOWS THE FUSE. AND THE OTHER LIGHTS STILL COME ON.  OBVIOUSLY THE SKINNED WIRES I REPAIRED WERE A PROBLEM , THERE APPARENTLY IS ANOTHER ISSUE OR TWO",
        "vin": "NM0AE8F70E1"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228912,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT STATED THAT THE SLIDING DOOR DID NOT LATCH. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 150,000.  *TR*JB",
        "vin": "NM0LE7E78E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192826,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WITH THE EXISTING RECALL CAMPAIGN ON 2013 - 2014 FORD FUSIONS AND 2013 - 2016 FORD ESCAPES, THE BUSHING ON THE TRANSMISSION SHIFT CABLE IS DETERIORATING ON THE TRANSMISSION END. IT MUST BE THE SAME PART AS THE RECALL REPLACEMENT BUSHING FITS PERFECTLY. I WAS STUCK IN A PARKING LOT UNTIL I FIGURED IT OUT AND GOT A NEW BUSHING.",
        "vin": "NM0GS9F76E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/23/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191085,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE WINTER RAINY WEATHER, WATER STREAMED OUT OF THE OVERHEAD INTERIOR LIGHT/READING LIGHT FIXTURES ON BOTH  SIDES ABOVE THE DRIVER AND PASSENGER SEATS. THERE IS AUDIBLE SLOSHING WATER IN THE INTERIOR PANELS OF BOTH SLIDING BACK DOORS AND PASSENGER SIDE SEAT BELT IS WET COMING OF THE BELT HOLDER PANEL ON THE FRONT PASSENGER SIDE WITH A SICKENINGLY STRONG MOLD SMELL, INDICATING STANDING WATER OR WET INTERIOR OF THE SEAT BELT HOLDER. THIS VEHICLE HAS HAD FAILURES OF THE WINDOW AND LOCK ELECTRIC FUNCTIONS OF THE DRIVER SIDE WINDOWS AND DOORS BOTH FRONT AND SECOND SEAT (BACK PASSENGER SEAT). CONCERN IS THAT THE PANORAMIC ROOF WINDOW SEAL HAS FAILED, ALLOWING WATER TO FLOOD APERTURES, INCLUDING THE ELECTRIC WINDOW, DOOR, AND LIGHT SWITCHES AND THE SUN ROOF ELECTRICAL SYSTEM. ALSO CONCERNED THAT THIS WILL LEAD TO LOOSENING OF THE SUN ROOF BOND SO IT COULD FALL OUT OR BOUNCE OUT WHILE THE CAR IS IN MOTION. IT IS POSSIBLE THAT THIS CAUSED A RECALL ON SOME US MANUFACTURED VEHICLES - WE BELIEVE OURS WAS IMPORTED FROM ENGLAND BUT DO NOT KNOW FOR SURE. THIS BEGAN IN WINTER 2018 AND CONTINUES WHENEVER IT RAINS. PURCHASED THE VEHICLE IN JULY 2018.",
        "vin": "MNOGE9G72E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162925,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DOOR OF THE VEHICLE OPENS ON IT'S OWN. IF ACCELERATING THEN THE CONTENTS OF THE TRUNK FALL ONTO THE ROAD. THE PROBLEM CONTINUES TO HAPPEN EVEN AFTER REPEATED ATTEMPTS TO GET IT FIXED AT DEALER, AND OVER $1000 SPENT.",
        "vin": "NM0GE9G71E1"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131105,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE BACK SEAT SLIDER DOOR FELL RIGHT OFF. ONTO THE GROUND AND MY FOOT.  WHEN I WENT TO OPEN THE DOOR FROM THE OUTSIDE USING THE HANDLE.  THE MOTOR AND ELECTRICAL FOR THE REAR WIPER HAVE BROKEN AT LEAST TWICE.  THE PAINT IS SPONTANEOUSLY COMING OFF OF THE VEHICLE IN SMALL SPOTS ALL OVER",
        "vin": "NM0AE8F73E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123318,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER NORMAL DRIVING CONDITION THE VEHICLE GOT REAL HOT AND OVERHEATED.THE WATER AND OIL WHERE AT THE PROPER LEVELS. THIS HAPPENED ON THE WAY HOME, I WAS GOING AROUND 60 MPH ON THE HIGHWAY. THE ENGINE HAD TO BE REPLACE, AS IT CRACKED THE HEAD OR BLEW THE HEAD GASKET. THERE IS A SAFETY RECALL # 17S09 OUT ON THESE VEHICLES, BUT MY VIN # WAS NOT ON THE LIST. YET WE ARE HAVING SAME ISSUE. THIS IS THE 3RD ENGINE WE HAVE LOST TO THIS OVER HEATING PROBLEM. LUCKILY WE CATCH ANY ON FIRE.",
        "vin": "NM0KS6FX8E1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080864,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION DOWNSHIFTED HARD AND UP-SHIFTED HARD WHILE THE VEHICLE WAS IN MOTION. THE TACHOMETER WENT OUT OF CONTROL WHILE THE VEHICLE WAS IN MOTION DURING CITY DRIVING AND UPON START UP. THIS WAS CAUSED BY A LEAK IN THE LEFT FRONT AXLE.",
        "vin": "NM0GS9F75E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2018",
        "dateOfIncident": "03/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY TRANSIT CONNECT TITANIUM  . I SLOWED DOWN AND STOPPED AT A RED LIGHT . WHEN IT TURNED GREEN I GAVE IT GAS AND THE FUEL PUMP WENT OUT WHICH CAUSED MY CAR TO DIE IN MIDDLE OF RUSH HOUR TRAFFIC ON A STREET. I SEE A RECALL 15V005000 (FORD RECALL 14S30) WHICH APPEARS TO INCLUDE MY VEHICLE BASED ON DATES, I TOLD MY FORD DEALERSHIP ABOUT THE RECALL ON THE FUEL PUMP BUT THEY TELL ME BY CHECKING THE VIN NUM YOUR VEHICLE ISN'T ON THAT RECALL. I JUST FIND IT HEARD TO BELIEVE THAT EVERY RECALL FORD HAS HAD FOR THE TRANSIT CONNECT . MY VEHICLE WAS NOT INVOLVED IN ANY OF THE RECALLS.",
        "vin": "NM0GE9G72E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073337,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW WIPER WAS BLOWING ITS FUSES RANDOMLY. ALSO NOTICED THE TAIL LIGHTS AND CARGO DOME LIGHT BLINKING OFF AND BACK ON AS THE LIFTGATE WAS RAISED OR LOWERED. I REMOVED THE VEHICLE END OF THE PASSENGER SIDE CORRUGATED RUBBER WIREWAY FROM THE BODY AND DISCOVERED THE WIRE HARNESS SEVERELY ABRADED WHERE IT CROSSED THRU THE OPENING IN THE BODY. ABOUT THREE QUARTERS OF AN INCH OF THE HARNESS WRAPPING AND WIRE COVERINGS ON THREE WIRES WERE SCRAPED AWAY EXPOSING BARE COPPER WIRES WHICH WERE SHORTING OUT TO THE BODY AS THE LIFTGATE WAS OPENED OR CLOSED. THE STAMPED HOLE IN THE METAL BODY HAS A SHARP, RAGGED INNER EDGE. THE SAME SITUATION EXISTS ON THE DRIVERS SIDE BUT OWING TO THE WIRE HARNESS BEING SMALLER AND HAVING MORE SLACK ON THAT SIDE, THE ABRASION HAS ONLY REMOVED THE HARNESS COVERING SO FAR.  HAVING DIAGNOSED THE PROBLEM FROM OBSERVING THE FAULTY WIPER AND TAIL LIGHT SYMPTOMS, I HAVE REPAIRED THE WIRE HARNESS, LINED THE ROUGH METAL HOLES WITH FLEXIBLE PLASTIC GROMMET STRIPS AND RESTORED FUNCTIONALLY BEFORE ANYMORE TROUBLE OCCURRED. I FEEL THIS COULD BE MORE SERIOUS FOR OTHERS UNAWARE OF THEIR PENDING FAILURE. I'VE NO DOUBT THIS CONDITION EXISTS IN OTHER TRANSIT CONNECTS.",
        "vin": "NM0GE9F71E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2017",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051692,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 23, 2017 I DROVE MY VAN TO THE LOADING POINT LIKE EVERY OTHER MORNING, LOADED AND WAS GOING TO START MY DELIVERY ROUTE, BUT MY VAN WOULD NOT START. I WAS VERY DISAPPOINTED, BECAUSE VAN NEVER SHOWED ANY SIGNS OF MALFUNCTION BEFORE. I WAS LUCKY IT DIDN'T HAPPEN ON THE HIGHWAY. THE CAUSE OF THIS BREAKDOWN WAS THE FUEL PUMP. I LOOKED UP ON THE INTERNET FOR THE NEW PART AND FOUND OUT THAT FORD MOTOR COMPANY HAS A RECALL ON THE FUEL PUMP FOR TRANSIT CONNECT MANUFACTURED AT VALENCIA PLANT NOVEMBER 11, 2013 THROUGH AUGUST 29, 2014. MY VAN WAS BUILT NOVEMBER 15, 2013. I TOWED MY VAN TO STEVENS FORD IN MILFORD, CT. SERVICE DEPARTMENT CHECKED OASIS AND TOLD ME THAT I HAVE TO PAY FOR THE REPAIR, BECAUSE MY VAN IS NOT ON THE RECALL LIST. COST OF REPAIR $730.19",
        "vin": "NM0LS7E72E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051535,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS EXPERIENCING A PROBLEM WITH COMPLETE STEERING LOSS WHEN VEHICLE IS DRIVING WORSE THAN NO POWER STEERING THERE IS A RECALL ON MANY FORD AND SOME LINCOLN VEHICLES REGUARDING THIS ISSUE WITH STEERING GEAR.  I'VE REACHED OUT TO FORD REGUARDING THIS ISSUE ALTHOUGH ITS A SEFETY ISSUE WHICH COULD CAUSE SEVERE INJURY OR DEATH TO OCCUPANT OR BYSTANDER.  THIS VEHICLE IS LESS THAN THREE YEARS OLD WITH A CERTIFIED WARRANTY.  ALTHOUGH THIS PROBLEM IS OCCURING ACROSS MULTIPLE VEHICLES AND KEEPS EXPANDING THEY AREN'T WILLING TO TAKE CARE OF THERE ISSUES.  MY VEHICLE IS CURRENTLY AT MARGATE FORD IN POMPANO FLORIDA.  I'M AFFRAID OF PICKING IT UP DO TO SAFETY ISSUE.",
        "vin": "NM0GE9G73E1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "08/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025411,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. WHILE DRIVING THROUGH A CONSTRUCTION ZONE AT NIGHT, THE HIGH BEAMS WERE TURNED ON, BUT FAILED TO ILLUMINATE CORRECTLY. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN AUTO ELECTRICAL SHOP WHERE IT WAS DIAGNOSED WITH A FAULTY HEAD LIGHT SWITCH THAT NEEDED REPLACEMENT. THE SWITCH WAS REPLACED, BUT THE FAILURE PERSISTED. THEY VEHICLE WAS TAKEN BACK TO THE AUTO ELECTRICAL SHOP WERE IT WAS DIAGNOSED WITH A SECOND SWITCH THAT NEEDED REPLACEMENT. THE SECOND HEADLIGHT SWITCH WAS REPLACED, BUT THE FAILURE STILL PERSISTED. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 36,000.",
        "vin": "NM0GE9G75E1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/13/2017",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022995,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION BROKEN.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002043,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP WENT OUT WHICH CAUSED MY CAR TO DIE IN MIDDLE OF RUSH HOUR TRAFFIC ON 6 LANE  HIGHWAY (3 LANES EACH WAY) JUST OVER A RISE.   I SEE A RECALL 15V005000  (FORD RECALL  14S30) WHICH APPEARS TO INCLUDE MY VEHICLE BASED ON DATES, BUT THE RECALL IS NOT LISTED FOR MY VIN.   CAN YOU EXPLAIN WHY MINE WOULD NOT BE COVERED?   MY CAR IS CURRENTLY STILL IN THE SHOP (IT IS WED EVENING AND IT WAS TOWED THERE FRIDAY MORNING.       VIN  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "NM0GE9G7XE1"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/10/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984765,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO RECALLS HAVE BEEN ISSUED ON MY VEHICLE AND THREE  DIFFERENT FORD DEALERS (MODESTO, CA. TRACY, CA. AND STOCKTON, CA.) HAD REFUSE TO SERVICE THEM, I DO NOT KNOW WHAT TO DO,NOISE IS HIGH AND DISTURBING AND THE SLIDE IS BROKEN, I AM AFRAID THE DOOR COULD OPEN WHILE DRIVING.  RECALL 16S35 AND RECALL 16S30  NEED HELP!!!",
        "vin": "NM0GE9G70E1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/31/2017",
        "dateOfIncident": "03/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969697,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SLOWLY THROUGH MY NEIGHBORHOOD, THE LEFT REAR SEAT SUPPORT BROKE CAUSING THE DRIVER SEAT TO LEAN BACK AND TO THE LEFT. THE PHOTO WILL SHOW THE 2 POINTS OF FAILURE. I USE THE DRIVER SEAT IN THE FULLEST BACK POSITION AND LOWEST DOWN ADJUSTMENT FOR A TALL DRIVER.",
        "vin": "NM0GE9G70E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967729,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 12V491000 (VISIBILITY); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "NM0LE7F72E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/30/2017",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V643000 (STRUCTURE: BODY). THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "NM0GS9F76E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/16/2017",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945581,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPRING-LOADED CONICAL DOOR WEDGE RECEIVER SPONTANEOUSLY BECOMES DISASSEMBLED, IMPEDING DOOR CLOSURE.  THIS OCCURS WHEN THE DOOR IS OPENED, AND HAS HAPPENED TO ME OR MY WIFE ON SEVEN SEPARATE OCCASIONS.  IT RENDERS THE DOOR INOPERABLE.  THE VEHICLE HAS BEEN STATIONARY, IN PARKING LOTS OR DRIVEWAYS AND HAS REMAINED SO UNTIL THE PART COULD BE REPAIRED.",
        "vin": "NM0GE9F72E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/19/2016",
        "dateOfIncident": "10/18/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917240,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SENSORS AND REARVIEW CAMERA START GOING OFF FOR NO REASON WHEN IN MOTION ON A CITY STREET OR HIGHWAY. THIS HAS HAPPENED SEVERAL TIMES MOST RECENT IS 10/18/2016. NOTE IF VEHICLE IS PUT INTO PARK. AND YOU WAIT 30 SECONDS IT WILL STOP. BUT STARTS UP AGAIN,   AFTER 20 SECONDS.",
        "vin": "NM0AE8F72E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/15/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916291,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE (HIGHWAY SPEEDS, WINDY WEATHER), THE ENTIRE PANORAMIC SUNROOF BLEW COMPLETELY OFF THE VEHICLE.  THE PANORAMIC SUNROOF ON THE FORD TRANSIT IS STATIONARY AND CANNOT BE OPENED FOR VENTILATION PURPOSES.  IT ONLY LETS IN LIGHT.  WE NOW HAVE A GAPING HOLE IN THE ROOF OF OUR VEHICLE.",
        "vin": "NM0GE9F71E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865490,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"ENGINE FAULT, SERVICE NOW\" LIGHT COMES ON UPON IGNITION, AND WHILE OPERATING.  ENGINE BUCKS, STALLS, AND SLIPS.  THIS HAS HAPPENED MORE THAN 100 TIMES SINCE I PURCHASED THE VAN IN AUGUST 2014.  THE DEALERSHIP SAYS THEY DO NOT KNOW HOW TO FIX IT.  IT IS A KNOWN PROBLEM WITH FORD, BUT THEY ARE COMPLETELY IGNORING ME.  MY CUST. SERVICE REP TELLS ME THAT THE \"NEXT STEP\" IS TO TAKE IT TO THE DEALERSHIP TO HAVE THEM REPAIR IT.  THE VAN IS UNREPAIRABLE AND DANGEROUS.",
        "vin": "NM0KE6FX9E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850503,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WELL DRIVING MY TRANSIT CONNECT . I SLOW DOWN OR STOP FOR A LIGHT . WHEN IT TURNS GREEN I GIVE IT GAS AND THE VEHICLE WILL HESITATE BEFORE TAKING OFF. I TOLD MY FORD DEALERSHIP ABOUT THE RECALL ON THE FUEL PUMP BUT THEY TELL ME BY CHECKING THE VIN NO YOUR VEHILE ISNT ON THAT RECALL. I JUST FIND IT HEARD TO BELIEVE THAT EVERY RECALL FORD HAS HAD FOR THE TRANSIT CONNECT . MY VEHICLE WAS NOT INVOLVED IN ANY OF THE RECALLS. THE ISSUE I AM HAVING HAPPENS IN THE CITY STREETS, ON HIGHWAY, TURNING ETC. WHEN I NEED THE GET UP AND GO FROM THE GAS TANK IT FAILS TO HAPPEN",
        "vin": "NM0AE8F72E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2016",
        "dateOfIncident": "09/25/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817517,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SUN IS SHINING CAN NOT READ ANY INSTRUMENTS INCLUDING SPEEDOMETER.. POOR ENGINEERING.",
        "vin": "NM0GE9F73E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2016",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817306,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LCD DISPLAY WHICH INCLUDES RADIO, NAVIGATION, CLIMATE CONTROL, AND BLUE TOOTH PHONE DOES NOT WORK PROPERLY. PUSH WITH YOUR FINGER IN ONE PLACE AND IT WORKS IN ANOTHER SPOT. SOMETIMES IT HANGS UP AND IS HARD TO CLEAR. STATIONARY OR MOVING IT WORKS THE SAME.",
        "vin": "NM0GE9F7XE1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2015",
        "dateOfIncident": "08/12/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748311,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TRANSIT CONNECT HAS NOT HAD A PROBLEM WITH THE FUEL PUMP, AND THERE ARE OVER 7000 MILES AFTER LESS THAN A YEAR.  I BOUGHT IT AT JIM BASS FORD DURING THE FALL OF 2014.  I NOTICED THE RECALL FOR THE FUEL PUMP IN JUNE AND WAS TOLD BY JIM BASS FORD IN SAN ANGELO THAT PARTS WEREN'T AVAILABLE.  THE NHTSA AND FORD.COM WEBSITE INFORMATION CONCURRED.  I CHECKED THE FIRST WEEK OF AUGUST, AND ONLINE STILL SAYS THE PARTS ARE NOT AVAILABLE.  BUT THE JIM BASS FORD TECHNICIAN SAID I COULD BRING IT IN AND THEY WOULD CHECK IT AND SEE IF IT NEEDED A NEW FUEL PUMP AND ASSOCIATED PARTS.  MY APPOINTMENT WAS MADE FOR ONE WEEK LATER, WHICH WAS TUESDAY, AUGUST 11.  YESTERDAY THEY TOLD ME TUESDAY THAT IT WOULD BE FIXED BY TODAY.  THE TECHNICIAN SAID THE PARTS WERE AVAILABLE AS OF YESTERDAY, BUT TODAY WHEN I ARRIVED TO PICK UP THE VAN, I WAS TOLD THE PARTS HAD NOT COME IN AND IT COULD BE WEEKS BEFORE THEY DO.  RATHER THAN LEAVE THE VAN IN THE HOT SUN FOR WEEKS, I TOOK IT HOME TO MY GARAGE.  THEN I CALLED FORD.COM CUSTOMER SERVICE AND WAS TOLD THE PARTS WON'T BE READY UNTIL OCTOBER.   TONIGHT I READ THE NHTSA REPORT AGAIN WHICH SAYS THAT FUEL PUMP PROBLEMS OF SOME VANS  WERE TAKEN CARE OF IN FEBRUARY, 2015.        I FEEL LIKE I AM GETTING THE RUN-AROUND FROM EVERYONE.  WHOSE INFORMATION IS CORRECT?  ARE THE PARTS AVAILABLE NOW OR NOT?  IF SO, WHY CAN'T THEY GET PARTS FOR MY VAN?    ALSO, I HAVE NOT RECEIVED A RECALL LETTER FROM FORD.  ANY INFORMATION I HAVE GOTTEN HAS BEEN FROM EITHER THE NHTSA WEBSITE OR FORD.COM.  CAN I DRIVE THE VAN?  WHY HAVEN'T I GOTTEN A RECALL LETTER?  MY HUSBAND WAS WITH ME WHEN I PICKED UP THE VAN TODAY.      [XXX]  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "NM0GS9F7XE1"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/06/2015",
        "dateOfIncident": "07/17/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746816,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 55 MPH, THE REAR DRIVER'S SIDE WINDOW DETACHED FROM THE VEHICLE WITHOUT WARNING. THE VEHICLE WAS TOWED TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE GLUE THAT WAS USED TO SECURE THE WINDOW FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V777000 (STRUCTURE). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "07/20/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745742,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V005000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT THE PART NEEDED WAS NOT AVAILABLE WITHIN A REASONABLE TIMEFRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE AND THE CONTACT WAS UNABLE TO OBTAIN THE VEHICLE UNTIL THE REPAIR WAS PERFORMED. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE.",
        "vin": "NM0GE9F78E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744871,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. THE CONTACT STATED THAT THE VEHICLE STALLED. THE CONTACT RECEIVED  NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V005000 (FUEL SYSTEM) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "NM0GS9F72E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/23/2015",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TRANSIT CONNECT. WHEN DRIVING VARIOUS SPEEDS DURING RAINY WEATHER CONDITIONS, THE DRIVER SIDE WINDSHIELD WIPER FAILED TO CLEAR THE WINDSHIELD. AS A RESULT, THE CONTACT'S VISION WAS OBSTRUCTED. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN STATED THAT THE WIPERS WERE OPERATING AS DESIGNED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 5.",
        "vin": "NM0LS6E73E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/13/2015",
        "dateOfIncident": "04/27/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716334,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING 60MPH HEARD A HIGH PITCHED NOSE INSIDE THE FRONT OF THE VEHICLE. DEALER THOUGHT THERE WAS A HOLE IN THE FIREWALL. NOT THE CASE I AM THE FIRST ONE TO HAVE THIS ISSUE. FOUND OUT TODAY AFTER THEY HAD THE VEHICLE FOR OVER 3 WEEKS THAT THE VISTA WINDOW, WHICH IS ON TOP OF THE VEHICLE, WAS LOOSE AND COULD FLY OFF AT ANYTIME. INSTANT SUNROOF BUT THINK ABOUT THE VEHICLES BEHIND YOU THAT COULD CAUSE A BAD ACCIDENT. IT WAS DETERMINED BY FORD THAT IF YOU GET INSIDE THE VEHICLE AND PUSH UP ON THE GLASS AND IT MOVES THEN IT WILL FLY OFF AT ANY TIME. THIS WAS CAUSED BY IT NOT BEING INSTALLED CORRECTLY AT THE FACTORY. I DON'T HAVE A PROBLEM WITH THIS ANYMORE AS I TRADED THAT VEHICLE IN ON ANOTHER ONE WITH OUT THE WINDOW..",
        "vin": "NM0AE8F71E1"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/18/2015",
        "dateOfIncident": "02/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706465,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE FOUR VERY YOUNG CHILDREN WHO RIDE IN THE REAR OF OUR SEVEN PASSENGER TRANSIT CONNECT IN AN AREA OF TENNESSEE WHERE WINTER TEMPS FREQUENTLY DIP INTO THE SINGLE DIGITS AND OFTEN BELOW ZERO. OUR HEATER FOR THE REAR PASSENGERS HAS NEVER WORKED. WE HAVE HAD THE VAN BACK TO THE DEALER TWICE.  STILL NO REAR HEAT.   *TR",
        "vin": "NM0GE9G70E1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "03/27/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEBRUARY I WAS DRIVING ON THE FREEWAY AND HEARD A STRANGE NOISE.  WHEN I GOT OFF THE FREEWAY I NOTICED THE TIRE WAS FLAT.    IN MARCH I WAS GETTING OUR OF THE CAR AND A MAN WALKING BY NOTICED I HAD A BUBBLE IN THE SIDE OF MY TIRE.  I HAVE HAD TO REPLACE 3 TIRES SINCE I GOT THIS CAR I BOUGHT THE CAR ON 12/26/14.  AND HAVE HAD PROBLEMS WITH THREE OF THE ORIGINAL TIRES ON THE CAR!  I ONLY HAVE ABOUT 2,000 MILES ON THE CAR.  THE FIRST 2 TIRES I PAID TO HAVE THEM REPLACED.  THE THIRD TIRE I AM WAITING TO HAVE IT REPLACED BY THE COMPANY.  I AM USING THE SPARE AND DON'T HAVE A BACK UP.  *TR",
        "vin": "NM0GS9F7XE1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "03/10/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693384,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SLIDING DOOR ON THE DRIVERS SIDE.  I OPENED IT AND THEN IT WOULD NOT CLOSE.  A LITTLE PLASTIC SPRING / PLUNGER FROM THE \"B\" POST HAD ATTACHED ITSELF TO THE PIN ON THE DOOR AND WOULD NOT ALLOW THE DOOR TO CLOSE.  THERE WAS NO WAY TO GET THE DOOR TO CLOSE OTHER THAN TO MANUALLY WORK AND REMOVE THIS SPRING FROM THE DOOR PIN,  HOWEVER THE PLASTIC PART OF THE SPRING / PLUNGER IS STILL IMPALED ON THE DOOR PIN.  I AM TAKING THE VEHICLE INTO THE DEALER FOR REPAIR - BUT OBVIOUSLY THIS IS A SERIOUS DESIGN DEFECT THAT KEEPS THE DOOR FROM PROPERLY CLOSING AND LATCHING.   *TR",
        "vin": "NM0GE9G78E1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "02/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692284,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE IN FOR THE FIRST OIL CHANGE AND IT WAS NOTED THE TRANS AXLE WAS LEAKING. THIS IS THE 2ND VEHICLE WE HAVE THAT THIS HAS HAPPENED TO - 2014 FORD TRANSIT CONNECT. FORD DOES NOT SEEM CONCERNED ABOUT IT. THE FIRST VEHICLE TOOK ~ 2 WEEKS TO GET REPAIRED. FORD HAS ORDERED THE PARTS TO REPAIR THIS VEHICLE, BUT CAN'T FIT IT IN THEIR SERVICE SCHEDULE. IT HAS BEEN 3 WEEKS SINCE THE VEHICLE WAS TAKEN INTO THE DEALER FOR REPAIR AND IT IS STILL NOT FIXED.  *TR",
        "vin": "NM0GS9F74E1"
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691734,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORD 2014 INTERIOR DASHBOARD LIGHTING IS ALWAYS ON, AND VERY OFTEN AT NIGHT DUE TO THIS CONDITION I FORGET TO TURN ON MY DRIVING LIGHTS, MAKING FOR A HAZARDOUS SITUATION.  BECAUSE THE INSTRUMENTS (SPEEDOMETER, TACHOMETER, FUEL AND TEMP GAUGE) ARE NESTED IN DEEP BEZELS FORD HAD TO ILLUMINATE THEM DURING THE DAY TO MAKE THEM VISIBLE IN DAYLIGHT. FORD TRANSIT CONNECT WITHOUT AUTO-HEADLIGHTS HAVE THIS UNSAFE CONDITION THAT FOOLS THE DRIVER INTO THINKING THAT THE HEADLIGHTS ARE ON AT NIGHT WHEN IN FACT THEY ARE NOT.  *TR",
        "vin": "NM0AS8FX3E1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/31/2015",
        "dateOfIncident": "01/17/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680102,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CENTER COUNSEL WHERE THE DRIVERS RIGHT LEG (JUST UNDER KNEE) TOUCHES BECOMES EXTREMELY HOT WHILE RUNNING THE HEAT ON HIGH AT A 2-4 FAN SPEED. CAUSED A 2ND DEGREE BURN THAT REQUIRED MEDICAL ATTENTION.   *TR",
        "vin": "NM0LS7F7XE1"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669599,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PERHAPS NOT A SAFETY HAZARD, BUT THE REAR AREA OF THE 7 PASSENGER IS NOT HEATED, CAUSING DISCOMFORT TO PASSENGERS AND PETS. ACTUALLY, THE REAR \"HEATER\" BLOWS COLD AIR. TWO DEALERSHIPS HAVE INSPECTED MY VEHICLE (5800 MILES) AND BOTH REPORTED THAT THE DESIGN IS, \"INADEQUATE\", \"POOR\", \"NOT THOUGHT OUT\", \"CRAPPY\" AND SO ON. THAT WAS THE ONLY EXPLANATION THEY COULD TENDER. I HAVE POSTED THIS SITUATION OF THE TRANSIT CONNECT FORUM AND HAVE NOTED THAT OTHERS ARE EXPERIENCING THE SAME PROBLEM. I JUST PAID $32,000 FOR A NEW VEHICLE THAT HAS A TOTALLY INADEQUATE REAR HEATING SYSTEM. OF COURSE I PURCHASED THE VEHICLE AT THE END OF JULY SO I NEVER GAVE THE REAR HEATER A THOUGHT. COME TO THINK OF IT, I HAVE NEVER GIVEN A REAR HEATER A THOUGHT AS THEY ALWAYS WORKED. WHEN WAS THE LAST TIME YOU CHECKED THE OPERATION OF THE REAR HEATING SYSTEM BEFORE PURCHASING A NEW VEHICLE?  *TR",
        "vin": "NM0GE9G72E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS AIM AT GROUND APPROX 30-40 FT IN FRONT OF  VEHICLE. CAN NOT SEE BEYOND THAT AT NIGHT. TOOK BACK TO DEALER AND THEY ADJUSTED THEM SO NOW I CAN SEE ABOUT 2-3 CAR LENGTHS IN FRONT OF ME AT ANY SPEED. DEALER SAID THEY WERE FINE EVEN THE WAY THEY WERE. I HAVE HAD 2 CLOSE CALL EVENTS, ONE INVOLVING A PEDESTRIAN, I WANT THIS TO BE ON RECORD FOR THE TIME WHEN IT IS NOT JUST A CLOSE CALL AND I ACTUALLY HIT SOMEONE.  L AM ALSO REPORTING THIS TO MY INSURANCE COMPANY. THE DEALER IS AUTOFAIR OF MANCHESTER, NH.",
        "vin": "NM0GE9F73E1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614861,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EASY FUEL SYSTEM LEAKS BADLY ESPECIALLY OVER 75 DEGREES. I CAN SMELL THE STRONG ODOR OF GASOLINE. IN ADDITION IT SET OFF THE MIL LIGHT FOR THE \"SMALL LEAK\" IN THE EVAP SYSTEM. IT HAS NOW SET A PERMANENT CODE FOR THIS PROBLEM. THE PROBLEM IS THE FLAP DOES NOT TIGHTLY SEAT ENOUGH TO CONTAIN THE GAS VAPOR AND THE UNIT OUT GASSES BADLY. IT COULD BE A MAJOR FIRE HAZARD.      ANY OPEN FLAME, SPARK ON A JOB SITE, OR JUST SOME GOOF WITH A LIT SMOKE COULD SET OFF A FIRE BALL. AT PRESENT THE UNIT IS PARKED, AS I AM AFRAID TO DRIVE IT LESS IT BECOME A LIABILITY PROBLEM FOR OUR FIRM.    WHAT IS NEEDED IS A STANDARD FUEL CAP TO TOTALLY SEAL THE TANK. THERE IS NO WAY TO GET ONE FROM FORD TO FIX THIS PROBLEM.   *TR",
        "vin": "NM0LS6F73E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2014",
        "dateOfIncident": "05/30/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WE BOUGHT IS FROM HUFFMAN FORD. ON FRIDAY, MAY 30TH,  WE WERE DRIVING, AND ALL OF A SUDDEN THERE WAS SMOKE COMING FROM THE ENGINE, AND THE CAR GOT OVERHEATED. IN ORDER TO FIND OUT WHAT WAS GOING ON, THAT AFTERNOON WE WENT TO AUTO NATION KATY SERVICE DEPARTMENT, SINCE IT IS CLOSER TO WHERE WE LIVE THAN HUFFMAN.  WE TALKED WITH THE SERVICE MANAGERS [XXX], AND [XXX] AND THEY INFORMED US THAT WE WOULD GET A CALL THAT EVENING ABOUT THE VEHICLE. WE WAITED ALL EVENING, BUT WE DIDN'T GET A CALL FROM THEM. THE NEXT MORNING WE WENT BACK OVER TO AUTO NATION TO SEE WHAT WAS GOING ON, AND THEY TOLD US THAT OUR CAR HAD AN OIL LEAKAGE, AND THEY SAID HOW IT WILL ALL BE FIXED ON MONDAY, JUNE 2ND. WE SAID IT WAS FINE AS LONG AS THEY KEEP US INFORMED AND FIX OUR CAR.  THEN TUESDAY, WE FOUND OUT IT STILL WASN'T FIXED, AND THEY TOLD US THAT THEY FOUND OUT THERE WERE NO AVAILABLE PARTS TO FIX THE PROBLEM THE VEHICLE HAS, AND THAT THE EARLIEST DELIVERY THEY CAN GET IS JULY 28TH, WHICH IS ABSOLUTELY RIDICULOUS CONSIDERING IT'S A BRAND NEW VEHICLE. THEN WE CALLED THE FORD COMPANY AND TALKED TO THE REGION MANAGER [XXX] ABOUT OUR SITUATION, AND AFTER REQUESTING FOR A LONG TIME SHE FINALLY AGREED TO GIVE US A RENTAL CAR. ALSO, BEFORE ASKING ABOUT GIVING US A LOANER CAR, I ASKED IF SHE COULD JUST REPLACE OUR VEHICLE AND GIVE US ANOTHER FORD TRANSIT CONNECT BECAUSE LIKE I SAID BEFORE THE VEHICLE IS STILL BRAND NEW AND WE ALSO HAVE A WARRANTY. SHE WASN'T UNDERSTANDING AT ALL AND DIDN'T WANT TO HELP AND JUST SAID THAT WE CAN'T SUPPORT YOU WITH YOUR VEHICLE'S PROBLEM. WE ARE HAPPY WITH THE CAR WE BOUGHT, BUT FRANKLY THIS IS THE WORST EXPERIENCE WE HAVE EVER HAD WITH CUSTOMER SERVICE IN THE FORD COMPANY. ON TOP OF THAT, SHE TOLD US THAT WE ALSO HAVE TO PAY THE TAX FOR THE RENTAL CAR EVERY SINGLE DAY THAT WE HAVE IT.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "NM0LE7EX5E1"
    }
]