[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458231,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Ford Flex. The contact stated while driving approximately 45 MPH the steering wheel felt like it slipped. There were also unknown noises from the steering wheel when turned left. The brake warning light was illuminated.  The vehicle was taken to the local dealer and diagnosed with NHTSA Campaign Number: 20V072000 (Suspension). The vehicle had not been repaired. The manufacturer was notified of the failure. The approximate failure mileage was 20,000",
        "vin": "2FMGK5D84EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/18/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457863,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle was repaired under recall 20V-072. This was for the rear suspension toe link. The replacement rear suspension toe link on the right side has cracked. This was discovered when the right rear wheel was removed for tire replacement. I have a photo of the failed toe link part.",
        "vin": "2FMGK5C82EB"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "03/04/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Ford Flex. The contact stated that while stopped at a traffic light, the vehicle stalled. The contact attempted to restart the vehicle however, the vehicle failed to restart. There was no warning light illuminated. The vehicle was towed to the dealer where it remained. The contact was informed that the fuel pump module needed to be replaced. The vehicle was not repaired. The manufacturer was not contacted or notified of the failure. The approximate failure mileage was 104,000.",
        "vin": "2FMHK6C84EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/15/2022",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452031,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "This vehicle has been on the recall list since Feb of 2020, every ,it was taken to Tamiami Ford Inc., in Naples Fl. about 4 or 5 times since I was notified by Car Fax a couple years ago and they always say the same thing \" We dont gave the part \". So what is a customer supposed to do? But when I pay them for servicing the vehicle there are no problems having the Part.",
        "vin": "2FMGK5C84EB"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11438432,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Ford Flex. The contact stated while driving approximately 45 MPH when the contact heard a noise coming from the vehicle and shortly after lost control of the vehicle resulting in the contact hitting a parked vehicle with no air bags deploying. There were 3 injured, the son and daughter sustained bruising over arms and legs. The mother sought medical treatment and sustained injuries to the back. A police report was taken and the vehicle was towed to a tow lot then towed to an insurance lot where it was awaiting diagnosis. The contact stated no warning lights were illuminated. The manufacturer was not informed of the failure. The failure mileage was approximately 111,000.",
        "vin": "2FMGK5B80EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "09/13/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436617,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Ford Flex. The contact stated while driving at various speeds and making turns, the steering wheel was difficult to maneuver. The contact stated that no warning lights were illuminated. The vehicle was taken to an independent mechanic who diagnosed the failure and stated that the steering angle sensor and power steering sensor module needed to be replaced. The vehicle was not repaired. The contact researched the failure online and found NHTSA Campaign Number: 15V340000 (Steering) however, the year, make, and model was not included in the recall. The contact stated that the recall was related to her vehicle failure. The dealer was not contacted. The manufacturer was notified of the failure but no assistance was offered. The approximate failure mileage was 122,000.",
        "vin": "2FMGK5C88EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435260,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver side door locks are malfunctioning. the system says the door is open when it is securely closed. The system won’t turn off interior lights which drains the battery. It also won’t allow locks to lock thinking the door is ajar. There are recalls for this issue on other Ford SUV’s but not for the Flex.",
        "vin": "2FMHK6D82EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On two occasions over the past 2 weeks the power steering has failed while my daughter was driving the car. She said was able to safely \"force\" the car to the side of the road at which time she turned the car off. Upon restarting the car the warning was gone and the power steering worked again.  There was no warning that this was going to happen and luckily she was on a straight portion of road. She commented that had she been on a curved road she would not have been able to negotiate the turn. She has stated that the dash indicated that the power steering assist warning light illuminated after or about the same time as it failed each time and then cleared once the ignition was turned off and then back on. We researched this and it appears to be the same issue indicated in NHTSA campaign number 15v340000 (steering).",
        "vin": "2FMHK6D82EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "04/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424333,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My car thinks passenger door is constantly open. And my car alarm goes off sporadically all hours of day and night. Rain sleet or snow even hot weather.",
        "vin": "2fmhk6c89eb"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419308,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The Driver Door Ajar light comes on even when the door has been closed.  It takes a few times of closing the door hard before the light goes off.  The alert means the interior lights stay on and it keeps alerting me that I'm not in Park.  If I can't get the alert light to go off, this would be a hazard to driving, especially at night.",
        "vin": "2FMHK6D85EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/13/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416403,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY FORD FLEX IN FOR A RECALL FOR THE REAR TOE LINKS ON 1/6/21 AT 55,000 MILES SINCE THE RECALL WAS OPEN FOR MY CAR. EVEN THOUGH I WAS NOT EXPERIENCING ANY ISSUES. WHILE DRIVING MY CAR ON MAY 1, THE REAR WOULD SWAY ON ME AND I DIDN'T FEEL SAFE. I HAD THE CAR TOWED TO THE SAME DEALERSHIP THAT DID THE RECALL AND THEY FOUND THAT THE TOE LINKS WERE FAULTY. THAT HAD JUST BEEN REPLACED DUE TO THE RECALL. NOT SURE IF THE REPLACEMENT PARTS FOR THE RECALL ARE FAILING FOR EVERYONE.",
        "vin": "2FMHK6C86EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/13/2021",
        "dateOfIncident": "04/19/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416481,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS MADE AWARE OF THE RECALL BUT INFORMED THE CONTACT THAT PARTS WERE NOT BEING MADE AVAILABLE BY THE MANUFACTURER TO REMEDY THE RECALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2FMGK5C8XEB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408052,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED SUNNYVALE FORD (650 E EL CAMINO REAL, SUNNYVALE, CA 94087) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT THEY WOULD REACH OUT TO THE LOCAL DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2FMGK5C89EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406739,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD NOTIFIED MY IN MARCH OF 2020 OF AN OPEN RECALL ON THE REAR SUSPENSION TOE LINK, AND THAT I SHOULD SCHEDULE AN APPOINTMENT WITH SERVICE TO HAVE THIS TAKEN CARE OF.  I TOOK THE CAR INTO THE DEALER (FUTURE FORD IN SACRAMENTO, CA) IN JULY OF 2020 AND THEY SAID THEY DIDN'T HAVE THE PARTS YET AND TO TRY BACK IN Q3.  I RECEIVED A SECOND LETTER IN OCTOBER OF 2020, AGAIN STATING TO SCHEDULE SERVICE TO HAVE THE RECALL WORK PERFORMED AND WAS TOLD THEY STILL DID NOT HAVE THE PARTS.  I CALLED AGAIN IN DECEMBER OF 2020 AND AGAIN IN FEBRUARY OF 2021, AND AGAIN IN MARCH OF 2021 AND THEN WAS TOLD TO CALL BACK IN APRIL.  I CALLED LAST WEEK AND WAS TOLD THAT THE PARTS ARE STILL NOT AVAILABLE AND THAT THERE WAS A NATIONAL BACKORDER.  AFTER CALLING SEVERAL DEALERSHIPS IN MY AREA, INCLUDING ONES THAT WERE HOURS AWAY (I WAS WILLING TO TAKE THE CAR THERE TO GET IT FIXED), I WAS TOLD THERE ARE NO PARTS ANYWHERE.  I AM MOVING ACROSS THE COUNTRY (2500 MILES) AND AM WORRIED THIS PART WILL FAIL (AS DETAILED IN THE RECALL NOTICE) AND HAVE ALSO HAD TO REPLACE TWO REAR TIRES BECAUSE THEY ARE WEARING IMPROPERLY, I BELIEVE DUE TO THIS ISSUE.  THE CAR IS ALSO LOUDER THAN BEFORE AND I BELIEVE THIS IS RELATED TO THE TOE LINK ISSUE AS WELL.  I WAS TOLD EACH TIME I CALLED THAT MY VIN IS A \"MUST REPAIR\" RATHER THAN JUST HAVING IT INSPECTED TO SEE IF IT IS DAMAGED OR NOT.  HOW CAN FORD ALLOW THIS TO HAPPEN FOR THE LAST YEAR+ AT THIS POINT?  THIS SEEMS UNREASONABLE AND COSTLY TO ME AS I AM GOING TO KEEP WEARING MY TIRES IMPROPERLY BECAUSE OF THIS ISSUE.  PICTURES OF THE UNEVEN WEAR ON THE REAR TIRES ARE ATTACHED.",
        "vin": "2FMGK5C80EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402543,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CRANKS BUT WON'T START. CODE READER READS P0627 FUEL PUMP CONTROL CIRCUIT OPEN. THE VEHICLE WAS IN MOTION AND THEN STOPPED. I HAD MY TANK ALMOST FULL.",
        "vin": "2FMGK5C89EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH ON A MOUNTAIN PATH WITH SNOW ON THE GROUND AT SPEEDS OF APPROXIMATELY 45 MPH, AN AUDIBLE ALARM ACTIVATED AND THE MESSAGE POWER STEERING LOST DISPLAYED BEFORE THE POWER STEERING MALFUNCTIONED CAUSING THE STEERING WHEEL TO BECOME VERY DIFFICULT TO TURN IN EITHER DIRECTION. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER WRIGHT FORD LOCATED AT 1835 S HWY 97, REDMOND, OR 97756 WHO DIAGNOSED THAT THE POWER STEERING MODULE WAS DEFECTIVE AND THE STEERING RACK NEEDED TO BE REPLACED. IN ADDITION, IT WAS ALSO DETERMINED THAT THE CHASSIS BOLTS HAD RUSTED ON THE VEHICLE. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 75,000.",
        "vin": "2FMHK6C89EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397336,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY \"FUEL PUMP MODULE\" ON MY NON ECO BOOST 3.5 SUDDENLY STOPPED FUNCTIONING.  THE SAME MODULE WAS RECALLED ON THE ECO BOOST 3.5 ENGINE.  I HAD JUST DRIVEN 800 PLUS MILES IN TWO DAYS AND THE ENGINE WORKED PERFECTLY.  TWO DAYS LATER, IT WOULD NOT START, WHILE PARKED IN THE DRIVEWAY.  A DAY LATER IT STARTED.  A DAY AFTER THAT IT WOULD NOT START, AGAIN WHILE PARKED.  I GOOGLED THE PROBLEM AND REPLACED THE PART, AND IT HAS WORKED PERFECTLY EVER SINCE.  IT WOULD HAVE BEEN A REAL ISSUE IF IT HAD FAILED WHILE DRIVING THROUGH WEST TEXAS DURING THE SUB ZERO FREEZING TEMPS.",
        "vin": "2FMGK5D83EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT'S WIFE WAS ATTEMPTING TO START THE VEHICLE HOWEVER, THE STEERING WHEEL CEASED. THE STEERING ASSIST FAULT LIGHT ILLUMINATED ALONG WITH ANOTHER UNKNOWN WARNING LIGHT. THE CONTACT WAS ABLE TO START THE VEHICLE AND THE VEHICLE WAS DRIVEN TO FORD OF DALTON (925 SHUGART RD, DALTON, GA 30720) HOWEVER, THE VEHICLE WAS NOT YET DIAGNOSED. THE VEHICLE REMAINED AT THE DEALER UNREPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 54,000.",
        "vin": "2FMGK5C86EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2021",
        "dateOfIncident": "12/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395967,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME ISSUE AS RECALL 16S46 WITH FAULTY TURBO OIL SUPPLY LINE LEAKING.  FORD COVERS MFG YEARS 2016-2017, BUT IS DENYING COVERAGE FOR THE SUBJECT 2014.",
        "vin": "2FMHK6DT6EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT RECEIVED NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) AND WAS ASSOCIATED WITH THE VIN. HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD EXPERIENCED A FAILURE WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE REAR TIRES BELIEVED TO BE WORN OUT FROM THE SUSPENSION. NO WARNING LIGHTS ILLUMINATED. THE CONTACT MENTIONED THAT HE HAD TO CHANGE OUT THE REAR TIRES EVERY 4 MONTHS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO INSPECTED THE REAR SUSPENSION AND INFORMED THE CONTACT THAT THE REAR SUSPENSION WAS FAULTY. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED. CLONINGER FORD (511 JAKE ALEXANDER BLVD S, SALISBURY, NC 28147 (704) 802-1388) WAS CONTACTED AND INFORMED THAT NO PARTS WERE AVAILABLE TO DUE THE REPAIR. VIN TOOLS CONFIRMED PARTS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "2FMHK6C89EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385024,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC POWER STEERING KEEPS GOING OUT RANDOMLY. DANGEROUS!!! I NOTICE THAT THERE IS A RECALL ON THIS ISSUE UP TO 2013 FORD FLEX MODELS. MINE IS A 2014. NEEDS TO BE RECALLED BEFORE SOMEONE IS HURT! HAPPENS MOSTLY AT STARTUP BUT HAS HAPPENED WHEN MOVING AS WELL!  THIS IS VERY UNSAFE AND FORD WILL NOT TAKE ANY OWNERSHIP.",
        "vin": "2FMGK5C86EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377292,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT WHILE DRIVING, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE CONTACT DISCOVERED THAT THE STEERING COLUMN UNIVERSAL JOINT WAS RUSTED. ON MULTIPLE OCCASIONS THE STEERING WHEEL SEIZED AFTER TURNING APPROXIMATELY 90 DEGREES, ALMOST CAUSING THE DRIVER TO LOSE CONTROL OF THE STEERING. THE VEHICLE WAS TAKEN TO THE LOCAL MECHANIC WHO DIAGNOSED THAT THE STEERING COLUMN WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE STEERING COLUMN WAS REPLACED AND THE FAILURE WAS REMEDIED. THE MANUFACTURER AND LOCAL DEALER SKALNEK FORD LOCATED AT 941 S LAPEER RD, ORION CHARTER TOWNSHIP, MI 48362 WERE NOTIFIED OF THE FAILURE.  THE FAILURE MILEAGE WAS 56,000. *LN",
        "vin": "2FMHK6C88EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375877,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ELECTRIC ASSIST STEERING LOSS WHILE DRIVING ON HIGHWAY. VEHICLE EXTREMELY DIFFICULT TO CONTROL, OCCUPANTS IN DANGER OF LOSS OF LIFE FROM CATASTROPHIC CRASH.  THIS IS A KNOWN ISSUE TO FORD MOTOR COMPANY. THEY HAVE RECALLED OTHER YEARS OF ELECTRIC ASSIST ON FORD FLEX, HOWEVER NOT 2014. WE WERE NOT AWARE OF THIS EXTREMELY DANGEROUS PART BEING INSTALLED ON OUR FLEX. FORD MOTOR COMPANY DID NOT CONTACT US WITH ANY WARNING OR RECALL. THEY SIMPLY STATED THAT SOME PARTS FROM EARLIER RECALLED MODELS COULD HAVE BEEN ASSEMBLED ON OUR VEHICLE. SINCE THEY KNEW THAT THIS COULD HAVE BEEN ASSEMBLED ON SOME 2014 VEHICLES, THEYSHOULD'VE INFORMED US OF THE SAFETY HAZARD. WE ARE NOT ALONE. THE FORD FLEX OWNERS FORUM IS FULL OF SCARY DETAILS OF OTHER FAMILIES LOSING STEERING ON THEIR 2014 FLEX WHILE DRIVING AT HIGHWAY SPEED. NO ONE SHOULD HAVE TO DIE BECAUSE FORD HAS NOT TAKEN RESPONSIBILITY & ALERTED ITS CUSTOMERS.",
        "vin": "2FMGK5D88EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2020",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373540,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DOORS DO NOT LOCK WHILE DRIVING; WARNING THAT DOOR IS NOT CLOSED WILL CONTINUE INDEFINITELY",
        "vin": "2FMGK5C86EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372841,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT RECEIVED A SECOND NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT CALLED AIRPORT MARINA FORD (5880 W. CENTINELA AVE, LOS ANGELES, CA 90045, (888) 368-7755), WHERE IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2FMGK5B86EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372636,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC POWER STEERING KEEPS GOING OUT RANDOMLY.  DANGEROUS!!! I NOTICE THAT THERE IS A RECALL ON THIS ISSUE UP TO 2013 FORD FLEX MODELS.  MINE IS A 2014.  NEEDS TO BE RECALLED BEFORE SOMEONE IS HURT!  HAPPENS MOSTLY AT STARTUP BUT HAS HAPPENED WHEN MOVING AS WELL!",
        "vin": "2FMHK6C82EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372296,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW ENGINE OIL PRESSURE LIGHT FLASHES WITH OIL SMELL AND SQUEAKING PULLEY THAT HOLDS SERPENTINE BELT. BURNING OIL SMELL, DEALER REPLACED OIL SENDING UNIT, WATER PUMP AND REPLACED VALVE COVER GASKETS.",
        "vin": "2FMGK5B89EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366738,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FAMILY ROAD TRIP APPROXIMATELY 450 MILES FROM HOME.  NO POWER STEERING IMMEDIATELY UPON COLD START - WARNING CHIME AND WARNING DISPLAY ON INSTRUMENT CLUSTER STATING LOSS OF POWER STEERING CONTROL AND TO CONTACT DEALER FOR SERVICE.  WIFE SAID THIS SAME WARNING LIGHT ILLUMINATED AFTER COLD STARTING THE VEHICLE APPROXIMATELY 3 DAYS BEFORE, BUT TURNING THE IGNITION OFF AND RESTARTING ELIMINATED THE WARNING LIGHT AND SHE WAS ABLE TO DRIVE THE VEHICLE HOME WITHOUT FURTHER INCIDENT.    WE RECALLED THE SAME THING HAPPENING APPROXIMATELY 2 YEARS AGO WHILE ON A FAMILY ROAD TRIP AFTER WE COLD-STARTED THE VEHICLE AND DROVE APPROXIMATELY 2-3 BLOCKS BEFORE WE LOST POWER STEERING WHILE DRIVING BETWEEN 30-35MPH.  FORTUNATELY, WE WERE IN A RELATIVELY EMPTY DOWNTOWN AREA WITH VERY LITTLE TRAFFIC WHEN I LOST POWER STEERING IN CONJUNCTION WITH WARNING CHIME AND VISUAL WARNING ON INSTRUMENT CLUSTER.  I PULLED TO A STOP, RESTARTED THE VEHICLE AND EVERYTHING WAS BACK TO NORMAL.  ALSO FORTUNATE THAT I WAS DRIVING WHEN LOSING POWER STEERING WHEN THE VEHICLE WAS IN MOTION.  NO RECURRENCE OF THIS ISSUE UNTIL THIS PAST WEEK.    HAD TO HAVE VEHICLE TOWED TO THE NEAREST FORD DEALER WHILE ON OUR FAMILY ROAD TRIP YESTERDAY AND HAD TO MAKE THE 450 MILE DRIVE BACK HOME IN A SMALL RENT CAR.  THEN, WE RECEIVED THE DREADED CALL FROM THE FORD DEALER SAYING THE DIAGNOSTIC FAULT CODE SAYS WE NEED A NEW POWER STEERING RACK FOR $2,800.00  THIS IS CONCERNING SINCE ITS OBVIOUSLY A KNOWN ISSUE THAT RESULTED IN A LIMITED RECALL FOR THE 2011 THRU 2013 MODEL YEARS.  OUR VEHICLE WAS MANUFACTURED IN LATE 2013 BUT IS A 2014 MODEL, LEAVING ME TO WONDER IF THE STEERING RACK ON MY WIFE'S CAR WAS DEFECTIVE ALL ALONG.  PER THE FORD DEALER AND THE FORD WEBSITE, OUR VIN DID NOT QUALIFY FOR THIS 2015 RECALL.",
        "vin": "2FMGK5D89EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365953,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT USED WITH 65,000 MILES, AT 75,000 MILES PASSENGER BACK DOOR SENSOR WENT BAD CAUSING CAR TO SAY \"RIGH BACK DOOR AJAR\" AND THE LIGHTS STAY ON, DOORS DO NOT LOCK WHEN DRIVING, ALARM GOES OFF INTERMITTENTLY.  WHY HAS FORD NOT DONE SOMETHING ABOUT THIS - CLEARLY A PROBLEM.  ALSO THE 2ND ROW SEAT BELTS HAVE BEEN A NIGHTMARE.  KIDS ALWAYS GETTING STUCK - CNA'T UNLATCH THEM.  ONE OF THE RECEPTECLES JUST FELL APART - NOT SAFE!  WHY HASN'T FORD DONE SOMETHING ABOUT THIS.  I OWN 5 FORD VEHICLES AND THE OLDER VEHICLES RUN GREAT - NO ISSUES.  SEEMS LIKE FROM 2012 AND NEWER THERE IS NOTHING BUT PROBLEMS.  WHAT HAPPENED TO THE QUALITY AND CARE FROM FORD?",
        "vin": "2FMGK5C8XEB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WILL RANDOMLY DING AND AN ALERT WILL APPEAR ON THE LEFT GAUGE AREA, BOTH WHILE DRIVING AND IN PARK. THE FIRST ONE USUALLY SAYS, 'ENGINE ON'. IT IS IMMEDIATELY FOLLOWED BY 3 OTHER ALERTS. THE SECOND ONE USUALLY SAYS, 'DRIVER DOOR AJAR', EVEN THOUGH IT IS TIGHTLY CLOSED. THEN ANOTHER ONE APPEARS THAT SAYS, 'MY KEY ACTIVE DRIVE SAFELY'. THEN ANOTHER ONE WILL APPEAR THAT SAYS, 'LIFTGATE AJAR', OR 'VEHICLE APPROACHING FROM LEFT'. THIS HAPPENS WHEN THERE ARE NO CARS NEARBY. IT RANDOMLY HAPPENS WHEN PARKED AS WELL AS WHEN DRIVING. IT CAN BE VERY STARTLING WHEN THE ONE COMES ON THAT SAYS ANOTHER VEHICLE IS APPROACHING SINCE THE DINGING IS MUCH FASTER AND IS INTENDED TO LET YOU KNOW OF A POSSIBLE ACCIDENT. IT DOES IT ALL THE TIME. THIS ISN'T THE FIRST TIME IT HAS HAPPENED BUT WE GOT A RECALL NOTICE EARLIER THIS YEAR AND THOUGHT THAT WAS WHAT THIS WAS. THEN I LOOKED IT UP SINCE WE NEVER RECEIVED ANOTHER MAILER TO LET US KNOW WHEN PARTS WOULD BE AVAILABLE, AND THAT IS WHEN I FOUND OUT THAT THE RECALL IS FOR SOMETHING ELSE.",
        "vin": "2FMGK5C88EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364527,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT WHILE TRAVELING AT HIGH RATES OF THE SPEED, THE VEHICLE WOULD VEER TO THE RIGHT WHILE DEPRESSING THE BRAKE PEDAL. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT TOOK THE VEHICLE TO ROB SIGHT FORD (13901 WASHINGTON ST, KANSAS CITY, MO 64145) AND WAS INFORMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 21,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2FMHK6DT4EB"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359830,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING ARM BROKE OFF OF MY RIGHT FRONT TIRE WHILE I WAS DRIVING IN A PARKING LOT.  THE CAR SNAPPED FORWARD AND THE TIRE WAS LODGED IN THE FRAME.  I COULD NOT MOVE MY CAR.  MY CAR HAS 59,000 MILES.  IF THIS WOULD HAVE HAPPENED AT A HIGH RATE OF SPEED, IT COULD HAVE KILLED ME.",
        "vin": "2FMGK5D89EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355217,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2014 FORD FLEX ON SUNDAY SEPTEMBER 13 ON HWY 684 / SAW MILL PARKWAY.  I HIT A SMALL POTHOLE, WHICH IT TURNS OUT FRACTURED THE TOE LINK, THE ITEM THAT WAS PART OF NHTSA RECALL NUMBER: 20V072 NHTSA DATE: FEB 10, 2020 FORD RECALL NUMBER: 20S04.      ALTHOUGH THE CAR VIOLENTLY SWERVED, I WAS ABLE TO AVOID ANY TYPE OF COLLISION.  AAA TOWED THE CAR BACK TO MY DEALER WHO CONFIRMED THAT THE TOE LINK DID FRACTURE.    UNFORTUNATELY, WHEN THE DEALER CALLED FORD HE WAS ADVISED THAT THEY STILL DO NOT HAVE A FIX FOR THE RECALL.  I WAS THEN ADVISED THAT I HAVE TO PAY ALMOST $900.00 TO REPAIR THE CAR AND I CAN SUBMIT A BILL SOMETIME IN THE FUTURE. I THINK THAT THIS IS TOTALLY UNACCEPTABLE.    I THINK FORD IS WAITING FOR ALL THE CARS TO AGE OUT RATHER THAN FIXING THE CARS.",
        "vin": "2FMHK6DT4EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353519,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR SENSOR DETECTS DOOR AS OPEN WHEN IT IS CLEARLY CLOSED. NO MATTER HOW MUCH YOU SLAM DOOR THE SENSOR DOESN'T ACKNOWLEDGE THE DOOR AS CLOSED. THIS KEEPS THE INSIDE LIGHTS ON AND CAR DOORS WILL NOT LOCK EVEN WHEN IN MOTION. THIS HAPPENS WHEN YOU ENTER CAR. WARNING STAYS ON WHILE YOU ARE DRIVING. YOU HAVE TO SLAM DOOR SEVERAL TIMES REALLY HARD AND HOPE IT ACKNOWLEDGE DOOR AS CLOSED SO YOU CAN LICK CAR AND TURN ON ALARM.",
        "vin": "2FMGK5B89EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353444,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHT STAYS ON SAYING PASSENGER DOOR NOT CLOSED. ALL DOORS ARE CLOSED. DOUBLE CHECK BUT LIGHT VERY SELDOM GOES OUT. MAKES THE LIGHTS STAY ON IN THE CAR LONGER THAN USUAL, CAN'T LOCK THE CAR DOOR, IF CAR IS PARKED AND WARNING LIGHT ABOUT DOOR GOES OFF AND YOU LOCK THE CAR THE ALARM WILL GO OFF ANYTIME DURING DAY OR NIGHT. LIGHT SAYING DOOR NOT CLOSED COMES ON WHILE DRIVING, FIRST CRANK UP, WHEN YOU CUT CAR OFF OR WHEN YOU OPEN DOOR TO GET IN AND OUT OF THE CAR.",
        "vin": "2FMGK5D82EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR INDICATED THAT THE ENGINE COOLANT WAS OVER TEMPERATURE WHILE SITTING IN A PARKING LOT.. I HAD COOLANT ADDED WITH 50% WATER. THE COOLANT LEAKED COMPLETELY OUT WITHIN 24 HOURS AND STARTED ALERTING ME OF THE SAME PROBLEM",
        "vin": "2FMGK5C85EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348809,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH 2020, FORD ISSUED A SAFETY RECALL OF MY VEHICLE FOR TOE LINK FAILURES, AND OFFERED TO FIX THE CAR IN THE THIRD QUARTER.   THIS DID NOT COME SOON ENOUGH FOR ME!    ON MAY 28, I WAS DRIVING NORTH ON WISCONSIN AVE IN BETHESDA, MD NEAR THE INTERSECTION WITH WOODMONT.    ABRUPTLY, MY LEFT REAR TOE LINK FAILED AND I LOST CONTROL OF THE CAR AND SWERVED INTO ANOTHER LANE.   FORTUNATELY I WAS ONLY GOING ABOUT 35 MPH AND THERE WERE NO VEHICLES IN THE OTHER LANE.    I DRIVE A LOT WITH MY FAMILY IN THIS VEHICLE AT FREEWAY SPEEDS AND THIS INCIDENT COULD HAVE KILLED ALL OF US!!    I HAVE WRITEN TO FORD AND ASKED THEM TO PAY FOR THE REPLACEMENT OF BOTH REAR LINKS, WHICH COST ME $587.14.    THEIR RECALL NOTICE STATES FORD IS NOT SUGGESTING THAT PEOPLE STOP DRIVING THE CAR, BUT AGAIN, I OR MY FAMILY WERE IN GREAT DANGER WITH THIS DEFECT.",
        "vin": "2FMHK6C84EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344031,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING IS GETTING HARD TO TURN  ESPECIALLY AT LOW SPEED. FEELS AS IF THE POWER STEERING IS INTERMITTENT. THERE ARE NO WARNING LIGHTS OR ANY OTHER NOTIFICATIONS OF A PROBLEM, BUT IT DOES EXIST. IT APPEARS TO BE LOSS POWER STEERING ASSIST AND BECAME DIFFICULT TO STEER IN EITHER DIRECTION.  I HAVE BEEN INFORMED THAT A RECALL ON OTHER FORD FLEX MODELS WITH  POWER STEERING ASSIST BUT NOT 2014 YEAR...THIS YEAR WAS THE BEGINNING OF IT CREATION YOU WOULD THINK YOU WOULD STARTED WITH RECALLS FROM THE BEGIN OF DEVELOPMENT NOT WORKING BACKWARDS... I HOPE IF I GET THE REPAIR I WILL E REFUNDED IF THE ISSUE TURNS IN A MANDATED RECALL...   THE STEERING IS TIGHT TO TURN AT SLOW AND FAST SPEEDS.",
        "vin": "2FMGK5B84EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343746,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CALLED NORM REEVES FORD SUPERSTORE (18900 STUDEBAKER RD, CERRITOS, CA 90703, (562)353-4633) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2FMGK5B82EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342051,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA HAS ISSUED RECALL 20V072 COVERING MY VEHICLE.  AS A RESULT OF THE DEFECTIVE TOE LINK THE LEFT REAR TIRE  ON MY CARE IS WEARING UNEVENLY AND CUPPING.  MY INDEPENDENT MECHANIC SAYS THEY COULD REPLACE THE TOE LINK AND DO THE REQUIRED ALIGNMENT IN ONE DAY AT A COST OF ~$300.  FORD HAS HAD THIS RECALL NOTICE SINCE FEBRUARY AND IT STILL SAYS \"REMEDY NOT AVAILABLE\". HOW HAS NOTHING HAPPENED IN 6 MONTHS WHEN WALT'S AUTOMOTIVE CAN FIX THE PROBLEM TODAY?  PLEASE COMPEL FORD TO FIX MY CAR OR AGREE TO PAY TO HAVE THE CAR FIXED INDEPENDENTLY.",
        "vin": "2FMGK5D83EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341937,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. SOUND FORD LOCATED AT 101 SW. GRADY WAY, RENTON, WA 98057, WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2FMHK6C80EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341019,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING IS GOING UP. MECHANIC SAID IT'S ELECTRIC AND ITS A RECALL ISSUE BUT DEALSHIP SAYS NOTHING",
        "vin": "2FMHK6DT0EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338546,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE LOSS POWER STEERING ASSIST AND BECAME DIFFICULT TO STEER IN EITHER DIRECTION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE STEERING COLUMN WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "2FMGK5C84EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338555,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE REAR TOE LINK FRACTURED. THE VEHICLE WAS TAKEN TO PRIME FORD - SACO (857 PORTLAND RD, SACO, ME 04072), AND IT WAS DIAGNOSED AND CONFIRMED THAT THE REAR TOE LINK WAS FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART NEEDED FOR THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT PAID OUT OF POCKET TO HAVE THE VEHICLE REPAIRED DUE TO PARTS NOT BEING AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE APPROXIMATE FAILURE MILEAGE WAS 100,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2FMGK5C80EB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11337794,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A COLLISION IN MY FORD FLEX ON JUNE 29, 2020. AT THE TIME, A CAR TURNED IN FRONT OF ME ON THE HIGHWAY CAUSING ME TO TBONE THE OTHER VEHICLE AT APPROXIMATELY 45MPH. NONE OF THE AIR BAGS IN MY FORD FLEX DEPLOYED.",
        "vin": "2FMGK5D84EB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329205,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE DOOR SENSOR APPEARS TO NOT BE FUNCTIONING. WARNING PANEL LIGHT COMES ON INDICATING DOOR IS NOT CLOSED, WHEN IT IN FACT IS.  INTERIOR LIGHTS SIMULTANEOUSLY COME ON BUT NOT ALL THE TIME.  ADDITIONALLY WARNING SAYS, TRANSMISSION IS NOT IN \"PARK.\" USUALLY OCCURS WHEN CAR IS BEING STARTED, BUT NOT ALWAYS. HAS OCCURRED 6 TIMES.  *TR",
        "vin": "2FMHK6D81EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/11/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328350,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SAYS PASSENGER DOOR IS OPEN WHILE DRIVING AND INTERIOR LIGHTS WON'T GO OFF FOR A COUPLE OF MILES   THEN CAR ALARM GOES OFF HOURS LATER.  *TR",
        "vin": "2FMGK5C8XEB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327692,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE TURBO FAILURE WHILE DRIVING ON HIGHWAY DURING A LONGER ROAD TRIP (~600 MILES, MAJORITY AT HIGHWAY SPEEDS). THIS IS THE V6 ECOBOOST ENGINE. I WAS INFORMED BY DEALERSHIP REPAIR SHOP THAT IT 'FELL APART' AND PARTS OF IT WERE SUCKED BACK INTO THE ENGINE.  SIGNIFICANT KNOCKING AND POP SOUND FROM ENGINE WHILE DRIVING; SIGNIFICANT LOSS OF POWER WHEN ACCELERATING.  *TR",
        "vin": "2FMHK6DT6EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/15/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2014 FORD FLEX SEL WITH 57000 MILES ON IT. FOR THE LAST COUPLE OF WEEKS I HAVEN'T BEEN DRIVING MUCH DUE TO THE STAY AT HOME ORDER(COVID-19), FROM BEING USED DAILY TO COMMUTE TO WORK TO ONLY ONE OR TWICE A WEEK FOR ESENCIALES. ONE MORNING I WAS HEADING TO MY PARENTS HOUSE AND AS I WAS DOING A RIGHT TURN INTO AN INTERSECTION ONE BLOCK AWAY FROM MY HOUSE. ALL OF A SUDDEN THE POWER STEERING GOES OUT IN THE APEX OF THE TURN MAKING IT HARD TO STRAIGHTEN OUT THE CAR ALMOST HITTING A PARKED CAR. I JUST FINISHED PAYING OFF THE CAR AND THEN THIS HAPPENED.  *TR",
        "vin": "2FMGK5C82EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321217,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS LEAKING FUEL FROM UNDERNEATH.  *TR",
        "vin": "2FMHK6C81EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319952,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER GETTING OIL CHANGED AROUND 82K MILES THERE IS DIFFICULTY STEERING ESPECIALLY AT LOW SPEED. FEELS AS IF THE POWER STEERING IS INTERMITTENT. THERE ARE NO WARNING LIGHTS OR ANY OTHER NOTIFICATIONS OF A PROBLEM, BUT IT DOES EXIST. IT MAKES ME HATE TO DRIVE THIS CAR.",
        "vin": "2FMGK5B84EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319774,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DOOR STARTED TO SAY THAT THE REAR PASSENGER DOOR WAS OPEN. AND 1 WEEK LATER I GOT A RECALL NOTICE FOR THE DRIVER SIDE DOOR SENSOR SAYING IT IS OPEN OR AJAR. I ASKED FORD IF THIS INCLUDED THE BACK DOOR. THEY REQUIRED THAT I TAKE IN MY CAR. I TOOK IT IN AND THEY NEVER INFORMED ME IF IT INCLUDED THE BACK DOOR THEY JUST WENT AHEAD AND FIXED THE FRONT DOOR WHICH WAS ALWAYS WORKING.",
        "vin": "2FMGK5D81EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE GETS TO THE HALF TANK MARK, IT GOES TO EMPTY AND SHUTS OFF SHORTLY AFTER. WHEN REFUELING, IT ONLY FILLS MAYBE 5-10 GALLONS MAX BEFORE OVERFLOWING. IT HAS ALMOST STRANDED US MULTIPLE TIMES.",
        "vin": "2FMGK5B87EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315874,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND THE CAR STOPPED ALL OF A SUDDEN IN THE MIDDLE OF RESIDENTIAL STREET AT 6 AM AND WHEN I TRIED TO RE-START IT, IT WOULD CRANK BUT WOULD NOT TURN OVER AND START BACK UP SO I COULD MOVE IT. I HAD TO PUSH IT OUT OF THE MIDDLE OF THE STREET. I HAD TO HAVE IT TOWED TO THE SHOP AND THEY SAID IT WAS THE FUEL PUMP CONTROL MODULE.",
        "vin": "2FMGK5B80EB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309276,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY 2019 A SIDE VENT WINDOW OM THE PASSENGER SIDE SHATTERED WHILE THE CAR WAS IN THE GARAGE.  ON 2/14/2020, THE REAR CARGO AREA WINDOW ON THE PASSENGER SIDE ALSO SHATTERED SPONTANEOUSLY WHILE SITTING IN THE DRIVEWAY.  THE WINDOW THAT SHATTERED ON 2/14/2020 WAS BOWED OUT AFTER IT SHATTERED SO THE BREAKAGE COULD NOT HAVE COME FROM OUTSIDE THE CAR.",
        "vin": "2FMGK5B82EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309271,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. HANSEL FORD 3075 CORBY AVE, SANTA ROSA, CA 95407, (707) 623-1426 WAS CONTACTED AND IT WAS CONFIRMED THAT THE REMEDY PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT CONTACTED OR MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2FMGK5C82EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299946,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTS WILL NOT GO OFF INSIDE CAR SAYS THERE IS A DOOR OPEN   MAKES IT VERY UNSAFE FOR ME TO DRIVE   RUNS DOWN CAR BATTERY  ALARM GOES OFF EVERY NIGHT DUE TO THIS ELECTRICAL FLAW",
        "vin": "2FMGK5C8XEB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 FORD FLEX. WHILE DRIVING APPROXIMATELY 20-25 MPH, THE FRONT PASSENGER SIDE AXLE FRACTURED WITHOUT WARNING. THE VEHICLE WAS TOWED TO A TOW FACILITY AND DEEMED DESTROYED. THE VEHICLE WAS NOT DIAGNOSED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 77,000.",
        "vin": "2FMGK5B87EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEAKERS LET OUT EXTREMELY LOUD CRACKLE NOISE, EAR PIERCING STATIC NOISE AND ALL OF A SUDDEN THE RADIO NO LONGER WORKS. THE RADIO DOES TURN ON BUT YOU CAN NOT CHANGE THE CHANNEL NOR ANY SOUND. ABSOLUTELY NO SOUND NO MATTER WHAT THE VOLUME IS AT. IF MY PHONE IS PAIRED TO THE RADIO IT'S COMPLETE SILENCE AND BOTH PARTIES HEAR NOTHING BUT SILENCE.  THIS HAPPENS NOT MATTER IF YOU ARE DRIVING OR PARKED. YOU GET THE SAME RESULTS IN ALL POSITIONS OF THE VEHICLE.",
        "vin": "2FMHK6C83EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/24/2019",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291052,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR AND THE CHECK ENGINE LIGHT CAME ON. I HAVE HAD NO ISSUES AND THE CAR HAD NOT BEEN DOING ANYTHING DIFFERENT. I HAD IT CHECKED AND I GOT THE CODE P025B. I WAS LEAVING THE NEXT MORNING TO GO TO WORK AND THE CAR WOULD CRANK BUT THEN IT CUT OFF AS SOON AS I GOT OUT OF THE DRIVEWAY IN THE MIDDLE OF THE ROAD. I ONLY HAVE 90K MILES ON MY CAR WHICH IS EARLY FOR THE FUEL PUMP. I ALSO READ THAT SOME OF THE SAME MODEL CARS AS MINE HAVE A FUEL PUMP RECALL. I REALLY NEED THIS TO BE CHECKED BECAUSE IT JUST STOPPED OUT OF NO WHERE. I WAS TOLD BY THE FORD DEALERSHIP THAT I WOULD HAVE TO PAY TO HAVE THIS CHECKED TO SEE IF IT WAS A MALFUNCTION.",
        "vin": "2FMGK5D80EB"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282433,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 FORD FLEX. WHILE DRIVING 70 MPH, THE CONTACT HEARD AN ABNORMAL POPPING NOISE AND THE REAR OF THE VEHICLE DROPPED WITHOUT WARNING. AS A RESULT, THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO ANOTHER VEHICLE. ALL THE AIR BAGS DEPLOYED. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE POLICE TOWED THE VEHICLE TO A LOT. AN INSURANCE ADJUSTER CAME TO THE SENE AND DECLARED THE VEHICLE TOTALED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 14V393000 (POWER TRAIN). THE FAILURE MILEAGE WAS APPROXIMATELY 122,393.",
        "vin": "2FMHK6C89EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281980,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, I HEARD A STRANGE NOISE COMING FROM THE STEERING COLUMN. ONCE I REACHED MY DESTINATION AND RETURNED TO MY CAR AND STARTED IT, THE POWER STEERING ASSIST WARNING LIGHT CAME ON. I BEGAN TO PULL OFF, THE VEHICLE WOULD NOT STEER, AND I HAD TO HAVE MY CAR TOWED HOME.     THE NEXT DAY I CALLED FORD TO EXPLAINED WHAT HAPPENED AND WAS TOLD IT WOULD COST AROUND $2,000 TO FIX. I GOOGLED IT AND FOUND OUT THE STEERING ASSIST HAD BEEN RECALLED FOR THAT YEAR MAKE AND MODEL.     I THEN CALLED THE NUMBER ASSOCIATED WITH THE RECALL AND KEYED IN THE CODE RELATED TO THE MAKE AND MODEL. A FEW MOMENTS LATER, A REP CAME ON THE LINE AND ASKED FOR MY VIN. HE INFORMED ME THAT THERE WAS A RECALL IN 2015 OR 16 CAN'T REMEMBER THE EXACT YEAR, BUT UNFORTUNATELY, THE RECALL WAS VIN SPECIFIC, AND MY VEHICLE WAS NOT ON THAT LIST.    I FOUND THIS NEWS TO BE VERY DISTURBING, DANGEROUS, AND IRRESPONSIBLE FOR FORD NOT TO REPLACE OR REPAIR THIS FAULTY PART IN ALL OF THE 2014 MODELS, NOT JUST THOSE WITH A SPECIFIC VIN.     WHAT IS IT GOING TO TAKE FOR THEM TO CORRECT THIS; PRAYERFULLY NOT SOMEONE'S LIFE?",
        "vin": "2FMGK5D87EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280998,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING, THE VEHICLE HESITATED, JERKED, AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS DESIGNED IN THAT MANNER. THE VEHICLE WAS NOT TAKEN TO A FORD DEALER AND WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS APPROXIMATELY 80,000.",
        "vin": "2FMGK5C83EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/14/2019",
        "dateOfIncident": "07/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280033,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FEELS LIKE IT'S GOING TO STALL. THE FUEL PUMP WAS ALREADY REPLACED BUT THE CAR STILL PUTTS AND ALMOST STALLS WHEN DRIVING OR WHILE AT A STOP.",
        "vin": "2FMHK6D88EB"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "08/21/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278874,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BREAKS AND ROTORS HAVE BEEN WORKED ON 3 TIMES WITHIN 1 YEAR BY CARMAX. IN ADDITION, BEARINGS HAVE BEEN REPLACED. ADDITIONALLY, THE VEHICLES COMPUTER MODULE FAILED. ALSO, THE FUEL PUMP.",
        "vin": "2FMHK6D88EB"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278008,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE THE VEHICLE WAS PARKED, THE ENGINE WOULD CRANK, BUT THE VEHICLE WOULD NOT START WITHOUT WARNING. THE VEHICLE WAS TOWED TO PITTSVILLE FORD (7155 FRIENDSHIP RD, PITTSVILLE, MD 21850, (877) 760-5870), BUT THE FAILURE COULD NOT BE DUPLICATED. MONTHS LATER, THE FAILURE RECURRED. THE VEHICLE WAS TOWED BACK TO THE SAME DEALER WHERE THE VEHICLE STARTED UP AGAIN WITHOUT INCIDENT. WHEN THE FAILURE OCCURRED A THIRD TIME, THE CONTACT DISCONNECTED THE BATTERY CABLE, WAITED A FEW MOMENTS, AND THE VEHICLE STARTED WITHOUT INCIDENT. WHEN THE FAILURE OCCURRED THE FOURTH TIME, THE SAME BATTERY OPERATION WAS NOT SUCCESSFUL AND THE CONTACT HAD TO HAVE THE VEHICLE TOWED BACK TO THE SAME DEALER. THE CONTACT ASSOCIATED THE FAILURES WITH NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED OF THE FAILURES AND VERIFIED THAT THE VIN WAS NOT INCLUDED IN THE RECALL AND THE VEHICLE WAS NOT UNDER WARRANTY. NO FURTHER ASSISTANCE WAS OFFERED. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "2FMGK5C81EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271270,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUTTING ON A STEERING WHEEL COVER. I NOTICED WHEN I HELD THE STEERING WHEEL FROM 12 AND 6 THE WHEEL FELT LOSE. NOT FROM THE ADJUSTING PART BUT THE WHOLE STEERING WHEEL IT SELF WAS SOME WHAT LOSE NOT TO FALL OFF BUT JUST LOSE.",
        "vin": "2FMHK6D82EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270189,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILURE",
        "vin": "2FMHK6D88EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267764,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALL AND WOULD NOT START. REPLACED FUEL PUMP AND WORKING AGAIN BUT MY BIN WAS NOT LISTED UNDER THE RECALL FROM WHAT I CAN SEE    RODORS WARPED 3 TURNS. REPLACED BREAKS TWICE WITHIN 10,000 MILES.",
        "vin": "2FMHK6D88EB"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256728,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2014 FORD FLEX WITH 41,000 MILES. MY WIFE WAS DRIVING TWO DAYS AFTER GETTING HER OIL CHANGED AT GALPIN FORD AND THE POWER STEERING WENT OUT. SHE CALLED THEM AND THEY SAID TURN OFF THE CAR AND WAIT A MINUTE AND IT WILL RESET IT SELF. SHE DID THAT AND IT WORKED. TWO DAYS LATER IT WENT OUT COMPLETELY SO SHE TRIED TO TURN IT OFF AND ON AGAIN THAT'S WHEN THE STABILITY LIGHT WENT ON AND SAID IT NEEDS SERVICE. THE PERSON AT FORD TELLING HER HOW TO RESET IT TELLS ME THEY HAVE HAD SEVERAL COMPLAINTS ABOUT THIS. THEY WANT ME TO SPEND OVER TWO THOUSAND DOLLARS TO REPLACE THE STEERING COLUMN!!!!!!! THEY WON'T EVEN COME GET THE CAR TO DIAGNOSE IT. THEY WANT ME TO HAVE IT TOWED OR DRIVE IT TO THEM.",
        "vin": "2FMGK5C83EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255366,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING VARIOUS SPEEDS AND MAKING TURNS, THERE WAS AN ABNORMAL SQUEAKING NOISE EMERGING FROM THE STEERING WHEEL. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO BLUEBERRY FORD (241 DUBLIN ST, MACHIAS, ME 04654, (207) 255-4747) WHO STATED THAT THE VEHICLE WAS WORKING AS DESIGNED. THE VEHICLE WAS TAKEN TO  DARLING'S FORD VOLKSWAGEN AUDI (403 HOGAN RD, BANGOR, ME 04401, (207) 941-1330) WHO STATED THAT THE FAILURE WAS DUE TO NORMAL WEAR AND TEAR. THE DEALER DIAGNOSED THAT THE SWAY BAR, CONTROL BAR BUSHING, AND STEERING RACK NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: CAS24223378. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 25,000.",
        "vin": "2FMHK6C84EB"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "01/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245495,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 FORD FLEX HAS A FEW RECALLS; MY CAR DIDN'T GET THE NOTIFICATION BUT ARE EXPERIENCING RECALL PROBLEMS. MY CAR WON'T START DUE TO FUEL MODULE (FUEL PUMP) THAT HAS BEEN RECALLED. ONE THING WE ALSO COMPLAINED ABOUT IS GAS MILEAGE THE CAR LOST 20%-30% SINCE 2017. FORD MOTOR MANDATED US TO TAKE THE CAR TO THE FORD DEALER ONLY. FORD STATED THEY WOULD PAY ALL COSTS 9/19/19; I ALSO HAD TO PAY TO HAVE THE CAR TOWED TO THE LOCATION. NOW FORD MOTOR COMPANY STATED THEY WILL ONLY PAY A SMALL PORTION OF THE AMOUNT. THE DEALER HAS CONTACTED ME AND STATED THAT FORD MOTOR COMPANY WILL NOT PAY ANYTHING. THE PART HAS BEEN RECALLED ON OVER 75,000 2014 FORD FLEX. THE CAR IS CURRENTLY AT THE DEALER AND THEY ARE PUTTING PRESSURE ON ME TO PAY FOR THE REPAIRS. A REPAIR HAS NOT BEEN MADE. GREG JOHNSON AT FRITTZ FORD RIVERSIDE IS THE CONTACT PERSON THERE &#8237;+1 (951) 687-2121&#8236;; FORD MOTOR COMPANY &#8237;+1 (800) 392-3673&#8236;. WE ALSO HAD PROBLEMS WITH DEFECTIVE BREAKS THAT ALSO HAVE RECALLS BUT SUPPOSEDLY OUR CAR WAS NOT AFFECTED BUT EXPERIENCED THE SAME ISSUES AS THE PEOPLE WHO RECEIVED RECALLS NOTICES FOR THEIR VEHICLE.",
        "vin": "2FMGK5B82EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243316,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT IDLE THE FLEX BEGINS TO ACT AS IF IT IS GOING TO STALL THEN IT DOES. WHEN I RESTART IT CERTAIN ELECTRIC FUNCTIONS DISABLE. MY CAR IS AT 54K MILES NOW BUT WE HAVE BEEN HAVING THIS PROBLEM SINCE IT WAS AT 32K. I FIND IT EXTREMELY COINCIDENTAL THAT THE SAME YEARS ECO BOOST ENGINE IS HAVING A PROBLEM AND WAS ISSUED A RECALL BUT NOT MY NON ECO BOOST V-6 DOES NOT HAVE A RECALL.",
        "vin": "2FMGK5D87EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242364,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FAILED TO START, CRANKED CONTINUOUSLY BUT NO FUEL. OUR FLEX HAS A NORMAL ASPIRATED ENGINE. VEHICLES WITH THE ECOBOOST OR TURBO ENGINE HAVE A RECALL ON THE FUEL PUMP ELECTRIC MODULE. I REPLACED THE PART MYSELF AND THE FLEX STARTED IMMEDIATELY. FORTUNATELY, THE VEHICLE FAILED IN THE DRIVEWAY AND NOT DRIVING DOWN THE ROAD FULL OF CHILDREN. THIS COMPONENT SHOULD BE RECALLED ON EITHER ENGINE OPTION ON THE FLEX. THERE ARE NUMEROUS STORIES OF THIS COMPONENT FAILING ON EITHER ENGINE MODEL. IT IS A $50 FIX AND I WOULD URGE ALL FLEX OWNERS TO REPLACE THIS COMPONENT YOURSELVES IF FORD WILL NOT REPLACE IT FOR YOU. FOR LESS THAN A TANK OF FUEL, YOU CAN REPLACE THIS COMPONENT YOURSELF AND AVOID THE POSSIBILITY OF BEING STRANDED WITH A VEHICLE THAT STALLS OUT AND WILL NOT RESTART OR SIMPLY FAILS TO START. HAD I BEEN AWARE OF THIS, I WOULD HAVE DONE THIS ASAP. YOU HAVE NO CONTROL OVER WHERE THIS FAILURE WILL OCCUR, I.E. ON THE HIGHWAY LATE AT NIGHT. THIS COMPONENT NEEDS TO BE RECALLED REGARDLESS OF THE ENGINE. THE REPLACEMENT PART IS THE SAME FOR BOTH ENGINES.",
        "vin": "2FMHK6D87EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241055,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CENTER CONSOLE (ALSO KNOWN BY FORD AS THE GLOVE BOX) LATCH ATTACHMENT, HAS SEPARATED PER FORD TECH AND WILL NO LONGER SECURE LATCH ASSEMBLY TO ARMREST ASSEMBLY. THIS FAILURE RESULTS IN THE CENTER CONSOLE LATCH NOT SECURING THE ARMREST. AS THE ARMREST IS NOT SECURED, IT ENTERS THE AREA AROUND THE DRIVER AND IMPEDES DRIVING, IMPACTING SAFETY WHILE VEHICLE IS IN MOTION. THIS IS A KNOWN FAILURE THAT HAS REPORTEDLY OCCURRED ON MULTIPLE VEHICLES UP TO ABOUT MODEL YEAR 2014 (FORD FLEX), REF NHTSA REPORT 11152858 FOR EXAMPLE. VEHICLE IS UNDER WARRANTY BY FORD AND REPAIR IS UNDER REVIEW CURRENTLY BY FORD, AS IT WAS INITIALLY DECLINED TO BE COVERED FOR UNEXPLAINED REASONS. PER DEALERSHIP, ENTIRE ARMREST ASSEMBLY REQUIRES REPLACEMENT AS THE ATTACHING POINTS ARE NON-REPAIRABLE. FAILURE MILEAGE WAS APPROXIMATELY  44,000 MILES. FAILURE WAS NOT CAUSED BY OWNER'S ACTIONS THAT WOULD BE CONSIDERED AS NEGLIGENT.",
        "vin": "2FMHK6DT5EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "07/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229798,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE OWNED OUR VEHICLE FOR ALMOST 5 YEARS.  SPORADICALLY OVER THE COURSE OF THOSE 5 YEARS THE CHECK CHARGING SYSTEM INDICATOR HAS COME ON WHEN WE TURN ON THE CAR AND THE POWER STEERING GOES OUT.  WE HAVE HAD IT CHECKED MULTIPLE TIMES AND THEY CAN'T FIND ANYTHING WRONG.  IT IS HAPPENING MORE FREQUENTLY AND BOTH THE TRANSMISSION AND ALTERNATOR HAVE BEEN CHECKED AND ARE FINE. I'M INVESTIGATING ONLINE IT SEEMS LIKE A LOT OF OTHER PEOPLE HAVE HAD THE EXACT SAME PROBLEM.  I FEEL LIKE THERE IS A DEFECT SOMEWHERE AND IT NEEDS TO BE INVESTIGATED.  IT IS SCARY AND VERY DANGEROUS WHEN IT GOES OUT.",
        "vin": "2FMGK5C89EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229051,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOSES ACCELERATION WHILE DRIVING AND THEN STOPS RUNNING.JUST DRIVING ALONG AND ALL OF A SUDDEN THE GAS PEDAL WILL NOT WORK AND THE CAR DIES...SAYS THERE IS A FORD FLEX RECALL ON THIS MODEL FOR FAULTY FUEL PUMPS BUT DOESN'T SHOW YET WHEN VIN IS ENTERED ..THIS IS HAPPENED TO US TWICE NOW LEAVING US STRANDED AND THEN HAVE TO BE TOWED..DRIVING ON A COUNTRY RD. BOTH TIMES AND UNABLE TO PULL TO SAFETY",
        "vin": "2FMGK5B87EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220189,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC STEERING MECHANISM STARTED MAKING CREAKING SOUND WHEN STEERING WHEEL IS TURNED LEFT OR RIGHT. DEALER RECOMMENDED REPLACING THE RACK AND PINION SYSTEM FOR $2,700. MY CAR ONLY HAS 59,000 MILES. THIS MAJOR OPERATING SYSTEM SHOULD NOT BE FAILING.",
        "vin": "2FMGK5C83EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218518,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS STALLED TWICE WHILE IN MOTION. ON CITY STREET",
        "vin": "2FMGK5B88EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "08/16/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218287,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WITHOUT WARNING. THE VEHICLE WAS TAKEN TO FAIRVIEW FORD (909-884-9261, LOCATED AT 292 N G ST, SAN BERNARDINO, CA 92410) WHERE IT WAS DIAGNOSED THAT THE CHIPS WERE FRIED AND MELTED THE FUEL PUMP. THE FUEL PUMP WAS REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED A 50 PERCENT DISCOUNT OFF THE REPAIR COST. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 64,000.",
        "vin": "2FMGK5C85EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207426,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED THE STEERING TIGHTEN UP WHILE DRIVING. WENT AWAY, CAME BACK, WENT AWAY, CAME BACK. WIFE COULDN'T TURN THE WHEEL SAFELY. ELECTRIC POWER STEERING FAILURE.",
        "vin": "2FMGK5C80EB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206208,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD MULTIPLE PROBLEMS WITH THE REAR PASSENGER SEATBELTS RETRACTING TO THE POINT NOW WHERE KLABEN FORD SAYS THE ENTIRE SEATBELT NEEDS TO BE REPLACED. IT IS A REAR PASSENGER AIRBAG SEATBELT.",
        "vin": "2FMHK6C86EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205126,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IS VERY DIFFICULT, LIKE THE POWER STEERING IS FAILING. THE MECHANIC SAID THERE WAS NOTHING WRONG WITH IT (NO FAILURE CODES). BUT IT IS STILL VERY DIFFICULT TO TURN, MAKING IT FEEL VERY UNSAFE.",
        "vin": "2FMHK6D82EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204658,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AJAR SENSOR IS FAULTY, CONSTANTLY REMAINING ON. THIS KEEPS ALL LIGHTING ON WHEN REVERSING POSING A GREAT RISK WHEN BACKING THE VEHICLE UP ESPECIALLY IN EVENING HOURS. WE HAVE BEEN TOLD THIS IS A COMMON PROBLEM WITH NEWER  FORD VEHICLES AND OUR SURPRISED THIS HAS NOT BEEN RECALLED YET. IT IS VERY DIFFICULT TO SAFELY DRIVE WITH THE INTERIOR LIGHTS STAYING ON.",
        "vin": "2FMHK6DT0EB"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SENSOR ON MY PASSENGER DOOR HAS GONE OUT, CAUSING THE CAR TO BELIEVE THE DOOR IS OPEN EVEN WHEN IT IS NOT.   THERE IS ALSO A CONSISTENT ISSUE WITH ONE SEATBELT, SOMETIMES IT WILL LOCK INTO PLACE WHEN NOT IN USE, AND SOMETIMES IT WILL NOT ALLOW ME TO BUCKLE IT.",
        "vin": "2FMK6DT8EBD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195852,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I STOPPED THE VEHICLE AFTER DRIVING ABOUT 1 MILE TO GO INTO A STORE. AFTER 4 MINUTES PARKED, IT WOULD CRANK OVER, BUT NOT START. IT HAD TO BE TOWED TO SOUTHGATE FORD. THEY DIAGNOSED IT AS A BAD FUEL PUMP CONTROL MODULE. THIS IS THE VERY SAME PART THAT'S RECALLED ON  CERTAIN FORD FLEX MODELS OF THIS SAME YEAR (2014). THE SERVICE DEPARTMENT SAID MY VIN NUMBER DIDN'T FALL UNDER THE RECALL, EVEN THOUGH THE IDENTICAL PART IS RECALLED ON 2014 ECOBOOST AND POLICE DUTY . VEHICLES. THE DEALER CHARGED $386.65 TO REPAIR. IF THIS FAILED WHILE DRIVING I WOULD HAVE SUDDENLY LOST POWER ASSIST AND SPEED.",
        "vin": "2FMGK5C81EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/27/2019",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192062,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING INTERMITTENTLY BECOMES VERY DIFFICULT WITH GREAT EFFORT REQUIRED TO TURN STEERING WHEEL. STEERING WHEEL ALSO WILL FAIL TO ACCURATELY CONTROL STEERING. WHEEL WILL JERK IN HANDS. PROBLEM OCCURS WHEN STATIONARY AND WHEN DRIVING AT LOW TO MEDIUM SPEEDS.",
        "vin": "2FMHK6DT2EB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186854,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY DIFFICULT TO STEER..LIKE THE POWER STEERING IS GONE. WHILE DRIVING, TURNING LEFT OR RIGHT DID NOT MATTER. AT THIS POINT PROBLEM UNKNOWN.",
        "vin": "2FMHK6C84EB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186343,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SIDE BELT BUCKLE GETS STUCK. WHEN THE PASSENGER TRIES TO UNBUCKLES THE SEAT BELT, IT DOES NOT UNBUCKLES AND PASSENGER GETS STUCK IN CAR SEAT. SOMETIME IT TAKES MORE THEN HALF AN HOUR AND MULTIPLE TIMES TRIES TO GET IT UNLOCK. FRUSTRATING. IT'S THE MANUFACTURER FAULTY BUCKLE. I CHECK AND I EVEN TOOK IT TO DEALER TO GET IT CHECK. THEY DON'T SEEM TO FIND THE ROOT CAUSE AND SAID OT WOULD COST ME AROUND $400 TO REPLACE. NOT HAPPY",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183884,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE STOPPED AND GOT GAS, DROVE APPROXIMATELY 45MILES, PARKED IN THE GARAGE AND WOULDN'T START THE NEXT MORNING.....   I ATTEMPTED SEVERAL TIMES TO GET IT STARTED, AND DETERMINED IT WAS A FUEL ISSUE.  SEARCHED THE WEB AND FOUND SEVERAL COMPLAINTS REGARDING 2013-2015 FLEXS' WITH SAME COMPLAINT. DIAGNOSIS WAS FUEL PUMP RELAY, BUT NOT MINE????",
        "vin": "2FMHK6C81EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181555,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START IN COLD WEATHER. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO HUNTINGTON FORD (2890 S ROCHESTER RD, ROCHESTER HILLS, MI 48307, (248) 852-0400) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN ANY RECALLS. THE FAILURE MILEAGE WAS APPROXIMATELY 65,818.",
        "vin": "2FMHK6C8XEB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180943,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS AT HOME ABOUT TO HEAD TO WORK, GOES OUTSIDE TO START MY VEHICLE AND IT WOULDN'T START IT WOULD CONTINUE TO TURN OVER AND SPUTTER BUT WOULD NEVER CRANK UP.",
        "vin": "2FMGK5B8XEB"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173885,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FUEL PUMP AND IS NOT COMMUNICATING WITH ELECTRIC PERM MODULE AND MY CAR IS NOT STARTING IT CUT OFF ON THE HIGHWAY GOING 70 MPH IT CAME BACK ON AND NOW IT WON'T COME ON AT ALL",
        "vin": "2FMGK5C87EB"
    },
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173944,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE COULD NOT BE STARTED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE POWER STEERING CONTROL MODULE AND THE FUEL PUMP RELAY MODULE FAILED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE VEHICLE WOULD BE PLACED ON THE RECALL LIST. THE FAILURE MILEAGE WAS APPROXIMATELY 81,000.",
        "vin": "2FMGK5D86EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171436,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP CONTROL MODULE FAILED, WHICH CAUSED THE ENGINE TO STALL AND NOT START. FORD HAS A RECALL HTTPS://WWW.EDMUNDS.COM/CAR-NEWS/2013-15-FORD-TAURUS-FLEX-RECALLED-FOR-STALLING-RISK.HTML THEY HAVE TOLD ME MY VEHICLE ISN'T WITHIN SCOPE. WHY?",
        "vin": "2FMGK5C84EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165841,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FLEX WOULDN'T START EVEN AFTER A JUMPSTART; RENDERED A \"STARTING SYSTEM FAULT . SERVICE DEPARTMENT FOUND A DEAD CELL IN THE BATTERY AND THE KEYS/FOBS WERE UNRECOGNIZED. SO A NEW BATTERY AND 2 NEW KEYS AND FOBS ARE BEING REPROGRAMMED FOR $881.00. THE STARTING SYSTEM FAULT SEEMS TO BE COMMON AS OF LATE.",
        "vin": "2FMGK5B80EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "12/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  2014 FORD FLEX WILL NOT START. I CAME HOME FROM WORK, SHUT OF CAR. WENT OUT A SHORT TIME AFTER WARDS TO GO OUT TO DINNER. WOULD NOT START.ENGINE TURNS OVER, ENGINE ALMOST STARTS BUT DOESN'T. FAULT CODES FROM COMPUTER INDICATE FUEL PUMP CONTROL MODULE. FORD HAS A RECALL FOR 2013- 2015 FLEXES FOR A POTENTIAL FUEL PUMP CONTROL MODULE FAILURES CAUSING STALLING WHILE DRIVING, AND ENGINE WILL NOT RESTART. WHY IS MY MODEL NOT INCLUDED IN THE RECALL?",
        "vin": "2FMGK5C88EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE STEERING WHEEL COLUMN SEIZED INDEPENDENTLY ON SEVERAL OCCASIONS. THE CONTACT HAD TO TURN THE ENGINE OFF AND ON TO UNLOCK THE STEERING COLUMN. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO RUSSELL BARNETT FORD (4055 TULLAHOMA HIGHWAY, WINCHESTER, TN 37398, (931) 967 2277) TO BE DIAGNOSED, BUT THE RESULTS WERE UNKNOWN. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 106,000. *DT  CONSUMER STATED VEHICLE WAS FIXED FOR $2,000.00. *JB",
        "vin": "2FMHK6D88EB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160709,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THERE WAS AN ELECTRIC POWER STEERING FAILURE AND THE STEERING WHEEL FELT TIGHT. IN ADDITION, THERE WAS A LOSS OF POWER STEERING ABILITY AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE DEALER (TEAM FORD, 702-395-5100, LOCATED AT 5445 DREXEL ROAD, LAS VEGAS, NV 89130) DIAGNOSED THAT THE FUEL PUMP MAY NEED TO BE REPLACED. FURTHER DIAGNOSTIC TESTING CONCERNING AN ENGINE AND ELECTRICAL FAILURE ASSOCIATED WITH THE STEERING WAS NEEDED. THE VEHICLE WAS ALSO TO BE REPAIRED PER MANUFACTURER CAMPAIGN  NUMBER: 12M02 (SYNC WITH MYFORD MYLINCOLN TOUCH WARRANTY EXTENSION COVERING ACCESSORY PROTOCOL INTERFACE MODULE APIM). THE DEALER PROVIDED A LOANER VEHICLE AND WAS WAITING ON THE GUIDELINES FROM THE MANUFACTURER TO REPAIR THE VEHICLE. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 74,000.",
        "vin": "2FMGK5D82EB"
    },
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11156789,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE REVERSING OUT OF THE DRIVEWAY, THE VEHICLE LOST POWER STEERING ABILITY. THE CONTACT HAD TO ENGAGE THE STEERING WHEEL WITH FORCE, WHICH CAUSED AN INJURY TO THE RIGHT SHOULDER. MEDICAL ATTENTION WAS NOT RECEIVED. THE VEHICLE WAS TOWED TO A PERSONAL MECHANIC WHERE IT WAS DIAGNOSED THAT THE POWER STEERING ASSIST FAILED. ALSO, THE FUEL PUMP FAILED OVER SIX MONTHS AGO. THE PERSONAL MECHANIC REPLACED THE FUEL PUMP CONTROL MODULE. AN UNKNOWN FORD DEALER WAS CONTACTED AND STATED THAT THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBERS: 15V250000 (STEERING) AND 16V621000 (FUEL SYSTEM, GASOLINE). THE STEERING FAILURE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 86,000. *TT  CONSUMER STATED DEALERS HAVE BEEN CONTACTED.*JB",
        "vin": "2FMHK6DT3EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156918,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY FUEL PUMP MODULE RENDERS CAR INOPERABLE WITHOUT WARNING. NO ERROR CODE.  MODULE HAS BEEN RECALLED IN OTHER MODELS, BUT NOT THIS ONE.",
        "vin": "2FMGK5DC5AB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154203,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE REAR DRIVER AND PASSENGER SIDE INFLATABLE SEAT BELTS ON THE SECOND ROW WERE DAMAGED. THE WEBBING OF THE SEAT BELTS WAS FRAYED, THE INFLATABLE SEAT BELT COVER POPPED OUT, AND THE REAR DRIVER'S SIDE INFLATABLE SEAT BELT DID NOT RETRACT, WHICH MADE THEM UNUSABLE. THE VEHICLE WAS TAKEN TO COURTESY FORD BREAUX BRIDGE (337-504-7340, LOCATED AT 2022 REES ST, BREAUX BRIDGE, LA 70517) WHERE IT WAS STATED THAT THERE WAS NO RECALL AND THAT THE SEAT BELTS NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURES WERE NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 86,000.",
        "vin": "2FMGK5C8XEB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "08/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152770,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS OR WON'T START.",
        "vin": "2FMGK5B82EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER CONSOLE LATCH DOES NOT MOVE GETS STUCK CAUSING THE DOOR TO BREAK OFF. VEHICLE WAS PARKED",
        "vin": "2FMGK5B86EB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11152460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING POWER STEERING FAILED AND CAN'T STEER TO HARD ALSO AIR CONDITIONER BLOWER STOPPED WORKING AT THE SAME TIME",
        "vin": "2EMHK6DT3EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145188,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE HAS STALLED SEVERAL TIMES WHILE TRAVELING DOWN ROAD. UNEXPECTED LOSS OF POWER AT THE SAME TIME AS ENGINE STALL. ALSO UNPROMPTED CALL TO FORD VEHICLE REPORT NUMBER WHILE TRAVELING NUMEROUS TIMES. ONCE CAR IS RESTARTED, SEVERAL CODES ARE LIT INCLUDING TRAC CONTROL AND ENGINE LIGHT. THIS HAS HAPPENED 3 TIMES IN THE LAST 30 DAYS.",
        "vin": "2FMGK5D82EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142713,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START, AND THE ENGINE WARNING INDICATOR AND CODE: 90627 ILLUMINATED. THE CONTACT CALLED SUNLAND FORD AT (760) 241-7751 (LOCATED AT 15330 PALMDALE RD, VICTORVILLE, CA 92392) AND WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE CONTACT STATED THAT HE REPAIRED THE VEHICLE HIMSELF, BUT THE DETAILS WERE NOT PROVIDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 57,000. *TT    THE CONSUMER STATED THE VIN SHOULD HAVE BEEN LISTED IN THE EXISTING RECALL, HAD ALL THE SIGNS WHICH MET THE REQUIREMENTS. THE FUEL PUM CONTROL MODULE WAS REPLACED.      UPDATED 12/13/18*JB",
        "vin": "2FMGK5C87EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142134,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING 45 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO PEARSON FORD (LOCATED AT 10650 N MICHIGAN RD, ZIONSVILLE, IN 46077, 317-873-3333) WHERE IT WAS DIAGNOSED THAT THE FUEL DELIVERY SYSTEM FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THERE WERE NO RECALLS. THE FAILURE MILEAGE WAS 64,000.",
        "vin": "2FMGK5B83EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141266,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE ATTEMPTING TO DRIVE THE VEHICLE, IT FAILED TO START. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND TRANSFERRED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "2FMGK5B82EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133212,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING OUT OF GARAGE, ENGINE STILL RUNNING, NO POWER STEERING. SHUT OFF ENGINE TO CALL FOR A TOW BUT WHEN I RESTARTED THE ENGINE THE STEERING WAS WORKING. FIRST TIME THIS HAS HAPPENED. CAR HAS 46,000 MILES ON IT. NO OTHER PROBLEMS.",
        "vin": "2FMGK5B81EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "09/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130594,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START SEVERAL TIMES. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE FUEL PUMP ELECTRIC MODULE NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VEHICLE WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE) BECAUSE IT COVERED THE ECO BOOST MODEL VEHICLES. THE VEHICLE WAS REPAIRED. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129475,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE NOW THE TRANSMISSION AND BRAKES HAVE FAILED GOING DOWN OUR DRIVEWAY. WHEN OUR FLEX HAS BEEN GOING DOWN OUR DRIVEWAY AND THE CAR IS IN DRIVE, THE TRANSMISSION MAKES A GRINDING SOUND AND THE BRAKES DO NOT RESPOND AT ALL.   ONCE ABOUT A MONTH AGO WE WERE ABLE TO STOP THE CAR USING THE EMERGENCY BRAKE TO STOP THE BEHICLE BEFORE IT ENTERED THE STREET. TODAY THE EMERGENCY BRAKE WAS NOT USED BY A YOUNGER DRIVER AND THE CAR ENTERED THE STREET AT FULL SPEED GOING OVER A CURB AND HITTING A MAILBOX AFTERWHICH THE EMERGENCY BRAKE WAS DEPLOYED.   THE CAR WAS TURNED OFF THEN BACK ON AND EVERYTHING WAS BACK TO NORMAL.   IT IS INCREDIBLY UNSAFE TO HAVE BRAKES AND TRANSMISSION FAIL IN UNISON.",
        "vin": "2FMHK6C81EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128637,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED, STARTED ALL LIGHTS CAME ON WARNING STEERING NEEDED TO BE SERVICED, I SHUT CAR OFF, RESTARTED IT ALL CLEARED UP, HAPPEN 1ST TIME IN AUGUST, NOW HAVE A CLICKING SOUND FRONT RIGHT OF VEHICLE, WHAT HAPPENS IF THIS HAPPENS WHILE DRIVING DOWN ROAD AT HIGH SPEED.",
        "vin": "2FMGK5C88EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "04/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LATCH SENSORS ARE FAULTY.  WE REPLACED THE FRONT PASSENGER LATCH SENSOR IN APRIL 2017 AND NOW NEED TO REPLACE THE BACK PASSENGER LATCH.  BECAUSE THE ELECTRICAL/SECURITY SYSTEM TELLS THE CAR THE DOOR IS AJAR, IT DOES NOT ALLOW THE POWER LOCKS TO FUNCTION WHILE THE CAR IS RUNNING.  IT ALSO DRAINS THE BATTERY BY NOT TURNING THE INTERIOR DOME LIGHT OFF AS WELL AS SETTING OFF THE CAR ALARM UNPREDICTABLY.  THE INTERIOR DOME LIGHTS ALSO COME ON WHILE THE CAR IS DRIVING, WHICH IS DISTRACTING TO THE DRIVER.",
        "vin": "2FMGK5C8XEB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105371,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I KEEP GETTING \"DOOR AJAR\" NOTIFICATION ON MY RIGHT PASSENGER DOOR.  I SEE THAT THIS IS A KNOWN ISSUE IN THE FORD FLEX AND THE FORD ESCAPE MODELS.",
        "vin": "2FMGK5B88RB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102406,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST INSISTENCE THE CAR CRANKED OVER BUT WOULD NOT START. THE SECOND INCIDENCE I WAS DRIVING DOWN THE ROAD AND THE CAR CUT OUT. THE THIRD INCIDENCE THE CAR WOULD CRANK BUT NOT START, AND THE CHECK ENGINE LIGHT CAME ON, WITH A CODE THAT SAID THE FUELPUMP CONTROL CIRCUIT/OPEN. NOW SITS AND CRANKS BUT WILL NOT START.",
        "vin": "2FMHK6C86EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100632,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE I24 AT 65 MPH WHEN THE FORD FLEX SUDDENLY BEGAN TO SLOW TO ZERO.  IT WAS STILL RUNNING BUT WOULD NOT ACCELERATE. IT NEARLY CAUSED A MAJOR ACCIDENT. I COASTER TO A STOP AND TURNED OFF THE CAR. AFTER A FEW MINUTES, I CRANKED IT AND IT RAN OK FOR ABOUT 5 MINUTES, BUT THE CHECK ENGINE LIGHT WAS ON. I DROVE IT TO THE FORD SHOP IMMEDIATELY. THEY SAID THE ACCELERATOR ASSEMBLY WAS DEFECTIVE. I REPLACED IT AT A COST OF OVER $400.  THE VEHICLE IS ONLY 3 YEARS OLD WITH ONLY 40,000 MILES. I SAW ONLINE THAT THIS HAD HAPPENED TO OTHERS AS WELL. THIS IS AN EXTREMELY DANGEROUS PROBLEM THAT HAS OCCURRED WITH MANY FLEX OWNERS AND SHOULD BE RECALLED BEFORE OTHERS LOSE THEIR LIFE.",
        "vin": "2FMGK5C80EB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "04/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091016,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHILD WENT TO BUCKLE HERSELF IN, AND THE PLASTIC AROUND THE BUCKLE BROKE IN HER HAND, REVEALING FRAYED SEAT BELT MATERIAL. MY CHILD IS 7 YEARS OLD. THEY CAR WAS STATIONARY I AM THE ONLY OWNER AND I HAVE ONLY OWNED THE FLEX SINCE JAN OF 2015. THAT WAS THE DRIVER SIDE PASSENGER SEATBELT. THE SEAT  BELT ON THE OTHER SIDE HAD BEEN LOCKING FOR ABOUT A YEAR, BUT IT PULLED SLOWLY WAS NOT AN ISSUE. I ASKED FOR IT TO BE ADJUSTED AND WAS TOLD THE WHOLE  MECHANISM NEEDED REPLACING. IT HAD LESS THAN 61654 MILES. THAT WAS WHAT WAS ON THE CAR WHEN I GOT IT BACK. I WAS TOLD THAT IT WAS OUT OF WARRANTY AND I WOULD  HAVE TO $700 TO GET THEM FIXED. I CALLED FORD AND THEY ACTED LIKE I WAS JUST ASKING FOR MONEY. I AM LIVID THAT MY 3 YEAR OLD CAR HAS SEATBELT FLAWS AND THEY ARE NOT TAKING CARE OF IT. IF THE PLASTIC HAD NOT BROKEN THE FRAYED BELT STILL POSED A SAFETY HAZARD FOR MY CHILD! HOW MANY PEOPLE ARE DRIVING AROUND NOT KNOWING THAT THEY HAVE FRAYED SEATBELTS? MY CAR IS 1,650 MILES OUTSIDE OF THE WARRANTY. THAT THEY ARE NOT FIXING IT, IS UNACCEPTABLE.",
        "vin": "2FMGK5C87EB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090505,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING OUT OF A PARKING LOT AT 5 MPH, THE CONTACT NOTICED AN ABNORMALLY STRONG ODOR. THE CONTACT WAS UNSURE WHERE THE ODOR ORIGINATED FROM AND ROLLED DOWN THE WINDOWS. THE CONTACT CALLED ED BUTTS FORD (1515 N HACIENDA BLVD, LA PUENTE, CA 91744, (800) 960-3673) AND WAS INFORMED THAT THERE WAS NOTHING WRONG WITH THE VEHICLE. THE DEALER WAS CONTACTED A SECOND TIME AND DIAGNOSED THAT CARBON MONOXIDE WAS LEAKING FROM THE EXHAUST SYSTEM. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2FMGK5C85EB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "SERVICE FUEL TANK",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON AFTER THE CHECK FUEL FILL INLET LIGHT HAD BEEN ON. WHEN TAKEN TO THE FORD DEALER THEY SAID THE LEGAL CANISTER FAILED INTERNALLY. NOW FORD IS SAYING THEY WON'T COVER IT BECAUSE IT NOT PART OF THE EMISSIONS SYSTEM. MY VEHICLE IS 2014 FORD FLEX DEL.",
        "vin": "2FMGK5C86EB"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084051,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. WHEN IT WOULD START, THE VEHICLE WOULD STALL WHILE DRIVING UNKNOWN SPEEDS. THE LOW PRESSURE WARNING INDICATOR WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT CALLED JC LEWIS FORD (9505 ABERCORN ST, SAVANNAH, GA 31406). THE DEALER INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL; HOWEVER, THE SYMPTOMS WERE IDENTICAL TO NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 91,000. THE VIN WAS NOT AVAILABLE. *TT  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "11/25/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083634,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING APPROXIMATELY 15 MPH, THE REAR \"PASSENGER SIDE DOOR AJAR\" AND THE WRENCH ICON \"SEE MANUAL\" WARNING INDICATORS ILLUMINATED. AFTERWARDS, THE VEHICLE STALLED. THE CONTACT EXITED THE VEHICLE TO CHECK THE DOORS, BUT ALL THE DOORS WERE CLOSED. THE CONTACT RE-ENTERED THE VEHICLE, BUT IT WOULD NOT RESTART. THE VEHICLE WAS TOWED TO CARMAX (11225 PARKSIDE DR., KNOXVILLE, TENNESSEE) AND THEN TOWED TO THE AUTHORIZED DEALER (TED RUSSELL FORD LINCOLN, 9925 PARKSIDE DR., KNOXVILLE, TENNESSEE) WHERE IT WAS DIAGNOSED THAT THE FUEL CONTROL MODULE FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED. THE CONTACT MENTIONED THE FAILURE FIRST OCCURRED ON NOVEMBER 25, 2017. AFTER THAT FAILURE, THE VEHICLE WAS TOWED TO THE SAME CARMAX DEALER WHERE IT WAS DIAGNOSED AND REPAIRED FOR THE SAME FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 48,224.",
        "vin": "2FMGK5C87EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "08/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST 2017 OUR FORD FLEX STALLED AND WOULD NOT START. WE WERE GOING ABOUT 35 MPH ON A COUNTRY ROAD. WE HAD ONLY OWNED IT FOR A FEW WEEKS, HAVING PURCHASED IT FROM VARNEY FORD IN NEWPORT, ME. HAD IT TOWED TO THE DEALER WHO KEPT IT FOR TWO WEEKS AND FINALLY SAID IT WAS FIXED, BLAMING IT ON A BROKEN SHIFTER. HE ALSO RESET EVERYTHING BY PULLING A BATTERY CABLE AND HIS EXPLANATION SOUNDED PRETTY VAGUE.     ON NOV 19, THE VEHICLE CRANKED BUT REFUSED TO START IN A PARKING LOT. I HAD IT TOWED TO MY LOCAL GARAGE WHO HAS BEEN VERY GOOD TO US IN THE PAST. HE QUICKLY DIAGNOSED THE PROBLEM AS A BAD FUEL PUMP DRIVER MODULE AND REPLACED IT.    THE CAR HAS BEEN FINE SINCE.    I WOULDN'T BE REPORTING EXCEPT FOR THE FACT THAT ECOBOOST FLEX AND TAURUS VEHICLES FROM THE SAME YEAR WERE RECALLED FOR FAILURE OF THIS MODULE (NHTSA 16V621000, FORD RECALL 16S31).    I BELIEVE THAT MY VEHICLE SUFFERED THE SAME FAILURE AS DESCRIBED IN THE RECALL. I CHECKED THE PART NUMBERS AT ROCK AUTO AND BOTH ECOBOOST AND NON-ECOBOOST LIST THE SAME PART NUMBER FOR THE PUMP CONTROL MODULE.    AS A LIFETIME SERVICE TECHNICIAN (BIOMEDICAL, X-RAY AND COMPUTERS) I BELIEVE THIS NEEDS TO BE REVIEWED.    THANKS FOR YOUR ATTENTION.",
        "vin": "2FMHK6D87EB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081751,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG AND ALL OF A SUDDEN THE VEHICLE DRIVE WOULDN'T GO HIGHER THEN 20 MILES AN HOUR ENGINE IS REVING UP CAN'T SWITCH GEARS FROM DRIVE TO REVERSE TRANSMISSION IS GONE BOUGHT THIS IN MAY 2016 I HAVEN'T EVEN HAD  IT 2 YEARS DEALER WON'T HELP ME BOUGHT IT FROM IMPERIAL IN MENDON MA DOESN'T SEEM RIGHT TRANSMISSION TO GO IN NEW VEHICLE LIKE THIS",
        "vin": "2FMHK6C82EB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2018",
        "dateOfIncident": "02/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075994,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TALANA RECALL , VAVLVE COVER, PCV VALVE, CRANKCASE VENT OIL SEPARATOR HIGH PERFORMANCE ENGINE RTB SILICONE, SAE 5W-30 PREMIUM SYNTHETIC OIL, BRAKE PARTS CLEANER, METAL SURFACE WIPES, SILICONE GASKET REMOVER. SMOKING CONDITION FROM THE TAILPIPE DURING NORMAL ENGINE OPERATING TEMPERATURES. BROUGHT TO FORD DEALER SHIP WHEN IT HAPPENED. THEY DIAGNOSED THE PROBLEM. TOOK HOME. BROUGHT BACK 1 WEEK LATER.",
        "vin": "6DT9EBD2725"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065688,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 80,250.",
        "vin": "2FMGK5D89EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029820,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 FORD FLEX. CONSUMER WRITES IN REGARDS TO POSSIBLE ENGINE FAILURE. *LD    THE CONSUMER STATED THE ENGINE EITHER SHUT OFF OR FAILED TO START. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT REPAIRED.*JS",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057293,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TEMPERATURES ARE LESS THAN 40 DEGREES F, THE REAR HATCH WILL NOT LATCH WHEN CLOSED AFTER BEING OPENED.  THE HATCH OPENS FINE, BUT IT WILL NOT LATCH UNLESS WARMED.  I HAVE HAD IT CHECKED BY A FORD DEALER AND AN INDEPENDENT MECHANIC, BUT NO SOLUTION HAS BEEN FOUND.  THIS MORNING, I HAD TO USE A HAIR DRYER TO WARM THE LATCH IN ORDER TO GET IT TO CLOSE.  TEMPERATURES WERE AROUND FREEZING.  THE VEHICLE IS ALWAYS STATIONARY WHEN I OPEN THE HATCH, AND I WILL NOT MOVE IT AS LONG AS THE HATCH WILL NOT LATCH.",
        "vin": "2FMGK5C88EB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "04/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054901,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT NOTICED A SMALL CRACK IN THE SIDE WINDOW. THE VEHICLE WAS TAKEN TO SAYBROOK FORD (1 FORD DR, OLD SAYBROOK, CT 06475 (860) 388-1293). THE DEALER STATED THAT THERE WAS NO RECALL FOR THE DEFECT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THERE WAS NO RECALL FOR THE DEFECT. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 36,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054261,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE COULD NOT START AND WAS TOWED TO AN INDEPENDENT MECHANIC. THE MECHANIC DIAGNOSED THAT THE FUEL PUMP AND THE FUEL MODULE WERE DEFECTIVE AND THE BATTERY DIED. IT WAS UNKNOWN IF THE VEHICLE WAS REPAIRED OR IF THE DEALER WAS CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 69,000.",
        "vin": "2FMGK5B83EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052714,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/01/2017 APPROXIMATELY 20:00 HRS.  STEERING ASSIST FAULT SERVICE REQUIRED  ON PARKING LOT   STEERING WHEEL NO POWER STEERING.  2014 FORD FLEX  VIN. 2FMGK5B83EBD11092",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A LOSS OF POWER TO THE FUEL PUMP CAUSED THE ENGINE TO STALL AND PREVENTED THE VEHICLE FROM STARTING. THIS HAPPEN IN THE MIDDLE OF A BUSY INTERSECTION CAUSING A MAJOR SAFETY INCIDENT. THIS VEHICLE WAS SUBJECT TO A RECALL AND INSPECTED FOR THE SAME PROBLEM IN 2016. THE PART WAS REPLACED AND FAILED IN SPITE OF THE FACT THAT THE INSPECTION WAS MADE BY THE FORD DEALER. WHEN THE CAR STALLS THERE IS A LOSS OF POWER STEERING AND POWER BRAKES. IF THIS OCCURS AT HIGHWAY SPEEDS IT COULD BE VERY SERIOUS. IT APPEARS THAT THE ORIGINAL ATTEMPT BY FORD TO ADDRESS THIS PROBLEM HAS NOT BE EFFECTIVE.",
        "vin": "2FMHK6DT0EB"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/21/2017",
        "dateOfIncident": "10/19/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11035346,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - MY WIFE WAS TRAVELING ON HWY 70 IN TEXAS TOWARDS VERNON. SHE WAS TRAVELING APPROXIMATELY 73MPH AND STRUCK A DEER. WHEN SHE STRUCK THE DEER THE THE AIRBAGS (BOTH FRONT AIRBAGS) DIDN'T DEPLOY AND THE SEATBELTS DID NOT LOCK AS DESIGNED. BASED ON MY RESEARCH OF YOUR SITE AND THE NHTSA GUIDELINES ON THE DEPLOYMENT OF AIRBAGS...I BELIEVE THERE IS A PROBLEM. ANYTHING BEING STRUCK AT THAT SPEED, SHOULD'VE DEPLOYED THE AIRBAGS AND MY WIFE'S APPLICATION OF THE BRAKES AT THAT SPEED SHOULD HAVE LOCKED THE SAFETY RESTRAINTS. THE VEHICLE SUSTAINED SIGNIFICANT DAMAGE TO THE FRONT END, TO INCLUDE ENGINE COMPARTMENT DAMAGE AND THE LOSS OF BOTH HEADLIGHTS OPERABILITY.",
        "vin": "2FMGK5C89EB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/17/2017",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11034110,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING THE VEHICLE, THERE WAS AN ABNORMAL EXHAUST ODOR IN THE CABIN. THE CONTACT STATED THAT THE EXHAUST CAUSED THE CONTACT TO BE HOSPITALIZED ON THREE OCCASIONS. THERE WAS NO CRASH INVOLVED. THE CONTACT STATED THAT SUBSEQUENT BLOOD TESTS SHOWED TRACES OF CARBON MONOXIDE IN THE BLOOD. ADDITIONALLY, THE CONTACT STATED THAT SHE CONSTANTLY EXPERIENCED SEVERE HEADACHES AFTER DRIVING THE VEHICLE. THE VEHICLE WAS TAKEN TO GOSCH FORD (150 CARRIAGE CIR, HEMET, CA 92545, (951) 396-7250) TO BE DIAGNOSED. THE CONTACT WAS INFORMED BY THE DEALER THAT THERE WAS NO TRACE OF CARBON MONOXIDE IN THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 60.",
        "vin": "2FMGK5C85EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031512,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AND THE ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP MODULE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED THREE TIMES. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT TO TAKE THE VEHICLE TO A LOCAL DEALER FOR INSPECTION. THE CONTACT WAS INFORMED OF A FEE, BUT WOULD BE REIMBURSED FOR THE REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 84,000.",
        "vin": "2FMGK5B83EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030483,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD FLEX VIN [XXX]    PASSENGER DOOR WHEN CLOSED TIGHT, SHOWS DOOR AJAR AND ALL DOORS WON'T LOCK.  OCCASIONALLY, WHILE UNDERWAY, DOOR AJAR NOTICE WILL TURN OFF AND DOORS WILL LOCK.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2FMGK5D80EB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/18/2017",
        "dateOfIncident": "09/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11023943,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE LEVER THAT ALLOWS THE BACK SEATS TO COME DOWN IS PULLED, THE SEATS COME DOWN EXTREMELY QUICKLY, DANGEROUSLY FAST.  THEY APPEAR TO BE ON A SPRING ACTION.  ONE OF MY SONS PULLED ON THE LEVER AND MY OTHER SON'S HEAD WAS HIT BY THE SEAT, AND HE SUFFERED A CONCUSSION!  I DON'T UNDERSTAND WHY IT WAS BUILT THAT WAY!!",
        "vin": "2FMGK5D87EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "08/13/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014997,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT AFTER A COMPLETE STOP AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FAILED TO INCREASE IN SPEED. IN ADDITION, THE CONTACT STATED THAT THERE WAS ROUGH IDLING. THE CONTACT MANAGED TO THE PULL VEHICLE OVER, SHUT THE VEHICLE OFF WAITED FIFTEEN MINUTES, RESTARTED THE VEHICLE HOWEVER THE FAILURE REOCCURRED. THE VEHICLE WAS TOWED TO THE LOCAL DEALER (SAMES KINGSVILLE FORD, 2501 S HWY 77, KINGSVILLE,TX, 78363) WHERE IT WAS PENDING A DIAGNOSIS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE) DUE TO THE VEHICLE NOT BEING A TURBO. THE FAILURE MILEAGE WAS APPROXIMATELY 39,000.",
        "vin": "2FMGK5C88EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003882,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER DOOR OPEN LIGHT WILL REMAIN ON, DESPITE BEING SECURED CLOSED CAUSING INTERIOR LIGHTS TO REMAIN ON UNTIL 10 MPH. THIS IS A PROBLEM WHEN REVERSING AT NIGHT. WE DON'T REVERSE ABOVE 10MPH AND IT IS DIFFICULT TO SEE. IT IS ALSO A PROBLEM DRIVING IN TRAFFIC AT NIGHT. WE ALSO WORRY THE LIGHT WILL DRAIN OUR BATTERY.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000028,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGINNING IN EARLY MAY, MY VEHICLE WOULD LOSE ALL POWER AND GO INTO \"LIMP\" MODE WHILE DRIVING.  THE \"WRENCH\" WARNING LIGHT APPEARED AND I PULLED OVER INTO THE NEAREST PARKING LOT. THE OWNER'S MANUAL INDICATE IT WAS A POWERTRAIN PROBLEM AND NEEDED TO BE TAKEN TO A DEALERSHIP.  WHEN I STARTED THE VEHICLE, THE LIGHT WAS NO LONGER ON AND IT RAN NORMALLY.  A FEW DAYS LATER, SAME PROBLEM.  THIS HAPPENED ABOUT 50% OF THE TIME I WOULD DRIVE IT.  DRIVING, LOSE POWER, WRENCH LIGHT APPEARS, PULL OVER, TURN OFF CAR, RESTART, ALL NORMAL.  IT WAS EXTREMELY FRUSTRATING AND AT TIMES SCARY WHEN THIS WOULD OCCUR AT HIGHWAY SPEEDS.  WHEN TAKING THE VEHICLE TO THE DEALER, THEY COULD NOT PULL CODES BECAUSE THE WRENCH LIGHT WAS NOT ACTIVELY ON AT THE TIME I WOULD GET THERE.  FINALLY, ONE MORNING, LIGHT COMES ON, POWER IS LOST AND I ALTER MY PLANS FOR THE DAY TO DRIVE STRAIGHT TO THE REPAIR SHOP, LEAVE THE CAR RUN AND DEMAND THAT THEY PULL THE CODES RIGHT THEN AND THERE BECAUSE IF I TURNED IT OFF, IT WOULD RESET AND I'D BE STUCK DRIVING IT AGAIN UNTIL THE CYCLE REPEATED ITSELF.  THEY WERE ABLE TO PULL 5 CODES AND I ENDED UP PAYING $822.08 FOR A THROTTLE BODY W/SENSOR, THROTTLE BODY GASKET, AND PEDAL.  OF COURSE, AT 40,000 MILES, NOTHING IS COVERED UNDER WARRANTY ANY LONGER.  THE MOST FRUSTRATING PART OF THIS IS SEARCHING ONLINE AND DISCOVERING THAT THIS IS AN EXTREMELY COMMON PROBLEM FOR FORD OWNERS SINCE 2011.  AT ONE TIME, FORD EVEN AVOIDED A RECALL TO CORRECT THE PROBLEM, BY OFFERING AN EXTENDED WARRANTY TO THOSE CUSTOMERS WHO HAD YET TO HAVE THEIR THROTTLE BODY FAIL.  IT IS CLEAR THAT FORD MERELY WANTED TO AVOID THE BAD PUBLICITY OF A RECALL BY THIS ACTION.  FORD HAS NOT CORRECTED THE PROBLEM, THOUSANDS OF PEOPLE STILL HAVE TO BEAR THE COST OF THESE REPAIRS.  THIS IS A SAFETY AND CONSUMER PROTECTION ISSUE.  MAKE FORD RECALL THIS PART AND PROTECT CONSUMERS!",
        "vin": "2FMHK6DT3EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHEN ATTEMPTING TO RESTART THE VEHICLE AFTER FILLING THE TANK, THE VEHICLE FAILED TO RESTART. THE CONTACT HAD THE VEHICLE TOWED TO A CERTIFIED MECHANIC WHO DIAGNOSED THAT THE FUEL TANK MODULE FAILED AND NEEDED TO BE REPLACED. THE CONTACT SPOKE WITH THE DEALER WHO INFORMED THE CONTACT THAT THE FAILURE WAS RELATED TO NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "2FMGK5D80EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972327,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MID 2015 PASSENGER REAR DOOR LIGHT KEPT COMING ON EVERY TIME I DROVE, WITH THE DASH LIGHT SAYING \"DOOR AJAR\" EVEN THOUGH THE DOOR WAS CLOSED COMPLETELY. THIS CAUSED CABIN LIGHTS TO STAY ON UNTIL REACHING 10 MPH, MAKING IT AN EXTREME SAFETY HAZARD TO DRIVE IN REVERSE IN THE DARK, BECAUSE YOU CANNOT SEE WHAT IS BEHIND YOU. ALSO CAUSED BATTERY TO RUN DOWN, DOOR CHIME RINGS CONSTANTLY WHILE DRIVING (EVERY TIME I APPLY THE BRAKES) AND CAUSED CAR ALARM TO GO OFF AT ANY HOUR, INCLUDING THE MIDDLE OF THE NIGHT, CAUSING NEIGHBOR COMPLAINTS. FORD DEALERSHIP WHERE I PURCHASE THE CAR WOULD DO NOTHING, SAYING IT WAS NOT UNDER WARRANTY, SO I FINALLY PAID TO REPLACE THE FAULTY SENSOR AT THEODORE ROBBINS FORD IN COSTA MESA FOR $413.40 ON 10/5/2016. IN JANUARY 2017 THE SAME \"DOOR AJAR\" MESSAGE BEGAN APPEARING FOR THE DRIVER'S DOOR, EVERY TIME I DRIVE IT, CAUSING THE SAME PROBLEMS OF DOME LIGHTS ON, OBSCURING NIGHT VISION, CHIMES AND CAR ALARM GOING OFF. ON 4/13/17 THE BATTERY, WHICH HAS ALREADY BEEN REPLACED ONCE, IS DEAD, DUE TO BEING RUN DOWN BY THE FAULTY DOOR LATCH. THIS IS A MANUFACTURING DEFECT AND I WOULD LIKE TO BE REIMBURSED FOR DOOR LATCH I REPLACED ON 10/6/16, AND FOR DRIVER'S DOOR LATCH THAT IS NOW FAILING, AND FOR A NEW BATTERY.",
        "vin": "2FMGK5B81EB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/29/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969344,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING QUIT WHILE IN A PARKING LOT. I STOPPED, SHUT OFF THE VEHICLE, AND IT RESET. THE PASSENGER SIDE DOOR AJAR LIGHT CONSTANTLY STAYS ON, EVEN THOUGH THE DOOR IS SHUT. THIS WILL NOT ALLOW THE DOORS TO BE LOCKED, AND THE INTERIOR LIGHTS STAY ON UNTIL THE VEHICLE REACHES 15 MPH. IT HAS ALSO CAUSED THE LIGHTS TO STAY ON INSIDE THE CAR, DRAINING THE BATTERY.",
        "vin": "2FMGK5C85EB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/27/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969020,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF/MOONROOF SHATTERED AND EXPLODED OUTWARD WHILE THE CAR WAS OPERATED AT ORDINARY SPEED ON AN INTERSTATE HIGHWAY. THE SUNROOF WAS NOT TOUCHED OR STRUCK IN ANY MANNER. IT WAS CLOSED, AND NOT IN MOTION (IT WAS NOT BEING RETRACTED, ETC.).",
        "vin": "2FMHK6C8XEB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965864,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR AJAR LIGHT COMES ON WHEN ALL DOORS ARE CLOSED. THIS OCCURS WHEN THE VEHICLE IS STATIONARY OR SOMETIMES WHILE IN MOTION. THIS KEEPS THE DOORS FROM BEING LOCKED WHILE THE CAR IS IN MOTION. I'M TOLD BY FORD THIS IS A TSB (KNOWN ISSUE) BUT IS NOT A COVERED REPAIR.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954191,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT COASTED TO A COMPLETE STOP AND THE VEHICLE RESTARTED NORMALLY. THE CONTACT DROVE HOME. THE VEHICLE DID NOT START AFTER APPROXIMATELY FOUR HOURS. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE CONTROL MODULE NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 42,721.",
        "vin": "2FMHK6C88EB"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934648,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A1 INCOMING EMAIL:  FORD REFUSES TO COMMUNICATE WITH CUSTOMER REGARDING NHTSA SAFETY RECALL.  *SMD  THE CONSUMER STATED THE VEHICLE STALLED IN TRAFFIC, IT WOULD NOT REMOTE START, AND THE DASHBOARD SYNC SYSTEM WOULD GO BLANK WHILE DRIVING. *JB",
        "vin": "2FMGK5C8XEB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "05/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928306,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING AT A SLOW SPEED, THE ACCELERATOR PEDAL WAS DEPRESSED, BUT THE VEHICLE FAILED TO RESPOND. THE VEHICLE WAS TOWED TO THE DEALER TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE HALFSHAFT DISENGAGED FROM THE LINKSHAFT AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V393000 (POWER TRAIN). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,100.",
        "vin": "2FMHK6C84EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928305,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS UNABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE FUEL DRIVE MODULE SHORTED OUT INTERNALLY AND THE FUEL PUMP FAILED. THE VEHICLE WAS REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.",
        "vin": "2FMHK6C84EB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/26/2016",
        "dateOfIncident": "11/26/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928046,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT A LOW SPEED ABRUPT STOP ON A SECONDARY ROW, THE SECOND ROW BENCH SEAT (IT'S SPLIT 60/40; THE 60 SIDE) CAME LOOSE FROM THE FLOOR ATTACHMENT, CAUSING A REAR FACING CAR SEAT TO HIT THE BACK OF THE FRONT SEAT. THIS WAS NOT A TETHER MALFUNCTION. IT IS A DEFECT IN THE ATTACHMENT BETWEEN THE BENCH SEAT ITSELF AND THE LOCKING MECHANISM ON THE FLOOR. AT THIS POINT I CANNOT SECURE THE SEAT BECAUSE OF THIS BROKEN PART. (THIS SEAT IS DESIGNED TO FOLD FORWARD FOR STORAGE/INGRESS-EGRESS FOR 3RD ROW SEAT PASSENGERS). FORD HAS TO DATE BEEN UNRESPONSIVE ALTHOUGH I BOUGHT A PREMIUM CARE WARRANTY THAT IS STILL ACTIVE. THEY ARE NOT ADDRESSING A CRITICAL SAFETY ISSUE.",
        "vin": "2FMHK6D86EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2016",
        "dateOfIncident": "06/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925149,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD MY FUEL PUMP REPLACED TWICE AND IT COST ME $970. $830 FOR FUEL PUMP AND $140 FOR BATTERY THAT DIED AS A RESULT OF THE FUEL PUMP ISSUE.    I DON'T GET HOW MY CAR, WITH A REAL MALFUNCTION, NOT SOMETHING THAT \"MAY\" HAPPEN, ISN'T BEING INCLUDED IN THE FUEL PUMP RECALL.  I WAS DRIVING WHEN IT HAPPENED. I COULD'VE BEEN SERIOUSLY INJURED OR MY CHILDREN.    MY FUEL PUMP MALFUNCTIONED AND THE REPLACEMENT ONE THEY PUT IN ALSO MALFUNCTIONED. NOW, SINCE THEY'VE INSTALLED THE 2ND FUEL PUMP, MY CAR HAS AN OVERWHELMING SMELL OF GAS, WHICH APPEARS TO BE LEAKING FROM MY VEHICLE.    ON 07/11, I HAD TO GET A SECOND REPLACEMENT PUMP, DUE TO THE FIRST ONE FAILING.",
        "vin": "2FMGK5C87EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924077,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILED WHILE DRIVING AND WE HAD NO CONTROL OVER THE VEHICLE.  *TR",
        "vin": "2FMGK5D8XEB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "10/13/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915704,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING APPROXIMATELY 35 MPH, THE POWER SEIZED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 39,500. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913623,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WILL STALL WITHOUT WARNING. IT HAS BEEN RECALLED. FORD DOES NOT HAVE THE PART IN STOCK ACCORDING TO PARENT FORD MOTOR COMPANY.  FORD MOTOR DOES NOT OFFER AN ALTERNATIVE VEHICLE FOR CUSTOMER. THIS PUTS THE BURDEN OF RISK ON THE CUSTOMER ON A KNOWN SAFETY PROBLEM.    CAR STOPPED IN SCHOOL PARKING LOT CAUSING PROBLEMS WITH TRAFFIC IN AND OUT OF SCHOOL.",
        "vin": "2FMHK6DT8EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/29/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 FORD FLEX SEL IS A LEASED VEHICLE WITH 14,000 MILES ON IT.  I WENT TO HAVE THE OIL CHANGED AND THE TIRES ROTATED TODAY.  THE FRONT TWO TIRES, WHICH ARE NOW ON THE BACK HAVE CHUNKS OF RUBBER FALLING OFF.  THE DEALERSHIP TOLD ME THAT THE TIRES ARE IN \"THE RED\".  I AM SUPPOSED TO TURN THIS CAR IN TO THE DEALERSHIP IN FEBRUARY OF 2017.  I AM GOING BACK TO THE DEALERSHIP THAT I LEASED THE CAR FROM TO SEE IF THEY CAN HELP ME, AS TIRES SHOULD LAST MORE THAN 14,000 MILES WITH NORMAL DRIVING CONDITIONS.",
        "vin": "2FMGK5C82EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908523,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE ATTEMPTING TO START THE VEHICLE, IT FAILED TO START. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP DRIVER MODULE FAILED. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 14,539.",
        "vin": "2FMGK5B88EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "07/20/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2014 FORD FLEX INDICATES PASSENGER DOOR AJAR (RIGHT FRONT DOOR) ON THE INSTRUMENT PANEL, EVEN THOUGH THE DOOR APPEARS PROPERLY CLOSED.  REPEATED ATTEMPTS (UP TO 50 OR MORE) ARE REQUIRED TO GET THE DOOR TO CLOSE WITH THE INDICATOR LIGHT TURNING OFF.  ONCE THE DOOR IS CLOSED PROPERLY, WITH THE INDICATOR LIGHT OFF, THE DOOR AJAR LIGHT MAY TURN ON AGAIN WHILE THE CAR IS OFF AND NOT MOVING, CAUSING THE ALARM TO SOUND.  IN ADDITION, WHILE DRIVING, THE PASSENGER DOOR AJAR LIGHT MAY SUDDENLY TURN ON, CAUSING THE NEED TO PULL OVER TO INSURE THE DOOR IS CLOSED PROPERLY.  THIS HAS HAPPENED ON TURNS AND ON STRAIGHT ROADS.  THIS IS A SAFETY HAZARD, AS PARKING ALONG THE SIDE OF A HIGHWAY OR ROADWAY CAN CAUSE A DANGEROUS SITUATION NOT ONLY FOR THE PASSENGER RIDING IN THE FRONT SEAT BUT ALSO FOR ALL PASSENGERS IN THE CAR.  WE ARE CONCERNED THAT AT SOME POINT THE DOOR LATCH MAY FAIL AND THE DOOR MAY OPEN WHILE MOVING.   THIS ISSUE OCCURS EACH TIME THE DOOR IS OPENED AND INTERMITTENTLY WHILE MOVING OR PARKED.  WE HAVE DISCUSSED THIS ISSUE WITH THE LOCAL FORD SERVICE DEPARTMENT PRIOR TO THE SEPTEMBER EXPANSION OF THE DOOR LATCH RECALL AND THEY INDICATED THAT OUR VEHICLE IS NOT COVERED BY THE CURRENT RECALLS EVEN THOUGH THE REPRESENTATIVE WAS VERY AWARE OF THE PROBLEM OCCURRING.  HIS INDICATION WAS THAT IT \"MOSTLY HAPPENED ON THE DRIVER DOOR\".  WE BELIEVE THAT OUR VEHICLE SHOULD ALSO BE COVERED BY THE RECALL.",
        "vin": "2FMHK6C89EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/07/2016",
        "dateOfIncident": "08/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893804,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER DOOR AJAR SENSOR IS MALFUNCTIONING MAKING MY VEHICLE BELIEVE THAT THE DOOR IS OPEN ALL THE TIME.  THIS CAUSES THE DOOR LOCKS ON ALL DOORS TO UNLOCK EVEN WHEN VEHICLE IS IN MOTION.",
        "vin": "2FMGK5C84EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2016",
        "dateOfIncident": "06/04/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893674,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A COUPLE MONTHS AFTER PURCHASING MY VEHICLE THE CHECK ENGINE LIGHT CAME ON AND I LOST POWER TO SOME OF THE COMPUTER SYSTEMS, I CALLED THE DEALER SHIP AND TOLD THEM THE PROBLEM, MY FATHER HAD ALREADY PLUG HIS OBD READER INTO THE CAR AND SO I WAS ABLE TO LET THEM KNOW WHAT THE CODE HAD COME UP ON THE READER. WHEN I TOOK THE CAR TO THE DEALER SHIP THERE WAS A PROBLEM WITH BROKEN WIRES.",
        "vin": "2FMHK6D84EB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE SEAT BELTS WERE EASY FOR OTHER OCCUPANTS TO WRAP IN POSITIONS THAT COULD SERIOUS INJURY OR DEATH. THE CONTACT STATED THAT THE CHILD OCCUPANTS WERE ABLE TO WRAP THE SEAT BELTS AROUND THEIR WAISTS AND, AFTER THE PRETENSIONER TIGHTENED, WRAPPED AROUND THE NECK ON ONE OF THE OCCUPANTS AND TIGHTENED TOO TIGHT AROUND THE WAIST OF THE OTHER. ONE OF THE SEAT BELTS HAD TO BE CUT. THE VEHICLE WAS NOT TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE AND VIN WERE NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "03/31/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875270,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE THE VEHICLE WAS PARKED, THE DOOR AND TRUNK AJAR WARNING LIGHT ILLUMINATED WHEN THE DOORS AND TRUNK WERE PROPERLY CLOSED. IN ADDITION, ALL THE DOORS FAILED TO REMAINED LOCKED. THE FAILURE OCCURRED CONSTANTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 47,000.",
        "vin": "2FMGK5CBXEB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/10/2016",
        "dateOfIncident": "05/27/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873703,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AN INTERMITTENT ELECTRICAL CONNECTION IN THE STEERING GEAR DISABLES ELECTRIC POWER-STEERING ASSIST WHILE DRIVING, MAKING THE VEHICLE DIFFICULT TO CONTROL. RECEIVED A \"STEERING ASSIST FAULT-SERVICE REQUIRED\" WARNING. THIS OCCURRED WHILE DRIVING N ABOUT 50 MPH ON I-95 IN JARRETT, VA. ON MAY 27, 2016. STOPPED, CALLED ROADSIDE ASSISTANCE. WAS TOLD THE ONLY OPTION WAS A TOW. CLOSEST DEALER ALREADY CLOSED FOR LONG WEEKEND. ANOTHER DEALER AN HOUR AWAY SUGGESTED CYCLING CAR ON AND OFF SEVERAL TIMES. WE DID AND CAR WAS OK. TOOK CAR TO LOCAL DEALER IN HARDEEVILLE SC ON RETURN HOME- UNABLE TO REPLICATE THE PROBLEM AND SAID WE HAVE TO DRIVE CAR IN SPITE OF THIS SAFETY ISSUE - WHICH APPEARS IDENTICAL TO ONE THAT FORCED THE RECALL OF 2011 TO 2013 FORD FLEX'S.",
        "vin": "2FMHK6D86EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/16/2016",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859853,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER I PURCHASED MY FORD FLEX WE NOTICED A HORRIBLE EXHAUST SMELL INSIDE THE VEHICLE AS WE WERE DRIVING DOWN THE ROAD. I TOOK IT TO THE FORD DEALERSHIP WHERE WE BOUGHT IT TO BE LOOKED AT AND THEY DID SEVERAL THINGS AND TOLD ME THEY COULDN'T FIX IT AND DIDN'T KNOW HOW AND THAT THERE WERE SEVERAL OTHER OWNERS OF FLEXES THAT HAD THE SAME COMPLAINT BUT COULDN'T FIX EITHER. I CALLED THE FORD MANUFACTURER MYSELF AND THEY HAVE DIRECTED MANY THINGS TO BE DONE TO MY VEHICLE BY DIFFERENT DEALERSHIPS, STILL NO RESULTS!!! MY CAR HAS BEEN IN THE SHOP LONGER THAN I HAVE HAD IT IN MY POSSESSION. THERE ARE MANY OTHER THINGS WRONG WITH IT INCLUDING THE RADIO THEY CAN'T SEEM TO FIX LIKE THE SCREEN PARTIALLY DISAPPEARING ETC.. ONE TIME WE WERE SITTING WITH THE WINDOWS DOWN BECAUSE IT WAS A NICE DAY WHILE ONE OF US RAN IN TO GET THE DRINK WE PAID FOR AND FORGOT AND THE FUMES WERE SOOO BAD WE HAD TO PUT THE WINDOWS UP AND DRIVE AROUND BEFORE I PASSED OUT. I TRIED TO LEMON LAW IT BUT IT WAS SOLD TO ME INCORRECTLY SO UNTIL I GET A LAWYER I'M STUCK WITH IT IN THE SHOP AGAIN WHILE THE FORD MOTOR COMPANY PRETENDS TO CARE!!!! ALSO MY PROBLEM STARTED AT ABOUT 10,500 MILES. NOTHING WILL BE DONE TO CORRECT THIS PROBLEM UNTIL SOMEONE DIES(MAYBE) OR THEY ARE MADE TO! I CAN TELL YOU I'VE NEVER HAD SUCH A BAD SITUATION IN ALL MY LIFE AND IF THE FORD COMPANY OFFERED ME A HUNDRED THOUSAND DOLLAR CAR FOR FREE I WOULDN'T TAKE IT UNLESS I COULD SELL IT TO SOME OTHER POOR STUPID SOUL. I ALSO HAVE SOME KIND OF SCHREAKING NOISE IN MY FRONT END NOW, THE TORTURE NEVER ENDS. SOMEONE HELP!!!!!!!!!!!",
        "vin": "2FMGK5C86EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "01/20/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821326,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS DOOR LATCH SWITCH IS DEFECTIVE.THE PART WAS REPLACED BY THE DEALER LAST YEAR BEFORE I PURCHASED THE CAR AND I HAD POINTED IT OUT TO THEM. BEFORE RECEIVING THE CAR. THE PROBLEM PURSISTES. I CAN NOT GET IT TOO CLOSE PROPERLY.WHEN I ENTER THE VEHICLE.I CAN CAUSE THE CAR TOO FLASH THE LIGHTS AND BEEP THE HORN AFTER IT IS PARKED AND I AM IN THE HOUSE. I LIVE IVE IN MPLS.,MN..IT IS WINTER HERE  AND THIS PROBLEM COULD DRAIN THE BATTERY IN SHORT ORDER IN SUB ZERO WEATHER.I NEED A PERMANENT SOLUTION TO THIS DEFECT.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/05/2016",
        "dateOfIncident": "01/30/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818149,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. WHILE DRIVING APPROXIMATELY 20 MPH, THE STEERING WHEEL LOCKED UP AND MADE A LOUD GRINDING NOISE WHILE BEING TURNED. THERE WERE NO WARNING INDICATORS. THE VEHICLE WAS TAKEN TO A LOCAL DEALER WHERE IT WAS DIAGNOSED AND RECOMMENDED THAT THE STEERING MODULE NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WERE NO RECALLS. THE VEHICLE WAS NOT REPAIRED. THE CONTACT WAS ADVISED TO FILE A COMPLAINT WITH NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": "2FMHK6DT6DB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2015",
        "dateOfIncident": "05/26/2015",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721735,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NO, THERE WASN'T A FIRE (YET). BUT YOUR SYSTEM WOULDN'T ALLOW ME TO SEND THIS W/O PICKING ONE OF THE THREE INCIDENT OPTIONS.    BAD RAW FUEL SMELL AFTER EVERY ENGINE SHUTOFF. CAR TAKEN TO FORD DEALER WHO TOLD US THERE WAS A TSB# 14-0091 FOR THIS ISSUE.     NO PARTS AVAILABLE, AND THEY DON'T KNOW WHEN THEY WILL BE AVAILABLE!    WE ARE WORRIED THAT THE CAR IS GOING TO START ON FIRE! PLEASE HELP!",
        "vin": "2FMHK6DTXEB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715660,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT THE DOOR AJAR WARNING SENSORS ILLUMINATED WHEN THE VEHICLE'S DOORS WERE CLOSED. THE INTERIOR LIGHTING ACTIVATED. THE DOORS ALSO UNLATCHED AND LOCKED INDEPENDENTLY WHILE DRIVING AND THE SECURITY SYSTEM ALSO ACTIVATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION. THE ELECTRONIC DOOR SYSTEM WAS CLEANED; HOWEVER, THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "2FMHK6C83DB"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/03/2015",
        "dateOfIncident": "03/10/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10714216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN PARK IN MY DRIVEWAY, WHICH IS STEEP, AND THE FLEX ROLLED AFTER BEING IN PARK FOR 2 MINUTES.  MY THREE YEAR OLD SON WAS IN THE VEHICLE SO I TRIED TO JUMP INTO THE VEHICLE AND PUT MY RIGHT HAND ON THE BRAKE PEDAL.  THE VEHICLE KNOCKED ME OUT AND DRAGGED ME DOWN, RELEASING ME AT THE BOTTOM OF THE DRIVEWAY.  I WOKE UP TO SEE THE VEHICLE BACK INTO THE OTHER SIDE OF MY U-SHAPED DRIVEWAY AND PROCEED FORWARD, HOPPING MY NEIGHBOR'S CURB, STOPPING IN THEIR BUSHES.  MY SON WAS OKAY, BUT I SUSTAINED A BROKEN AND DISLOCATED RIGHT WRIST, AND MULTIPLE ROAD RASHES ON MY FEET, KNEES, RIGHT ARM, LEFT HAND REQUIRING SUTURES, RIGHT SIDE OF MY FACE AND A LACERATION IN MY SCALP REQUIRING SUTURES.  THESE INJURIES WERE EXTREMELY PAINFUL AND I LOST THE USE OF BOTH HANDS FOR ONE MONTH.  AT 8 WEEKS, I STILL DO NOT HAVE THE FULL USE OF MY LEFT THUMB AND I REQUIRE PHYSICAL THERAPY ON MY RIGHT WRIST AS IT IS STILL NOT BACK TO FULLY FUNCTIONING.  I TOOK THE VEHICLE TO A LOCAL FORD DEALER AND THEY COULD NOT FIND ANYTHING WRONG.  I CONTACTED FORD WITH WRITTEN DOCUMENTATION AND PHOTOS OF MY INJURIES AND FORD DID NOT EVEN OFFER ANY FORM OF SYMPATHY OR RESOLUTION TO THE PROBLEM.  THEY DENIED MY CLAIM AND OFFERED NO HELP! IT'S IMPOSSIBLE TO GET OUT OF ANY VEHICLE ON OUR DRIVEWAY IN ANY GEAR OTHER THAT PARK. I'M TELLING THE TRUTH AND PHYSICS ARE PROOF ENOUGH. THOUGH NOTHING MECHANICALLY DEFECTIVE WAS FOUND BY FORD, IT HAPPENED, PERIOD. I WAS INJURED BUT LUCKY THAT NEITHER MY SON NOR OTHERS WERE HURT. I DID NOTHING TO CAUSE THIS; IT WAS A FAILURE OF THE VEHICLE SOMEHOW BUT FORD STATED THAT SINCE THEY COULDN'T FIND THE PROBLEM, THEY'RE DENYING MY CLAIM.",
        "vin": "2FMGK5D83EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2015",
        "dateOfIncident": "01/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683356,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS, THE EQUIPMENT THAT IS SUPPOSED TO REVEAL THE MILES PER GALLON HAS FROZEN.  THE FIRST TIME, IT FROZE AT 19.4 MPH REGARDLESS OF DRIVING SPEED AND ON ANOTHER OCCASION, AFTER A SERVICE CALL, IT FROZE AT 21.1 MPH.  *TR",
        "vin": "2FMHK6D84EB"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/27/2015",
        "dateOfIncident": "01/26/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679123,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 FORD FLEX.  THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 40 MPH, THE VEHICLE IMPACTED THE CURB AND STARTED TO JERK UNCONTROLLABLY.  AFTER INSPECTING THE VEHICLE, THE CONTACT NOTICED THAT THE AXLE FRACTURED AND THE FRONT PASSENGER TIRE DETACHED FROM THE VEHICLE.  THE AIRBAGS FAILED TO DEPLOY. THE CONTACT DID NOT SUSTAIN ANY INJURIES AND MEDICAL ATTENTION WAS NOT REQUIRED.  A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE APPROXIMATE MILEAGE WAS 22,000.  THE VIN NUMBER WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "12/31/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671857,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD FLEX. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 34,000.",
        "vin": "2FMHK6DT1EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2015",
        "dateOfIncident": "12/31/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669446,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING 70 MPH ON A TOLL WAY IN BUSY MORNING TRAFFIC. WITHOUT ANY WARNING THE VEHICLE LOST ENGINE POWER. PRESSING THE GAS GAVE NO ACCELERATION AND NO POWER TO MOVE THE CAR. THANKFULLY I WAS IN THE LEFT LANE AND HAD ENOUGH MOMENTUM TO GET TO THE LEFT SHOULDER. AT THIS POINT A WRENCH LIGHT CAME ON SAYING CHECK MANUAL. THE CAR WAS UNDER NO POWER OF ITS OWN IN 70 MPH TRAFFIC. VERY DANGEROUS! SAT ON THE LEFT SHOULD OF THE SPEEDING TOLL ROAD UNTIL A TOW TRUCK ARRIVED AND TOOK IT TO THE NEAREST DEALERSHIP. THEY RAN DIAGNOSTICS AND WERE VERY SURPRISED AND PERPLEXED WHY A 2014 ENGINE SEIZED UP. ISSUED A RENTAL CAR FOR AN INDEFINITE TIME AND SAID THE ENGINE WILL BE TAKEN COMPLETELY A PART AS THEY TRY TO FIGURE OUT WHAT WENT WRONG. THEY SAID THEY WILL WORK WITH FORD ON A SOLUTION WHETHER TO REBUILD THE ENGINE OR PUT A NEW ONE IN. THIS IS A 2014 ENGINE! I THINK THEY KNOW THERE IS A BIG PROBLEM WITH THE CAR. I CERTAINLY HAVE LOST CONFIDENCE IN IT. IT FAILED ME AT 70MPH IN TRAFFIC.   *JS",
        "vin": "2FMHK6DT1EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/25/2014",
        "dateOfIncident": "12/10/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668235,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE LOCAL KFC FOR DINNER DURING MY LUNCH BREAK AND WHEN I CAME BACK TO MY VEHICLE AFTER GETTING MY FOOD INSIDE I STARTED MY CAR AND PROCEEDED TO PUT IT IN REVERSE. AS SOON AS I PUT THE VEHICLE IN REVERSE IT PROCEEDED TO GO FORWARD INSTEAD. SO I CHECKED TO MAKE SURE I PUT IT IN REVERSE AND PUT THE VEHICLE BACK IN PARK AND THEN RE-ENGAGED REVERSE AND IT WENT FORWARD AGAIN. THIS TIME THE BRAKE PEDAL WENT TO THE FLOOR AND THE CHECK ENGINE LIGHT CAME ON. I IMMEDIATELY CALLED THE DEALERSHIP AND THEY ADVISED ME TO TURN THE VEHICLE OFF AND THEN ON AGAIN TO SEE IF THAT FIXED THE ISSUE. THEY DID NOT ADVISE ME TO DO A VEHICLE HISTORY REPORT THAT IS EQUIPPED WITH MY VEHICLE TO SEE IF THE COMPUTER COULD FIND SOMETHING. THE SERVICE ADVISER AT THE DEALERSHIP ADVISED ME THAT HE NEVER HEARD OF THIS ISSUE BEFORE AND FOR ME TO WATCH IT AND IF IT HAPPENS AGAIN TO CALL ROADSIDE ASSISTANCE AND HAVE IT TOWED IN SINCE THAT IS A SAFETY ISSUE.  *TR",
        "vin": "2FMHK6C89EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661941,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PREGNANT WIFE WAS PUTTING OUR 20 MONTH OLD SON IN VEHICLE. SHE PLACED HER PURSE WITH THE KEYLESS ENTRY FOB INTO CAR AND CLOSED THE REAR PASSENGER DOOR. SHE FOUND THE VEHICLE NOW ENTIRELY LOCKED AT ALL DOORS AND WOULD NOT OPEN DESPITE THE KEY FOB BEING INSIDE THE VEHICLE. IT IS BELOW FREEZING OUTSIDE AND OUR SON IS NOW LOCKED INTO THE CAR AND GETTING COLDER. MY WIFE CALLED ME. I HAD HER CALL 911. I CALLED FORD ROADSIDE ASSISTANCE AND EXPLAINED THE EMERGENCY WE HAD. FORD ROADSIDE ASSISTANCE SAID THERE IS NOTHING THEY COULD DO AND SUGGESTED I CALL SYNC. I THEN CALLED SYNC AND THEY TOLD ME THERE'S NOTHING THEY CAN DO AND TO CALL ROADSIDE ASSISTANCE. I CALLED ROADSIDE ASSISTANCE BACK AND THEY WERE EVEN MORE RUDE THIS TIME AND TOLD ME THERE'S NOTHING THAT CAN BE DONE. I EXPLAINED TO EACH CONTACT THERE WAS A TODDLER LOCKED IN A VEHICLE. WE FINALLY CALLED THE FORD DEALERSHIP AND THEY SIMPLY GAVE US A 5 DIGIT CODE TO ENTER INTO THE KEYPAD ON THE VEHICLE AFTER VERIFYING SOME INFORMATION. I FIND THIS EXTREMELY TROUBLING AND CONCERNING FORD ROADSIDE ASSISTANCE AND FORD SYNC DID NOT HAVE THE KNOWLEDGE TO DIRECT US OR AN ABILITY TO PROVIDE THE MANUFACTURER ASSIGNED 5 DIGIT KEYPAD CODE FOR ENTERING THE VEHICLE. NOT TO MENTION THEY WERE NOT CONCERNED WITH THE SEVERITY OF THE SITUATION ONE BIT. THE OUTCOME OF THIS ISSUE COULD HAVE RESULTED QUITE WORSE THAN IT DID. AN INVESTIGATION NEEDS TO BE PERFORMED ON PROCEDURES FORD ROADSIDE ASSISTANCE AND FORD SYNC EMPLOYEES ARE TO FOLLOW IN LIFE THREATENING SITUATIONS INVOLVING WOMEN AND CHILDREN WITH THEIR VEHICLES, SPECIFICALLY WHEN INFANTS/TODDLERS AND CHILDREN ARE LOCKED INSIDE FORD VEHICLES. AT THIS POINT WE CAN ONLY ASSUME THE VEHICLE HAS AN ELECTRICAL PROBLEM WHICH RESULTED IN ALL DOORS AND HATCHES LOCKING WHILE THE KEYLESS FOB WAS INSIDE THE VEHICLE.   *JS",
        "vin": "2FMHK6D83EB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "05/29/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606988,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I WERE DRIVING ON A 2-LANE HIGHWAY IN OUR VEHICLE AT THE APPROXIMATE SPEED OF 55 MPH.  OUR FORD FLEX WAS EQUIPPED WITH A FACTORY SUNROOF, WHICH WAS IN THE CLOSED POSITION, AND THE SUNSHADE WAS OPEN.  AS WE WERE TRAVELING DOWN THIS ROAD, WITH NO TRAFFIC COMING IN THE OPPOSITE DIRECTION, OR IN FRONT OF US, WE HEARD A SHOTGUN SOUND COME FROM ABOVE OUR HEADS AND GLASS FLEW EVERYWHERE IN OUR VEHICLE, INCLUDING IN THE BACK WHERE OUR 5-YEAR OLD DAUGHTER WAS SITTING.  OUR SUNROOF AND LITERALLY EXPLODED!!!!  WE CLOSED THE SUNSHADE AND IMMEDIATELY TRAVELED TO THE LOCAL DEALER WHERE WE PURCHASED THE VEHICLE.  MY THINK AT FIRST WAS THAT SOMETHING HIS THE GLASS, BUT YET NOTHING WAS AROUND US THAT COULD HAVE THROWN ANYTHING ONTO THE GLASS TO BREAK IT.  WHEN WE ARRIVED AT THE DEALERSHIP, WE EXITED THE CAR AND WHEN I LOOKED AT THE HUGE HOLE IN THE SUNROOF, ALL OF THE GLASS SURROUNDING THE HOLD WAS POINTING UPWARDS AS IF THE GLASS HAD LITERALLY EXPLODED UPWARD, NOT DOWN INTO THE CAR.  I HAVE NEVER HEARD OF ANYTHING LIKE THIS HAPPENING, AND LUCKILY MY WIFE WAS UNDER CONTROL ENOUGH WHEN IT HAPPENED THAT SHE DIDN'T SWERVE OFF OF THE ROAD.  AFTER THE DEALERSHIP SUBMITTED DETAILS OF THIS INCIDENT TO FORD, THEY REJECTED TO DO ANYTHING TO TAKE CARE OF THIS REPAIR FOR US.  I HAVE SINCE HAD TO FILE A CLAIM WITH MY INSURANCE TO GET IT FIXED, AND HAVE BEEN CONTACTING FORD EXECUTIVES ON A DAILY BASIS, AND CONTACTING MEDIA SOURCES, TO GET ATTENTION TO THIS SAFETY ISSUE.  I HAVE FOUND SEVERAL OTHER CASES THAT STRETCH BACK TO AS FAR BACK AS 2008 SO FAR, WITH A DESCRIPTION ALMOST IDENTICAL TO OURS.  THIS IS A SAFETY ISSUE THAT NEEDS TO HAVE ATTENTION BROUGHT TO BEFORE SOMEBODY GETS SERIOUSLY INJURED OR DIES.   *TR",
        "vin": "2FMGK5D89EB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565206,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED ON SIDE OF ROAD, ON AN INCLINE FACING UPHILL, WITH ENGINE RUNNING.  2 ADULT PASSENGERS IN VEHICLE.  WITHOUT NOTICE VEHICLE BEGAN ROLLING BACKWARDS.  PASSENGER TURNED WHEEL IN AN ATTEMPT TO STOP VEHICLE ON CURB.  CENTER CONSOLE PREVENTED PASSENGER FROM BEING ABLE TO ACCESS VEHICLE BRAKES OR PARKING BRAKE.  VEHICLE ENDED UP STRIKING ANOTHER VEHICLE BEFORE IT CAME TO REST.  LUCKILY THERE WERE NO INJURIES AS HILL ENDS IN CUL-DE-SAC WITH LARGE DROP OFF.  I REQUESTED LOCAL FORD DEALERS INSPECT POWERTRAIN SYSTEM AS A CAR IN PARK SHOULD NOT SUDDENLY BEGIN ROLLING.  2 LOCAL DEALERS HAVE REFUSED TO LOOK AT VEHICLE CITING THEY DO NOT WANT TO GET INVOLVED.  *TR",
        "vin": "2FMGK5C82EB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "02/07/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FLEX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOADED TWO BOXES IN THE BACK OF THE VEHICLE AND CLOSED THE BACK HATCH DOOR.  THE REAR PASSENGER SIDE WINDOW EXPLODED FROM THE VIBRATION CAUSED BY CLOSING THE BACK HATCH DOOR.  COULD HAVE BEEN A SAFETY ISSUE IF SOMEONE HAD BEEN NEAR THE GLASS.   IF IT HAPPENED ON THE HIGHWAY, COULD HAVE BEEN A DISTRACTION.  FORD HAS DENIED ANY RESPONSIBILITY FOR THE GLASS EXPLODING.  *TR",
        "vin": "2FMGK5C85EB"
    }
]