[
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228257,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "XLR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUR CAMPER DOWN THE HIGHWAY, THE FRONT OF THE CAMPER SNAPPED (2ND DECK OF A FIFTH WHEEL CAMPER). WE WERE TRAVELING ON HIGHWAY 89 EAST OF THE GRAND CANYON WHERE THE ROADWAY HAS MULTIPLE DIPS IN THE ROAD. WE HEARD A LOUD BANG FROM THE CAMPER. WHEN WE STOPPED FOR FUEL IN PAGE AZ, WE DISCOVERED MANY DENTS AND SPLITS IN THE FRONT OF THE SIDEWALKS OF THE CAMPER. I TOOK PHOTOS TO SEND TO XLR WARRANTY DEPARTMENT WHERE I WAS REFERRED TO LIPPERT, THE MFG OF THE CAMPER FRAME. WHEN I PULLED DOWN THE FRONT TRIM PIECE TO SEE WHAT BROKE, I DISCOVERED THAT THE FRAME JUST WAS ASSEMBLED WITH WELDS THAT LOOK LIKE AN 8TH GRADER DID IN METAL SHOP. THE TOP 5 BRACE SUPPORTS ALL HAVE BROKEN WELDS, AS WELL AS A BROKEN WELD AND CRACKED MAIN 2ND DECK FRAME MEMBER ABOVE THE BATTERY COMPARTMENT ON THE PASSENGER SIDE OF THE CAMPER. THE ENGINEERING, OR LACK THEREOF, OF THE WELDS AND THE FRAME MEMBERS USED WOULD HARDLY HOLD A MOUNTAIN BICYCLE FRAME TOGETHER, LET ALONE TRYING TO USE SUCH POOR CRAFTSMANSHIP ON A 21,000LB 5TH WHEEL CAMPER. IF WE WOULD HAVE TRAVELED MUCH FARTHER DOWN THE ROAD, THE ENTIRE FRONT END COULD HAVE BROKE OFF, LEAVING A 10 TON PROJECTILE ROLLING INTO WHO KNOWS WHAT.*DT  *JB",
        "vin": "4X4FXLR3XEF"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "11/14/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925887,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "XLR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FOREST RIVER XLR TOWED BY A 2003 FORD F-350. THE CONTACT STATED THAT UPON ARRIVAL FROM A TRIP, SHE DROVE INTO HER DRIVEWAY AND NOTICED THAT THE PASSENGER'S SIDE TIRE WAS DRAGGING. THE CONTACT NOTICED THAT THE FRAME WAS RUSTED OUT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/22/2016",
        "dateOfIncident": "07/17/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887822,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "XLR",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "VAIL SPORT",
                "productModel": "ST LH99",
                "productYear": "9999",
                "size": "225/75D15",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FOREST RIVER V-CROSS (NA) EQUIPPED WITH VAIL SPORT ST LH99 TIRES, SIZE: 225/75D15. WHILE DRIVING 60 MPH, THE FRONT PASSENGER TIRE BLEW OUT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TIRE THREADS SEPARATED. THE TIRE WAS REPLACED. THE TIRES WERE THE ORIGINAL TIRES. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14T001000 (TIRES). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT PROVIDED. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 4,000.",
        "vin": ""
    }
]