[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096380,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. SINCE RECEIVING THE RECALL NOTICE DATED DECEMBER 2017 I HAVE CALLED THE LOCAL DEALER 5 TIMES BEGINNING JAN 16, 2018. MANY PROMISES TO CALL ME BACK WITH A PROJECTED TIME THE REPLACEMENT AIRBAG WILL BECOME AVAILABLE, BUT SO FAR THEY NEVER HAVE CALLED ME BACK. AND TODAY THEY SAID THE SAME THING. THEY DON'T HAVE THE REPLACEMENT AND THEY DON'T KNOW WHEN THEY WILL BE GETTING THEM, BUT THEY WILL FIND OUT AND CALL ME BACK. BASED ON THEIR PERFORMANCE TO DATE I DON'T EXPECT TO HEAR ANYTHING UNTIL I CALL THEM BACK AGAIN.   IN THE MEANTIME I'M CONCERNED ABOUT DRIVING THIS VEHICLE WITH A DEFECTIVE AIRBAG.",
        "vin": "WDYPE7DD9E5"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/08/2018",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071838,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  WE TOOK SAID VEHICLE TO MERCEDES BENZ, BATON ROUGE, LA OVER 3 WEEKS AGO, MARJORIE REIFF (225-490-3119) STATED THAT THE REPLACEMENT HAS TO BE ORDERED AND WOULD LIKE US TO CHECK BACK.  WE WENT TO MERCEDES BENZ AGAIN TODAY (02/08/208) AND THE SAME PERSON STATED THAT OUR VEHICLE IS NOT LISTED BUT THE REPLACEMENT HAS TO BE ORDERED AND IT WOULD TAKE ABOUT 30 DAYS TO COME IN.  I HAVE UNTIL 02-22-2018 TO GET THIS PROBLEM RESOLVED AND CANNOT GET ANY ASSISTANCE FROM THE DEALERSHIP IN BATON ROUGE, LA.  CAN SOMEONE HELP WITH THIS MATTER?",
        "vin": "WYYPE8DB1E5"
    }
]