[
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/18/2018",
        "fire": false,
        "manufacturer": "GLOBAL INDUSTRIES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080281,
        "products": [
            {
                "manufacturer": "GLOBAL INDUSTRIES",
                "productMake": "GLOBAL FACTORY PRODUCTS",
                "productModel": "GLOBAL FACTORY PRODUCTS",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Harbor Freight Tools",
                "productMake": "INNOVA",
                "productModel": "ULTRA RUNNER",
                "productYear": "9999",
                "size": "5.3X12",
                "type": "Tire"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE FROM HARBOR FREIGHT FOR THE TIRES ON UTILITY TRAILERS UNDER NHTSA RECALL NUMBER 17V-638. WHEN I ATTEMPTED TO RETURN THE TIRES TO THE STORE FOR REPLACEMENT, I WAS TOLD AS FOLLOWS: 1) THEY DO NOT HAVE THE TIRES IN; 2) THEY WILL NOT ORDER THE TIRES FOR ME; 3) I CAN CALL AND ASK IF THE TIRES ARE AVAILABLE ON DAYS THE TRUCKS DELIVER ITEMS; 4) THEY WILL NOT PUT ME ON A CALL LIST TO ADVISE ME THE TIRES ARE IN STOCK; AND 5) THEY HAVE NO IDEA WHEN/IF THEY WILL GET THE TIRES.",
        "vin": "LN2UT0813EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "12/24/2017",
        "fire": false,
        "manufacturer": "GLOBAL INDUSTRIES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065234,
        "products": [
            {
                "manufacturer": "GLOBAL INDUSTRIES",
                "productMake": "GLOBAL FACTORY PRODUCTS",
                "productModel": "GLOBAL FACTORY PRODUCTS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HARBOR FREIGHT TOOLS SENT ME A RECALL NOTICE THAT REQUIRES ME TO \"REMOVE THE AFFECTED TIRES FROM THE TRAILER\" AND \"BRING ONLY THE TIRES TO AN HFT STORE.\" THE NOTICE CONTINUES \"YOU WILL THEN NEED TO INSTALL THE REPLACEMENT TIRES ON YOUR TRAILER.\"  THESE STEPS REQUIRE SPECIALIZED SKILLS AND EQUIPMENT I DO NOT HAVE, YET THE RECALL NOTICE FURTHER STATES THAT THE RECALL WILL BE PERFORMED \"WITHOUT CHARGE.\"  AS THE RECALL STANDS, I WOULD HAVE TO PAY OUT OF POCKET FOR A PROFESSIONAL TO REMOVE AND REPLACE THE TIRES.  I WANT TO COMPLETE THIS RECALL AT NO COST TO ME.",
        "vin": "LN2UT1115EZ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "11/24/2017",
        "fire": false,
        "manufacturer": "GLOBAL INDUSTRIES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064883,
        "products": [
            {
                "manufacturer": "GLOBAL INDUSTRIES",
                "productMake": "GLOBAL FACTORY PRODUCTS",
                "productModel": "GLOBAL FACTORY PRODUCTS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/24/2017, I RECEIVED NOTICE OF A TIRE RECALL FOR A SMALL TRAILER THAT I BOUGHT FROM HARBOR FREIGHT TOOLS.  HARBOR FREIGHT WROTE THAT I HAD TO REMOVE THE TIRES FROM THE WHEELS AND BRING THE TIRES TO ONE OF THEIR STORES.  I WROTE TO HARBOR FREIGHT (SEE ATTACHED DOCUMENTATION) THAT I AM NOT THEIR EMPLOYEE AND THAT THEY SHOULD SEND ME REPLACEMENT TIRES ON  WHEELS, AS THEY WERE WHEN I BOUGHT THEM.  I GAVE THEM A JANUARY 10 (2017, MY TYPO.  SHOULD HAVE BEEN 2018) DEADLINE FOR THE ACTION THAT I WANTED THEM TO ACCOMPLISH.  THEY NEVER RESPONDED.  WHAT I AM ASKING YOU TO DO IS TO HAVE THEM DO WHAT I ASKED.    PLEASE SEE MY DECEMBER 19, 2017 CERTIFIED LETTER FOR MORE DETAILS.",
        "vin": "LN2UT0817EZ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/18/2014",
        "dateOfIncident": "08/07/2012",
        "fire": false,
        "manufacturer": "GLOBAL INDUSTRIES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592238,
        "products": [
            {
                "manufacturer": "GLOBAL INDUSTRIES",
                "productMake": "GLOBAL FACTORY PRODUCTS",
                "productModel": "GLOBAL FACTORY PRODUCTS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS DETERMINED 08/07/2012 DURING THE ASSEMBLY PROCESS THE MANUFACTURER OF MY MH WAS NOT IN COMPLIANCE WITH THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMIN., CODE OF FEDERAL REGULATIONS TITLE 49, PART 571: 571.120 FOR MOTOR HOMES. THE COMBINED WEIGHT RATING OF THE TIRES ON THE REAR AXLE WAS 12790, AND THE COMBINED WEIGHT RATING OF THE RIMS WAS 13660. THE WEIGHT RATING OF THE REAR AXLE OF MY MH WAS 14706. THE COMBINED WEIGHT RATING OF THE REAR TIRES WAS 1916 POUND LESS THAN THE WEIGHT RATING OF THE AXLE-NOT LEGAL PER DOT REGULATIONS. THEREFORE, OWNER ASKED MANUFACTURER TO PUT THE FACTORY DUAL TIRES & RIMS BACK ON THE MH IN ORDER TO BE IN COMPLIANCE WITH DOT REGULATIONS.  MANUFACTURER IS STILL PLACING  REAR TIRES ON THE REAR AXLES OF THEIR TURTLE & UXV MODELS THAT HAVE A  COMBINED WEIGHT RATING LESS THAN THE WEIGHT RATING OF THE REAR AXLE.   UPDATED 11/24/2014   *JS",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/18/2014",
        "dateOfIncident": "04/30/2014",
        "fire": false,
        "manufacturer": "GLOBAL INDUSTRIES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592243,
        "products": [
            {
                "manufacturer": "GLOBAL INDUSTRIES",
                "productMake": "GLOBAL FACTORY PRODUCTS",
                "productModel": "GLOBAL FACTORY PRODUCTS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS DETERMINED 04/30/2014 THAT MANUFACTURER OF MY MOTOR HOME WAS NOT IN COMPLIANCE WITH DOT & NHTSA (NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION) REGULATION 49 CFR PART 571 (FEDERAL MOTOR VEHICLE SAFETY STANDARDS; CARGO CARRYING CAPACITY). NO LABEL ON MY MH PROVIDES THE FOLLOWING INFORMATION: THE WEIGHT OF A FULL LOAD OF WATER, THE UNIT WEIGHT OF WATER AND A CAUTIONARY STATEMENT THAT THE WEIGHT OF WATER IS PART OF CARGO. MOTOR HOME LABELS MUST DISPLAY THE MAXIMUM WEIGHT OF OCCUPANTS AND CARGO. IN ADDITION, FOR MOTOR HOMES, THE LABEL MUST SHOW THE SAFETY BELT EQUIPPED SEATING CAPACITY AND MUST INDICATE THAT THE TONGUE WEIGHT OF A TOWED TRAILER COUNTS AS CARGO.   THIS MANUFACTURER IS NOT PLACING OCCUPANT AND CARGO CARRYING CAPACITY (OCCC) LABELS ON THEIR MOTOR HOMES/EXPEDITION VEHICLES.   UPDATED 11/24/2014  *JS",
        "vin": ""
    }
]