[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265817,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HARLEY-DAVIDSON FLHX. WHILE DRIVING, THE RIGHT SADDLE BAG FELL OFF THE VEHICLE. THE CONTACT HAD AN UNKNOWN RECALL REPAIR FOR THE SADDLE BAG PERFORMED ON OCTOBER 5, 2015. THE SPRINGS THAT SECURED THE BAG WERE BENT FROM NORMAL WEAR AND TEAR, WHICH CAUSED THE BAG TO SEPARATE FROM THE VEHICLE. ADIRONDACK HARLEY-DAVIDSON (106 BELLEN RD, BROADALBIN, NY 12025, (518) 883-1128) INFORMED THE CONTACT TO CALL THE WARRANTY DIVISION FOR HARLEY-DAVIDSON. THE DEALER ALSO STATED THAT SINCE THE RECALL REPAIR WAS ALREADY PERFORMED, THE FAILURE WAS DUE TO USER ERROR. THE DEALER CITED THAT THERE WERE OTHER REPORTS OF THE SAME FAILURE WITH OTHER DRIVERS. THE CONTACT WAS INSTRUCTED TO FILE A CLAIM WITH HIS INSURANCE COMPANY. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 24,000.  *TR*JB",
        "vin": "1HD1KBM1XEB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205994,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 1/4 TURN HARDWARE ON THE SADDLEBAGS COMES LOOSE CAUSING THE BAG TO DETACH FROM THE BIKE CAUSING MAJOR SAFETY CONCERN TO THOSE TRAVELING AROUND THIS BIKE.  I HAVE SEEN THIS ON MOST BIKES THIS YEAR, ETC.",
        "vin": "1HD1KBM10EB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "09/02/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128055,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HARLEY-DAVIDSON FLHX. WHILE DRIVING 30 MPH, THE GEAR SHIFTER TRAVELED TO THE FLOORBOARD AND WAS UNABLE TO ENGAGE INTO FIRST GEAR. THE MOTORCYCLE WAS TAKEN TO HARLEY-DAVIDSON (239 DANIEL WEBSTER HIGHWAY, MEREDITH, NEW HAMPSHIRE 03254, 603-279-4526) WHERE IT WAS DIAGNOSED THAT THE REAR AND FRONT SHIFTER LEVERS WERE WORN AND THE SHIFTER SHAFT NEEDED TO BE REPLACED. THE DEALER REPLACED THE REAR AND FRONT SHIFTER LEVERS AND THE SHIFTER SHAFT. THE MOTORCYCLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 14,083.",
        "vin": "1HD1KRM10EB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884055,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AND MY SHIFTER LEVER FELL OFF THE BIKE ,SO WHEN I GOT HOME I DISCOVERED THAT THE SHIFTER ROD WAS STRIPPED SO NOT ONLY DID I HAVE TO REPLACE THE ROD BUT BOTH FRONT AND REAR SHIFTER LEVERS AS WELL.THIS BIKE ONLY HAS 6000,00 MILES ON IT . WHEN I WENT TO MY LOCAL HD DEALERSHIP FOR THE PARTS HE TOLD ME THAT THIS WAS HAPPENING WITH THE 2014-2016 MODELS AND THAT THESE PARTS WERE FLYING OFF HIS SHELF , WELL THAT SOUNDS TO ME LIKE THIS IS AN ISSUE AND SHOULD BE RECALLED ESPECIALLY SINCE THIS CAUSES A VERY DANGEROUS SITUATION.",
        "vin": "1HD1KBM10EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "03/10/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744583,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED AT NIGHT WHILE I WAS STOPPED AT AN INTERSECTION, WHILE HOLDING THE FRONT BRAKE LEVER, BRAKE LIGHTS WERE NOT ACTUATED. BRAKE LIGHTS WOULD COME ON IF I SQUEEZED THE BRAKES HARDER, BUT THE AMOUNT OF PRESSURE REQUIRED TO HOLD BIKE STILL WHILE STOPPED ON BOTH THE FRONT AND REAR BRAKES WOULD NOT ACTUATE BRAKE LIGHTS. THIS POSES A SAFETY HAZARD PARTICULARLY AT NIGHT WHEN I AM STOPPED AND OTHER DRIVERS HAVE NO INDICATION OF ME BEING STOPPED.",
        "vin": "1HD1KBM15EB"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "09/07/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631610,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 HARLEY DAVIDSON FLHX STREET GLIDE:  SADDLE BAG FELL OFF. SMALL \"CLIPS\" THAT HOLD THE HARD SADDLE BAGS ON STREET GLIDE PULL OUT EASILY. THIS HAS HAPPENED TO 2 OTHER BIKERS JUST WITHIN THE LAST YEAR THAT WE KNOW PERSONALLY/RIDE WITH. BECAUSE OF THEIR EXPERIENCE, WE CHECKED THEM CONSTANTLY. SEVERAL TIMES, FINDING ONE OF THE TWO HAD FALL OFF JUST FROM VIBRATION OF A RIDE. WE ARE DEVASTATED - FIRST NEW BIKE WE'VE EVERY PURCHASED. HAVEN'T EVEN MADE FIRST PAYMENT YET.  *TR",
        "vin": "1HD1KBM17EB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "08/24/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631645,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HARLEY DAVIDSON FLHX MOTORCYCLE. WHILE DRIVING APPROXIMATELY 45 MPH, THE CLUTCH FAILED TO DISENGAGE WITHOUT WARNING. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE MASTER CYLINDER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V515000 (POWER TRAIN). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 383.",
        "vin": "1HD1KBM13EB"
    }
]