[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255255,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HARLEY-DAVIDSON FLHTCU. WHILE DRIVING APPROXIMATELY 40 MPH UPHILL, THE CLUTCH BEGAN TO FAIL AND THE CONTACT WAS UNABLE TO SWITCH GEARS. THE CONTACT PULLED OVER AND PARKED THE VEHICLE. AFTERWARDS, THE CLUTCH BEGAN TO PERFORM CORRECTLY. THE CONTACT STATED THAT THE FAILURE RECURRED A SECOND TIME WHEN ATTEMPTING TO DRIVE UPHILL AGAIN. WHEN THE MOTORCYCLE WAS TURNED OFF, THE CLUTCH PERFORMED CORRECTLY. THE CONTACT TOOK THE VEHICLE TO COX'S HARLEY-DAVIDSON (LOCATED AT 1178 GALLERIA BLVD, ROCK HILL, SC 29730, 803-327-1183), BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT STATED THAT THE PREVIOUS OWNER HAD THE VEHICLE REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V471000 (POWER TRAIN); HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS CONTACTED, BUT THE MATTER WAS NOT RESOLVED. THE APPROXIMATE FAILURE MILEAGE WAS 34,000. THE VIN WAS INVALID.",
        "vin": "1HD1KE18EB6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/01/2019",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217249,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTORCYCLE IN TERMS OF MOTORCYCLES ALTHOUGH FIVE YEARS OLD, IS RELATIVELY NEW, METICULOUSLY KEPT, AND ONLY HAS APPROXIMATELY 16,600 MILES ON THE ODOMETER.ON TUESDAY MAY 28TH, I HAD JUST GOTTEN OFF THE INTERSTATE EXIT THAT TAKES ME TO MY HOME. AS I APPROACHED THE STOPLIGHT I WAS BRAKING AND DOWNSHIFTING, BRINGING THE BIKE TO FULL STOP. WHEN THE LIGHT TURNED GREEN, I WENT TO PUT MY BIKE INTO FIRST FROM FROM NEUTRAL, AND AS I DID SO THE BACK PORTION OF MY HEEL-TOE SHIFTER SHOT UP, AFTER WHICH IT WAS LOOSE AND FLOPPY AND WOULD NOT ENGAGE - AS A RESULT, I COULD NOT GET THE BIKE OUT OF FIRST GEAR. THANKFULLY, MY HOUSE IS RIGHT OFF THE EXIT, SO I SUMMARILY LIMPED HOME. IT TURNS OUT THAT THE SHIFTER, WHICH IS MADE OF CHROMIUM STEEL, IS ATTACHED TO A SPLINED ALUMINUM SHAFT- THE ALUMINUM SHAFT STRIPED. AFTER RESEARCHING THIS, I FOUND IT TO BE A FAIRLY COMMON ISSUE. I CAN'T TELL YOU HOW DANGEROUS THIS IS IN SO MANY WAYS AND HOW IT NEEDS TO BE ADDRESSED BY THE MANUFACTURER.",
        "vin": "1HD1FCM11EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794565,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER USING THE USB AS A MEDIA SOURCE, THE NEXT TIME THE MOTORCYCLE IS POWER CYCLED THE STEREO DEFAULTS TO FM AND RESETS THE FADE CONTROL. HARLEY INITIALLY SAID THIS WAS DUE TO SOFTWARE, BUT THEN CHANGED TO SAYING IT WAS NORMAL OPERATION. ON NOVEMBER 16TH, I SPOKE WITH CASE MANAGER (JOHN), WHO ADVISED THAT THIS IS DUE TO THE SYSTEM SENSING A VOLTAGE CHANGE WHEN SHUTTING DOWN. I HAVE REPLACED THE HEAD UNIT TWICE; ONCE WITH A FACTORY REFURBISHED DEVICE, AND THEN WITH A 2015 MODEL. I MUST NOTE THAT I DID NOT HAVE THIS ISSUE FOR THE FIRST 2 YEARS OF OWNERSHIP. SINCE HARLEY HAS CHANGED THEIR CAUSE ANALYSIS TWICE, THIS IS OBVIOUSLY A WIDESPREAD ISSUE. JOHN STATED THAT HARLEY HAS NOT ISOLATED THE ROOT CAUSE OF THIS PROBLEM AND IS NOW PRESENTING THIS THE \"THE WAY THE UNIT SHOULD WORK\". MY CONCERN IS THAT I RODE FOR 2 YEARS WITHOUT ANY PROBLEMS, AND NOW HAVE ONE THAT THE COMPANY CANNOT RESOLVE. SINCE THIS OCCURS APPROXIMATELY 60 - 65% OF THE TIME, I WORRY THAT THIS IS NOT REALLY A STEREO PROBLEM, BUT IS SYMPTOMATIC OF A LARGER PROBLEM WITHIN THE CENTRAL ELECTRICAL/WIRING SYSTEM OF THE MOTORCYCLE. SINCE AUGUST I HAVE WORKED WITH 3 SEPARATE DEALERS, AND WITH HARLEY-DAVIDSON TO ADDRESS THE PROBLEM TO NO AVAIL. I FEEL THAT THIS MAY BECOME A DEGRADING ISSUE THAT COULD CREATE MORE SERIOUS ELECTRICAL TROUBLES THAT MAY LEAD TO MAJOR FAILURES.",
        "vin": "1HD1FCM18EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2015",
        "dateOfIncident": "09/26/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779254,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON GETTING READY TO RIDE BIKE AT NIGHT, PULLED BACK ON HAND BRAKE LEVER AND NOTICED NO BRAKE LIGHT REFLECTION ON GROUND. THEREFORE DID AN INSPECTION AND NOTICED THAT WHEN PRESSING DOWN ON FOOT BRAKE PEDAL BRAKE LIGHT WOULD COME ON AND THEN WHEN PULLING BACK ON HAND BRAKE LEVER, LIGHT WOULD NOT COME ON. CALLED DEALER AND WAS TOLD IT BE A WEEK BEFORE THEY COULD LOOK AT IT. . I ONLY WONDER SINCE HOW LONG HAS THIS LIGHT NOT BEEN WORKING WHEN COMING TO A COMPLETE STOP AND THEREFORE NOT PRESSING THE FOOT PEDAL ONLY TO GIVE THE CAR BEHIND ME THE FALSE SENSE I HAVE STOPPED BRAKING. COULD HAVE BEEN IN A SERIOUS ACCIDENT BEING HIT FROM BEHIND .",
        "vin": "1HD1KEL13EB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "05/11/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598833,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HARLEY DAVIDSON ELECTRIC RIDE FLHTCU MOTORCYCLE. THE CONTACT STATED THAT THE CRUISE CONTROL FAILED TO DISENGAGE WHEN THE FRONT BRAKE WAS APPLIED. THE MOTORCYCLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED A SENSOR FAILURE HAD OCCURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 20 AND THE CURRENT MILEAGE WAS 2,000.",
        "vin": "1HD1FCM12EB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "05/11/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598041,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE 2014 H-D ELECTRAGLIDE ULTRA CLASSIS THE DAY BEFORE REALIZING THE EXISTENCE OF THE DEFECT DESCRIBED HEREIN. WHILE RIDING AT APPROXIMATELY 60 MPH, I SET THE CRUISE CONTROL. THE CRUISE CONTROL IS TO DISENGAGE UPON APPLICATION OF ANY OF THE FOLLOWING: FRONT BRAKE/BACK BRAKE/CLUTCH/ROLLING THE THROTTLE FORWARD. UPON NEARING A VEHICLE AHEAD OF ME, I 'TAPPED' THE FRONT BRAKE; THIS ACTION, HOWEVER DID NOT DISENGAGE THE CRUISE CONTROL. I TRIED AGAIN, USING MORE FORCE ON THE FRONT BRAKE LEVER...AGAIN, THE CRUISE CONTROL REMAINED ENGAGED. I THEN DETERMINED THAT IT WOULD DISENGAGE USING THE THREE OTHER METHODS (BACK BRAKE/ROLLING THROTTLE FORWARD/CLUTCH).    THE FOLLOWING MONDAY, I TOOK THE BIKE TO THE SELLING DEALER. IT WAS DETERMINED THAT SOME ELECTRONIC COMPONENT HAD FAILED. IT WAS REPLACED AT NO COST.    I AM SUBMITTING THIS REPORT BECAUSE THE FAILURE OF THE CRUISE CONTROL TO DISENGAGE UPON APPLICATION OF THE FRONT BRAKE CREATED A SITUATION IN WHICH I WAS APPROACHING A VEHICLE AHEAD AT HIGH SPEED, WHEN MY BIKE SHOULD HAVE THEN BEEN 'COASTING', WHICH NECESSITATED TRYING ALTERNATE METHODS TO DISENGAGE THE SYSTEM. HAD I NOT FOUND AN ALTERNATE WAY TO DISENGAGE THE CRUISE CONTROL, A COLLISION WOULD LIKELY HAVE RESULTED.   *JS",
        "vin": "1HD1FCM12EB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594273,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HARLEY DAVIDSON ELECTRA GLIDE FLHTCU.  THE CONTACT STATED THAT AFTER HAVING THE VEHICLE REPAIRED UNDER THE NHTSA CAMPAIGN NUMBER: 13V515000 (POWER TRAIN); THE CLUTCH FAILURE  RECURRED.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE CLUTCH MASTER CYLINDER NEEDED TO BE REPLACED.  THE VEHICLE WAS REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 4,884.",
        "vin": "1HD1FCM10EB"
    }
]