[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420931,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Axles are cracking. Yes available for inspection.   Husband was checking under camper since we were going to get new tires and the dealer wanted to know what suspension we have.   This is when he noticed the cracks in the axles. This is affecting both axles on the camper. This concerns us a lot if they broke the camper would probably roll or cause a severe accident.  When we went to get the tires my husband asked the tire dealership service technician if it was a manufacture defect and they said yes. Where the axle was welded together they appear to be breaking apart.  We need to know what can be done about this. Since it appears to be a defect in the axles. Our camper is a 2014 Grand Design Solitude. I will attach pictures.",
        "vin": "573FS3829E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885545,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 GRAND DESIGN SOLITUDE. WHILE THE VEHICLE WAS STATIONARY, THE SEAL ON THE AXLE SPREAD GREASE ON THE BRAKES AND CAUSED THEM TO MALFUNCTION. THE VEHICLE WAS TAKEN TO BE REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS APPROXIMATELY 2,300.",
        "vin": "573FF4324E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2015",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746925,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD AXEL SEALS GO BAD ON ALL 4 WHEELS CAUSING VERY LOOSE RUNNY GREASE TO LEAK PAST AND COAT THE BRAKE DRUMS, SHOES, MAGNET AND ALL OTHER COMPONENTS WITH A LOT OF GREASE CAUSING THE BRAKES TO SLIP AND NOT WORK.  THE TRAILER ONLY HAD 1250 MILES ON IT.",
        "vin": "573FS3822E1"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2015",
        "dateOfIncident": "06/17/2015",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725890,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING AN APPOINTMENT FOR SERVICE IT WAS DISCOVERED THAT THE AXLE SEALS HAD FAILED AND LEAKED GREASE ONTO THE BRAKES MAKING THE BRAKES USELESS.",
        "vin": "573FS3821E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/22/2015",
        "dateOfIncident": "03/21/2015",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700897,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LIPPERT COMPONENTS (LCI) OF ELKHART IN, ARE THE MANUFACTURES OF THE AXLE AND BRAKE EQUIPMENT USED ON THE GRAND DESIGN BRAND OF TRAILERS. I HAVE A 2014 SOLITUDE 369RL 5TH WHEEL. I HAVE ABOUT 10,000 MILES ON THE UNIT AND DURING MY LAST TRIP OUT I LOST SOME BRAKING CAPABILITY. AFTER FURTHER REVIEW 2 OF THE 4 BRAKES HAD GREASE LEAKING FROM THE REAR GREASE SEAL INTO THE BRAKE DRUMS. I HAVE NEVER GREASED THESE WITH THIS LITTLE MILEAGE. I POSTED ON FACEBOOK TODAY AND HAD ABOUT 10 PEOPLE WHO OWN GRAND DESIGN TRAILERS WHO HAD THE EXACT SAME PROBLEMS. THIS IS A TRUE SAFETY HAZARD CAUSED BY THE COMPONENT MANUFACTURE LIPPERT COMPONENTS INC. MY UNDER STANDING THERE WAS A LETTER WRITTEN TO THEM BY THE NHTSA LETTER NVS-214NJS AND PE14-008 DATED APRIL 3RD 2014 ABOUT ANOTHER TRAILER MANUFACTURER THAT ALSO USES LIPPERT COMPONENTS FOR THEIR AXLES AND BRAKE SYSTEMS. IT IS TIME TO HAVE LIPPERT COMPONENTS STEP UP AND RECALL ALL OF THE TRAILERS THAT HAVE THESE FAULTY GREASE SEALS BEFORE SOMEONE DIES DUE TO LOSS OF BRAKES BECAUSE OF GREASE IN THE BRAKE DRUM!!!!  *TR",
        "vin": "573FS3827E1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/09/2014",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621116,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON ST",
                "productYear": "9999",
                "size": "ST235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "ON FRIDAY AUGUST 8TH 2014 WE STOPPED AT GOODYEAR TIRE DEALER IN MOUNT VERNON, WA. AND HAD 4 BRAND NEW GOODYEAR MARATHON TIRES ST235/80R16 TIRES INSTALLED. WE DROVE 30 MILES TO OUR RV RESORT AND PULLED IN TO OUR CAMPSITE. NOTICED THAT THE LEFT FRONT TIRE WAS VERY LOW. BACKED INTO OUR SITE AND GOT SETTLED IN. THE NEXT MORNING I CHECKED THE TIRE AGAIN AND NOTICED IT WAS COMPLETELY FLAT ALSO NOTICED THAT THREE OF THE 4 TIRES ARE ALSO FLAT. THESE TIRES ARE BRAND NEW WITH ONLY 30 MILES ON THEM. I'VE CALLED THE DEALER AND REQUESTED THAT THEY COME TO OUR CAMPSITE AS I HAVE NO WAY OF CHANGING THESE TIRES. WAITING FOR THEM TO SHOW UP ON MONDAY AUG. 11TH.  *TR",
        "vin": "573FS3827E1"
    }
]