[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/03/2017",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949310,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIG HORN",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY EXIT WINDOW LATCH BROKE ALLOWING EXIT WINDOW TO FLAP LIKE A BIRD'S WING. DON'T KNOW WHAT KEPT IT FROM FLYING OFF AND HITTING A VEHICLE BESIDE OR BEHIND ME. VERY POORLY MADE, TO LIGHT GRADE OF ALUMINUM USED. THIS IS A LAWSUIT WAITING TO HAPPEN.",
        "vin": "5SFBG3826EE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808822,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIG HORN",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME OLD STORY WITH THESE TIRES, TOWMAX POWER KING ST235/85R16. WE HAD THESE TIRES AS ORIGINAL EQUIPMENT FOR OUR 2014 HEARTLAND BIGHORN 5TH WHEEL  RV.  WE WERE TRAVELING OUTSIDE OF MOAB UTAH WHEN THE LEFT REAR TIRE HAD A CATASTROPHIC BLOWOUT. ONCE WE READ ABOUT THE ISSUES WITH THESE TIRES, WE DECIDED TO REPLACE ALL 5 BEFORE CONTINUING ON OUR TRIP. THAT DECISION WAS PERHAPS ONE OF OUR BEST SINCE THE REMOVED TIRES ALL SHOWED SIGNS OF INTERNAL FAILURE PLY SEPARATION. THE TIRE DISTRIBUTOR (DYNAMIC TIRE CO.) DENIED ANY MANUFACTURING DEFECT AND REFUSED TO PAY FOR THE DAMAGES TO OUR RV. WHAT A JOKE THAT THESE TIRES ARE EVEN CONSIDERED SUITABLE FOR SERVICE ON ANY VEHICLE OR HIGHWAY. THE TIRE COMPANY POINTS THE FINGER AT THE USER SAYING THAT THE TIRES WERE EITHER UNDER-INFLATED OR OVER-LOADED. REALLY!!! I THINK THAT THEY JUST HAVE A STANDARD LIST OF EXCUSES SUCH THAT THEY DON'T HAVE TO ACCEPT LIABILITY FOR THEIR PRODUCT.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "11/03/2015",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788413,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "BIG HORN",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR BIG HORN AS A LEFT OVER IN APRIL 2015. WE TOOK SEVERAL SHORT TRIPS TO PREPARE FOR OUR US TOUR TO TO WEST COAST AND BACK. WE PUT LESS THAN 3000 MILES ON THE CAMPER BEFORE THE 1ST POWER KING TOWMAX TIRE BLEW. WHILE WE WERE TRAVELING ON THE HIGHWAY, SPEED LESS THAN 60 MILES PER HOUR ON THE ENTIRE TRIP, CAMPER BELOW THE MANUFACTURER WEIGHT LIMIT, AND TIRE PRESSURE  OF 80 PSI COLD. STOPPED IN A SMALL TOWN IN CO TO HAVE THE TIRE FIXED AND THE REPAIR GUY HAD A SIMILAR CUSTOMER A SHORT WHILE BEFORE WITH THE SAME TIRE. HE REPLACED ALL 5 OF HIS TIRES WITH ANOTHER BRAND. WE LEFT THIS TOWN FOR ANOTHER STOP AND ALL WAS OKAY. WHEN LEAVING THE NEXT STOP AGAIN ON THE HIGHWAY WE HAD ANOTHER BLOWOUT ON THE SAME SIDE OF THE TIRE I JUST REPLACED. DAMAGE TO THE CAMPER WHICH NEEDS REPAIR. THIS TIME I REPLACED THE OTHER 2 TIRES AS WELL.  HEARTLAND WANTS NOTHING TO DO WITH THIS A KEEPS SENDING US TO THE TIRE MANUFACTURER. SEEMS LIKE THE COMPANY I BOUGHT THE CAMPER FROM SHOULD HAVE MORE OWNERSHIP IN THEIR PRODUCT ESPECIALLY SEEING ALL THE OTHER BLOWOUT COMPLAINTS ON THEIR PRODUCT.",
        "vin": "5SFB3624EE2"
    }
]