[
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "03/23/2015",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706091,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING SOUTH INTO GA WITH OUR 2104 HEARTLAND CYCLONE 5TH WHEEL ,I STOPPED AT A REST AREA. AS ALWAYS, I DO A WALK ABOUT RV INSPECTION. LOOKING AT THE RV TIRES I SPOTTED A GOLF BALL SIZED BALLON IN THE SIDEWALL OF OUR 235/85R-16 ''TOW MAX\"  TIRE LOCATED RIGHT AT THE EDGE OF THE RIM.  THE TIRES HAVE ABOUT 7,500 MILES ON THEM, EXCELLENT TREAD AND INFLATED TO 80PSI AS RECOMMENDED BY HEARTLAND RV. I PUT THE SPARE ON AND PROCEEDED TO FIND A TIRE SHOP. WE STAYED AT A CAMPING WORLD LOT. ABOUT 2 HOURS INTO OUR STAY WE HEARD A VERY LOUD NOISE. THE TIRE BLEW SITTING WITH NO PRESSURE ON IT, MOUNTED IN THE SPARE TIRE RACK. UPON REMOVAL AT A TIRE SHOP, IT WAS NOTED THAT \"THEY WERE PROPERLY INSTALLED\" WITH NO CUTS. I REPLACED ALL THE TIRES WITH NEW 14 PLY TRAILER TIRES. I HAVE HEARD OF ALL THE COMPLAINTS OF THESE TIRES AND IT IS TIME FOR ACTION. PLEASE ADVISE.   *TR",
        "vin": "5SFCG3820EE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "10/13/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704608,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Sailun Tire Americas, Inc.",
                "productMake": "TOWMAX STR",
                "productModel": "ST",
                "productYear": "9999",
                "size": "ST225/75 R15",
                "type": "Tire"
            }
        ],
        "summary": "I BOUGHT A 2013 HEARTLAND CYCLONE IN DEC 2013 AND I ONE YEAR AND LESS THAN 4000 MILES HAVE HAD 5 BLOWN TIRES. ONE IN OCT. 2014 ONE IN DEC 2014 AND 3 IN FEB 2015. TIRES SENT TO DYNAMIC TIRE AND IN MARCH THEY SENT ME A LETTER SAYING IT WAS MY FAULT BECAUSE TIRES WERE UNDERINFLATED OR UNIT WAS OVERWEIGHT. I AIR MY TIRES BEFORE LEAVING EVERY TRIP AND MONTHLY IF UNIT IS NOT MOVED. I SCALED THIS TRAILER AND AM UNDER GROSS AND AXLE WEIGHT. I HAVE THE SCALE TICKET THAT WAS FROM THE SAME DAY THAT I BLEW 2 TIRES. TIRES ARE TOW MAXX 235/80/16/LOAD RANE  E.  I HAVE BOUGHT NEW TIRES BUT HAVE YET TO GET THE DAMAGE REPAIRED. TIRE COMPANY HAS THE TIRES BUT I TOOK PICTURES BEFORE SENDING THEM.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/14/2015",
        "dateOfIncident": "01/10/2015",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672485,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Sailun Tire Americas, Inc.",
                "productMake": "TOWMAX STR",
                "productModel": "ST",
                "productYear": "9999",
                "size": "ST225/75 R15",
                "type": "Tire"
            }
        ],
        "summary": "TOWMAX TIRE FAILURE WITH ONLY 600 MILES.  *TR",
        "vin": "5SFCG4336EE"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/19/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667276,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 HEARTLAND CYCLONE 3110 TOY HAULER. UNIT HAS ABOUT 4,400 MILES SINCE PURCHASED 2/14.  UPON DROPPING THE BELLY PAN TO FIX A SEWER PIPE I SAW THIS.  UNIT HAS MULTIPLE HOSES AND WIRES RUNNING THRU HOLES IN CHASSIS WITH NO GROMMET PROTECTION FROM CHAFING AND SHORTING OUT ELECTRICAL COMPONENTS WHICH COULD CAUSE A FIRE OR MAKE RV COMPONENTS INOPERABLE.  ALSO HYDRAULIC LINES AND WATER LINES ARE RUN THE SAME WAY, CAUSING LEAKS AS THE PIPES CHAFF ON THE METAL EDGES THEY ARE RUN THRU.  THERE ARE WIRES RUN BETWEEN THE FRAME AND UNDERBELLY SHOWING SIGNS OF WEAR. THE GRAY AND BLACK HOLDING TANKS WERE BELLIED BADLY BECAUSE THEY HAD STRAPS THAT WERE IMPROPERLY INSTALLED. THE TANKS STRAPS WERE 3-4\" BELOW THE BELLIED TANK BOTTOMS HAVING NO USEFUL PURPOSE. THE PLASTIC TANKS COULD HAVE SPLIT SPILLING WASTE AND SEWER CHEMICALS ON THE ROAD.  WE HAD TROUBLE GETTING THE GAS SMELL OUT OF THE FRONT TANKS. THERE IS HOT AIR  HEATER HOSE THAT IS KINKED ,BLOCKING THE HEATED AIR FROM EFFECTIVELY HEATING THE GARAGE AREA.  *TR",
        "vin": "5SFCG3820EE"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/14/2014",
        "dateOfIncident": "11/21/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664199,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A POWER KING TOWMAX TIRE HAD A BLOWOUT WITH ONLY ABOUT 3000 MILES ON IT ON OUR 2014  HEARTLAND CYCLONE TRAILER. I WAS TOLD BY THE MANAGER AT BIG O TIRES THAT THESE TIRES ARE JUNK AND THAT THEY WILL ALL EVENTUALLY HAVE A BLOWOUT. HE ALSO SAID IF WE WERE LUCKY IT WOULDN'T DESTROY OUR TRAILER OR WORST! NOW I HAVE READ BLOGS ON  QUITE A FEW WEBSITES AND IT APPEARS TO BE A POTENTIALLY DANGEROUS IF NOT DEADLY PROBLEM WITH THIS PARTICULAR  BRAND OF TIRES. THERE ARE A LOT OF CONCERNED AND ANGRY CONSUMERS THAT HAVE ENCOUNTERED THE SAME PROBLEM AS I HAVE. I BELIEVE THAT THESE TIRES SHOULD NOT BE ALLOWED TO BE OUR NATIONAL ROADWAYS JUST BECAUSE WE OWE IT  CHINA WITH ALL OUR DEBT TO THEM. PLEASE LOOK INTO THIS COMPANY'S BACKGROUND FOR YOURSELF, YOU WILL AGREE THERE IS A PROBLEM HERE.   THANKS [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5SFCG3822EE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641899,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "LT235/80R16 E",
                "type": "Tire"
            }
        ],
        "summary": "JULY OF 2014 PURCHASED NEW TOYHAULER TRAILER, HEARTLAND ROAD WARRIOR RW 348.  RV CAME WITH POWER KING TOWMAX LT235/80R16 E TIRES.  WITH LESS THAN 2,500 MILES, TIRE TREAD SEPARATED CAUSING BLOWOUT.  TIRE CAUSED $2,000 OF DAMAGE TO TRAILER.  BLOWOUT OCCURRED ON SEPT 18, 2014. TIRES WERE WELL MAINTAINED AND CHECKED.  NEVER DRIVEN OVER 62 MILES AN HOUR, AND ALWAYS ON PAVEMENT. NEVER OVERLOADED.  REMAINING TIRES WILL BE REPLACED BEFORE NEXT BLOWOUT, DUE TO SAFETY CONCERNS AND THE NUMEROUS BAD REVIEWS.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "02/25/2014",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627169,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I ORDERED AND PICKED UP MY HEARTLAND 2014 ,3110 CYCLONE FROM  FACTORY DEALER #001 IN ELHHARDT ,IN.  FEB,25,2014.  TOWED UNIT HOME 713 MILES WITH NO SNOW STORMS/ RAIN. PREPPED AND STOCKED UNIT FOR 1ST TRIP IN MARCH.  STARTED TO NOTICE LOTS OF RUST ALL OVER SUSPENSION AND CHASSIS AND COMPONENTS INCLUDING PROPANE GAS LINES. REPEATED EMAILS/PICTURES AND PHONE CONVERSATIONS WITH LIPPERT COMPONENTS WENT UNHEARD. THE FACTORY DENIES RUST. I'VE HAD TO POWER WASH /WIRE BRUSH, SCAPE AS MUCH RUST OFF AND PAINT AND UNDERCOAT. SEEMS TO BE SOME SORT  OF ELECTROLYSIS GOING ON ALSO. THE CHASSIS IS ALSO PRETTY  FLEXIBLE AS DOORS DO NOT CLOSE ON SLIGHT GRADE WITHOUT THE USE OF LEVELING JACKS. DISAPPOINTED IN THE WAY RV MANUFACTURES GO VASTLY UNREGULATED.   *TR",
        "vin": "5SFCG3820EE"
    }
]