[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/24/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458843,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "3 engine piston rings failed. Wife was driving the vehicle. Yes, verified and repaired by Honda of Fort Worth. Engine light flashing when misfiring and rough idle before pulling over. Also needed timing belt kit replaced.  2009-2013 Pilots had same problem and were part of a class action suit. Same 3 pistons that the VCM and ECO mode effects the operation of engine.",
        "vin": "5FNYF3H72EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449823,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "--What component or system failed or malfunctioned, and is it available for inspection upon request?  P0302 HONDA Code - Cylinder Number 2 Misfire Detected is the error. The vehicle is available for inspection upon request  Also, the; \"VTM-4\", stability, and \"check engine\" lights are all flashing   --How was your safety or the safety of others put at risk? Car will NOT exceed 20 mph and it shakes. With young kids in the car, this issue is extremely unpredictable and has occurred several times resulting in us having to pay out of pocket for a clear manufacturer defect. We've had to take the car to the mechanic 4 times in the last 3 years -- service records can be provided.   --Has the problem been reproduced or confirmed by a dealer or independent service center? Yes. There is a recall for the 2009-2013 models, but we have the 2014 and have been told by everyone (except the dealer) that this issue/year (2014) should be included in the recall.   --Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? Yes, as noted above, the following warning lamps lit... \"VTM-4\", stability, and \"check engine\" lights are all flashing  THE CONSUMER STATED THE VEHICLE WAS REPAIRED, BUT THE FAILURE PERSISTED. THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE.",
        "vin": "5FNYF4H59EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422792,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "As I was driving home during rush hour, I smelt an odd smell. I thought that it was coming from the vehicle next to me but that vehicle turned and the smell remained. I looked down at my dashboard and the OVER HEATING WARNING LIGHT WAS BRIGHT YELLOW-- I immediately pulled over into a parking lot with my 2 young kids, got them out of the car, and began to try and figure out what was going on. Thank goodness I didn't ignore this issue and that I was able to pull off of the road when I did. This could have been a very unsafe situation for myself, my kids, and other motorists.  Prior to this moment there were NO indicators of anything being wrong with the vehicle, there was absolutely no warning of what I am about to describe either. LUCKILY, my husband was nearby and able to pick us up.  There was a milky fluid leaking from underneath the car and when my husband opened the hood he said that oil and water had mixed--it looked like something had just exploded.  Needless to say I had to have the vehicle towed to a shop. After taking the engine out and sending parts off to a machinist it was determined that the front cylinder head had cracked and the rear cylinder head had to be resurfaced due to the damage.  Several mechanics have noted that there is NO REASONABLE EXPLINATION FOR THE CYLINDER HEAD TO CRACK before 200,000 miles. I had just purchased this vehicle in September 2020, it had 72,000 miles on it then. It currently has around 80,000 miles on it. I purchased this vehicle because I thought it would be a SAFE FAMILY VEHICLE but now I'm not comfortable driving it because I'm worried that it will \"blowup\" on me.  I contacted Honda Customer Service and they basically said that nothing can be done to assist me.  I have seen an identical scenario posted on here and was shocked by it as well--because I thought that my mechanic wrote it but alas it was someone with the same situation! There is obviously something faulty here and it should be repaired/replaced by Honda!",
        "vin": "5fnyf4h99eb"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/28/2021",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXTERIOR PAINT STARTED PEELING BY THE SUNROOF THEN THE HOOD AND NOW BY THE BACK WINDOW. I HAVE SEEN A LOT OF 2014 HONDA PILOTS TOURING SAME AS MINE ALSO PEELING THE SAME SO THAT MEANS THERE IS SOMETHING WRONG WITH THE PAINT. ITS NOT JUST MY HONDA. I REALLY THINK THIS SHOULD BE FIXED.",
        "vin": "5FNYF3H98EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "11/22/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404202,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE 2014 HONDA PILOT THAT HAD 68,072 MILES ON IT.  MY WIFE BELIEVED THAT THE AUTOMATIC TRANSMISSION FOR THE VEHICLE WAS PLACED PARK IN OUR DRIVEWAY.  ACCORDING TO THE HONDA OWNER'S MANUEL THERE IS A SAFETY FEATURE THAT PREVENTS THE IGNITION KEY FROM BEING REMOVED UNLESS THE VEHICLE IS IN PARK.  THE VEHICLE ROLLED BACK INTO A TREE CAUSING OVER $3,000.00 IN PROPERTY DAMAGE.  THIS EXACT SAME PROBLEM HAS OCCURRED IN THE PAST WITH THE HONDA PILOT (2003-2004) AND THE HONDA ODYSSEY (2003-2004) AND THE ACURA MDX (2003-2006) WHICH WERE THE SUBJECT OF A RECALL BY HONDA.  PLEASE SEE NHTSA ACTION NUMBER PE12026. THESE RECALLED VEHICLES AS WELL AS OUR 2014 HONDA PILOT ARE EQUIPPED WITH AN AUTOMATIC TRANSMISSION. THEY HAVE A SAFETY INTERLOCK SYSTEM THAT IS SUPPOSED TO PREVENT THE IGNITION KEY FROM BEING REMOVED FROM THE IGNITION UNLESS THE TRANSMISSION IS IN THE PARK POSITION. WHEN THE TRANSMISSION IS NOT IN PARK, THE VEHICLE MAY ROLL UNEXPECTEDLY INCREASING THE RISK OF A CRASH. THIS IS EXACTLY WHAT HAPPENED TO OUR 2014 HONDA PILOT. I CONTACTED HONDA AND THEY COULD HAVE CARED LESS ABOUT THIS PROBLEM EVEN THOUGH THE SAME PRODUCT DEFECT OBVIOUSLY EXISTS AGAIN IN THE NEW MODEL HONDA VEHICLES.  THIS PRODUCT DEFECT POSES A HIGH RISK OF DANGER AND HONDA SHOULD BE REQUIRED TO REMEDY THIS DEFECT.  I HAVE VIDEOS THAT DOCUMENT THIS DEFECT.",
        "vin": "5FNYF4H74EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397646,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT PEELING OFF  AND BUBBLING ON HOOD. IT'S A MANUFACTURE DEFECT. HONDA WILL NOT TAKE RESPONSIBILITY FOR THE HOOD.  I HAD THE ROOF (REPAINTED IN 2018)AND RIGHT PASSENGER DOOR PANEL (REPAINTED 2021) REPAINTED BECAUSE OF THE SAME PEELING PROBLEM SINCE IT'S ALL THE SAME ORIGINAL PAINT FROM WHEN WE BOUGHT IT NEW IN 2014.",
        "vin": "5FNYF4H94EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395149,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD BY HONDA TO FILE A COMPLAINT WITH NHTS A.  FOR THE PEALING PAINT ON MY HONDA.  AS I CAN SEE THIS IS NOT THE PLACE TO FILE SUCH A REPORT. BUT I AM DOING IT ANYWAY JUST SO YOU CAN SEE HOW RIDICULOUS HONDA IS.  THEY WILL ONLY COVER THE ROOF AND LIFT GATE. WHEN THERE ARE MANY OTHER PARTS OF THE VEHICLE THAT IS DOING THE SAME THING.  AND THEY REFUSE TO PAY.",
        "vin": "5FNYF4H90EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384350,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PAINT IS FLAKING. HONDA REFUSES TO FIX IT DUE TO MY VIN NUMBER NOT BEING PART OF THEIR WARRANTY EXTENSION. THIS IS WEIRD SINCE MY YEAR, MAKE, MODEL, AND PAINT COLOR MATCH THE WARRANTY EXTENSION BUT MY VIN DOES NOT.",
        "vin": "5FNYF3H57EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "11/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374752,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM 85,000 MILES ONWARD, HAD INTERMITENT MISFIRES ON #1 AND #2 CYLINDERS.    REPLACED BOTH PLUGS AND COILS ON THOSE CYLINDERS.     HOWEVER, INTERMITENT MISFIRES CONTINUED.   AT 105,000, TOOK VEHICLE FOR 100,000 MILE MAINTENENCE.     HONDA DEALER INFORMED ME THAT MY VEHICLE NEEDED NEW PISTON RINGS ON CYLINDER #1, #2 AND #3.     OIL WAS LEAKING PAST RINGS AND FOULING PLUGS.   A $2500 REPAIR!!      THIS ISSUE WAS ADMITTED AND CORRECTED AT NO CHARGE BY HONDA ON 2009 TO 2013 HONDA PILOTS.    OBVIOUSLY, THE ISSUE CONTINUED INTO 2014 AND SHOULD ALSO BE  COVERED.      NOTE:   I HAVE INVOICES FOR ABOVE REPAIRS..",
        "vin": "5FNYF4H40EB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11361198,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER REAR SEAT BELT ENDED UP AROUND 3 YEAR OLDS NECK AND EVERYTIME HE MOVED IT GOT TIGHTER AND TIGHTER. THE SEAT BELT ANCHOR IS NOT EASY TO DETACH INCASE THIS HAPPENS.WE ENDED UP UNBUCKLING HIM AND TURNING HIS WHOLE BODY TO GET IT OFF HIS NECK. BOTH 2ND AND 3RD ROW SEATS USE THIS KIND OF ANCHOR.",
        "vin": "5FNYF4H91EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351315,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKS IN TWO OF 4 PIRELLI SCORPION VERDE TIRES WERE DIAGNOSED BY MECHANIC AS PLY DELAMINATIONS CAUSING MULTIPLE PINHOLE LEAKS AND INDICATING A NEED FOR IMMEDIATE REPLACEMENT. I FOUND MULTIPLE REPORTS OF DESTRUCTIVE DELAMINATIONS IN SERVICE ON THE NHSTA SITE, BUT NO RECALL. TIRES ARE 235/60 R18, DATE CODES 4217 AND 4717 TOTAL MILEAGE UNKNOWN (IN PLACE WHEN VEHICLE PURCHASED USED, PURPORTEDLY NEW BUT MORE THAN A YEAR OLD BY DATE CODE, LESS THAN 20,000 MILES THAT I KNOW OF, PLENTY OF TREAD LEFT.) HAVE LEAKED SLOWLY FOR A WHILE, ASSUMED IT WAS VALVE STEM SEALS, ASKED MECHANIC TO LOOK AT IT. TIRES ARE PRESENTLY INTACT, LEAK SLOWLY WHETHER PARKED OR DRIVING ON STREETS OR HIGHWAYS, WILL BE REPLACED ASAP, BUT ARE OBVIOUSLY DEFECTIVE.",
        "vin": "5FNYF4H44EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338606,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS PEELING ON THE ROOF OF MY 2014 TAFFETA WHITE HONDA PILOT. I WAS TOLD THAT MY VIN NUMBER IS NOT ELIGIBLE FOR THE WARRANTY. I AM NOT SURE HOW SPECIFIC VIN NUMBERS BECOME ELIGIBLE FOR THE PAINT WARRANTY EXTENSIONS.",
        "vin": "5FNYF3H43EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327245,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON THE ROOF AND HOOD HAVE WORN TO A POINT WHERE THE COLOR HAS CHANGED TO WHITE.  IT LOOKS LIKE ALL OF THE CLEAR COAT AND BASE COLOR HAVE WORN OUT AND NOW SHOWING JUST THE PRIMARY OR WHATEVER IS USED TO PROTECT THE METAL AREA.   THERE IS CURRENTLY A RECALL FROM HONDA ON SEVERAL VEHICLES THAT LOOKS EXACTLY LIKE THE DAMAGE I AM DESCRIBING.  *TR",
        "vin": "5FNYF3H97EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/13/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317856,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 HONDA PILOT WHITE PAINT COLOR, PAINT PEELING FROM THE MIDDLE OF THE TOP OF WINDSHIELD TO SUNROOF.",
        "vin": "5FNYF3H51EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301314,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHITE PAINT PEELING OFF IN CHUNKS BETWEEN WINDSHIELD AND ROOF. NOTICED WHEN PARKED. DEALER SAID ITS NOT UNDER THE 2019 ISSUED EXTENDED WARRANTY FOR 2014 HONDA PILOTS PAINTED WHITE.",
        "vin": "5FNYF4H48EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298257,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT STARTED PEELING OFF OF HOOD AND BUBBLING ON ROOF. HONDA CERTIFIED COLLISION EXPERT SAY MANUFACTURE DEFECT. HONDA WILL NOT TAKE RESPONSIBILITY FOR THE HOOD. THEY WILL COVER THE COST TO REPLACE PAINTING ROOF BUT REFUSE TO REPAINT HOOD.  TERRIBLE CUSTOMER SERVICE WHEN YOU CALL CORPORATE. TOLD ME TO WAIT UNTIL ENOUGH COMPLAINTS COME IN AND THEN THEY MAY CONSIDER IT.",
        "vin": "5FNYF3H99EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2020",
        "dateOfIncident": "01/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297199,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSISTENT VIBRATION WHEN ECM ENGAGES CULMINATING IN ENGINE BUCKING ALONG WITH ENGINE LIGHT FLASHING    THIS OCCURRED ON RURAL ROAD AT 55MPH.  MECHANIC CHANGED OIL AND SPARK PLUGS WHICH SEEMED TO FIX THE PROBLEM.  TWO MONTHS LATER, ENGINE LIGHT ON AND ECM NOT ENGAGING AT ALL.  VTM LIGHT ON FOR A SHORT WHILE.  CODE INDICATES A CYLINDER PROBLEM. THIS WAA ALSO AT APPROX. 50MPH.  THE CODE IS AMBIGUOUS BUT SEEMS TO INDICATE MISFIRE OF SOME SORT.  RESEARCH SHOWS THIS TO BE A PERVASIVE PROBLEM WITH THIS MODEL.  WHY HAS THIS NOT BEEN RECALLED?",
        "vin": "5FNYF4H41EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291933,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PEARL WHITE 2014 HONDA PILOT TOURING THAT HAS HAD PAINT ISSUES THAT HONDA REFUSES TO FIX ON THE HOOD. I CAME OUTSIDE ONE DAY TO GET IN MY CAR AND NOTICED THAT PINT WAS PEELING. I TOOK THE VEHICLE IN TO THE LOCAL DEALERSHIP IN COLORADO SPRINGS, CO AND WAS DIRECTED BY THEM TO TAKE IT TO THEIR COLLISION CENTER TO HAVE THE PAINT TESTED. AFTER THE TEST, THE REPORT STATED THAT THE PAINT IS INDEED FACTORY PAINT AND THAT HONDA DIDN'T PUT ENOUGH PAINT ON THE VEHICLE. I WAS DIRECTED TO FILE A COMPLAINT WITH HONDA'S CORPORATE OFFICE AND WAS TOLD THAT ALTHOUGH THEY ACKNOWLEDGED THAT THIS ISN'T AN ISOLATED INCIDENT AND THAT IT HAS BEEN NATIONWIDE WITH THIS EXACT MODEL AND COLOR, THEY WILL NOT FIX THE PAINT UNLESS IT WAS ONLY ON THE ROOF OR TAILGATE. THIS IS NOT THE FIRST TIME THIS HAS HAPPENED WITH THIS CAR, AS I HAVE HAD THE PAINT REDONE ON THE ROOF IN 2017 WHEN I WAS STATIONED IN KILLEEN, TX. I DON'T CARE THAT THE VEHICLE HAS A DEFECT, I JUST WANT HONDA TO FIX THE ISSUE. SIMPLY ACKNOWLEDGING THAT THERE ISN'T ENOUGH PAINT IS NOT GOOD ENOUGH. WHEN A CUSTOMER PURCHASES A VEHICLE, THEY EXPECT THAT THE COMPANY HAS PROVIDED AN ADEQUATE PRODUCT THAT WILL LAST. SPENDING $45K ON A CAR, THEN HAVE THAT CARS PAINT BEGIN PEELING, ONLY TO BE TOLD THAT I HAVE TO PAY FOR THEIR MISTAKE IS NOT ONLY LUDICROUS BUT ASININE AS WELL.     I AM WANTING HONDA'S CORPORATE OFFICE TO ISSUE OUT AN UPDATED WARRANTY THAT COVERS THE ENTIRE VEHICLE FOR PAINT DEFECTS NATIONWIDE AND PAY TO FIX NOT JUST MY VEHICLE, BUT OTHERS AS WELL.",
        "vin": "5FNYF4H93EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243253,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM 30 YEARS EXPERIENCED AUTO MECHANIC AND RECENTLY EXPERIENCED MY ENGINE OIL PRESSURE WARNING LIGHT FLASHED IN MY 2014 HONDA PILOT WHILE DRIVING AND ENGINE OVERHEATED .  PULLED OVER THE VEHICLE AND FOUND OIL LEAKED COMPLETELY INTO THE COOLING SYSTEM AND RADIATOR RESERVOIR WAS FULL OF OIL/COOLANT.  I REMOVED BOTH SIDE CYLINDER HEADS, COULD NOT FIND ANY DAMAGES EITHER HEADS OR GASKETS. I HAD TO REPLACE THE MOTOR ASSEMBLY. I FOUND SAME CASES ONLINE AND ASKED THE HONDA FOR THIS CASE, HONDA DID NOT LET ME KNOW WHAT THEY KNOW.  VEHICLE WAS JUST PAID OFF AND HAS 82000 MILES ON IT.   THE VEHICLE HAS BEEN SERVICED PROPERLY SINCE DAY 1.",
        "vin": "5FNYF4H97EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241601,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2014 HONDA PILOT AND POTENTIALLY ALL OTHER YEARS WITH A SIMILAR DESIGN POSE AN UNREASONABLE SAFETY RISK TO OCCUPANTS SEATED IN THE THIRD ROW, AS THE REAR TAILGATE CANNOT BE OPENED FROM INSIDE OR OUTSIDE OF THE VEHICLE UNDER CERTAIN CIRCUMSTANCES.  TWO SPECIFIC SCENARIOS THAT SHOULD BE CONSIDERED BUT NOT LIMIT THE SCOPE OF THIS CONCERN INCLUDE THE FOLLOWING:      1) THE INTERIOR OF THE TAILGATE DOES NOT HAVE AN ACCESSIBLE HANDLE FOR OCCUPANTS SEATED IN THE THIRD ROW TO OPEN THE REAR HATCH AND EXIT THE VEHICLE IN A REASONABLE TIME FRAME IN THE EVENT OF A POWER LOSS.     2) ANY DOOR LOCK FAILURES ON THE SAME CIRCUIT AS THE TAILGATE WILL CAUSE THE REAR HATCH TO BECOME INOPERABLE AND NOT OPEN AS INTENDED.",
        "vin": "5FNYF4H4XEB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229822,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED IN A DRIVEWAY WITH THE VEHICLE RUNNING IN PARK.  I USED THE POWER LIFTGATE AND APPROACHED THE VEHICLE'S REAR STORAGE AREA.  THE LIFT SUPPORT FAILED TO FULLY LIFT THE TAILGATE AND I STRUCK MY HEAD ON THE TAILGATE AS I LEANED IN TO RETRIEVE SOMETHING FROM THE REAR AREA. IT BEEPED AS IF IT WAS OBSTRUCTED AND THE TAILGATE ATTEMPTED TO LIFT HIGHER BUT THEN BEGAN TO CLOSE WHILE CONTINUING TO BEEP.  ON SUBSEQUENT ATTEMPTS TO USE THE POWER LIFTGATE (WITHIN A FEW MINUTES), THE LIFT SUPPORT FAILED TO KEEP THE TAILGATE UP AND LIFTED THE TAILGATE PROGRESSIVELY SHORTER DISTANCES WITH EACH ATTEMPT.   THE REAR TAILGATE WAS EXTREMELY DIFFICULT TO OPEN BY HAND AND WOULD NOT STAY ELEVATED WITHOUT FULL SUPPORT.  BOTH LIFT SUPPORTS WERE REPLACED AT HOME.  THE DRIVER'S SIDE LIFT SUPPORT THAT WAS REMOVED HAS NO RESISTANCE OPENING OR CLOSING BY HAND. THE PASSENGER'S SIDE LIFT SUPPORT THAT WAS REMOVED STILL HAS RESISTANCE AND APPEARS TO HAVE BEEN FUNCTIONING. THERE WAS NO DIFFICULTY WITH THE LIFTGATE PRIOR TO THIS INCIDENT.",
        "vin": "5FNYF4H93EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222652,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHITE PAINT ON ROOF, TAILGATE, AND DOORS IS PEELING AWAY FROM PRIMER. HONDA HAS PREVIOUSLY REPAINTED THE HOOD AND TAILGATE DUE TO PEELING. THE DOOR STARTED PEELING THIS MONTH.",
        "vin": "5FNYF4H94EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205744,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 PILOT IS LEAKING WATER FROM SOMEWHERE ONTO THE FLOOR ON THE DRIVER'S SIDE. WE NOTICED IT WAS WET UNDER THE MAT ABOUT 2 YEARS AGO AND FIGURED WE JUST LEFT A WINDOW CRACKED, WHICH WE HAD NOT, BUT YESTERDAY AFTER A RAIN, THE FLOOR WAS SOAKED. YOU CAN LOOK UP UNDER THE STEERING WHEEL AND SEE SOME OLD MOLD DISCOLORATION AS WELL. I AM SURE THIS HAS BEEN HAPPENING EVERY TIME IT RAINS, BUT WE HAVEN'T NOTICED BECAUSE IT HAS AN ALL WEATHER MAT COVERING IT. AFTER DOING SOME RESEARCH, IT SEEMS THIS HAS BEEN A PROBLEM ON THE HONDA PILOTS SINCE AT LEAST 2004, SO IT IS ABSOLUTELY INFURIATING THAT THIS PROBLEM HAS NOT BEEN RESOLVED BY HONDA.",
        "vin": "5FNYF3H47EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204924,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME BACK HOME FROM DRIVING A FEW MILES TO FIND PAINT MISSING BETWEEN THE WINDSHIELD AND MOON ROOF OF OUR 2014 HONDA PILOT. I'VE TAKEN IT TO OUR LOCAL HONDA DEALERSHIP AND SERVICE CENTER WHICH HAS BEEN ANYTHING, BUT HELPFUL IN TRYING TO GET THIS REMEDIED.    THEY HAD ME TAKE IT TO THEIR SERVICE CENTER FOR A QUOTE WHICH THEY THEN SENT TO HONDA CORPORATE AND TOOK 6 WEEKS TO HEAR SOMETHING BACK. THEY'VE TOLD ME THEY'D COVER 70% OF THE COST TO REPAIR WHICH LEFT ME WITH A LITTLE OVER $550 +TAX TO COVER OUT OF MY OWN POCKET WHICH IS RIDICULOUS GIVEN THAT THIS IS OBVIOUSLY A PAINT DEFECT. MY CAR HAS VERY LOW MILEAGE (48K) AND FOR A LOT OF THE LIFE GARAGE KEPT.    BASICALLY SINCE IT FALLS OUTSIDE OF WARRANTY THEY WON'T COVER ALL OF IT IS WHAT I'M TOLD, WHICH I GET FOR MECHANICAL ISSUES THAT MAY ARISE, BUT NOT FOR WHAT'S OBVIOUSLY A DEFECT IN THEIR PAINTING.    I'VE REACHED BACK OUT TO THE SERVICE MANAGER ASKING FOR THE REGIONAL CORPORATE REPRESENTATIVE, BUT HAS NEVER REACHED BACK OUT.",
        "vin": "5FNYF3H9XEB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204474,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS STARTING TO PEEL ON VEHICLE.  STARTED ON ROOF OF CAR FROM THE SUNROOF DOWN TO THE WINDSHIELD.  PHOTO PROVIDED.  NOW THE PAINT IS PEELING ON FRONT FENDER AND ON HOOD OF CAR.",
        "vin": "5FNYF4H96EB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204485,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HONDA PILOT. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED AFTER THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 18V661000 (AIR BAGS). STEVE PADGETT'S DANVILLE HONDA (877-293-5660, LOCATED AT 4050 RIVERSIDE DR, DANVILLE, VA 24541) PERFORMED THE RECALL REPAIR. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER TO BE DIAGNOSED AND THE CONTACT WAS INFORMED THAT THE AIR BAG INDICATOR WAS NOT PART OF THE RECALL. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS NOT PROVIDED.",
        "vin": "5FNYF4H52EB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161146,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  UNFORTUNATELY, BEFORE THE RECALL BOTH AIRBAGS DEPLOYED.  THE PASSENGER SIDE EXPLODED LEAVING A BURN ON THE PASSENGERS LEG.  THE DRIVERS SIDE BAG ALSO EXPLODED AFTER DEPLOYMENT LEAVING A BURN ON THUMB OF RIGHT HAND OF DRIVER.  THE DEPLOYMENT WAS DUE TO ACCIDENT INVOLVING A DEER ON A STATE HIGHWAY.",
        "vin": "5FNYF4H71EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154021,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT TIRE RIMS ON MY 2014 HONDA PILOT HAVE HAD TO BE REPLACED DUE TO CRACKED RIMS. THE LEFT FRONT RIM HAS BEEN REPLACED TWICE. THE RIGHT FRONT IS NOW CRACKED. THIS CAR IS DRIVEN UNDER NORMAL CONDITIONS.  LEFT FRONT FIRST CRACK WAS IN 2017.  LEFT FRONT SECOND CRACK 13 MONTHS LATER. RIGHT FRONT CRACKED RIM NOV 2018.",
        "vin": "5FNYF3H28EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143637,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT PEELING FROM THE ROOF IN LARGE CHUNKS. SEEMS TO BE RELATED TO TSB APAS09282017903.",
        "vin": "5FNYF4H93EB"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "10/31/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140170,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, AMERICAN HONDA MOTOR COMPANY NEVER SENT TO ME ANY NOTIFICATION OF A   NATIONAL RECALL OF OR INJURY, DEATH OR DAMAGE BY THE TAKATA AIRBAG DEFECTIVE INFLATORS.  NO NOTICES WERE EVER SENT TO ME, AND NO TELEPHONE CALLS OF ANYKIND TO WARN ME.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "08/05/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132131,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD 3 CRACKS IN THE WHEEL OF THIS 2014 HONDA PILOT VEHICLE. OUR CAR IS GARAGED AT NIGHT AND IS DRIVEN TO WORK (PART TIME). THE FIRST WHEEL WENT BAD WITH A LEAKING CRACK ON 8/5/17, THE SECOND WHEEL HAD A CRACK FOUND ON 10/23/17, AND THE THIRD WHEEL WENT BAD WITH LEAKING CRACK ON 9/28/17. THREE OUT OF FOUR WHEELS WITH THE EXACT SAME PROBLEM. ALL THREE TIMES THE TIRE LIGHT INDICATED THE PROBLEM. I HAVE COMPLETE RECORDS INCLUDING DEALER RECEIPTS FOR ALL THREE INCIDENENCES. NEVER ONCE WERE WE OFFERED ANY TYPE OR RESTITUTION. THIS IS OBVIOUSLY A MANUFACTURER DEFECT THAT DESERVES THE FULL INVESTIGATION OF NHTSA. I WILL BE FOLLOWING UP WITH HONDA USA AND A SMALL CLAIMS SUIT AS NEEDED.",
        "vin": "5FNYF3H28EB"
    },
    {
        "components": "SUSPENSION,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WHEEL BEARINGS (LEFT AND RIGHT) WENT AT 60K MILES. SUNROOF NEEDED FULL REPLACEMENT AT 60K (RUST WAS EVIDENT INDICATING SIGNS OF ONGOING LEAK), ENGINE BUSHING NEEDED REPLACED AT 60K MILES. ALIGNMENT NEEDED BECAUSE ENGINE BUSHING AND WHEEL BEARING REPLACEMENT.",
        "vin": "5FNYF3H50EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128460,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY I HAD A PROBLEM WITH THE #2 CYLINDER PLUG FOULING IT HAPPENED AGAIN ON 7/25/18 & 1600 MILES LATER ON 9/8/18. ENGINE LIGHT COMES ON MECHANIC TOLD ME THAT IT'S A OIL SEAL PROBLEM. I SEE THAT THERE WAS A RECALL ON 2009-2013 PILOTS WHY NOT ON THE 2014?  SAME PROBLEM AS COMPLAINT #11122936 THERE IS OBVIOUSLY A PROBLEM WITH SOMETHING",
        "vin": "5FNYF4H74EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/09/2018",
        "dateOfIncident": "09/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128359,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING THIS VEHICLE WE HAVE HAD NUMEROUS RIMS CRACK ALONG THE WELDS. WE ARE AT OUR THIRD THAT WILL NEED TO BE REPLACED NOW. THE FIRST WAS REPLACED BY THE DEALER AT NO COST TO US, THE SECOND WE HAD TO PAY (DEALER COST) FOR THE RIM AND WERE TOLD IF IT HAPPENED AGAIN IT WOULD NO LONGER BE THEIR PROBLEM. I DRIVE IN NORMAL CONDITIONS, TO AND FROM MY KIDS SCHOOL(ROUND TRIP ON PAVED CITY STREETS 2 MILES) AND TO WORK (AGAIN ROUND TRIP ON CITY STREETS MAX 18 MILES). THE VEHICLE HAS NOT HIT ANY CURBS OR MAJOR POT HOLES ON ANY OF THESE OCCURRENCES. TODAY WHEN LEAVING FOR THE DAY WE HAD OUR TIRE PRESSURE LIGHT ON IN THE CAR. WE FILLED THE AIR AND WITHIN 3 HOURS IT WAS LIT UP AGAIN. ONCE WE ARRIVED HOME AND PARKED WE PLACED WATER ON THE WELD IN THE SAME SPOT AS THE LAST CRACK AND SURE ENOUGH IT IS LEAKING AT A CRACK IN THE WELD AGAIN. THIS IS NOT ONLY A HASSLE, BUT HAD THESE WHEELS FAILED CATASTROPHICALLY IT COULD BE FATAL FOR MY CHILD AND MY FAMILY. THE HONDA DEALER IN SANTA ROSA, CA HAS IMPLIED THAT IT IS MY DRIVING THAT HAS CAUSED THESE CRACKS. I HAVE BEEN ONLINE AND SEEN NUMEROUS COMPLAINTS ABOUT FAULTY WELDS ON THIS YEAR PILOT. THERE IS OBVIOUSLY AN ISSUE AND IT SHOULD BE INVESTIGATED AND RECALLED.",
        "vin": "5FNYF4H20EB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122936,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE AND VSA/VTM-4 LIGHTS APPEARED ON DASH. TOOK TO HONDA DEALER AND CODE RETURNED ISSUE WITH A MISFIRE IN CYLINDER #3 DUE TO A PISTON RING FAILURE. KNOWN ISSUE 2009-2013 HONDA PILOTS THAT RESULTED IN CLASS ACTION LAWSUIT. HONDA REPAIRED THOSE VEHICLES AT NO COST AND EXTENDED ENGINE WARRANTY. HONDA NOT WILLING TO DO THE SAME FOR A KNOWN ISSUE IN A 2014 VERSION.",
        "vin": "5FNYF4H53EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/18/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121729,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED RIMS  IT HAS HAPPEN TWICE",
        "vin": "5FNYF3H25EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "06/27/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119317,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HONDA PILOT 2014 HAS VIBRATION EVERY TIME I DRIVE THE CAR. I WORRY THAT IT WILL DAMAGE THE ENGINE. I THINK IT HAPPEN WHEN TRANSITION BETWEEN 3 CYLINDER AND 6 CYLINDER.  DRIVING BETWEEN 30 MPH TO 60 MPH. I DON'T THINK THE VARIABLE CYLINDER MANAGEMENT (VCM)  IS WORKING WELL AT ALL. HONDA PLEASE FIX THIS ISSUES.",
        "vin": "5FNYF4H27EB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2018",
        "dateOfIncident": "04/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088460,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  HI, I AM JUST TRYING TO FIND OUT IF MY AIRBAG NEEDS TO BE REPLACE SINCE IT MIGHT BE DEFECTED. I RECEIVED A LETTER ABOUT RECALL ON TAKATA AIRBAGS. WHEN I CALLED THE NUMBER PROVIDED, I WAS DIRECTED HERE. THANK YOU.",
        "vin": "5FNYF4H76EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066059,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPRESSED CONCERN WITH BOTH THE HONDA DEALER AND TO HONDA CORPORATE ABOUT THE INTERIOR FLAW IN MY VEHICLE. UNDER THE DRIVERS SEAT, THERE IS AN OPEN SPACE/GAP THAT ALLOWS ANYTHING THAT'S ON THE REAR FLOOR TO ROLL ACROSS AND BLOCK YOUR GAS AND BRAKE PEDAL.  I HAVE NEVER HAD THIS ISSUE WITH WITH ANY OTHER VEHICLE. I HAVE ALMOST GOTTEN INTO SEVERAL TRAFFIC ACCIDENTS BECAUSE OF THIS. THIS SHOULD BE CORRECTED BUT HONDA REFUSES TO ACKNOWLEDGE THAT THIS IS AN ISSUE AND THEY TELL ME NOT TO PUT ANYTHING ON THE FLOOR. WITH 3 KIDS SITTING IN THE BACK AND DRIVING TO PRACTICES EVERY DAY, IT'S HARD TO KEEP UP WITH ITEMS NOT BEING LEFT ON THE FLOOR. THIS IS NOT REASONABLE AND EVERYONE LEAVES ITEMS ON FLOOR. I AM EXPRESSING CONCERN BECAUSE I SHUTTLE MY 3 KIDS AROUND EVERYDAY AND I AM WORRIED ABOUT THEIR SAFETY AS WELL AS MINE. PLEASE HELP. THANK YOU.",
        "vin": "5FNYF3H52EB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "03/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061343,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA   RECALL.  HONDA STATES THAT  VEHICLE IS A SUBJECT FOR RECALL WHICH MEANS THAT IT HAS TAKATA AIR BAGS.!!!! MY COMPLAINT IS, UNTIL IT IS RECALLED, I CANNOT FEEL SAFE DRIVING IT!!!!PLEASE INVESTIGATE AND HELP!!!!!!!  THIS HAPPENED WHEN I BOUGHT THE CAR IN 2014 BUT I WAS NOT TOLD ABOUT POSSIBLY DEFECTIVE  AIR BAGS AT THATTIME EVEN THOUGH HONDA KNEW OF THE POSSIBILITY AT THAT TIME!!!!!!!!!!!",
        "vin": "5FNYF4H78EB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2017",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048847,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING OR DECELERATING FROM 40 MPH TO 60 MPH THE TRANSMISSION MAKES A HORRIBLE RUMBLING SOUND AND IT FEELS LIKE THE CAR WAS FORCED INTO A LOWER GEAR. THIS SEEMS RELATED TO THE 'ECO' MODE AND ONLY STARTED AFTER THE VEHICLE HAD 30,000 MILES ON IT. THE DEALERSHIP CALLED AMERICAN HONDA'S HEADQUARTERS BECAUSE THEY AGREED WITH THE COMPLAINT BUT WAS TOLD THIS IS 'NORMAL'. I CAN'T SELL THE CAR IN THIS CONDITION EVEN TO THE DEALERSHIP SO I'M STUCK UNLESS I PAY FOR A NEW TRANSMISSION.",
        "vin": "5FNYF4H98EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048243,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE RIMS ARE LEAKING AND I'VE TAKEN THEM TO HONDA ON MULTIPLE OCASIONES AND THE ONLY THING THEY'VE WOULD TELL ME IS THE IT NEEDED AIR IN THEM. WHEN I TOOK THE PILOT TO DISCOUNT TIRES FOR A TIRE REPAIR THEY ADVISE ME THAT IT WAS A RIM PROBLEM.",
        "vin": "5FNYF4H21EB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041718,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I MADE MY 3RD VISIT TO ANOTHER HONDA LOCATION ON 10/27/2017 AFTER HAVING ISSUES WITH THE VSA LIGHT AND CHECK ENGINE LIGHT RANDOMLY FLASHING ON AND OFF IN MY 2014 HONDA PILOT. THE FIRST TIME I'D TAKEN IT IN, (ROUGHLY 08/2017), I WAS TOLD IT WAS AN 'INTERMITTENT FAILURE' WHICH THEY WERE REQUIRED TO ADVISE ME ACCORDING TO HONDA'S 'WORKFLOW' THAT MUST BE FOLLOWED BEFORE ADDITIONAL TROUBLESHOOTING IS PERFORMED. I WAS TOLD TO LEAVE AND CONTINUE DRIVING THE VEHICLE. SHORTLY FOLLOWING, I EXPERIENCED THE SAME ISSUE. I VISITED ANOTHER LOCATION (09/2017) AND WAS TOLD THAT THE SOFTWARE WAS OUTDATED AND CAUSING THE ISSUE. THE SOFTWARE UPDATE WAS PERFORMED, BUT THE ISSUE STILL PERSISTED. MY FINAL VISIT, I SPOKE WITH THE MANAGER ON 10/27/17, I WAS TOLD THE YAW RATE SENSOR WAS 'BAD' AND NEEDED TO BE REPLACED. THE FIRST TIME I NOTICED THE ISSUE, I WAS DRIVING ON A SIDE ROAD AND ALL OF THE DASH LIGHTS BEGAN FLASHING RANDOMLY (VSA/CHECK ENGINE). I PARKED THE CAR AND CALLED THE DEALERSHIP. THE 2ND TIME, I WAS DRIVING ON THE INTERSTATE GOING ROUGHLY 65-70MPH WHEN THE ISSUE HAPPENED AND I BEGAN TO FEEL CHANGES IN THE ACCELERATION/BRAKING. I IMMEDIATELY MOVED TO GET IN A SLOW LANE TO AVOID BREAKING DOWN OR BEING HIT BY ANOTHER CAR FOLLOWING ME. THE LAST TIME FEW TIMES I HAVE NOTICED IT, THE VEHICLE HAS BEEN BOTH IN MOTION SEVERAL TIMES AND PARKED.",
        "vin": "5FNYF3H55EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "10/14/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033478,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO WAS PARKED AND STARTED THEN THE SMOKES WERE COMING OUT. THE RESULT WAS THE AIR CONDENSER/COMPRESSOR WAS DAMAGED AND NEED REPLACE.",
        "vin": "5FNYF4H2XEB"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022673,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS A SERIOUS SHAKING ISSUE WHEN BRAKING. THIS IS WELL DOCUMENTED AND HONDA HAS NOT RELEASED ANY RECALLS FOR THIS.     THIS CAR HAS A WELL KNOWN ISSUE WITH CONSUMING TOO MUCH OIL. MY CAR CONSUMES WAY TOO MUCH OIL WHICH ALSO CAUSES ISSUES WITH THE VARIABLE CYLINDER MANAGEMENT",
        "vin": "5FNYF4H95EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "3 OUT OF 4 STEEL WHEELS ON MY 2014 HONDA PILOT GOT A CRACK AND AN AIR LEAK ISSUE. THE VEHICLE HAS BEEN DRIVEN IN THE NORMAL CONDITIONS AND IT HAS NEVER HIT A CURVE OR ANYTHING. IT  OCCURRED ON THE FIRST WHEEL  ABOUT A YEAR AGO AND HONDA REPLACED IT UNDER WARRANTY AS THEY RECOGNIZED A WELDING ISSUE WHICH WAS CAUSING A CRACK AND LEAK INSIDE OF THE WHEEL. SECOND AND THIRD ONE OCCURRED BACK TO BACK IN A PAST COUPLE OF MONTHS. WHERE LEAKING WAS FOUND WAS EXACTLY SAME JOINT AREA INSIDE OF THE WHEEL WITH THE FIRST ONE AND I HAD TO REPLACE BOTH OF THEM. THIS DEFINITELY CONCERNS THE SAFETY ISSUE AS THE WHEELS ARE FALLING APART.",
        "vin": "5FNY3H2XEB0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "03/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991175,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HONDA PILOT. WHILE AT A STOP, THE VEHICLE FAILED TO ACCELERATE WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED. THE TECHNICIAN STATED THAT THE FAILURE WAS DUE TO THE CONTACT'S DRIVING STYLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE RECURRED RANDOMLY. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "5FNYF4H98EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/27/2017",
        "dateOfIncident": "02/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957387,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS PEELING OFF DOWN TO BARE METAL ON THE ROOF BETWEEN THE WINDSHIELD AND SUNROOF.",
        "vin": "5FNYF3H92EB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10935042,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A HUGE BUCK DEER RUN INTO THE DRIVERS SIDE OF THE VEHICLE AND THE DRIVERS SIDE AIR BAG DID NOT DEPLOY. THE PASSENGERS SIDE AIR BAG DID DEPLOY. THIS IS NOTED IN THE POLICE REPORT AND AT THE AUTO BODY SHOP WHERE VEHICLE WAS TOWED TO. THE VEHICLE WAS IN MOTION WHEN THE DEER HIT US. THE ESTIMATE TO THE INSURANCE COMPANY IS $9,000.00.",
        "vin": "5FNYF4H45EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928771,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL WELDS ARE FAULTY.  THE VEHICLE HAS BEEN DRIVEN UNDER NORMAL DRIVING CONDITIONS SINCE THE DATE OF PURCHASE.  HOWEVER, A HAIRLINE FRACTURE APPEARS IN THE WHEEL WELD CAUSING THE TIRE TO DEFLATE.  THE VEHICLE WAS ORIGINALLY PURCHASED IN JANUARY OF 2014 AND THREE WHEELS HAVE BEEN REPLACED TO DATE BECAUSE OF THIS ISSUE.  WHILE THIS IS OBVIOUSLY A MANUFACTURING DEFECT, MY CONCERN IS WITH CATASTROPHIC FAILURE OF THE WHEEL CAUSING UNNECESSARY INJURY OR FATALITY.  *TR",
        "vin": "5FNYF3H29EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "09/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903879,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD GASKET ON MY 2014 HONDA PILOT BLEW WITH ONLY 23,000 MILES ON THE VEHICLE.  NO WARNING LIGHTS APPEARED AND I AM WORRIED ABOUT A SAFETY ISSUE DESPITE THE REPAIRS BEING COVERED UNDER WARRANTY.  I GOT THE VEHICLE BRAND NEW AND SERVICE RECORDS ARE MAINTAINED AND UP TO DATE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897783,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING HER CAR, AND STARTED SMELLING GAS IN THE CAB OR THE CAR.  YOU COULD SMELL IT BOTH IN AND OUT OF THE CAR.  TOOK IT TO THE MECHANIC AND A FUEL LINE WAS CHEWED THROUGH, LEAKING GAS INTO THE ENGINE COMPARTMENT.  THE PART IS UNDERNEATH THE MANIFOLD, SO IT WILL HAVE TO BE PULLED TO REPLACE THE PART.  IT WILL BE AROUND $800 TO FIX.  THIS IS THE SECOND TIME WE HAVE HAD RODENT DAMAGE.  WE NEVER HAD A PROBLEM WITH OUR OLDER HONDA VEHICLES.",
        "vin": "5FNYF3H21EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "07/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886294,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 29,000 MILES (JULY 2015) THE RIGHT REAR TIRE RIM FAILED AT A WELD JOINT.  IT WAS REPLACED BY HONDA.   AT 35,400 MILES (APRIL 2016) ANOTHER RIM FAILED FOR THE SAME REASON.  AT 42,800 MILES (JULY 2016)  THE THIRD RIM FAILED DUE TO A BAD WELD JOINT.  BOTH SECOND AND THIRD RIMS WERE ALSO REPLACED BY HONDA.  HONDA REFUSED TO REPLACE THE REMAINING RIM, WHICH AT THE TIME WAS STILL FUNCTIONING, BUT STATISTICALLY WILL FAIL.  THEY DID NEGOTIATE AND AGREE TO SELL TO US A NEW RIM AT COST, AND PROVIDE THE MOUNTING OF THE TIRE.  ALL THREE RIM FAILURES WERE PRESUMABLY THE RESULT OF OVER-HEATED WELDING, WHICH PENETRATED THE RIM BARREL.  AFTER A RANDOM PERIOD OF TIME AND STRESS FLEXING FROM THE ROAD SURFACE, TINY AIR CHANNELS DEVELOPED THROUGH PARTS OF THE WELDING JOINT, ALLOWING AIR TO SLOWLY ESCAPE.  ALL THREE FAILURES WERE  NOTICED VIA THE TIRE PRESSURE SENSORS SENT TO THE FRONT PANEL INDICATOR.",
        "vin": "5FNYF4H2XEB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "06/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883344,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9-1-15 I TOOK MY CAR TO METRO HONDA IN MONTCLAIR BECAUSE MY TIRE WAS LEAKING AIR, IN WHICH IT WAS FOUND THAT MY HONDA FACTORY RIM WAS CRACKED AT THE POINT WHERE IT IS WELDED TOGETHER.  MY RIM WAS REPLACED WITH ANOTHER HONDA FACTORY RIM.  THEN ON 3-1-16 I TOOK MY CAR BACK TO METRO HONDA BECAUSE ANOTHER TIRE WAS LEAKING AIR, AND AGAIN IT WAS FOUND ANOTHER RIM (DIFFERENT FROM THE FIRST ONE) WAS CRACKED AT THE POINT WHERE IT IS WELDED TOGETHER.  I CALLED HONDA CORPORATION ASKING FOR FURTHER INSPECTION OF MY CAR TO ENSURE THE SAFETY OF THE RIMS.  HONDA CORPORATION REFUSED TO FURTHER INSPECT MY VEHICLE.  ON 6-28-16 MY TIRE WAS LEAKING AIR, AND AGAIN IT WAS FOUND THAT ANOTHER HONDA FACTORY RIM WAS CRACKED AT THE POINT WHERE IT WAS WELDED TOGETHER.  3 OUT OF MY 4 RIMS HAVE ALL CRACKED, CAUSING TIRE DAMAGE AND UNSAFE CONDITIONS FOR ME TO DRIVE.",
        "vin": "5FNYF3H26EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/04/2016",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872489,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILED A COMPLAINT IN FEBRUARY CONCERNING CRACKS IN THE WELDS ON THE RIM OF A WHEEL. 6/2/16, I HAD A SLOW LEAK IN A TIRE AND WHILE REPLACING THE TIRE, IT WAS DISCOVERED THAT THE RIM HAD FORMED A CRACK IN THE WELD. I ENDED UP PURCHASING A RIM AT MY OWN EXPENSE TO REPLACE THE FIRST RIM (THE DEALER HAS REFUSED TO ACKNOWLEDGE ANY RESPONSIBILITY FOR EITHER RIM). I LIVE ON A DIRT ROAD, BUT HAVE NOT HIT ANY POTHOLES, CURBS OR ANYTHING ELSE THAT SEEMED A POSSIBLE CAUSE OF THE CRACKS. IN FACT, SINCE THE INCIDENT WITH THE FIRST RIM, I HAVE BEEN EXTREMELY CAUTIOUS ABOUT POT HOLES, RAIL ROAD CROSSINGS, MY SPEED ON DIRT ROADS ETC.",
        "vin": "5FNYF3H27EB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/24/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM STARTED WHEN MY PILOT REACHED 15K MILES. WHEN DRIVING I CAN FEEL THE ENGINE VIBRATE WHEN ACCELERATE AROUND 35 -45 RPM SPEED. I DID SOME RESEARCHES ONLINE AND A LOT OF PEOPLE HAVING THE SIMILAR PROBLEM ( WHEN ECO/VCM KICKS IN CAR VIBRATES) IT HAS SOMETHING TO DO WITH THE TRANSITION FROM 3 CYLINDERS TO 6 CYLINDERS.  I HOPE THAT HONDA DO SOMETHING ABOUT THIS. I DON'T FEEL SAFE WHEN THE VIBRATION KICKS IN WHEN DRIVING; FELT LIKE THE ENGINE WOULD EXPLODE KINDA SCARY FEELING. ALSO IF TOO MUCH VIBRATION, IT WOULD REDUCE THE LIFE THE ENGINE. PLEASE HELP US ON THIS ISSUES.",
        "vin": "5FNYF4H27EB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "03/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861277,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HONDA PILOT. WHILE DRIVING 60 MPH, THE VEHICLE SHOOK AND THE BRAKES FAILED TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE ROTORS WERE WARPED AND NEEDED TO BE REPLACED. THE VEHICLE WAS OUT OF ALIGNMENT. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/17/2016",
        "dateOfIncident": "04/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10860782,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 17, 2016 AT 3.30 PM WHILE FORWARD PARKING MY VEHICLE, I EXPERIENCED A SUDDEN UNCONTROLLED ACCELERATION, RESULTING IN THE VEHICLE IMPACTING THE WALL IN FRONT OF MY PARKING SPOT. THE WALL WAS APX. 20 FT FROM THE CAR AT THE TIME OF THIS INCIDENT. I HAD MY FOOT ON THE BRAKE DURING THE LATER STAGES OF THE PARKING MANEUVER AND SPEED WAS MINIMAL <5 KM/H). BEFORE COMING TO A STANDSTILL, THE ENGINE SPRUNG TO MAXIMUM RPM WITHOUT ME EVER TOUCHING THE ACCELERATOR. I DIDN'T HAVE TIME TO CONTROL IT AND THE BRAKES WERE ALSO INEFFECTIVE. UPON IMPACT THE DRIVER FRONT AIRBAG DEPLOYED AND THE HORN STARTED. I SWITCHED OFF THE ENGINE AND REMOVED THE KEYS. SEVERAL WITNESSES CAME FORWARD FOR ASSISTANCE, POLICE, AMBULANCE AND FIRE DEPARTMENT WERE ON SITE. A POLICE REPORT WAS FILED. THIS INCIDENT IS VERY CONCERNING; PEOPLE COULD HAVE BEEN SERIOUSLY INJURED HAD THIS HAPPENED IN ANOTHER LOCATION OR IF PASSERSBY WHERE PRESENT.",
        "vin": "5FNYF4H52EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "03/17/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850991,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER A PERIOD OF TIME FROM JAN 2016 TO THE PRESENT, I HAVE HAD ISSUES WITH FLAT TIRES TOOK TO TIRE SHOP THEY DETERMINED IT WAS A CRACK IN THE WELD OF THE RIM FRONT PASSENGER TIRE.  DEALERSHIP REPLACED THE RIM. THEN A MONTH LATER DIFFERENT TIRE SAME ISSUE CRACK IN THE WELD OF THE REAR PASSENGER RIM.  DEALERSHIP NOW HAS THAT RIM ON ORDER THEY ARE GOING TO REPLACE.  BOTH WERE LOCATED IN THE ORIGINAL FACTORY WELD.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845792,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 HONDA PILOT BOUGHT FROM DEALER IN 12/2015 WITH 18,000 MILES ON ODOMETER.  VEHICLE ROLLED DOWN OUR DRIVEWAY WHILE TRANSMISSION WAS IN \"PARK\".   THIS WAS AN UNCONTROLLED RUN-AWAY VEHICLE.  DRIVEWAY IS TYPICAL SUBURBAN DRIVEWAY, SLIGHT GRADE, NOTHING OUT OF THE ORDINARY.  NO OTHER VEHICLE HAS EVER ROLLED DOWN OUR DRIVEWAY, EVER. THE 2014 HONDA PILOT ROLLED ON TWO DIFFERENT OCCASIONS BEFORE WE CONTACTED THE DEALER IN 01/2016. IT ROLLED AN ESTIMATED DISTANCE OF 18 FEET BEFORE COMING TO A REST PARTIALLY BLOCKING A PUBLIC ROADWAY.  DEALER REPLACED TRANSMISSION UNDER WARRANTY.  WHILE THAT WORK WAS BEING PREFORMED, THE LOANER CAR, ANOTHER 2014 HONDA PILOT, ALSO ROLLED DOWN THE DRIVEWAY. OUR VEHICLE WAS RETURNED WITH THE NEW TRANSMISSION AND HAS SINCE ROLLED ON TWO ADDITIONAL OCCASIONS.  THE MOST RECENT ON 3/2/16 WAS CAPTURED ON VIDEO TO DOCUMENT VEHICLE IN \"PARK\" AND ROLLING DOWN OUR TYPICAL SUBURBAN DRIVEWAY.  WE CONTACTED DEALER AGAIN.  DEALER NOW STATES NOTHING MORE CAN BE DONE AND TO \"JUST USE PARKING BRAKE\".  WE GET THAT, THAT IS GOOD GENERAL ADVICE HOWEVER THIS VEHICLE REPRESENTS A SAFETY HAZARD AND A LEVEL OF POTENTIAL LIABILITY TO US AS OWNERS THAT IS NOT ACCEPTABLE.  THIS RUN AWAY VEHICLE COULD DAMAGE OTHER'S PROPERTY OR INJURE OR KILL A PERSON.  WE ARE DISTRAUGHT ABOUT THIS AND DON'T KNOW WHAT TO DO.",
        "vin": "5FNYF4H52EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/29/2016",
        "dateOfIncident": "02/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838951,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER A PERIOD OF TIME FROM 2/14/16 UNTIL 2/29/16, I HAVE HAD ISSUES WITH FLAT TIRES DUE TO CRACKS IN THE WELD OF A RIM. ONE WAS DISCOVERED AND I HAD IT REPAIRED. ON THE 29TH, WHILE HAVING ANOTHER FLAT CHECKED, TWO MORE CRACKS WERE DISCOVERED ON THE SAME RIM, BUT IN A DIFFERENT LOCATION THAN THE ORIGINAL CRACK. ALL THREE WERE LOCATED IN THE ORIGINAL FACTORY WELD.",
        "vin": "5FNYF3H27EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/07/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824703,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS INCIDENT OCCURRED ON FEB. 5, 2016.  SUDDEN UNEXPECTED ACCELERATION.  THE CAR WAS PULLING INTO A PARKING SPACE AT VERY SLOW SPEED WITH THE RIGHT FOOT ON THE BRAKE.  THE ENGINE BEGAN TO RACE AND THE CAR LURCHED FORWARD.  I WAS ABLE TO STOP IT BY SHIFTING INTO NEUTRAL AND TURNING THE ENGINE OFF. TWO VERY SIMILAR OCCURRENCES OCCURRED WITH A 2012 HONDA PILOT APPROXIMATELY TWO YEARS AGO. THESE WERE REPORTED TO THE NHTSA.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2016",
        "dateOfIncident": "08/21/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824352,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 PILOT PURCHASED NEW DEC 2013. AT 14,000 MILES THESE ISSUES BEGAN IN AUGUST AND CONTINUE AT PRESENT (JAN 2016) WITH 17,000 MILES. THESE ISSUES ARE PRESENT WHILE DRIVING & IDLING. AIR CONDITIONING SYSTEM: FRONT UNIT WILL NOT COOL PROPERLY ON HOT/HUMID DAYS WITH TEMPERATURES BETWEEN 65-90 DESPITE DUAL CONTROLS SET AS LOW AS 65. CHECKED AT DEALERSHIP AND COULD NOT REPLICATE, GAUGES PLACED AT VENTS IN CABIN READ CORRECTLY WITH CONTROL DIAL SETTING.   DEALERSHIP ADVISED THEY HAVE HAD NUMEROUS COMPLAINTS FOR THIS SAME ISSUE AND THEY TELL OWNERS TO TURN THE NUMERIC TEMP CONTROL DIAL AS LOW AS THEY POSSIBLY  CAN TURN IT TO COOL PROPERLY. NOT SURE IF THIS A MANUFACTURING ISSUE OR NOT. REAR UNIT AC: FAN ON HIGHEST AND NEXT TO HIGHEST SETTING CUTS IN AND OUT, NOT COMPLETELY OFF, BUT NOTICEABLY CYCLES DOWN THEN BACK TO THE FULL BLOWING POWER FOR THAT SETTING. DOES NOT MATTER IF SETTING IS FOR ALL FACE, FACE/FEET, ETC. DOES NOT HAPPEN WITH HEAT ON, ONLY AC. DEALERSHIP COULD NOT REPLICATE. ASKED BY DEALERSHIP TO CONTINUE TO WATCH AND USE AND IF CONTINUES TO BRING BACK IN.  WARRANTY EXPIRES ON 2014 PILOT IN  DEC 2016.",
        "vin": "5FNYF4H7XEB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "01/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10822274,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NO DEPLOYMENT OF AIRBAG UPON HEAD-ON COLLISION. FITCHBURG MASS.POLICE CRASH REPORT # 16-1706-AC.  DRIVER CAME INTO MY LANE OF TRAFFIC AND STRUCK FRONT END OF MY VEHICLE.",
        "vin": "5FNYF4H50DB"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/12/2015",
        "dateOfIncident": "08/18/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809857,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIMMIES, SHAKES, VIBRATES WHEN BRAKING AND PULLS TO THE LEFT. HAD 26,000 MILE ON VEHICLE. BROUGHT TO DEALERSHIP AND THEY SAID IT COULD BE DUE TO BREAKING, CAR WASHES, AND WEATHER. ROSTERS WERE RESURFACED AT MY EXPENSE. NOW VEHICLE HAS 38,000 MILES ON IT WITH THE SAME PROBLEM. DEALERSHIP SAYS IT'S MY FAULT. ALL MILES ARE HIGHWAY AND VEHICLE IS GARAGED AT HOME AND DURING THE DAY AT THE OFFICE.",
        "vin": "5FNYF4H56EB"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788230,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN NOTICING THAT WHEN I BRAKE MY VEHICLE SHAKES - TOOK IT IN TO HAVE THE BRAKES DONE AND THE DEALERSHIP TOLD ME THAT MY BRAKES LOOKED BRAND NEW AND WANTED TO SEND ME ON MY WAY. I ASKED WELL WHY IS IT SHAKING THEN AND I WAS TOLD THAT MAYBE THE ROATERS NEEDED MACHINING A $207 SERVICE. THIS WAS AFTER THEY DID NOT BOTHER TO CALL ME TO TELL ME MY VEHICLE WAS READY I JUST HAPPENED TO SHOW UP AN HOUR AFTER MY SCHEDULED APPT TIME SO MACHINING MY ROATERS WOULD HAVE BEEN ANOTHER HOUR TO 2 HOUR WAIT. (NOT HAPPY) SO I LEFT AND I AM STILL DEALING WITH THE VIBRATION. I ALSO NOTICED WITHIN THE PAST WEEK AFTER HAVING TO DRIVE IN HEAVY RAINFALL THAT WHEN GOING ABOVE 45 MPH I HYDROPLANE BADLY - TO THE POINT WHERE I ALMOST HIT A CONCRETE BARRIER ON THE HIGHWAY. THE PUDDLE OF WATER WAS NOT, IN MY OPINION, LARGE ENOUGH TO HAVE CREATED SUCH HYDROPLANING, NEITHER WAS MY SPEED. ENDED UP DRIVING MY HUSBANDS JEEP UNTIL THE RAIN SUBSIDED BECAUSE NOW I'M SCARED OF DRIVING MY CAR IN THE RAIN. I DON'T HAVE DOCUMENTATION FOR THE \"REPAIR\" BECAUSE THEY LITERALLY DIDN'T EVEN TAG MY VEHICLE. I WILL BE TAKING IT BACK THIS WEEKEND CONSIDERING I AM NOT THE ONLY PERSON HAVING THIS ISSUE APPARENTLY.",
        "vin": "5FNYF3H51EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/27/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786574,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIMMIES, SHAKES, VIBRATES WHEN BRAKING AND PULLS TO THE LEFT. HAD 26,000 MILE ON VEHICLE. BROUGHT TO DEALERSHIP AND THEY SAID IT COULD BE DUE TO BREAKING, CAR WASHES, AND WEATHER. ROSTERS WERE RESURFACED AT MY EXPENSE. NOW VEHICLE HAS 38,000 MILES ON IT WITH THE SAME PROBLEM. DEALERSHIP SAYS IT'S MY FAULT. ALL MILES ARE HIGHWAY AND VEHICLE IS GARAGED AT HOME AND DURING THE DAY AT THE OFFICE. DID NOT NEED TO REPLACE ROATERS ON ANY PREVIOUSLY OWNED SUV'S FOR 75,000 MILES.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785204,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN RAINING AT ABOUT 55 TO 60 MPH VEHICLE HYDROPLANES. I HAVE OTHER FAMILY MEMBERS THAT OWN THE SAME VEHICLE HAVING SAME PROBLEM.",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/11/2015",
        "dateOfIncident": "10/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748000,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUES:  1 - STEERING CONSTANTLY VIBRATES AT SPEEDS ABOVE 45MPH. SMOOTH ROADS HIGHER VIBRATIONS. THIS VIBRATION INCREASES TO EXTENT THAT YOU FEEL THAT YOU ARE LOOSING CONTROL OF THE CAR AT SPEED ABOVE 70MPH AND YOU CAN SEE THE STEERING VIBRATING. SO EFFECTIVELY, YOU CANT DRIVE YOU CAR BEYOND 70MPH.   2 - TRANSMISSION SHUTTERS AT CRUISING SPEED ABOVE 35MPH AND SEARCHES FOR GEARS WHILE GOING DOWN HILL.  3 - SUDDEN BURNING SMELLS IN THE CABIN TO AN EXTENT OF AIR BECOMING TOXIC INSIDE CABIN.    HONDA REPLACED MULTIPLE PARTS BUT NO RESULT AND PROBLEM HAS BECOME WORSE. FINALLY HONDA DOES NOT WANT TO RECOGNIZE THAT THERE IS MAJOR ISSUE SO ARE WASHING OFF THERE HAND BY SAYING THAT IT IS VCM VIBRATION. THE POINT  THAT VMC VIBRATION CAN NOT BE CONSTANT AND THOSE OCCUR ONLY WHEN THERE TRANSITION FROM 3 CYLINDERS TO 6 CYLINDER OR 6 TO 3.     THE VEHICLE IS UNDER WARRANTY AS OF NOW BUT ONCE IT GOES OUT OF WARRANTY, HONDA WOULD NEVER CARE FOR IT.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "08/30/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717522,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PUT MY CAR IN PARK, IT WAS STILL RUNNING, I REACHED IN AND TURNED THE KEY OFF AND THE CAR IMMEDIATELY STARTED TO ROLL.  I ATTEMPTED TO GET IN THE CAR TO BRAKE, BUT WAS UNABLE TO DO THIS AND THEN WAS THROWN AWAY FROM THE VVEHICLE, HITTING MY HEAD ON MY ROCK DRIVEWAY.  THERE WAS A SLIGHT INCLINE WHERE I PARKED BUT WHEN IT STARTED TO ROLL IT REACHED A STEEPER INCLINE AND ROLLED DOWN MY DRIVEWAY AND HIT A TREE WHICH CAUSED THE DAMAGE.   I HAD TO HAVE IT TOWED TO THE DEALERSHIP---WHERE THEY FOUND NO REASON FOR THE RUNNAWAY ISSUE??   I THEN CALLED HONDA AND WAS TREATED BADLY, BUT THEY CONFESSED THAT THERE WAS NO WAY OF TESTING FOR THIS ISSUE.  I FOUND THAT IN THE PAST YEARS THERE WAS A ISSUE \"RUNAWAY\" VEHICLES------BUT THEY WOULD NOT ACKNOWLEDE THIS AS A POSSIBLE CONTINUING PROBLEM??  IF ANYONE HAS HAD THIS SAME PROBLEM, WOULD LIKE TO KNOW.",
        "vin": "5FNYF4H56EB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706076,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND MY SON SAW A CRACK APPEAR IN THE WINDSHIELD. NOTHING HAD STRUCK THE WINDSHIELD OR ANY THE ROAD WAS SMOOTH. THE CRACK CONTINUED TO GROW UNTIL IT WAS ALMOST ALL THE WAY DOWN THE WINDSHIELD. THE DEALER EXAMINED THE GLASS THE NEXT DAY AND COULD NOT FIND ANY MARKS OR PITS ON THE GLASS.  *TR",
        "vin": "5FNYF3H51EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2015",
        "dateOfIncident": "03/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702719,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MAJOR ELECTRICAL MALFUNCTION, MOST OF THE DASH ELECTRONICS WON'T WORK. THE REAR HATCH IS LOCKED AND CANNOT BE OPENED. NO A/C AND NO GAUGES OPERATING. MAJOR DISAPPOINTMENT FOR A 2014 HONDA PILOT TOURING EDITION WITH ONLY 6000 MILES. HOPE THE LOCAL HONDA DEALERSHIP FIXES IT TOMORROW 3/31/15.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/14/2015",
        "dateOfIncident": "03/12/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10694254,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE 2ND ROW CENTER SEAT BELT, WHICH STORES ON THE CEILING, WAS RELEASED, IT SNAPPED UP AND STRUCK THE CHILD SITTING IN THE LEFT 2ND ROW SEAT IN A BOOSTER SEAT ON THE RIGHT UPPER CHEEK CAUSING AN ABRASION AND MANY TEARS.  THE CHILD WAS SITTING AND STILL BELTED INTO THE BOOSTER SEAT.  THE INJURY WASN'T SEVERE BUT COULD HAVE BEEN IF IT HAD STRUCK THE EYE OR CAUSED A LACERATION.  *TR",
        "vin": "5FNYF3H54EB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "03/05/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692362,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED MY HONDA PILOT INTO MY DRIVEWAY THAT ONLY HAS A SLIGHT GRADE. I PUT THE VEHICLE INTO PARK AND SHUT IF OFF, EXITED THE VEHICLE AND LOCKED THE DOORS. WHILE STANDING IN MY DRIVEWAY WITH MY SON, WE BOTH SAW THE PILOT ROLLING BACKWARDS SLOWLY (NOT SLIDING). THE TIRES WERE ACTUALLY TURNING. I RAN TO THE DRIVERS DOOR, OPENED THE VEHICLE, JUMPED IN AND APPLIED THE BRAKES. I STARTED THE CAR TO MAKE SURE THE CAR WAS SHOWING IT WAS IN PARK, AND IT WAS. I NOW HAVE MY TIRES CHOCKED WITH BRICKS UNTIL I CAN GET IT TO THE DEALER.  *TR",
        "vin": "5FNYF4HH48E"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684242,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HONDA PILOT. WHILE DRIVING AT AN UNKNOWN SPEED, THE TIRES, SEATS, AND REAR OF THE VEHICLE VIBRATED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN REPLACED THE TIRES AND PERFORMED AN ALIGNMENT; HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 5,500.....UPDATED 04/23/15 *BF ..UPDATED 05/07/15 *BF  ...UPDATED 06/03/15 *BF..UPDATED 06-16-15 *BF   UPDATED 9/20/2017*CN",
        "vin": "5FNYF3H29EB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/13/2015",
        "dateOfIncident": "10/09/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672215,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 HONDA PILOT. WHILE DRIVING APPROXIMATELY 5-10 MPH, THE BRAKE PEDAL WAS DEPRESSED AND TRAVELED TO THE FLOORBOARD. AS A RESULT, THE CONTACT HAD TO PUMP THE BRAKE PEDAL AND APPLY THE EMERGENCY BRAKE IN ORDER TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE MASTER CYLINDER AND THE CALIPER NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 4,342. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "08/31/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662110,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS WHAT IS DISCRIBED AS \"RUN AWAY VEHICLE\"    THE CAR WAS IN PARK, AS THE IGNITION WAS TURNED OFF IT STARTED ROLLING, TOOK OUT A TREE WHICH CAUSED THE VEHICLE DAMAGE.  I WAS THROWN FROM THE VEHICLE SO IT PROCEEDED DOWN THE DRIVEWAY WITHOUT A PERSON IN THE CAR.     *JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660659,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPROACHING A STOP LIGHT,VEHICLE FAILS TO STOP, EVEN WITH FOOT FIRMLY ON THE BRAKE. (AS IF THE ACCELERATOR AND BRAKE WERE APPLIED SIMULTANEOUSLY)  ENGINE SPEED DOES NOT FALL BELOW APPROXIMATELY 2,000 RPM.",
        "vin": "5FNYF3H26EB"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638191,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOMLY, WHILE DRIVING THE FASTEN SEATBELT ICON ILLUMINATES. ALL OCCUPANTS OF THE CAR WERE RESTRAINED AND NO OBJECTS WERE PLACED ON THE SEATS. THE RIGHT FRONT PASSENGER AIRBAG \"OFF\" INDICATOR LIGHT ALSO ACTIVATED. WHEN THE CAR WAS TAKEN TO THE DEALER AND THE PROBLEM COULD NOT BE REPLICATED. SO NO FURTHER INVESTIGATION WAS DONE. IT IS UNDETERMINED IF THIS WOULD AFFECT THE FUNCTIONALITY OF THE AIRBAG SYSTEM.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "07/13/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637663,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW HONDA PILOT-NAVI 2014 ON JULY 3 2014. 1 WEEK AFTER THE PURCHASE THERE WAS A MAJOR WATER LEAK INSIDE THE NEW 2014 VEHICLE!.. WATER WAS LEAKING INSIDE FROM A BIG RAIN STORM AND I DO HAVE A VIDEO AND PICS TO SHOW YOU. THE NEXT DAY SPACE COAST HONDA WAS CALLED WHERE I PURCHASED THE NEW 2014 TO GET FIXED. THE SERVICE DIRECTOR SAID THAT I OPENED THE MOONROOF WHICH IS NOT TRUE!. HE THEN TOLD ME LEAVE THE VEHICLE AT THE DEALERSHIP FOR A TECHNICIAN TO LOOK WHERE THE WATER WAS COMING FROM. THE HONDA DEALERSHIP OFFERED ME A LOANER AT THERE COST FOR THE DAY. THE SAME DAY THE HONDA WAS TAKEN THERE I WAS CALLED AROUND 5 PM TO COME PICK UP THE NEW HONDA. THE SERVICE DIRECTOR TOLD ME HE REPLACED THE WINDSHIELD AND HEADLINER INSIDE AND TOOK ALL THE WATER OUT FROM THE LEAKING RAIN STORM!!.. I DID NOT GET A COPY OF THE SERVICE RECORD AND WAS TOLD I HAVE 3 YEARS OR 36,000 MILES WARRANTY. 2 DAYS LATER IT WAS TAKEN BACK FOR MORE REPAIRS! THE NEW 2014 WAS STALLING OUT,ENGINE HESITATING,RIDING RUFF,ENGINE FAN KEEPS RUNNING,DRIVERS DOOR LIGHT NOT WORKING AND PULLING TO THE RIGHT!.. AGAIN THE SERVICE DIRECTOR TRIED TO FIX THE PROBLEM AND FAILED!.. I HAVE CALLED AMERICAN HONDA MOTOR CORP IN CALIFORNIA AND TOLD THEM THE PROBLEMS!. THEY TOLD ME GO IN MY HONDA PILOT HANDBOOK AND FILL OUT THE FORM FOR CONSUMER AFFAIRS!.. THIS NEW HONDA HAS MANY ISSUES AND NO 1 WANTS TO HELP OR TAKE RESPONSIBILITY TO GIVE ME A NEW 2014 HONDA OR REFUND. AUGUST 28 2014 IT WAS TAKEN TO SPACE COAST HONDA AGAIN FOR THE WATER LEAK AND STALLING OUT!..   *TR",
        "vin": "5FNYF3H73EB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637675,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 HONDA PILOT EX-L HAS A MULTI MAJOR ISSUES. STARTING WITH A MAJOR WATER LEAK INSIDE THE PASSENGER COMPARTMENT. VEHICLE STALLING IN THE MIDDLE OF A LEFT HAND TURN DURING THE RAIN. HESITATION IN THE MOTOR WHEN TRAVELING AT 45 MPH. THIS OCCURS ALL THE TIME WHEN DRIVING. LUNGING FORWARD WHILE THE BRAKE IS ENGAGED. PULLING TO THE RIGHT, THE VEHICLE SHOULD BE IN ALIGNMENT. THIS HAS BEEN GOING ON SINCE THE DAY OF PURCHASE. WHINING IN THE POWER STEERING NO MATTER WHICH WAY YOU ARE TURNING. LIFTERS ARE TAPPING UNDER THE HOOD. THE LIST GOES ON. TRIED TO HAVE THESE ISSUES ADDRESSED AT THE DEALERSHIP AND ALL I GOT WAS THERE IS NOTHING WRONG WITH THE PILOT. IT RUNS THE WAY IT SHOULD. AND NOW THEY WILL NOT EVEN LOOK AT THE VEHICLE AS THEY TOLD ME TO NEVER BRING IT BACK TO THEIR DEALERSHIP. I DO NOT FEEL SAFE DRIVING THIS PILOT, I LOVED MY 2012 PILOT.  *TR",
        "vin": "5FNYF3H73EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610709,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HONDA PILOT.  THE CONTACT STATED THAT THE WHEN ACTIVATING THE BRAKES, THE VEHICLE FAILED TO STOP. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNABLE TO BE DUPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 13,000.",
        "vin": "5FNYF3H26EB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "03/30/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576271,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LEASED BRAND NEW PILOT LX ON MARCH 15, 2014. IT APPEARED TO BE IN PERFECT WORKING CONDITION. THEN, SUDDENLY ON 3/30/14 WHILE DRIVING HOME, IT LOST ABOUT 80 PERCENT OF ITS BRAKES. TO STOP IT, YOU MUST HAVE FOOT TO FLOOR ON BRAKES. IF THIS HAD BEEN AN EMERGENCY STOP, THERE COULD HAVE BEEN AN ACCIDENT. TAKING IT TO DEALER ON 4/2/14  TO SEE WHAT THE PROBLEM MAY BE.  *TR",
        "vin": "5FNYF4H28EB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "01/31/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575919,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO INCIDENTS OF SUDDEN UNINTENDED ACCELERATION.  THE FIRST ON JANUARY 31, 2014, THE SECOND ON MARCH 25, 2014.  BOTH INCIDENTS OCCURRED AT A VERY SLOW RATE OF SPEED OF APPROXIMATELY FIVE MILES PER HOUR.  IN BOTH SITUATIONS THE CAR WAS COMING TO A STOP WITH THE BRAKE BEING APPLIED.  SUDDENLY, THE RPMS INCREASED AND THE CAR SUDDENLY MOVED FORWARD WITH THE BREAK UNABLE TO STOP THE CAR EVEN THOUGH BOTH FEET WERE APPLIED TO THE BRAKE PEDDLE.  THE CAR WAS STOPPED BY PUTTING THE GEAR SHIFT INTO NEUTRAL AND TURNING OFF THE ENGINE. THIS HAS BEEN REPORTED TO HONDA OF AMERICA AS WELL AS TO THE LOCAL HONDA DEALER.  THE CAR WAS BROUGHT TO THE DEALER TWO TIMES, BUT THE DEALER UNABLE TO DIAGNOSE THE PROBLEM.  HONDA OF AMERICA (800 999-1009) HAS OPENED A CASE NUMBER WHICH IS: N012014-03-2600701.  THIS IS A POTENTIALLY VERY DANGEROUS SITUATION.  UPDATED 06/04/14",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2014",
        "dateOfIncident": "03/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CRUISING IN MY 2014 HONDA PILOT EX-L AT ABOUT 60 MPH ON RELATIVELY FLAT TERRAIN, THERE IS A LOW FREQUENCY VIBRATION AND RUMBLE.  I BELIEVE THIS IS DUE TO THE VCM FEATURE OF THE ENGINE.  IT IS POSSIBLE THIS COULD GET WORSE AND CAUSE SOME ENGINE DAMAGE.  *TR",
        "vin": "5FNYF4H55EB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560599,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "45 MILES ON A BRAND NEW 2014 PILOT EX-L  THE IGNITION DOES NOT ENGAGED CONSISTENTLY.  WHEN YOU TURN THE KEY AND THE ENGINE CRANKS, IT DOES NOT TURN OVER, RATHER IT CONTINUES TO MAKE CRANKING SOUND, EVEN WHEN KEY GOES BACK TO RUN/ON POSITION.    YOU NEED TO TURN KEY OFF TO GET CRANKING TO STOP.     50 MILES ON BARAND NEW 2014 PILOT EX-L  A CONTINUOUS CLICKING SOUND COMES FROM THE STEERING COLUMN WHEN MAKING A LEFT HAND TURN.  IT DOES IT WHEN YOU TURN RIGHT, BUT MORE PREDOMINANT WHEN TURNING LEFT.    FROM ONSET - THE DRIVER'S SIDE DOOR DOES NOT OPEN AND CLOSE SMOOTHLY - THOUGHT AT FIRST IT WAS JUST THE HINGE CATCHING, FURTHER INSPECTION DEMONSTRATES THE LEFT FRONT FENDER AND DRIVER'S DOOR SEEM IS NOT UNIFORM. THEREFORE THE BOTTOM OF THE FENDER AND DRIVER'S SIDE DOOR ARE RUBBING AGAINST EACH OTHER AND PAINT IS RUBBING OFF.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2013",
        "dateOfIncident": "12/09/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556767,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PILOT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VARIABLE CYLINDER MANAGEMENT KICKS IN AT 2000 RPM THE ENGINE VIBRATES.  IT DOES THIS CONSTANTLY WHEN THE ECO GREEN LIGHT COMES ON.  VERY DISTRACTING AND ANNOYING.  ALSO IS A PROBLEM IN MY SISTERS 2013 PILOTS.  DEALER KNEW IT WAS A PROBLEM BUT WOULD NOT DISCLOSE UNTIL AFTER I PURCHASED THE CAR.  *TR",
        "vin": "5FNYF4H52EB"
    }
]