[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458478,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Which vehicles this affects:  2011-2016 Hyundai Equus. All trim levels. This affects every Hyundai Equus, as all headlights are identical throughout all model years and trims.   I am the administrator for the Facebook group of this car, and am part of the automotive lighting industry. I can confirm that everyone I’ve asked (several hundred people) have experienced this issue. I have owned 3 of these vehicles, all different model years, and can also confirm each vehicle had this issue.  What happened:  I came within inches of hitting a pedestrian crossing the road because the distance vision my headlights are supposed to offer has effectively been eliminated. My reaction time is now greatly reduced as I can no longer identify hazards beyond 38ft in front of my car using low beams.   Why did this happen: The reflective coating on the bowl of the HID low beam projector is incapable of handling the UV/heat emitted by the stock HID bulb, and burns off.  Complaints similar to this that resulted in recall:  This is identical to what happened with the Acura RLX LED headlights, in which they had to issue a recall.  Things I’d like to add: This is not a normal “wear and tear” item. The reflective coating of the headlight is THE most important part of the headlight, as without it the light can not be formed into a beam whatsoever. It is not a user serviceable item, nor is it accessible for repair. The entire headlight must be replaced, and the brand new headlight has the same issue. My headlights now only provide enough light to show me things up to 38 feet away, even while being aimed properly. This is a critical failure that has no viable solution without NHTSA’s intervention.  Image of the problem:  I have attached an image of the reflector bowl to show how the critical reflective coating has nearly entirely burnt off. For reference, the bowl shown in the photo SHOULD have a completely mirror finish. I have also attached their response to my report.",
        "vin": "KMHGH4JH6EU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458481,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlight provides inadequate lighting, car not in compliance with FMVSS 108. Caused by the reflector bowl in the low beam HID projector losing its reflective coating. Heat/UV emitted by the bulbs burns it off. Visibility reduced to 38 feet. Happens on all years/trims. No known repair. Replacement headlight assemblies also affected.",
        "vin": "KMHGH4JH6EU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439082,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ECS malfunction ADAS malfunction Car rides rough and unstable steering control Several dealerships have reviewed and replaced rear air shocks and compressor with no resolution  No response from manufacturer about problem Creates very unsafe driving conditions ECS malfunction warning appears sometimes not always",
        "vin": "KMHGH4JHXEU"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424809,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Car is equipped with an air bag suspension system. There was a failure with the airbags around 18 months ( in 2016) of the car being put in service.  I was driving on a hway at 70 mph w/grandkids in the car when the airgbags failed and the nose of the car immediately went down and the car started to veer.  Luckily there was no other cars around me and I was able to slow down and pull off the hway. Coincidentally, I was just a mile from the dealership and immediately took the car to them and they gave me loaner car and took it in to repair under warranty. Approximately 18 months later, the air bags failed again and the car was just past warranty so I paid for the repair but contacted Hyundai and they reimbursed me.Hyundai told me they had problems with the design of the airbags and redesigned it which is what my car was then equipped with. The air bag system has failed twice more since then. The most recent incident caused many problems with the car.  The air bag system had a leak and caused the compressor to keep filling them. I don't believe this compressor was built to be in use so much and caused my battery and alternator to fail, then the compressor itself finally failed.  All this took place because of the faulty suspension air bag system. I believe Hyundai was negligent in not issuing a recall when the airbags originally failed back in 2016 as it could have led to a bad accident. I went on line and found many chat rooms with people having had the same or similar experiences to me.  Hyundai is well aware of the problems with the system yet has chosen to ignore it and hope the problem goes away.  Because of all the problems with this suspension, they have since done away with it and gone to a standard suspension system on all  the newer cars that are similar to mine ( now Genisis). They need to do something for all the older cars still on the road with this old suspension.  The date listed below is for the last incident mentioned in this document.",
        "vin": "kmhgh4jh7eu"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413145,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HYUNDAI EQUUS HAS AIR SHOCK ISSUES NOT RAISING AN LOWERING TO PROPER HEIGHT HYUNDAI FORUMS ONLINE HAS MULTIPLE COMPLAINTS ON THIS ISSUE. ISSUES 2 SUBPAR PAINT USED ON VEHICLE PAINT HAS FADED AWAY ON HOOD AND TRUNK AREA HAVE ANOTHER OLDER 2007 HYUNDAI AZERA WHERE THE PAINT LUSTER STILL SHINES ALL OVER VEHICLE. THERE ARE MULTIPLE COMPLAINTS LIST GONE HYUNDAI FORUM FOR PAINT ISSUES TO.",
        "vin": "KMHGH4JH2EU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "08/23/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352946,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER HEADREST SPLIT OPEN SPONTANEOUSLY. THERE WAS NO EXTERNAL IMPACT OR CRASH. THERE WAS NO PUSHING/PULLING OR OTHER PRECEDING INCIDENT TO CAUSE THIS. IT APPEARS THAT THE INTERNAL PLASTIC PART OF THE HEADREST FAILED.",
        "vin": "KMHGH4JH0EU"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/02/2019",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277697,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STRUTS WENT OUT WHILE I WAS DRIVING.  AFTER IT WENT OUT THE, TIRES WOULD TOUCH THE FENDER OF THE CAR. IT DAMAGED THE PASSENGER SIDE AND DRIVER SIDE OF MY FRONT FENDER. IT ALSO RUBBED THE TREAD AWAY FROM THE TIRE DUE TO RUBBING AGAINST THE FENDER. IT WAS NOT SAFE TO DRIVE BECAUSE IT WAS SO LOW TO THE GROUND THAT I ALMOST TORE THE FRONT FENDER OFF.",
        "vin": "KMHGH4JH4EU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269083,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTS ACCELERATING ON ITS OWN AFTER LONG HIGHWAY DRIVES ONCE CRUISE CONTROL IS DISENGAGED.  MESSAGE APPEARS 'SERVICE ENGINE IMMEDIATELY. VEHICLE SPEED LIMITED DUE TO MALFUNCTION' WHEN IN FACT VEHICLE CONTINUES TO ACCELERATE.  PLACING CAR IN 'PARK' CAUSES ENGINE TO REV OUT OF CONTROL. RESTARTING THE CAR DOES NOT SOLVE THE PROBLEM.  THIS HAS HAPPENED TO ME FOUR TIMES IN THE PAST SIX MONTHS, ONLY AFTER DRIVING APPROXIMATELY 3 1/2 HOURS.  I'VE READ NEARLY IDENTICAL DESCRIPTIONS ONLINE.  DEALER HAS TO 'REPRODUCE' THE PROBLEM, DOES NOT ACCEPT VIDEOS, AND YET THIS IS ONLY HAPPENED AFTER A LONG DRIVES.",
        "vin": "KMHGH4JH4EU"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231361,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. THE CAR HAS ABOUT 48000 MILES.   1) WHEN DRIVING AT HIGHWAY SPEED, BRAKE SELF APPLIES FORCEFULLY AT TIMES WHEN PASSING OR BEING PASSED BY OTHER VEHICLES ON THE ADJACENT LANES ON BOTH SIDES, ALMOST CREATING REAR-END COLLISIONS ON A FEW OCCASIONS.   2) WHEN RESETTING THE CRUISE CONTROL TO THE PREVIOUS SETTING, IT CONTINUES TO ACCELERATE PAST PREVIOUS SETTING (OVER 100 MPH) UNTIL BEING MANUALLY DISENGAGED. 3) AT TIMES, AT HIGHWAY OR LOCAL SPEED, THE ENGINE WOULD CUT OFF BRIEFLY WHILE SHOWING A QUICKLY FLASHED MESSAGE, THEN ENGINE WOULD POWER-UP AGAIN A FEW SECONDS LATER FOR NORMAL DRIVING.   4) TOOK THE CAR TO THE DEALERSHIP AND ADVISED THAT MOISTURE INSIDE THE RIGHT REAR TAIL LIGHT HOUSING WAS THE CAUSE FOR THE ELECTRICAL PROBLEMS. THIS VEHICLE HAS NEVER BEEN IN AN ACCIDENT OR DAMAGED AND ACCORDING TO MANY MECHANICS I HAVE CONSULTED, THE FISSURE ON TAIL LIGHT HOUSING IS PROBABLY DUE TO POOR WORKMANSHIP FROM THE FACTORY. DEALER COST FOR THIS REPAIR, $1800.00.  THE DASHBOARD COVER IS LIFTING OFF (GETTING UNGLUED) FROM ITS BASE DUE TO THE FLORIDA HEAT. COST FOR REPAIR, MORE THAN $4,000.   DUE TO THE INCESSANT NUMBER OF DAILY ROBOCALLS, PLEASE CONTACT BY PHONE TEXT OR EMAIL. THANK YOU",
        "vin": "KMHGH4JH5EU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2019",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172301,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SPORADICALLY IN WET OR DAMP CONDITIONS THE CAR ON STARTUP MY REV PAST 5000 RPM AND WILL NOT STOP. TOUCH ACCELERATOR WITH NOT CHANGE, MUST TURN OFF AND RESTART SEVERAL TIMES. CAR WILL ALSO WHILE IN MOTION DISPLAY \"SERVICE ENGINE IMMEDIATELY VEHICLE SPEED LIMITED DUE TO MALFUNCTION. SPEED IS NOT LIMITED THE CAR WILL ACCELERATE ON IT'S OWN. HIT BRAKES AND RELEASE AND ACCELERATION WILL REOCCUR. CAN SET CRUISE CONTROL IN THIS SITUATION AND CAR WILL ACCELERATE PAST SETTINGS UNTIL AND ERROR APPEARS DISABLING CRUISE CONTROL AND CAR WILL KEEP ACCELERATING UNTIL I HIT THE BRAKES ONCE RELEASED CAR WILL SPEED UP AGAIN. ONLY WAY TO STOP IS TURN THE CAR OFF AND ON SEVERAL TIMES. THE HAVE BEEN MULTIPLE TIMES, HAS HAPPENED DURING RUSH HOUR ON HIGHWAY, SIDE STREETS ETC. I HAVE HAD THE VEHICLE IN 2 TIMES AND DEALERS STATES THERE ARE NO CODES IN THE ONBOARD COMPUTER. THE DEALER HAS HAD THE VEHICLE BUT CODE NOT RECREATE. DEALER HAD THE VEHICLE IN A SNOW BUT DID NOT WANT TO DRIVE IT SINCE BAD ROAD CONDITIONS BUT THIS IS WHEN IT USUALLY HAPPENS AND HAD SAFETY CONCERNS. CONTACTED HYUNDAI AND CUSTOMER SERVICE STATED THEY WILL NOT HELP ME UNLESS TECH CAN RECREATE THE EXACT ISSUE EVEN THOUGH I HAVE VIDEO AND IMAGES.  DEALERSHIP TECHS HAD A REAL CONCERN ESPECIALLY AFTER I SHARED MY VIDEOS.",
        "vin": "KMHGH4JHXEU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163381,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ON THE CAR WILL GO TOTALLY OFF FOR TWO/THREE SECONDS.  IT DOES NOT OCCUR EVERYTIME I DRIVE AT NIGHT BUT HAS HAPPENED 3 TIMES IN THE PAST TWO WEEKS.  I HAVE HAD IT INTO THE DEALERSHIP AND THEY SAY THEY CANNOT FIX IT UNLESS IT HAPPENS WHILE THEY ARE DRIVING THE CAR.  LUCKILY IT HAS OCCURRED WHILE I WAS DRIVING ONLY AT 30 MPH ON A LOW VOLUME ROAD.  I DO NOT WANT TO HAVE THIS HAPPEN WHEN I MIGHT BE DRIVING ON AN EXPRESSWAY AT 70 MPH.  I SEE FROM FORUMS THAT THIS HAS HAPPENED TO OTHER OWNERS AND WANT TO SEE WHAT COULD BE DONE TO REMEDY THE SITUATION BEFORE I END UP IN AN ACCIDENT.  THERE WAS NO PARTICULAR WAY OF DRIVING THAT BROUGHT THIS ON, IE TURNING, DRIVING STRAIGHT OR STOPPING.",
        "vin": "KMHGH4JH0EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110780,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE - CAR HAS 32K MILES; NEVER HAD ANY WARNING LIGHT APPEAR ON THE DASH; OUT OF NO WHERE DEVELOPED A KNOCKING NOISE. THE CAR WAS SITTING FOR APPROXIMATELY 2 WEEKS AND ONCE STARTED AND DRIVING A KNOCKING NOISE STARTED APPROXIMATELY 5 MINUTES INTO MY DRIVE; THEREFORE I BROUGHT IT IMMEDIATELY TO THE DEALER.  NEW ENGINE IS NEEDED DUE TO EXCESSIVE SLUDGE BUILD UP AND OIL BLEEDING INTO THE ENGINE AND TIMING CHAIN.  MANUFACTURER STATED IT'S NOT COVERED UNDER WARRANTY.  A LOCAL MECHANIC SHOP TOLD ME THIS HAS BEEN NOTED IN A COUPLE OTHER SAME MODELS THAT CAME THROUGH THEIR SHOP ALTHOUGH THOSE OWNERS TRADED THE CAR IN TO GET OUT OF THE SITUATION THEY WERE IN.  OIL WAS CHANGED IN ACCORDANCE WITH THE MANUFACTURERS SPECIFICATION ALTHOUGH NOT THROUGH A DEALER SINCE I DON'T LIVE CLOSE TO A DEALER.  IF THE MANUFACTURER REQUIRES IT TO BE CHANGED OR MAINTAINED THROUGH A DEALER, THAT SHOULD BE DOCUMENTED IN THE OWNERS MANUAL.  THIS MANUFACTURER SEEMS TO HAVE A LOT OF ISSUES WITH ENGINE FAILURES.  THIS COULD HAVE POTENTIALLY CAUSED THE CAR TO STALL IN THE MIDDLE OF A BUSY HIGHWAY POTENTIALLY CAUSING TO HARM TO PEOPLE IN MY CAR OR CAUSE A SERIOUS ACCIDENT.",
        "vin": "KMHGC4DH8EU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2018",
        "dateOfIncident": "12/24/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074892,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE DOORS OF THIS CAR HAVE AN INTERMITTENT PROBLEM WHERE THEY WILL NOT OPEN, THIS HAS OCCURRED WHEN THE CAR IS PARKED.  THE DOORS ARE UNLOCKED YET WHEN PULLING ON THE DOOR HANDLE OF THE EFFECTED DOORS THE DOORS DO NOT OPEN AND APPEAR TO BE LOCKED HOWEVER THEY ARE NOT.  THIS AFFECTS THE PASSENGER SIDE FRONT AND REAR DOORS BUT THE PROBLEM IS INTERMITTENT .  THE SAME DOORS WHEN TRYING TO CLOSE THEM BOUNCE RIGHT BACK OPEN THE WILL NOT LATCH; EVENTUALLY THE DOOR WILL CLOSE BUT IT COULD TAKE AN HOUR OF TRYING TO SLAM THE DOOR.   THERE MUST BE A PROBLEM WITH SOME SORT OF SENSOR.   THIS SEEMS TO BE A SAFETY ISSUE, HOWEVER WHEN I BROUGHT THE CAR TO A HYUNDAI DEALER I WAS TOLD THERE IS NO PROBLEM MAYBE THE DOOR WAS FROZEN.  THIS PROBLEM HAS OCCURRED WHEN THE TEMPERATURE IS WELL  ABOVE  FREEZING AS I EXPLAINED BUT THEY DISMISSED IT..  I CALLED HYUNDAI AND LOGGED A COMPLAINT BUT THEY TOLD ME ITS NOT THEIR PROBLEM GO TO A HYUNDAI DEALER.  I AM CONCERNED FOR THE SAFETY OF MY FAMILY USING THIS CAR, IF THERE IS AN ACCIDENT OR EMERGENCY THEY COULD BECOME TRAPPED INSIDE THE CAR; I THINK HYUNDAI SHOULD BE REQUIRED TO INSPECT THE CAR FURTHER.  THIS CAR HAS ONLY 21,000 MILES ON IT.  I HAVE TAKEN VIDEO OF THE PROBLEM HOWEVER I AM TRYING TO COMPRESS THE VIDEO FILE SO I CAN ATTACH IT",
        "vin": "KMHGH4JH3EU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/15/2016",
        "dateOfIncident": "10/20/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836244,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HINGES FOR THE REAR SEAT FLIP-UP ARMREST BROKE WHEN I SAT IN THE BACK SEAT. THIS ARMREST IS ALSO THE COVER FOR THE SMALL STORAGE COMPARTMENT UNDER IT.  NOW THERE'S NO COVER ON THE COMPARTMENT AND NO PLACE FOR REAR PASSENGERS TO PUT THEIR ELBOWS.  THE HINGES ARE ONLY PLASTIC, BUT HYUNDAI WON'T ALLOW THE DEALER TO FIX IT UNDER WARRANTY.",
        "vin": "KMHGH4JH1EU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621680,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANT TO NOTIFY YOU ABOUT A SAFETY ISSUE REGARDING THE FRONT PASSENGER SEAT OF THE 2014 HYUNDAI EQUUS ULTRA.   WHEN THE BACK SEAT PASSENGER PUSHES THE RECLINE BUTTON ON THE RIGHT REAR PASSENGER SEAT CONTROLS, THE FRONT SEAT STARTS TO COLLAPSE.  WHAT HAPPENS IS THE FRONT PASSENGER SEAT STARTS TO MOVE FORWARD WITH THE BACK OF THE SEAT MOVING IN A COLLAPSING MOTION PINNING THE FRONT SEAT PASSENGER AGAINST THE DASHBOARD.  THERE SHOULD BE A SAFETY SWITCH THAT DEACTIVATES THE RECLINE CONTROL OF THE BACK SEAT WHEN SOMEONE IS SITTING IN THE FRONT PASSENGER SEAT.  PLEASE TAKE IMMEDIATE ACTION TO HAVE HYUNDAI CORRECT THIS PROBLEM BEFORE SOMEONE SUFFERS SERIOUS INJURY.  *TR",
        "vin": "KMHGH4JH7EU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568446,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "EQUUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE E-MAIL THAT I SENT TO HYUNDAI TO NOTIFY THEM OF A SERIOUS SAFETY ISSUE W. THEIR NEW EQUUS:  I WANTED TO ALERT YOU ABOUT A POTENTIALLY SEVERE SAFETY ISSUE THAT HAPPENED TO OCCUR WHILE MY 13 YR OLD SON & I WERE EXAMINING THE EQUUS AT THE CHARLOTTE AUTOSHOW.  I WAS SITTING IN THE DRIVER SEAT, MY SON WAS SITTING IN THE PASSENGER SEAT & ANOTHER COUPLE, WHO WE DID NOT KNOW, WERE IN THE BACK SEAT CHECKING OUT THE ELECTRONIC CONTROLS.  SUDDENLY, THE PASSENGER SEAT STARTED TO MOVE FORWARD & AT THE SAME TIME THE SEAT BACK BEGAN TO FOLD FORWARD.  MY SON SHOUTED OUT THAT THE SEAT WAS MOVING, BUT NEITHER HE NOR I WERE TOUCHING ANY OF THE CONTROLS.  THE COUPLE IN BACK NOTICED THIS, BUT CONTINUED TO EXAMINE/TRY THE CONTROLS ON THE REAR SEAT CENTER ARM REST.  MY SON SITTING IN THE PASSENGER SEAT, WHICH HAD NOW MOVED COMPLETELY FORWARD, WITH THE SEAT BACK STILL CONTINUING TO MOVE, COULD NOT REACH THE DOOR HANDLE TO ESCAPE.  WITHIN A FEW SECONDS HE BECAME PINNED AGAINST THE DASH BOARD & WAS CRUSHED BETWEEN THE SEAT BACK & THE DASH.  I YELLED OUT FOR EVERYONE TO STOP TOUCHING BUTTONS IMMEDIATELY, WHILE I ALSO TRIED TO MOVE THE SEAT TOWARD THE REAR USING THE BUTTONS ON THE TOP/SIDE OF THE PASSENGER SEAT.  THE SEAT STOPPED MOVING FORWARD & I WAS THEN ABLE TO MOVE IT REARWARD, FREEING MY SON.  HE WAS GASPING FOR AIR AT THE POINT & ANOTHER AUTO SHOW ATTENDEE OPENED THE DOOR FROM THE OUTSIDE, ALLOWING MY SON TO ESCAPE.  I CALLED ONE OF THE HYUNDAI SHOW REPS OVER TO THE CAR TO POINT OUT THIS SAFETY ISSUE & HE TOOK NOTE.  THE ROOT CAUSE WAS THE REAR SEAT COUPLE WAS TRYING TO ADJUST THEIR SEATS, BUT THEY WERE UNKNOWINGLY USING THE CONTROL THAT MOVES THE PASSENGER SEAT FORWARD FOR MORE REAR LEG ROOM.  THERE APPEARS TO BE NO SAFETY SENSOR THAT PREVENTS THIS.  THERE SHOULD BE A SAFETY SWITCH, USING THE FRONT PASSENGER WEIGHT TO DEACTIVATE THE REAR SEAT CONTROLS FOR THE FRONT PASSENGER SEAT.",
        "vin": ""
    }
]