[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954110,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL....   I RECEIVED THE RECALL NOTICE BY US MAIL AND THE DATE ON THE LETTER WAS MARCH 2016.  IT IS NOW FEB ALMOST MARCH 2017, 1 YEAR LATER AND EVERY TIME I GO TO THE DEALER TO HAVE THIS CORRECTED.  THEY STATE TO ME THAT I HAVE TO WAIT TILL I GET A LETTER IN MAIL SAYING THAT THE PARTS ARE IN AND I CAN BRING MY CAR IN FOR REPAIR. IT HAS BEEN A YEAR!  REALLY, I COULD HAVE DIED BY NOW BECAUSE OF THIS RECALL AND NO ONE SEEMS TO CARE ABOUT THIS...   I FEEL THIS IS A LAW SUIT WAITING TO HAPPEN AND BELIEVE ME, I HAVE LEFT MY FAMILY INSTRUCTIONS FOR JUST THAT IF I AM IN AN ACCIDENT AND AIRBAG IS DEPLOYED AND I DIE.   THIS IS COMPLETELY UNACCEPTABLE WHEN IT COMES TO PEOPLES SAFETY, YOU HAVE RECALLED THE ITEM ASSOCIATED WITH THE VEHICLE AND THEN YOU CANT FIX IT????    SO WHEN DO I HEAR ABOUT MY PARTS BEING IN AND THIS GETTING FIXED, HOPEFULLY IT IS BEFORE I DIE BECAUSE OF IT!   I WOULD LIKE TO KNOW!   I HAVEN'T HEARD A THING SINCE I GOT THE FIRST NOTICE AND ALL THE DEALER SAYS IS THAT I HAVE TO WAIT. WAIT FOR WHAT, ME TO DIE BECAUSE OF IT?    PLEASE DO YOUR JOB AND FIX THE CAR!",
        "vin": "JHMZE2H563S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934779,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I RECEIVED A LETTER DATED MARCH 2016 AND WAS TOLD THAT THIS RECALL WOULD BE TAKEN CARE OF IN THE SUMMER OF 2016.  I WAS ALSO TOLD THAT ALTERNATIVE TRANSPORTATION COULD BE PROVIDED BUT THAT I WOULD HAVE TO PAY OUT OF POCKET FOR THE RENTAL AND BE REIMBURSED. I WOULD BE BROKE BY NOW AND STILL WAITING TO BE CONTACTED TO HAVE MY VEHICLE SERVICED. WHEN ARE THESE VEHICLES GOING TO BE CORRECTED? WHY HAVE ALL THE OTHER GAS HOG POPULAR CARS BEEN DONE ALREADY?  WHY AM I STILL DRIVING A DEATHTRAP?  *TR",
        "vin": "JHMZE2H76ES"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2016",
        "dateOfIncident": "11/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924472,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS RECALL NOT COMPLETED.",
        "vin": "JHMZE2H30ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852584,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  ON APRIL 5, 2016, IT WILL BE 60 DAYS SINCE I LEFT MY CAR AT THE DEALERSHIP FOR THE TAKATA REPAIR.",
        "vin": "JHMZE2H32ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "01/06/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670549,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "INSIGHT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST ONE DAY AFTER DRIVING THIS NEW VEHICLE HOME I GOT ON THE HIGHWAY AND FOUND THE DRIVER'S SIDE VIEW MIRROR TILTED AT ANY ANGLE SO FAR I COULDN'T SEE ANY CAR ON THE HIGHWAY WITH IT..  THE ELECTRICAL CONTROLS TO WORK THE MIRROR DID NOT HAVE RANGE ENOUGH TO CORRECT IT OWING TO THE FACT THE ENTIRE MIRROR BODY HAD LEFT WHAT I AM TOLD IS ITS SNAP IN POSITION.  I HAD NEVER TOUCHED IT AND IT HAD NO REASON TO LEAVE ITS PROPER POSITION.  AND IT WAS IN ITS PROPER POSITION THE DAY I DROVE IT HOME.   THE MIRROR HAD TILTED ITSELF SO FAR I COULD SEE MY OWN REFLECTION IT IT!  THE DAY WAS QUITE WINDY AND THE CAR WAS BUFFETED BY THE WIND. A CHECK OF THE OWNER'S MANUAL HAS NO MENTION OF ANY KIND THIS MIRROR IS ADJUSTABLE.   I TOOK THE CAR TO THE DEALER AND WAS TOLD THIS IS NORMAL BEHAVIOR FOR THE MIRROR AND DESIGNED TO MOVE IN IMPACT AND COULD NOT BE SECURED FURTHER.  MAY I BE EMPHATIC THAT THE MIRROR SERVES NO USEFUL PURPOSE TO THE DRIVER WHEN FOLDED SO FAR AND THIS IS PLACING MY LIFE IN JEOPARDY FOR THE FOOL PURPOSE OF SAVING A MIRROR.  HONDA HAS LOST ITS MIND.",
        "vin": "JHMZE2H36ES"
    }
]