[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2022",
        "dateOfIncident": "12/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448596,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 120K MILES, UPON START, VEHICLE ENGINE BEGAN MAKING A CLICKING SOUND.  NO ENGINE LIGHT HAD APPEARED IN VEHICLE.  VEHICLE CONTINUED MAKING CLICKING SOUND AND BEGAN TO STALL WHEN DRIVEN OVER 40MPH.  BEFORE VEHICLE COULD EVEN BE SEEN FOR AN APPOINTMENT WITH REPAIR SHOP, VEHICLE COMPLETELY DIED WHILE DRIVING ON HIGHWAY.  WAS ABLE TO COAST TO SIDE OF THE ROAD AND WAIT FOR ASSISTANCE TO REPAIR SHOP.  UPON REVIEW, ENGINE COMPLETELY SEIZED AND DIED.  NO INDICATION OF ENGINE ISSUES NOTED THROUGH DASH LIGHTS.  SEEMS CONSISTANT WITH OTHER HYUNDAI ISSUES CONCERNING ENGINE FAILURE.",
        "vin": "KMHFH4JG6EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447439,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My air bag light is on & won't go off. It's been on for about a year. But my factory warranty have expired. I can't afford a new warranty . what shall I do ?",
        "vin": "KMHFG4JG5EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "12/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445106,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Day 1: Vehicle engine began to make a knocking sound…engine light never came on. Vehicle when at higher speed would make a really loud knocking sound so it had to be driven under 50mph. Within 3 days, vehicle completely cut off in traffic and coasted into parking lot of nearby store. Had to be towed to mechanic in which they informed the engine locked up and could not be repaired. I was quoted a cost of almost $10k for a new engine. I have seen there have been other Hyundais recalled for the he same issue, but not the model I drive. The car only has 120,377 miles and I can no longer drive it. I was left stranded and could have been injured as the engine light never came on to warn of an impending issue.",
        "vin": "Kmhfh4jg6ea"
    },
    {
        "components": "STEERING,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433424,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving, the steering became suddenly loose and nearly took me off the road.  I was able to get the vehicle the short distance home, but the steering wheel now feels broken and detached.  There was no warning.  The passenger airbag light stays on all the time.  I have found that both issues and parts are actually covered in other years, but not mine, which I have confirmed with a local dealer.  With only 68800 miles, these should both be fully covered manufacturer repair since they are safety-related and there are numerous similar reports.  There was no \"crash\" or \"injury\" per the questions below, BUT there should have been, and there was not, only because I was able to regain just enough control of the car to avoid a crash.  If someone else was driving, it would most certainly have been a crash with injuries, possibly involving other vehicles if I didn't happen to be close to home and the only car around at the time.  Based on my experience so far, I don't think I will be owning or buying any Hyundai products any time soon and will likely sell this one if I can get it repaired.  It is sitting in my garage useless right now.  I have now submitted a contact request to hyundaiusa.com asking for them to cover these repairs, and will update with their response.",
        "vin": "KMHFH4JG6EA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366781,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG LIGHT JUST  STARTED  COMING ON OCT 28 2020 & OFF . BUT THE NOISES BEEN COMING ON & OFF SCENE APRIL 20TH 2018 . JUST WANT TO KNOW IF MY AIRBAG  IS A RECALL???",
        "vin": "KMHFG4JG5EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352593,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DROVE MY WIFE'S CAR YESTERDAY, I NOTICED WITH THE ENGINE RUNNING THAT WHEN YOU TURN THE STEERING WHEEL LEFT OR RIGHT, IT CLUNKED BOTH TIMES.    THIS HAPPENED EITHER STOPPED OR WHEN YOU WERE DRIVING.    THIS WAS NOT JUST ANNOYING BUT ALSO FRIGHTENING AND I AM CONCERNED THAT THERE IS AN ISSUE WITH THE STEERING FAILING. ONLINE RESEARCH HAS INDICATED THAT THIS IS NOT AN UNUSUAL PROBLEM WITH BOTH HYUNDAI AND KIA VEHICLES.",
        "vin": "KMHFG4JG4EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330966,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING DEVELOPED \"SLACK\" WHEN TURNED WHEEL CAR DID NOT RESPOND IMMEDIATELY. PROBLEM WAS DIAGNOSED AS DEFECTIVE STEERING COLUMN.  COMPUTER SEARCH SUGGESTED THIS WAS SIMILAR TO PREVIOUS RECALL FOR MODELS OTHER THAN AZERA.  HYUNDAI DECLINED TO REPAIR WITHOUT $1500 CHARGE,  WHEN DRIVING CAR WANDERS AND WILL NOT TRACK STRAIGHT.  OBVIOUSLY WORSE AT HIGHWAY SPEED,  *TR",
        "vin": "KMHFG4JG6EA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "01/13/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170549,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 HYUNDAI AZERA. AFTER THE VEHICLE WAS STARTED, IT CAUGHT ON FIRE UNDERNEATH THE HOOD. THE VEHICLE WAS DESTROYED. THE CONTACT LEFT A MESSAGE FOR THE MANUFACTURER  TO CONTACT HER BACK. THE DEALER WAS NOT CONTACTED. THE CAUSE OF THE FIRE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "KMHFG4JGXEA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124492,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED, WHICH WAS A SAFETY CONCERN. THE VEHICLE WAS TAKEN TO BILLINGSLEY HYUNDAI OF LAWTON (2502 NW 82ND ST, LAWTON, OK 73505, (580) 536-3326) WHERE IT WAS DIAGNOSED THAT THE CLOCK SPRING ASSEMBLY NEEDED TO BE REPLACED. THE MANUFACTURER HAD NOT ISSUED ANY AIR BAG RECALLS FOR THIS YEAR, MAKE, AND MODEL VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 88,001.",
        "vin": "KMHFH4JG5EA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2017",
        "dateOfIncident": "04/29/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981519,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED OR WHEN MOVING, SOMETIMES ENGINE DOES NOT RESPOND TO DEPRESSING THE GAS PETAL.",
        "vin": "KMHFH4JG1EA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929872,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI AZERA. WHILE THE VEHICLE WAS IN REVERSE, THE FRONT DRIVER SIDE WHEEL GUARD ASSEMBLY FRACTURED AND SEPARATED FROM THE VEHICLE. THE CONTACT STATED THAT THE WHEEL GUARD ASSEMBLY WAS REPLACED TWICE. THE DEALER DIAGNOSED THAT THE WHEEL GUARD ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 21,200.",
        "vin": "KMHFH4JG3EA"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854400,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1. MY CAR STARTED BY ITSELF AT LEAST 5 TIMES.  WHEN I WENT OUTSIDE TO TURN IT OFF IT WAS ALREADY OFF!  MY REMOTES WILL NOT ALLOW ME TO REMOTELY TURN OFF THE CAR [CH]!  ON 1-19-2015, THE CAR STARTED UNASSISTED AGAIN & THE TRUNK LID POPPED OPEN & UP 3 FEET!   MY CONTROLS ONLY ALLOW  INCH UP!  2. AFTER 1-8-2015, I DISCOVERED THAT MY DRIVER SEAT 2 POSITION SETTINGS HAVE BEEN CHANGED MORE THAN 6 TIMES BUT NOT BY ME [CH]!  3. AFTER 1-8-2015, ALL THE DOOR LOCKS UNLOCK OCCASIONALLY (SEVERAL TIMES NOW) BY THEM SELF ABOUT 2 OR 3 SECONDS AFTER I MANUALLY PUSH THE BUTTON TO LOCK THEM IMMEDIATELY AFTER I ENTER MY CAR [CH]!  4. AT LEAST 17 TIMES MY REAR VIEW MIRRORS HAVE CHANGED POSITIONS WHILE I WAS DRIVING MY CAR [CH]!  1 TIME IN REVERSE THE REAR VIEW MIRRORS FOLDED UP WITH NO VIEW [HC]!  5. AFTER 1-8-2015, I HAVE RECEIVED SEVERAL MESSAGES FROM MY VIRGIN MOBIL CELL PHONE SAYING \"CONNECTION REQUESTED BY AZARA\" [CH]!   6. I DISCOVERED MY 24/7 OUTSIDE LIGHTS SETTING ' HAD THE OUTSIDE LIGHTS TURNED OFF WHILE BEING IN THE ON POSITION [CH]!  THE 24/7 LIGHTS - SETTING IS TO AUTOMATICALLY KEEP THE LIGHTS ON IN THE DAY & LATER CHANGE TO NIGHT LIGHTS AUTOMATICALLY.  7. THE OUTSIDE DRIVER SIDE DOOR UNLOCK HANDLE BUTTON DOES NOT CONSISTENTLY WORK FOR THE OTHER 3 DOORS [CH].  8. MY CRUISE CONTROL STOPPED WORKING ON **3-27-15 (1 PM) [CH] (3 TIMES).  9. ON **3-27-15 (1 PM) MY REAR BRAKE LIGHTS WERE ON & WOULD NOT TURN OFF.   THEY WERE ON FOR HOURS!      AT HOME, LATER THAT DAY THEY TURNED OFF, THEN ON, THEN OFF, THEN ON FOR HOURS [CH]!   THEY WERE ON ALL NIGHT!  10. ON 9-4-15, THE PROGRAM INSIDE MY HMA REMOTE WAS HACKED ($325 REPAIR COST) & IT WOULD NOT SET MY CONTINUOUS PANIC BUTTON ALARM.  11. ON 10-5-2015, WHILE DRIVING, I STARTED THE GPS DIRECTION GUIDANCE ONLY TO HEAR THE GPS GUIDANCE VOLUME HACKED TO THE EXTREME HIGHEST LEVEL (SEVERAL TIMES)!",
        "vin": "KMHFH4JG5EA"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "12/14/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825316,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VALVE STEM BROKE WHILE I WAS CHECKING AIR PRESSURE. VERY POOR QUALITY AND IT IS EXPENSIVE AND HARD TO FIND AFTERMARKET (UNABLE TO GET RESET AT DISCOUNT TIRE OR DEALERSHIP).",
        "vin": "KMHFH4JG3EA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2016",
        "dateOfIncident": "05/04/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817736,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ABOUT 800 MILES, MY VEHICLE BEGAN MAKING A LOUD CLATTERING NOISE AT START UP. NOW AT APPROXIMATELY 15K MILES, THE VEHICLE HAS BEEN RETURNED TO THE PURCHASING DEALER TO RECTIFY THIS PROBLEM SEVERAL TIMES. A HYUNDAI REPRESENTATIVE DEEMED THIS LOUD OBTRUSIVE NOISE NORMAL. HE STATED IT IS A TIMING CHAIN TENSIONER THAT IS CAUSING THE NOISE. HE ALSO STATES THE TENSIONER HAS TO BE \"PRIMED\" DURING INITIAL START UP. I REPLIED, IF THIS IS THE CASE, WHY IT TOOK 800 MILES FOR THE NOISE TO BECOME AUDIBLE? HE REPEATED HIS STATEMENT BY SAYING THIS IS NORMAL. I THEN REPLIED, IN NO SHAPE FORM OR FASHION, THIS IS NORMAL. THE NOISE IS SO LOUD, THE REPRESENTATIVE AND NO CHOICE BUT TO SAY HE HERD IT, BUT NOW SAYS IT IS NORMAL. AFTER COMPLETING SOME IN-DEPTH RESEARCH ON HYUNDAI'S 3.3 LITER LAMDA ENGINES, THE CLATTERING NOISE HAS BEEN REPORTED COUNTLESS TIMES TO HYUNDAI. ALTHOUGH MY VEHICLE WAS PURCHASED NEW AND STILL REMAINS UNDER FACTORY WARRANTY, HYUNDAI HAS REFUSED TO CORRECT THIS OBVIOUS ENGINE DEFECT. NOW WHILE COMING TO A STOP, THE VEHICLE IDLES FINE, THEN THE RPM'S VIOLENTLY DROP TO AROUND 500. AFTER SEVERAL SECONDS, THE RPM'S RETURN TO ITS NORMAL, 750 RPM'S. I RETURNED THE VEHICLE TO HYUNDAI CONCERNING THIS PROBLEM. ONCE AGAIN, THEY DEEMED NORMAL. TO THIS DATE, HYUNDAI HAS REFUSED TO HONOR THE FACTORY'S WARRANTY ON ANY OF MY VEHICLE'S OBVIOUS ENGINEERING DEFEATS.",
        "vin": "KMHFH4JG9EA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2015",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763334,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  MY CAR STARTED BY ITSELF SEVERAL TIMES[CH] UNASSISTED!  2.WHILE DRIVING MY CAR I DISCOVERED THAT MY DRIVER SEAT 2 POSITION SETTINGS HAVE BEEN CHANGED CH SEVERAL TIMES]!   BOTH SIDE VIEW MIRRORS WOULD NOT TILT DOWN IN REVERSE!   ALSO, ON 6-26-15 I DISCOVERED THAT BOTH OF MY FRONT DRIVER SEAT SET POSITONS HAVE BEEN CHANGED [CH]!  ON 7-7-15, MY DRIVER SEAT POSITION SETTINGS WERE HACKED AGAIN!   ON 9-1-15, THE DRIVER SEAT WAS HACKED UP; WHEN I GOT INTO THE CAR I HIT MY HEAD!     3.ALL THE DOOR LOCKS UNLOCK SEVERAL TIMES BY THEMSELVES ABOUT 2 OR 3 SECONDS AFTER I MANUALLY PUSH THE BUTTON TO LOCK THEM IMMEDIATELY AFTER I ENTER MY CAR [CH]!   FROM 2-11-15, THE DOORS UNLOCKED BY THEM SELF REPEATEDLY SEVERAL TIMES TO 9-11-2015 AT LEAST 68 DIFFERENT TIMES [CH]!   AT MY HOME, ON 4-9-2015, MY HORN SOUNDED, THE MIRRORS FOLDED UP & ALL THE DOORS UNLOCKED ALL AT ONCE BY THEMSELVES AFTER LOCKING THEM [CH]!  4.IN 2015, WHILE DRIVING MY CAR SEVERAL TIMES THAT SIDE REAR VIEW MIRRORS WERE MOVED [CH]!   ON 2-22-15 I STARTED MY CAR, PUT THE CAR IN REVERSE & BOTH REAR VIEW MIRRORS FOLDED UP [CH]!   ON SEVERAL TIMES MY REAR VIEW MIRRORS WOULD NOT TILT DOWN IN REVERSE [CH]!  5.I DISCOVERED MY CAR?S 24/7 LIGHTS WERE TURNED OFF [CH]!  6.SEVERAL TIMES THE DRIVER SIDE DOOR UNLOCK HANDLE BUTTON WOULD NOT UNLOCK THE OTHER 3 DOORS [CH].  7.WHILE DRIVING MY CAR, MY CRUISE CONTROL STOPPED WORKING ON **3-27-15 & 4-20-2015 [CH].  8.ON **3-27-15 MY REAR BRAKE LIGHTS WERE ON & WOULD NOT TURN OFF - ON FOR HOURS!   LATER THAT DAY THEY TURNED OFF, THEN ON, THEN OFF, THEN ON FOR HOURS [CH]!  9.ON 9-4-15, MY HMA REMOTE PROGRAM WAS HACKED & IT WOULD NOT SET MY ALARM ? PANIC BUTTON - ON FOR SECURITY PURPOSES!    *CN",
        "vin": "KMHFC46F99A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "10/27/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722294,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEED CONTROL WILL ACCELERATE UP HILL AND COAST DOWN HILL . SO A DRIVER CAN QUICKLY GO FROM 50 MPH TO 70 MPH OR CRASH. ON ALL OTHER HYUNDAI MODELS THE SPEED CONTROL BREAKS OR RETARDS SPEED ON A DOWN HILL. I HAVE BROUGHT THIS PROBLEM TO HYUNDAI 'S ATTENTION AND THEY HAVE ADMITTED IT'S A SOFTWARE PROBLEM BUT HAVE NO TIMELINE TO FIX THE PROBLEM.. PLEASE MAKE HYUNDAI FIX THIS PROBLEM.. I NEVER HAD AN ACCIDENT BUT I ALMOST DID A FEW TIMES    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).?  *JB",
        "vin": "KMHFH4JG6EA"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/19/2015",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706529,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER SYSTEM DEFECTS / ELECTRICAL DEFECTS & OR COMPUTER HACKINGS [CH]:  1. MY CAR STARTED BY ITSELF AT LEAST 3 TIMES.  ON 1-8-2015 MY CAR STARTED AGAIN UNASSISTED!  WHEN I WENT OUTSIDE TO TURN IT OFF, BEFORE I COULD TOUCH THE DOOR HANDLE OF THE CAR, THE CAR TURNED OFF & LOCKED THE DOORS WITHOUT ME DOING ANYTHING!  MY REMOTES WILL NOT ALLOW ME TO REMOTELY TURN OFF THE CAR [CH]!  ON 1-19-2015, THE CAR STARTED UNASSISTED AGAIN & THE TRUNK LID POPPED OPEN & UP!  2. AFTER 1-8-2015, I DISCOVERED THAT MY DRIVER SEAT 2 POSITION SETTINGS HAVE BEEN CHANGED AT LEAST 3 TIMES BUT NOT BY ME [CH]!  3. AFTER 1-8-2015, ALL THE DOOR LOCKS UNLOCK OCCASIONALLY (SEVERAL TIMES NOW) BY THEM SELF ABOUT 2 OR 3 SECONDS AFTER I MANUALLY PUSH THE BUTTON TO LOCK THEM IMMEDIATELY AFTER I ENTER MY CAR [CH]!  4. AT LEAST 3 TIMES MY REAR VIEW MIRRORS HAVE CHANGED POSITIONS WHILE I WAS DRIVING MY CAR [CH]!  1 TIME IN REVERSE THE REAR VIEW MIRRORS FOLDED UP WITH NO VIEW [HC]!  5. AFTER 1-8-2015, I HAVE RECEIVED SEVERAL MESSAGES FROM MY VIRGIN MOBIL CELL PHONE SAYING \"CONNECTION REQUESTED BY AZARA\" [CH]!   6. I DISCOVERED MY 24/7 OUTSIDE LIGHTS SETTING ' HAD THE OUTSIDE LIGHTS TURNED OFF WHILE BEING IN THE ON POSITION [CH]!  THE 24/7 LIGHTS - SETTING IS TO AUTOMATICALLY KEEP THE LIGHTS ON IN THE DAY & LATER CHANGE TO NIGHT LIGHTS AUTOMATICALLY.  7. THE OUTSIDE DRIVER SIDE DOOR UNLOCK HANDLE BUTTON DOES NOT CONSISTENTLY WORK FOR THE OTHER 3 DOORS [CH].  8. MY CRUISE CONTROL STOPPED WORKING ON **3-27-15 (1 PM) [CH].  9. ON **3-27-15 (1 PM) MY REAR BRAKE LIGHTS WERE ON & WOULD NOT TURN OFF.   THEY WERE ON FOR HOURS!      AT HOME, LATER THAT DAY THEY TURNED OFF, THEN ON, THEN OFF, THEN ON FOR HOURS [CH]!   THEY WERE ON ALL NIGHT!. ....UPDATED 11/02/15*BF   *TR    UPDATED 10/06/2017*CN",
        "vin": "KMHFH4JG5EA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2015",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691153,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER SYSTEM DEFECTS / ELECTRICAL DEFECTS / COMPUTER HACKINGS [CH]  MY NEW 2014 HYUNDAI AZERA CAR HAS COMPUTER SYSTEM(S) DEFECTS / ELECTRICAL DEFECTS (OR THE COMPUTER SYSTEM IN MY CAR HAS BEEN HACKED BY AN OUTSIDE COMPUTER [CH] OR LASER GUN).   MY CAR IS EQUIPPED WITH REMOTE START. COMPUTER SYSTEM DEFECTS / ELECTRICAL DEFECTS:  1. AT HOME, BEFORE 1-8-2015 MY CAR STARTED BY ITSELF & I SHOULD HAVE TAKEN IT TO THE DEALER.  ON 1-8-2015 AT HOME MY CAR STARTED AGAIN UNASSISTED!  WHEN I WENT OUTSIDE TO TURN IT OFF, BEFORE I COULD TOUCH THE DOOR HANDLE OF THE CAR, THE CAR TURNED OFF & LOCKED THE DOORS WITHOUT ME DOING ANYTHING!  MY REMOTE WILL NOT ALLOW ME TO REMOTELY TURN OFF THE CAR [CH?]!  ON 1-19-2015, AT HOME, THE CAR STARTED UNASSISTED AGAIN & THE TRUNK LID POPPED OPEN & UP!  2.AFTER 1-8-2015, I DISCOVERED THAT MY DRIVER SEAT 2 POSITION SETTINGS HAVE BEEN CHANGED AT LEAST 3 TIMES BUT NOT BY ME [CH?]!  3.AFTER 1-8-2015, ALL THE DOOR LOCKS UNLOCK OCCASIONALLY (SEVERAL TIMES NOW) BY THEM SELF ABOUT 2 OR 3 SECONDS AFTER I MANUALLY PUSH THE BUTTON TO LOCK THEM IMMEDIATELY AFTER I ENTER MY CAR [CH?]!  4.*OCCASIONALLY MY PASSENGER REAR VIEW MIRROR STICKS IN THE FULLY DOWN POSITION [CH?]!  LATER BOTH REAR VIEW MIRRORS WERE STUCK.  1 TIME IN REVERSE THE REAR VIEW MIRRORS FOLDED UP WITH NO VIEW [HC?]!  5.*AFTER 1-8-2015, I HAVE RECEIVED SEVERAL MESSAGES FROM MY VIRGIN MOBIL CELL PHONE SAYING \"CONNECTION REQUESTED BY AZERA\" [CH?]!   6.I DISCOVERED MY 24/7 OUTSIDE LIGHTS SETTING ?? HAD THE OUTSIDE LIGHTS TURNED OFF WHILE BEING IN THE ON POSITION [CH?]!  THE 24/7 LIGHTS - SETTING IS TO AUTOMATICALLY KEEP THE LIGHTS ON IN THE DAY & LATER CHANGE TO NIGHT LIGHTS AUTOMATICALLY.  I DO NOT KNOW HOW LONG I HAVE BEEN DRIVING WITH NO LIGHTS ON!  AS A RESULT, I AM NOT SURE IF THE DAY & NIGHT LIGHTS ARE WORKING BOTH DAY & NIGHT CORRECTLY!   ....UPDATED 11/02/15*BF     *TR  UPDATED 9/26/2017*CN",
        "vin": "KMHFH4JG5EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/24/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649787,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI AZERA. WHILE DRIVING APPROXIMATELY 55 MPH, THE STEERING WHEEL BEGAN TO VEER FROM LEFT TO RIGHT CAUSING THE CONTACT TO LOSE CONTROL OF THE VEHICLE. THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/03/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595953,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING \"WANDER\". THE VEHICLE DOES NOT DRIVE STRAIGHT WITHOUT CORRECTION BY DRIVER.    STEERING DOES NOT \"SELF-CENTER/RETURN TO CENTER\". MOST VEHICLES HAVE A CENTER SPOT ON THEIR STEERING GEAR THAT ALLOWS THE VEHICLE TO COMFORTABLY STEER IN A STRAIGHT LINE, ESPECIALLY WHEN RETURNING FROM A LANE CHANGE TO TURN.    DOES NOT DRIVE STRAIGHT. AS AN OVERALL, THE VEHICLE REQUIRES CONSTANT CORRECTION BY THE DRIVER TO KEEP THE VEHICLE GOING IN A STRAIGHT LINE.  *TR",
        "vin": "KMHFH4JG4EA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/11/2014",
        "dateOfIncident": "05/07/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587653,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WANDERS AT HIGHWAY SPEEDS. IT IS NOT SUITABLE FOR HIGHWAY DRIVING AS IT IS VERY FATIGUING TO DRIVE ANY DISTANCE ON THE HIGHWAY. I AM CONSTANTLY FIGHTING WITH THE STEERING TO STAY IN MY LANE. MOST OF MY DRIVING IS ON THE HIGHWAY AND THIS PROBLEM IS VERY MUCH A SAFETY CONCERN.  *TR",
        "vin": "KMHFH4JG4EA"
    }
]