[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301904,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "PROSTAR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE BEEN UNAWARE OF THESE RECALLS, AND AFTER DRIVERS ENDANGERING THEMSELVES AND PUBLIC SAFETY, LOSING TIME, MONEY, AND AFFECTED OUR CARRIER RATING DUE TO UNEXPLAINED LOSS OF POWER WHILE DRIVING. WE HAVE SPENT THOUSANDS GETTING TOWED AND USELESS REPAIRS. THE TRUCK HAS SHUT OFF IN MOTION AND WHILE IDLE, FROM HIGHWAYS TO CITY STREETS AND PARKING LOTS",
        "vin": "3HSDJAPR5EN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "09/29/2019",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280414,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "PROSTAR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 INTERNATIONAL PROSTAR PLUS. WHILE DRIVING 55 MPH, THE LOW WATER AND TEMPERATURE RISE WARNING INDICATORS ILLUMINATED. THE CONTACT STATED THAT EVERY HOUR, A GALLON OF WATER NEEDED TO BE PLACED INSIDE THE RESERVOIR. THE VEHICLE WAS TAKEN TO GIBBS TRUCK CENTER-GIBBS IDEALEASE FRESNO  (2712 SOUTH 4TH STREET, HWY 99 EXIT 130 JENSEN AVENUE, FRESNO, CA 93725, (800) 800-7012) WHERE THE CONTACT WAS INFORMED THAT WATER WAS ENTERING THE ENGINE AND THAT THE EGR SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 325,000.",
        "vin": "3HSDJSNR8EN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083971,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "PROSTAR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE MOUNTED AIR COMPRESSOR FAILED. ONLY 300,000 MILES ON THIS COMMERCIAL TRUCK. SUDDEN AIR LOSE CAUSING AIR BRAKES TO LOCKUP ON INTERSTATE HIGHWAY. NO WAY TO MOVE TRUCK CAUSING A POSSIBLE REAR END COLLISON. WAS TOLD BY THE DEALER NETWORK THIS A VERY COMMON FAILURE AND THEY NO LONGER USE THIS COMPRESSOR. DEALER RECOGNIZED PROBLEM IMMEDIATELY OFFERING A $5000 UPGRADE AT OWNERS EXPENSE. NO RECALLS OFFERED BY NAVISTAR-INTERNATIONAL COMPANY. PLEASE REVIEW FOR PUBLIC SAFETY REASONS.",
        "vin": "3HSDJSNR6EN"
    }
]