[
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447904,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I took my car for the 35000 mile service and I am needing to replace the lower coolant outlet Y pipe, which has been recalled on Jaguars the same year and manufacturing plant as mine. The part nu,nets are the same ones on the recall. Also the brake axle.? Which I think there may have been a recall. I do t know if you have had any other complaints on this matter, but I feel Jaguar should acknowledge it may have more cars that are defective and fix them.",
        "vin": "SAJWA0EX8E8"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309178,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN OCTOBER 2014, I PURCHASED A JAGUAR XF MODEL, THE CAR WAS USED AS AN EXECUTIVE DEMO FOR THREE MONTHS PRIOR TO MY PURCHASE. OVER THE YEARS, I HAVE SERVICED THE VEHICLE AT THE DEALERSHIP ONLY, THE CAR HAS EXCELLENT SERVICE RECORDS, AND HAS NEVER BEEN SERVICED ANYWHERE ELSE. ON 01/02/2020, THE 96,000 MILES SERVICE APPOINTMENT WAS DONE ON THE VEHICLE. ON MONDAY, JANUARY 27,2020, I WAS DRIVING HOME FROM WORK AND I HEARD A KNOCKING SOUND, I PULL OVER TO GET OFF THE HIGHWAY EXIT AND THE CAR LOSES ALL POWER. THE CAR HAD TO BE TOWED TO THE DEALERSHIP. SEVERAL DAYS LATER THE DEALERSHIP INFORMED ME THAT THE CAR'S ENGINE WAS COMPLETELY LOCKED UP AND THAT IT WOULD BE $20,000 TO FIX THE CAR, THE DEALER OFFERED DISCOUNTS AND I RECEIVED A CREDIT FROM JAGUAR CORPORATE, WHICH BOUGHT THE SERVICE PRICE DOWN TO $7,000. THE DEALERSHIP BELIEVES THAT SOMETHING BROKE APART IN THE ENGINE, CAUSING IT TO LOCK UP. BUT I AM REFUSING TO PAY THE $7,000, MY CAR HAS EXCELLENT SERVICE RECORDS AND HAS NEVER BEEN SERVICED ANYWHERE ELSE BUT THE DEALERSHIP. I JUST HAD THE 96,000 MILE SERVICE PERFORMED ON MY CAR AND EVERYTHING ON MY CAR WAS WORKING IN PERFECT CONDITION. THIS SERVICE ALSO INCLUDED AN OIL CHANGE! I CAN'T BELIEVE THAT THE DEALER IS TRYING TO CHARGE ME $7,000 TO FIX THE CAR. THIS IS THE ONLY OPTION THAT THEY GAVE ME! I BELIEVE THE DEALER DID SOMETHING TO MY CAR OR THIS PROBLEM IS PART OF A RECALL FOR MY CAR THAT HAS NOT BEEN IDENTIFIED. THERE ARE RECALLS ON OTHER XF'S MODELS SIMILAR TO THIS EXACT PROBLEM, BUT DOES NOT INCLUDE MY SERIAL NUMBER. MY CAR ALSO EXPERIENCED ANOTHER RECALL TYPE ISSUE THAT DID NOT INCLUDE MY SERIAL NUMBER; POWER STEERING WENT OUT BUT THE CAR WAS UNDER WARRANTY SO THIS ISSUE WAS REPAIRED AT NO COST. MY CAR HAS ONLY BEEN SERVICED AT THE JAGUAR DEALERSHIP. IT WAS JUST SERVICED ON 01/02/2020. THERE WERE ALWAYS ISSUES AND PROBLEMS WITH THE CAR.",
        "vin": "SAJWJ0EF7E8"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301380,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SCHEDULED RECALL J077 ON 1/23/20 AT NORTH JAQUAR (18205 INTERSTATE 45 N, HOUSTON, TX 77090) AND WAS DENIED RECALL AND TURNED AWAY. MY VEHICLE HAD TO BE TOWED   TO REPAIR SHOP ON SATURDAY WHERE 2 FUEL LEAKS WERE DISCOVERED. MY CAR STALLS AND IS LEAKING FUEL AND COOLANT LIGHT HAS STARTED TO COME ON (RED).",
        "vin": "SAJWA0EXXE8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "07/12/2019",
        "fire": true,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11244188,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF A CLIENT WHO OWNED A 2014 JAGUAR XF. THE CONTACT STATED THAT WHILE STOPPED AT A RED LIGHT, THE VEHICLE CAUGHT ON FIRE AS THE DRIVER WAS STILL IN THE VEHICLE. THE FIRE DEPARTMENT WAS AT THE SCENE AND MOST LIKELY EXTINGUISHED THE FIRE BUT THAT INFORMATION WAS UNCERTAIN. THE DRIVER WAS PULLED OUT OF THE VEHICLE BY BYSTANDERS AND TAKEN TO THE HOSPITAL. THE DRIVER REMAINED AT THE HOSPITAL WHERE IT WAS CONFIRMED THAT THEY SUSTAINED 30% OF BODILY BURNS AND PASSED AWAY THE FOLLOWING DAY.  THE POLICE DEPARTMENT WAS PRESENT BUT IT WAS UNKNOWN IF A REPORT WAS FILED. THE VEHICLE WAS TAKEN VIA FLATBED TO AN INDEPENDENT FACILITY. THE DEALER AND THE MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS DESTROYED. AN INSPECTOR WAS TO INSPECT THE VEHICLE ON AUGUST 23, 2019 TO DETERMINE THE ORIGIN OF THE FIRE. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "SAJWA0EX3E8"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232736,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 JAGUAR XF. WHEN THE VEHICLE WAS STARTED, THE SERVICE WARNING INDICATOR ILLUMINATED. AN INDEPENDENT MECHANIC CAME TO THE CONTACT'S RESIDENCE TO DIAGNOSE THE VEHICLE AND LOCATED A CODE FOR THE FUEL SENSOR. THE MECHANIC STATED THAT THE FUEL FILLER PIPE AND FUEL CAP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. IN ADDITION, WHEN FUELING THE VEHICLE AT A FUEL STATION, THE PUMP WOULD CONSTANTLY CLICK OFF. THE CONTACT WAS UNABLE TO FILL UP THE TANK. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO A JAGUAR DEALER. THE DEALER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 37,000.",
        "vin": "SAJWJ0EFXE8"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2019",
        "dateOfIncident": "01/15/2019",
        "fire": true,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170734,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNEXPLAINED FIRE: VEHICLE WAS BEING DRIVEN TO WORK. UPON PULLING IN TO THE PARKING LOT, DRIVER NOTICES BURNING SMELL. DRIVER PARKS, BYSTANDER APPROACHES DRIVER TO ALERT THAT THE VEHICLE IS ON FIRE. DRIVER EXITS VEHICLE AND NOTICES A FIRE UNDER THE PASSENGER SIDE OF THE VEHICLE, APPROXIMATELY 1.5FT IN DIAMETER. LIQUID IS SPILLING ONTO THE GROUND AND CATCHING ON FIRE. DRIVER PROCEEDS TO WORK SECURITY DESK TO CALL FIRE DEPARTMENT. CAR IS NOW ENVELOPED IN FLAMES (~15FT). FIRE SPREADS TO VEHICLE IN FRONT OF THE JAGUAR. FIRE CAUSES DAMAGE TO A TOTAL OF 4 VEHICLES AND THE ASPHALT. FIRE DEPARTMENT EXTINGUISHES THE FIRE AND VEHICLE IS TOWED. THE JAGUAR WAS DEEMED A TOTAL LOSS. THE JAGUAR HAD BEEN DRIVEN APPROXIMATELY 200 MILES SINCE TAKATA AIRBAG REPLACEMENT.",
        "vin": "SAJWA0EXXE8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083254,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN OPEN RECALL FOR THE AIRBAGS INFLATOR HOUSING SINCE DECEMBER 2017. AS PER A LETTER RECEIVED FROM JAGUAR THE REMEDY WONT BE AVAILABLE UNTIL MARCH 2019. THAT IS AN AWFULLY LONG TIME- 1 YR AND 4 MONTHS, TO FIX AN ISSUE. EVEN AFTER THAT GOD KNOWS HOW MUCH TIME THEY ARE GOING TO BE TAKE TO ACTUALLY FIX THIS ONCE A REMEDY IS AVAILABLE. ESPECIALLY WHEN THIS IS A SERIOUS ISSUE WHICH CAN RESULT IN DEATH. JAGUAR NEEDS TO BE PUSHED SO AS TO COMPLETE THIS ASAP SINCE THIS IS AN AWFULLY LONG TIME TO BE DRIVING AN UNSAFE CAR.",
        "vin": "SAJWJ0EF7E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2018",
        "dateOfIncident": "03/11/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078553,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. IT IS UNACCEPTABLE THAT THE PARTS NECESSARY TO MAKE OUR CAR SAFE ARE NOT AVAILABLE AND MAY NOT BE UNTIL MARCH 30TH, 2019. THAT IS OVER A YEAR AWAY. SO FOR THE NEXT YEAR WE ARE SUPPOSED TO DRIVE OUR CAR AND HOPE THE PASSENGER ISN'T KILLED BY THE AIR BAG?",
        "vin": "SAJWA0ES2EP"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/03/2014",
        "dateOfIncident": "06/30/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607973,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE 495 OUT OF THE LINCOLN TUNNEL AND MY LEFT FRONT TIRE WENT FLAT. I DID NOT HIT ANY POTHOLES.  TWO DAYS LATER DRIVING ON RIVER ROAD IN EDGEWATER NJ I HIT A SMALL POTHOLE, IT WAS DARK AND TORRENTIAL DOWNPOURS, MY TIRE IMMEDIATELY WENT FLAT.  WE PULLED INTO A INDOOR GARAGE, CHANGED THE TIRE, WENT TO BACK OUT OF THE PARKING SPOT AND THE BACK TIRE WENT FLAT.  I DO NOT FEEL SAFE WITH THESE TIRES.  THEY ARE CONTINENTAL - CONTI PRO CONTACT.  *TR",
        "vin": "SAJWJ0EF7E8"
    }
]