[
    {
        "components": "FIRERELATED",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "01/28/2022",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459682,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2014 Hyundai Tucson. The contact stated that while driving at an undisclosed speed, the vehicle stalled and there was smoke coming from the engine compartment. The contact safely exited the vehicle. The vehicle then caught fire in the engine compartment, causing the windshield to shatter and explode. The fire department was able to extinguish the fire. The contact did not sustain any injuries, and no medical attention was received. The contact was not aware if there was a fire department report. The vehicle was towed to a tow yard and deemed totaled by the insurance company. The dealer was made aware of the failure. The manufacturer was not made aware of the failure. Prior to the failure, the vehicle was taken to the dealer for a stalling failure, but the dealer could not duplicate the failure and the vehicle was not repaired. The contact later received notification of NHTSA Campaign Number 22V056000 (Service Brakes, Hydraulic). The failure mileage was approximately 62,000.",
        "vin": "km8jucag6eu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2022",
        "dateOfIncident": "03/25/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458389,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I have this 2014 Hyundai Tuscon that I need to drive cross country from NY to Los Angeles. This website states that they don’t have the remedy for the fix yet. Can I get some help on who can help me travel without catching a blaze.",
        "vin": "Km8ju3ag1eu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "02/21/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458247,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On February 21, 2022, I took my Hyundai Tucson 2014 to the dealership where I purchased the vehicle located on 21400 NW 2nd Avenue Miami, FL 33169. While driving I heard a noise and it was slower even when I tried to speed.  When I found out that there was a recall to update the ECM>  They told us to wait for them to contact Hyundai Corporate.  On March 23, 2022-We went in person and Mr. [XXX] told us that Hyundai Corporate closed the claim. They did not performed the software update of the Electronic Control Module or the airbag recall. We only wanted them to honor the service campaign they promised.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "KM8JT3AF3EU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "01/15/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457252,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Hyundai Tucson. The contact stated while driving approximately 60 MPH, the vehicle accumulated heat from the engine. The contact stated that the Traction Control warning light was illuminated. The vehicle was not diagnosed. The dealer was notified about NHTSA Campaign Number: 22V056000 (Service Brakes, Hydraulic) however, offered no assistance. The manufacturer was not notified of the failure. The VIN was included in the recall. The approximate failure mileage was 192,000.",
        "vin": "KM8JUCAG2EU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457336,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine light started blinking and I could not accelerate anymore. After driving home, I figured out it was showing P1326 error. It didn't allow me to go above 60 mph or 2000 rpm. Further digging into the issue I figured out that this was a common issue with hyundai and kia cars, but there was no recall for my car. I took the car to dealship as it was still under warranty and they only updated ECU for knock sensor. No other repairs where done saying that there was no solution to the issue. Other cars get their engines replaced and get lifetime warranty. I got no repairs or extended warranty.",
        "vin": "km8jt3af5eu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457002,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Iba conduciendo mi vehículo por carretera y de momento se apago. Vehículo no quiere volver a prender.  Vinieron del seguro, verificaron el vehículo y encontraron todo en perfecto orden, poleas, aceite, transmisión.  Solo encontraron el motor que no corre.  Adicional  me indican que ya el vehículo no tiene garantía por ser yo segunda dueña, lo cual nunca me explicaron y lo peor de todo es que me quedan solamente 5 pagos.  Nadie se quiere responsabilizar de dicha situación.",
        "vin": "km8jt3afxeu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "12/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454535,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine warning light is on since December.  Had bad code P1326 knock signal. Was told by Hyundai in Danbury i need a new CAT. I got that done for $2600 by my mechanic. engine light is still on. Return to Danbury Hyundai they perform bearing performance and said it pass. Engine light is still on. Unrealize codes 39250-2E00-Sensor Assy-Knoch. This has been going on since December 10,2021.",
        "vin": "km8Jtcafxeu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/18/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454191,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "56k ish miles on my car, 2nd owner. Oil pressure light flickered on and off about .5 miles from home after 20 mile highway drive, steady on when pulled into driveway. Turned off car immediately. Have noticed excessive oil consumption but check and  top off frequently. Topped off less than 200 miles prior. About halfway or less since last oil change mileage wise from what I recall. Checked oil and about halfway between bottom and top markers on dipstick. Took to dealer Monday (.8 miles from home). Oil light did not come back on. Dropped off. Dealer said light came on shortly after driving. Said problem could be caused by “aftermarket” oil filter aka not a OEM filter. Said would do oil & filter change to see if resolved. Yesterday (Thursday) said oil & filter change complete & oil light not on. Reiterated previously mentioned concern of engine failure and potential accident. Service advisor said hyundai will not entertain engine replacement unless oil consumption gets documented. Oil consumption test to be completed after 1000 miles or until low oil levels noticed/oil pressure light illuminates. Will pick up tomorrow to see what happens. Engine is covered under newly extended warranty if failure occurs.  Service advisor says nothing else was checked internally, spark plugs, etc. as this would incur engine being taken apart and extra charges prior to hyundai “entertains” covering engine replacement etc.   Although no failure has occurred yet I’m worried something will and it will result in something potentially catastrophic for not only the engine/car but myself.",
        "vin": "Km8jtcaf2eu"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451941,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "March 2021 I had a problem with my brakes, took it to the local dealership and they replaced my master cylinder and brake pads.  This was after I had already had total engine failure in December and had my car at a dealership in North Little Rock, AR  for almost 3 months, I had literally just got my car back when i started having brake issues, no pressure.  Now, it's January 28th and I suddenly had the same brake issue as the year before, no brake pressure.  I could pump the brakes and get pressure and was hoping it was just a temporary issue with air in the lines or something.  I called the dealership that changed out my master cylinder and brake pads in March 2021, as it was almost a year later.  I dropped my car off on 2/11 at 7 am, it is 7/14 and they still have my car, they are saying there is no problem, but will drive the car again.  I'm afraid that there is a serious issue and will get the car back and not have the issue resolved.  And now seeing the recall issue with ABS and my car is part of that recall, I don't want something bad to happen, and if I don't say something in writing it will not be noted in case of a larger issue.  And I feel like i'm having one issue after another with my car, i'm the only owner and have taken very good care of my car.",
        "vin": "KM8JU3AG7EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "12/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451292,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My car stopped running in the middle of the road. I had to slowly pull over and have it towed to the dealership.  Upon further inspection, the dealer told me that the engine is dead and to replace it would cost 15K.  I have 121K miles on the car and Hyundai's warranty ends at 120K. They refused any coverage and I am expected to cover the expense.",
        "vin": "KM8JUCAG9EU"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450953,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Hyundai Tucson. The contact stated that the rear passenger’s side door could not be opened, while the front passenger’s side door could only be opened from inside the vehicle. The contact was not aware of any warning light had illuminated. The contact stated that the doors not operating as needed was a safety hazard. The vehicle was not taken to be diagnosed nor repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 60,000.",
        "vin": "KMHJUCAG6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450178,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Hyundai Tucson. The contact stated that while operating the vehicle, the check engine warning light illuminated, and the vehicle would not properly accelerate. The vehicle was taken to the local dealer who installed a NOX sensor, but the failure continued to occur. The cause of the failure was not determined. The vehicle was not repaired. The manufacturer was notified but no assistance was offered. The failure mileage was 72,000.",
        "vin": "KM8JT3AF8EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447258,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Acquired vehicle in November 2021, with 20,718 miles. I noticed a small knocking noise coming from engine area, but discounted any major problem due to the fact it only had 20k miles. After using the car for two weeks, and researching this engine knock noise, I discovered there is a long history of engine failures due to faulty internal engine components on this type of engine. I took it to the Hyundai dealer to diagnose the problem, and was informed the knock was normal and had past the “engine noise test”. They stated there is no open recalls for this vehicle, and that I should go back if the noise increases.  I feel this vehicle is now unsafe to drive because the engine has to basically fail, and thus place my family’s safety at risk and even possibly cause an accident or engine fire, in order for it to be fixed by the dealer. I believe this model year and engine type needs to be investigated and be recalled, as many other vehicles with this same exact engine have had this same problem, resulting in total engine failures, near accidents and even fires. I have read there are even lawsuits on this dangerous engine defect.",
        "vin": "KM8JU3AG1EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "12/27/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446073,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I was drying my 2014 Hyundai Tucson 12/27 and the engine began knocking and the speed dramatically decreased.  Now, the engine no longer works at all.  I took it to the hyundai dealer and they refused to fix because it is not currently in a vehicle recall campaign (although it should be).  I am also filing a complaint with the nhtsa today, which currently shows 49 similar complaints for this exact year and model.",
        "vin": "KM8JU3AGXEU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445552,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On 10/28/2021 had car towed to dealer for blinking engine light.Iwas told needed a new engine. The beginning of December got the car back and was told it was the knock sensor on 12/16/2021 light started blinking brought back to dealer and then was told it was the engine harness. They shut off light I was told I could drive car home,they shut off blinking. Light got to highway passing into another lane light started blinking lost power from 65 to 45 was almost hit the car behind me swerved to avoid me thank god .and since then the dealer will not call me back and Hyundai of America gave me a case worker who will not call me back. I have been told this will cost $5000.00.to repair these problems started when they did update on car at the dealership I seen 3 papers for failed engine and now this.",
        "vin": "KM8JT3AF3EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442527,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Hyundai Tucson. The contact received notification of an unknown manufacturer's engine recall. The contact stated that while driving at an undisclosed speed, there was a knocking sound and the vehicle would not accelerate properly. The vehicle then stalled without warning. Additionally, the vehicle was consuming excessive amounts of oil. The vehicle was towed to the dealer. The dealer informed the contact that the failure may be related to the engine and suggested taking the vehicle back later for diagnostic testing. The vehicle was towed to the contact's residence, where it remained. The vehicle was not diagnosed or repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 148,000.",
        "vin": "km8jt3af2eu"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441582,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Hyundai Tucson. The contact stated that the vehicle would not exceed a certain speed and would jerk upon the depression of the accelerator pedal with the check engine warning light flashing on the instrument panel. The contact had taken the vehicle to a dealer where he was given an appointment to have the vehicle serviced but the dealer had not yet inspected the vehicle. The manufacturer had been notified of the failure and the contact was provided a case manager. The vehicle had was not repaired. The failure mileage was approximately 83,000.  The vehicle continues to have knock sensor problems as set forth in the recall. The AC no longer blows cool air as well.",
        "vin": "km8ju3ag9eu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "09/08/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441271,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Hyundai Tucson. The contact stated that while at a stop sign, the vehicle stalled without warning. The vehicle was able to restart after several attempts. The failure recurred multiple times. The vehicle was taken to a dealer where it was diagnosed that the crankshaft sensor needed to be replaced. The vehicle was repaired however, the failure recurred. The contact mentioned that the vehicle was in limp mode and that the vehicle failed to accelerate. The vehicle was restarted after the vehicle was pushed to the side of the road and the check engine warning light illuminated. The vehicle was taken back to the dealer where it was diagnosed that the electronic control module software needed to be updated. The vehicle was repaired however, the failure persisted. In addition, the vehicle was towed to the dealer where it was diagnosed that the knock sensor and engine wiring harness needed to be replaced. The manufacturer was notified of the failure and provided the contact a case number. The approximate failure mileage was 85,000.",
        "vin": "km8jtcaf1eu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "09/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439809,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving 57 mph and a knocking sound then would not go over 30 mph. Had towed to a Hyundai dealership they found metal in oil 9/21/21. Still sitting in Hyundai's lot with no answer of what they are going to do.",
        "vin": "KM8JU3AG1EU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426350,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear passenger door will not open from inside or out. Door locks appear to be functioning correctly. Cannot remove door panel to repair while door closed.",
        "vin": "KM8JUCAG6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "05/18/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421721,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Approximately 1 month ago, I was driving on the freeway at 65 mph. suddenly the engine lost power and the knocking began.  We took it to the dealership that also has our 2012 Santa Fe, which has been recalled. It has been there for several months. Both vehicles need engine replacement.",
        "vin": "km8jucag1eu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421295,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE END ON 2020 THE BACK PASSENGER ON THE LEFT SIDE STOPPED WORKING. THIS DOOR WAS NEVER USED MAYBE ONCE EVERY 6 MONTHS. I LOOKED ONLINE AND SAW A BUNCH OF PEOPLE SAYING THE SAME THING ABOUT THIS MODEL. SINCE THE BACK SEAT AND DON'T USE DIDN'T WORRY TOO MUCH. NOW MY DRIVER SIDE DOOR WON'T OPEN OR CLOSE AND AGAIN YOU SEE DAILY REPORTS ONLINE OF PEOPLE COMPLAINING ABOUT THIS SAME ISSUE. THEY SAID THERE ARE NO RECALLS BUT I DON'T SEE HOW THIS IS NOT A SERIOUS PROBLEM. IF MY CHILD IS IN MY BACKS SEAT AND 2 OF THE DOORS DON'T OPEN IT'S HUGE SAFETY CONCERN IN AN EMERGENCY. MY MAJOR CONCERN IS ANOTHER DOOR GOES OUT AND WERE TRAPPED IN THE CAR. I HAVE NEVER EVER HEARD OF CAR DOOR GOING OUT THAT IS NEVER USED AND SINCE BOTH WENT OUT IT'S VERY CLEAR BASED ON MANY OTHER PEOPLE ONLINE THAT THIS IS A PRODUCT ISSUE WITH THIS MODEL CAR. IF YOU SEARCH ONLINE FOR MY MODEL YOU WILL SEE COUNTLESS PEOPLE WITH THE SAME ISSUE.",
        "vin": "KM8JU3AG1EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "03/09/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417461,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE TURNING ON THE VEHICLE OR IDLING, THE VEHICLE MADE AN ABNORMAL SOUND AND WAS NOT OPERATING AS NEEDED. NO WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR ROUTINE MAINTENANCE AND DIAGNOSED THAT THERE WAS NO OIL ON THE DIP STICK AND THE OIL WAS 2 QUARTS LOW. THE MECHANIC PERFORMED A COMPLETE OIL CHANGE HOWEVER, THE VEHICLE STILL CONSUMED AN EXCESSIVE AMOUNT OF OIL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT TO TAKE IT TO A HYUNDAI DEALER. THE VEHICLE WAS TAKEN TO THE DEALER AND INFORMED THE CONTACT TO CONTINUE TO DRIVE THE VEHICLE UNTIL THE NEXT OIL CHANGE AND NOT TO ADD OIL. THE CONTACT WAS ALSO INFORMED THAT IF THE ENGINE SEIZED, THE VEHICLE WAS COVERED UNDER THE 100,000 MILES WARRANTY. THE VEHICLE WAS THEN TAKEN BACK TO THE INDEPENDENT MECHANIC FOR ANOTHER ROUTINE MAINTENANCE AND A QUART OF OIL WAS ADDED AGAIN. THE CONTACT CONTACTED THE MANUFACTURER AGAIN AND WAS INFORMED THAT A CASE WAS OPENED BUT THE VIN WAS NOT INCLUDED IN A RECALL. THE MANUFACTURER ALSO INFORMED THE CONTACT THAT THEY WOULD PAY FOR THE DIAGNOSTIC AND REPAIR ONE TIME ONLY BUT THE CONTACT WOULD NEED TO SIGN A LIABILITY WAIVER IF THE DEALER WAS UNABLE TO FIX THE FAILURE THE FIRST TIME. ADDITIONALLY, THERE WOULD NOT BE SECOND GOODWILL REIMBURSEMENT IF THE VEHICLE FAILED AFTER THE FIRST REPAIR. THE VEHICLE WAS NOT YET REPAIRED. THE FAILURE MILEAGE WAS 67,000.",
        "vin": "KM8JTCAF2EU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415682,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORMALLY THEN ALL OF A SUDDEN KNOCKING SOUND FROM THE ENGINE AND CANT GET VEHICLE MOVING AT ATTEMPTED SPEED. VEHICLE SHAKES A BIT, CHECK ENGINE LIGHT COMES ON THEN OIL LIGHT COMES ON.",
        "vin": "KM8JT3AF6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405202,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE ON A HIGHWAY , GOING ABOUT 70 MILES AN HOUR. WITHOUT ANY WARNING THE VEHICLE MADE A LOUD NOISE FROM THE ENGINE ALL MY DASH LIGHT CAME ON AND IT DIED. I WAS IN THE CENTER LANE AND MY CAR JUST DIED IT RESTARTED WITH A KNOCKING IN MY ENGINE AND KEPT DYEING. I HAD A 3YR OLD IN THE CAR SEAT AND WAS FORCED TO EXIT THE VEHICLE AND PUSH IT OFF THE ROAD TO SAFETY. THIS VEHICLE ONLY HAS 64000 MILES ON IT AND HAD GOOD CLEAN OIL. I CHECKED BEFORE MY  4 HOUR TRIP .I WAS STRANDED 2 HOURS FROM HOME.THE COMPANY REFUSES TO HONOR THE 100000 MILE WARRENTY BECAUSE I AM THE SECOND OWNER. I STILL OWE 14000 DOLLARS ON THIS VEHICLE.",
        "vin": "KMJ8UCAG2EU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "03/19/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404136,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WILL RANDOMLY ACCELERATE WHEN THE BRAKE PEDAL IS PRESSED. IT HAS HAPPENED TO ME SEVERAL TIMES BUT IT IS RANDOM AND DOESN'T HAPPEN EVERY TIME. IT HAS HAPPENED WHEN SLOWING DOWN GOING DOWN HILLS OR WHEN STOPPING AT A STOP SIGN. WHEN IT HAPPENS MY FOOT IS ALWAYS ON THE BREAK, EITHER SLOWING DOWN OR STOPPING, AND THE VEHICLE IS IN GEAR. THE RPM'S WILL JUMP FROM IDLE TO 3000. THE ONLY WAY I CAN GET IT TO STOP IS BY LETTING OFF THE BREAK AND PRESSING DOWN ON THE BREAK AGAIN, THIS SOMETIMES TAKES A COUPLE TIMES TO GET IT TO STOP. THANKFULLY I HAVEN'T BEEN IN AN ACCIDENT YET BUT IT IS VERY SCARY. I BROUGHT IT TO A DEALERSHIP BUT THEY DIDN'T DO ANYTHING BECAUSE THEY SAID THAT THEY COULDN'T REPLICATE THE PROBLEM. THIS PROBLEM STARTED LESS THAN 2 MONTHS AGO AND HAS HAPPENED AT LEAST A DOZEN TIMES.",
        "vin": "KM8JUCAGXEU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402734,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 60 MPH DOWN THE HIGHWAY, THE VEHICLE LOST POWER COMPLETELY AND THE ENGINE LIGHT CAME ON. IT HAD TO BE TOWED FROM THE SHOULDER AND THE MECHANIC SAID THE ENGINE WAS CRACKED DESPITE IT'S LOW MILEAGE AND NO WARNING PRIOR TO THE BREAKDOWN, IT ALSO WASN'T DUE FOR AN OIL CHANGE FOR A FEW WEEKS YET. THE DAY IT BROKE DOWN WAS POURING RAIN SO I WAS UNABLE TO SEE ANY POSSIBLE OIL OR OTHER LIQUID LEAKING OUT DUE TO THE WEATHER.",
        "vin": "KM8JT3AF7EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11402559,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE VEHICLE ABRUPTLY STALLED CAUSING THE DRIVERS HEAD TO MAKE CONTACT WITH THE STEERING WHEEL. DURING THE INCIDENT THE DRIVER SUSTAINED A HEAD INJURY WHICH DID NOT REQUIRE MEDICAL TREATMENT. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE ENGINE HAD FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER AND LOCAL DEALER GARVEY HYUNDAI LOCATED AT 257 DIX AVE #1, QUEENSBURY, NY 12804 WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 122,000. *DT*DT*JB",
        "vin": "KM8JUCAG9EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388525,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS COMING HOME FROM WORK FRIDAY NIGHT AND WAS ALMOST HOME AND LOST POWER . IT SPUTTERED AND WHEN I PULLED INTO PARKING LOT IT STARTED TO KNOCK. I TURNED OFF ENGINE.CHECKED THE NEXT DAY AND I HAD NO OIL AND NEVER GOT ANY WARNING SIGNS ON THE DASH   THE DRIVE WAS AN EXPRESSWAY RIDE 65 MPH. I JUST CHECKED THE OIL 1 WEEK BEFORE THIS HAPPEN  NOT REALLY HAPPY WITH WHAT HAPPENED AND IT SEEMS LIKE THIS COMPLAINT HAPPENS ALOT AND I HOPE THINGS TURN OUT GOOD",
        "vin": "KM8JT3AF0EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388574,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE EXPRESS WAY AT AROUND 60MPH WITH MY WIFE AND CHILDREN IN THE CAR THE CAR SUDDENLY DROPPED TO 40MPH AND THE ENDING STARTED TO CLICK. LUCKILY, NO ONE WAS BEHIND US AND WE WERE ABLE TO EXIT THE FREEWAY SAFELY. THIS IS APPARENTLY A KNOWN ISSUE THAT I WAS NOT MADE AWARE OF.",
        "vin": "KM8JU3AGXEU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378234,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC WINDOWS IN THE CAR ARE A SAFETY HAZARD. I HAVE REPLACED BOTH FRONT AND BACK OF THE PASSENGER SIDE WINDOW SWITCHES BECAUSE THEY DO NOT ALLOW THE WINDOW TO GO UP OR DOWN. I TOOK IT IN FOR ONE WINDOW THAT WOULD NOT GO UP AND DOWN AND ABOUT A MONTH LATER THE SECOND WINDOW WENT. I AM KNOWING THAT IN THE FUTURE I WILL HAVE TO REPLACE THE OTHER TWO AS WELL. THIS CAN CAUSE A SERIOUS PROBLEM IF THERE IS AN ACCIDENT AND THE OCCUPANTS NEED TO OPEN WINDOWS TO GET OUT OF THE CAR. I AM SHOCKED THAT THERE IS NO RECALL TO FIX WHAT EVER ELECTRICAL ISSUE THERE MIGHT BE WITH THE WINDOWS. I JUST CAN'T FATHOM THAT TWO WINDOWS WOULD HAVE THE SAME PROBLEM WITHIN MONTHS OF EACH OTHER.",
        "vin": "KM8JUCAG2EU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "09/14/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364588,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STARTED KNOCKING AND VEHICLE WENT INTO LIMP MODE AS MY DAUGHTER LEFT HIGHWAY FOR HER EXIT . WHEN HYUNDAI ATTEMPTED TO REPLACE ENGINE, DISCOVERED 4WD TRANSFER CASE SEIZED INTO TRANSMISSION PREVENTING REMOVAL OF ENGINE, REPLACED ENGINE ,TRANSMISSION, AND TRANSFER CASE. THIS IS THE SAME ENGINE IN THE SANTA FE , AND SONATA WHICH WAS RECALLED. HYUNDAI IS STILL REFUSING TO EXTEND THE RECALL TO THE TUCSON TOO. SO OWNERS ARE NOT ENTITLED TO THE EXTENSION ON THE EXTENDED WARRANTY. DUE TO THEM NOT WANTING ANYBODY TO KNOW ABOUT THIS DEFECT IN THE MOTORS THAT THE TUCSON SHARE WITH THEIR OTHER MODELS. THE GOVERNMENT SHOULD OF STEPPED UP AND MADE HYUNDAI HONOR THE EXTENSION TO INCLUDE THE TUCSON MODEL TOO. FOR ALL TUCSON OWNERS ARE LEFT IN THE COLD WITH A VEHICLE WORTH [XXX] SINCE THEY ARE STILL HAVING MORE PROBLEMS WITH THIS 2.4L MOTOR.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KM8JUCAG4EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355705,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIANC WAS ON HIS WAY TO WORK WHEN ALL OF A SUDDEN THE CAR STARTS TO STALL. IT PUT HIM IN A VERY DANGEROUS SITUATION AS HE HAS JUST CROSSED OVER A BRIDGE. THIS COULD HAVE CAUSE A CAR ACCIDENT. AFTER THIS HAPPENED THE OIL PRESSURE LIGHT COMES ON AND ALSO THE CHECK ENGINE LIGHT, AND THE ENGINE STARTS MAKING KNOCKING NOISE. WE HAVE KEPT UP WITH OIL CHANGES AND MAINTENANCE, SO WHY THIS HAPPENED IS JUST   UNEXPLAINABLE TO US. ALSO OUR CAR ONLY HAS 65,893 MILES ON IT. SO JUST HOW CAN THIS HAPPEN?  SO WE BROUGHT IT TO MULTIPLE DEALERSHIPS AND THEY SAID IT NEEDS A NEW ENGINE, SOMETHING YOU DEFINITELY NEVER WANT TO HEAR.",
        "vin": "KM8JT3AF7EU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342724,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WILL NOT SHIFT OUT OF PARK. I WAS GETTING GAS AND WHEN I STARTED THE CAR I COULD NOT MOVE IT OUT OF PARK.  I CHECKED THE MANUAL AND FOLLOWED THE INSTRUCTIONS TO PRESS THE SHIFT LOCK SYSTEM AND THEN IT MOVES OUT OF PARK. IF I PUT IT BACK IN PARK IT LOCKS AGAIN. IT WAS RUNNING FINE NO ISSUES PRIOR. I KNOW THERE WERE RECALLS FOR MY CAR SO AM WORRIED THIS IS A HUGE SAFETY ISSUE FOR MYSELF AND CHILDREN.",
        "vin": "KM8JT3AF6EU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318312,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 HYUNDAI TUSCON HAD ENGINE REPLACED & STILL BURNING OIL EMITTING BLUE SMOKE & KNOCKING. DEALERSHIP & HYUNDAI CORP HAVE BEEN NOTIFIED & HAVE YET TO FIX THE PROBLEM.",
        "vin": "KM8JU3AGXEU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "04/04/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11303065,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE WOULD SHAKE, VIBRATE AND RATTLE. ALSO THE TRANSMISSION WOULD HESITATE TO SHIFT GEARS AND SMOKE WAS PRESENT COMING FROM THE EXHAUST. THE VEHICLE WAS TAKEN TO THE DEALER PHILPOTE HYUNDAI (1900 US HWY 69, NEDERLAND TX) WHO DIAGNOSED THAT THE ENGINE WAS FAULTY AND NEEDED TO BE REPLACED. THE ENGINE WAS REPLACED BUT THE FAILURE REOCCURRED. THE MANUFACTURER CASE [XXX)]WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 44,400.  *LN     ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "KM8JU3AGXEU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300681,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I'M DRIVING ON THE HIGHWAY, I HEAR A STRANGE SOUND FROM THE ENGINE. I LOOK AT THE DASH BUT WARNING LIGHTS ARE ON. I START MAKING MAY WAY TO THE RIGHT LANE TO EXIT THE HIGHWAY, BUT THE CAR STARTS TO SLOW. I LOOK AT THE DASH AGAIN AND THE LOW OIL LIGHT AND CHECK ENGINE LIGHT ARE ON. I MAKE MY WAY TO THE SHOULDER AND THE CAR COMPLETELY STARTS RUNNING. SHORTLY AFTER, A TOW TRUCK TAKES THE CAR TO A NEARBY MECHANIC SHOP. THE NEXT DAY, THE MECHANIC TELLS THE HYUNDAI TUCSON THREW A ROD AND THE ENGINE IS DESTROYED.     THE MECHANIC SAYS HE HAS SEEN THIS BEFORE. I'VE FOUND SEVERAL COMPLAINTS ABOUT THE SAME THING. THIS IS A DANGEROUS ISSUE AND IT IS UNFAIR TO CONSUMERS. THE 2014 HYUNDAI TUCSON HAS ONLY 85,602 MILES ON IT.",
        "vin": "KM8JT3AF3EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300687,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT MY 2014 HYUNDAI TUCSON NEW, ON NOVEMBER 1,2019 AT 96K MILES, IT DIED WHILE I WAS DRIVING IT! I HAD JUST EXITED THE 70 MPH HIGHWAY AND WAS ON THE SIDE STREET GOING 40 MPH. THIS ENGINE IS THE THETA 2 THAT HAS BEEN RECALLED IN MILLIONS OF OTHER VEHICLES FOR CATCHING ON FIRE AND/OR DYING. I HAD IT TOWED TO HYUNDAI AND THEY TOLD ME THAT I NEED A NEW ENGINE AND THAT IT WILL BE UNDER WARRANTY DUE TO THE INSIDE OF THE ENGINE HAVING METAL SHAVINGS ALL IN IT. I HAVE BEEN WAITING FOR OVER 2.5 MONTHS FOR MY CAR TO BE FIXED BECAUSE ALL OF THE PARTS THAT THEY NEED ARE BACK ORDERED. THEY HAVE NO ESTIMATED TIME OF COMPLETION FOR ME. I AM STUCK PAYING MY CAR PAYMENT ON THE CAR THAT I CAN'T EVEN DRIVE.",
        "vin": "KM8JUCAG9EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282217,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 67 MPH ON AN INTERSTATE, VEHICLE COMPLETELY SHUT DOWN AND ENGINE LOCKED UP.  IT IS A 2014 WITH ONLY 81,000 MILES ON IT?",
        "vin": "KM8JU3AG9EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277382,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING THE CAR ON THE HIGHWAY.  NO SAFETY LIGHTS CAME ON.  ENGINE STARTED SHAKING AND CAR STOPPED.  WAS TOWED AND AT FIRST TOLD THERE WAS NO OIL IN THE ENGINE, BUT UPON FURTHER INSPECTION, WAS TOLD THAT THERE WAS OIL.  IT WAS AN 'ENGINE MALFUNCTION '",
        "vin": "KM8JT3AF1EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270824,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT THE ENGINE SHOOK AND FAILED WILL DRIVING. THE VEHICLE WAS RESTARTED AND DRIVEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THEY HAD SEEN THE FAILURE BEFORE WITH THE SAME MAKE AND MODEL VEHICLES. THE VEHICLE WAS TOWED TO RIVERHEAD HYUNDAI (1800 OLD COUNTRY RD, RIVERHEAD, NY 11901, (631) 369-0600) TO BE DIAGNOSED, BUT THE RESULTS WERE PENDING. THE MANUFACTURER HAD NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 78,000.",
        "vin": "KM8JUCAG6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267391,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING ON THE HIGHWAY WITH HIS 2014 HYUNDAI TUSCON AND HIS CAR STALLED.  WE HAD THE CAR TOWED TO A DEALER AND THEY SAID THE ENGINE THREW A ROD.  THEY HAVE SAID IT NEEDS A COMPLETE ENGINE.  WHEN I HAVE CONDUCTED OTHER RESEARCH ON THIS TYPE OF CAR I HAVE FOUND NUMEROUS EXAMPLES OF THE SAME SITUATION HAPPENING.",
        "vin": "KM8JTCAF2EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266975,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS 2014 HYUNDAI TUCSON AS A SECOND OWNER FROM A HYUNDAI DEALERSHIP FOR MY DAUGHTER IN JANUARY OF 2018 WITH 70,223 MILES.  CAR HAD BEEN INSPECTED AND SERVICED BY THE DEALERSHIP HYUNDAI TECHNICIANS.  ON 9/13/2019 WHILE DRIVING THE VEHICLE STARTED MAKING LOUD BANGING NOISES FROM THE ENGINE AND EXPERIENCED DIFFICULTY SHIFTING.  VEHICLE WAS TOWED TO HYUNDAI DEALERSHIP WHERE WE WERE TOLD IT HAD EXPERIENCED \"TOTAL ENGINE FAILURE\" DUE TO METAL SHAVINGS THROUGHOUT THE ENGINE AND IT WOULD HAVE TO BE REPLACED-MY DAUGHTER HAD ONLY PUT 23 THOUSAND MILES ON IT-THE ENGINE FAILED AT 93000 MILES..  THE REPLACEMENT COULD TAKE UP TO 2 MONTHS-MOST LIKELY DUE TO NUMEROUS TUCSON ENGINE FAILURES .  THERE IS A KNOWN PROBLEM WITH THIS ENGINE-JUST CHECK OTHER SITES ON THE INTERNET.THERE IS A RECALL WITH THE SAME ENGINE FOR SONATAS, SANTA FE, AND KIA MODELS BUT NOT TUCSON",
        "vin": "KM8JTCAF3EU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267055,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY IS BEING DRAINED.  CAR IS A 2014 AND ON IT'S 3RD BATTERY WITH THE LAST BATTERY ONLY LASTING 18 MONTHS.",
        "vin": "KM8JU3AG3EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252990,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING NORTH ON INTERSTATE 15 NEAR BEAVER UTAH AND EXITED BEAVER UTAH EXIT, AS I EXITED THE CAR JUST STOPPED, CAME TO AN ABRUPT STOP, RESTARTED CAR AND GOT OFF EXIT, CAR ENGINE BANGING AND STALLING, TOWED TO HYUNDAI DEALER IN ST GEORGE UTAH, SAID KNOW ENGINE PROBLEM, ENGINE NEEDED REPLACE, UP TO 3 MONTH REPAIR OR LONGER.",
        "vin": "KM8JTCAF0EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203014,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE PURCHASED HER 2014 HYUNDAI TUCSON BRAND NEW AND WE HAVE MAINTAINED REGULAR OIL CHANGES AND KEPT UP WITH MAINTENANCE SCHEDULES. HER TUCSON IS AT 115K MILES AND IS BURNING A LOT OF OIL WITH NO LEAK AND NO ADDITIONAL WHITE SMOKE FROM THE TAIL PIPE. ITS BURNING ABOUT 2.5 TO 3 QUARTS OF OIL EVERY 1500 MILES (CONSERVATIVELY). I HAVE TRIED HIGH MILEAGE OILS AND THICKER WEIGHTS TO REDUCE THE BURNING. I HAVE TRIED LUCAS HEAVY DUTY OIL STABILIZER. NOTHING SEEMS TO KEEP THIS VEHICLE FROM CHUGGING DOWN OIL. MY CONCERN IS THAT MOST OF THE OTHER COMPLAINTS WERE DUE TO THE ENGINE SEIZING DUE TO LACK OF OIL. DO WE KNOW WHY THESE ENGINES ARE BURNING SO MUCH PR HOW WE CAN CHANGE THAT? MY HOPE FOR THIS COMPLAINT IS TO HELP OTHERS BEFORE THEY BURN UP THEIR ENGINES NOT REALIZING HOW FAST THEIR ENGINE IS BURNING OIL.",
        "vin": "KM8JT3AF6EU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "03/07/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197319,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. WHILE DRIVING APPROXIMATELY 45 MPH, THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THERE WAS NO WARNING INDICATOR ILLUMINATED. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS DAMAGED AND TOWED TO THE CONTACT'S RESIDENCE. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS APPROXIMATELY 61,800.",
        "vin": "KM8JUCAG5EU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "03/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195758,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC MOTOR IN THE DRIVERS SEAT DOESN'T WORK.  SEAT WILL NOT MOVE AT ALL.  IT IS STUCK.  WE WERE TOLD THE MOTOR IS SHOT.  WE PUT IN DIFFERENT FUSES AND HAD A MECHANIC LOOK AT IT WITH NO LUCK.",
        "vin": "KM8JUCAGXEU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "03/18/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195716,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED AS SECOND OWNER ON 8/18/16, MILEAGE WAS 21,7946. ON 03/16/18, WAS DRIVING AT APPROX. 40 MPH WHEN ALL THE DASH LIGHTS CAME ON AND THE CAR CAME TO A STOP, NO POWER. TOWED TO HYUNDAI DEALER, WAS TOLD CRANKSHAFT SEIZED AND THE ENGINE NEEDED REPLACED. MILEAGE WAS 70,702 AND I WAS TOLD IT WAS NOT COVERED BY WARRANTY BECAUSE IT WAS 702 MILES OVER. PAID $4000 FOR A USED MOTOR.   GOT A LETTER RECENTLY TELLING ME THERE WAS AN ISSUE WITH THE SOFTWARE, AND IN LOOKING I UP DISCOVERED THERE WERE ISSUES WITH THIS MOTOR.",
        "vin": "KM8JUCAG3EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191405,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THETA 2 ENGINE FAILURE AT 112K MILES",
        "vin": "KM8JU3AG5EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182581,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 19, 2018, MY SONS WERE DRIVING ON THE FREEWAY AT APPROX 65MPH TO PICK ME UP FROM THE AIRPORT WHEN THE ENGINE JUST DIED; NO NOISES OR WARNING LIGHTS.  LUCKILY THEY WERE ABLE TO GET TO THE SHOULDER (LEFT SIDE OF THE FWY) AND CALL AAA.  CHP HAD TO PUSH THE VEHICLE ACROSS THE FWY UNTIL TO THE TOW TRUCK ARRIVED FOR SAFETY PURPOSES.  AAA GARAGE CALLED NEXT DAY TO NOTIFY ME THAT ENGINE HAD SEIZED AND WOULD NEED REPLACING.  SAID TO TOW TO HYUNDAI DEALERSHIP SINCE VEHICLE ONLY HAD 48K MILES AND UNDER WARRANTY.  APPARENTLY THE ENGINE IS BACKORDERED AND LAST DATE I HAVE RECEIVED SO FAR (AS OF 2/26/19) IS 3/26/19 BUT NOTHING CONFIRMED AT THIS POINT.  BEEN DEALING WITH HYUNDAI CORPORATE AND THEY HAVE A CASE OPEN FOR MY COMPLAINT BUT NOW WAS JUST TOLD IT WOULD TAKE 2-3 WEEKS TO PULL MY MAINTENANCE RECORDS AND THEY WOULD GET BACK TO ME.  ODDLY, ON NOVEMBER 26, 2018, THE DEALERSHIP HAD SENT OVER ALL OF THAT TO CORPORATE FOR APPROVAL TO ORDER/REPLACE/PAY FOR THE NEW ENGINE SO NOT SURE WHY IT WOULD TAKE THAT LONG.  I AM NOW PAYING EVERY MONTH FOR A VEHICLE THAT I DON'T EVEN HAVE, JUST PAID ANOTHER $300 FOR REGISTRATION WHICH JUST COMPOUNDS THE FRUSTRATION.  AT THIS POINT WITH THE COST OF A NEW ENGINE AND ANY OTHER POSSIBLE DAMAGE DONE FROM THE ENGINE SEIZING, IT WOULD BE CHEAPER FOR THEM TO JUST REPLACE MY VEHICLE BUT INSTEAD THEY KEEP DRAGGING IT OUT.  MY KIDS COULD HAVE BEEN INJURED WITH AN ENGINE DYING ON A BUSY CALIFORNIA FWY AND NOT EVEN AN APOLOGY OR EMPATHETIC RESPONSE.  I PURCHASED MY VEHICLE AS A CERTIFIED USED VEHICLE AND HAD JUST OVER A YEAR ONLY PUTTING 10K MILES ON IT.  VERY DISAPPOINTING!!",
        "vin": "KM8JUCAGXEU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "10/30/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181356,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIKE CAME ON.  THE DEALER TOLD ME THAT THE OIL CONTROL VALVE HAD METAL SHAVINGS IN IT.  THE ENGINE NEEDED TO BE REPLACED.  IT IS UNDER WARRANTY,  I WAS TOLD THE ENGINES WERE ON BACK ORDER FOR 4 WEEKS.  THAT WAS ON 10/31/2018.  AS OF TODAY (2/20/19), I STILL DO NOT HAVE MY CAR.  THEY HAVE NO IDEA HOW LONG IT WILL BE.  I WILL BE GIVEN A REMANUFACTURED ENGINE WITH THE BALANCE OF MY FACTORY WARRANTY.  I KNOW THAT THIS IS A WIDESPREAD PROBLEM AMONG TUCSON, SANTA FE AND SONATA MODELS.  I BELIEVE THERE HAS BEEN A RECALL ON EVERYTHING BUT THE TUCSON'S.  IT ALSO EFFECTS SOME KIA MODELS.",
        "vin": "KM8JUCAG2EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174588,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A LOWER ENGINE FAILURE AY 118.00 MILES",
        "vin": "KM8JT3AF6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165431,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DEC. 14, 2018 WHILE DRIVING 50 M.P.H. MY 2014 HYUNDAI TUCSON ENGINE: 2.0L I4 DI WITH 113,000 MILES, MADE AN AWFUL SOUND THEN MOMENTS LATER, THE CAR ENGINE LOST ALL POWER, LIGHTS AND STEERING. I NEARLY CRASHED MY CAR. I WAS FORTUNATE NOT TO HIT THE CAR IN FRONT OF ME WHO IMMEDIATELY AFTER MY ENGINE FAILED, SUDDENLY STOPPED TO MAKE A LEFT TURN. BARELY MISSING THIS CAR, I THEN HAD TO CORRECT MY SKID THEN MAKE AN ABRUPT 90 RIGHT HAND TURN OFF THE HIGHWAY AND UP A STEEP DRIVEWAY, PRAYING IT WAS ENOUGH OF A INCLUDE TO SLOW MY CAR BRINGING MY CAR TO A SAFE STOP. MY PASSENGER WAS SHAKEN. UNABLE TO RESTART THE ENGINE, THE KEY HAVING FAILED TO EVEN ILLUMINATE THE ENGINE LIGHTS AGAIN, I WAS FORCED TO CALL AND PAY FOR THE CAR TOWED BACK TO THE MY HYUNDAI DEALERSHIP IN LACONIA, N.H. WHERE I HAD PURCHASED THE CAR ABOUT 2 1/2 YEARS, AND WITHIN 29,00 MILES BEFORE THE CATASTROPHIC ENGINE FAILURE. AFTER FIVE DAYS I CALLED THE DEALERSHIP ONLY TO FIND OUT THEN THAT THE HYUNDAI TUCSON'S ENGINE WAS BLOWN AND NEEDED TO BE REPLACED. I WAS TOLD THERE WERE NO NEW HYUNDAI ENGINES AVAILABLE, (I SUSPECT THE SCARCITY IS LIKELY DUE TO THE THOUSANDS OF REPORTED ENGINE FAILURES OF THE HYUNDAI 2.0 ENGINE) AND, I WOULD NEED TO PURCHASE A JUNK YARD ENGINE WITH A  WARRANTY. I CAN ONLY HOPE THE SERIOUSNESS OF THE 2014 HYUNDAI TUCSON CATASTROPHIC ENGINE FAILURE HAZARD CONVINCES THE NHTSB TO PERSUADE HYUNDAI USA, 2.0L I4 DI ENGINE, MONTGOMERY, ALABAMA TO RECALL ALL TUCSON MODELS WITH ENGINE, JOINING OTHER 2.0 ENGINES INSTALLED IN THE RECALLED SONATA AND SANTA FE MODELS WITH THE EXACT SAME ENGINE IN MY CAR. HYUNDAI PLACE SAFETY ABOVE ALL FOR THIS OTHERWISE AVOIDABLE SAFETY HAZARD IN THEIR MANUFACTURE PROCESS AND DESIGN OF WHAT OTHERWISE COULD BE A SAFE, RELIABLE CAR. HYUNDAI TUCSON RECALL. 2014 HYUNDAI ENGINE FAILURE. HYUNDAI USA ENGINE DIED.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163720,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 24 HOURS OF HEARING KNOCKING AND TICKING IN MY ENGINE (WITH NO CODES OR SIGNALS SHOWING ANY ISSUES) THE ENGINE FAILED. THE NOISE COULD BE HEARD CONTINUOUSLY AT ANY SPEED FOR 24 HOURS. ONCE THE ENGINE FAILED WHILE I WAS TRYING TO DRIVE IT TO THE DEALERSHIP, THE SERVICE ENGINE LIGHT AND OIL LIGHT CAME ON. I'VE HAD THE VEHICLE FOR 4 YEARS AND IT'S AT 103,000 MILES WITH CONSTANT OIL CHANGES AND NO OTHER ISSUES WITH THE TUSCON. IN FACT, IT HAS BRAND NEW OIL IN THERE NOW.  THERE IS A RECALL OF THE SAME ISSUE WITH THE SONATA, SANTA FE, AND OTHER KIA VEHICLES BUT NONE FOR THE TUSCON.  TUSCON NEEDS TO BE INCORPORATED INTO THIS RECALL AND COVERED BY HYUNDAI. HYUNDAI IS INVESTIGATING THE ENGINE AND OIL PAN AREA NOW. RESULTS ARE PENDING.",
        "vin": "KM8JUCAG6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/13/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161147,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST LIKE EVERYONE ELSE ON HERE.... ENGINE STARTED MAKING A RATTLING NOISE AND GOT SIGNIFICANTLY LOUDER. CAR LOCKED UP WHILE DRIVING. BROUGHT TO MECHANIC AND ENGINE IS BLOWN. SAME PROBLEM AS THE HYUNDAI LAWSUIT. BUT BECAUSE THERE IS NO RECALL ON THIS MODEL (EVEN THOUGH IT HAS THE SAME ENGINE) IT ISNT COVERED",
        "vin": "KM8JT3AF2EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151201,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN UNKNOWN INDEPENDENT MECHANIC, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS TOWED TO M J SULLIVAN HYUNDAI (452 BROAD STREET, NEW LONDON, CT 06320) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED DUE TO METAL SHAVINGS THROUGHOUT THE ENTIRE ENGINE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 83,325.",
        "vin": "KM8JTCAF5EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "09/27/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133051,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME THING AS THE OTHERS LISTED, ENGINE COMPLETELY LOCKED UP GOING DOWN THE ROAD, HAD TO HAVE IT TOWED, AND THE MECHANIC SAID THAT IT WAS TOTALLY GONE BECAUSE OF THE OIL. HYUNDAI WOULD NOT PAY FOR ANY OF IT, SINCE I AM THE SECOND OWNER AND THERE WAS NO RECALL ON MY CAR. THE RECALL WAS FOR THE SAME EXACT MOTOR, SAME EXACT PROBLEM, JUST A DIFFERENT MODEL CAR.",
        "vin": "KM8JU3AG7EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131638,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 TUCSON RECENTLY SUFFERED A CATASTROPHIC ENGINE FAILURE. I WAS DRIVING HOME FROM WORK LAST TUESDAY (9/18) ON A HIGHWAY WHEN I HEARD A BANG AND THEN THE CONSTANT RATTLING FROM MY ENGINE. I WAS FORTUNATE THAT I DIDN'T SEEM TO LOSE POWER AT CRUISING SPEEDS, BUT IT WAS STILL OBVIOUS THAT SOMETHING WAS VERY WRONG. I LIMPED IT THE 20 OR SO MILES TO MY LOCAL SERVICE CENTER WHERE IT'S NOW SITTING. FIRST THING THEY DID WAS CHECK THE DIP STICK AND IT WAS DRY. I HAVE MY OIL CHANGED REGULARLY, I'VE NEVER HAD BLUE SMOKE OUT THE BACK, NO OIL SPOTS, NO SIGN OF EVEN THE SLIGHTEST OIL LEAK. SO FOR THE DIP STICK TO BE DRY WAS ALARMING.    I SPENT THE NEXT DAY CALLING AROUND TO HYUNDAI DEALERSHIPS TO SEE WHAT OPTIONS I'D HAVE. I COMMUTE ABOUT 70 MILES FOR WORK, MY TUCSON IS AT 130K MILES SO IT'S WELL BEYOND THE 100K WARRANTY. HAVING THE ENGINE REPLACED WAS BASICALLY MY ONLY OPTION.",
        "vin": "KM8JU3AG9EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2018",
        "dateOfIncident": "08/17/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128378,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SO AROUND 60,106  MY ENGINE SEIZED WHILE DRIVING TO A BOWLING GAME. MY EXTENDED WARRANTY WAS ONLY FOR 45,000 NOW I'M STUCK PAYING FOR A CAR I CANT DRIVE.",
        "vin": "KM8JUCAG1EU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "07/08/2018",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110247,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR IN DEC 2017.  JULY 8, 2018, CAR CAUGHT ON FIRE WHILE DRIVING. NO ISSUES BEFORE THIS EVENT. NO WARNING, CARE JUST WENT UP IN FLAMES STARTING FROM UNDER THE CAR/THE ENGINE.  THERE HAVE BEEN RECALLS ON OTHER MODELS OF HYUNDAI CARS, BUT THEY DO NOT INCLUDE HYUNDAI TUSCONS.  I THINK THIS NEEDS TO BE INVESTIGATED BEFORE SOMEONE LOSES THEIR LIFE DUE TO THIS CAR.",
        "vin": "KM8JTCAF4EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109732,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON I-40 NEAR RALEIGH, I TRIED TO ACCELERATE AND THE ENGINE STOPPED RUNNING. ALL ELECTRONIC COMPONENTS CONTINUED TO OPERATE, BUT THERE WAS NO ENGINE POWER. AFTER PULLING TO THE SIDE OF THE ROAD, I TRIED RESTARTING THE ENGINE SEVERAL TIMES BUT IT WOULDN'T RESTART.    A HYUNDAI DEALERSHIP TESTED THE ENGINE AND SAID IT HAD FAILED. THE VEHICLE'S MILEAGE WAS 82,000 MILES SO WILL BE COVERED BY HYUNDAI WARRANTY. HOWEVER, DUE TO A BACKLOG ON PARTS, HYUNDAI HAS ADVISED IT COULD BE 3 MONTHS BEFORE THE PARTS BECOME AVAILABLE.",
        "vin": "KM8JU3AG6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105158,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE TUCSON WALKING DEAD EDITION WE NOTICED THAT THE ENGINE WAS MAKING A GRINDING NOICE AND HAD TROUBLE ACCELLERATING.  WE EVEN TRIED TO SHIFT IT AND STILL HAD PROBLEMS.  WE DROVE IT RIGHT TO THE DEALERSHIP AND TOLD THEM THEY HAD TO CHECK THIS OUT.  THE CHECK ENGINE LIGHT WAS EVEN ON.  THEY CALLED A COUPLE DAYS LATER AND TOLD ME THEY HAVE TO REPLACE THE ENTIRE ENGINE.",
        "vin": "KM8JUCAG7EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101844,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 HYUNDAI TUCSON'S ENGINE BURNED OIL AND NOW THE ENGINE IS COMPLETELY DESTROYED AT ONLY 108,000 MILES. I RESEARCHED AND FOUND THAT THIS YEAR, MAKE AND MODEL HAS THE SAME ENGINE AS MY WIFE'S RECALLED 2014 HYUNDAI SONATA. HER CAR IS ALSO BURNING OIL AND IS NOW GOING THROUGH TESTS TO DETERMINE IF THEY NEED TO REPLACE HER ENGINE. IN THE MEANTIME I HAVE A CASE NUMBER WITH HYUNDAI.   HYUNDAI CAN'T ANSWER WHY MY MODEL HASN'T BEEN RECALLED YET. I LOOKED ONLINE AND FOUND A PRIVATE FACEBOOK PAGE OF OTHER HYUNDAI TUCSON OWNERS WITH BLOWN ENGINES. IF MY CAR WAS RECALLED LIKE MY WIFE'S CAR I WOULD STILL BE UNDER WARRANTY AS THEY EXTENDED HER TO 120,000 MILES DUE TO RECALL. MY CAR IS 8000 MILES OUT OF THE WARRANTY WHEN MY ENGINE BLEW. WE'RE STILL WAITING TO HEAR BACK FROM HYUNDAI CORPORATE AS TO WHAT WILL HAPPEN WITH MY CAR. MEANWHILE  STILL PAYING A LOAN ON A CAR I CAN'T DRIVE. DISGUSTED AND FURIOUS ARE JUST THE BEGINNING OF HOW I FEEL.",
        "vin": "KM8JTCAF3EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "05/28/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098982,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. WHILE DRIVING 55 MPH, THE ENGINE SEIZED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER (HEALEY HYUNDAI, 410 FISHKILL AVE, BEACON, NY 12508), BUT THE FAILURE WAS NOT DIAGNOSED OR REPAIRED DUE TO THE DIAGNOSTIC TESTING FEE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 146,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099012,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ENGINE SHUT DOWN 2018 MEMORIAL DAY WEEKEND. HYUNDAI SERVICE CENTER RAN A COMPRESSION TEST AND SCOPED THE ENGINE AND FOUND THE CYLINDER WALLS SCORED.     PRIOR TO THIS BACK IN 2016 ANOTHER ENGINE ISSUE REGARDING THE ENGINE CARRYING HARNESS WAS ADDRESSED & FIXED.    LESS THAN 6 MONTHS AFTER PURCHASING VEHICLE BRAND NEW IN NOV 2013/I AM THE 1ST & ONLY OWNER, I WAS DRIVING THE VEHICLE IN THE SPRING AT IT CUTOFF. I REACHED OUT TO THE RACINE WI HYUNDAI SERVICE CENTER OVER A YEAR IN ORDER TO FIGURE OUT WHAT WAS HAPPENING, THE VEHICLE TURNED OFF MULTIPLE TIMES OVER THAT YEAR AS WELL AS MY TOWING THE VEHICLE TO HYUNDAI MULTIPLE TIMES BEFORE ISSUE WAS FOUND & FIXED    I HAVE BEEN ADVISED THAT THE SPECIFIC ENGINE IN MY VEHICLE WAS RECALLED BUT SOMEHOW MY VEHICLE DID NOT MEET THE ENGINE RECALL QUALIFICATION. HOW? WHEN BEFORE I CAN EVEN FINISH PAYING OFF THE VEHICLE THE ENGINE HAS HAD 2 DIFFERENT PROBLEMS WITH THE 2ND PROBLEM RENDERING THE ENGINE USELESS.   6 MONTHS AFTER BUYING THE VEHICLE BRAND NEW, IT STARTED CUTTING OFF",
        "vin": "KM8JT3AFXEU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2018",
        "dateOfIncident": "05/28/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098886,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. WHILE DRIVING 55 MPH, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE FAILED TO RESTART AND WAS TOWED TO AN INDEPENDENT MECHANIC. THE MECHANIC DIAGNOSED THAT THE ENGINE FAILED, BUT THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 80,570.",
        "vin": "KM8JU3AG0EU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080992,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "10.000 MILES AND HAD TO REPLACE ALL BRAKES, TOOK IN TO DEALERSHIP BECAUSE OF SOUND WHEN APPLYING BRAKES",
        "vin": "KM8JUCAG6EU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080994,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LESS THAN 11000 MILES HAD TO HAVE ALL THE BRAKES AND ALL THE ROUTERS REPLACED ON THE HYUNDAI 2014 AWD TUCSON BECAUSE I HEARD A SOUND WHEN APPLYING THE BRAKES SO TOOK IT TO DEALERSHIP. THEY MADE ME SHARE THE COST EVEN THO THE MILEAGE WAS SO LOW.",
        "vin": "KM8JUCAG6EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080135,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED AN ENGINE KNOCKING NOISE AND SLIGHT LURCHING OF CAR AFTER A COLD START. TOOK IT TO THE HYUNDAI DEALERSHIP FOR DIAGNOSIS AND MAINTENANCE AND THEY TOLD ME I WOULD NEED TO REPLACE MY SHORT BLOCK FOR FIVE OR SIX THOUSAND DOLLARS VERY SOON OR MY ENGINE WOULD SEIZE UP. THEY MENTIONED THAT MY CAR'S SYMPTOMS WERE IDENTICAL TO THOSE OF THE HYUNDAI MODELS THAT HAVE A RECALL FOR THEIR ENGINES, NAMELY THICK OIL WITH DEBRIS IN IT. MY 2014 TUCSON USES THE EXACT SAME ENGINE AS THE ONE CURRENTLY BEING RECALLED SO I THINK IT'S JUST A MATTER OF TIME UNTIL ENOUGH COMPLAINTS ACCUMULATE THAT THE TUCSON IS RECOGNIZED AS BEING EFFECTED BY THE SAME ISSUE AS THE OTHER MODELS USING THIS ENGINE.",
        "vin": "KM8JU3AG7EU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "12/07/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055919,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS DEAD BATTERY  WHEN SITTING A COUPLE DAYS SINCE DAY ONE FROM NEW (2014).  BEEN TO SHOP (DEALER) NUMEROUS TIMES WITHOUT ANY IMPROVEMENT. IP JUNCTION BOX AND BATTERY WERE REPLACED IN 10/ 2015 AND BATTERY CHECKED OK 10/17,  BUT STILL GETS DEAD BATTERY NOW AND THEN WHEN SITTING 2 DAYS",
        "vin": "KM8JU3AG9EU"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/02/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11052024,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WE EXITED THE FREEWAY, WE STOPPED AT THE SIGN, WAITED FOR TWO CARS, PROCEEDED TO GO AND AS WE WERE ALMOST TURNED INTO OUR LANE I LOOKED AND SAW A CAR SPEEDING UP AND HIT US GOING AROUND 50 MPH, SHE DIDN'T BRAKE AND ENDED UP SWERVING A LITTLE TO THE LEFT AS SHE DRUG OUR BIKE WE WERE EJECTED ACROSS THE ROAD AND ALMOST DIED WITH SERIOUS LIFE THREATENING INJURIES",
        "vin": "KM8JUCAG3EU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980190,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SITS IDLE FOR TWO OR THREE DAYS AND THE BATTERY IS TOTALLY DRAINED.  THE DEALER HAS HAD THE VEHICLE TWICE AND CANNOT FIND A SOLUTION.  THE BATTERY HAS BEEN CHANGED TWICE WITH NO SOLUTION.  OTHER OWNERS HAVE REPORTED THE SAME PROBLEM.  THE VEHICLE MAY OPERATE PROPERLY FOR A FEW MONTHS BUT IF IT SITS MORE THAN TWO OR THREE DAYS THE BATTERY IS DRAINED.  THE DEALER HAS NO SOLUTION.  SEARCHES FOR THIS PROBLEM HAVE REVEALED SEVERAL OTHER VEHICLES WITH THE SAME PROBLEM. THE VEHICLE HAS BEEN KEPT IN A DARK GARAGE AND OBSERVATION OF THE VEHICLE HAS SHOWN THAT NO SYSTEMS WERE LEFT ON BY THE DRIVER.",
        "vin": "KM8JU3AG8EU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970004,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STAINLESS STEEL FUEL TUBE REPLACED FOR SECOND TIME IN 15 MONTHS; FIRST TIME WHEN ENGINE BLEW (PISTON CAME APART) AND SECOND TIME 2 DAYS  AFTER ROUTINE MAINTENANCE PERFORMED AT DEALERSHIP (EFI SERVICE). FUEL LEAK DEVELOPED WHEN FUEL PUMP RUNNING AS CAR BEING DRIVEN AT 70 MPH.  STRONG FUEL SMELL IN VEHICLE WHILE DRIVING AND FUEL WAS RUNNING OUT AT RAPID RATE. CAR STARTED TO STALL ON INTERSTATE 10 W BETWEEN HOUSTON AND SAN ANTONIO.   I WOULD LIKE A RECORD OF THIS OCCURRENCE IN ORDER TO DETERMINE IF PART IS DEFECTIVE OR MECHANIC AT FAULT. THIS IS THE SECOND REPORT I HAVE FILED IN REGARDS TO THIS VEHICLE. THE PART NUMBER ASSOCIATED WITH THIS FUEL TUBE IS 35305-2G700.  THE FIRST REPORT  WAS WHEN THE ENGINE BLEW NOVEMBER 2015 WHILE COMING OFF I-57S IN BOURBONNAIS, ILLINOIS.  THAT REPORT NUMBER IS 10807620. 3 INVOICES OF REPAIRS SHOULD BE ATTACHED.",
        "vin": "KM8JUCAG1EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2017",
        "dateOfIncident": "03/09/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966051,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ENGINE HAD SEIZED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 103,175.",
        "vin": "KM8JU3AG3EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/09/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906952,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR AT 55 MPH, THE ENGINE DIED COMPLETELY AND I LOST ALL CONTROL OF THE CARS FUNCTIONS.  IT COULD NOT BE THAT THE BATTERY DIED, SINCE EVEN THOUGH THE CAR WOULD NOT START BACK UP, THE LIGHTS, NAVIGATION AND RADIO WE ALL STILL ON AND WORKING.  I THOUGH IT WAS A STRANGE AND DANGEROUS SITUATION BUT FIGURED IT WAS A ONE TIME OCCURRENCE.  THIS HAPPEN ON SEPTEMBER 9TH OF 2016.  SINCE THEN, THE CAR HAS DIED WHILE IN MOTION 4 MORE TIMES, BECOMING MORE FREQUENT AFTER EACH OCCURRENCE.  I TOOK MY CAR IN TO THE DEALERSHIP WHERE I PURCHASED IT AND THEY KEPT IT OVERNIGHT.  I ALREADY HAD SOMEONE AT AN ADVANCED AUTO PARTS STORE TEST MY BATTERY, ALTERNATOR AND STARTER, AND ALL OF THOSE CHECKED OUT FINE.  I SHOULD ALSO MENTION THAT WHENEVER THE CAR DID DIE WHILE I WAS DRIVING, THERE WAS NO WARNING THAT IT WAS GOING TO DIE AND NO CHECK ENGINE LIGHTS CAME ON BEFORE AFTER IT WOULD DIE.  THE VEHICLE WOULD ALWAYS START UP AGAIN AFTER WAITING A FEW MINUTES.  I HAVE BEEN LUCKY THAT EACH TIME IT HAS HAPPENED I WAS NOT ON THE HIGHWAY OR IN ANY DANGER OF HITTING SOMEONE, BUT I GUESS I WAS JUST LUCKY FOR THAT.  AFTER TESTING THE CAR, I WAS INFORMED BY THE DEALERSHIP THAT THEY COULD NOT FIND ANYTHING WRONG WITH THE CAR AND THEIR TESTING OF THE COMPUTER REVEALED THAT NO PROBLEMS HAD OCCURRED.  THIS IS MOST LIKELY DUE TO NO WARNING LIGHTS COMING ON WHEN IT HAPPENED SO WHEN THEY TESTED IT, NOTHING APPEARED SAYING THE CAR HAD DIED.  THEY WERE TOTALLY FINE WITH GIVING ME THE CAR BACK AFTER NOT BEING ABLE TO DIAGNOSE THE PROBLEM, EVEN AFTER I TOLD THEM THEY ARE ALLOWING ME TO GET BEHIND THE WHEEL OF A DANGEROUS VEHICLE.  I WAS ABLE TO DRIVE HOME FROM THE DEALERSHIP YESTERDAY AND TO WORK TODAY WITHOUT EXPERIENCING ANY NEW PROBLEMS SO I AM HOPING THAT THE ISSUE HAS BEEN RESOLVED SOMEHOW.  IF THIS HAPPENS AGAIN I KNOW I WILL NOT BE BRINGING IT BACK TO THAT SERVICE CENTER.",
        "vin": "KM8JUCAG9EU"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "07/10/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885092,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY I WAS AT A FLAT DIRT LOT AT A BOAT RAMP... AFTER MY FISHING TRIP I HOPPED INTO THE CAR PUT IT IN REVERSE... BACKED OUT OF MY SPOT CAREFUL TO LOOK BEHIND AT ALL THE TRAILERS AROUND ME... STOPPED AND SHIFTED INTO DRIVE... THE BACKUP CAMERA TURNED OFF AND THE D LIT UP ON THE DASH... I STEPPED ON THE GAS AND THE CAR WENT IN REVERSE... RIGHT INTO AN EMPTY TRAILER I HAD BEEN SO CAREFUL TO AVOID IN THE FIRST PLACE. THANKFULLY NO DAMAGE HAPPENED TO THE TRUCK TOWING THE TRAILER OR THE STEEL FRAMED BOAT TRAILER ITSELF, BUT I HAVE A LARGE DENT IN THE BOTTOM HALF OF THE BUMPER. I TOOK IT TO THE DEALERSHIP AND THEY HAD IT ALL DAY ON TUESDAY AND COULDN'T FIGURE OUT WHAT COULD HAVE HAPPENED. SO BASICALLY I AM STUCK WITH A LARGE DENT AND NO FIX... THEN THIS MORNING (FRIDAY) I BACKED OUT OF MY PARKING SPOT AT HOME... AGAIN A FLAT LOT ONLY THIS TIME ITS PAVED... AND AFTER SHIFTING INTO DRIVE IT AGAIN WAS STUCK IN REVERSE... I HAD TO STOP PUT THE CAR IN PARK AND THEN SHIFT TO DRIVE TO GET IT TO WORK. SUPER FRUSTRATING!!!!  THIS CAN POTENTIALLY BE EXTREMELY DANGEROUS IF SOMEONE IS BEHIND THE CAR WHEN IT HAPPENS AND THE BRAKES AREN'T APPLIED FAST ENOUGH.",
        "vin": "KM8JUCAG6EU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/24/2016",
        "dateOfIncident": "04/24/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861125,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAKING A LEFT HAND TURN THROUGH AN INTERSECTION IN THE OUTSIDE LANE ONTO THE ENTRANCE RAMP TO THE INTERSTATE. JUST BEFORE I COMPLETED THE TURN MY VEHICLE SWUNG WIDE TO THE RIGHT AND ACCELERATED, THE DRIVERS SIDE WHEEL BRAKED AND LOCKED AND THE VEHICLE CONTINUED TO SPIN ON THAT TIRE. WHEN IT CAME TO A STOP I WAS FACING THE DIRECTION I HAD COME.  FORTUNATELY OTHER CARS WERE ABLE TO AVOID ME AND I WAS ABLE TO MOVE THE VEHICLE OUT OF THE WAY.  IT SEEMS THIS MODEL HAD A KNOWN ISSUE IN 2005.  (I DID SOME RESEARCH WHEN I GOT HOME AND STOPPED TREMBLING.)  I CANNOT FIND WHERE ANYONE HAS REPORTED THIS ISSUE YET.  THIS IS A HORRIBLY DANGEROUS PROBLEM.  I'M VERY LUCKY AND SO ARE THE PEOPLE ON THE ROAD WITH ME.",
        "vin": "KM8JUCAGXEU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "04/30/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836470,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUSCON. WHILE DRIVING 40 MPH, THE BRAKE PEDAL WAS DEPRESSED AND THE CONTACT HEARD AN ABNORMAL NOISE COMING FROM THE ACCELERATOR PEDAL. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ROTORS WERE CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 14,236.",
        "vin": "KM8JT3AF3EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "11/28/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807620,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT 35 MPH, THE VEHICLE STALLED. THE CONTACT STATED THAT UNKNOWN WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT CYLINDER FOUR MISFIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 9,890. ...UPDATED 02/04/16 *BF.  UPDATED 04/30/18*JB",
        "vin": "KM8JUCAG1EU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2015",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806447,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS TOWED TO A DEALER WHERE THE BATTERY WAS CHARGED, BUT THE FAILURE RECURRED MULTIPLE TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,700.  UPDATED 02/18/16*LJ; 4/27/18*JB  *TR",
        "vin": "KM8JU3AG2EU"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "08/08/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806179,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS LESS THAN 9K MILES; PURCHASED NEW IN FEBRUARY 2014.  THIRTEEN (13) MONTHS AFTER OWNING, ALL THE WARNING LIGHTS ON THE DASHBOARDS CAME ON AND OFF RANDOMLY AND THEN WERE ON PERMANENTLY (CITY DRIVING); ALSO POWER STEERING WAS GONE.  BROUGHT VEHICLE TO THE DEALER WITH NO VEHICLE FOR 4 DAYS.  PICKED VEHICLE UP, DROVE HOME AND THREE (3) DAYS LATER (CITY DRIVING), ALL LIGHTS BACK ON.  BROUGHT VEHICLE TO DEALER; GIVEN LOANER CAR FOR 9 DAYS.  PICKED VEHICLE UP, DROVE HOME (45 MINUTES ON HIGHWAY), TWO (2) DAYS AFTER CITY DRIVING, CALLED DEALER TO TELL THEM THAT THE PROBLEM WAS BACK AGAIN.  CAR HAS NOW BEEN IN SHOP FOR 12 DAYS; DEALER UNABLE TO FIND ROOT CAUSE.  NOT SURE WHEN I WILL GET THE VEHICLE BACK.  PERSONALLY, I DON'T WANT IT ANYMORE; EVERY TRIP TO THE DEALER FOR ME IS A 45 MINUTE DRIVE...VERY INCONVENIENT SITUATION.  I THINK IT'S A LEMON.",
        "vin": ""
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "08/08/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806208,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ADDENDUM TO COMPLAINT #10806179:  DASHBOARD WARNING LIGHTS THAT KEEP COMING ON AND OFF AND PERMANENTLY STAYING ON ARE THE PARKING BRAKE, ABS SERVICE INDICATOR, 4WD SYSTEM WARNING LIGHT, LOW TIRE PRESSURE TELLTALE.  ALL OF THESE WARNING LIGHTS TELL YOU TO BRING TO YOUR DEALER AS SOON AS POSSIBLE AS SEVERE INJURY OR DEATH COULD OCCUR.  I REALLY THINK THIS IS A SAFETY ISSUE THAT SHOULD BE LOOKED INTO.  THANK YOU.  NOT SURE WHERE ELSE TO GO WITH THIS; HAVE SENT HYUNDAI USA AN EMAIL AS WELL.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/27/2015",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777907,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOOSE POWER STEERING.  THE STEERING WHEEL IS SO LOOSE YOU HAVE TO HANG ONTO TO KEEP THE CAR ON THE ROAD.  IT HAPPENS FREQUENTLY WHEN DRIVING OVER A STRETCH OF ROAD THAT IS BEEN PATCHED ( AND THERE ARE MANY STRETCHES LIKE THAT IN NJ) BUT THAT IS NOT ALWAYS THE CASE.  THERE IS NO CLEAR PATTERN TO THIS SITUATION.  GENERALLY IT HAPPENS ONCE AND THEN NOT AGAIN FOR A COUPLE OF DAYS - THEN THE LIGHTS ON THE DASH COME INDICATING ISSUES WITH THE STEERING, TIRE PRESSURE AND ENGINE MALFUNCTION.  FIRST GO AROUND WAS SEPT. 2014 @ 6,800 MILES.  IT WAS TAKEN INTO HYUNDAI - THE TEST DROVE IT FOR A COUPLE OF DAYS UNTIL THE PROBLEM OCCURRED FOR THEM.  THE STEERING COLUMN (UPPER ASSEMBLY) WAS REPLACED.  A YEAR GOES BY (SEPT. 2015) AND IT STARTS AGAIN @14,800 MILES. SAME PROCEDURE AS LAST YEAR - PICK VEHICLE UP AFTER 9 DAYS - 2 HOURS LATER, SAME THING, NO STEERING ALL THE LIGHTS COME.  THIS TIME THE CLEANED GROUNDS.  ONE WEEK LATER SAME SITUATION .DRIVING  THIS VEHICLE IS EXTREMELY TENSE, MANY TIMES I HAVE TO PULL OFF THE ROAD AND WAIT FOR OTHERS TO PASS.  AND HOPE THAT IS CORRECTS ITSELF, WHICH IT DOES SOMETIMES BUT FOR HOW LONG I NEVER KNOW.",
        "vin": "KM8JTCAF1EU"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681760,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE IN JANUARY 2014.  WITHIN 500 MILE I NOTICED A STRONG VIBRATION IN THE FRONT SUSPENSION. MORE ACCURATELY IT WAS A BOUNCING (UP AND DOWN) OF THE FRONT OF THE VEHICLE.  THE VEHICLE WAS RETURNED TO THE DEALER MULTIPLE TIMES AND THE DEALER SERVICE DEPARTMENT VERIFIED THAT THE CONDITION EXISTED. THEY ROTATED AND BALANCE THE TIRES SEVERAL TIMES.  THIS DID NOT SOLVE THE PROBLEM. THEY CHANGED A DRIVE SHAFT. THIS DID NOT SOLVE THE PROBLEM.  THEY REPLACED MY WHEELS AND TIRES WITH A SET FROM ANOTHER 2014 TUCSON.  AGAIN, NO CHANGE.  THE VEHICLE CONTINUED TO EXHIBIT A VERY PRONOUNCED BOUNCE IN THE FRONT SUSPENSION.  I FILED A COMPLAINT WITH HYUNDAI AND RECEIVED A CASE NUMBER.  I RETURNED TO MY DEALER AND REQUESTED TO TAKE ANOTHER 2014 HYUNDAI TUCSON FOR A TEST DRIVE.  THIS VEHICLE HAD THE SAME BOUNCE IN THE FRONT SUSPENSION.  I CONTACTED HYUNDAI AND INFORMED THEM THAT MULTIPLE TUCSONS HAD THE SAME PROBLEM. HYUNDAI'S ANSWER WAS THAT IT MUST BE A CHARACTERISTIC OF THE VEHICLE. THAT CLOSED THE CASE AS FAR AS HYUNDAI WAS CONCERNED.     I BELIEVE THIS IS AN UNSAFE \"CHARACTERISTIC\" AND DO NOT BELIEVE THAT HYUNDAI OR ANY OTHER MANUFACTURER WOULD DESIGN A VEHICLE WITH A BOUNCE IN THE FRONT SUSPENSION.  THIS IS A SAFETY ISSUE THAT SHOULD BE INVESTIGATED AND CORRECTED BEFORE SOME SORT OF ACCIDENT TAKES PLACE.  THIS FRONT SUSPENSION BOUNCE MAKES THE VEHICLE FEEL VERY UNSAFE IN INCLEMENT WEATHER SUCH AS RAIN, SNOW AND ICY ROAD CONDITIONS.    HYUNDAI HAS CLOSED THE CASE AND REFUSES TO RE-OPEN IT OR PERFORM ANY FURTHER INVESTIGATION.  THEIR DETERMINATION THAT THIS IS A VEHICLE \"CHARACTERISTIC\" IS BASED ON THE DRIVING OF 2 VEHICLES.  I BELIEVE AN UNSAFE CONDITION LIKE THIS SHOULD BE INVESTIGATED.  HYUNDAI IS DOING ABSOLUTELY NOTHING TO SOLVE THIS PROBLEM.   *JS",
        "vin": "KM8JTCAFXEU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "12/10/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669369,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTE:  THERE ARE TWO SUNROOFS ON THIS VEHICLE; ONE FORWARD, OVER THE TWO FRONT SEATS,  AND THE OTHER OVER THE BACK SEAT.  WHILE DRIVING ON THE FREEWAY, THE FORWARD SUNROOF EXPLODED -  GLASS FLYING EVERYWHERE - THERE WAS NOTHING LEFT.   I CAN'T BELIEVE MY HEAD AND FACE WERE NOT CUT AND BLEEDING.  THE POSSIBILITY OF ROCKS BEING THROWN FROM SOMEONE ON THE SIDE OF THE ROAD IS NIL: NO ONE WAS THERE.   NEARBY VEHICLES WERE NOT FAR ENOUGH AWAY TO ALLOW THE NECESSARY TRAJECTORY FOR A ROCK SENT AIRBORNE FROM THEIR VEHICLES' TIRES TO LAND ON THE ROOF OF MY VEHICLE.   I HAVE NO EXPLANATION OR REASON AS TO HOW OR WHY THIS HAPPENED.   NOW I'M OUT $500.00 FOR MY DEDUCTIBLE, FOR SOMETHING THAT I CAN'T EXPLAIN.    *JS",
        "vin": "KM8JUCAG9EU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2014",
        "dateOfIncident": "03/26/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664148,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 7500 I REPORTED ENGINE WAS UNUSUALLY THEY TOLD ME IT WAS CHARACTERISTIC OF THE CAR AT 18000 MILES THEY REPLACED THE SHORT BLOCK. AT 26000 MILES THEY REPLACED IT A 2ND TIME. THE CAR ALSO HESITATES ON OCCASION WHEN FROM A STOP I STEP ON THE GAS THEN TAKES OFF. THEY SAYS IT'S CHARACTERISTIC OF THE CAR AND WE COULD NOT DUPLICATE IN THE 3 MILE RIDE WE TOOK THEY SENT ME HOME WITH IT I FEEL THIS IS VERY DANGEROUS. AT 28500 MILES THE LEFT SIDE OF THE CAR DIRECTIONAL LIGHTS WONT GO OFF EVEN IT'S STUCK ON 24/7. IN SHOP AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663804,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 HYUNDAI TUCSON. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 3,000.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/25/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639060,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 20 MPH, THE VEHICLE WOULD TRAVEL OVER BUMPS AND POT HOLES VERY ROUGHLY. THE PROBLEM RECURRED TWENTY TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,000.",
        "vin": "KM8JUCAG0EU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "08/22/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629448,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE STEERING WHEEL SUDDENLY BECAME SO LOOSE I HAD TO TOLD THE WHEEL VERY STILL BECAUSE IF YOU TOUCHED SLIGHTLY THE CAR WOULD SWERVE EITHER TO THE LEFT OR RIGHT THIS CONTINUED FOR SEVERAL MINUTES AND THEN CORRECT ITSELF.  THIS HAPPENED ANY TIMES - THEN LIGHTS ON THE DASHBOARD CAME ON - THE AIR PRESSURE, BATTERY AND ENGINE LIGHT AND THE STEERING LIGHT.  THE NEXT DAY EVERYTHING WAS FINE NO LIGHTS - THEN THE STEERING WENT LOOSE AGAIN AND THE LIGHTS CAME ON.  CALLED THE DEALERSHIP WHERE I BOUGHT THE CAR AND WAS TOLD THEY COULD SEE THE CAR FOR A WEEK.  ANOTHER HAD ME COME IN THE NEXT DAY BUT WAS TOLD THE CAR DID SHOW THE LIGHTS SO THEY CLEARED THE COMPUTER AND RESET IT BUT THEY COULD DO NOTHING MORE UNLESS THE LIGHTS CAME BACK ON.  I COULD BRING THE CAR BACK WHEN IT HAPPENED AGAIN.  I WAS NO SOONER OUT OF THE DEALERSHIP AND THE STEERING WENT AND THE LIGHTS CAME BACK ON - I TURNED AROUND AND HEADED BACK - JUST I GOT THERE THE LIGHTS WENT OFF AND THE STEERING WAS NORMAL SO I DID NOT GO BACK IN.  IT IS UNCOMFORTABLE DRIVING THE CAR KNOWING THIS COULD HAPPEN AT ANYTIME AND NOTHING HAS BEEN FIXED.  IN THE MEANTIME, NO ONE HAS A LOANER CAR AND THIS IS THE ONLY CAR WE HAVE.  I WILL GO BACK NEXT WEEK FOR FURTHER OBSERVATION.    *TR",
        "vin": "KM8JTCAF1EU"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "01/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615423,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2014 HYUNDAI TUCSON GLS FROM MY LOCAL HYUNDAI DEALER. SHORTLY AFTER PURCHASING THE CAR, I NOTICED A STRONG VIBRATION THAT SEEMED TO COME FROM UNBALANCED TIRES.   I TOOK THE CAR IN FOR THE FIRST TIME AND THEY FOUND IT WAS UNBALANCED AND PROCEEDED TO BALANCE THE CAR. HOWEVER, THIS DID NOT FIX THE PROBLEM. I STILL NOTICED A SLIGHT VIBRATION WHEN I DROVE THE CAR, AND IT WAS ESPECIALLY BAD AT 50MPH. I TOOK IT BACK FOR A SECOND TIME TO THE HYUNDAI DEALER AND THEY BALANCED THE CAR AGAIN, BUT ONLY A VERY SMALL AMOUNT. AGAIN, BALANCING THE TIRES MADE NO DIFFERENCE.   I TOOK IT BACK TO THE DEALER FOR A THIRD TIME AND RODE IN THE CAR WITH THE LEAD MECHANIC AT THAT LOCATION. HE ALSO NOTICED THE VIBRATION AND ASKED I LEAVE THE CAR WITH HIM. HE THEN TESTED ONE OF THE OTHER TUCSONS ON THEIR LOT THAT WAS THE SAME TRIM MODEL AND HAD THE SAME TIRES. HE REQUESTED I GO WITH HIM IN THAT CAR, AND WE FELT THE SAME VIBRATION AS IN MY CAR. HE DIAGNOSED THE ISSUE AS A CHARACTERISTIC OF THE VEHICLE. ON COLD MORNINGS, THE CAR VIBRATES SO BADLY IT CHATTERS MY TEETH AND FEELS UNSAFE TO DRIVE. MY CONCERN IS THAT IT WILL ONLY CONTINUE GET WORSE WITH TIME, CAUSING PERMANENT DAMAGE. EVEN THOUGH THE CAR HAS A GREAT WARRANTY, I STILL FEEL UNCOMFORTABLE DRIVING IT AND AM RELUCTANT TO TAKE IT ON LONG TRIPS. I CURRENTLY HAVE A CASE OPEN WITH HYUNDAI MOTORS USA. THE CASE WAS OPENED IN MARCH OF 2014 AND HYUNDAI FEELS IT CAN BE SOLVED BY REPLACING THE TIRES. I HAVE NOT DONE THAT YET AS THEY WILL NOT GIVE ME COUPONS FOR THE FULL PRICE OF THE TIRES. THE VIBRATION HAS STARTED TO GROW NOTICEABLY WORSE AND I AM CONCERNED FOR BOTH MY SAFETY AND OTHER PEOPLE THAT MAY HAVE THE SAME CAR.   *TR",
        "vin": "KM8JU3AG5EU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/28/2014",
        "dateOfIncident": "05/28/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594668,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN DRY CONDITIONS AND STEERING COMPLETELY FAILED. 2014 HYUNDAI TUCSON WITH 3200 MILES. BOUGHT BRAND NEW 3 MONTHS AGO IN MARCH 2014.  *TR",
        "vin": ""
    }
]