[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/04/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882427,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "VULCAN 1700 VAQUERO",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED A COMMONLY-REPORTED (SEE INTERNET OWNER GROUPS SUCH AS \"REDDIT\", \"WWW.VULCANFORUMS.COM\", \"THE VULCAN BAGGER ASSOCIATION\", ETC.) CRUISE CONTROL AND BRAKE LIGHT FAILURE DURING THE WARRANTY PERIOD.  THE SWITCHES LOCATED UNDER THE VARIOUS CONTROLS OF THE MOTORCYCLE (CLUTCH, FRONT BRAKE, REAR BRAKE) ARE NOT SEALED AND IN INCLEMENT WEATHER CAN BECOME CORRODED AND FAIL.  WHEN THESE SWITCHES FAIL, A NUMBER OF ISSUES ARE DESCRIBED BY OWNERS; SUCH AS CRUISE CONTROL FAILING TO DISENGAGE, CRUISE CONTROL FAILING TO ENGAGE, AND BRAKE LIGHTS NOT ILLUMINATING.    THE LATTER WAS MY ISSUE.  TWO SWITCHES HAD FAILED (CLUTCH AND FRONT BRAKE) AND A THIRD HAD BECOME DIRTY (REAR BRAKE) AFTER A RECENT TRIP.  I DON'T KNOW HOW LONG THEY HAD FAILED; I ONLY NOTICED IT DURING A ROUTINE PRE-RIDE SAFETY INSPECTION, IN WHICH I NOTICED THAT THE BRAKE LIGHT WOULD NOT ILLUMINATE WHEN I APPLIED THE FRONT BRAKE.  IN ADDITION TO ISSUES WITH CRUISE CONTROL FAILING TO DISENGAGE, THE GREATEST SAFETY ISSUE IS THAT DRIVERS BEHIND ME WON'T KNOW I'M APPLYING THE BRAKES.  WHEN THESE SWITCHES FAIL, THEY FAIL WITHOUT ANY WARNING OR FEEDBACK TO THE RIDER, UNLESS THE RIDER EXPLICITLY CHECKS THE REAR TAIL-LIGHT FUNCTION AS I DID.    I HAD THE VEHICLE REPAIRED, UNDER WARRANTY, AT JIM TRENARY MOTORSPORTS IN WASHINGTON, MO, WHICH INCLUDED REPLACING PART NUMBER 27010-1232 (FRONT BRAKE LIGHT / CRUISE CONTROL SWITCH), AND REPAIRING TWO OTHER PARTS (CLUTCH AND REAR BRAKE SWITCH).    THE VEHICLE WAS STATIONARY WHEN I DISCOVERED THE PROBLEM, HOWEVER THE PROBLEM PERSISTED WHEN THE VEHICLE WAS IN MOTION.  AS MENTIONED ABOVE, THIS ISSUE IS COMMONLY REPORTED ON ONLINE COMMUNITIES AND INTERNET MESSAGE BOARDS; MOST COMMONLY RELATED TO THE CRUISE CONTROL SYSTEM.  HOWEVER, AS THE CRUISE AND TAIL-LIGHT SWITCHES SHARE A HOUSING AND ARE A COMMON PART NUMBER; THE ISSUE CAN BECOME A SAFETY ISSUE UNBENKNOWNST TO THE RIDER.",
        "vin": "JKBVNRK17EA"
    }
]