[
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115549,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON  10 FREEWAY IN CALIFORNIA WAS MOTIONED BY A PASSING CAR THAT WE HAD A PROBLEM WITH SPARE TIRE ON THE BACK OF OUR RV FIFTHWHEEL. WHEN WE PULLED OVER THE SPARE TIRE WAS NEARLY ON THE GROUND. THE BUMPER WHICH HOLDS THE SPARE TIRE HAD BASICALLY RIPPED AND WAS PEELING AWAY( FROM THE WELDS )AND WAS JUST BARELY HOLDING ON. WHEN  WE BOUGHT THE FIFTHWHEEL (BRAND NEW, NOT USED) WE DID NOT ADD OR CHANGE ANYTHING. WE FOUND RECALLS ON THIS EXACT THING,BUT WHEN NOTIFING KEYSTONE ALL THEY WOULD SAY WAS IT WAS OUT OF WARRANTY AND RECALL NOT GOOD ON OUR YEAR. I ASKED SEVERAL TIMES FOR SOMEONE HIGHER UP TO TALK TO BUT WAS NOT GIVEN ANY INFORMATION. THIS  BICYCLE RACK/ BUMPER WAS INSTALLED BY FACTORY AND WAS RECALLED ON 2008,2010,2012 MODELS. THIS COULD HAVE CAUSED A MAJOR ACCIDENT ON A VERY BUISY FREEWAY AND KEYSTONE IS NOT INTERESTED IN HELPING WITH THIS PROBLEM",
        "vin": "4YDF31823E2"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885443,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC BRAKES HAVE A VERY FLIMSY CONNECTION BEHIND EACH BRAKE PLATE.  A VERY SMALL WIRE IS EXPOSED TO THE ELEMENTS.  IN OUR CASE, SOMETHING BROKE THE WIRE AND THE BRAKES FAILED.  KEYSTONE HAD THEIR DEALER REPAIR THE WIRE TO ITS ORIGINAL FLIMSY STATE.     A FEW MONTHS AGO THE TRAILER BRAKES WERE IRRATIC (UNRELIABLE).  I TOOK THE TRAILER TO REPAIR FACILITY.  IN SEARCHING FOR THE PROBLEM, THEY DISCOVERED THAT THE RUBBER GASKET ON ALL FOUR INNER GREASE SEALS WERE SEVERELY DAMAGED BECAUSE THEY WERE UNDERSIZED.  IF THE GREASE ISN'T CONTAINED IN THE BEARINGS, EVENTUALLY THE WHEELS WILL FALL OFF. PICTURES ARE ATTACHED.    THE HEAT IN THE INTERIOR LIGHTS HAS ALWAYS BEEN OF CONCERN. PICTURES OF A PARTIALLY MELTED LIGHT BULB AND LENSES ARE ATTACHED.  VARIOUS ARTICLES SAY GLASS WILL MELT AT 900F  ISN'T A 900F A FIRE HAZARD. I REPLACED THE BULBS WITH LED'S WHICH WAS A SIMPLE PROCESS.     I WROTE TO THE PRESIDENT OF KEYSTONE.  HE SAID THE DIRECTOR OF OWNER RELATIONS CALL ME; SHE THE CONDITIONS I REPORTED WERE NORMAL AND  THAT KEYSTONE WOULDN'T PARTICIPATE IN FIXING THESE ISSUES NOR REIMBURSE ME FOR FIXING THESE PROBLEMS.",
        "vin": "4YDF29R23E2"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875842,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 KEYSTONE COUGAR RV. WHILE DRIVING 65 MPH, THE AWNING MOTOR DETACHED. THE RV WAS TAKEN TO AN RV DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.  UPDATED 08/17/16*LJ  THE CONSUMER WAS INFORMED THERE WAS A RECALL. HOWEVER, HIS UNIT WAS NOT INCLUDED. UPDATED 08/22/16.*JB",
        "vin": "4YDF28S24EV"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/17/2016",
        "dateOfIncident": "12/16/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865339,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2014 COUGAR FIFTH WHEEL- MODEL 29RET     THE HEAT IN THE INTERIOR LIGHTS HAS ALWAYS BEEN OF CONCERN.     SO, I ORDERED LED REPLACEMENTS FOR THE 921 BULBS YOUR INSTALLED.     UPON INSPECTION (SEE PICTURES)  YOU'LL SEE THAT SOME OF THE ORIGINAL 921 BULBS ARE DISFIGURED BECAUSE OF THE EXCESSIVE HEAT AND ONE OF THE LENSES HAS BEEN DEFORMED.   IT HAS TO TAKE A LOT OF HEAT TO MELT A LIGHT BULB.  THIS HAS TO BE A FIRE HAZARD.",
        "vin": "4YDF29R23E2"
    }
]