[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716368,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "2 WEEKS AGO WHILE TRAVELING ON INTERSTATE 20 IN EAST TEXAS ONE OF MY TIRES ON MY 2014 300RB SEPARATED AND DID $9K WORTH OF DAMAGE TO MY RV SEVERING GAS LINES, ELECTRICAL LINES AND DESTROYED MY CABINETS! THIS TIRE DID NOT EXPLODE. IN FACT IT WAS STILL AIRED UP TO 70 PSI WHEN I STOPPED!!!!! THE TREAD LITERALLY JUST FELL OF THE TIRE!!!!! AND WHEN I STOPPED TO PUT THE SPARE ON I NOTICED ANTHER TIRE WAS ABOUT TO SEPARATE TOO! THIS COMPANY DYNAMIC TIRE THAT MAKES THE POWER KING TOWMAX BRAND TRAILER TIRES SHOULD NOT BE ABLE TO SELL THESE TIRES TO THE PUBLIC! PERIOD!    AFTER READING NUMEROUS SEPARATION ISSUES WHY HAVEN'T THEY BEEN RECALLED?    SIZE WAS A D RATED TIRE 225/ 75R15  LET ME STATE SOME FACTS:     1. THE TIRES WERE ONLY 2.5 YEARS OLD. I'M NO DUMMY I CAN READ A DATE CODE ON MY TIRES.   2. I WAS TRAVELING AT 60 MPH.   3. I WAS NOT OVERLOADED. IN FACT EVERY TIME I TOW I DUMP ALL TANKS INCLUDING THE HOT WATER HEATER. THE SPECS ON THE TRAILER SAYS I SHOULD BE ABLE TO CARRY UP TO 1,300 LBS OF CARGO. I WASN'T EVEN CLOSE TO THAT!!!!! WE PACK LIGHTLY!  4. I HAVE DRIVEN, TRAILERS, BOATS, ETC ALL ACROSS THE COUNTRY FOR 20 YEARS AND NEVER HAD A TIRE SEPARATE LIKE THIS ONE DID! I AM IN A CLAIMS PROCESS WITH DYNAMIC TIRE CO. WHO MAKES THE POWER KING TIRES RIGHT NOW.  POWER KING IS [XXX] LUCKY THAT NO ONE WAS KILLED!    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4YDT30024EB"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713258,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2 WEEKS AGO WHILE TRAVELING ON INTERSTATE 20 IN EAST TEXAS ONE OF MY TIRES ON MY 2014 300RB SEPARATED AND DID $9K WORTH OF DAMAGE TO MY RV SEVERING GAS LINES, ELECTRICAL LINES AND DESTROYED MY CABINETS! THIS TIRE DID NOT EXPLODE. IN FACT IT WAS STILL AIRED UP TO 70 PSI WHEN I STOPPED!!!!! THE TREAD LITERALLY JUST FELL OF THE  TIRE!!!!! AND WHEN I STOPPED TO PUT THE SPARE ON I NOTICED ANTHER TIRE WAS ABOUT TO SEPARATE TOO!   THIS COMPANY DYNAMIC TIRE THAT MAKES THE POWER KING BRAND TRAILER TIRES SHOULD NOT BE ABLE TO SELL THESE TIRES TO THE PUBLIC!  PERIOD!  *TR",
        "vin": "4YDT30024EB"
    }
]