[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/12/2015",
        "dateOfIncident": "05/08/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716884,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA HIGH COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN INFORMED THAT YOU ARE TRACKING THE SUBJECT RECALL.  I WAS SENT A COPY FROM KEYSTONE. I HAVE A CONCERN ABOUT THIS RECALL.  I TOOK MY KEYSTONE 2014 MONTANA 3402RL TO TIARA RV IN ELKHART, IN SO THEY COULD DO THE RECALL.  THEY ASSURED ME THEY USE THE OFFICIAL RECALL REPAIR.  ON THE SECOND DAY OF USE, RETURNING FROM TIARA, A TRIP OF ABOUT 500 MILES, THE STEP FAILED AGAIN AS IT DID PRIOR TO THE RECALL.  HOWEVER, THIS TIME INSTEAD OF A RIVET FAILING, THE NUT ON THE TOP BOLT WAS MISSING.  I CHECKED THE OTHER 3 BOLTS/NUTS AND THEY WERE VERY LOOSE AND WOULD HAVE FALLEN OFF WITH A FEW MORE MILES OF VIBRATION.    I COULD SEE THE FLAW OF THIS FIX;  STANDARD BOLTS AND NUTS WITHOUT LOCK WASHERS OR LOCK NUTS WITH NYLON INSERTS IN THE THREADS.  SO FOR MY SANITY, I WENT TO THE HARDWARE STORE AND BOUGHT 4 SS BOLTS LONGER THAN THE RECALL USED AND 4 LOCK NUTS.  SO FAR SO GOOD, I'LL KEEP AN EYE ON MY FIX, BUT I'M CONCERNED THAT THE RECALL FIX I GOT WAS OBVIOUSLY NOT VERY GOOD.  TIARA RV SAID THEY USED THE OFFICIAL FIX, AND KEYSTONE SAID TO TAKE IT TO ANOTHER DEALER.  BUT IT'S NOT WORTH FUEL COST TO TOW THE RV TO ANOTHER DEALER TO MAYBE GET MY FIX REMOVED AND THE POOR OFFICIAL FIX REINSTALLED.    I WOULD LOVE TO GET THE OFFICIAL RECALL REPAIR PARTS SENT TO ME BY MAIL SO I CAN SEE IF IT IS ANY BETTER THAN MY FIX.  BUT WHEN THE 'OFFICIAL' FIX FAILED IN LESS THAN 18 HOURS, EITHER THE FIX IS BAD, OR I DIDN'T GET THE RIGHT FIX.  ...UPDATED 06-12-15 *BF    THE CONSUMER STATED THE MANUFACTURER AMENDED THE REPAIR TO KIT. THE VEHICLE WAS REPAIRED.   UP;DATED 9/18/15 *JS",
        "vin": "4YDF34021E4"
    }
]