[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/05/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458764,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Kia Optima. The contact stated that while driving approximately 60 MPH, the vehicle decelerated with the \"check hybrid battery and check engine\" warning lights displayed. The vehicle was towed to the local dealer who diagnosed that the engine was faulty and needed to be replaced. The vehicle was not yet repaired. The manufacturer was notified of the failure. The failure mileage was 122,000.",
        "vin": "KNAGN4aDXE5"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228890,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/07/19 WHILE TRAVELLING TO WORK ON THE HIGHWAY, TRAVELLING ABOUT 65 MPH, THE DASH DISPLAY READ CHECK HYBRID SYSTEM, AND SUDDENLY SHUT DOWN. ENGINE STOPPED RUNNING, STEERING WHEEL BEGAN STIFFENING, I COASTED FROM THE PASSING LANE TO THE RIGHT LANE AND THEN TO THE SHOULDER WITHOUT INCIDENT AND WAS ABLE TO SAFELY PARK THE CAR. KIA FAILED TO PROVIDE ROADSIDE ASSISTANCE SINCE THE CAR HAS OVER 60,000 MILES(ACTUALLY HAS 95,000 MILES), HOWEVER I AM STILL UNDER THE 10YR/100,000 MILES WARRANTY. THE CAR WAS TOWED TO THE KIA DEALERSHIP VIA MY INSURANCE COVERAGE. AFTER THE ASSESSMENT I WAS TOLD I HAD A BLOWN MAIN HYBRID FUSE. CHARGED $201.24 TO REPLACE THE FUSE. I PRESENT THIS AS A SAFETY ISSUE BECAUSE HAD I BEEN ON A MAJOR HIGHWAY WITH MY GRANDCHILDREN IN THE MIDDLE OF TRAFFIC, THERE WOULD BE NO WAY POSSIBLE TO REACH A LANE SHOULDER WITHOUT POSSIBLE HARM OR DEATH. ACCORDING TO KIA'S OWN \"TECHNICAL OPERATIONS NOTICE - PS515(REV 2, 02/28/2019\" DATED AUGUST 2017), THEY ARE FULLY AWARE OF THIS PROBLEM. THE BATTERY FUSE IS TO BE REPLACED FROM A 125 AMP TO A 150 AMP. THIS FUSE IS PART OF THE SAFETY PLUG LOCATED IN THE TRUNK. AS A OWNER I SHOULD HAVE BEEN WARNED OF THIS POSSIBLY HAPPENING TO THE CAR AND GIVEN THE OPTION TO HAVE THIS FUSE REPLACED....AT KIA'S EXPENSE. FOR THOSE STILL DRIVING THIS YEAR AND MAKE OPTIMA HYBRID,PLEASE BE AWARE OF THIS OCCURRENCE. THE 125 AMP HV BATTERY FUSE SHOULD BE REPLACED WITH THE NEWER 150 AMP HV BATTERY FUSE(PART #375F2 4R150. SEE KIA'S PITSTOP: TECHNICAL OPERATIONS NOTICE #PS515. UNFORTUNATELY MY COMMUNICATION WITH KIA PROVED FRUITLESS.",
        "vin": "KNAGN4AD7E5"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220953,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE FREEWAY WHEN THE DASHBOARD READ 'HEV SYSTEM WARNING. PULL OVER AND SHUT OFF VEHICLE.'  ENGINE THEN SHUT OFF. AFTER NEARLY BEING HIT BY A SEMI-TRUCK, I COASTED FROM THE CARPOOL TO THE OFF RAMP EXIT. THE VEHICLE WAS ABLE TO TRAVEL AT APPROXIMATELY 5-15MPH AND MADE IT HOME SAFELY. I TOWED MY VEHICLE TO THE CITRUS VALLEY MOTORS IN THE CITY OF ONTARIO. THEY RAN DIAGNOSTICS STATING IT WAS A FUSE IN THE ENGINE AND IT WILL COST ME $686.97. KIA RELEASED INFORMATION TO THE PUBLIC STATING THEY KNOW THE 125 FUSE AMP FOR THE HYBRID SYSTEMS WAS THE WRONG SIZE WHICH CAN CAUSE A 'BLOW OUT' TURNING THE ENGINE OFF WHILE DRIVING.  KIA STAYED THEY NEEDED TO REPLACE IT WITH THE 150 AMP FUSE IN ORDER TO SUSTAIN THE POWER TO THE ENGINE. I CALLED KIA EXPRESSING MY CONCERN UNDER THE FEDERAL POLICY 'LEMON LAW.' KIA TOLD ME 'YOUR WARRANTY IS EXPIRED BY 3 WEEKS. WE CAN NOT GIVE YOU ASSISTANCE.' MY VEHICLE SITS IN THE SHOP WITH A WRONG SIZE FUSE AND WANT ME TO PAY FOR THE CORRECT SIZE THAT SHOULD HAVE BEEN PLACED IN THEIR IN THE FIRST PLACE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "01/28/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205076,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEH ON HWY AT ABOUT 70 MILES PER HOUR WHEN WITHIN SECONDS THE CAR JUST TURNS OFF COMPLETELY. SCARY!!!  AFTER TAKING TO LOCAL KIA DEALERSHIP AND THEM BEING STUMPED SO MUCH THEY CALLED AND SPOKE TO KIA ENGINEERS,( TECH LINE CASE REF #13028149) I WAS TOLD I NEEDED TO REPLACE THE PRESSURE SOURCE  UNIT.  I DID, DID NOT FIX IT. IN FACT WHEN I RETURNED THE PART THEY SAID  IT IS NOW NOT WORKING. MECHANIC SUGGESTED A NEW ABS SYSTEM. I ALSO REPLACED THAT.... VEH IS STILL NOT REPAIRED. I HAVE SPENT OVER $1600 AND CAN STILL NOT OPERATE MY VEH SAFELY.   KIA DOES NOT HAVE A CLEAR ANSWER, AND I HAVE SEEN THIS COMPLAINT ON THIS SITE MORE THAN ONCE.  PLEASE RECALL THIS VEHICLE BEFORE SOMEONE GETS HURT.",
        "vin": "KNAGN4AD4E5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195666,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVER ON THE STREET. A WARNING CHECK HEV SYSTEM LIGHT CAME ON. THEN THE CAR ELECTRICAL SYSTEM JUST SHUTDOWN AND I LOST ALL POWER. THE CAR WENT FROM WORKING PERFECT TO COMPLETELY OUT OF POWER IN 30 SECOND.",
        "vin": "KNAGM4AD6E5"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170476,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORMALLY, HCU ERROR POPPED UP ON NAV DISPLAY AS WELL AS DRIVERS DISPLAY. TOLD TO PULL OVER IMMEDIATELY AND TURN OFF ENGINE. I WAS TRAVELING ON ONCE HE INTERSTATE, BY THE TIME I GOT INTO THE EMERGENCY LANE THE CAR COMPLETELY LOST ALL POWER. TURNED ON EMERGENCY HAZARD LIGHTS AND AFTER 5 MINUTES THE CAR WAS COMPLETELY DEAD. CALLED A TOW TRUCK AND BROUGHT IT TO ROCK RIVER KIA IN ROCKDOED, IL. LATER WAS TOLD THAT THE ENGINE HAD SEIZED AND THE HYBRID BATTERY WAS NO LONGER HOLDING A CHARGE. ESTIMATED 14,000 REPAIR COST.",
        "vin": "KNAGN4AD2E5"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2018",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141533,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING UP THE CAR YOU CAN SMELL A RUBBER BURNING SMELL COMIMG FROM THE AIR VENTS. WHEN DRIVING THE VEHICLE SOMETIMES WHILE DRIVING IT THE CAR ACCELERATES ON ITS OWN.",
        "vin": "KNAGM4AD4E5"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2018",
        "dateOfIncident": "08/03/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115845,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STALLED OUT IN THE MIDDLE OF I-25, GOING ABOUT 70 MPH AND RUSH HOUR. I WAS ABOUT 40 MIN FROM HOME STILL ON MY EVERYDAY COMMUNTE. I AM SEEING VERY MANY OTHERS WITH THE SAME ISSUE. THIS HAS ME AND MY FAMILY IN AN UNSAFE SITUATION DAILY AND KIA WILL NOT TAKE RESPONSIBILITY FOR IT. THERE CLEARLY NEEDS TO BE A RECALL ON THE SAME (OR VERY SIMILAR) ISSUE ON THE RECALL ON THE GAS VERSION OF THIS VEHICLE. WE SHOULDN'T WAIT TILL SOMEONE GETS KILLED OR SERIOUSLY INJURED FIRST.",
        "vin": "KNAGM4AD2E5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113426,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD THIS VEHICLE FOR ABOUT 10 MONTHS (PURCHASED OCT. 2017).  A FEW WEEKS AFTER I BOUGHT IT I NOTICED MORE AND MORE THAT THE STEERING IS VERY DIFFICULT TO CONTROL AND KEEP IN A STRAIGHT LINE, ESPECIALLY ON THE FREEWAY ABOVE 55 OR 60 MPH.    ( WHILE DRIVING ON THE FREEWAY THE CAR STARTS TO DRIFT SLOWLY, I TRY TO RE-ADJUST THE STEERING AND WHILE TURNING THE STEERING WHEEL, NOTHING HAPPENS. I TURN A LITTLE MORE AND IT OVER-REACTS MAKING ME DRIFT WAY INTO THE OTHER DIRECTION. I FEEL VERY UNSAFE ON THE FREEWAY IN THIS CAR, ESPECIALLY AROUND BIGGER VEHICLES) I TOOK IT TO 3 DIFFERENT KIA DEALERS TO TRY AND SOLVE THE PROBLEM, THE FIRST SUGGESTED THAT IT NEEDS A 'STEERING WHEEL UPDATE' SINCE IT HAS ELECTRONIC STEERING.  THAT DID NOT SOLVE OR FIX THE PROBLEM.  I TOOK IT TO TWO OTHER DEALERS TRYING TO DIAGNOSE AND FIX THIS UNSAFE BEHAVIOR OF THE CAR. THEY SAID THAT THEY ARE UNABLE TO DUPLICATE MY PROBLEM AND SO THEY CANT FIX ANYTHING ON IT.  I TOLD THEM THAT THEY NEED TO DRIVE IT FOR AT LEAST 15 MINUTES OR SO, ON THE FREEWAY AND ABOVE 55/60 MPH.  THEY SAID THAT THEY STILL CANT DUPLICATE THE PROBLEM.  - - AFTER CALLING KIA CONSUMER AFFAIRS MULTIPLE TIMES AND FLING A REPORT, THEY TELL ME TO TAKE IT TO A KIA DEALER.  I HAVE TAKEN IT TO MULTIPLE DEALERS BUT STILL NO SOLUTION.",
        "vin": "KNAGM4AD9E5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "06/10/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102416,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 KIA OPTIMA HYBRID. WHILE DRIVING APPROXIMATELY 75 MPH, THE HYBRID-ELECTRIC VEHICLE INDICATOR ILLUMINATED AND 'TURN THE ENGINE OFF' DISPLAYED. THE VEHICLE STALLED AND WAS ABLE TO RESTART; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO THE DEALER (MERCED KIA, 1575 W. 16TH ST., MERCED, CA) WHERE IT WAS DIAGNOSED THAT THE HIGH VOLTAGE SYSTEM SAFETY FUSE WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 78,000. *TT",
        "vin": "KNAGM4AD6E5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "03/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096524,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SOUNDS LIKE IT IS GOING TO BLOW UP. VALVES ARE VERY LOUD AND IT LURCHES UNDER ACCELERATION.",
        "vin": "KNAGN4ADXE5"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082000,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" AIRBAG LIGHT ON (CONSTANTLY)",
        "vin": "KNAGM4AD3E5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2018",
        "dateOfIncident": "01/28/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067129,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KIA ALERTED ME TO A HYBRID CHARGING ISSUE BEFORE STALLING AT AN INTERSECTION AND REFUSING TO START AGAIN. I HAD THE VEHICLE TOWED TO THE NEAREST KIA DEALER WHO DID EXTENSIVE DIAGNOSTIC WORK. THEY DETERMINED THAT A 125 AMP FUSE HAD FAILED IN THE HYBRID SAFETY PLUG AND THE APPROPRIATE REPAIR RESPONSE WAS TO REPLACE THAT FUSE WITH A 150 AMP FUSE (PART # 375F2-4R150). I AUTHORIZED THE REPAIR AND MADE SEVERAL PHONE CALLS TO KIA CONSUMER AFFAIRS REQUESTING ADDITIONAL INFORMATION AS IT SEEMED UNLIKELY THAT REPLACEMENT OF A FUSE WITH A LARGER FUSE WAS THE NEEDED REPAIR. I FINALLY REACHED SOMEONE AT CONSUMER AFFAIRS WHO HAD DEALT WITH A SIMILAR ISSUE WITH THE EXACT SAME FUSE. SHE INFORMED ME THAT THERE HAD BEEN A TECHNICAL SERVICE BULLETIN ISSUED ABOUT THIS. SHE STATED THAT THE FUSE WAS DETERMINED TO BE TOO SMALL AND THAT KIA HAD DECIDED TO USE A LARGER FUSE TO PREVENT FUTURE PROBLEMS IN THE SYSTEM. I ASKED WHY I WAS REQUIRED TO PAY FOR THE REPAIR AND SHE TOLD ME THAT IT WAS OUT OF WARRANTY AND THUS MY CHARGE. IF THE WRONG FUSE WAS PLACED IN THE VEHICLE WHEN IT WAS MANUFACTURED, IT SHOULD BE REPLACED BY RECALL OR WARRANTY. SHE WOULD NOT GIVE ME THE TSB # BUT DID STATE THAT IT IS LOCATED IN TSB-PS-515 AND I WAS WELCOME TO HAVE A KIA DEALER PRINT IT FOR ME.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062774,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN MOTION ON A ROAD WITH POSTED SPEED OF 50 MPH.  I HAD TO BRAKE SUDDENLY, AND THE CAR STALLED IN THE FAST LANE.  I IMMEDIATELY PUT FLASHERS ON BECAUSE OF TRAFFIC COMING BEHIND ME.  IT TOOK ABOUT TWO MINUTES TO RESTART THE CAR BECAUSE OF THE PUSH BUTTON START AND THE POWER SEATS HAVING TO POSITION THEMSELVES. VERY SCARY SITUATION AND VERY UNEXPECTED.  I'VE ALSO HAD PROBLEMS WHEN SLOWING DOWN, AND THE CAR HESITATES IN THE TURN.  I'VE ALMOST BEEN HIT TWICE BECAUSE OF THIS.",
        "vin": "KNAGN4ADXE5"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/09/2017",
        "dateOfIncident": "08/20/2017",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032346,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 KIA OPTIMA HYBRID BLEW-UP GOING DOWN THE ROAD! THE ENGINE THREW A ROD THROUGH THE MOTOR WHICH IS THE EXACT MOTOR IN THE RECALL.. IT'S JUST THE HYBRID SO KIA SAYS IT'S NOT RECALLED EVEN THOUGH IT'S THE EXACT RECALL OF THE SAME MOTOR IN THE GAS CAR!! THIS CAR FALLS IN THE EXACT RECALL! PLEASE HELP ME! THE CAR ONLY HAS 72,000MILES ON THE CAR & SHOULD NOT HAVE HAD THIS TO OCCUR!! 3 DIFFERENT MECHANICS HAS TOLD ME IT'S THE EXACT RECALL KIA HAS PUT OUT FOR THE EXACT MOTOR!! KIA IS TELLING ME (IN PAPERWORK) THAT I HAVE TO PAY $10,700.00 FOR A NEW ENGINE WHEN THE PROBLEM IS THE EXACT RECALL IN THE CAR!! AGAIN PLEASE HELP ME WITH THIS! MY NAME IS [XXX] & MY CONTACT EMAIL IS [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNAGM4AD8C5"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015068,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 KIA OPTIMA HYBRID. WHILE DRIVING VARIOUS SPEEDS, THE CHECK ENGINE, HEV, TIRE PRESSURE MONITORING, AND OIL CHANGE WARNING INDICATORS ILLUMINATED. IN ADDITION, THE ENGINE STALLED. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO THE DEALER (FRED ANDERSON KIA OF RALEIGH LOCATED AT 9209 GLENWOOD AVE, RALEIGH, NC 27617; (919) 785-4500). THE DEALER RECALIBRATED THE HYBRID ELECTRIC STARTER GENERATOR. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED FOUR OTHER TIMES. THE VEHICLE WAS TAKEN TO THE SAME DEALER ALL EACH TIME WHERE THEY RECALIBRATED THE CHARGING SYSTEM. LATER, WHEN THE VEHICLE WAS TAKEN BACK TO THE DEALER, THE ENTIRE HYBRID SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE SAME DEALER. THE VEHICLE WAS STILL NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AT 800-333-4542 AND STATED THAT THERE WAS A SEALED CRACK IN THE HYBRID BATTERY WHERE THE COOLANT WAS HELD. THE FAILURE MILEAGE WAS 31,885.",
        "vin": "KNAGN4AD1E5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "07/12/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006507,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A FOUR LANE HIGHWAY WITH MY 4 YR OLD AND 7 YR OLD.  LITERALLY AS I PULLED OFF ONTO THE OFF RAMP, MY DASH LIT UP STATING \"HYBRID SYSTEM NOT CHARGED. PULL OFF AND TURN OFF ENGINE\" I DID NOT EVEN HAVE TIME TO DO THIS WHEN THE ENGINE SHUT OFF IN AN EXTREMELY DANGEROUS PLACE. IF THIS HAD HAPPENED WHILE DRIVING ON THE HIGHWAY, WE COULD HAVE BEEN KILLED.  AFTER HOURS SPENT HAVING TO CONVINCE THE DEALERSHIP TO TOW THE VEHICLE AND PROVIDE A RIDE FOR ME AND MY CHILDREN, WE FINALLY WERE ABLE TO GET A RENTAL.  KIA SAID THE HYBRID BATTERY DIED BUT IT IS ON BACK ORDER AND NOT AVAILABLE IN THE UNITED STATES UNTIL OCTOBER (3 MONTHS FROM NOW). HMMMM SOMETHING SOUNDS FISHY TO ME.  I WILL NEVER DRIVE A KIA AGAIN.  THE WHOLE ORDEAL WAS TRAUMATIZING TO MY CHILDREN AND WE WERE MADE TO FEEL LIKE WE WERE THE ONES AT FAULT.",
        "vin": "KNAGM4AD2E5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "05/31/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992951,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A STOP LIGHT WAITING MY TURN, THE LIGHT TURNED GREEN, AND I TOOK MY FOOT OFF THE BRAKE TO PUT IT ON THE GAS. AS I PRESSED THE GAS MY CAR STARTED TO SHAKE, NO ACCELERATION, AND MY DASH LIT UP STATING \"HYBRID SYSTEM NOT CHARGED PULL OVER AND TURN OFF ENGINE\" I TURNED OFF MY CAR, TRIED TO RESTART IT AND IT STATED THAT MY HEV SYSTEM (HYBRID ELECTRIC VEHICLE SYSTEM) HAS FAILED. I LUCKILY WAS BESIDE A GAS STATION AND I THREW IT INTO NEUTRAL AND WAS ABLE TO PUSH IT JUST INTO THE PARKING SECTION. I HAD TO HAVE MY CAR TOWED TO THE NEAREST DEALER TO HAVE IT CHECKED OUT. DURING THE DRIVE MY BATTERY COMPLETELY DIED SO BY THE TIME I GOT THERE IT HAD NO POWER. CHANGED OUT THE BATTERY AND SAFETY SWITCH WHICH HAD SEEMED TO FAIL. (OF COURSE NOT UNDER WARRANTY). AFTER SPENDING $1,000 ON REPAIRS/LABOR THE CAR STILL WILL NOT TURN ON AND THE ENGINE SEEMS TO SEIZE. AFTER A LITTLE DIGGING MY VIN ISNT ELIGIBLE FOR A RECALL, THOUGH THE 2014 KIA OPTIMA IS FOR THE SAME EXACT ISSUE. HOPEFULLY KIA WILL BE ABLE TO FIGURE OUT WHATS WRONG BECAUSE I REALLY DO LIKE THIS CAR BUT A FAILING ENGINE WONT GET ME ANYWHERE!",
        "vin": "KNAGN4AD1E5"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "09/11/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985410,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A CITY STREET (35MPH) WHEN I WAS CUT OFF BY ANOTHER CAR MAKING A TURN IN FRONT OF ME AND WE COLLIDED. I T-BONED HIS CAR AND MY AIR BAGS DIDNT GOT OFF. MY CAR STALLED COMPLETELY AND NOTHING ABOUT THE VEHICLE SAFETY EQUIPMENT REACTED TO THE CRASH. THE SYSTEM (CLUSTER AND SCREEN) DIDNT SHOW THAT THERE HAD BEEN ANY IMPACT AND THE CAR WAS READY TO DRIVE. I REPORTED THIS TO KIA OF DOWNTOWN LA (THE DEALER) AND KIAUSA CORPORATE WHERE THEY OFFERED TO CHECK THE CAR OUT AND SEE IF THE CAR REACTED THE WAY IT WAS SUPPOSE TO. AT THE END OF THEIR INSPECTION THEY CLAIMED THAT MY CAR DID WHAT IT WAS SUPPOSE TO AND DIDNT DEPLOY THE AIRBAGS AS THE CAR DETERMINED THAT IS DIDNT NEED TO. I ASKED WHY DIDNT THE CAR SHOW ANYWHERE THAT THERE WAS IMPACT AND IF THE SENSORS EVEN DETECTED ANYTHING AS THERE WAS NO MESSAGED ANYWHERE. THEY CLAIM IT DOESNT SUPPOSE TO. A FEW WEEKS AFTER IT WAS REPAIRED I STARTED GETTING MESSAGES IN THE CLUSTER \"CHECK AIR FLAP SYSTEM\". TOOK IT BACK AND FOURTH TO THE DEALER WHERE I FINALLY OPENED A BBB CLAIM. IN MY CLAIM I ALSO REPORTED A DELAY REACTION WHEN ACCELERATING AND WAS TOLD THAT HYBRIDS WORK THAT WAY AND THE RESPONSE TIME IS SLOWER THAN REGULAR GAS CARS. THE PROBLEM IS WHEN TURNING AFTER A COMPLETE STOP THE CAR DOESNT MOVE FOR A FEW SECONDS AND THEN TAKES OFF. OCCASIONALLY, THE CAR WONT TURN OFF, AND ASKS ME TO SHIFT TO P (PARK) WHEN IT IS IN PARK. WHEN THAT HAPPENS I AM FORCED TO TAKE IT TO THE DEALERSHIP WHERE THEY HAVE TO \"RESET\" THE CAR TO FORCE IT TO TURN OFF (NO ACTUAL SOLUTION BUT TO UNPLUG THE BATTERY AND PLUG IT BACK IN IS WHAT THEY DO) ACCORDING TO KIA I CANT PROVE THAT THE AIRBAGS DONT WORK AS I AM NOT AN EXPERT AND SAME WITH THE DRIVE TRAIN. UNFORTUNATELY THE ONLY WAY OF FINDING OUT IS IF THIS CAR IS INVOLVED IN ANOTHER ACCIDENT. THANK YOU FOR YOUR TIME.",
        "vin": "KNAGN4AD2E5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "04/13/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978923,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE HIGHWAY AT APPROXIMATELY 60MPG, ENGINE STARTED KNOCKING AS ACCELERATION INCREASED. THEN ACCELERATION WOULD NOT INCREASE AND THE CAR HOVERED AT 60MPH. AFTER A FEW MINUTES AND THE KNOCKING CONTINUING, THE CAR DECREASED TO 40 MPH. THEN THE WARNING CAME ON AND SAID \"HYBRID SYSTEM NOT CHARGED PULL OVER AND TURN OFF ENGINE\". THEN I PULLED OFF TURNED OFF THE CAR AND ATTEMPTED TO RESTART IT. IT CONTINUED TO PRESENT WITH THE SAME WARNING. NO ENERGY FLOW THROUGH THE ENGINE. I HAD MY CAR TOWED TO MY HOME. I NOTICED RECALLS FOR MY EXACT VEHICLE WITH DIFFERENT VIN #'S AND DESCRIBING THE EXACT SAME ISSUES. A FRIEND OF MINE SENT ME A COPY OF A RECALL NOTICE AFTER I DESCRIBED WHAT OCCURRED AND IT IS ALL THE SAME THINGS THEY DESCRIBE. KIA SAYS MY VIN# IS NOT ON THE RECALL LIST. KIA REFUSES TO FIX THE ISSUE EVEN THOUGH IT IS UNDER 60,000 MILE WARRANTY, CLAIMING THE PROBLEM IS DUE TO MAINTENANCE. I PURCHASED THE CAR IN JANUARY 2017 AND IT IS NOW ONLY APRIL 2017. A WHOLE THREE MONTHS. A CAR I JUST PURCHASED SHOULD NOT HAVE THESE ISSUES.",
        "vin": "KNAGM4AD0E5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/03/2017",
        "dateOfIncident": "12/26/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939181,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 KIA OPTIMA HYBRID. THE CONTACT STATED THAT THE STEERING WHEEL WOULD JOLT WHILE DRIVING AT ANY SPEED. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THEY WERE NOT ABLE TO DIAGNOSE OR REPAIR THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 18,000.",
        "vin": "KNAGM4AD3E5"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "07/08/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745882,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING INTO A PARKING SPACE THAT FACES A SUPERMARKET BUILDING, WITH MY FOOT ON THE BRAKE, THE  CAR SUDDENDLY ACCELERATES AT AN UNKOWN SPEED , WHILE I AM  STEPPING   HARDER ON THE BRAKE , AND THE CAR  IS NOT RESPONDING CRASHING INTO A PARKING BARRIER POLE FINALLY MAKING THE CAR STOP INCHES FROM THE WALL WHERE PEOPLE  GO IN AND OUT OF THE SUPERMARKET, I WAS SCREAMING THE WHOLE TIME WHILE BEING PUSHED RAPIDLY AT AN UNKOWN SPEED FEELING HELPLESS AND SCARED, THE CAR SIDE ARIBAGS DEPLOYED ON THE RIGHT SIDE OF THE VEHICLE MAKING THE VEHICLE ALL FULL OF SMOKE INSIDE.  THIS IS A COMPLAINT OF A CONCERNED  VICTIM FOR A FAULT THAT THE KIA OPTIMA  HYBRID HAS, SO IT CAN BE ADDRESSED BEFORE PEOPLE ARE HURT, OR KILLED OUT THERE NEEDLESLY.",
        "vin": "KNAGM4ADXE5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/02/2015",
        "dateOfIncident": "12/11/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714182,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE WORST DRIVING NEW CAR I'VE EVER HAD. ABOVE 60 IT REQUIRES CONSTANT ADJUSTING TO KEEP IT IN THE LANE. STEERING IS SUPER SENSITIVE, IT WILL BEGIN TO WANDER, WHEN YOU TRY TO CORRECT IT, IT WILL OVER COMPENSATE AND YOU GO TOO FAR THE OTHER WAY. TRYING TO GET IT STABILIZED IN A STRAIGHT LINE IS VERY DIFFICULT. WIND AFFECTS IT TREMENDOUSLY, A DANGER TO DRIVE IN HIGH WINDS. AND A DANGER AT SPEEDS OVER 60.   *TR",
        "vin": "KNAGM4AD0E5"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/15/2015",
        "dateOfIncident": "02/14/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683533,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINALLY THE NOISE STARTED ABOUT A WEEK AGO I TOOK IT TO THE DEALER THEY DID VERIFY MY COMPLAINT  AND THEY FIXED IT THEN ON 2/14/2015  STARTED TO DO THE SAME THING THE REPAIR INVOICE STATES THEY PERFORMED BRAKE FLUID BLEEDING AND CALIBRATION OF THE BRAKE SYSTEM.  *TR",
        "vin": "KNAGN4AD0E5"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "07/29/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10625866,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO PARK THE CAR IN THE PARKING LOT STRUCTURE, THE CAR ACCELERATED BEYOND CONTROL ON IT'S OWN AND HIT THE WALL HEAD ON. I WAS ALREADY IN MY PARKING SPOT AND ONLY FEW FEET AWAY WHEN THE CAR ACCELERATED. THE PASSENGER AIR BAG WAS DEPLOYED AND BODY DAMAGE OCCURRED. EVERYTHING HAPPENED SO SUDDENLY, I AM NOT SURE ABOUT THE SPEED AT THE TIME OF IMPACT. NOTE: THIS COMPLAINT IS A DUPLICATE OF 10620789. THE FOLLOWING ADDITIONAL INFORMATION IS BEING PROVIDED TO INDICATE A TREND OF SIMILAR SUDDEN ACCELERATION SAFETY ISSUES WITH THE KIA HYBRID OPTIMA.    THIS IS A REQUEST TO INITIATE A SAFETY INVESTIGATION AS THERE HAVE BEEN SIMILAR REPORTS WITH KIA OPTIMA HYBRID AND KIA OPTIMA.     THE FOLLOWING COMPLAINTS ARE SIMILAR IN NATURE: 10608382 FOR KIA OPTIMA HYBRID 2013, 10615352 FOR KIA OPTIMA HYBRID 2012, 10552403 FOR KIA OPTIMA HYBRID 2012, 10608739 FOR KIA OPTIMA 2014 AND 10588733 FOR KIA OPTIMA 2013.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/08/2014",
        "dateOfIncident": "07/29/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10620789,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA HYBRID",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO PARK THE CAR IN THE PARKING LOT STRUCTURE, THE CAR ACCELERATED BEYOND CONTROL ON IT'S OWN AND HIT THE WALL HEAD ON.  I WAS ALREADY IN MY PARKING SPOT AND ONLY FEW FEET AWAY WHEN THE CAR ACCELERATED. THE PASSENGER AIR BAG WAS DEPLOYED AND BODY DAMAGE OCCURRED. EVERYTHING HAPPENED SO SUDDENLY, I AM NOT SURE ABOUT THE SPEED AT THE TIME OF IMPACT.  *TR",
        "vin": ""
    }
]