[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443826,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GM is unable to provide an ETA on a replacement airbag that is under an open safety recall. It has been months since I started contacting my nearest GMC dealer and GM customer support.  It is unacceptable they can immediately repair let alone being un able to even provide a time frame for the replacement airbags.",
        "vin": "1GTHK23647F"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "12/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443815,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was vandalized on 12/7/21 and alarms did not go off. Car alarm doesn’t work, hasn’t worked.",
        "vin": "JTHBK1GG3E2"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440179,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes, tires, transmission went out, suspension craked licking oil Car steering wheel vibration, car pulling, brakes didn’t respond, i pulled to side before hitting a car  Yes 2 different shops currently at express transmission  Currently under inspection because of transmission going out while driving on freeway  No warning lights, air bags are off I don’t know why bought car 4 months ago  Dealership said they maintenance the vehicle that was a lie i had it maintenance not to long ago car needed it car went out in matter of hrs not days it was hrs it never alerted me something was wrong vehicle was in previous accident in 2016 dealership never informed us about it we recently found out about accident express transmission spoke to me and stated transmission over heated and blew up from inside my vehicle could of blown up as well with me in it putting at risk other people when vehicle was driven while pressing brakes i had to press pedal all the way in or let go and press pedal again in order for vehicle to stop my tires we’re getting more damaged from in words car was rotated and had an alignment done and it keept damaging tires from in words we bought vehicle for $35,000 we have had it for 4 months i have receipts of services done to vehicle and im still waiting on diagnose from transmission so i can know what inside transmission blew up it will cost me approximately $4,000 to $6,000 to fix vehicle",
        "vin": "Jthbk1gg2e2"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404485,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN UNINTENDED ACCELERATION WITH BRAKING PROBLEMS. THREE EPISODES. THE FIRST EPISODE WAS A COMPLAINT TO THE DEALER WITH DOCUMENTATION IN THE CAR'S SERVICE RECORD. THE SECOND OF WHICH WAS WORKED-UP FOR ONE WEEK BY THE DEALER WITH NO ANSWERS. THE THIRD EPISODE OCCURRED GOING DOWN A PARKING RAMP AND RESULTED IN LOSS OF CONTROL OF THE CAR AND INJURIES TO BOTH FENDERS. THE CAR'S \"BLACK BOX\" WAS NOT ACTIVATED DURING THE LAST EPISODE. THE CAR ACCELERATED RIGHT AFTER IT HAD BEGUN MOVING FORWARD. DURING THE OTHER EPISODES, THE ACCELERATION OCCURRED RIGHT AFTER BEING STARTED. DURING THE THIRD AND MOST SERIOUS EPISODE, THE CAR WAS MOVING DOWN THE CAR RAMP IN A PARKING GARAGE, FROM THE EIGHTH FLOOR TO THE SIXTH FLOOR. AFTER STARTING DOWN THE RAMP, THE CAR ACCELERATED AND COULD NOT BE STOPPED BY BRAKING, SHIFTING TO NEUTRAL AND PARK OR BY PRESSING THE OFF BUTTON SWITCH. WHEN THE SIXTH FLOOR WAS REACHED, THE CAR WAS DRIVEN DOWN ONE OF THE EXIT LANES WHERE FINALLY IT WAS ABLE TO BE STOPPED BY USUAL BRAKING MANEUVERS. IN THE \"BLACK BOX\" STUDY, THERE WAS NO RECORD OF ANY ABNORMAL ACTIVITY, EITHER ACCELERATION OR BRAKING. POLICE WERE NOTIFIED AND ESSENTIALLY DOCUMENTED THE EVENTS BUT MADE NO OTHER COMMENTS. DURING THE THIRD EPISODE, THE CAR WAS MOVING AT A RAPID RATE OF SPEED, PROBABLY AT ABOUT 50 MILES PER HOUR BUT THIS CANNOT BE DOCUMENTED. REPAIR OF THE VEHICLE COST ABOUT $6000.",
        "vin": "JTHBK1GG5E2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353328,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FORWARD COLLISION WARNING SYSTEM HAS FAILED AND IS INOPERABLE. THERE IS A RECALL OUT THERE, HOWEVER MY VIN# ISN'T ON THE LIST. LEXUS WILL NOT FIX IT.",
        "vin": "JTHBK1GG1E2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352479,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT DOOR LOCK ACTUATORS NOT WORKING PROPERLY.THE CAR ONLY HAS 40225 MILES AND IS GARAGE KEPT.WHAT THE POSSIBILITY OF BOTH GOING BAD AND IS THIS A MANUFACTURING DEFECT AND SHOULD BE A WARRANTED PART?",
        "vin": "JTHBK1GG0E2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "04/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11321098,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LEXUS ES350. THE CONTACT STATED WHILE DRIVING 61 MPH, HE HIT A DEER. THE AIRBAGS DID NOT DEPLOY AS HIS FACE HIT THE STEERING WHEEL. THE CONTACT STATED HE SAW SMOKE FROM THE ENGINE COMPART HOWEVER, NO FIRE WAS SEEN.  THE CONTACT STATED HE SUSTAINED HEAD INJURIES HOWEVER, HE DID NOT SEEK MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A COLLISION CENTER BY THE INSURANCE COMPANY. THE CAUSE OF THE FAILURE HAS NOT BEEN DETERMINED BY AN INDEPENDENT MECHANIC OR DEALER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 101,000.",
        "vin": "JTHBK1GG7E2"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2020",
        "dateOfIncident": "03/21/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319034,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LEXUS ES350. THE CONTACT STATED WHILE DRIVING AT APPROXIMATELY 15 MPH, THE VEHICLE STALLED WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE ACCELERATOR PEDAL WAS DEPRESSED TO THE FLOOR FOR THE VEHICLE TO RESPOND. THE VEHICLE WAS DRIVEN TO THE RESIDENCE.  THE VEHICLE IS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V012000(FUEL SYSTEM, GASOLINE) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OFFERED A RENTAL VEHICLE. THE FAILURE MILEAGE WAS 47,000.",
        "vin": "JTHCE1BL6E5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234046,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LOCKS(ALL 4 DOORS) STOPPED LOCKING/UNLOCKING BY USE OF POWER DOOR LOCK BUTTON OR KEY FOB. EACH DOOR MUST NOW BE LOCKED / UNLOCKED MANUALLY. BASED ON FORUM PAGE, THIS IS A WIDESPREAD ISSUE THAT MUST BE INVESTIGATED. HTTPS://WWW.CARGURUS.COM/CARS/DISCUSSION-T36095_DS744492",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "02/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217803,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER DOOR LOCK ON THE DRIVER'S SIDE STOPPED WORKING WITH THE KEY FOB.  CAN ONLY LOCK AND UNLOCK BY USE OF ACTUAL KEY OR BY MANUALLY PUSHING DOOR LOCK.  THE PASSENGER'S SIDE DOOR LOCK IS STARTING TO SHOW THE SAME SIGNS AS THE DRIVER'S SIDE DID BEFORE IT STOPPED WORKING COMPLETELY.  SOMETIMES WILL WORK PROPERLY AND SOMETIMES IT WON'T.",
        "vin": "JTHBK1GG8E2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "05/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205878,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED A NEW SET OF YOKOHAMA 225/45R18 TORNANTE TIRES IN OCTOBER 2016 FROM MR. TIRE. IMMEDIATELY FOLLOWING INSTALLATION I EXPERIENCED AN EXCESSIVE WARBLING NOISE FROM THE TIRES AND TOOK THE VEHICLE TO A TRUSTED TIRE SHOP. THEY FOUND THAT THE TREAD WAS WOBBLING FROM SIDE-TO-SIDE WHEN PLACED ON THE TIRE BALANCING MACHINE AND RECOMMENDED I TAKE IT BACK TO MR. TIRE FOR REPLACEMENT. I DID THIS AND MR. TIRE SAID THAT THE UNEVEN TREAD WAS NORMAL AND REFUSED TO REPLACE THE TIRE. I PROCEEDED TO DRIVE THE VEHICLE 43,000 MILES OVER A 2.5 YEAR PERIOD AND EXPERIENCED AN INCREASINGLY NOISY RIDE AND VIBRATION AT HIGH SPEEDS. I GOT TO THE POINT WHERE I WAS CONCERNED ABOUT THE SAFETY OF THE TIRES AND TOOK THE VEHICLE IN FOR SERVICE. THEY INSPECTED THE VEHICLE AND RECOMMENDED IMMEDIATE REPLACEMENT OF THE TIRES AS THERE WERE SEVERE CRACKS FORMING ON BOTH THE INNER AND OUTER SIDEWALL THAT WENT ALL THE WAY THROUGH TO THE INTERIOR OF THE TIRE. CLEARLY A TIRE NOT SAFE TO BE ON THE ROAD. I FEEL THAT THESE TIRES WERE DEFECTIVE FROM THE PURCHASE DATE AND THE DEFECTS GOT WORSE OVER THIS 2.5 YEAR PERIOD TO THE POINT OF THE AFOREMENTIONED SEVERE SIDEWALL CRACKING.",
        "vin": "JTHBK1GG4E2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151596,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE IS VERY SPONGY. THE PEDAL GETS VERY LOW TO THE FLOOR.ITS HARD TO STOP THESE CAR. BRAKE FLUID, BRAKE PADS AND ROTORS CHECK OUT FINE AT THE DEALERSHIP. THERE ARE COMPLAINTS ABOUT DEFECTS WITH THE MASTER CYLINDER.  MY CAR HAS 44000 MILES AND THE PROBLEM IS CHRONIC. YOU NEED A LARGE STOPPING RANGE WHEN USING THIS CAR. LEXUS CLAIMS I NEED TO GET USE TO IT",
        "vin": "JTHBK1GGXE2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "09/03/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   RECEIVED A NOTICE FROMTK HOLDINGS INC ABOUT ONE  TO TWO YEARS AGO REGARDING REPLACEMENT OF AIR BAG.  CALLED MY LEXUS DEALER ABOUT A YEAR AGO AND THEY TOLD ME THEY WOULD NOTICE WHEN IT WAS MY TURN.  THEY DID NOT GIVE ME A TIME FRAME ON WHEN THEY WOULD REPAIR IT.  I AM DRIVING A DANGEROUS CAR.  HOW LONG DO I HAVE TO WAIT??  CASE NO 17-11375",
        "vin": "JTHBK1GG7E2"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 LEXUS ES 350 HAS LESS THEN 4000 MILES ON THE VEHICLE AND THE STEERING HAS MALFUNCTIONED TWICE AND I AM NOW UNABLE TO DRIVE THE CAR AS IT IS PART OF THE ELECTRICAL SYSTEM WHICH CONTINUALLY FREEZES UP MAKING IT INOPERABLE. I PURCHASED THE CAR 2 MONTHS AGO AND AS IT WAS CERTIFIED  BY LEXUS THIS SHOULD NOT HAVE HAPPENED.THIS IS A POTENTIALLY VERY DANGEROUS SITUATION. FORTUNATELY I WAS IN MY PARKING LOT BOTH TIMES THIS OCCURRED AND NOT ON THE HIGHWAY.",
        "vin": "JTHBK1GG2E2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "10/19/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084023,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR MIDDLE SEAT BELT ALMOST STRANGLED 7YEAR OLD.  THE SEAT BELT WAS LOOPED AROUND CHILD WHEN THEY WERE PLAYING WHILE PARKED IN DRIVEWAY.  WHEN READY TO GET OUT OF CAR, THE CHILD UNBUCKLED AND THE LOOP WRAP AROUND CHILD TIGHTENED.  THE SEAT BELT WAS NOT LOOSENING TO ALLOW CHILD TO FIT THROUGH LOOP, PULLING ON BELT MADE THE BELT EVEN TIGHTER AND DID NOT UNLOCK.  CHILD WAS HAVING DIFFICULTY BREATHING AND I HAD TO CUT THE BELT.  REQUEST MADE WITH LEXUS DEALERSHIP TO FIX MALFUNCTIONED BELT IN DECEMBER 2017.  NO RESPONSE FROM DEALER AS OF APRIL 2018.  CONTINUING TO INQUIRE FOR RESOLUTION TO TO HAVE BELT FIXED UNDER VEHICLE WARRANTY.  DEALER IS UNRESPONSIVE TO PHONE AND EMAIL FOR UPDATES.",
        "vin": "JTHBK1GG8E2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "08/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE AND MY SUNROOF EXPLODED.",
        "vin": "JTHBK1GGGE2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2017",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959913,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR ACTUATOR WHICH CONTROLS THE ABILITY TO LOCK AND UNLOCK THE DOORS FAIL FREQUENTLY.  THIS FAILURE MAY CAUSE THE INABILITY TO EXIT THE CAR OR HAVE SOMEONE OPEN THE CAR DOOR IN THE EVENT OF AN ACCIDENT OR OTHER PROBLEM.  I HAVE HAD TO REPLACE 3 OF THE DOOR ACTUATORS IN 60,000 MILES OR LESS.  THIS WAS ALSO A PROBLEM IN MY LAST LEXUS WHICH WAS A 2007 ES350.",
        "vin": "JTHBK1GG2E2"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "12/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899773,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LEXUS ES350. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V728000 (FORWARD COLLISION AVOIDANCE) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JTHBW1GG2E2"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "11/03/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LEXUS ES350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V728000 (FORWARD COLLISION AVOIDANCE) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JTHBK1GG5E2"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "12/22/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED A LOW SPEED SUDDEN UNINTENDED ACCELERATION OF MY 2014 LEXUS ES350 FOR THE FIRST TIME ON DECEMBER 22, 2015.  I WAS TURNING INTO A PARKING PLACE WHERE I LIVE AS I HAVE DONE HUNDREDS OF TIMES.  AS I WAS TAKING MY FOOT OFF THE ACCELERATION PEDAL TO STARTING HITTING THE BRAKE PEDAL, THE CAR SUDDENLY ACCELERATED.  I HEARD THE ENGINE REVVING AND I WAS TAKEN TOTALLY BY SURPRISE.  MY REACTION WAS TO TURN TO THE LEFT TO AVOID HITTING THE WALL IN FRONT OF ME WHILE HITTING THE BRAKE WITHOUT ANY RESPONSE FROM THE CAR.  I HIT THE WALL WITH THE RIGHT FRONT SIDE OF THE CAR AND KEPT GOING FOR A LITTLE WHILE UNTIL I SOMEHOW SHIFTED GEARS.  THE CAR STOPPED AND I PUT IT ON REVERSE.      I AGAIN EXPERIENCED THE SAME SITUATION ON MARCH 21, 2016 WHILE PARKING THE CAR AT A DIFFERENT PLACE.  FORTUNATELY, NOTHING OBSTRUCTED THE CAR SO I WAS ABLE TO STOP IT BEFORE HITTING ANYTHING - THE OVERRIDE TOYOTA DESIGNED AFTER ALL THE EARLIER SUDDEN UNINTENDED ACCELERATION ACCIDENTS WORKED THIS TIME.  BUT THIS SECOND INCIDENT CONFIRMED TO ME THAT THE FIRST ONE WILL NO LONGER BE AN ISOLATED INCIDENT HENCE I'M FILING THIS SAFETY COMPLAINT SO OTHER LEXUS OWNERS LEARN ABOUT IT.",
        "vin": "JTHBK1GG5E2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2016",
        "dateOfIncident": "08/22/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823146,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING FROM A STANDING STOP OR ACCELERATING WHILE CHANGING LANES, THE VEHICLE WOULD HESITATE BEFORE THE ENGINE ENGAGED. WHAT WAS MORE FRIGHTENING WAS WHEN THE VEHICLE WAS OPERATING ON THE ROAD AND THERE WAS A NEED TO CHANGE LANES, YOU PRESSED ON THE GAS THEN THE VEHICLE WOULD  TYPE TO ENTER TEXT HESITATE FROM 1 TO 3 SECONDS. YOU LITERALLY FOUND YOURSELF IN NO MANS LAND, AS THE VEHICLE FAILED TO RESPOND AND YOU FOUND YOURSELF CAUGHT STRADDLING  TWO LANES AND THE VEHICLE VIRTUALLYSTOPPED ACCELERATING. THIS SITUATION STARTING OCCURRING MORE AND MORE WHEN I OR JANE LANES,MADE RIGHT AND LEFT HAND TURNS, OR ACCELERATED FROM A STANDING STOP.    T    THE VEHICLE HESITATION, WHILE ACCELERATING, IS FRIGHTING AND DANGEROUS. IT SEEMS TO BE GETTING WORSE. WE MADE AN APPOINTMENT WITH NEWPORT LEXUS TO HAVE THE VEHICLE'S STALLING CORRECTED AND SERVICED. ON OCTOBER 21, 2015 WE TOOK THE VEHICLE TO NEWPORT LEXUS AND EXPLAINED THE PROBLEM TO THE SERVICE ATTENDANT. THE VEHICLE WAS EXAMINED AND THEN ROAD TESTED BY CHRIS PERET, NEWPORT LEXUS CHIEF MECHANIC. AFTER THE ROAD TEST, THE VEHICLE DID HESITATE AT TIMES WHEN HE ACCELERATED THE VEHICLE. THE CAUSE IS HOW THE FRONT WHEEL VEHICLE IS DESIGNED.THE PROCESS AND HOW THE VEHICLE ACCELERATION PROCESS WORKS ON A FRONT WHEEL DRIVE VEHICLE; THE GAS PEDDLE WHICH IS IN THE FRONT OF THE VEHICLE  SENDS A SIGNAL TO THE ENGINE WHICH IS IN THE FRONT OF THE VEHICLE, THE ENGINE SENDS A SIGNAL TO THE COMPUTER WHICH IS IN THE REAR OF THE VEHICLE, THE COMPUTER THEN SENDS A SIGNAL TO THE ENGINE AND THE VEHICLE THEN ACCELERATES. HE EXPLAINED THE PROCESS IS ALMOST INSTANTANEOUS AND THERE IS ONLY A VERY SLIGHT HESITATION.  IF THIS LAST COMPONENT OCCURS YOU COULD GET A LONGER DELAY BEFORE FROM THE TIME YOU DEPRESS THE ACCELERATOR TO THE TIME THE VEHICLE ACTUALLY ACCELERATES (1 TO 3 SECONDS).",
        "vin": "JTHBK1GG4E2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2015",
        "dateOfIncident": "11/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR BATTERY IS DEAD 3 TIMES IN 2 YEARS.",
        "vin": "JTHBK1GG2E2"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "02/17/2015",
        "dateOfIncident": "12/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683863,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LEXUS ES350. WHILE MAKING A U TURN AT APPROXIMATELY 5 MPH, THE RPMS INCREASED, THE STEERING WHEEL SEIZED, AND THE BRAKE PEDAL FAILED TO SLOW THE VEHICLE DOWN WITHOUT WARNING. THE CONTACT CRASHED THE VEHICLE INTO A FENCE AND A TREE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,500.  UPDATED 03/30/15*LJ    UPDATED 9/22/2017*CN",
        "vin": "JTHBK1GG5E2"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/01/2014",
        "dateOfIncident": "11/27/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661446,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2015 LEXUS ES350 ON TUESDAY, NOVEMBER 25TH, 2014.  ON NOVEMBER 27TH, I WAS TURNING RIGHT INTO A PARKING SPACE AND THE VEHICLE ACCELERATED AGGRESSIVELY ON ITS OWN CAUSING THE CAR TO RUN OVER THE CONCRETE PARKING SPOT STOPPER AND PROPEL 200-300 FEET UNTIL I HIT A PALM TREE, STOPPING THE CAR FROM ENTERING A NEARBY LAKE. THIS CAUSED SIGNIFICANT DAMAGE TO THE CAR.  MY WIFE AND I WERE IN COMPLETE SHOCK AS I WAS UNABLE TO STOP / CONTROL THE CAR - I ATTEMPTED TO PUMP THE BRAKES MULTIPLE TIMES (LEAVING TIRE TRACKS) BUT THE CAR CONTINUED ACCELERATING UNTIL WE HIT THE TREE.  WE FILED A REPORT W/ THE FLORIDA SHERIFF'S DEPARTMENT.  ADDITIONALLY, THE DAY BEFORE (NOV 26TH), I NOTICED THE SIDE MIRRORS ON THE CAR DID NOT  TILT PROPERLY WHEN IN REVERSE - THE LEFT MIRROR TILTED DOWN, THE RIGHT MIRROR TILTED UP. THIS MAY BE A RESULT OF THE 'MIRROR SWITCH BLOCK' BUT TOGETHER WITH A FEW OTHER MECHANICAL ISSUES, THIS LEADS ME TO BELIEVE THE 2-DAY OLD CAR HAD SOME SIGNIFICANT AND DANGEROUS MECHANICAL / ELECTRONIC ISSUES.  I HAVE ATTACHED MORE INFORMATION ABOUT THE CAR AND A PICTURE OF THE PARKING SPOT WHERE THE ACCELERATION OCCURRED.  PLEASE CONTACT ME ABOUT APPROPRIATE NEXT STEPS RELATED TO THIS SIGNIFICANT DEFECT.   *JS",
        "vin": "JTHBK1GG1F2"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608573,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE DRIVE A LEXUS.  OUR CHILDREN DRIVE A TOYOTA.  THE PROBLEM IS, THEREFORE, IDENTICAL.    WHEN ONE STARTS THE VEHICLE, PARTICULARLY IN A PARKING LOT, ONE EXPECTS THE REAR VIEW CAMERA FEATURE TO BE AVAILABLE.  THIS DOES NOT HAPPEN WITH THE LEXUS AND TOYOTA SYSTEM.  AT THE INSTANT THAT ONE IS READY TO BACK OUT OF ONE'S PLACE, THE UPPER 15 -20% OF THE REAR VIEWING AREA IS COVERED WITH A SERIES OF MESSAGES TRANSMITTING INFORMATION ABOUT THE BLUETOOTH STATUS.  THIS INFORMATION MAY BE IMPORTANT TO A 14-YEAR OLD, BUT NOT TO A DRIVER.    ONE HAS TWO ALTERNATIVES; EITHER BACK UP BLIND (NEGATING THE WHOLE REASON FOR THE BACK UP SYSTEM) OR WAIT FOR THE MESSAGES TO FINISH, WASTING GASOLINE.    I REQUESTED THE DEALER TO OVERRIDE THIS PROBLEM, BUT I WAS TOLD THAT IT COULD NOT BE DONE.   *JS",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/12/2014",
        "dateOfIncident": "05/22/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597891,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LEXUS ES35O. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE FRONT PASSENGER SIDE SEAT SHOOK AND VIBRATED WHEN THERE WAS NOT A PASSENGER SEATED IN THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DIAGNOSE THE DEFECT. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE FAILURE MILEAGE WAS 1400.",
        "vin": "JTHBK1GG4E2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/03/2014",
        "dateOfIncident": "02/14/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BECAUSE OF THE GOVERNMENT'S EFFORTS TO INCREASE MILEAGE PER GALLON, AUTO MANUFACTURERS  HAVE REDUCED WIND RESISTANCE TO THE EXTENT POSSIBLE. ONE OF THE WAYS MANUFACTURERS DO THIS IS BY LOWERING THE FRONT FENDERS AND THE HOOD  TO THE POINT WHERE THE DRIVER CAN NO LONGER SEE THEM. THIS MAKES IT MORE DIFFICULT TO PARK THE CAR, MAKE TURNS, AND DRIVE IN GENERAL---FAR MORE DANGEROUS TO DRIVE.",
        "vin": "JTHBK1GG8E2"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573540,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES 350",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 03/18/14 (MORNING), AN INDEPENDENT MECHANIC INSPECTED AND CONCLUDED THROUGH TESTING THAT ONE OF THE ENGINE MOTOR MOUNTS WAS BROKEN/DEFECTIVE AND NEEDS TO BE REPLACED.  I WAS PRESENT FOR THE TEST AND THE MECHANIC WALKED ME THROUGH EACH STEP AND POINTED OUT EXACTLY WHAT WAS HAPPENING AND WHY.    ON 03/19/14 (MORNING), LEXUS DEALERSHIP DENIES ANYTHING IS WRONG WITH THE MOTOR MOUNTS AND CANNOT \"REPLICATE\" THE PROBLEM.    ON 03/19/14 (AFTERNOON)  I MET WITH THE LEXUS SERVICE TECHNICIAN AND WE PERFORM THE EXACT SAME TEST AS MY INDEPENDENT MECHANIC.  ALTHOUGH LEXUS CLAIMS NO REPAIRS WERE DONE SINCE THEY DIDN'T FIND A PROBLEM, THE TEST NOW SHOWS THE MOTOR MOUNTS AS BEING IN WORKING ORDER (MAGICALLY)    ALTHOUGH LEXUS DENIES NOTHING WAS EVER WRONG AND NOTHING WAS REPAIRED BY LEXUS, ITS APPARENT TO ME AND MY MECHANIC THAT REPAIRS HAVE BEEN MADE BY THEM TO FIX THE PROBLEM WITHOUT IT BEING DOCUMENTED.  *TR",
        "vin": "JTHBK1GG1E2"
    }
]