[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11453349,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2014 Lexus RX350. The contact stated that while the wife was driving approximately 35 mph a dump truck collided with the passenger side of the vehicle. During the crash, the side curtain air bags did not deploy. The front passenger sustained injuries to the head, neck, shoulder, and torso and the front driver sustained injuries to the right foot and chest area. Medical treatment was required for both occupants. The vehicle was destroyed and towed away. A police report was taken at the scene. The cause of the failure was not determined. The local dealer and manufacturer were not yet contacted. The failure mileage was 44,000.",
        "vin": "JTJZK1BA9E2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450590,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving the car on the highway.  The transmission lost power & engine  started revving with no movement. It was dangerous because we could have been rear ended. We had car towed to the Peterson Lexus dealer in Boise Idaho. They said that the internal bearing failed & recommend a new transmission.",
        "vin": "2T2BK1BAXEC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423781,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My car stalled in the middle of an intersection.  It had to be towed to the Lexus dealer, where it was determined to be a fuel pump malfunction.  My car was not subject to the fuel pump recall but it should have been.",
        "vin": "2t2zk1baxec"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "When I press on my brakes they make a loud roaring sound right away. Usually when brakes are about to go out its usually a squeaky noise then it will go to loud roaring noise. There has not been an indicator on the dash about any issues with the vehicle. I found it rather odd that the brakes made the roaring noise immediately. It didn't squeak at all. I would like for this matter to be looked into. There is no way there should be a brake system failure right away. The schrader valve has a crack and freon is leaking out of and the air is not blowing cold air.",
        "vin": "2T2ZK1BA1EC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/23/2015",
        "dateOfIncident": "03/31/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721150,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE REARVIEW MIRROR VIBRATES INSIDE HOUSING PREVENTING PROPER IDENTIFICATION OF VEHICLES APPROACHING OR VEHICLES ON LEFT LANE. THIS SITUATION HAS BEEN PRESENT SINCE THE VEHICLE WAS PURCHASED. LEXUS DENIES MY CLAIM. I BELIEVE IT TO BE A SERIOUS SAFETY ISSUE.",
        "vin": "JTJBC1BA4E2"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604514,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX450H",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A RED TRAFFIC LIGHT, I PRESSED THE PHONE HANGUP BUTTON (BLUETOOTH CONNECTION) ON THE STEERING WHEEL AND THE ENGINE IMMEDIATELY SHUT OFF. I PUT THE CAR IN PARK, FOOT ON THE BRAKE, PRESSED THE START BUTTON ON THE DASH - ENGINE DID NOT START.  TRY #4 IT STARTED. MEANWHILE THE TRAFFIC LIGHT HAD GONE THROUGH A FULL CYCLE, THEN RED AND LATE ON THE 2ND GREEN I WAS ABLE TO MOVE THE CAR.  CONSIDERABLE HONKING FROM CARS BEHIND ME DURING THE EVENT, BUT FORTUNATELY NO ACCIDENTS OR INJURIES DURING THIS STALL.  ON JUNE 17, 2014 I HAD THE CAR TOWED TO KEYES LEXUS MAINTENANCE IN VAN NUYS, CA, MY DEALERSHIP AND THE MAINTENANCE SERVICE I ALWAYS USE.  THEY COULD NOT FIND ANY DEFECTS IN THE SHOP OR DURING A LONGRANGE DRIVE, BUT THE DRIVER DID NOT USE THE BLUETOOTH. LEXUS SAID NO SYSTEMIC DEFECTS HAVE BEEN RECOGNIZED IN THE BLUETOOTH, OR OTHER PROBLEMS WITH ENGINE STALLS, AND MY GOOGLE SEARCH CONFIRMED THAT.    I TURNED THE LEASED VEHICLE IN AT KEYES LEXUS, AND THEY MADE AN EXCELLENT DEAL FOR ME TO LEASE A NEW 2015 RX450H.    I AM NOT COMPLAINING ABOUT ANY OF THE INDIVIDUALS WHO WORKED WITH ME, AND I AM A LONG TIME CUSTOMER AT KEYES LEXUS WHICH PROVIDES OUTSTANDING SERVICE AND COURTESY. HOWEVER, I AM UNCONVINCED THAT THE VEHICLE IS SAFE.  *TR",
        "vin": "JTJZB1BA9E2"
    }
]