[
    {
        "components": "LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "Maserati North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338131,
        "products": [
            {
                "manufacturer": "Maserati North America, Inc.",
                "productMake": "MASERATI",
                "productModel": "QUATTROPORTE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOORS WILL NOT LOCK, ONLY DRIVER SIDE WORK. THE UNLOCK FEATURE WORK BUT PRESSING THE REMOTE OR DOOR BUTTON WILL NOT LOCK THE DOOR. THE AUTO DOOR LOCK AFTER STARTING THE VEHICLE DOES NOT WORK EITHER.",
        "vin": "ZAM56PPA9E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Maserati North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330678,
        "products": [
            {
                "manufacturer": "Maserati North America, Inc.",
                "productMake": "MASERATI",
                "productModel": "QUATTROPORTE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A PUBLIC STREET, THE ENGINE BEGAN TO LOSE POWER AND FAILED TO RESPOND TO ACCELERATOR INPUT, EVENTUALLY STALLING. THE TRANSMISSION AND POWER STEERING LOCKED AND THE VEHICLE WOULD NOT RESTART, PRECLUDING TIMELY CLEARANCE OF THE VEHICLE FROM THE STREET WHERE IT WAS PARTIALLY BLOCKING TRAFFIC. AFTER SEVERAL ATTEMPTS TO JUMP START THE VEHICLE, IT RESTARTED; HOWEVER, THE ENGINE LOST POWER AND STALLED AGAIN. SUBSEQUENT ATTEMPTS TO RESTART THE ENGINE WERE UNSUCCESSFUL. THE VEHICLE WAS TOWED TO THE SERVICE DEPARTMENT AT THE DEALERSHIP (MASERATI OF AUSTIN), WHERE IT WAS DETERMINED THAT THE VEHICLE HAD A FAULTY LOW PRESSURE FUEL PUMP (THE V-8 GTS VERSION OF THE MASERATI QUATTROPORTE WAS RECALLED IN 2017 FOR REPLACEMENT OF AN ACTUATOR IN THE LOW PRESSURE FUEL PUMP THAT RESULTED IN THE SAME LOSS OF ENGINE POWER; NHTSA RECALL NUMBER, 17V610000).  *TR",
        "vin": "ZAM56RRA2E1"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Maserati North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324292,
        "products": [
            {
                "manufacturer": "Maserati North America, Inc.",
                "productMake": "MASERATI",
                "productModel": "QUATTROPORTE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I FINANCE A PREOWN MASERATI IN 2017 FROM CA. IN MARCH 2019 I HAD A MINOR COLLISION AND THE FRONT END OF MY VEHICLE WAS DAMAGE. MY CAR SET AT THE BODY SHOP FOR 1 1/2 MONTH BEFORE THEY TOLD ME IT WAS TOTAL. I WAS APPALLED BECAUSE THE DAMAGE WAS MINOR. AFTER DOING MY INVESTIGATION I FOUND OUT THE CAR HAD PRIOR FRAME DAMAGE DUE TO DEER ACCIDENT. I HAVE THE ESTIMATE FROM PROGRESSIVE SHOWING THE FRAME WAS PULLED. I'M PISSED BECAUSE I LOST MY CAR AND MONEY DUE TO GEICO TOTALING THE CAR. PROGRESSIVE SHOULD'VE DISCLOSE THIS INFORMATION AND I SHOULD BE COMPENSATED FOR MY LOSS. I RECEIVED 14K AFTER I LOSS OVER 35K IN DOWN PAYMENT AND MONTHLY PAYMENT. THIS CAR HAD NO BUSINESS BEING SOLD THEN OR NOW AGAIN.  *TR",
        "vin": "ZAM56RRA8E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "01/14/2020",
        "fire": false,
        "manufacturer": "Maserati North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310041,
        "products": [
            {
                "manufacturer": "Maserati North America, Inc.",
                "productMake": "MASERATI",
                "productModel": "QUATTROPORTE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES INFOTAINMENT CENTER WENT OUT, SEEMINGLY AFTER THE CAR BATTERY WENT DEAD AFTER SITTING AT THE AIRPORT FOR 4 DAYS. I CAN'T OPERATE ANY FUNCTIONS OF THE CAR INCLUDING RADIO, A/C, BACK UP CAMERA ECT.",
        "vin": "ZAM56RRA8E1"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/08/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Maserati North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218712,
        "products": [
            {
                "manufacturer": "Maserati North America, Inc.",
                "productMake": "MASERATI",
                "productModel": "QUATTROPORTE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE PRE-OWNED TO FIND OUT A YEAR AND HALF LATER IT HAD STRUCTURAL DAMAGE THAT WAS NOT DISCLOSED TO ME UNTIL I HAD A MINOR FENDER BENDER. I HAD BEEN DRIVING AN UNSAFE VEHICLE AND NOW MY INSURANCE CARRIER WANTS TO TOTAL THE IT.",
        "vin": "ZAM56RRA8E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "Maserati North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065372,
        "products": [
            {
                "manufacturer": "Maserati North America, Inc.",
                "productMake": "MASERATI",
                "productModel": "QUATTROPORTE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA DISPLAYS A FUZZY REDDISH BLURRY IMAGE...NOT A TRUE PICTURE OF WHAT IS BEHIND THE CAR. I ALMOST BACKED INTO A CAR BECAUSE I COULD NOT SEE IT.",
        "vin": "ZAM56PPA1E1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "Maserati North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10660228,
        "products": [
            {
                "manufacturer": "Maserati North America, Inc.",
                "productMake": "MASERATI",
                "productModel": "QUATTROPORTE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A 2 LANE STREET (CRAWFORD ST) IN SKOKIE IL, WHEN A CAR GOING THE OPPOSITE DIRECTION CAME INTO OUR LANE HEADING HEAD ON INTO OUR CAR, I TRIED TO PROCEED OVER THE CURB/SIDEWALK INTO THE GRASS INTO SOMEONE'S FRONT LAWN, THE OTHER CAR HIT MY DRIVER DOOR WENT DOWN THE SIDE OF THE CAR WHICH STRAIGHTEN MY VEHICLE OUT FROM THE DIRECTION I WAS GOING. THAT MADE MY CAR GO DIRECTLY INTO PROBABLY A 40' TALL WOODEN LIGHT POLE, WE SNAPPED THE POLE ABOUT 2' ABOVE GROUND LEVEL AND THE POLE WENT UP IN THE AIR AND CAME DOWN ON TOP OFF THE CAR, SMASHED THE SUN ROOF, THE TOP OF THE CAR, THE TRUCK AND BOUNCE OFF THE CAR ONTO THE GROUND ON THE PASSENGER SIDE. I PROCEEDED TO CHECK ON MY WIFE SHE WAS SCREAMING IN PAIN AND SCARED. THE CAR WAS SMOKING FROM THE ENGINE BECAUSE THE CAR WAS STILL RUNNING, WHICH ALSO THERE WAS A POWER LINE FROM THE POLE ON THE GROUND I TRIED TO SHUT THE CAR OFF FROM THE USH START BUT NUMEROUS TIMES CAR WOULD NOT SHUT OFF, SO I HAD TO KICK MY DRIVER DOOR OPEN WENT AND TOOK MY WIFE OUT OF THE CAR. WITH ALL THE IMPACTS (3 TOTAL) NO AIR BAGS WENT OFF WHICH COULD HAVE STOPPED ME AND MY WITH FROM HITTING THE WINDSHIELD, FIRE DEPARTMENT HAD TO CUT THE BATTERY CABLE TO SHUT THE CAR OFF, LUCKILY WE DIDN'T GO THROUGH THE WINDSHIELD.  WE CAME OUT WITH CUT, BRUISES, TORN LIGAMENTS, BACK PAIN AND SORENESS BUT WE BOTH ARE STILL HERE. I FEEL THE AMOUNT OF MONEY I PAID FOR THIS CAR EVERYTHING SHOULD BE UP TO PAR ESPECIALLY THE SAFETY AIRBAGS.  *TR",
        "vin": "ZAM56RRA3E1"
    }
]