[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "11/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443305,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "November 21, 2021, while driving on the HWY at about 65 MPH, the forward panoramic moon roof exploded.  Simply exploded.  Not hit by anything - no cars or trucks in front of us.  Thank goodness, we had the interior part closed, or it would have exploded all over us. This was a very loud explosion!   Thank goodness I did not lose control of the car.",
        "vin": "2LMHJ5AT7EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435559,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Lincoln MKT. The contact stated that while her husband was driving 40 MPH, the power steering was seized, and the contact's husband had to manually steer the vehicle. The \"Service Advance Trac\" and \"Steering Assist Fault Service Required\" messages were displayed. The vehicle was taken to an independent mechanic and diagnosed with intermittent sensor failure. The mechanic reset the two sensors however, the failure recurred. The vehicle was taken to the dealer, but the dealer could not diagnose the failure since they were busy with other vehicles. The vehicle was not repaired and remained at the dealer. The manufacturer was not made aware of the failure. The failure mileage was approximately 105,150.",
        "vin": "2lmhj5at8eb"
    },
    {
        "components": "STEERING,SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417707,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On April 30, 2021 as I was driving down the road my steering wheel suddenly starting turning left to right involuntarily causing me to lose control of my car and crash. My vehicle is a total loss and I had just paid heavty deposit and financed a Lincoln Mkt with a dealership that never disclosed to me that my vehicle I just purchased had a recall on it that had been issued last year. Now I am out of my deposit, no car, criminal charges for causing an accident that I could not control, and a company that was well aware of the recall gets all their money plus some and I'm the one in the wrong. Doesn't seem right does it? Unfortuntly, the claims adjuster that inspected the vehicle to give an estimate failed to check the rear of the vehicle since all damage was in the front and driver side. I informed my insurance rep of the recall and have sent information on the recall along with the crash report of the incident. I do not recall seeing any warning lamps before this incident but I did feel that something was strange with the cars manuvering ability when accelrating or attempting to pass. It would kind of suddenly start a short of shimming of the vehicle that I have never experienced before in other vehicles driven previous to this one. Those signs were first noticed the second day after purchasing the car and two weeks later the incident occured.",
        "vin": "2LMHJ5AT3EB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415115,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 LINCOLN MKT PANORAMIC ROOF EXPLODED WITH NO WARNING WHILE DRIVING. FORD IS CLAIMING THIS IS A REPAIR FOR WHICH I NEED TO PAY. I BELIEVE THIS IS A DANGEROUS DEFECT THAT NEEDS TO BE RECALLED. THERE ARE SEVERAL DOCUMENTED INSTANCES OF THIS HAPPENING WITH THE 2014 LINCON MKT. I WAS DRIVING 20MPH AND TURNING WHEN THE ROOF EXPLODED",
        "vin": "2LMHJ5AT1EB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415119,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 20 MPH, THE PANORAMIC SUN ROOF EXPLODED WITHOUT IMPACT. THERE WERE NO REPORTED INJURIES. THE VEHICLE WAS TAKEN TO LARRY H. MILLER FORD PROVO (1995 N. UNIVERSITY PKWY, PROVO, UT 84604, (801) 734-9796) BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 92,000.",
        "vin": "2LMHJ5AT1EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11388968,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "19 JAN 2021 - FRONT MOONROOF GLASS EXPLODED OUT AT 69 MILES PER HOUR WITH NO OTHER VEHICLES AROUND, NO DEBRIS AROUND, ON I65 SOUTHBOUND AT APPROXIMATELY 8:00PM AND 61 DEGREES. AFTER GLASS EXPLODED OUTWARD, RESIDUAL GLASS THEN FELL ON MY HEAD (BALD), DOWN MY BACK AND SEAT (CROUCH) AREA AND BARELY BEING ABLE TO MAINTAIN THE VEHICLE.",
        "vin": "2LMHJ5NK6EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387839,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA FREQUENTLY STOPS WORKING, WHICH GREATLY REDUCES REARWARD VISIBILITY AND COMPROMISES SAFETY.  RECALLS HAVE BEEN ISSUED FOR OTHER LINCOLN MODELS FOR THIS SAME ISSUE BUT NOT THE 2014 MKT.",
        "vin": "2LMHJ5AT5EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384461,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. WHILE OPERATING THE VEHICLE, THE RADIO CLIMATE TEMPERATURE CONTROL PANEL RANDOMLY ACTIVATED AND ERRONEOUSLY CHANGE MODES. THE FAILURE PREVENTED THE FRONT WINDSHIELD FROM BEING DEFROSTED. THE VEHICLE WAS TAKEN TO BIENER FORD IN GREAT NECK  THE SERVICE REPRESENTATIVE SAID NOTHING CAN BE DONE  BECAUSE THEIR WAS NO PART REPLACEMENT, FOR THIS ISSUE. THE ISSUE HAPPENED EVERYDAY WEATHER ITS IN MOTION OR IN IDLE . THE FAILURE OCCURS ON CLIMATE CONTROL AS WELL. THE FAILURE MILEAGE WAS 95,000.",
        "vin": "2LMHJ5NK1EB"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL LETTER FROM LINCOLN IN EARLY 2020 FOR A RECALL ON REAR SUSPENSION TOW LINKS. I CALLED THE DEALER AND THEY SAID THE PARTS ARE NOT AVAILABLE AND WILL HAVE THEM AT THE END OF THE YEAR. I CALLED THEM IN OCTOBER AND THEY STILL SAYING NO PARTS, YET THE I CALLED THE PARTS DEPARTMENT AND THEY HAVE THE PARTS AVAILABLE IF YOU WANA BUY IT YOURSELF. I DRIVE THIS CAR IN LIMOUSINE SERVICE AND THIS IS SUCH A SAFETY CONCERN NOT ONLY FOR ME BUT FOR THE PASSENGER SITTING IN THE BACK. THE CUSTOMER SERVICE AT FORD DEALERSHIPS SUCKS.",
        "vin": "2LMHJ5NK5EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365311,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE CAR FROM A COLD (65 DEGREE) CONDITION, THE DISPLAY SHOWED AN ERROR MESSAGE \"ELECTRIC POWER ASSIST SYSTEM MALFUNCTION\" AND I OBSERVED NO POWER STEERING. THE WHEEL WAS NEARLY IMPOSSIBLE TO TURN.  TURNING THE CAR OFF AND RESTARTING IT RECTIFIED THE PROBLEM BUT I'M CONCERNED THAT THIS PROBLEM COULD OCCUR WHILE I'M DRIVING AND CAUSE ME TO DRIVE OFF THE ROAD DUE TO STEERING FAILURE.    INDEED, AFTER RESEARCHING THE SUBJECT ONLINE, I FOUND OTHER OWNERS OF LINCOLN MKT'S, IT'S TWIN FORD FLEX, AND SOME FUSION MODELS HAVE REPORTED THE SAME ISSUE AND SOME HAVE EVEN GONE OFF THE ROAD, ALTHOUGH NO INJURIES RESULTED. I ALSO LEARNED THERE WAS A FACTORY RECALL FOR THIS ISSUE INVOLVING MKT'S UNTIL MODEL YEAR 2013, AND OTHER MODELS, BUT MY CAR IS A 2014 AND IT OBVIOUSLY HAS THE SAME PROBLEM.    I'M VERY CONCERNED ABOUT THIS SAFETY ISSUE AND AM DISAPPOINTED THAT FORD MOTOR COMPANY DID NOT INCLUDE MODEL YEAR 2014 IN THE RECALL. PLEASE INVESTIGATE THE PROBLEM AND DEMAND THE FMC RECALLS THESE MODELS AS THEY SHOULD. THANK YOU.",
        "vin": "2LMHJ5AT5EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362262,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. WEST HERR FORD LINCOLN SERVICE (10 CAMPBELL BLVD, GETZVILLE, NY 14068, (716) 688-5464) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMHJ5ATXEB"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344010,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1-HEAD LIGHT FRONT RIGHT SIDE IS WORKING 5 MIN AND CLOSED DIRECT I GO MECHANIC IS NOT FUNDED ANY PROBLEM   2- MY CAR HAVE 2 RECALL I GOING DELAR PREMIER 152 58TH ST BROOKLYN NY 11220 AND SIDE I JUST MAKE 1 RECALL NUMBER 20E01 POWERTRAIN CONTROL MODULE REPROGRAMMING   OTHER RECALL NUMBER 20V072  REAR SUSPENSION TOE LINK REPLACEMENT  BECUSE DELAR TELL ME NOT HAVE PART AND TELL ME COMING BACK AFTER 3 MONTH WHY I SEE RECALL AND DEALER NOT HAVE PART AND NOT FIXED PLEASE I NEED HELP SEE ATTACH IS BILL FOR JUST 1 RECALL DEALR DOIT OTHER ONE NO NEED MAKED   I USED CAR IS VERY BAD SUSPENSION  REAR AND I SEE DEALER DONT CARE CUSTOMER",
        "vin": "2LMHJ5NK6EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343153,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *BF  CONSUMER STATED RECALL WAS ISSUED IN FEB. 20, 2010 BUT 7 MONTHS LATER NO SOLUTION FOR  THE RECALL. DEALER HAS BEEN CONTACTED.*JB",
        "vin": "2LMHJ5AT6EB"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": true,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "02/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11312214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING EAST ON RTE. 95 IN THE BRONX, NY ON WED. FEB, 19, 2020 AT APPROX. 10:15 AM.  I WAS IN THE MIDDLE LANE OF A 3 LANE HIGHWAY, THE CAR IS EQUIPED WITH GPS AND IT SHOWS I WAS DRIVING AT 53 MPH. ALL OF A SUDDEN THE VEHICLE TURNED LEFT INTO THE JERSEY BARRIER BOUNCED OFF AND UP AND TURNED 180 DEGREES AND DROVE ACROSS ALL 3 LANES. LUCKILY NO OTHER CAR WAS INVOLVED. ALL AIR BAGS DEPLOYED EXCEPT STEERING WHEEL AND DASHBOARD. THE DRIVERS' SIDE FRONT OF VEHICLE WAS SMASHED. THE REAR AXLE TURNED TOWARDS THE DRIVERS SIDE",
        "vin": "2LMHJ5NK2EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310072,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AROUND 70MPH WHEN MY SUNROOF EXPLODED. THERE IS A LOT OF PEOPLE REPORTING THE SAME ISSUE, BUT UNFORTUNATELY FORD/LINCOLN DOESN'T TAKE ANY RESPONSIBILITY AND IT'S OBVIOUS THAT IS A DEFECT AND REALLY DANGEROUS FOR PEOPLE IN THE VEHICLE.",
        "vin": "2LMHJ5NK1EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY THE MOON ROOF MAKES A LOUD POPPING NOISE THEN SHATTERS",
        "vin": "2LMHJ5FK7EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281277,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. WHILE OPERATING THE VEHICLE, THE RADIO CLIMATE TEMPERATURE CONTROL PANEL RANDOMLY ACTIVATED AND ERRONEOUSLY CHANGE MODES. THE FAILURE PREVENTED THE FRONT WINDSHIELD FROM BEING DEFROSTED. THE VEHICLE WAS TAKEN TO SOUTH HILLS LINCOLN (2760 WASHINGTON RD, PITTSBURGH, PA), BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WAS REPLACED NOW SPEEDOMETER IS 10 MILES FASTER THAN THE SPEED OF THE CAR  LINCOLN DOESNT KNOW HOW TO FIX IT.WHEN CAR TURNS ON THE RADIO WILL PUT THE HEAT ALL THE WAY UP IN 80 DEGREE WEATHER AND WHEN YOU TRY TO ADJUST IT GOES BACK UP TO HI HEAT",
        "vin": "2LMHJ5NK9EB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257895,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED SLUGGISHNESS ON INTERSTATE AND EXITED AT THE FIRST AVAILABLE EXIT THAT WAS APPROXIMATELY 1 MILE AWAY. WHEN EXITING INTERSTATE AND COMING TO A COMPLETE STOP AT THE STOP SIGN, IT DIED AND WOULD NOT START. IT WAS BLOCKING THE SINGLE TURNING LANE. IT WAS TURNING OVER VERY WELL BUT SEEMED TO BE LACKING FUEL MAYBE. HAD IT TOWED TO LOCAL MECHANIC SHOP. NO WORD BACK FROM THEM YET. JUST HAD THE FUEL PUMP REPLACED AT MY EXPENSE ABOUT 4 MONTHS AGO. I KNOW THERE WAS A RECALL ON THE FUEL PUMP BEFORE WE BOUGHT IT. IT WAS AN EMPLOYEE'S VEHICLE THAT WORKED AT THE DEALERSHIP AND I  SUSPECT THE SO-CALLED REPAIR WAS PENCIL WHIPPED AND NOT REALLY REPAIRED BY THE DEALERSHIP.  IT WAS A \"CERTIFIED \" CAR AND WE PAID A PREMIUM PRICE FOR IT AND I'M STILL PAYING!",
        "vin": "2LMHJ5AT5EB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240246,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO START CAR. INITIALLY NO KEY DETECTED APPEARED AS A WARNING WHILE DRIVING THE CAR. STOPPED AND WAS UNABLE TO RESTART. CHANGED REMOTE KEY BATTERY BUT STILL DID NOT START. RADIO WORKED. I COULD NOT RAISE THE WINDOWS OR LOCK THE DOORS MANUALLY/ WITH THE BUTTONS INSIDE THE CAR. I CALLED ROAD SIDE SERVICE THEY TOLD ME ABOUT THE BACKUP SLOT. CAR STARTED. IT HAPPENED AGAIN. TOOK CAR BATTERY TO BE TESTED IT WAS AT 96%, REPLACED REMOTE KEY BATTERY'S AGAIN. STILL DID NOT START. TRIED THE BACKUP SLOT BUT DID NOT START. NEXT DAY STARTED WITHOUT A PROBLEM TOOK TO DEALERSHIP. THEY DID A DIAGNOSTIC ALL SYSTEMS WERE FINE & THEY COULD NOT REPLICATE MY PROBLEM. THEY DID SEE THE NO KEY DETECTED AND CLEANED THE KEYS AND REPLACED THE KEY BATTERYS. I DROVE AWAY AND  AND STOPPED AT THE STORE AND AGAIN UNABLE TO START. THIS INTERMITTENTLY INABILITY TO START THE CAR HAS CONTINUED. I CAN DRIVE FOR 1-3 DAY OR 1-2 HOURS WITHOUT A PROBLEM THEN IT WILL NOT START. I HAVE TAKEN IT BACK TO THE DEALERSHIP BUT THEY TELL ME ALL SYSTEMS CONTINUE TO CHECK OUT FINE ACCORDING TO THE COMPUTER. AS OF TODAY NO MATTER WHAT I TRY. I AM UNABLE TO START THE VEHICLE NOW. THIS IS DAY 4 OF NOT BEING ABLE TO START MY CAR. I AM MAKING PAYMENTS ON A CAR JUST SITTING IN MY DRIVE WAY NOW UNABLE TO START. I HAVE LOOKED UP THE PROBLEM ONLINE AND DISCOVERED OTHERS WITH THE SAME ISSUE. THEY HAVE FOUND PROBLEMS CENTERED AROUND THE STARTER. I NEED A DEPENDABLE VEHICLE. I AM GOING TO HAVE IT TOWED IN.",
        "vin": "2LMHJ5FK0EB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186771,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. WHILE DRIVING THE VEHICLE, THE STEERING WHEEL SEIZED AND THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE CONTACT STATED THAT THE SAME FAILURE OCCURRED FOUR TIMES IN THE SAME DAY. THE VEHICLE WAS TAKEN TO AUTONATION FORD MARGATE (5401 W COPANS RD, MARGATE, FL 33063) WHERE IT WAS DIAGNOSED THAT THE STEERING GEAR NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V34000 (STEERING). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 130,150. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186374,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GLASS SUNROOF EXPLODED WHILE ME AND MY KIDS WHERE IN THE CAR. IT WAS SCARY AND CRAZY ALL AT THE SAME TIME. GARY YEOMAN LINCOLN STATES ITS NOT UNDER WARRANTY, AND THAT HIS WAS HIT BUY A SOMETHING CAUSING IT TO BREAK. AFTER READING ALL THE COMPLAINTA AND REVIEW. I THINK THEY SHOULD HAVE DONE A RECALL A LONG TIME AGO! I GOT OUT THE CAR TO GO THE DICKERSON CENTER ON ORANGE AVENUE IN DAYTONA BEACH AND EVERTHING WAS FINE AND GOT BACK IN AND MY SON ASKED WHATS WRONG WITH YOU SUN ROOF!",
        "vin": "2LMHJ5FK0EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163723,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. THE CONTACT STATED THAT THE VEHICLE DID NOT START WITHOUT WARNING AND WAS TOWED TO AUTONATION FORD ST. PETERSBURG (727-231-1323, LOCATED AT 2525 34TH ST N, ST. PETERSBURG, FL 33713). THE DEALER REPLACED THE FUEL PUMP ELECTRICAL MODULE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 104,000. *TT  CONSUMER STATED PARTICULAR SELECTIONS OF THE SAME CAR/MODEL ARE RECALLED OUR CAR WAS OMITTED FROM RECALL, AFTER 100K MILAGE PROBELMS SURFACED.*JB",
        "vin": "2LMHJ5FK5EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161396,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN 21 LINCOLN MKTS   8 OF THEM OVER TIME HAVE POPPED THERE PANORAMIC GLASS ROOFS , HALF OF THEM SITTING IN PARKING LOTS , THE OTHER HALF WITH CUSTOMERS IN CARS GOING DOWN THE ROAD , THIS VEHICLE POPPED ON EXPRESSWAY WITH PASSANGERS IN CAR.",
        "vin": "2LMHJ5NK7EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076687,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 2:30 IN THE AFTERNOON  OUR CHAUFFEUR  WAS SOUTHBOUND ON I 69  WITH A CUSTOMER IN CAR  WHEN THEY HEARD A LOUD GUNSHOT LIKE BANG.  GOT OFF ON THE NEXT EXIT  TO INSPECT VEHICLE AND FOUND  HOLE IN ROOF.  SOMEONE FROM THE OFFICE HAD TO TAKE THEM A NOTHER CAR TO SWITCH OUT.  THE ONE WITH THE SHATTERED SUNROOF WAS BROUGHT BACK TO THE SHOP.",
        "vin": "2LMHJ5AT2EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076788,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHT ONE OF THEM ALWAYS OFF",
        "vin": "2LMHJ5NK6EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "02/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072874,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PANORAMIC SUNROOF EXPLODED WHILE RIDING DOWN THE HIGHWAY. WITHOUT ANY WARNING WE HEARD A LOUD EXPLOSION LIKE A GUN HAD BEEN SHOT INSIDE THE CAR WE IMMEDIATELY NOTICED THE GLASS CRACKED IN THE MOONROOF AND NOTICED LITTLE BITS OF GLASS ALL IN THE CAR AND ON THE DRIVER AND PASSENGERS, I HAD MY GRANDCHILDREN WITH ME AND THEY WERE TERRIFIED. I WAS ABLE TO STOP WHEN I FOUND A SAFE PLACE AND CALLED MY HUSBAND TO COME GET US. I HAVE BEEN INFORMED BY THE DEALER AND LINCOLN I WOULD NEED TO FILE THE CLAIM ON MY AUTO INSURANCE. AFTER RESEARCHING THIS ONLINE I HAVE FOUND NUMEROUS COMPLAINTS ON THIS ISSUE AND LINCOLN HAS NOT ISSUED A RECALL. THIS MATTER NEEDS TO BE LOOKED INTO ASAP BEFORE SOMEONE IS SERIOUSLY INJURED OR KILLED.",
        "vin": "2LMHJ5AT7EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2017",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043595,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PANORAMIC GLASS ROOF SUDDENLY BROKE OFF WHEN DRIVING. NO CARS AHEAD OF ME, GLASS JUST EXPLODED LIKE MY CAR WAS GETTING SHOT. A LOUD BOOMM, WHEN STOPPED THE CAR TO LOOK AT IT, THE SIDES OF FRONT PANORAMIC GLASS ROOF WAS BROKEN ON THE BOTH SIDE AND ALL CRACKED IN BETWEEN. NOW, ONE DAY AFTER, ROOF HAS A BIG WHOLE IN THE MIDDLE. AFTER A RESEARCH ONLINE, THERE ARE MANY CASES LIKE MINE THAT HAVE HAPPENED ON SAME KIND CAR, SO THIS SEEMS A MANUFACTORY ISSUE TO ME. AND THIS IS A SAFETY ISSUE, WHICH SOMEONE COULD HAVE GOTTEN HURT INSIDE. THANK GOD MY INSIDE COVER WAS CLOSED. HOPE THIS ISSUE CAN GET RESOLVED",
        "vin": "2LMHJ5NK6EB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/16/2017",
        "dateOfIncident": "04/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978707,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING DOWN THE ROAD 4/16/17 ON A CLEAR 78 DEGREE DAY AND THE FRONT VISTA GLASS ROOF EXPLODES INTO PIECES. NO OTHER VEHICLES AROUND AND NO EXPLANATION AS TO WHY THE GLASS SHATTERED. SHARDS OF BROKEN GLASS CAME INTO THE PASSENGER COMPARTMENT ONTO THE DRIVER AND ALMOST CAUSED AN ACCIDENT.",
        "vin": "2LMGJ5M96EB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2017",
        "dateOfIncident": "02/18/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT ROOF GLASS PANEL EXPLODING FOR NO APPARENT REASON WHILE DRIVING ON HIGHWAY WITH NO CARS OR BRIDGES AROUND ME. SHARDS AND PIECES OF BROKEN GLASS HITTING ME AND PASSENGER. SAFETY ISSUE AND HAS HAPPENED TO HUNDREDS OF PEOPLE AND LINCOLN/FORD WILL NOT STAND BEHIND LACK OF WORKMANSHIP OR DESIGN FLAW. THEY WANT $1800 TO REPAIR.",
        "vin": "2LMHJ5NK6EB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "10/12/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916351,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LINCOLN MKT 2014  HAS STALLED THREE TIMES. I HAVE ALWAYS TAKEN IT TO A DEALER FOR REGULAR MAINTENANCE AND REPAIR. IT HAS NOT EVEN BEEN TWO WEEKS SINCE THE CAR CAME BACK AFTER A 1 MONTH OF REPAIR FROM THE DEALER THAT MY CAR DOES NOT START. I CALLED ROADSIDE ASSISTANCE, THEY GAVE A BOOST WHICH MADE THE CAR START BUT AFTER LEAVING THE ENGINE RUNNING FOR 1 HOUR AND TURNING IT OFF, THIS CAR DOES NOT START! LINCOLNS MKT HAS SERIOUS CAR DEFECTS THAT EVEN THEIR TRAINED MECHANICS DON'T SEEM TO RESOLVE THE PROBLEMS THIS CAR HAS GIVEN ME. I BOUGHT THIS CAR BRAND NEW AND SINCE 2014 CAR IS UNDER 100000MILES AND HAS STALLED THREE TIMES! FYI THE DEALER CHANGED MY CAR BATTERY AND IT HAS NOT EVEN BEEN A YEAR WITH A NEW BATTERY!!!  *TR",
        "vin": "2LMHJ5AT0EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "10/08/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915151,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HEARD ABOUT A RECALL OF CERTAIN LINCOLN MKT'S WITH THE ECOBOOST ENGINE BACK IN AUGUST.  THERE WAS MENTION THAT THERE WAS A PROBLEM WITH THE FUEL INJECTOR AND THAT THE CAR COULD POTENTIALLY STALL.  I PROMPTLY MADE AN APPOINTMENT TO TAKE MY CAR INTO THE DEALERSHIP.  WHEN THERE, THEY TOLD ME THEY DIDN'T HAVE THE PARTS AND HAD NO IDEA WHAT TO EVEN ORDER; THAT I SHOULD WAIT FOR A NOTICE FROM FORD/LINCOLN.  I DID RECEIVE A LETTER A COUPLE WEEKS AGO BUT IT SAID TO WAIT UNTIL THE DEALERSHIP CONTACTS ME THAT THEY HAVE PARTS OR CONTACT THEM IF MY CAR SHOWS \"SYMPTOMS\", WHICHEVER OCCURS FIRST.  ON SATURDAY, MY CAR LITERALLY STOPPED WORKING WITH NOT MORE THAN A 2 MINUTE WARNING. I HAD BEEN DRIVING IT ON ERRANDS.  I STOPPED AT A FRIENDS'S HOUSE OF ABOUT 15 MINUTES. I   HAD TURNED THE CAR OFF.  WHEN I LEFT MY FRIEND'S HOUSE, I WAS DRIVING DOWN A RESIDENTIAL STREET-25 MPH.  SUDDENLY, THE CAR FELT FUNNY.  IT WAS HESITATING.  I THOUGHT IT WAS IN THE WRONG GEAR.  I LOOKED DOWN, SAW IT WASN'T AND W/IN A MINUTE, THE CAR WAS DEAD.  THE ENGINE WAS STILL RUNNING BUT THE CAR WOULDN'T MOVE FORWARD OR BACKWARD.  OVER THE NEXT 1.75 HOURS AS I WAITED FOR LINCOLN ROADSIDE ASSISTANCE, I TRIED TO START THE CAR.  IT WOULD START BUT IMMEDIATELY STALL OUT.  THE ELECTRICAL WAS STILL WORKING. HAD I BEEN ON A HIGHWAY OR MAIN ROAD WITH A FAST MOVING CAR OR TRUCK BEHIND ME, I'D BE EITHER DEAD OR FOREVER DISABLED.  THESE CARS NEED TO BE OFF THE ROAD!",
        "vin": "2LMHJ5AT7EB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908115,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. WHILE DRIVING 15 MPH, THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AFTER FOUR ATTEMPTS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 18,900.",
        "vin": "2LMHJ5AT7EB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "03/31/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852720,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED IN FRONT OF A HOTEL FOR ABOUT 10 MINUTES WITH THE ENGINE RUNNING AND THE WINDOWS UP, THE FORWARD HALF OF THE GLASS ROOF EXPLODED OUTWARD WITH A LOUD BANG. LUCKILY, THE SUNSHADE WAS CLOSED SO NO GLASS FELL DIRECTLY THE PASSENGER. THERE WAS NO IMPACT, NO EXTREME TEMPERATURE, ABSOLUTELY NOTHING THAT WOULD CAUSE THIS TO OCCUR...   DATE OF OCCURRENCE: 3/31/2016  TIME OF OCCURRENCE: 7:18AM  TEMPERATURE AT THE TIME IT HAPPENED: 50 DEGREES FAHRENHEIT  PHYSICAL LOCATION:  KENT STATE UNIVERSITY HOTEL, 215 S. DEPYSTER ST, KENT, OH      AFTER SEARCHING THE INTERNET, I FOUND SO MANY PEOPLE THAT HAVE EXPERIENCED SIMILAR BREAKAGE... INDICATES THAT THERE HAS TO BE A DEFECT IN THE DESIGN OR POSSIBLY THE TEMPERING OF THE GLASS ITSELF. WHILE THERE WAS NO DANGER IN MY SITUATION, IT IS EASY TO SEE HOW THIS COULD CAUSE AN ACCIDENT IF IT OCCURRED UNDER DIFFERENT CIRCUMSTANCES.   I FEEL THIS DEFINITELY NEEDS TO BE ADDRESSED WITH THE MANUFACTURER.",
        "vin": "2LMHJ5NK8EB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/24/2015",
        "dateOfIncident": "11/19/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806605,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 LINCOLN MKT. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE CONTROL ARM FAILED CAUSING THE CONTACT TO LOSE CONTROL OF THE VEHICLE. AS A RESULT OF LOSING CONTROL OF THE VEHICLE, THE PASSENGER SIDE OF THE VEHICLE SUSTAINED DAMAGE. THE VEHICLE WAS TAKEN TO DEALER FOR DIAGNOSIS HOWEVER DETAILS WERE NOT AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 53,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "09/19/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780625,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TO START WE HAVE 5 OTHER LINCOLN MKTS  WITH THE SAME CONCERN IN THE LAST 18 MONTHS, 4 WHICH WERE COVERED UNDER BASE WARRANTY. THE GLASS ROOF DURING WHAT SEEMS TO BE TEMPERATURE CHANGES POPS. THIS TIME LINCOLN WILL NOT COVER THIS EVEN THOUGH IT ONLY HAS 25,000 MILES ON IT. I WENT THROUGH REGULAR FORD CHANNELS AND THEY REFUSED FULL COVERAGE. AFTER SOME RESEARCH I FOUND THEY HAVE HAD PROBLEMS WITH OTHER VEHICLES AS WELL . THE CONDITIONS AT THE TIME THE ROOF POPPED . CAR WAS PARKED  DURING DAY AND THROUGH THE NIGHT IN A SECURED LIT CAMERA MONITORED PARKING  LOT. THE NEXT MORNING ROOF WAS SHATTERED.",
        "vin": "2LMHJ5NK1EB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682119,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE INTERSTATE, MOON ROOF SPONTANEOUSLY CRACKED/SHATTERED. ROAD CONDITIONS WERE CLEAR, THERE WAS NO DEBRIS IN THE AREA. DRIVER AND PASSENGER STATED THEY HEARD A LOUD \"BOOM.\" THE DRIVER IMMEDIATELY INSPECTED THE VEHICLE AND FOUND A SMALL BREAK IN THE GLASS DIRECTLY ABOVE THE DRIVER'S SEAT. THE GLASS CONTINUED TO CRACK/SHATTER AS TRANSPORTED TO THE SHOP FOR REPAIR/REPLACEMENT.",
        "vin": "2LMHJ5NK5EB"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "04/14/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628779,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN ROOF GLASS SHATTERED, THIS IS CAR NUMBER 315, WE ARE A LIVERY COMPANY AND THIS IS CAR 1 OF 5 (SO FAR) TO HAVE THE SUN ROOF SPONTANEOUSLY SHATTER OUT OF 18 CARS PURCHASED (ALL 2014 LINCOLN MKT'S.)  *TR",
        "vin": "2LMHJ5NKXEB"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628792,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN ROOF GLASS SHATTERED, THIS IS CAR NUMBER 343, WE ARE A LIVERY COMPANY AND THIS IS CAR 2 OF 5 (SO FAR) TO HAVE THE SUN ROOF SPONTANEOUSLY SHATTER OUT OF 18 CARS PURCHASED (ALL 2014 LINCOLN MKT'S.)  *TR",
        "vin": "2LMHJ5NK4EB"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED IN OUR LOT, ALL OF A SUDDEN AN EMPLOYEE HEARD A LOUD NOISE FROM CAR, NO ONE WAS AROUND THE CAR, WHEN THE EMPLOYEE WALKED OVER THE ROOF WAS SHATTERED.    THIS IS CAR NUMBER 307, WE ARE A LIVERY COMPANY AND THIS IS CAR 3 OF 5 (SO FAR) TO HAVE THE SUN ROOF SPONTANEOUSLY SHATTER OUT OF 18 CARS PURCHASED (ALL 2014 LINCOLN MKT'S.)  *TR",
        "vin": "2LMJJ5NK1EB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598073,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HWY AND MY FREIND WAS DRIVING BEHIND ME.MY VISTA GLASS MOONROOF EXPLODED AND SHATTERED.IT WAS NOBODY IN FRONT OR ON THE SIDE JUST MY FREIND BEHIND ME.   *JS",
        "vin": "2LMHJ5NK7EB"
    }
]