[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254087,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "CUBE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE DROVE CAR TO THE STORE WHEN SHE GOT BACK IN THE CAR WOULD NOT START ,THE BRAKE PEDAL WOULD NOT DEPRESS AFTER20 MIN SHE TRIED AGAIN AND THE CAR STARTED . WHEN I GOT HOME I TRIED TO START THE CAR AND IT WOULD NOT START ,I WENT TO YOU TUBE AND FOUND A VIDEO WITH THE SAME PROBLEM AND THE VIDEO SAID TO GIGGLE THE WIRES UNDER THE DASH I DID THAT AND IT WOULD NOT START I TRIED 4 DAYS LATER AND IT STARTED THE VEHICLE WAS PARKED IN MY DRIVEWAY",
        "vin": "JN8AZ2KR1ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/23/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191035,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "CUBE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER COMING TO A STOP (OR NEAR STOP) FROM HIGHWAY SPEEDS, MY 2014 NISSAN CUBE DOES NOT RESPOND TO DEPRESSING THE ACCELERATOR. I WOULD PRESS THE GAS TO THE FLOOR AND IT BARELY MOVED. IT WAS EXTREMELY SLOW, LIKE THE ENGINE WOULD NOT GO ABOVE IDLE.  AFTER 5-20 SECONDS IT WOULD  FINALLY ACCELERATE.     A COUPLE OF TIMES I WAS IN HEAVY TRAFFIC ON A LIMITED ACCESS RURAL HIGHWAY.  THE LIGHT AHEAD HAD TURNED RED AND I DECELERATED TO AN ALMOST STOP BEFORE THE LIGHT CHANGED TO GREEN.  OF COURSE, I IMMEDIATELY LET OFF THE BRAKE PEDAL AND PRESSED THE ACCELERATOR. THE CAR DIDN'T RESPOND AND THE TRAFFIC FROM BEHIND WAS CLOSING AT NEAR HIGHWAY SPEED.  FORTUNATELY, I WAS ABLE TO SWERVE OFF OF THE ROAD ONTO THE SHOULDER AS THE OVERTAKING TRAFFIC BARRELLED PAST ME.     ONE PARTICULARLY SCARY TIME I WAS IN THE LEFT LANE WITH GUARD RAIL ON THE LEFT AS WE WERE APPROACHING A BRIDGE; THE NO RESPONSE EVENT REPEATED ITSELF, BUT I WAS UNABLE TO EXIT THE ROADWAY TO THE LEFT. I KEPT THE PEDAL DOWN AND PRAYED NO ONE WOULD HIT ME. KARMA WAS WATCHING OVER ME AS THE CARS COMING FROM BEHIND REALIZED JUST IN TIME THAT I WAS BARELY MOVING AND SWERVED TO MISS ME. A COUPLE OF THE CARS NARROWLY MISSED HITTING ME; THERE WAS A LOT OF SQUEALING TIRES AND BLARING HORNS. LUCKILY FOR ME, I WAS WEARING DARK-COLORED UNDERWEAR'..    IT APPEARS TO HAPPEN MORE OFTEN AS THE CAR ACCUMULATES MILEAGE.  I NEVER KNOW WHEN THIS WILL HAPPEN, SO NOW I TRY TO BE IN THE RIGHT LANE FOR UPCOMING STOPS, BUT SOMETIMES YOU ARE CAUGHT OFF GUARD FOR A TRAFFIC LIGHT CHANGE.  THIS IS VERY SCARY.  CAR SHOULD BE RECALLED.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186657,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "CUBE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT ON THE REAR DRIVER SIDE WILL NOT AUTO-RETRACT AND HAS TO BE HAND FEED THEN TUGGED A BIT IN ORDER TO SECURE CAR SEAT.  *TR",
        "vin": "JN8AZ2KR3T3"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "04/18/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11171471,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "CUBE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTHER WAS IN A ONE VEHICLE CRASH VS A TREE WHILE NEGOTIATING A CURVE.  THE SEAT BELT TENSIONER DID NOT LOCK AND RESTRAIN MY MOTHER CAUSING HER TO SLIDE DOWN THE SHOULDER HARNESS CAUSING THE SEAT BELT TO CUT INTO HER CHEST CAVITY INTO HER LUNG. NISSAN WAS CONTACTED AND SENT AN ATTORNEY AND AN ENGINEER TO INVESTIGATE. *DT*JB",
        "vin": "JN8AZ2KR4ET"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "01/17/2015",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744848,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "CUBE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ORIGIN AND CAUSE OF A VEHICLE FIRE INCIDENT THAT OCCURRED ON JANUARY 17, 2015, APPROXIMATELY TWO MILES EAST OF WIDENER JUNCTION ON HIGHWAY 70 NEAR MEMPHIS, TENNESSEE. IT STARTED BY A FIRE THAT OCCURRED WHILE DRIVING MY 2014 NISSAN CUBE WITH VEHICLE IDENTIFICATION NUMBER (VIN) [XXX].      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR    UPDATED 9/15/15 *LN    *CN",
        "vin": "JN8AZ2KR4ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2015",
        "dateOfIncident": "03/10/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693706,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "CUBE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD NOT ACCELERATE YET RPM'S WOULD RISE.  *TR",
        "vin": ""
    }
]