[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413979,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE ON HIGHWAY AND CITY STREET AT SPEEDS BETWEEN 45-65 MPH, PRESSURE WARNING LIGHT CAME ON.  VEHICLE BEGAN FISHTAILING AND TIRE BLEW.  WHILE PULLING OVER TIRE CAME OFF RIM.  TIRE BRAND:  BRIDGESTONE POTENZA TIRE SIZE:  275/35R19  TIRES ARE 7 MONTHS OLD; 2,265 MILES PUT ON NEW TIRES BEFORE BLOW OUT.  LUCKY I'M ALIVE AND DID NOT HIT ANOTHER VEHICLE.",
        "vin": "JN1AZ4FH3EM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394285,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AIRBAG WILL NOT OPERATE WHEN THE PASSENGER IN THE VEHICLE IS LESS THAN 130 POUNDS.  I HAVE SPOKEN WITH MY LOCAL NISSAN DEALERSHIP AND WITH A DIRECT EMPLOYEE OF NISSAN AND HAVE BEEN TOLD THAT IT IS BECAUSE OF THE WEIGHT AND BODY STRUCTURE OF THE PASSENGER.  WHEN I AM IN THE PASSENGER SEAT OF THIS VEHICLE THE AIRBAG TURNS OFF.  I AM 5'4\" AND WEIGH APPROXIMATELY 115 POUNDS..  NISSAN DOES NOT CONSIDER THIS A PROBLEM.  I AM BEING TOLD THE VEHICLE IS OPERATING CORRECTLY.  I HAVE NEVER HAD THIS ISSUE WITH ANY OTHER VEHICLE AND CAN NOT UNDERSTAND HOW THIS IS ACCEPTABLE UNDER LAW.  AT THIS POINT NISSAN IS UNWILLING TO DO ANYTHING ABOUT IT.  I HAVE REVIEWED WHAT I CAN FIND ON YOUR WEBSITE AND FEEL THAT THIS IS SOMETHING WHICH IS BROKEN OR DOES NOT FOLLOW THE REQUIREMENTS OF LAW.  I WOULD LIKE YOUR FEEDBACK CONCERNING THIS.",
        "vin": "JN1AZ4FH3EM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329488,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CLUTCH WOULD NOT COME OFF THE FLOORBOARD.  I COULD NOT SHIFT INTO ANY GEAR. THIS HAPPEN 3 DIFFERENT TIMES AFTER I WOULD MAKE LONG FREEWAY TRIPS WITHOUT SHIFTING. I HAD 3 DIFFERENT, WELL ESTABLISHED MECHANICS LOOK AT MY AND DO A DIAGNOSTIC TEST. AS I WAITED FOR A TOW TRUCK.  I FOUND A LAWSUIT AGAINST NISSAN FOR A FAULTY (CONCENTRIC) CLUTCH SLAVE CYLINDER! ON 2 OF THE OCCASIONS I WOULD LET MY CAR COOL DOWN FOR AN HOUR OR SO AND IT WOULD BE FINE. ON THIS OCCASION, I LET MY  SIT OVER NIGHT. THE NEXT DAY MY CLUTCH  WAS STILL ON THE FLOOR. I FULLED THE CLUTCH OFF THE FLOOR WITH MY FOOT. I TURNED THE CAR ON. THE CAR LUNGED FORWARD ALMOST GOING INTO THE HOTEL BUILDING.  I PULLED THE E-BREAK AND TURNED THE CAR OFF. THE CAR WAS TOWED TO THE NISSAN DEALERSHIP IN RENTON  WA. I HAD TO EXPLAIN TO THE DEALER ABOUT THE LAWSUIT ON THE CLUTCH SLAVE CYLINDER.  HE HAD NOT HEARD OF IT. I CONTACTED ME LATER AND AGREED IT WAS THE CLUTCH SLAVE CYLINDER. I WAS EXITING THE FREEWAY 2 TIMES AND WAS NOT ABLE TO SHIFT PAST 2ND GEAR THE TWO TIMES BEFORE. THIS LAST TIME I WAS COMING OFF THE FREEWAY AND HAD TO COAST INTO THE NEAREST DRIVE. I WAS CAUGHT OFF GUARD , I ROLLED THROUGH ONE FOUR WAY STOP WITH MY HAZARD LIGHTS ON. SO NOT TO GET STUCK IN MIDDLE OF THE ROAD.  *TR",
        "vin": "JN1AZ4FH4EM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "06/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228501,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMARY:    THE VEHICLE CONCENTRIC SLAVE CYLINDER (CSC), A COMPONENT OF THE TRANSMISSION AND CLUTCH, FAILED ABRUPTLY IN HEAVY TRAFFIC, LEAVING THE VEHICLE FORCED IN-GEAR AND UNABLE TO SHIFT OUT OF GEARS OR TO NEUTRAL WITHOUT DAMAGING THE TRANSMISSION.  THIS IS A SIGNIFICANT SAFETY RISK SINCE IT HAPPENS ABRUPTLY AND REMOVES CONTROL OF THE VEHICLE FROM THE DRIVER; DUE TO THE NATURE OF THE FAILURE, THIS CAN ALSO CREATE A PANIC-SITUATION SIMILAR TO BRAKE, STEERING, OR THROTTLE FAILURES SINCE THE CLUTCH IS AN ESSENTIAL PART OF CONTROLLING A MANUAL TRANSMISSION VEHICLE IN ALL SCENARIOS.    EVENT:    WHILE DRIVING IN TRAFFIC, SHIFTING FROM 2ND TO 3RD GEAR (AT APPROXIMATELY 30 MPH) THE CLUTCH PEDAL WOULD NOT RETURN ONCE THE VEHICLE WAS IN 3RD GEAR.  I HAD TO STALL THE VEHICLE INTENTIONALLY, THUS AT HIGH SPEED (APPROXIMATELY 10+MPH) AND IN TRAFFIC, THE TIRES OF THE VEHICLE LOCKED-UP AND THE CAR SKIDDED TO A STOP.  THIS ALSO IMPARTED DRIVETRAIN AND ENGINE SHOCK DUE TO THE LARGE MECHANICAL FORCES INVOLVED.        CONCERNS:    IN ALMOST ALL TYPICAL DRIVING SCENARIOS, THIS FAILURE CAN BE DEADLY.  IF THIS HAPPENS ON A TWO-LANE HIGHWAY THIS CAN LEAD TO HEAD-ON COLLISIONS.  IF IT HAPPENS ON A FREEWAY THAT SEES AN ABRUPT STOP, THIS CAN LEAD TO A MULTI-CAR COLLISION. IF THIS HAPPENS ON A ROAD WITH BENDS OR TURNS THIS CAN RESULT IN LOSS OF CONTROL SUCH THAT THE VEHICLE MAY BE OFF-ROAD OR OVER GUARDRAILS.      WHY NHSTA INVOLVEMENT IS CRITICAL:    THIS IS A SIGNIFICANT SAFETY CONCERN AND A COMMON FAILURE MODE OF CARS WITH THIS SAME NISSAN TRANSMISSION, AND IT IS CAUSED BY NEGLIGENT DESIGN AND MANUFACTURING PRACTICES BY NISSAN.  FAILED CLASS-ACTION LAWSUITS PUT TOGETHER BY SMALL TEAMS OF PEOPLE HAVE NOT RESULTED IN REMOVING THIS SAFETY CONCERN FROM THOSE WHO HAVEN'T SEEN THE FAILURE YET.    MY VEHICLE IS A WELL MAINTAINED 2014 NISSAN 370Z WITH LESS THAN 20,000 MILES ON IT, FOR REFERENCE.",
        "vin": "JN1AZ4EH9EM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "06/06/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101448,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING MY 2014 NISSAN 370Z FOR 40,000 MILES, THE CLUTCH STUCK TO THE FLOOR.  I WAS AT AN INTERSECTION AND FINALLY ABLE TO PULL THE CLUTCH PEDAL UP WITH MY FOOT.  AT THE NEXT INTERSECTION, AGAIN THE CLUTCH STAYED DOWN AND AGAIN I WAS ABLE TO PULL IT UP TO SHIFT GEARS.  UPON THE THIRD SHIFTING OF GEARS, THE CLUTCH STAYED ON THE FLOOR AND EVEN LIFTING IT WITH MY FOOT, I WAS NOT ABLE TO GET IT INTO ANY GEAR.  HAD I BEEN IN THE MIDDLE OF A HIGHWAY SHIFTING GEARS I MIGHT NOT HAVE BEEN ABLE TO GET TO THE SIDE OF THE ROAD THEREFORE I WOULD HAVE DEFINITELY BEEN IN A HAZARDOUS SITUATION FOR BOTH MYSELF AND OTHER DRIVERS.",
        "vin": "JN1AZ4EH6EM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092575,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN 370Z. WHILE DRIVING 20 MPH, THE CHECK ENGINE INDICATOR ILLUMINATED AND THE VEHICLE STALLED.  THE CONTACT TURNED OFF AND RESTARTED THE VEHICLE; HOWEVER, WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO ACCELERATE OVER 5 MPH. THE DEALER (NISSAN OF BURLINGAME, 101 CALIFORNIA DRIVE, BURLINGAME CA 94010) DIAGNOSED THAT THE ENGINE HARNESS NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000.",
        "vin": "JN1AZ4EH6EM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2015",
        "dateOfIncident": "06/22/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730197,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CSC - CLUTCH SLAVE CYLINDER GAVE UP ON ME PUTTING MY CLUTCH PETAL TO THE FLOOR UNABLE TO CHANGE ANY GEARS. I WAS STRANDED ON THE ROAD FOR HOURS. NISSAN MUST FIX THIS ISSUE WITH 370Z WITH MANUAL TRANSMISSION THE CSC IS MADE OF PLASTIC AND SHOULD (MUST) BE REPLACED WITH ONE MADE MY METAL.     MANY HUNDREDS OF 370Z ENTHUSIAST HAVE THIS ISSUE.",
        "vin": "JN1AZ4EH2EM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/16/2015",
        "dateOfIncident": "03/10/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694675,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A BRAND NEW 2014 NISSAN 370Z BACK ON MAY 9TH 2014. AMAZING CAR WITH ONE REALLY BAD WEAK LINK, CSC. MY CSC (CLUTCH SLAVE CYLINDER) WENT OUT AT 23,309 MILES. LUCKILY I WAS PARKED RIGHT OUTSIDE MY HOUSE. MY CLUTCH PEDDLE SANK TO THE FLOOR AND WOULD NOT ENGAGE. HAD TO TOW THE VEHICLE TO MY DEALERSHIP TO HAVE THEM DETERMINE IT \"WOULD NOT BE COVERED UNDER WARRANTY\" DUE TO \"MISUSE OF THE VEHICLE\" FROM A \"BURNT\" FLYWHEEL. I DID SOME RESEARCH AND HUNDREDS OF 370Z'S WITH MANUAL TRANSMISSIONS HAVE HAD THE SAME ISSUE WITH THEIR CSC. THERE ARE PAGES AND PAGES OF DISCUSSIONS ON FORUMS ABOUT THIS PLASTIC CSC. WE BELIEVE THERE SHOULD BE A RECALL ON THIS AND SHOULD BE COVERED UNDER WARRANTY SINCE HUNDREDS OF CONSUMERS HAVE HAD THE SAME ISSUE AND NISSAN DOES NOT WANT TO COVER IT UNDER THE POWERTRAIN WARRANTY WHEN IN FACT IS A POWER TRAIN ISSUE ON THEIR PART.GREAT CAR, BAD CSC, BAD CUSTOMER SUPPORT BY NISSANS CONSUMER AFFAIRS.    *TR",
        "vin": "JN1AZ4EH9EM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/20/2014",
        "dateOfIncident": "08/19/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626501,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS INCIDENT OCCURRED AT A BUSY INTERSECTION DURING HEAVY TRAFFIC.   MANUAL TRANSMISSION  SUNNY, AIR TEMP APPROX 75 F.  THE VEHICLE HAD BEEN DRIVEN APPOX 0.25 MILES  & 2 MINUTES IMMEDIATELY PRIOR TO EVENT AND PARKED FOR THE PREVIOUS 4 HOURS.    DRIVER PARTIALLY ENGAGED THE CLUTCH AND SHIFTED TO 1ST GEAR TO INITIATE FORWARD MOVEMENT OF THE VEHICLE FROM A COMPLETE STOP.     AT A SPEED OF APPROX 10MPH THE DRIVER FULLY DEPRESSED THE CLUTCH PEDAL (TO DISENGAGE THE CLUTCH) TO COAST MOMENTARILY WITH TRAFFIC AND SHIFT TO 2ND GEAR.    THE DRIVER PARTIALLY RE-ENGAGED THE CLUTCH WITH THROTTLE TO RESUME ACCELERATION WITH TRAFFIC. THE CLUTCH PEDAL FAILED TO RETURN TO THE FULLY ENGAGED, DEFAULT, POSITION DURING OPERATION; THE CLUTCH PEDAL RETURNED ONLY APPROXIMATELY 1/3 OF NOMINAL TRAVEL DISTANCE.  CONCURRENTLY, THE CLUTCH DID NOT ENGAGE AND SLIPPED WITH REGULAR THROTTLE APPLIED FOR THE SHIFTING CONDITION.      PUMPING OF THE CLUTCH PEDAL DID NOT RESTORE NORMAL CLUTCH PEDAL POSITION NOR NORMAL CLUTCH FUNCTION.    FAILURE OF THE CLUTCH TO PROPERLY ENGAGE AND DISENGAGE PREVENTED THE DRIVER FROM FULLY AND SAFELY CONTROLLING THE VEHICLE.     DRIVER FORCED TRANSMISSION TO NEUTRAL POSITION, INDICATED TO SURROUNDING TRAFFIC AND COASTED TO SHOULDER ACROSS MULTIPLE LANES.    DRIVER NOTED THAT NO APPARENT OBSTRUCTION TO THE MECHANICAL OPERATION OF THE CLUTCH PEDAL WITHIN THE CABIN.  DRIVER NOTED AN ODOR, PRESUMABLY FROM OVERHEATED CLUTCH OR HYDRAULIC FLUIDS.    SUBSTANTIALLY NORMAL CLUTCH PEDAL AND CLUTCH FUNCTION RETURNED WITHIN SEVERAL MINUTES.     THE VEHICLE WAS DRIVEN SEVERAL MILES AND PARKED FOR AN HOUR. NORMAL CLUTCH PEDAL AND CLUTCH FUNCTION WERE NOTED AFTER THIS HOUR.  *TR",
        "vin": "JN1AZ4EH3EM"
    }
]