[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "03/03/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456059,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1. Timing Chain failure. Yes it is available for inspection. 2. Vehicle will shut down and stop while being driven. 3. Diagnosed by Nissan dealer. 4. Vehicle was diagnosed by dealer but not inspected by the manufacturer. 5. No warning lamps or messages, only a rattle noise for last week or so.",
        "vin": "JN8AF5MV1ET"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449532,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's daughter owns a 2014 Nissan Juke. The contact stated that while her daughter was reversing at an undisclosed speed, the power steering assist failed. The vehicle was towed to an independent mechanic and diagnosed with a fractured front axle and a fractured driver's side control arm. The vehicle was not repaired and remained with the independent mechanic. The manufacturer was not made aware of the failure. The failure mileage was approximately 86,000.",
        "vin": "jn8af5mv4et"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441595,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I just replaced my transmission and was told by the dealership of the CVT issues. It cost me almost $4k to replace when I picked up my car it was in worse condition and the turbo went. How convienant. Nissan has made my life so difficult and overwhelming and the service I've experienced is gross. I've put more money into this car then it's worth. Oh they also put wood blocks under  my engine.",
        "vin": "JN8AF5MR2ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/31/2021",
        "dateOfIncident": "09/29/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438817,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Yes transmission problems loud is loud whistling noise overheating of the transmission at long periods of driving have not taken it to the dealership to get checked did read up online that in that there are problems with the transmission in this year of car is this year of cars and also making model of the 2014 Nissan Duke CVT transmission",
        "vin": "Jn8af5mr2et"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "08/05/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428495,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 Nisan Juke, 68,772 miles, makes high pitched noise and emits an acrid smell when going up steep mountain interstate highway, it then slows to a stop.  No warning lights or high temp readings. Very dangerous to stop and stall on an major interstate.  It seems to be a transmission problem.  First time it happened, Empire Nissan dealer said it was fine, changed the oil and sent me off.  2nd time, actual breakdown, took it to a local mechanic who said it is probably a lock up, as in Code PO774.  Now at different dealer Shomp, they are diagnosing and hopefully fixing it.  There is a Class Action Suit about this Juke, CVT litigation, Nissan appears to have extended the warranty.",
        "vin": "JN8AF5MV8ET"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402828,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN MALFUNCTION CAUSED OIL LEAK. THE CAR IDLED DOWN AND SHUTS OFF.",
        "vin": "JN8AF5MV0ET"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398482,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN RUBBED A HOLE IN THE TIMING COVER CAUSING ENGINE SHUT OFF, OIL LEAK EVERYWHERE ON PASSENGER SIDE AND METAL IN THE OIL.  LUCKILY I WAS IN A PARKING LOT WHEN THIS HAPPENED.",
        "vin": "JN8AF5MV7ET"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396027,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGAN NOTICING ISSUES WITHIN FIRST YEAR OF OWNING VEHICLE. EVERY OCCURRENCE WOULD TAKE IT TO DEALERSHIP (GRAINGER NISSAN OF SAVANNAH, GA) TO GET CHECKED.  BY THE TIME I GOT TO THE DEALERSHIP, EVERYTHING WOULD BE WORKING FINE. THEY DID A COMPUTER DIAGNOSTIC TEST ON THE ELECTRICAL/NAVIGATION SYSTEMS EACH TIME WITH NO ISSUES BEING FOUND. I REQUESTED IT TO BE DOCUMENTED EACH TIME IN THE EVENT SOMETHING HAPPENED AFTER WARRANTY ENDED. UNFORTUNATELY I DO NOT HAVE THE DATES/MILEAGE BUT SHOULD BE DOCUMENTED AT THE AFOREMENTIONED DEALERSHIP. SO THE DATES/MILEAGE STATED IS AN ESTIMATION. THE FOLLOWING IS A MORE DETAILED EXPLANATION OF WHAT/HOW THE COMPONENTS WERE AFFECTED.  WHEN I'M IN AN UNKNOWN AREA, I RELY HEAVILY ON GPS IN MY CAR, WHEN IT CUTS OUT, I HAVE NO CHOICE BUT PULL OVER & WAIT IT OUT, OR HOPE TO GET CELL SERVICE & USE MY PHONE'S GPS, NOT ALWAYS AN OPTION. EACH TIME IT OCCURRED IS UNEXPECTED WITH NO APPARENT REASON. EVERY TIME IS DIFFERENT, UPON STARTING CAR, ALL ELECTRICAL COMPONENTS ARE OUT/UNUSABLE. HAPPENS WHEN CAR IS IN MOTION AT ANY SPEED. NAVIGATION SCREEN/RADIO GOES BLACK, CONTROLS UNRESPONSIVE TO ALL TOUCH/PRESSURE/TURNING/ETC. I BELIEVE IT IS A POSSIBLE LOOSE WIRE CONNECTION OR SOMETHING SIMILAR, CAUSING ALL ELECTRICAL COMPONENTS BEING RENDERED UNRESPONSIVE FOR VARIOUS LENGTHS OF TIME. FROM MOMENT OF ONSET TO THE TIME IT'S OPERATING NORMALLY VARIES FROM 30 MIN, UP TO 1-2 DAYS.  COMPONENTS INCLUDED ARE NAVIGATION/RADIO SCREEN & ALL CONTROLS; ALL STEERING WHEEL CONTROLS; AC/RADIO KNOB CONTROLS; DASH/INSTRUMENT PANEL LIGHTS GO OUT; DRIVER SIDE WINDOW/DOOR CONTROLS BECOME UNRESPONSIVE. DEALERSHIP CLAIMED THEY WERE UNABLE TO INVESTIGATE FURTHER BEING THE DIAGNOSTIC TESTS FAILED TO FIND ANY ISSUES.",
        "vin": "JN8AF5MR8ET"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341633,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHANGE IS NOT WORKING HAVEN'T HAD ANY ACCIDENT CAR IS IN GOOD CONDITION AND HAVE SERVICE",
        "vin": "JN8AF5MR9ET"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11279884,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RAN A STOP SIGN AND I BROAD SIDED HER AT 30 MILES AN HOU IN MY 2014 NISSAN JUKE. SHE WAS GOING 30MILES AN HOUR TOO TOO. THE FRONT AIRBAG DID NOT DEPLOY. NISSAN INSPECTED THE CAR AND SAID THAT EVERYTHING WORKED FINE. I HAVE A CRACKED STERNUM AND TWO BADLY BRUISE KNEES. I WANT YOU TO INVESTIGATE THIS CRASH AS MY DAUGHTER IS DRIVING A 2012 NISSAN JUKE AND IT MAY HAVE THE SAME FAULTY AIRBAG,",
        "vin": "JN8AF5MV7ET"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279452,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SWITCH STOPPED WORKING WHEN PRESSED EACH TIME BUT WAS STILL CONNECTED. CAR COULD NOT BE STARTED WHEN BRAKE LIGHTS DO NOT COME ON. AFTER CONFIRMING NO ISSUE WITH THE BRAKE. THE CAR STARTED STALLING PERIODICALLY WHILE DRIVING CAUSING A SAFETY ISSUE. APPEARS TO BE RELATED TO THE START STOP SWITCH SAFETY CAMPAIGN.",
        "vin": "JN8AF5MV0ET"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2019",
        "dateOfIncident": "01/09/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269577,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL ISSUES BEGAN WITHIN MONTHS AFTER PURCHASING   (DEC 2014).  NAVIGATION SYSTEM, RADIO, INTERIOR LIGHTS ALL GO HAYWIRE UNEXPECTEDLY.  RADIO//NAVIGATION COMPLETELY BLACK; INTERIOR LIGHTS EITHER STAY ON, FLICKER OR WON'T COME ON AT ALL.  AFTER TAKING IT BACK TO THE DEALERSHIP & HAVING THEM TEST IT, THEY ALWAYS CLAIMED THEIR COMPUTERS DIDN'T CATCH ANY ISSUES.  I REQUESTED THAT MY COMPLAINTS BE MARKED DOWN & SENT IN TO MANUFACTURER EVERY TIME.  THAT BEGAN HAPPENING BEFORE 20,000 MILES AND CONTINUES TODAY (115,000 MILES). THE CAR HAS NEVER THROWN ANY CODES & NEVER HAD ANY CHECK ENGINE LIGHTS, OR ANY SUCH MECHANICAL ISSUE LIGHT NOTIFICATIONS COME UP ON DASH.  THE CAR BEGAN LOSING POWER AROUND 75,000 MILES (OIL CHANGES, MAINTENANCE DONE ON TIME)'WHEN ACCELERATING THE CAR WOULD SKIP, JUMP OR ALMOST STALL WHENEVER TRYING TO PULL OUT IN TRAFFIC.  CHANGED SPARK PLUGS AT RECOMMENDED MILEAGE (100,000), NO CHANGE. ONE DAY AFTER DRIVING TO THE GAS STATION WHICH IS 4.2 MILES FROM MY HOME & BACK HOME, WHEN MILEAGE WAS AROUND 100,000 (CONVENIENTLY IMMEDIATELY AFTER WARRANTY EXPIRES) MY CARS A/C QUIT WORKING, AND THE CAR RAN INCREDIBLY HOT (WITH ABSOLUTELY NO INDICATION OF ANY ISSUES).  I NOTICED MY FEET WERE BURNING UNDER THE DRIVER SIDE DASH (WHILE DRIVING).  PULLED OVER, POPPED HOOD-IMMEDIATELY SAW COOLANT RESERVOIR (PLASTIC RESERVOIR)  WAS EMPTY, CHECKED OIL DIPSTICK AND NOTHING'NO OIL. 3 DAYS PRIOR TO THIS SITUATION I CHECKED FLUIDS (IN SOUTH GEORGIA DURING THE BE SUMMER IT'S INCREDIBLY HOT & I WAS TAUGHT TO KEEP AN EYE ON OIL/FLUIDS DURING EXTREMELY HOT WEATHER.  I HAD AN OIL CHANGE ROUGHLY A MONTH PRIOR TO THIS SITUATION AS WELL.  AFTER THIS OVERHEATING PROBLEM WAS RESOLVED, MY A/C NO LONGER COOLED.  RECHARGING DID NOTHING'DUE TO THE PERFECT TIMING OF THE WARRANTY EXPIRING THAT LEFT ME WITH NO ALTERNATIVE OTHER THAN ACCEPT MY FATE & THE UNBEARABLE GEORGIA HEAT.",
        "vin": "JN8AF5MR8ET"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267081,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO HAS COME APART, WITH NO WARNING!  CAR WAS IN EXCELLENT CONDITION BEFORE THIS HAPPENED. THIS SHOULDN'T HAVE HAPPENED AND A VERY EXPENSIVE PROBLEM AT THAT!. I'M TAKING A LOAN FOR THE REPAIR SINCE I NEED MY CAR. EVERY NISSAN I'VE PURCHASED BEFORE HAS BEEN VERY DEPENDABLE. I WAS TOLD THIS A BIG PROBLEM WITH THE JUKE AND NEED TO BE RECALLED.  PLEASE CONSIDER THE RECALL ON THE JUKE TURBO, I LOVE THIS CAR BUT CAN'T AFFORD ANYTHING ELSE TO HAPPEN.  MY CAR HAS BEEN SITTING IN MY DRIVEWAY FOR 2 MONTHS, SO I COULD COME UP WITH THE MONEY. MY HUSBAND DIE IN JANUARY 2019 AND MONEY IS VERY LIMITED.",
        "vin": "JN8AF5MV9ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258577,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A LOT. I NOTICED THAT WHEN DRIVING ON HOT DAYS 80+ ON LONG DRIVES 1 HOUR+ ON THE INTERSTATE, MY CARS POWER AND RPMS BASICALLY SHUT DOWN. THIS HAPPENED MULTIPLE TIMES STARTING AROUND 50K MILES. THE TRANSMISSION OVERHEATED AND PUT THE CAR INTO A SAFETY MODE. THE TRANSMISSION OVERHEATED DUE TO A MANUFACTURING ISSUE. THAT WOULD BE, NISSAN FAILING TO PROPER EQUIP THE COOLANT SYSTEM ON THE TRANSMISSION. THIS FAILURE IN SAFELY MANUFACTURING THE TRANSMISSION TO RUN PROPERLY HAS REQUIRED ON MULTIPLE OCCASIONS FOR ME TO PULL OVER ON THE INTERSTATE, TURN MY CAR OFF, AND WAIT 20 MINUTES OR MORE FOR THE TRANSMISSION TO COOL DOWN. THIS ONLY HAPPENS ON LONG DRIVES ON HOT DAYS WHERE MY PERSONAL SAFETY IS HIGHER RISKED.",
        "vin": "JN8DF5MV3ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255547,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPPING WHILE DRIVING ON ANY ROAD AS GOES UP HILL",
        "vin": "JN8AF5MR3ET"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244538,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY JUKE INTO NISSAN FOR AN OIL CHANGE. AFTER GETTING THE VEHICLE BACK THAT NIGHT I BEGAN HAVING ISSUES STARTING THE CAR. INITIALLY I THOUGHT THE KEY NEEDED TO BE REPROGRAMMED. I SPENT THE MONEY BOUGHT A SECOND KEY AND THE THERE PROBLEM STILL EXIST. THE START/STOP ENGINE BUTTON ON THE CAR ONLY STARTS THE CAR AFTER MULTIPLE TRIES. THERE IS OBVIOUSLY AN ISSUE WITH THE START/STOP BUTTON. THIS HAS BEEN A CONTINUAL PROBLEM AND HAS LEFT ME STRANDED BECAUSE THE CAR WILL NOT START BACK UP. THE BATTERY IS BRAND NEW, I HAVE A BRAND NEW KEY, AND THE BREAK PEDAL CENSOR IS GOOD.",
        "vin": "JN8AF5MV7ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234603,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANMISSION SLOW TO TAKE OFF  SAFETY ISSUE WHEN TURNING IN TRAFFIC. ALSO FAILS COMPLETELY QUITE OFTEN",
        "vin": "JN8AF5MVXET"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228275,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN JUKE. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE FAILED TO ACCELERATE WITHOUT WARNING AND SHUT OFF. THE VEHICLE WAS ABLE TO RESTART AFTER THE ENGINE COOLED DOWN. THE VEHICLE WAS TAKEN TO LIA NISSAN OF SARATOGA (2906 U.S. 9, MALTA, NY 12020, (518) 633-11330), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 65,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204522,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS JUST OVER 25000 MILES. WHEN TURNING AT LOW SPEEDS AND A COUPLE TIMES WHILE DRIVING STRAIGHT AT LOW SPEEDS THERE IS A CLUNKING/CLICKING NOISE. IT SEEMS TO DO IT MOSTLY WHILE BRAKING. I'M THINKING EITHER THE TIE ROD ENDS OR MAYBE CV AXLE. I DON'T THINK A VEHICLE WITH LESS THAN 75,000 MILES SHOULD HAVE FAILING SUSPENSION PARTS.     THE NAVIGATION SYSTEM/RADIO SCREEN HAS GONE BLACK A COUPLE TIMES WITH NO COMMUNICATION FROM ANY BUTTONS. I COULDN'T TURN IT ON OR OFF, OR OPERATE ANY RADIO STATIONS. I DISCONNECTED THE BATTERY TERMINALS FOR A COUPLE MINUTES AND THAT SEEMED TO FIX THE PROBLEM FOR NOW. ALSO, THE STEERING WHEEL BUTTONS TO CHANGE THE STATION/VOLUME SEEM TO WORK ONLY WHEN THEY WANT TO. AND THE VOLUME WILL SOMETIMES ERRATICALLY TURN EXTREMELY LOUD OR LOW WITH THE SLIGHTEST TURN OR THE KNOB/ONE OR TWO PUSHES OF THE BUTTON ON THE STEERING WHEEL.     WHEN PARKED/AT LOW SPEEDS, OPERATING THE WINDOWS WILL CAUSE A DROP IN RPMS. THE AUTO UP FOR THE DRIVER WINDOW NO LONGER WORKS, WHILE THE AUTO DOWN STILL DOES.     THE CAR IS A MANUAL TRANSMISSION NISMO. IT HAS LOW MILES FOR THE AGE OF THE VEHICLE. I SHOULDN'T BE HAVING ELECTRICAL AND SUSPENSION ISSUES AT THE MILEAGE/AGE OF THE VEHICLE. I'VE READ THAT MULTIPLE PEOPLE ARE HAVING THE SAME PROBLEM WITH THE NAV SCREEN. ALSO, I'VE READ MULTIPLE PEOPLE HAVING PROBLEMS WITH THE WINDOWS CAUSING RPM TO DROP. I HAVEN'T LOOKED INTO THE CLUNKING NOISE MUCH YET, BUT I'M SURE THERE ARE PEOPLE EXPERIENCING THE SAME ISSUE AS I AM. THIS IS UNACCEPTABLE. I TRUST NISSANS BRAND AND KNOW THEY ARE EXCELLENT CARS THAT CAN BE DRIVEN FOR MANY YEARS AND MILES.     IF YOU COULD PLEASE LOOK INTO THESE ISSUES AND FIND A SOLUTION IT WOULD MAKE MANY PEOPLE WITH THIS MAKE AND MODEL BE MORE COMFORTABLE IN THEIR CARS AND HAVE FAITH THAT THEY AREN'T GOING TO BREAK DOWN/ HAVE TO DUMP LOADS OF UNNECESSARY MONEY INTO IT.",
        "vin": "JN8AF5MR4ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203883,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN ARIZONA; IT IS END OF APRIL AND YESTERDAY TEMPERATURES WERE 99-100 DEGREES.  COMING BACK FROM PHOENIX ON HIGHWAY GOING 75MPH, RPM WAS AT 4000; ENGINE REVVING HIGH AND WOULD NOT COME DOWN- VERY LOUD AND NOISY. UPON GOING UP HILL, CAR STARTED TO AUTOMATICALLY SLOW DOWN ON ITS OWN, FIRST TO 40 MPH, THEN TO 25MPH. AT THIS POINT I PULLED OVER TO THE SHOULDER AS MY CAR CONTINUED TO SLOW TO 20 MPH.  ALL OF THIS WHILE MY FOOT WAS PRESSED COMPLETELY TO THE FLOOR OF THE GAS PEDAL!  ABSOLUTELY NO POWER! SAT ON THE SIDE OF THE ROAD FOR A FEW MINUTES BUT KEPT ENGINE RUNNING.  ONCE I STARTED ON THE ROAD AGAIN, TRANY SEEMED TO \"KICK IN\" AND I WAS ABLE TO GO 40 MPH IN A MATTER OF MINUTES WITH REGULAR RPM AND NO NOISE. I STOPPED AT THE GAS STATION 3 MILES AHEAD AND LET THE VEHICLE REST FOR ABOUT 10 MINUTES. THIS IS THE 2ND TIME THIS HAS HAPPENED.  THE FIRST TIME WAS 7 MONTHS PRIOR IN THE HOTTER MONTH OF SEPTEMBER IN ARIZONA WHERE TEMPERATURES REACH WELL INTO 110.  SAME SCENERIO OF TRAVELING LONG DISTANCE- 75-80 MILES, PUSHING THE VEHICLE TO 75MPH ON FREEWAY, GAS PEDAL ALL THE WAY TO THE FLOOR AND LOSING POWER.  THE FIRST TIME THIS HAPPENED WAS FRIGHTENING BECAUSE I WAS ON BUSY FREEWAY, LOTS OF TRAFFIC, AND SUDDENLY NO POWER WITH VEHICLE DECELERATING TO 60, THEN 50MPH WITH KIDS IN THE CAR. PROBLEM RESOLVED WHEN I GOT OFF FREEWAY AND LET THE CAR REST. BOTH TIMES THERE WAS NO ENGINE LIGHT.  YESTERDAY WHEN I CALLED THE DEALERSHIP, THEY WERE NOT FAMILIAR WITH THIS PROBLEM. WHEN I CAME HOME I GOOGLED MY SCENERIO AND DISCOVERED THIS IS A VERY COMMON PROBLEM AMONG NISSAN OWNERS WITH CVT TRANSMISSION. WHY IS THERE NOT A RECALL OR BULLETIN ON THIS WITH A FIX??",
        "vin": "JN8AF5MR7ET"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179808,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN JUKE. WHILE DRIVING  APPROXIMATELY 15 MPH, A STRONG ODOR OF FUEL WAS PRESENT INSIDE THE VEHICLE. THE CONTACT ALSO NOTICED A PUDDLE OF FUEL UNDER THE VEHICLE WHEN IT WAS FIRST STARTED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DETERMINED THAT THE FUEL PRESSURE SENSOR FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS ALSO TAKEN TO SORG NISSAN (2845 N DETROIT ST, WARSAW, IN 46582) WHERE IT WAS DIAGNOSED THAT THE FUEL PRESSURE SENSOR FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V683000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 34443511. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 97,000.",
        "vin": "JN8AF5MV6ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN JUKE. THE CONTACT STATED THAT THERE WAS A STRONG ODOR OF FUEL IN THE VEHICLE AND ALL THE INSTRUMENT PANEL INDICATORS ILLUMINATED. THE CONTACT MENTIONED THAT THE SMELL WAS INTERFERING WITH HER PERSONAL HEALTH. THE VEHICLE WAS TAKEN TO GASTONIA NISSAN (2275 E FRANKLIN BLVD, GASTONIA, NC 28054, (855) 274-8641) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED AND THAT A FAILURE WAS NOT DETECTED WITHIN THE FUEL LINE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 107,000.",
        "vin": "JN8AF5MR1ET"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/12/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS DOOR WON'T OPEN AND IT'S NOT BECAUSE OF ICE.",
        "vin": "JN8DF5MV9ET"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149873,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S STEERING WHEEL MOUNTED AIRBAG DEPLOYED WITH NO IMPACT OR ACCIDENT.  NO PRIOR ACCIDENT OR REPAIRS TO MY VEHICLE. NO NOISES OR VIBRATIONS OCCURRED IN MY VEHICLE PRIOR TO OR ON THE DAY OF THE ACCIDENT. I DID NOT HEAR OR SEE ANY FAULT CODE REGARDING THE VEHICLE'S AIRBAG SYSTEM WHILE I WAS DRIVING.",
        "vin": "JN8AF5MR0ET"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142181,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED A STRONG FUEL ODOR WHEN I FIRST START THE CAR FOR THE PAST FEW WEEKS.  EVIDENTLY IT IS A LEAKING FUEL PRESSURE SENSOR.   IT APPEARS THERE IS ALREADY A RECALL ON THIS PROBLEM (UNDER NHTSA CAMPAIGN ID:14V683000), BUT MY SPECIFIC VIN IS NOT INCLUDED.  I HAVE JUST OVER 60K MILES.",
        "vin": "JN8AF5MV7ET"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "07/21/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11111046,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JUKE HAS BEEN DECECLERATING WHILE IN HIGHWAY DOING 75MPH AND HAS BEEN JUMPING GEARS WHICH ALL HAD BEEN A PROBLEM SINCE PURCHASING THE CAR AND WAS NOT FOUND UNTIL TODAY THAT THE ENTIRE VALVE BODY CONTROL IN THE TRANSMISSION WHICH CONTROLS CVT NEEDS TO BE REPLACED. THIS IS A SAFETY ISSUE THAT SHOULD HAVE BEEN RECALLED AS MY CAR IS 4 YEARS OLD AND SHOULD NOT HAVE THIS PROBLEM WITH LESS THEN 130000 MILES. I HAD EXTENDED WARRANTY UNTIL 120000 AND CONTINUOUSLY REPORTED THIS TO DEALERSHIP DURING EACH SERVICE WHICH THEY NEVER COULD DIAGNOSE AND FOUND TODAY TELLING ME THE COST TO FIX IT AND REPLACE AND RESOLVE THESE ISSUES IS OVER $1800. MY JUKE HAS HAD SEVERAL PROBLEMS ON TOP OF THESE ISSUES ALL TO DO WITH SAFETY OVER THE YEARS AND SEVERAL SIMILAR COMPLAINTS HAVE BEEN REPORTED AND NOT RECALLED BY NISSAN WHICH IS UNACCEPTABLE, UNSAFE, AND A LEGAL ISSUE WHICH I WILL POSSIBLY BE PURSUING DUE TO THE SEVERAL ACCIDENTS I HAVE ALSO EXPERIENCED THROUGHOUT THE YEARS WHICH THESE PROBLEMS WERE ALSO PRESENT AND NOT RESOLVED DUE TO NO SAFETY RECALLS BEING ON FILE WITH NISSAN. MY CAR HAS ALSO SHUT OFF TWICE WHILE IN TRAFFIC AND STOPPED ACCELERATING ON HIGHWAY SEVERAL TIMES ALMOST CAUSING ACCIDENTS. OTHER OWNERS HAVE REPORTED THESE SAME ISSUES AND NO RECALLS HAVE BEEN DONE ALTHOUGH THE JUKE ALSO STOPPED BEING MADE IN 2015 RIGHT AFTER I PURCHASED MINE BRAND NEW. I HAVE KEPT UP ON ALL ROUTINE MAINTENANCE THROUGHOUT THE YEARS AND FEES THAT THESE ISSUES ARE UNACCEPTABLE, UNSAFE, AND ALL WHICH I WILL BE REPORTING TO BETTER BUSINESS HERESY, NISSAN, AND EXPLORING LEGAL CASE IF NISSAN DOES NOT LOOK INTO RECALLING THESE SEVERAL SAFETY HAZARDS ON THE 2014-2015 JUKES, INCLUDING MY JUKE. I WANT A RESOLUTION AND NOT TO HAVE TO PAY FOR THESE SAFETY CONCERNS THAT SHOULD HAVE BEEN RECALLED AND RESOLVED AND STILL HAVE NOT BEEN TO THIS DATE OF TODAY WHERE ISSUE WAS IDENTIFIED, SEE ATTACHMENT.",
        "vin": "JN8AF5MV2ET"
    },
    {
        "components": "SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11094139,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEAT LATCH RELEASE ONLY WON'T FULLY RELEASE SEAT COULD BE A SAFETY PROBLEM IF WAS IN A WRECK AND THERE WAS A RECALL ON THE 2012 BUT MINE IS A 2014 WITH SAME ISSUE NISSAN WON'T DO NOTHING TO TAKE CARE OF THIS FACTORY ISSUE VERY UN SAFE MOVING DOWN THE ROAD",
        "vin": "JN8AFR2ET35"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082443,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A FUEL LEAK IN THE ENGINE. THE HIGH PRESSURE  FUEL PRESSURE SENSOR IS LEAKING FUEL ALL DOWN THE ENGINE, AND THE CAR HAS A STRONG GASOLINE SMELL.  THE SMELL IS PRESENT WHILE THE CAR IS STATIONARY AND IN GEAR.",
        "vin": "JN8AF5MR2ET"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "03/11/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078781,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'M AT A STOPLIGHT MY CAR FEELS LIKE IT'S GOING TO STALL OUT MY RPMS ARE BOUNCING BETWEEN 500 AND 800. I WAS AT THE CARWASH ONE DAY AND AS YOU KNOW YOU HAVE TO PUT YOUR CAR IN NEUTRAL WHEN THE CAR WASH IS IN PROCESS. WHEN I WENT TO GO SHIFT INTO DRIVE PUTTING MY FOOT ON THE BRAKE IT FELT LIKE IT WAS GOING TO STALL OUT. ALSO WHEN IT'S JUST WARMING UP IN THE GARAGE MY RPMS BOUNCE BACK AND FORTH BETWEEN 500 AND 800 RPMS. AND WHEN I GO ROLL UP MY WINDOWS I GET A REALLY BAD ELECTRICAL SHORTAGE LIKE IT'S GOING TO DIE OUT I TOOK IT TO THE DEALER AND THEY SAID THEY CAN'T FIND ANYTHING WRONG WITH IT OR THEY DON'T KNOW WHY MY RPMS ARE BOUNCING UP AND DOWN LIKE THAT THEY RESET MY IDLE CONTROL SYSTEM AND NOTHING HAS CHANGED I CHANGED OUT THE BATTERY PUT A BRAND NEW BATTERY IN IT HOPING IT WOULD CHANGE THE PROBLEM AND NOTHING HAPPENED. WHEN DRIVING SOMETIMES WHEN MAKING A LEFT OR RIGHT HAND TURN AFTER MAKING A STOP AND I GO TO ACCELERATE. IT FEELS LIKE IT'S GOING TO STALL OUT IN THE MIDDLE OF THE TURN.",
        "vin": "JN8AF5MVXET"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060955,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ONLY 5000 MILES, MY NISSAN NISMO JUKE'S CLUTCH AND FLYWHEEL BURNED OUT.  COST ME $2500 TO GET REPAIRED.  THEY SAID THEY COULD NOT FIND ANY DEFECTS, BUT I HAVE HEARD SEVERAL OTHER OWNERS COMPLAINING ABOUT THE SAME THING.  HOW DOES ANYONE BURN THROUGH A CLUTCH IN 5000 MILES.  IT'S CRAZY.   THAT'S MY COMPLAINT.  I HAVE DOCUMENTATION OF WORK DONE ON THE CAR TO FIX PROBLEM IF NEEDED.",
        "vin": "JN8AF5MR0ET"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "12/23/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058091,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN LEAKING FUEL AND HAD A STRONG FUEL ODOR FOR A COUPLE OF WEEKS.   I GIT IT TOWED TO A NISSAN DEALER AND THEY ARE TELLING ME IT NEEDS A FUEL PRESSURE SENSOR AND THE FUEL BOLT WON'T TIGHTEN.   THEY HAVE ALREADY HAD A RECALL ON THIS PARTICULAR PROBLEM BUT THEY'RE SAYING MY VIN NUMBER IS NOT INCLUDED IN THE RECALL AND I DON'T THINK I SHOULD HAVE TO PAY FOR IT THE CAR IS ONLY 4 YEARS OLD AND IT ONLY HAS 69000 MILES ON IT.",
        "vin": "JN8AF5MV8ET"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035819,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAKING OUT OF FUEL PRESSURE CENSOR. COULD EASILY CAUSE A FIRE",
        "vin": "JN8AF5MV3ET"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035959,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 NISSAN JUKE IS GETTING A LEAKING FUEL PRESSURE CENSOR REPLACED, BUT I THINK IT SHOULD BE COVERED UNDER NHTSA CAMPAIGN ID:14V683000. IT IS OBVIOUS THAT NISSAN IS HAVING PROBLEMS WITH PART OR DESIGN. THERE IS DEFINITELY A FIRE HAZARD.",
        "vin": "JN8AF5MV3ET"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "10/07/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032710,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN JUKE. WHLE DRIVING 5 MPH, THE VEHICLE STALLED WITHOUT WARNING. UPON MAKING A LEFT TURN, THE CONTACT HEARD A LOUD CLUNKING NOISE COMING FROM THE VEHICLE PRIOR TO THE VEHICLE STALLING. THE VEHICLE WAS TOWED TO EDDIE TOURELLE'S NORTHPARK NISSAN IN COVINGTON, LOUISIANA WHERE IT WAS DETERMINED THAT THE BEARINGS AND ALTERNATOR SEIZED. THE ALTERNATOR AND THE BEARINGS WERE REPLACED ON THE VEHICLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 40,100.",
        "vin": "JN8AF5MR3ET"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015789,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ENGINE HAS DIED TWICE WHILE DRIVING DOWN THE ROAD. HAD TO PUT IN PARK AND START AGAIN. THE TEMPERATURE OUTSIDE WAS OVER 100*.",
        "vin": "NISSAN JUKE"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005568,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NISSAN JUKE 2014 AWD VAPOR LOCKED IN HOT WEATHER.  THE DEALER WAS AWARE OF THE PROBLEM AND TOLD ME TO USE 91 OR HIGHER OCTANE GAS AND NOT TO FILL THE TANK WHEN REFUELING.  THEY ALSO REPROGRAMMED THE CAR.  THOUGH THE DEALER TOOK GREAT CARE OF ME THE EXPLANATION SEEMED STRANGE.  THE CAR WAS SIMPLY TURNING OFF WHEN IDLING.  IT HASN'T HAPPENED SINCE, BUT I AM NOW MORE FEARFUL DRIVING IT.",
        "vin": "JN8AF5MV3ET"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000213,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN JUKE OWNERS ARE REPORTING OVER THE INTERNET THAT THE CAR SUFFERS FROM A DEFECTIVE ALTERNATOR OR BATTERY THAT CAUSES THE CAR TO LOSE POWER DURING NORMAL DRIVING IN HOT WEATHER. TEMPS ARE IN THE 100S IN CA RIGHT NOW 06/20/17. I PURCHASED MY JUKE A WEEKS AGO. IT DROVE FINE WHEN I DID THE INITIAL 3 TEST DRIVES BEFORE BUYING IT. IT WAS NOT UNTIL I ACTUALLY DROVE THE CAR SOME RESPECTABLE MILES THAT I NOTICED THAT THIS CAR HAS A SAFETY ISSUE THAT IS TRIGGERED WHEN ANY OF THE FOLLOWING CONDITIONS ARE MET:  #1. DRIVING IN HOT TEMPS ON THE FWY IN STOP AND GO TRAFFIC IF THE OPERATOR ROLLS THE WINDOW DOWN WHILE DRIVING THE CAR WILL REACT BY SHUTTERING WHEN THE WINDOWS ARE ROLLED DOWN OR IF YOU HOLD DOWN THE BUTTON. ONCE THIS IS TRIGGERED THE CAR MOVES AT A SNAILS PACE FOR THE REST OF THE TIME.    #2 IF YOU TURN YOUR AC ON IN AUTO MODE IN HOT WEATHER ~100 C OR MORE FOR LONGER THAN AN HOUR WHILE DRIVING IN HOT WEATHER AND STOP AND GO TRAFFIC THE CAR WILL SUDDENLY LOSE POWER IN AN UN-SAFE MANNER THAT COULD CAUSE A TRAFFIC ACCIDENT. IT IS NOT UNTIL YOU TURN OFF THE AC THAT THE CAR WILL SLOWLY START TO GAIN POWER PACK AFTER THE ISSUE IS TRIGGERED.     BOTH OF THESE ISSUES ARE COMMON AMONGST JUKE OWNERS. I HAVE EXPERIENCED BOTH ON MORE THAN ONE OCCASION AND TO BE HONEST NISSAN SHOULD HAVE DONE THEIR DUE DILIGENCE BY RECALLING THE NISSAN JUKE. IT APPEARS FROM WHAT I HAVE READ AND TO THE PEOPLE FROM NISSAN THAT I SPOKE WITH THE JUKE WAS SPECCED WITH THE WEAK BATTERY AND WEAK ALTERNATOR THAT ARE BOTH AFFECTED BY HEAT SOAK WHICH TRIGGERS THE CAR TO GO INTO SAFE MODE TO PROTECT THE ENGINE FROM DAMAGE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990770,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE STOPPED. IT MADE A RIDDLE NOISE WHEN STARTED. OIL LEAKS BETWEEN THE ENGINE SEAL IS LEAKING. 2014 NISSAN JUKE WITH 83000 MILES IT'S NOT FAIR TO BURN MY MONEY LIKE THAT.",
        "vin": "JN8AF5MR9ET"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990690,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAK AT 83,000 MILES.",
        "vin": "JN8AF5MR9ET"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "04/22/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980349,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2014 NISSAN JUKE IT WENT FROM 70 TO 20 ON THE INTERSTATE AND I WAS ALMOST RAN OVER BY LARGE TRUCKS THAT WERE UNABLE TO STOP. THIS HAS HAPPENED MULTIPLE TIMES. WHILE DRIVING TO WORK THIS TIME, IT DROPPED IN SPEED AGAIN AND THE RPMS WENT OVER 6 BUT THE CAR WOULD NOT MOVE. I PUSH THE GAS TO THE FLOOR AND NOTHING HAPPENS. I AM AFRAID TO DRIVE MY CAR HOME FROM WORK DUE TO IMPENDING DEATH CONCERNS.",
        "vin": "JN8AFSMV4ET"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "04/09/1965",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10937136,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A HARD ON COLLISION TO THE BACK OF ANOTHER CAR TRAVELING AT WELL OVER 25MPH. MY BODY HIT THE STEERING WHEEL SO HARD THAT MY STERNUM WAS CRACKED D OWN THE MIDDLE.     NONE OF THE AIRBAGS DEPLOYED. THEY SHOULD HAVE. IF NOT FOR THE SEAT BELT I WOULD BE DEAD.",
        "vin": "JN8AF5MR9ET"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/11/2016",
        "dateOfIncident": "04/14/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10864381,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN JUKE. WHILE DRIVING APPROXIMATELY 20 MPH AT NIGHT, THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF THE PRECEDING VEHICLE. NONE OF THE AIR BAGS DEPLOYED AND THERE WAS NO WARNING INDICATORS. A POLICE REPORT WAS NOT FILED. THE CONTACT DROVE THE VEHICLE TO AN AUTO BODY SHOP AND LATER CONTACTED THE INSURANCE COMPANY. THE CONTACT SUSTAINED INJURIES THAT LATER SURFACED, WHICH REQUIRED MEDICAL ATTENTION. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 19,500.",
        "vin": "JN8AF5MR9ET"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863166,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG WILL TURN OFF WHEN CAR IS IN MOTION OR STATIONARY AND HAS PERSON OF REASONABLE WEIGHT IN IT. I WEIGH 115 POUNDS AND MY HUSBAND WEIGHS 200 POUNDS, THE AIRBAG LIGHT SAYS IT IS OFF WHEN EITHER ONE OF US ARE IN THE SEAT AT RANDOM TIMES. THE DEALERSHIP SERVICE DEPARTMENT SAID I JUST DID NOT WEIGH ENOUGH AT 115 POUNDS FOR THE SENSOR TO WORK APPROPRIATELY.",
        "vin": "JN8AF5MV1ET"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/03/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730316,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GAUGE CLUSTER NOT DISPLAYING THE FLASHING ARROWS WHEN THE TURN SIGNAL STALK IS ENGAGED TO EITHER SIDE BUT THE LIGHTS OUTSIDE THE CAR IS STILL OPERATIONAL.  ALSO, THE POWER LOCKS WILL DISENGAGED INTERMITTENTLY WHILE THE VEHICLE IS IN MOTION, ON ANY SPEED.   UPDATED 09/08/15*LJ     UPDATED 10/27/2017*CN",
        "vin": "JN8AF5MV2ET"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702617,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: I1530379A. NISSAN JUKE. CONSUMER STATED THE FRONT PASSENGER AIRBAG LIGHTS UP INDICATING AIRBAG IS OFF EVEN WHEN SOMEONE IS IN THE SEAT. *LN  THE CONSUMER WAS ADVISED TO HAVE THE PASSENGER SIT IN THE BACK SEAT. *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680832,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN JUKE. WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE IDLED AT A HIGH RATE BETWEEN GEARS ONE AND TWO. THE VEHICLE WAS TAKEN TO DEALER, WHO STATED THAT THE VEHICLE WAS WORKING UP TO SPECIFICATIONS. IN ADDITION, AFTER REFUELING THE VEHICLE, A STRONG FUEL ODOR EMITTED INSIDE THE VEHICLE. THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V683000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 20.",
        "vin": "JN8AF5MR9ET"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "11/20/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660233,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "JUKE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR HAD BEEN SITTING IN OUR DRIVEWAY FOR 4 DAYS WHILE WE WERE AWAY ON VACATION. THE MORNING AFTER WE RETURNED WE NOTICED THAT THE SKYLIGHT WAS RAISED AND CRACKED. UPON TOUCHING THE SURFACE OF THE GLASS THE ENTIRE WINDOW IMPLODED INTO VERY SMALL AND UNIFORM PIECES OF GLASS. THE WEATHER WAS COLD (IN THE 20S) DURING THE WEEK, BUT THERE HAD NOT BEEN ANY IMPACT DAMAGE. NO FALLEN BRANCHES OR FLYING ROCKS. THE CAR WAS PARKED IN OUR DRIVEWAY, APPROX 90 FEET FROM THE ROAD.   *TR",
        "vin": "JN8AF5MV7DT"
    }
]