[
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456836,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The power steering has intermittently been de-activating.  There is a warning light that comes on (yellow triangle with an exclamation mark).  When this happens it causes the steering wheel to feel like it’s pulls in a direction.  After we suddenly lose power steering with no warning we’re left to drive a car with no power steering until it suddenly re-engages.  There has been no rhyme or reason to when this happens.  The issue has been diagnosed at a factory dealership.  The car has not sustained any accident (ever) in the +/- 4 years we’ve owned it",
        "vin": "1N4AZ0CP3EC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450160,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1) start the vehicle 2) exit the vehicle 3) Unplug the vehicle 4) re-start the vehicle 5) put in drive Seat belt chime does not ring.  I found that I can also 1) Start the vehicle 2) Put in drive 3) Put in park 4) exit the vehicle 5) enter the vehicle w/o seatbelt buckled 6) put in drive. No seatbelt chime.",
        "vin": "1N4AZ0CP0EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442276,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake Failure - ABS noise, there is zero brake action. Pedal goes all the way to the floor and nothing happens. Car makes an ABS noise but there is zero brake action.  I reported this to Nissan dealer twice at first, they couldn't find a problem now their saying it maybe the ABS Control Unit. They want to replace the ABS Control Unit at $2,200 but does not guarantee that's the problems. The Nissan dealer states that the car is not safe to drive.  even if I pay them $2,200 to replace the ABS control unit.",
        "vin": "1N4AZ0CP4EC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "04/07/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418938,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My car suddenly accelerated out of my control and my car was totaled in a supermarket parking lot.  Amazingly no serious injuries though two other cars were damaged by this event.  No warnings and no time to act.  I demanded that Nissan do an inspection.  The email I got from them this morning said they found nothing wrong with the vehicle BUT that the accelerator was at 100% at the time of the accident.  I was parked and getting out of my car when this occurred but Nissan did not think it suspicious that my car accelerated to 100% without any reason for me to accelerate and my foot not on the power pedal.  Their letter to me claimed no responsibility for the malfunction. In fact. They are claiming no malfunction at all.  I have requested in writing to get all the data they collected and although they had previously agreed to provide it to me. They are now backpedaling on that now that I’ve posed legitimate questions.  This happened TWICE in a 15 month period and the last accident destroyed my car.  Everyone was eager to blame me for the first accident that did thousands of dollars damage, which I know for a fact I was parked in my own driveway and not even driving.  It was scary and stressful and still is.  The only thing I can feel good about is that the car, my beautiful LEAF, is off the road forever and will not be dangerous any longer to me or anyone else.",
        "vin": "1N4AZ0CP6EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413072,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2014 NISSAN LEAF SL AT A LOW SPEED (5-10 MPH) WHEN THE BRAKES HAD A SUDDEN AND UNANTICIPATED TOTAL BRAKE FAILURE. WHILE PULLING UP TO A STOPLIGHT TO MAKE A RIGHT TURN, I WAS UNABLE TO STOP THE CAR FOR APPROXIMATELY 10 FEET BEYOND WHERE I HAD INTENDED. FORTUNATELY, THERE WERE NO OTHER VEHICLES OR PEDESTRIANS IN MY PATH. THIS EVENT HAPPENED IN DOWNTOWN SALT LAKE CITY.     FROM THE POINT OF FAILURE, I WAS ABLE TO PREDICTABLY STOP THE CAR WITH SOME EXERTION. BUT CLEARLY, A FUNDAMENTAL MAJOR COMPONENT OF THE VEHICLE FAILED. IT WAS NOT PART OF THE BRAKES THEMSELVES, OR THE ROTORS, OR WEAR.      I DROVE THE VEHICLE DIRECTLY TO KEN GARFF NISSAN, WHICH WAS APPROXIMATELY 5 BLOCKS AWAY.  THEY DIAGNOSED THE PROBLEM AND REPORTED THAT IT WAS A FAILURE OF A MAJOR ELECTRICAL COMPONENT THAT PROVIDES BRAKING TO THE BRAKE SYSTEM. I CONTACTED NISSAN ABOUT THE ISSUE, AND REPORTED TO THEM THAT AFTER SEARCHING THE INTERNET I HAD SEEN OTHER REPORTS FROM INDIVIDUALS ABOUT SIMILAR PROBLEMS WITH THEIR NISSAN LEAF BETWEEN THE MODEL YEARS 2013-2015. THERE WERE REPORTS OF THIS PROBLEM AFFECTING MORE THAN 40 VEHICLES.     NISSAN USA EXPLAINED THAT THEY DIDN'T HAVE ANY RECALLS FOR THAT ISSUE, AND THAT I WOULD SIMPLY HAVE TO PAY FOR THE REPAIR. HOWEVER, I FELT THAT THIS EXPERIENCE, BECAUSE IT WAS SO DANGEROUS, AND SO SUDDEN, AND WASN'T A RESULT OF POOR MAINTENANCE OR AN ERROR OF ANY SORT, IT SHOULD BE ESCALATED AND EVALUATED FOR RECALL. NISSAN USA SHOWED NO INTEREST OR INTENTION OF MAKING FURTHER INQUIRY INTO THE PROBLEM, SO I FELT I SHOULD PUSH FOR A RECALL.    MY CASE NUMBER WITH NISSAN USA WAS ORIGINALLY ASSIGNED AS #436-319-65, AND A NEW CASE NUMBER WAS ASSIGNED AS #436-368-82. THE INDIVIDUALS ASSISTING IN THE CASES WERE NAMED PAMELA AND NANCY, RESPECTIVELY.",
        "vin": "1N4AZ0CP5EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397140,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKING SYSTEM IS NOT WORKING. FEW TIMES WHILE DRIVING ON THE ROAD, THE BRAKES STOPPED WORKING AND I HAD TO USE THE EMERGENCY BRAKES. THE BRAKES MALFUNCTION WHILE THE CAR IS IN MOTION. ON A CITY STREETS.*DT*JB*DT*JB*DT  CONSUMER WAS TOLD BY THE DEALER BRAKE CYLINDER SYSTEM NEEDED TO BE REPLACED FOR $3000.00.*JB",
        "vin": "1N4AZ0CPXEC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375218,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER COMING FROM WORK (54 MILE BACK AND FORTH) ON 11/4/2020, PARKED 2014 LEAF SV AT THE DRIVEWAY FOR 40 MINUTES. THEN WENT BACK IN, POWERED THE CAR AND SHIFTED TO REVERSE. THE CAR BACKED-UP FAST BECAUSE THE BRAKE SEEMED NOT WORKING. SO I HAVE TO STEPPED ON THE PEDAL HARDER. I KNOW SOME THING IS WRONG BECAUSE WHEN YOU STEP ON THE BRAKES A NOISE A CAN BE HEARD AT THE FRONT. I CHECKED AND IT SEEMED LIKE ITS ACTUATING SOMETHING BUT NOTHING IS HAPPENING. THE PEDAL IS DEEP. THE DASHBOARD BRAKE LIGHT IS ON AND YELLOW WARNING LIGHT. I TURNED IT OFF AND AFTER 1 HOUR I RECHECKED AND IT GOT BACK TO NORMAL OPERATION.     BUT THIS WAS REPEATED SEVERAL TIMES DURING COLD WEATHER. THIS TIME 11/18/20, IT HAPPENED AGAIN. THE E-DRIVEN INTELLIGENT BRAKING COMM IS THE DTC CODE THAT CAME UP",
        "vin": "1N4AZ0CP2EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/13/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268196,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING THE CAR IN THE PARKING LOT, THE BRAKE PRESSURE DID NOT RELEASE AS USUAL WHEN STARTING THE CAR. WHEN DRIVEN IN THE PARKING LOT AT LOW SPEEDS, THE BRAKE DOES NOT FUNCTION AS IT SHOULD. THERE IS SO MUCH PRESSURE THAT I CAN ONLY PRESS THE PEDAL DOWN A LIMITED AMOUNT TO MAKE THE CAR STOP. AFTER A FEW DAYS OF DRIVING THE CAR LESS THAN 10 MILES TOTAL, THE PROBLEM HAS WORSENED AND THERE IS LESS ROOM TO PRESS THE PEDAL DOWN WHILE BRAKING. I TOOK THE CAR TO GET THE BRAKES INSPECTED AND WAS TOLD THAT EVERYTHING IS FUNCTIONING AS IT SHOULD. I AM WORRIED THE ISSUE WILL WORSEN TO THE POINT THAT THE BRAKES WILL NOT BE ABLE TO BE PRESSED DOWN AT ALL.",
        "vin": "1N4AZ0CP2EC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258643,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STATIONARY, VEHICLE WILL NOT SHIFT INTO PARK, AND WILL ROLL UNLESS PARKING BRAKE IS APPLIED. DEALERSHIP WILL NOT COVER THIS UNDER THEIR POWERTRAIN WARRANTY EVEN THOUGH IT IS PART OF THE POWERTRAIN ACCORDING TO THE NHTSA AND IS A MAJOR SAFETY FLAW. DASH DISPLAYS AN ERROR THAT READS \"T/M SYSTEM MALFUNCTION VISIT DEALER\", AND \"WHEN PARKED APPLY PARKING BRAKE\".",
        "vin": "1N4AZ0CP5EC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240810,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HI, WHEN I PUT THE CAR IN REVERSE YESTERDAY MORNING IT SPED OUT OF THE GARAGE WITH NO THROTTLE AND WAS VERY DIFFICULT TO BRAKE. TURNS OUT THE BRAKE, ABS, WARNING AND TRACTION CONTROL LIGHTS WERE ALL ON. THROTTLE BEHAVIOR IN DRIVE WAS NORMAL BUT WAS ALSO REALLY HARD TO BRAKE. THERE WAS ALSO A WEIRD HUM AT POWER ON.    I POSTED THIS TO THE R/LEAF FORUM ON REDDIT AND EVERYONE SAID REPLACE THE 12V BATTERY WHICH FIXED IT. OTHERS DESCRIBED SIMILAR EXPERIENCES.",
        "vin": "1N4AZ0CP6EC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186701,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR WAS TURNED ON IT WOULD MAKE A LOUD HUMMING NOISE. WHEN YOU PUT THE CAR IN REVERSE IT WOULD ROLL BACK, ONCE YOU TAP ON THE BREAKS TO STOP IT WOULD KEEP ROLLING BACK. ONLY WAY IT WOULD STOP WAS BY SLAMMING ON THE BREAKS. SAME THING WOULD HAPPEN WHEN GOING FORWARD. THE ONLY WAY THE CAR WOULD BE DRIVABLE IS AFTER I LET IT SIT FOR A WHILE AND THEN GO BACK TO TURN IT ON AGAIN.",
        "vin": "1N4AZ0CPXEC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "12/05/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157171,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DISCONNECTING CHARGE PORT, THE VEHICLE START DISPLAYED THE WARNING LIGHT, ABS AND BRAKE LIGHT. MAJOR ELECTRIC PROBLEM. THE VEHICLE WAS STATIONARY, AT THE VEHICLE CHARGE STATION.    THE CONSUMER STATED THE MANUFACTURER CLAIMED TO HAVE COMPLETED THE RECALL, BUT THE FAILURE RECURRED.*JS",
        "vin": "1N4AZ0CP4EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131039,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE VEHICLE FROM HOME TO DESTINATION 15 MILES AWAY WITH NO ISSUES.  STOPPED AND TURNED OFF VEHICLE. AUDIBLE TONE CAME ON WITH EVERYTHING OFF.  STARTED VEHICLE. MULTIPLE WARNING LIGHTS APPEARED.  TURNED OFF VEHICLE.  TURNED BACK ON, BRAKE WARNING APPEARED, CAR IDLED FORWARD AND COULD NOT BRAKE IT TO STOP WITHOUT HARD BRAKING.  TURNED OFF VEHICLE.",
        "vin": "1N4AZ0CP8EC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "02/07/2018",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080704,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 7, 2018, NISSAN LEAF CAUGHT FIRE WHILE CHARGING AT 3003 SUMMIT BLVD PARKING DECK P4, ATLANTA, GA 30068.  AFTER REVIEW, NISSAN CLAIMS THAT THEY \"FOUND NO EVIDENCE OF A PRODUCT PROBLEM, FAILURE, OR MALFUNCTION THAT MAY HAVE CAUSED OR CONTRIBUTED TO THE INCIDENT.\"    VEHICLE WAS STATIONARY AND WAS PLUGGED INTO CHARGER FOR LESS THAN 20 MINUTES BEFORE STARTING TO SMOKE AND CATCH FIRE.  POLICE AND FIRE UNITS WERE DISPATCHED AND THE FIRE WAS PUT OUT.  VEHICLE WAS SUBSEQUENTLY TOWED TO SALVAGE YARD A WEEK LATER.    ROOT CAUSE COULD POSSIBLY BE CHARGING UNIT, HOW CHARGING UNIT WAS INSTALLED/MAINTAINED, OR A VEHICLE DEFECT.  NISSAN'S CLAIMS NO PRODUCT PROBLEM, FAILURE, OR MALFUNCTION THAT MAY HAVE CAUSED THE INCIDENT. *TT  *JS",
        "vin": "1N4AZ0CP8EC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "02/07/2018",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071887,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS READING A RECENT ARTICLE REGARDING A NISSAN LEAF AND A FIRE. WE JUST HAD THE SAME THING HAPPEN AT OUR FACILITY, 3003 SUMMIT BLVD. ATLANTA GA 30319. THE ISSUE IS THAT WE ARE NOT SURE IF IT WAS THE VEHICLE OR THE CHARGING UNIT. THE VEHICLE WAS TOTALED AND A COUPLE OF OTHER CARS NEARBY WERE ALSO DAMAGED. THE VEHICLE WAS STATIONARY AND CONNECTED TO THE CHARGER. THIS WAS LOCATED ON THE 4TH LEVEL OF THE PARKING DECK.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/27/2017",
        "dateOfIncident": "12/26/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056759,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING MY CAR THE BREAKS STARTED TO MAKE SOME NOISES WHEN ACTIVATED . I CHANGE MY ROUTE TO TAKE IT TO THE DEALERSHIP FOR A REVISION AND AS I WAS GETTING THERE THE BRAKES STARTED TO FAIL TO A POINT THAT, BY THE TIME I GOT TO THE DEALERSHIP 9A COUPLE OF MILES AWAY) , IT WAS ALMOST NOT BREAKING AT ALL. MAY THIS HAVE HAPPENED IN DIFFERENT CONDITIONS THE RESULT COULD HAVE BEEN A SERIOUS ACCIDENT",
        "vin": "1N4AZ0CP3EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003810,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING OUT OF THE DRIVEWAY, THE BRAKES FAILED AND I WAS UNABLE TO STOP THE VEHICLE AS IT ROLLED INTO THE STREET. BRAKE PEDAL WENT TO THE FLOOR AND LOUD NOISES WERE HEARD FROM INSIDE THE ENGINE COMPARTMENT. TOWED TO DEALERSHIP, PAID ~$300 TO \"REINITIALIZE AND RECONFIGURE\" THE BRAKE SYSTEM.",
        "vin": "1N4AZ0CP1EC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944366,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 NISSAN LEAF. WHILE OPERATING THE VEHICLE, THE DEFROSTER DID NOT GENERATE AN ADEQUATE AMOUNT OF HEAT TO DEFROST THE WINDSHIELD. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 26,000.",
        "vin": "1N4AZ0CPXEC"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/01/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10928931,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NISSAN LEAF HAS HAD MAJOR ISSUES WITH THE WINDSHIELD WIPER MOTOR.  IF THERE IS ANY AMOUNT OF ACCUMULATED SNOW, EVEN A SMALL AMOUNT, AN AMOUNT ON OTHER CARS I HAVE DRIVEN DOES NOT STOP THE WIPERS OR BREAK THE WIPER'S MOTOR.  IN LESS THAN ONE YEAR MY WIPER'S MOTOR HAS BROKEN THREE TIMES.  THE LAST TIME THE MOTOR BROKE I WAS COMING HOME IN A SNOW STORM.  I COULDN'T SEE BECAUSE THE WIPERS QUIT WORKING.  I TRIED TO SLOWLY PULL OVER BECAUSE I WAS ON A BUSY STREET.  I HIT A PEDESTRIAN BECAUSE I COULD NOT SEE AND WAS AFRAID TO STOP ON A BUSY ROAD.  NISSAN REPAIR SHOP BASICALLY TOLD ME THERE CAN BE NO SNOW ON YOUR WINDSHIELD OR THE WIPERS MOTOR WILL BREAK.  THERE WAS VERY LITTLE ACCUMULATED SNOW ON THE WIND SHIELD. AS I SAID, I HAVE NEVER HAD THIS PROBLEM WITH ANY OTHER CAR.  I FEEL LIKE WINDSHIELD WIPERS SHOULD BE ABLE TO HANDLE AN 1/8 OF AN INCH OF SNOW WITHOUT BREAKING THE MOTOR.  YOU COULD BE DRIVING AND SNOW COULD DROP FROM A TREE ONTO YOUR CAR.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/10/2016",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864296,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE.  PRESSING ON BRAKES WITH NORMAL PRESSURE HAD NO EFFECT.  PRESSING ON PEDAL VERY HARD WOULD STOP THE CAR.  WHEN DOING SO THERE WAS A NOISE THAT I BELIEVE WAS ASSOCIATED WITH THE ABS BRAKING SYSTEM.  THIS COULD HAVE BEEN DISASTROUS IF THERE HAD BEEN A PEDESTRIAN AROUND.      TOOK TO DEALER.  THEY SAID THE BRAKING CONTROLLER HAD FAILED.  THEY REPLACED AND IT APPEARS NORMAL NOW.    THIS VEHICLE HAD THE COLD WEATHER BRAKE CONTROLLER UPDATE APPLIED TO IT APPROXIMATELY A MONTH EARLIER.",
        "vin": "1N4AZ0CPXEC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/15/2016",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849730,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN DID NOT NOTIFY ME OF THIS RECALL OF THE LEAF WHICH WAS EFFECTIVE FEBRUARY 26, 2016. WHEN I CALLED NISSAN REGARDING THEIR LACK OF NOTIFICATION ON THIS ISSUE, THE COMPANY, MOREOVER, DID NOT ACKNOWLEDGE THE RECALL CITING A 'SERVICE NOTICE' HAS BEEN IN EFFECT SINCE OCTOBER 15, 2015 OF WHICH I ALSO DID NOT RECEIVE NOTIFICATION! COULD YOU PLEASE FOLLOW UP ON THIS RECALL WITH NISSAN AND INFORM ME OF THEIR RESPONSE. THANK YOU.    *TR",
        "vin": "1N4AZ0CP5EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/18/2016",
        "dateOfIncident": "01/17/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820864,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF ALL BRAKING POWER DUE TO ABS FAILURE.",
        "vin": "1N4AZ0CP3EC"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/12/2015",
        "dateOfIncident": "05/10/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748028,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHILD LOCKS ISSUE:  MY FAMILY AND I WERE GOING TO A RESTAURANT, AND, UPON ARRIVAL, MY MOTHER WAS UNABLE TO EXIT. I REALIZED THAT THE CHILD LOCK DEVICE LEVER IN OUR 2014 NISSAN LEAF WAS OUT OF THE CHILD-UNLOCKED, OR NORMAL-EGRESS, POSITION. I ALSO REALIZED THAT THIS WAS A SERIOUS SAFETY CONCERN.     I INVESTIGATED THE DOOR CHILD-LOCK MANUAL LEVER ON THE LEAF AND INVENTED A DEVICE TO KEEP THE LEVER POSITION IN THE CHILD-UNLOCKED CONDITION UNTIL WE DESIRED TO REPOSITION IT (WHEN TRAVELING WITH SMALL CHILDREN). I ALSO INVENTED THE ALTERNATE DEVICE, THAT IS, TO MAINTAIN THE CHILD-LOCKED POSITION. THIS DEVICE WAS DESIGNED TO RESTRAIN THE LEVER AND INDICATE THE CHILD-LOCK CONDITION AT A GLANCE; THIS IS WHY THE LEVER KNOB IS VISIBLE WHEN THE OBJECT IS INSTALLED AND COLORS WERE USED TO AFFIRM THE STATUS. FOR OUR NISSAN LEAF, I USED A GREEN RUBBER INSERT FOR THE CHILD-UNLOCKED POSITION, AND A RED RUBBER INSERT FOR THE CHILD-LOCKED POSITION. THIS INVENTION, ALONG WITH SEVERAL VARIATIONS TO ACCOMMODATE DIFFERENT ACTUATORS AND INDICATION PARADIGMS FOR INDICATING STATUS, WAS RECENTLY SUBMITTED TO THE US PATENT OFFICE, AND IS THUS ?US PATENT PENDING.?    I CONTACTED BOTH NISSAN AND TOYOTA AND THEY REPLIED WITH NO INTEREST.    PLEASE CONTACT ME AND I WILL SHARE DETAILS, INCLUDING DRAWINGS AND PHOTOGRAPHS OF MY FIXES.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1N4AZ0CP1EC"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/04/2015",
        "dateOfIncident": "06/05/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723424,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN AIR BAG LIGHT THAT ILLUMINATES WHEN THERE IS WEIGHT ON THE PASSENGER SEAT BUT THE AIR BAG WILL NOT BE DEPLOYED, MAYBE BECAUSE THE VEHICLE THINKS THERE IS A DOG, SMALL CHILD, OR INANIMATE OBJECT SITTING IN THE SEAT.    THE TROUBLE IS THAT THE \"AIR BAG DISABLED LIGHT\" OCCASIONALLY TURNS ON WHEN MY TEENAGE SONS SIT IN THE PASSENGER SEAT. THE DEALER SAYS IT IS BECAUSE MY SONS DO NOT ALWAYS SIT SQUARELY TO THE BACK OF THE SEAT; THAT IS, THEY OCCASIONALLY SLOUCH IN THE SEAT. I HAVE VIDEOS OF THIS BEHAVIOR WHICH I CAN SEND TO YOU, SO YOU CAN DETERMINE IT IS IS SOMETHING YOU WOULD LIKE TO LOOK INTO.    NISSAN'S RESPONSE IS AKIN TO STEVE JOBS SAYING OF THE IPHONE 4, \"YOU'RE HOLDING IT WRONG.\" I THINK NISSAN SHOULD BUILD THEIR SENSORS FOR THE WAY PEOPLE SOMETIMES SIT IN THEIR SEATS, NOT AS THE WAY THEY WOULD LIKE THEM TO SIT UNDER IDEA CIRCUMSTANCES. THEY PROBABLY HAVE ONE SENSOR AT THE BACK OF THE SEAT, WHEN THEY ACTUALLY NEED ANOTHER IN THE MIDDLE AND MAYBE ONE AT THE FRONT TO BETTER JUDGE THE WEIGHT OF THE OBJECT IN THE SEAT.",
        "vin": "1N4AZ0CP2EC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "03/22/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704093,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A GENERAL COMPLAINT ABOUT RECENT-MODEL HEAD RESTS. IT IS NOT LIMITED TO OUR CAR.    I JUST WANT TO SAY THAT I THINK SOMEONE AT THE TRANSPORTATION BOARD IS OVERLY ZEALOUS IN THIS. MOST NEW CARS TODAY HAVE THE HEADRESTS VERY FAR FORWARD. IT SEEMS AS IF THE TRANSPORTATION BOARD WANTS THE HEADREST TO TOUCH THE HEAD. I DO NOT LIKE THIS. MY HEAD IS JOSTLED WHEN THE HEADREST TOUCHES MY IT. I THINK EVEN ONE HALF INCH AWAY IS TOO CLOSE, AS THEN IT TOUCHES MY HAIR.     THE RESULT OF HAVING IT SO FAR FORWARD IS THAT IT PUSHES MY HEAD FORWARD, TOWARDS MY CHIN, AND MY NECK AND BACK HURTS.    AND UNINTENDED CONSEQUENCE, I AM SURE, IS THAT MY WIFE AND I PUSH THE SEATS FORWARD AND THE BACK OF THE SEATS BACKWARDS. THIS HELPS TO KEEP THE HEADREST BACK A LITTLE BIT. BUT, I THEN HAVE TO TILT MY HEAD FORWARD TO KEEP IT VERTICAL, SO IT STILL IS A BIT UNCOMFORTABLE.    I THINK YOU DO NOT REALIZE THAT IF YOU MAKE THINGS TOO UNCOMFORTABLE FOR PEOPLE, THEY WILL FIND WAYS AROUND IT AND NEGATE YOUR SAFETY SYSTEM.    I JUST WANT YOU TO KNOW THIS. AND, I HOPE YOU WILL CORRECT THE ERROR AND PUSH HEADREST BACK IN THE NEAR FUTURE.  *TR",
        "vin": "1N4AZ0CP2EC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/26/2015",
        "dateOfIncident": "11/14/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690845,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER OUTSIDE TEMPERATURES ARE BELOW +/- 38F, THE REGENERATIVE BRAKE SYSTEM BEHAVES VERY AGGRESSIVELY IN THE SENSE THAT THE SLIGHTEST USE OF THE BRAKES RESULTS IN A VERY JERKY BEVAHIOUR OF THE CAR, BRAKING VERY ABRUPTLY AND HARD. USUALLY, A SECOND TAP ON THE BRAKE RESOLVES THE ISSUE TEMPORARILY, BUT THE SYMPTOM COMES BACK SOON AFTER. THIS IS NOT ONLY AN INCONVENIENCE, BUT ALSO POSES POTENTIAL ACCIDENTS IF A CAR BEHIND THE LEAF IS NOT EXPECTING A HARD BRAKING.  CONTACTED THE NISSAN DEALER WITH THE SYMPTOMS, REPLY WAS THAT THIS IS NOT KNOWN TO NISSAN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "02/23/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690262,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 NISSAN LEAF. THE CONTACT STATED THAT WHILE SHIFTING FROM PARK TO DRIVE ON AN INCLINE AND THE BRAKE PEDAL DEPRESSED, THE VEHICLE ROLLED DOWN HILL. THE CONTACT MENTIONED THAT THE BRAKE PEDAL HESITATED TO RESPOND. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,400. THE VIN WAS NOT AVAILABLE.",
        "vin": "1N4AZ0CP8EC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/16/2015",
        "dateOfIncident": "02/13/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683689,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY 90LB DAUGHTER AND 130LB WIFE SITS IN THE PASSENGER SEAT OF OUR MY14 NISSAN LEAF, THERE IS NO CONSISTENCY WITH WHETHER THE AIRBAG WILL BE ON OR OFF. OFTEN, THE AIRBAG IS ON WITH MY DAUGHTER AND OFF WITH MY WIFE. THE DEALER HAS \"RESET\" THE AIRBAG FOUR TIMES AND SAYS \"IT'S WORKING AS EXPECTED\". I'VE SPOKEN WITH NISSAN ELECTRIC CONSUMER AFFAIRS AND THEY SAID THERE'S NOTHING THEY CAN DO AND THEY REFUSED TO LET ME TALK TO THEIR SUPERVISOR.   *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/18/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625998,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER AIR BAG OFF LIGHT COMES ON EVEN WITH A 150LB PASSENGER SITTING IN THE SEAT. THIS HAPPENED MULTIPLE TIMES. DEALER IDENTIFIED IT AS A CODE DTC B00A0-00 STORED IN AIRBAG SYSTEM, WITH OCCUPANT SENSOR HAVING ABNORMAL VOLTAGE.   *TR",
        "vin": "1N4AZ0CP2EC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "06/19/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606550,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO PASSENGERS, ONE IN DRIVER'S SEAT, ONE IN FRONT PASSENGER SEAT WHO WEIGHS APPROXIMATELY 140 LBS. APPLIED BRAKE, PUSHED THE POWER SWITCH TO THE ON POSITION, SHIFTED CAR TO REVERSE. BACKED UP A SHORT DISTANCE, THEN SHIFTED THE CAR TO DRIVE (B MODE). DROVE ABOUT 20 FEET. NOTED THAT THE FRONT PASSENGER AIR BAG STATUS LIGHT INDICATED THAT IT WAS OFF. STOPPED THE CAR. FRONT PASSAGE RELEASED SEATBELT, LIFTED OFF SEAT, RE-FASTENED SEATBELT. FRONT PASSENGER AIR BAG STATUS LIGHT INDICATED THAT IT WAS OFF. CYCLED POWER SWITCH TO OFF, THEN ON. FRONT PASSENGER AIR BAG STATUS LIGHT INDICATED THAT IT WAS OFF. CAR COULD NOT BE PUT INTO DRIVE MODE. CYCLED POWER SWITCH TO OFF, WAITED ABOUT 30 SECONDS, CYCLED POWER SWITCH TO ON. FRONT PASSENGER AIR BAG STATUS LIGHT INDICATED THAT IT WAS ON. CAR WAS PUT INTO DRIVE MODE.  *TR",
        "vin": "1N4AZ0CP8EC"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10593665,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL - THE CONTACT OWNS A 2014 NISSAN LEAF. THE CONTACT STATED WHILE DRIVING 22 MPH HE LOST CONTROL OF THE VEHICLE AS IT VEERED TO THE RIGHT WITHOUT WARNING. THE CONTACT THEN CRASHED INTO A POLE. A POLICE REPORT WAS FILED AND THE CONTACT SUSTAINED A FRACTURED RIGHT KNEE AND HAND, REQUIRING MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 400.    UPDATED 06/19/14  AFTER HE CRASHED INTO THE POLE, THE VEHICLE CAME TO A HALT MAKING ALMOST A 75 DEGREE ANGLE IN THE ROAD. AS THE VEHICLE ABRUPTLY STARTED DRIFTING TOWARDS THE RIGHT SIDE, HE TRIED VERY HARD TO STEER IT BACK TO MAKE IT STRAIGHT, BUT WITH NO SUCCESS. UPDATED 06/26/14",
        "vin": "1N4AZ0CP9EC"
    }
]