[
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "10/29/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11439098,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's company owned a  2014 Ram 5500. The contact stated while driving at 60-65 MPH, he heard an abnormal loud sound coming from the rear of the vehicle. The contact stated the rear wheels detached and flew off, causing the contact to lose control of the vehicle. The stated the vehicle drove off the road, hit a ditch, rolled over three times, and landed on the passenger side. The air bags failed to deploy. There were no warning lights illuminated. The contact sustained bruised ribs, back, and shoulder. The contact was transported to the hospital with the assistance of emergency units. A police report was filed. The vehicle was towed to the contact's company office, where it was totaled. The dealer and the manufacturer were not notified of the failure. The approximate failure mileage was 178,000.",
        "vin": "3C7WRNAL5EG"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390618,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 5500. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, THE BRAKING SYSTEM AND POWER STEERING SUDDENLY MALFUNCTIONED. THE VEHICLE WAS EXAMINED BY AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE ALTERNATOR AND THE TRANSMISSION FLY WHEEL WERE FAULTY. THE ALTERNATOR AND FLY WHEEL WERE REPLACED HOWEVER, THE FAILURE EVENTUALLY RECURRED. NO FURTHER INFORMATION WAS AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE LOCAL DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 210,000.",
        "vin": "3C7WRNDL3EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329724,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 5500. THE CONTACT STATED THAT WHILE DRIVING AT 5 MPH, THE TIE ROD END FRACTURED WITHOUT WARNING. LITHIA CHRYSLER JEEP DODGE RAM OF KLAMATH FALLS (2675 WASHBURN WAY, KLAMATH FALLS, OR 97603, (541) 205-4486) WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE PART TO REPAIR THE VEHICLE WAS ON BACK ORDER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 109,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "11/17/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286715,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 5500. WHILE TRAVELING VARIOUS SPEEDS, THE VEHICLE SHUT OFF WITHOUT WARNING. THE CONTACT TOOK THE VEHICLE TO EIDE CHRYSLER (1112 MISSOURI AVE, BISMARCK, ND 58504, (701) 223-1170) AND CHARBONNEAU CHRYSLER CENTER (346 1ST ST W, DICKINSON, ND 58601, (701) 456-2277) AND WAS INFORMED THAT THE VEHICLE WAS BEING OVERWORKED AND REACHING ITS TOW CAPACITY. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 70,942.",
        "vin": "3C7WRNFJ7EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2017",
        "dateOfIncident": "05/30/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995221,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 30, 2017 MY 2014 RAM 5500 DIESEL DUMP TRUCK HAD A FIRE UNDER THE HOOD.  THERE WAS EXTENSIVE DAMAGE/MELTING FROM THE FIRE. I PURCHASED THE VEHICLE NEW IN APRIL OF 2015 AND IT WAS 'JUST OUT OF WARRANTY\" AT JUST OVER 37,000 MILES ON IT. THE SOURCE OF THE DAMAGE WAS DETERMINED TO BE THE DENSO INTERNATIONAL ALTERNATOR.  FCA SENT A FIELD INSPECTOR TO THE SERVICE CENTER WHERE THE TRUCK WAS TOWED, AND MY VEHICLE INSURANCE COMPANY ALSO SENT AN INSPECTOR THERE.  MY INSURANCE COMPANY WILL COVER MOST OF THE DAMAGES BUT NOT THE ALTERNATOR NOR THE LABOR FOR THE ALTERNATOR AS FCA KNEW OR SHOULD HAVE KNOWN THAT THAT PART WAS DEFECTIVE AS RAM HAS RECALLED HUNDREDS OF THOUSANDS OF ALTERNATORS DUE TO SAFETY FIRE HAZARD BUT THEN CONTINUE TO USE THE SAME MANUFACTURER'S DEFECTIVE PRODUCTS IN THEIR VEHICLES. FCA SENT A LETTER REFUSING TO GIVE GOOD WILL AUTHORIZATION, AS WAS PROMISED BY THE CHRYSLER DEALER I PURCHASED IT FROM, TO COVER THE DAMAGE AND REPAIRS \"BECAUSE IT'S OUT OF ALTERNATOR WARRANTY\" - THEY KNEW THAT BEFORE THEY TOWED IT TO THE SERVICE CENTER.  THE FEDERAL MAGNUSON-MOSS WARRANTY ACT STATES THAT CONSUMERS HAVE AN IMPLIED WARRANTY BEYOND THE LIMITED WARRANTY FROM MANUFACTURERS.  CONSUMERS PURCHASE NEW VEHICLES IN GOOD FAITH THAT THEY ARE NOT GOING TO START ON FIRE DUE TO DEFECTIVE PARTS. THE FACT THAT THE SAME PART, THE ALTERNATOR, HAS HAD ABOUT 900,000 RECALLS IN THE LAST SEVERAL YEARS SHOWS ME THAT THEY KNEW OR SHOULD HAVE KNOWN THAT CONTINUING TO USE THE DENSO INTERNATIONAL ALTERNATORS IS A FIRE SAFETY HAZARD AND MY TRUCK SHOULD BE PART OF A RECALL SINCE IT STARTED ON FIRE ORIGINATING FROM THE ALTERNATOR.  CONSUMERS DESERVE BETTER!  THE VEHICLE HAS A SMELL BUT NO SENSORS CAME ON, THE POWER STEERING STARTED TO ACT UP WHILE DRIVING, I PULLED IN MY DRIVEWAY AND THE VEHICLE WAS ON FIRE. PUT OUT THE FIRE AND PULLED THE ALTERNATOR TO GET THE PART NUMBER TO GIVE TO AUTO PLACE.",
        "vin": "3C7WRNAL5EG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "03/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994198,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 5500. WHILE DRIVING 70 MPH, THE VEHICLE DECELERATED ON ITS OWN DUE TO THE DIESEL REGENERATION FILTER AND A WARNING MESSAGE APPEARED, WHICH WARNED OF GOING INTO LIMP MODE. THE VEHICLE WAS TAKEN TO THE DEALER (SOLOMON CHRYSLER JEEP DODGE LOCATED AT 409 NATIONAL PIKE W, BROWNSVILLE, PA 15417, (724) 785-8000) WHERE IT WAS DIAGNOSED THAT THE DIESEL PARTICLE FILTER WAS ENGAGED. THE VEHICLE WAS REPAIRED, BUT THE REPAIRS WERE UNKNOWN. THE CONTACT STATED THAT THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED CASE NUMBER: 31605523. THE FAILURE MILEAGE WAS APPROXIMATELY 110,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "05/30/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993765,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 RAM 5500 DIESEL PURCHASED NEW IN APRIL 2015 FIRE UNDER HOOD ON MAY 30, 2017.  NO LIGHTS CAME ON AS THE SENSORS WERE BURNED OUT AS WELL AS THE ALTERNATOR, THE HARNESSES AND OTHER PARTS UNDER THE HOOD.  THE TRUCK WAS IN MOTION BUT FLAMES NOTICED WHEN PULLED IN DRIVEWAY.  PUT OUT FIRE AND CALLED DEALER.  SPECIAL INVESTIGATOR DEPART LOOKED AT IT AT SERVICE CENTER ON MONDAY, JUNE 5.  STILL HAVE NOT HEARD ANYTHING.  TRUCK OUR MAIN SOURCE OF REVENUE AND WE ARE LOSING BUSINESS.",
        "vin": "3C7WRNAL5EG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893969,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 5500. WHILE THE VEHICLE WAS PARKED, IT ROLLED AWAY IN REVERSE. IN ADDITION, THE GEAR SELECTION DISPLAY BACK LIGHT CHANGED FROM WHITE TO YELLOW. WHEN THIS OCCURRED, THE VEHCILE FAILED TO START. THE FAILURE RECURRED ON NUMEROUS OCCASIONS.  THE VEHICLE WAS TAKEN TO A DEALER, BUT THE CONTACT WAS UNSURE ABOUT WHAT PART WAS REPAIRED. THE FAILURE PERSISTED, INCLUDING A NEW FAILURE. THE CONTACT WAS ABLE TO CHANGE THE GEAR SHIFTER WITHOUT THE BRAKE PEDAL BEING DEPRESSED WHILE IN PARK. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 400.",
        "vin": "3C7WRNEL9EG"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "05/04/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717301,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "5500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 5500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 13V527000 (STEERING) AND 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL); HOWEVER, THE PARTS NEEDED TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME TO COMPLETE THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VIN WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 09/10/15*LJ    UPDATED 10/14/2017*CN",
        "vin": "3C7WRMDL0EG"
    }
]