[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "05/01/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415786,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2011 RAM 4500. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, IT CAUGHT ON FIRE WHILE SITTING IN HIS WORK PARKING LOT. DUE TO THE PROXIMITY TO THE FIRE, THE VEHICLE PARKED IN FRONT OF HIS VEHICLE ALSO CAUGHT FIRE. A BYSTANDER HAD CALLED THE FIRE DEPARTMENT WHO THEN ARRIVED TO THE SCENE TO EXTINGUISH THE FIRE. UPON EXITING HIS BUILDING, THE CONTACT DISCOVERED IT WAS HIS VEHICLE THAT CAUGHT FIRE. NO INJURIES WERE REPORTED AS A RESULT OF THE FIRE AND THE CONTACT WAS UNCERTAIN IF A FIRE REPORT WAS FILED. THE VEHICLE HAD YET TO BE TOWED AND REMAINED AT THE SCENE. UPON INVESTIGATION, THE CONTACT DISCOVERED THAT HIS VEHICLE HAD BEEN PLACED UNDER  NHTSA CAMPAIGN NUMBER: 14V635000(ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL); HOWEVER, THE CONTACT STATED THAT HE NEVER RECEIVED A NOTIFICATION ABOUT THE RECALL. THE MANUFACTURER WAS THEN NOTIFIED OF THE FAILURE AND A CLAIM WAS FILED. THE VEHICLE WAS DESTROYED DUE TO THE FIRE. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "3D6WA6EL0BG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/23/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281958,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER WILL WORK WHEN IT WANTS TO I HAVE CHANGED BLOWER AND RESISTOR  STILL KICKS OFF FOR NO REASON",
        "vin": "3C7WRLFL1EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268100,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY OIL PAN IT RUSTING OUT FAST. NOTHING ON THE WHOLE TRUCK IS RUSTED AT ALL, ONLY MINOR SURFACE RUST. THE OIL PAN IS RUSTING VERY FAST AND THE TRUCK IS NOW LEAKING OIL. I BROUGHT THE TRUCK TO GOODBROTHERS DODGE AND THEY QUOTED ME THE REPAIRS TO BE AROUND 1200.00. I DROPPED THE TRUCK OFF AND THE NEXT DAY THEY SAID THE OIL PAN THEY ORDERED IS DENTED AND THEY NEED TO ORDER ANOTHER. THEN 4 DAYS LATER THEY SAID THEY COULDN'T DO THE JOB AND REPLACE THE OIL PAN. THEY SAID I NEED TO FIND SOMEONE ELSE TO FIX IT. I BOUGHT THE TRUCK FROM THEM AND NOW THEY CAN'T FIX, AND IT APPEARS TO ME THAT THIS IS A DEFECTIVE OIL PAN IN THE FIRST PLACE BECAUSE IT SHOULDN'T BE RUSTED LIKE IT IS. NOTHING ON THE WHOLE TRUCK IS RUSTED LIKE THIS.",
        "vin": "3C7WRLAL6EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256913,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 4500. WHILE THE CONTACT'S EMPLOYEE WAS DRIVING 30 MPH, THE CHECK ENGINE INDICATOR ILLUMINATED AND THE VEHICLE BEGAN TO DECELERATE. THE VEHICLE DID NOT SHUT OFF. THE DRIVER TOOK THE VEHICLE TO MCPEEK'S CHRYSLER DODGE JEEP RAM OF ANAHEIM (LOCATED AT 1221 S AUTO CENTER DR, ANAHEIM, CA 92806, (714) 635-2340) WHERE IT WAS DIAGNOSED THAT THE TURBO CHARGER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 93,881.",
        "vin": "3C7WRKBL1EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 RAM 4500 G56 TRANSMISSION DON'T DO ANY HARD SHIFTING OR ANYTHING ELSE SHIFT LEVER BROKE CLEAN OFF TODAY SHIFTING INTO SIX DOING 45 MPH, NOT A HARD SHIFT NO GRINDING GEARS JUST DROPPED INTO GEAR AND THEN SNAPPED OFF. THE TECHS TELL ME THAT IS IS AN \"ISOLATOR\" WHICH KEEPS THE VIBRATION DOWN, BUT THE SHIFTER IS ONLY HELD TOGETHER BY RUBBER.  THIS IS ON A HEAVY DUTY WORK TRUCK AND THE PIECE IS HELD TOGETHER BY RUBBER.  THIS IS DANGEROUS BECAUSE AT THE TIME OF FAILURE I WAS TOWING A TRAILER WHEN IT BROKE LEAVING ME STUCK IN 6TH GEAR UNABLE TO MOVE THE TRUCK OR PUT INTO NEUTRAL UNTIL I TOOK THE CONSOLE APART AND SHIFTED THE TRANSMISSION INTO NEUTRAL FROM THE TOP OF THE TRANSMISSION.  THIS COULD HAVE CAUSED A WRECK IF I WASNT IN A LOW TRAFFIC AREA.      I TOOK THE TRUCK TO DODGE AND THEY SAID THERE WAS A RECALL ON THE EXACT SHIFTER THAT I HAD BUT THE RECALL ONLY APPLIED TO 2015-2016 TRUCKS.  THIS IS AN ISSUE BECAUSE THEY KNOW THEY HAVE A FAULTY PRODUCT IN MORE THAN A FEW TRUCKS BUT ONLY 15-16 YEARS ARE BEING ADDRESSED.",
        "vin": "3C7WRLEL5EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032948,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 RAM 4500 STARTED TO MAKE NOISE COMING FROM THE WATER PUMP OF THE 6.7L CUMMINS MOTOR. HAPPENS TO BE THAT THE FCA RELEASED A RECALL OF 500,000 RAMS WITH POSSIBLE ENGINE FIRE DUE TO A FAILED WATER PUMP BEARING. WHEN I NOTIFIED THE DODGE DEALER THEY STATED NO KNOWLEDGE ON THIS AND SCHEDULED A SERVICE APPOINTMENT OVER A WEEK OUT. BEFORE THE APPOINTMENT DATE THE WATER PUMP SEIZED AND SNAPPED THE BELT AMONGST OTHER THINGS LIKE A BELT TENSIONER UNDER THE HOOD AND THE TRUCK HAD TO BE TOWED IN. THEY WILL NOT COVER THE BELT BECAUSE THERE IS A PTO SYSTEM ON THE TRUCK EVEN THOU THE FAILURE WAS CAUSED BY THE WATER PUMP FAILURE. THE WATER PUMP IS COVERED UNDER WARRANTY BUT THEY ARE PUTTING ON THE OE PUMP THAT HAS THE RECALL ON IT. THEY ARE AWARE OF THE RECALL BUT STATE ITS TO NEW. THIS OPENS ALL TYPES OF LIABILITY OF FIRE HAZARDS AND SO ON. SOMEONE HELP",
        "vin": "3C7WRLAL8EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860907,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 4500. WHILE DRIVING APPROXIMATELY 5 MPH UP HILL WITH HEAVY SNOW ON THE GROUND, THE VEHICLE WAS PULLING A 24 FOOT TRAILER WITH  A PIECE OF MACHINERY APPROXIMATELY 1,800 POUNDS OF WEIGHT. THE VEHICLE LOST POWER AND SLID BACKWARDS INTO AN EMBANKMENT. THE FRONT DRIVER SIDE FENDER, SIDE MIRROR, AND DRIVER SIDE DOOR WERE DAMAGED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE SAME FAILURE OCCURRED ON TWO SEPARATE OCCASIONS WHILE DRIVING UP HILL WITH THE SAME LOAD AND ROAD CONDITIONS. THE CHECK ENGINE WARNING INDICATOR ILLUMINATED ALL THREE TIMES. THE VEHICLE WAS REPAIRED BY THE DEALER UNDER WARRANTY, BUT NOT THE BODY DAMAGE. THE APPROXIMATE FAILURE MILEAGE WAS 18,000.",
        "vin": "3C7WRLEL9EG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/19/2015",
        "dateOfIncident": "10/30/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783192,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "4500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE TRUCK NEW AND THE DEALER WELDED THE BED TO THE FRAME IT IS KNOW COMPRISED SO IF IT CRACKS IT'S THERE FAULT.  THE OTHER PROBLEM IS THE TRUCK DRIFTS TO THE RIGHT WE FOUND THE REAR AXEL IS ABOUT .30 THRUST ANGEL ,OUT OF SQUARE TO THE FRAME CAUSING PULL THEY SAY THERE IS NO FIX AFTER 7 TIMES IN THE SHOP AND DODGE WON'T HELP ME OR FIX IT.",
        "vin": "3C7WRLFLOEG"
    }
]