[
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "ROCK CITY TRAILERS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584183,
        "products": [
            {
                "manufacturer": "ROCK CITY TRAILERS",
                "productMake": "ROCK CITY",
                "productModel": "8X20 CONCESSION TRAILER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "8FT X 20 FT FOOD CONCESSION TRAILER WAS PURCHASED DIRECTLY FROM MANUFACTURER - ROCK CITY TRAILERS, FACILITY #7115557.  AFTER TOWING THE TRAILER HOME AND TO ONE EVENT WE FOUND THAT ONE SIDE OF THE STEEL TOWING ASSEMBLY WAS BROKEN ALMOST ALL THE WAY THROUGH.  THE GENERATOR AND PROPANE TANK SIT ATOP THIS ASSEMBLY.  UPON FURTHER INSPECTION IT BECAME APPARENT THAT THE MANUFACTURER USED 2 PIECES OF STEEL IMPROPERLY WELDED TOGETHER FROM UNDERNEATH AND CONCEALED WITH PAINT RATHER THAN USING 1 SOLID PIECE OF STEEL.  HAD THIS PIECE BROKEN ALL THE WAY THROUGH WHILE DRIVING THE GENERATOR AND PROPANE TANK COULD EASILY HAVE CRASHED TO THE GROUND AND EXPLODED.  WE CONTACTED THE MANUFACTURER AND THEY SAID IT LOOKED AS THOUGH IT WAS \"CUT\" AND ASKED IF \"WE KNEW ANYONE WHO WOULD DO THIS TO US\" WHICH IS ABSOULTELY ABSURD.  WE'VE HAD 3 INDEPENDENT CERTIFIED WELDERS LOOK AT THE TRAILER AND ALL CONCUR THAT THIS WAS IN FACT 2 PIECES OF STEEL IMPROPERLY WELDED TOGETHER.  ADDITIONALLY, THE GAUGE OF STEEL WAS TOO LIGHT FOR THE PURPOSES INTENDED.  AT THIS TIME WE HAVE CONTACTED OUR ATTORNEY AND ARE IN THE PROCESS OF HAVING THE ORIGINAL TOWING ASSEMBLY REPLACED BY A LOCAL CERTIFIED WELDER AS WE DO NOT TRUST THE MANUFACTURER CONSIDERING THE CONDITION OF THE PRODUCT THEY INITIALLY DELIVERED AND THEIR REACTION TO OUR COMPLAINT.  THE MANUFACTURER HAS NOT ACKNOWLEDGED THAT THIS WAS THEIR ERROR AND THEY CONTINUE TO BUILD AND SELL THESE UNITS DIRECTLY TO THE PUBLIC. WE HAVE NO IDEA IF THIS IS THEIR NORMAL COURSE OF BUSINESS OR HOW MANY OTHER TRAILERS HAVE BEEN DELIVERED WITH THIS TYPE OF DEFECT BUT BELIEVE THE MANUFACTURER IS PUTTING MANY LIVES AT RISK BY DELIVERING DEFECTIVE EQUIPMENT LIKE THIS.",
        "vin": "1R9SC2026EL"
    }
]