[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458042,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Ram 3500. The contact stated that while towing a trailer filled with horses, the bed had detached from the cab as she pulled into her driveway. When the contact unhooked the trailer, she discovered a 6-inch gap had formed between the cab and the bed of the vehicle. She also discovered cracks on driver’s and passenger’s side frame of the vehicle. The contact called the dealer and was informed that her vehicle was no longer under warranty. No further assistance was provided. The contact then called her insurance provider and was able to drive the vehicle to an independent mechanic for repair. The mechanic replaced the frame and had both sides of the frame steel plated. The manufacturer had yet to be notified of the failure. The vehicle had been repaired. The failure mileage was approximately 80,000.",
        "vin": "3c63rrkl6eg"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446334,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 RAM 3500. The contact stated that while driving at 35 MPH, the front end of the vehicle started shaking uncontrollably. There were no warning lights illuminated. The contact stated that as he released the accelerator pedal, the brake exhaust turbo engaged, then he depressed the brake pedal. The contact veered to the side of the road, inspected the vehicle, and noticed that the front support track bar bracket was fractured at the A-frame. The contact became aware that the VIN was included in NHTSA Campaign Number: 15V541000 (Steering) before he owned the vehicle; however, the recall repair was not completed at that time because the vehicle had been lifted. The contact stated that the recall repair had been marked as complete though it was not. The manufacturer was notified of the failure and advised the contact that the recall history showed that a reinforcement bracket was not installed over the front track bar bracket; therefore, the recall was not completed. The contact stated that he used a strap and tied the front end of the vehicle and then drove to the dealer that was 1.2 miles away. The dealer diagnosed that the front support track bar bracket was fractured. The dealer informed the contact that the recall repair could not be complete because the previous owner had lifted the vehicle. The dealer submitted a report to the manufacturer stating the recall repair for NHTSA Campaign Number: 15V541000 (Steering) was incomplete because the vehicle had been lifted. The manufacturer updated the recall repair from \"Completed\" to \"Inspected\" in the vehicle recall history. The contact drove the vehicle to his hotel. The vehicle was towed to the contact's residence in Florida. The contact stated that the recall repair was not completed on Power Wagon vehicles or vehicles that were lifted by the owners. The vehicle was not repaired. The failure mileage was approximately 60,000.",
        "vin": "3C63R3ML5EG"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445973,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I experienced a lack of power and I noticed that the engine temperature jumped by 40F immediately.  The EVIC coolant temperature jump rapidly, but I never received a low coolant warning.  I pulled the truck off of I-25 Northbound just south of the WY border.  I waited for the vehicle to cool and added all of the coolant I had on hand, about 1.5 gallons.  I carefully limped into Cheyenne, WY, towing my 40' 5th wheel to a spot where we could stay.    I contacted Cowboy Dodge to identify the problem and repair it.  The technician looked at my vehicle and he indicated the EGR valve was bad and needed replaced.  The repair invoice is attached for reference.  We departed Cheyenne after the fix, and we only got 44 miles out of town on I-80 when the engine coolant light illuminated, and the temp started to spike again.  I coasted down the pass into Laramie, WY, in an attempt to get into cell service range and to get the truck off of the road if possible.  We ended up stranded on I-80 just east of the exit for 4-hours waiting on a tow vehicle that could take us back to Cheyenne, WY, with our RV in tow.  The same technician at Cowboy looked at the truck again and he indicated that the EGR cooler had failed.  The failure allowed coolant to leak, undetected, into the combustion chamber.  This caused carbon deposits, coal-like remnants, to be deposited throughout the motor and it was especially noticeable on the heat exchanger (see attached).    This issue cased $7,000+ damage to my truck and I'm still finding issues related to the failure.  I've had injectors fail, the heater core needed replaced again (3d), and the truck is smoking on startup with diminished power and sputtering at speed.  I've included all Ram 2021 servicing invoices.  This situation could have resulted in a catastrophic runaway on the motor resulting in fire.  I lucked out by watching the gages.  Stellantis (FCA) should be held accountable for their modifications to the Cummins motor causing these issues.",
        "vin": "3C63RRHLXEG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444590,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear driver's side upper shock mount was found broken during an inspection.  The part showed signs of possible metal fatigue, and not a corrosion induced failure, resulting in the metal stem (retaining the upper shock) to \"snap\" off the welded shock mount bracket.",
        "vin": "3C63RRJL5EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434583,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The component that has failed on this particular vehicle is the factory aluminum wheels manufactured by Alcoa for Mopar specifically for this model vehicle. The front wheels are the ones that are defective on this vehicle, structural cracks form on the outer lip of the wheels, and therefore pose a huge threat to the rim failing violently and the tire losing air or being destroyed in the process. This is the second time a wheel has needed to be replaced because of this issue. This defect has been brought to the attention of both dealership and manufacturer, however neither Dealership nor Manufacture wants to accept responsibility and pay to have the wheel repaired or replaced. Our vehicles are used as commercial vehicles, and are usually towing trailers or heavy loads. Having a front wheel failure during such operations, could pose a huge risk not only to the driver, passengers, and vehicle involved, but also to those surrounding motorist that maybe near or passing by the vehicle during the time of a possible wheel failure. Luckily both cracks have been detected during daily inspections, and none of these issues have resulted in a vehicle accident or injury while vehicle has been traveling down the road. No warning signs were present during the time of repair, and given the fact that the cracks can sometimes be hairline cracks and very hard to notice poses an even bigger threat to those who may not check their wheels on a daily basis, and could very easily be overlooked by the average consumer.",
        "vin": "3C7WRTBL2EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431342,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The shifter in the vehicle sticks when in park. On several occasions after being parked the shifter will not move to drive or reverse. Moving the steering wheel doesn't help. Only after pulling on the shifter hard does it move.  Other drivers with this generation ram have shared on forums they have the same issue.",
        "vin": "3C63RRHL7EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428342,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2014 Ram 3500. The contact stated while driving 60 mph, the front passenger’s side wheel detached from the vehicle. The contact pulled the vehicle over to the side of the road. The contact had the vehicle towed to an independent mechanic to be diagnosed. The contact was informed that the lug nuts had sheared off causing the wheel to detach. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 165,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421114,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The acceleration severely lags from a stop. When I’m stopped and try to go the truck hesitates and it’s very dangerous. This problem has been happening on and off for years. It’s very dangerous and unpredictable.",
        "vin": "3C63RRNL8EG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385027,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENSOR FAILURE AT 52,000 MILES. VEHICLE WAS PARKED FOR 2 DAYS AROUND CHRISTMAS, STARTED DAY AFTER CHRISTMAS AND ENGINE LIGHT IS ON, 'FUEL SENSOR FAILURE' ALERT COMES ACROSS, FUEL GAUGE ON EMPTY WHILE HAVING A FULL TANK.",
        "vin": "3C7WRTAJ4EG"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375475,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING AT A SPEED OF 50 TO 75 MPH AND DRIVING OVER UNEVEN PAVEMENT OR TRANSITIONS (BRIDGES OR INTERSECTIONS) THAT ARE NOT SMOOTH THE STEERING WHEEL SHAKES VIGOROUSLY. THE SHAKE IS TO THE POINT THAT YOU HAVE TO GRIP IT TIGHTLY TO ENSURE CONTROL OF THE VEHICLE TO MAKE SURE YOU DON'T CAUSE AN ACCIDENT. THE WHEELS WOBBLE BACK AND FORTH VIGOROUSLY JUST LIKE THE STEERING WHEEL. YOU CANNOT PRESS ON YOUR BRAKES UNTIL YOUR SPEED DROPS WHEN YOU LET OFF THE GAS. THIS HAPPENS ON ALL KINDS OF ROADWAYS. THIS FIRST HAPPENED ON 09/15/2016 AND STILL HAPPENS TO THIS DAY. I HAVE VIDEOS OF THIS HAPPENING.",
        "vin": "3C63R3ML1EG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375197,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE ODOMETER INDICATOR FAILED TO PROVIDE ACCURATE MILEAGE READINGS. THERE WAS NO WARNING LIGHT ILLUMINATED. JERRY DAMSON FORD (810 N. BRINDLEE MOUNTAIN PKWY, ARAB, AL 35016, (256) 586-6041) AND REFERRED THE CONTACT TO THE MANUFACTURER FOR REPAIR OPTIONS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED. THE CONTACT MENTIONED NHTSA CAMPAIGN NUMBER: 13V486000 (ELECTRICAL SYSTEM) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO THE DEALER TO HAVE THE VEHICLE DIAGNOSED, WHICH WAS STILL PENDING. THE FAILURE MILEAGE 62,369. INVALID VIN.",
        "vin": "3D63RRGLXEG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366935,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL EQUIPMENT NEXEN  RODIAN 235/80R17 TREAD DELAMINATED FROM CARCASS CREATING OUT-OF-ROUND TIRE AND SEVERE VIBRATION AT HIGHWAY SPEED.   9600 MILES ON TIRE.",
        "vin": "3C7WRTCL5EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328157,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V036000 (POWER TRAIN) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO THE SEVERAL UNKNOWN DEALERS, INCLUDING LITHIA DODGE LOCATED AT 200 E. CYPRESS AVE, REDDING, CA 96002, AND IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.*DT*JB*DT*JB  *DT  CONSUMER STATED DEALERSHIP WOULD NOT TO ABLE TO FIX THE CAR UNTIL FEB.2021.*JB",
        "vin": "3C6URVJG7EE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2020",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326916,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO ACTUATOR FAILED LEAVING US STRANDED WHILE ON VACATION.  VEHICLE WOULD NOT RESTART ONCE POWER WAS LOST AND WE HAD TO STOP ON SIDE OF ROAD AND WAIT UNTIL THE ENGINE WOULD START. WE HAD BEEN TAKING THE VEHICLE TO A RAM DEALERSHIP TO TROUBLE SHOOT FROM THE BEGINNING BUT THE PROBLEM CONTINUED TO ACCELERATE OVER A PERIOD OF TIME FINALLY ENDING WITH THE ACTUATOR HAVING TO BE REPLACED. THIS ENGINE SHOULD BE LASTING BUT FAILED AT 109,082 MILES. THE PROBLEM WITH ACTUATOR FAILED US WAY TOO SOON FOR A RAM CUMMINS DIESEL  WHICH SHOULD GET AT LEAST 300,000 MILES DURABLE WEAR. THIS VEHICLE HAS NEVER BEEN ABUSED IN ANY WAY AND HAS ALWAYS BEEN PROPERLY SERVICED AT AN AUTHORIZED RAM DEALERSHIP. WE CAME HOME FROM VACATION AND TOOK TRUCK TO DEALERSHIP BECAUSE OF DANDER OF LOSING POWER.  WE HAD TO TRAVEL THREE HOURS IN ORDER TO GET HOME FROM VACATION. THEN DO WITHOUT VEHICLE IN ORDER TO HAVE REPAIRED.  THE AUTHORIZED DEALER SERVICE DEPARTMENT HAS ALWAYS BEEN EXCELLENT, WE HAVE ABSOLUTELY NO COMPLAINT AGAINST THEIR SERVICE. I ACTUALLY SAW SEVERAL ACTUATORS WAITING TO BE RETURNED TO RAM BECAUSE THEY HAD BEEN REPLACED. I ASKED WHAT THEY WERE AND I WAS TOLD ACTUATORS THAT HAD BEEN REPLACED WAITING TO BE RETURNED UNDER WARRANTY! WHEN THIS HAPPENED TO US I WAS TOLD 2014 VEHICLES HAD NOT BEEN WARRANTED BY RAM. THE VERY FACT THAT THE ACTUATORS WERE FAILING SPEAKS VOLUMES TO ME BECAUSE OBVIOUSLY THERE IS A PROBLEM WITH THE PART. AFTER WAITING ONE YEAR FOR RAM TO ADDRESS THIS PROBLEM IT IS OBVIOUS IT IS BEING IGNORED ON 2014 TRUCKS WHICH HAVE BEEN SOLD FOR POWER AND DURABILITY. IF ONE ACTUATOR GOES BAD THERE IS A RESPONSIBILITY BY RAM TO BACK THEIR PRODUCT. THE CUSTOMER HONORABLY PURCHASED THIS VEHICLE WITH FORETHOUGHT OF ENDURANCE SIMPLY BECAUSE OF THE PACKAGE PROVIDED SUITED FOR THE NEED OF PURCHASE. BY THE WAY, THIS IS THE FIRST RAM PURCHASED BY ME!!! WHAT DO YOU THINK????  *TR",
        "vin": "3C63R3FL2EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323100,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE LAST YEAR AND HALF, THE VEHICLE WILL NOT START AFTER DRIVING SOMEPLACE, SEEMS IT DOES THIS EVERY FEW MONTHS, THE ONLY WAY TO GET IT STARTED IS TO EITHER ROCK THE TRUCK OR PUSH IT ABOUT 15 FEET. I'VE HAD IT INTO THE DODGE DEALERSHIP SEVERAL TIMES, THEY CAN'T FIND THE PROBLEM NOR WILL IT NOT START FOR THEM. THIS HAS BECOME VERY FRUSTRATING! I TOW A 39 FOOT TRAILER AND THIS HAS HAPPENED TWICE WITH IT NOT STARTING! HELP PLEASE.",
        "vin": "3C63R3DL5EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318275,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V035000 (POWER TRAIN) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER WAS CONTACTED AND CONFIRMED THAT THE PART WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C7WRVLG1EE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317315,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V036000 (POWER TRAIN) HOWEVER, THE PARTS TO DO THE RECALL REPAIR WERE UNAVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C6URVJGXEE"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/06/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED WHILE DRIVING 5 MPH, WHEN SMOKE AND THE SMELL OF FUEL BEGAN TO ENTER THE CAB OF THE VEHICLE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATE HE PARKED THE VEHICLE AT HIS DRIVEWAY AND  SAW SOMKE EXITING THE HOOD. THE CONTACT ALSO STATED THE FUEL HEATER AND ELECTRONICAL CONNECTOR WAS COVERED IN DIESEL FUEL AND HAD A BURNED SMELL. THE VEHICLE WAS NOT DRIVABLE. UPON INVESTIGATION THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL). THE CONTACT CALLED LOCAL DEALER JEFF D'AMBROSIO DODGE CHRYSLER JEEP DOWNINGTOWN LOCATED AT  1221 E LANCASTER AVE, DOWNINGTOWN, PA 19335, WERE MADE AWARE OF THE FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED  OR REPAIRED AS OF YET. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 69,228.",
        "vin": "3C63RRJL2EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311907,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED WHILE DRIVING AT APPROXIMATELY 70 MPH, THE REAR OF THE VEHICLE VIBRATED ABNORMALLY. THE CONTACT STATED THAT THE DRIVE SHAFT AND TIRES WERE REPLACED HOWEVER, THE FAILURE RECURRED. AN UNKNOWN DEALER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "3C63RPGL8EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298258,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRAG LINK FIX, SPOT WELDED, NOW IT COSTS MORE TO HAVE THEM CUT WELDS AND ALIGNMENT FT END AT CONSUMERS EXPENSE,  THIS WAS A RECALL FIX THAT COSTS THE CONSUMER I THINK THIS SHOULD BE ON MANUFACTURER, AND NOT THE CONSUMER",
        "vin": "3C63R3DL9EG"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11282507,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 RAM 3500. THE CONTACT STATED THAT A DEER DARTED OUT IN FRONT OF HER VEHICLE. WHILE VEERING TO AVOID IT, THE CONTACT CRASHED INTO A BRIDGE AND THEN A CULVERT AND ENDED UP FIVE FEET ON A HILLSIDE. THE AIR BAGS DID NOT DEPLOY AND THE SEAT BELT FAILED TO OPERATE PROPERLY. THE CONTACT SUSTAINED INJURIES TO THE BACK, SHOULDER, NECK, BACK OF THE HEAD, SCIATIC NERVE, AND RIGHT HAND. THE CONTACT'S BOYFRIEND SUSTAINED INJURIES TO THE FACE, NECK, AND RIGHT RIB AREA. BOTH OCCUPANTS WERE TAKEN TO THE HOSPITAL FOR MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS LEFT AT THE SCENE FOR A FEW DAYS AND WAS EVENTUALLY TOWED TO A BODY SHOP WHERE IT WAS DEEMED DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 79,519.*DT *DT*JB",
        "vin": "3C63RRGL6EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278654,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RECALL R36 / NHTSA 15V-459.  MY TRUCK HAS HAD THE RECALL DONE AND STILL HAS THE EXACT SAME ISSUES THE RECALL WAS SUPPOSED TO CORRECT.  I AM NOT CONFIDENT THE DEALER ACTUALLY DID THE WORK PROPERLY OR AT ALL.  MY STEERING WHEEL MOUNTED CONTROLS WORK INTERMITTENTLY AND THE HORN RARELY WORKS BUT WHEN IT DOES IT USUALLY COMES ON AND STAYS BLOWING UNTIL THEY IGNITION IS TURNED OFF.  THIS IS A MAJOR SAFETY CONCERN INVOLVING THE CRUISE CONTROL, HORN, AND AIRBAG SYSTEM.  THE ONLY ANSWER I GET FROM MY DEALER IS \"THE RECALL HAS BEEN DONE, YOU'LL NEED TO PAY FOR THE WORK\".  I DON'T FEEL IT IS MY RESPONSIBILITY TO PAY FOR A SHODDY REPAIR JOB INVOLVING A RECALL.  ADDITIONALLY, THERE ARE 4 OTHER OPEN RECALLS ON MY TRUCK THAT THE DEALER \"CAN'T FIT IN THEIR SCHEDULE\".",
        "vin": "3C63R3GL6EG"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267911,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE DRIVING, THE FRONT PASSENGER SIDE OF THE VEHICLE SHOOK AND VIBRATED. THE VEHICLE WAS TAKEN TO LANDMARK DODGE CHRYSLER JEEP RAM (1900 S NOLAND RD, INDEPENDENCE, MO 64055, (816) 836-0100) WHERE IT WAS DIAGNOSED THAT THE FRONT END NEEDED AN ALIGNMENT. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE SAME DEALER EIGHT TIMES FOR THE SAME FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND PROVIDED CASE NUMBER: 64579036. THE FAILURE MILEAGE WAS APPROXIMATELY 117,845. *DT  *TR",
        "vin": "3C63R3HL6EG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267722,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CONCERN IS THE BLINKER BULB REPLACEMENT. SOMETHING THAT IS REQUIRED BY LAW AND SAFETY STANDARDS TO FUNCTION, SHOULD BE READILY ACCESSIBLE AND CHANGEABLE. HOWEVER ON THIS VEHICLE THE MANUFACTURER PROVIDED LIGHTS ARE NON REPLACEABLE WITHOUT CHANGING THE ENTIRE ASSEMBLY. IN ORDER FOR MYSELF TO SATISFY THE LAWS OF THE ROAD I MUST SPEND AN ADDITIONAL $1000 INSTEAD OF THE TYPICAL 5 DOLLAR BULB. THIS IS AFFECTING MY ABILITY TO DRIVE ON THE ROAD SAFELY AND IS FORCING ME TO PARK MY TRUCK UNTIL THE LIGHT ASSEMBLIES ARRIVE ONE WEEK FROM NOW. NOT ONLY IS THIS RIDICULOUS BUT IT IS CRIMINAL.",
        "vin": "3C63RRKL7EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "11/17/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267099,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT INITIALLY RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING). THE CONTACT TOOK THE VEHICLE TO ARIZONA MOTORS SNOWFLAKE DODGE (870 MAIN ST, SNOWFLAKE, AZ 85937, (928) 536-7234) FOR THE RECALL REPAIR. AFTERWARDS, WHILE DRIVING 35 MPH, THE STEERING COLUMN MADE A POPPING NOISE WITHOUT WARNING WHILE STEERING THE VEHICLE. THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER WHERE THEY PERFORMED ANOTHER REPAIR. DESPITE THE MULTIPLE REMEDIES PERFORMED ON THE VEHICLE, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 27,208.*JB",
        "vin": "3C63RRJL0EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265334,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE THE VEHICLE WAS PULLING A LOAD AND DRIVING UP A HILL, IT LOST POWER AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT COASTED THE VEHICLE OVER TO THE SIDE OF THE ROAD, REMOVED THE LOAD, AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE EGR VALVE NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE TECHNICIAN CLEANED AND REPAIRED THE VALVE, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO BROWNING DODGE CHRYSLER JEEP RAM (1983 HAMNER AVE, NORCO, CA 92860, (951) 272-3110), BUT NO FAILURE WAS FOUND. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 69,000. *JS",
        "vin": "3C63RPJL2EG"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/17/2019",
        "dateOfIncident": "07/21/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244652,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BEARING BRACKETS THAT HOLD THE FAN CLUTCH ON EXPLODE SENDING THE FANS INTO THE RADIATOR. WHEN THIS OCCURS YOU HAVE LIMITED BRAKES AND STEERING. THIS IS NOT FIRST ONE TO DO THIS TO ME. THIS TIME THE TRUCK CAUGHT FIRE BECAUSE OF HOW HOT THE PARTS WERE. ALL OF THE FAIL ON THE CUMMINS ENGINE.  EACH TIME HAS BEEN AROUND 65MPH . THE SHOPS LAUGH ABOUT IT BEING ANOTHER WHEN YOU TOW IT IN.    THANKS  RICHIE",
        "vin": "3C63RRNLXEG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243416,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL OPERATION HAS BECOME ERRATIC WHILE TRUCK IS IN MOTION ON A HIGHWAY AT 55 -66 MPH..  STOPPED MAINTAINING SPEED BUT ALSO COULD NOT TURN OFF THE CRUISE CONTROL.  TOOK A RANDOM SERIES OF BUTTON PUSHES AND BRAKING BEFORE IT FINALLY RESPONDED AND TURNED OFF.  HAS SINCE WORKED CORRECTLY AT TIMES, AND FAILED TO MAINTAIN SPEED AT OTHER TIMES.",
        "vin": "3C63RRJL6EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "07/28/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243422,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE SENSOR STOPPED WORKING ON LEFT FRONT WHEEL.  ERROR MESSAGE TO HAVE SENSOR SYSTEM SERVICED APPEARS AT STARTUP.  FAILURE OCCURRED ON SECONDARY STREETS AT BEGINNING OF TRIP, TOWING 5TH WHEEL.  STOPPED AND CHECKED TIRE PRESSURE TO SEE IF TIRE WAS FAILING.  PRESSURE WAS NORMAL.  NO PSI DISPLAYED ON CONSOLE FOR LEFT FRONT.  OTHER SENSORS REPORTING NORMALLY.",
        "vin": "3C63RRJL6EG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "11/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217978,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOCKED IN CRUISE CONTROL AT 45MPH, ENGINE WENT TOTALLY WIDE OPEN, I WANTED TO LET IT GO TO SEE HOW FAST  IT WOULD GET TO BUT A CAR WAS PULLING OUT OF WOODLAND WAY.LESS THAN 5 SECONDS I WAS AT 85MPH. I HAD TO BRAKE HARD TO BRING IT BACK DOWN BEFORE THE INTERSECTION. NOW THE TOTAL STEERING WHEEL IS DEAD.NO HORN OR OTHER CONTROLS. QUALITY SHOP SAY'S 500.00 TO REPAIR. ALSO EARLIER TOTAL SHUT DOWN.WRECKER HAUL TO QUALITY 150.00. QUALITY SAID BATTERIES LOW VOLTAGE AT ONLY APPOX. 38000 MILES. 380.00 FOR TWO MOPAR BATTERIES.  I'M STILL USING BOTH BATTERIES AT OUR EQUIPTMENT  RENTAL BUSINESS. I TOLD  QUALITY ABOUT  CRUISE CONTROL AND THEY REPLACED SWITCH BUT ALWAYS SAID COULD NOT DUPLICATE THE PROBLEMS. IS THIS A SAFETY RECALL OR NOT? I REALLY DON'T WANT TO PUT 500.00 0N A NEW WATCH SPRING JUST TO SMOKE IT AGAIN!! THANK YOU   (XXXX) THIS HAPPENED OVER A YEAR OR TWO AGO. I KEPT DRIVING AS IT WAS. BILL COPIES ARE IN TRUCK    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "3C63R3JL7EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207692,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CHECK ENGINE LIGHT COMES ON AND THE TRANSMISSION GOES INTO LOW GEAR AND INTO \"LIMP MODE\".  THIS ISSUE HAS OCCURRED MULTIPLE TIMES AND THE DEALERSHIP HAS CHARGED ME TO TRY AND CORRECT THIS ISSUE BY INSTALLING A NEW FUSE BOX OR TIPM BOARD AND REPROGRAMMING IT.  STILL THE ISSUE IS NOT FIXED.",
        "vin": "3C63R3CJ7EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204993,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE THE VEHICLE WAS IN REVERSE, A POP SOUND OCCURRED UNDER THE FRONT OF THE VEHICLE AND THE CONTACT LOST CONTROL OF THE STEERING. THE CONTACT NOTICED THAT THE STEERING ROD WAS DETACHED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND WAS LATER TAKEN TO SOUTHLAND DODGE CHRYSLER JEEP RAM FIAT (LOCATED AT 6161 W PARK AVE, HOUMA, LA 70364, (985) 303-1589) WHERE IT WAS DIAGNOSED THAT THE STEERING ROD FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED BECAUSE THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: 58393140. THE APPROXIMATE FAILURE MILEAGE WAS 78,000.",
        "vin": "3C63RPJL0EG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204155,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL IS LEAKING FROM THE FUEL FILTER HOUSING CONNECTOR ON THE DRIVERS SIDE OF THE VEHICLE. RECALL EXISTS FOR THIS CONDITION BUT MY VEHICLE IS NOT INCLUDED IN THE RECALL BUT HAS THE SAME ISSUES.",
        "vin": "3C63R3DL2EG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 5,
        "odiNumber": 11203436,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE DRIVING 60 MPH, THE CONTACT LOST CONTROL OF THE STEERING AND CAUSED THE VEHICLE TO BE REAR ENDED BY ANOTHER VEHICLE. IN TURN, THE OTHER VEHICLE WAS ALSO REAR ENDED BY A THIRD VEHICLE. THE CONTACT WAS ABLE TO PARK THE VEHICLE ON THE RIGHT SIDE OF THE ROAD. THE AIR BAGS DID NOT DEPLOY. THE REAR OF THE VEHICLE WAS DAMAGED. THE CONTACT WAS NOT INJURED; HOWEVER, FIVE REAR PASSENGERS IN THE OTHER TWO VEHICLES WERE INJURED AND RECEIVED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO DEMONTROND CHRYSLER DODGE JEEP RAM (LOCATED AT 888 I-45, CONROE, TX 77304, (936) 249-1038) WERE IT WAS DIAGNOSED THAT THE FRONT TRACK FRAME BRACKETS NEEDED TO BE REPLACED IN RELATION TO NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING). THE VEHICLE WAS NOT REPAIRED. THE  MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 75,000. THE VIN WAS INVALID.",
        "vin": "3C6344K26EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196459,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED RECALL NOTICE CONCERNING THE DRAG LINK.  THE RECALL SAYS THAT THIS DEFECTIVE PART COULD CAUSE AN CRASH.  I HAVE CALLED CHRYSLER WHO SAYS THAT THERE IS AT THIS TIME NO  FIX.  I CALLED SEVERAL DEALERSHIPS AND ONE SAID THERE IS NO FIX AND THE OTHER STATES THAT THE FIX IS TO WELD THE PART.  WELDING THIS PART DOES NOT ALLOW ME TO HAVE TO REPLACE THE TIE ROD ENDS EACH TIME TO ADJUST THE FRONT END ALIGNMENT.  IT MAY BE THAT THIS VEHICLE WAS SOLD TO ME KNOWING THAT THERE WAS A PROBLEM SINCE THE RECALLS WERE FOR PREVIOUS YEARS.  CHRYSLER SAYS THEY ARE ONLY FIXING THE 2017 AND 2018 YEARS.  I HAVE A 2014 3500 AND A 2015 3500.  WE INSPECTED AND FOUND THE NUT TO BE VERY LOOSE. YOUR WEBSITE SAYS THAT THERE IS A FIX OF REPLACING THE DRAG LINK. CHRYSLER DISAGREES.  WHO'S RIGHT?",
        "vin": "3C7WRTCL9EG"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194728,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE DRIVING APPROXIMATELY 60 MPH, THE FRONT PASSENGER SIDE RIM FRACTURED AND CAUSED THE VEHICLE TO CRASH INTO A DITCH. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE AIR BAG DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS NOT DAMAGED OR TOWED. AAA WAS CALLED TO THE SCENE AND CHANGED THE TIRE. THE VEHICLE WAS TAKEN TO CHARLIE'S DODGE CHRYSLER JEEP RAM (419-893-0241, LOCATED AT 725 ILLINOIS AVE, MAUMEE, OH 43537) WHERE THE TECHNICIAN TOOK PICTURES OF THE TIRE AND RIM. THE DEALER STATED THAT THE PICTURES WOULD BE PRESENTED TO THE REPRESENTATIVE WHO HANDLED SUCH FAILURES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROMISED TO CALL THE CONTACT BACK. THE CONTACT WAS NOT CALLED BACK. THE CONTACT REPLACED THE WHEELS. THE FAILURE MILEAGE WAS APPROXIMATELY 200,000.",
        "vin": "3C63RRHL4EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/20/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191690,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AFTER WE REPLACED THE FUEL PUMP THE TRUCK STILL DIDN'T PERFORM LIKE IT SHOULD HAVE FOR A 2 YEAR OLD DUALLY WITH LESS THAN 100,000 MILES ON IT. AROUND 1 YEAR AGO, WE WERE DRIVING AND SUDDENLY WERE ABLE TO SMELL AN EXTREMELY FOUL SMELL COMING FROM UNDER THE DASHBOARD, UPON FURTHER EXAMINATION WE DISCOVERED THAT THE ANTI FREEZE WAS LEAKING FROM SOMEWHERE AND ENTERING THE PASSENGER FLOOR BOARD. AFTER THIS OCCURRED IT SEEMED AS IF THE TRUCK ITSELF JUST STARTED TO FALL APART. BOTH BATTERIES HAVE HAD TO BE REPLACED COUNTLESS TIMES AS WELL. THE RADIO AND A/C DO NOT WORK AND THE HEATER DOESN'T COME CLOSE TO GETTING HOT.",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/26/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172233,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WEARS RIGHT FRONT , OUTSIDE TREAD OFF OF TIRE. [ THE FIRST 2 INCHES ON OUTSIDE OF TIRE TREAD OFF IN LESS THAN 5000 MILES]",
        "vin": "3C63RRGL6EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "12/22/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171507,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELLED BURNING WIRE(S) WHILE EXITING INTERSTATE. AT BOTTOM OF RAMP ENGINE QUIT. HAD LIGHTS ETC AND ENGINE WOULD CRANK BUT NOT START.  TRUCK WAS TOWED TO DEALER - SCAN INDICATED LIFT PUMP BAD. REPLACED UNDER WARRANTY.  REPLACEMENT PUMP FAILED SHORTLY AFTER INSTALL WHILE TESTING.  TECH FOUND BURN AND SHORTED WIRES IN HARNESS BEHIND LEFT FRONT WHEEL WELL.  TECH SPLICED DAMAGED WIRES AND TEST WITH ANOTHER PUMP.  HOWEVER ON FURTHER TESTING FOUND THE SHORTS DAMAGED THE BCM(BODY CONTROL MODULE) WHICH RELATED IN FUEL GUAGE NOT WORKING.  REPLACED BCM.  WARRANTY WOULD NOT COVER REPAIR TO WIRE HARNESS OR BCM.  ALL SEEMED TO BE WORKING WHILE TRAVELING BACK HOME HOWEVER THE BACKUP GUIDE LINES FOR BACKUP CAMERA DO NOT APPEAR NOW.  NOT SURE IF IT IS HARNESS OR BCM.",
        "vin": "3C63RRKL5EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166538,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHEN THE VEHICLE WAS PLACED IN PARK, IT DID NOT SHUT OFF AND \"VEHICLE WAS NOT IN PARK\" APPEARED ON THE INSTRUMENT PANEL. THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO MARTIN CHRYSLER, DODGE, JEEP & RAM (262-878-1226, LOCATED AT 1422 MAIN ST, UNION GROVE, WI 53182), BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE MANUFACTURER WAS NOTIFIED AND SENT A REPRESENTATIVE TO INVESTIGATE THE FAILURE. THE CONTACT WAS INFORMED THAT NOTHING COULD BE DONE TO ASSIST. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.",
        "vin": "3C63R3ELXEG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163488,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS TRUCK INSPECTED SEVERAL TIMES DUE TO THE STEERING BRACKET WELD FAILURES AS PER THE RECALLS. I WAS RECENTLY AT THE METROPLEX DODGE ON DENTON DR. BY LOVE FILED AIRPORT IN DALLAS AND ON MY WAY HOME I HEARD A RUBBING NOISE COMING FROM THE FRONT PASSENGER SIDE WHEEL I NOTICED THE WHEEL WELL COVER WAS LOOSE AND WAS RUBBING AGAINST THE TIRE. UPON FURTHER INSPECTION I NOTICED THE WELDS ON THE SPRING PERCH BRACKET WHICH IS WELDED ON THE FRAM RAILS HAD BROKEN OFF AND AND PUSHED THE PLASTIC WHEEL COVER OFF. THE SPRING PERCH BENT UPWARD AND THE SPRING IS ABOUT TO COME OFF. HAD THE SPRING PERCH BRACKET BROKEN OFF FROM THE REMAINING WELD WOULDN OF CAUSED A ROLL OVER. ONE OF THE RECALLS MENTIONED SOME STEERING COMPONENTS MAY HAVE WELDS WITH INSUFFICIENT FUSION WHICH CAUSES THE WELDS TO BREAK RIGHT OFF. THIS HAS HAPPENED ON MY TRUCK. I WAS VERY LUCKY I NOTICED THE WELD BREAK AND STOPPED USING THE TRUCK. THIS ADDITIONAL FAILURE HAS TO MENTIONED ON ANY FUTURE RECALLS TO PREVENT FUTURE ACCIDENTS.",
        "vin": "3C63R3GL1EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163365,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SCR SYSTEM HAS FAILED TWICE WITH ONLY 75700 MILES ON. NEEDING FULL REPLACEMENT OF THE SCR SYSTEM. SYMPTOMS INCLUDE CONSTANT EXHAUST REGENERATION AND ENGINE FAULT CODES ON OBD.",
        "vin": "3C63R3CL3EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162183,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE TRANSMISSION FAILED TO FUNCTION WHEN HAULING A TRAILER, WHICH CAUSED THE VEHICLE TO SWITCH INTO LIMP MODE. THE INDEPENDENT MECHANIC REPLACED THE SOLENOID PACK AND THE VEHICLE WAS REPAIRED. THE MANUFACTURER INDICATED THAT THE VEHICLE WAS EXCLUDED FROM ANY POWER TRAIN RECALLS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3C63RRJL7EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "10/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139724,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK HAS 74,000 MILES AND THE LEFT FRONT WHEEL BEARING HUB OR UNIT BEARING FAILED.  LUCKILY, WE NOTICED IT MADE AN ODD NOISE AFTER EXITING OFF THE INTERSTATE.  IF IT HAD FAILED WHILE WE WERE AT HIGHWAY SPEED, WE WOULD HAVE BEEN INVOLVED IN A MAJOR ACCIDENT.  THERE IS NO WAY TO GREASE THIS PART AND NO WARNING OF WHEN THIS FAILURE COULD OCCUR.  LOSS OF STEERING AND BRAKING ALSO OCCURS.",
        "vin": "3C63RRJL4EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133264,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE WHEEL BEARING FRACTURED WITHOUT WARNING. THE VEHICLE WAS TOWED TO BOERNE DODGE CHRYSLER JEEP RAM (30300 I-10, BOERNE, TX 78006, (830) 443-9153 AND (830) 443-9432) WHO REPLACED THE FRONT PASSENGER WHEEL BEARING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 173,198.",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "10/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132894,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V821000 (POWER TRAIN), 17V562000 (ENGINE AND ENGINE COOLING), AND 17V541000 (STEERING). THE DEALER (TEXAS DODGE, 7800 I-40 FRONTAGE RD, AMARILLO, TX 79106, 806-353-6343) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130459,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WINDSHIELD WIPERS MALFUNCTIONED AND WILL NOT TURN OFF, KILLS VEHICLE BATTERY. WIPERS DO NOT FUNCTION WITH FUSE REMOVED TO PREVENT BATTERY FROM DRAINING, AND WINDSHIELD FROM BEING DAMAGED, CANNOT SAFELY DRIVE VEHICLE IN RAIN.    TRUCK IS NOW NOT SAFE TO DRIVE, CANNOT OBTAIN INSPECTION STICKER, AND RAM   CANNOT PROVIDE A REPLACEMENT PART TO FIX THE VEHICLE. PART HAS BEEN ON BACK ORDER FOR 3 MONTHS AND WILL NOT PROVIDE A RENTAL. I AM BEING FORCED BY RAM TO DRIVE A VEHICLE, WITH MY FAMILY, THAT IS NOT SAFE, AND ILLEGALLY BECAUSE I CANNOT OBTAIN AN INSPECTION STICKER AND MY REGISTRATION WILL BE REVOKED SOON. TRUCK WAS NEVER REPAIRED AND DEALER (ARTIOLI DODGE/RAM) CLOSED REPAIR ORDER WITHOUT COMPLETING THE REPAIR.",
        "vin": "3C63R3CL1EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "08/24/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128126,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE DRIVING AT UNKNOWN  SPEEDS IN THE DRIVE GEAR, THE GEAR SHIFTER SWITCHED INTO NEUTRAL WITHOUT WARNING. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT RESTARTED THE VEHICLE AND IT WORKED NORMALLY. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (K & M DODGE RAM, 4100 PLAINFIELD AVE NE, GRAND RAPIDS, MI 49525, 616-363-7520) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED AND THE PARTS WERE ON BACKORDER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 284,000.",
        "vin": "3C6URVJD2EE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121728,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2014 DODGE RAM 3500 HAS ABOUT 45000 MILES ON IT.  ABOUT 3-4 WEEKS AGO WE NOTICED A CLICKY/POPPY SOUND COMING FROM THE FRONT END.  WE PARKED THE VEHICLE AND CALLED THE DEALERSHIP TO GET IT IN.  THE APPOINTMENT WE HAD WAS FOR AUGUST 15TH.  YOU COULD HAVE KNOCKED US OVER WITH A FEATHER WHEN WE GOT A CALL FROM THEM TELLING US THE FRAME WAS CRACKED AND WE HAD TO HAVE HIT SOMETHING VERY HARD TO DO THIS.   I CAN TELL YOU THE ONLY POSSIBLE THING WE CAN THINK OF IS A BAD POTHOLE THAT WAS HIT AT LIKE 10MPH AND EVEN THAT I FIND FAR FETCHED TO HAVE CAUSED A CRACKED FRAME.  THIS IS SUPPOSE TO BE A HEAVY DUTY TRUCK AND TO BE TOLD IT HAS A CRACKED FRAME AND WE CAN'T PINPOINT THE EVENT THAT CAUSED IT.  WE PURCHASED THIS TRUCK NEW SO WE ARE THE ONLY OWNERS, ANY IMPROVEMENTS TO THE TRUCK WERE DONE AT THIS DEALERSHIP.   THE BODY SHOP AT THE DEALERSHIP IS TELLING US THAT LIFTS AND DODGES DO NOT MIX YET I DO NOT RECALL EVER SEEING ANY WARNINGS OR BEING TOLD THIS.  I AM VERY CONCERNED THAT A HEAVY DUTY TRUCK COULD HAVE THIS TYPE OF DAMAGE AND WE HAVE TO REALLY THINK HARD OF SOME EVENT THAT COULD HAVE CAUSED THIS.  AGAIN, WE DO NOT HAVE AN EXACT DATE BECAUSE WHEN THE NOISE STARTED THERE WAS NOT A SIGNIFICANT EVENT AT THAT TIME.  NOISE STARTED AROUND THE 26TH OF JULY. *DT*JB",
        "vin": "3C63R3GL3EG"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/18/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120829,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION THAT STARTS AT 68 TO 73 MPH. REPLACED ALL TIRES-HAD BALANCED 3 TIMES-SWAPPED WHEELS AROUND. STILL A VIBRATION IN THE REAR OF TRUCK.CHECKED REAR SPRINGS , DRIVE SHAFT SEEM OK. THIS TRUCK HAS HAD A VIBRATION SINCE I BOUGHT IT, 4 YEARS OLD WITH 112,000 MILES I THOUGHT IT WAS JUST THE MIX MATCHED TIRES THAT WERE ON THE TRUCK.",
        "vin": "3C63RRGL9EG"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119012,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 27, 2018, THE ENGINE LIGHT AND MESSAGE APPEARED DURING A TRIP BACK FROM FREDERICKSBURG, VA, STATING 'SERVICE DEF SYSTEM. SEE DEALER'. WE STOPPED AT THE NEAREST AUTOZONE TO USE THE CODE READER. CODES P202E AND P207F APPEARED.     THE NEXT DAY JULY 28, 2018 WHILE DRIVING,  THE VEHICLE DISPLAYED A NEW MESSAGE.   '5 MPH MAX SPEED IN 140 MI SERVICE DEF SYSTEM SEE DEALER'.",
        "vin": "3C63RRGL9EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 65 MPH OR MORE, WHEN ANY DEVIATION IN ROAD OCCURS TRUCK WILL BOUNCE ALL OVER ROAD AND WILL BE UNABLE TO CONTROL UNTIL SPEED IS LOWERED TO 35 MPH . DEATH WOBBLE. THIS HAS HAPPENED SEVERAL TIMES.",
        "vin": "3C63R3FL4EG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109866,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V562000 (ENGINE AND ENGINE COOLING) AND 17V821000 (POWER TRAIN); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE DEALER (SMOLICH MOTORS, 1865 NE HWY 20, BEND, OREGON 97701) WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C63R3JL8EG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103038,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LARGEST AND MOST COSTLY HAS BEEN THE \"DEATH WOBBLE\", HAVE TO HAVE AN ALIGNMENT EVERY 3 MONTHS, HAD TO ADD A STABILIZER BAR TO SOMEWHAT CONTROL THE SITUATION BUT NOT FIXED IT, THIS HAS BEEN GOING ON SINCE 2016, HAPPENS IF VEHICLE HITS ANY KIND OF BUMP OR RUT AT MORE THAN 10MPH, ALSO HAVING ISSUES WITH WARNINGS TO HAVE THINGS SERVICED AND INSTRUMENT SCREEN CONTROLLING ITSELF OR NOT COMING ON, WHILE RUNNING OR IN MOTION FOR ALL OF THESE, HAS HAD MULTIPLE RECALLS,",
        "vin": "3C63RRJL7EG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101839,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V562000 (ENGINE AND ENGINE COOLING) AND 17V821000 (POWER TRAIN); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (TATE BRANCH DODGE CHRYSLER JEEP RAM, 4123 N LOVINGTON HWY, HOBBS, NM 88240) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C63RRKL6EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/27/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098233,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY OCCASIONALLY  WILL NOT BE RELEASED WHEN AUTO TRANSMISSION COLUMN SHIFT IS PLACED IN PARK AND ENGINE IS TURNED OFF",
        "vin": "3C63R3DL5EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "10/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090419,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V562000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT CALLED A LOCAL DEALER (RED RIVER DODGE CHRYSLER JEEP, 1060 HEBER SPRING RD, HEBER SPRINGS, AR 72543) AND WAS INFORMED THAT THE PART WAS UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "04/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084561,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DIE CASTING FOR SHIFT LEVER INSIDE COLUMN BROKE. PART APPEARS  TO BE MONKEY METAL AKA POT METAL. BREAK OCCURRED SHIFTING OUT  OF PARK TO DRIVE AT AN INTERSECTION. IT WAS STUCK IN PARK AND HAD   TO BE TOWED.",
        "vin": "3C63R3GL6EG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "02/06/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073889,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A RECALL ON THE TRACK BAR BRACKET IN 2016. THE DEALERSHIP DID NOT FIX IT THEN WHEN WE THOUGHT THEY DID, AND CLEARED IT OUT OF THE RECALL SYSTEM AS IF IT WAS FIXED. THE BRACKET BROKE IN 2018 AND THE DEALERSHIP REFUSES TO FIX IT BECAUSE THE TRUCK HAS AN AFTERMARKET LIFT. CHRYSLER WILL NOT HELP EITHER DUE TO THE LIFT. WE BOUGHT THE TRUCK THIS WAY, AND HAVE NO WAY TO TAKE THE LIFT OFF AS THEY ARE REQUESTING. WE WANT THE RECALLED PART FIXED. THE TRUCK HAS HAD A DEATH WOBBLE SINCE WE PURCHASED IT DUE TO THIS BRACKET. WHEN IT WAS STILL DOING IT AFTER WE TOOK IT TO THE DEALERSHIP IN 2016, WE CONTACTED THEM AND THEY TOLD US THEY DIDN'T KNOW WHY IT WOULD STILL BE DOING IT. AFTER IT BROKE WHILE WE WERE DRIVING ON THE HIGHWAY, WE REALIZED THE ORIGINAL BRACKET WAS STILL ON THE TRUCK. WHEN WE CALLED THE DEALERSHIP THEY ADMITTED TO ONLY DOING A VISUAL INSPECTION AND NOT CHANGING THE BRACKET IN 2016. WE TOOK IT BACK TO THEM AND THEY ARE NOW REFUSING TO FIX IT BECAUSE OF THE LIFT. THE LIFT DIDN'T CAUSE THE PROBLEM, AND THEY SHOULD FIX A FACTORY RECALL REGARDLESS OF AFTERMARKET PARTS.",
        "vin": "3C63RRNL2EG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "02/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067428,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE THE VEHICLE WAS AT THE DEALER (COLORADO SPRINGS DODGE, 7455 AUSTIN BLUFFS PKWY, COLORADO SPRINGS, CO 80923) FOR ROUTINE MAINTENANCE, THE CONTACT WAS INFORMED THAT THE BRAKE PADS AND ROTORS NEEDED TO BE REPLACED. DURING THE TEST DRIVE, THE BRAKE LINE RUPTURED. IT WAS DIAGNOSED THAT THE BRAKE LINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED.THE MANUFACTURER WAS NOTIFIED AND OPENED CASE NUMBER: [XXX]. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 50,577. *TT      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3C63R3KL0EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066465,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE AT HI-WAY SPEEDS WILL BEGIN TO SHAKE THE STEERING WHEEL AND THE ENTIRE VEHICLE VIOLENTLY UNTIL THE VEHICLE IS SLOWED SUFFICIENTLY TO BRING IT BACK UNDER CONTROL.  I HAVE ALSO NOTICED AN INCREASE IN STEERING WHEEL PLAY LEFT AND RIGHT.  THIS VEHICLE CURRENTLY HAS 94,000 MILES ON IT AND HAS NEVER BEEN USED OFF ROAD.  ALL HI-WAY MILES TOWING A FIFTH WHEEL .",
        "vin": "3C63R3NL6EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE VEHICLE WAS ABLE TO BE SHIFTED OUT OF PARK WHILE NOT BEING OPERATED. THE VEHICLE ROLLED DOWN A HILL AND THE CONTACT WAS ABLE TO MANUALLY STOP THE VEHICLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V821000 (POWER TRAIN); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. WOODHOUSE CHRYSLER DODGE JEEP RAM (2171 US-30, BLAIR, NE) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 61,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C63RRJL8EG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "12/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065286,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V562000 (ENGINE AND ENGINE COOLING). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE, BUT THERE WAS NO DATE AS TO WHEN THE PARTS WOULD BE AVAILABLE. THE VIN WAS NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2018",
        "dateOfIncident": "10/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057811,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MORE THAN A DOZEN OCCASIONS, WHILE AT A RED LIGHT, FOOT ON THE BRAKE PEDAL, THE TRUCK HAS LERCHED FORWARD AND THEN SHUTOFF.  ON OTHER OCCASIONS, WHILE SITTING AT A RED LIGHT, IT WILL IDLE ROUGH FOR ABOUT 2 SECONDS, THE RPM WILL JUMP 200-300RPM, BUT NOT ENOUGH TO CAUSE THE TRUCK TO MOVE, AND THEN SHUT OFF.  IF I CAN REACT QUICK ENOUGH AND PUT IT IN NEUTRAL, IT WILL STAY RUNNING",
        "vin": "3C63R2JLXEG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2017",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057153,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL T51   I'M DEEPLY CONCERNED THAT ITS BEEN TWO MONTHS SINCE I RECEIVED A LETTER FROM THE NHTSA IN REFERENCE TO A RECALL # ( T51 )  THAT MY TRUCK NEEDS TO GET DONE, TO AVOID A POTENTIAL RISK THAT COULD LEAD TO INJURY OR EVEN DEATH, FOR ME THE DRIVER, OR ANY PASSENGER. NHTSA STATED ON THAT LETTER, THAT A REPAIR MUST BE DONE BY THE MANUFACTURER, AS SOON AS POSSIBLE, TO AVOID POSSIBLE TRAGEDY. IT'S BEEN TWO MONTHS THAT I HAVE BEEN CALLING CONSISTENTLY AND VERY WORRIED ABOUT THIS ISSUE, TO MY CLOSEST RAM DEALERSHIP, IN LAS VEGAS, NEVADA. UNFORTUNATELLY EVERY TIME I CALL, THEY TELL ME THAT I HAVE TO WAIT UNTIL THE PARTS ARE AVAILABLE. I CALL THE MANUFACTURER AND THEY TOLD ME THA SAME, THAT THE PARTS ARE NOT AVAILABLE. SO I'M WRITING TO EXPRESS MY GREAT CONCERN THAT, BOTH THE DEALERSHIP AND THE MANUFACTURER ARE NOT TAKING THIS ISSUE SERIOUSLY ENOUGH, BECAUSE THEY EVEN TOLD ME, THAT IF I'M NOT EXPERIENCING ANY PROBLEMS ON MY CAR, I SHOULD NOT WORRY. I GUESS THAT I HAVE TO WAIT UNTIL THERE IS A FATALITY TO START WORRYING ABOUT IT. I HAVE TO SAY THAT SINCE I RECEIVED THE FIRST LETTER FROM NHTSA REGARDING THIS ISSUE BACK IN NOVEMBER 2017, IT'S BEEN 2 MONTHS THAT I FEEL THAT I'M DRIVING IN A CONSTANT FEAR. THE PARTS THAT NEEDS TO BE REPLACED, IS A WATER PUMP ON THE ENGINE, AND FOR THE DEALERSHIP AND THE MANUFACTURER TO TELL US AFTER 2 MONTHS, THAT THEY DON'T HAVE THE PART AVAILABLE, IS A TOTAL LACK OF RESPECT TOWARDS EVERY DRIVER AFFECTED. IT IS A LONG TIME THAT ALL PEOPLE AFFECTED ARE STILL DRIVING AT RISK OF A POSSIBLE FATALITY. PLEASE DO SOMETHING ABOUT THIS BEFORE IT'S TOO LATE.",
        "vin": "3C63R3FL2EG"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2017",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054530,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, HEARD LOUD POP. LOST STEERING AND BREAKING ABILITY. MY HUSBAND NOTICE THE WATER PUMP HAD BLOWN AND THE BELT WAS SHREDDED. DODGE SAID THE WATER PUMP WAS ON RECALL. THEY REPLACED IT WITH ANOTHER RECALLED WATER PUMP AND REFUSED TO REPLACE THE BELT AND ANY FLUIDS ALTHOUGH THEY WERE A RESULT OF THE PUMP. CONCERNED THAT THIS WILL HAPPEN AGAIN AND CAUSE WRECK.",
        "vin": "3C63RRGL3EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052743,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK INSIDE WHEEL APPROXIMATE TO VALVE STEM CAUSING LIW AIR PRESSURE. HAD I NOT CAUGHT IT IN TIME THIS COULD HAVE BEEN CATASTROPHIC.  HALF A MILLION OF THESE TRUCKS ARE SOLD EVERY YEAR, WHICH EQUALS 3 MILLION MORE IF THESE MEXICAN STEEL RIMS ON THE ROAD WHICH THE SAME POTENTIAL!!!  AND THE CHEAPLY CONSTRUCTED RIMS ARE MOUNTED IN A LESS THAN SUFFICIENT SUSPENSION SYSTEM.",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052631,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT STEER WHEEL SPLIT, ALLOWING AIR TO ESCAPE CREATING A SEVERER PULL TO THE RIGHT.  THANKFULLY, THE WHEEL DID NOT COME COMPLETELY APART OR THIS COULD HAVE BEEN CATASTROPHIC, AS I DRIVE NATIONWIDE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "10/25/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045897,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND RECEIVED A RECALL FOR A WATER PUMP FAILURE THAT MAY RESULT IN ENGTINE FIRE OR RISK OF INJURY TO OCCUPANTS AND WAS ALSO INFORMED THEIR IS NO REMEDY FOR THIS CONDITION SERVICE IS CURRENTLY NOT AVAILABLE.  DOES THIS MEAN RAM WELL BE RESPONSIBLE OF ANY INJURY THAT MAY OCCUR.  A RECALL FOR A DANGEROUS CONDITION BUT NO FIX AVAILABLE",
        "vin": "3C63RPKL1EG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2017",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045340,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER PUMP SEIZED UP AND CAUSED BELT TO BREAK LEAVING NO POWER BRAKES OR STEERING WHILE TRAVELING DOWN THE INTERSTATE!! I GOT THE RECALL FOR THE WATER PUMP BUT CAUSING A FIRE LIKE THE RECALL SAYS DOES NOT DESCRIBE THE SERIOUSNOUS OFF THIS DEFECT!  IS THE ONE THEY REPLACED IT WITH IN JUNE OF 2016 GOING TO DO THE SAME THING???",
        "vin": "3C7WRTCL2EG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/28/2017",
        "dateOfIncident": "09/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030275,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ORDERED AND PURCHASED OUR 2014 DODGE RAM WORK TRUCK IN MARCH OF 2014.  IN 3 1/2 YEARS THIS TRUCK HAS BEEN HAS BEEN IN DEALER SHOP FOR (4) RECALLS AND MULTIPLE STEERING, ALIGNMENT, AND SUSPENSION ISSUES.  WHEN DRIVING DOWN THE ROAD, STEERING WOULD CEASE TO RESPOND, CREATING A DANGEROUS SITUATION WHEN DRIVING.  HAPPENED TWICE IN 2 WEEKS.",
        "vin": "3C7WRTBL8EG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025264,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPENSION IS INSUFFICIENT FOR WEIGHT OF ENGINE CREATING A DANGEROUS STEERING SITUATION WHILE IN MOTION ON ANY SURFACE ON OR OFF ROAD, STRAIGHT AHEAD OR TURNING.  CUMMINGS 6.7L ENGINE IS TWICE THE WEIGHT OF THE HEMI ENGINE NORMALLY MOUNTED ON THIS 1500 RAM SUSPENSION SYSTEM",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2017",
        "dateOfIncident": "08/21/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018682,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CODE U05A5 DEALER SAYS IT IS NOT COVERED UNDER THE RECALL FOR THE 15'S. I BOUGHT NEW SO THIS WOULD BE MY COST.",
        "vin": "3C7WR9CL8EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2017",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012580,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED A CATASTROPHIC FAILURE OF THE RUBBER PORTION OF THE FAN SHROUD ON MY 2014 RAM 3500 WITH THE 6.7 CUMMINS DIESEL ENGINE. WHILE TOWING MY 5TH WHEEL UP A GRADE, THE FAN CLUTCH WAS ENGAGED AND THE TRUCK DOWN-SHIFTED. A SHORT TIME LATER I HAD A STRONG VIBRATION AND NOISE COMING FROM THE FRONT OF THE TRUCK. THE NOISE WENT AWAY, AND THEN THE SAME THING HAPPENED ONE MORE TIME. I TOOK THE TRUCK TO MY LOCAL DEALER FOR INSPECTION, AND FOUND THAT THE BOTTOM PORTION OF THE RUBBER-LIKE FAN SHROUD WAS TORN APART AS THE RESULT OF CONTACT WITH THE ENGINE COOLING FAN. THIS IS AN INTERNALLY WELL-KNOWN ISSUE WITH CHRYSLER/FIAT/RAM AS REFERENCED BY THEIR STAR CASE #S1307000002. THEY HAVE REFUSED TO FIX IT UNDER ANY SORT OF FACTORY WARRANTY, EVEN THOUGH IT IS A KNOWN ISSUE AND EVEN ACKNOWLEDGED THAT IT MAY HAVE BEEN INSTALLED INCORRECTLY AT THE FACTORY (WHICH IS STATED IN THEIR STAR CASE). A QUICK SEARCH ONLINE HAS SHOWN THIS AS A WIDESPREAD ISSUE, WITH SOME FARING MUCH WORSE DESTRUCTION AND DAMAGE THAN MYSELF. THE MANUFACTURER NEEDS TO BE HELD RESPONSIBLE, AND A TRUE FIX NEEDS TO BE IMPLEMENTED BEFORE SOMEONE GETS HURT!",
        "vin": "3C63R3DL6EG"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011777,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK HAS THE \"DEAD PEDAL\" ISSUE. IF STOPPED AT A LIGHT AND YOU GO TO TAKE OFF THERE IS ABOUT A 3-5 SECOND DELAY BEFORE YOU GET POWER TO MOVE FORWARD. ALSO, IF YOU ARE DRIVING AND LET OFF THE GAS PEDAL AND THEN HAVE TO PRESS THE GAS PEDAL TO GO AGAIN THERE IS A LONG DELAY THERE AS WELL. THIS IS A SERIOUS SAFETY CONCERN WHEN TRYING TO MERGE ONTO A HIGHWAY OR PASS A SLOW VEHICLE. THERE HAVE BEEN MANY THAT HAVE FILED THIS COMPLAINT, WHEN DOES SOMETHING ACTUALLY START TO GET FIXED?",
        "vin": "3C63RRLL1EG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "07/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010906,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED ACCELERATION LAG OR DEAD PEDAL AS OTHERS REFER TO IT. IN AN INTERSECTION READY TO TURN, PLENTY OF TIME TO CROSS TO THE LEFT BEFORE ONCOMING TRAFFIC. START TO TURN STEP ON THE GAS AND NOTHING FOR 2 A 3 SECONDS. ABOUT HAD A HEART ATTACK RIGHT THERE. ONCOMING TRAFFIC SLAMS ON THEIR BRAKES, LAYS ON HORN AND GESTURES AT ME WITH THEIR MIDDLE DIGIT AS MY TRUCK FINALLY ACCELERATES OUT OF THE WAY.",
        "vin": "3C63RRJL1EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006162,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RECALL FOR TRACK BAR WELDS WAS REPAIRED THE FRONT DIFF COVER AND A BOLT CONTACT THE INSTALLED BRACKET CAUSING THE FRONT DIFF COVER TO PEAL AND ROLL AWAY FROM HOUSING. IN MOTION",
        "vin": "3C63RRJL8EG"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,POWER TRAIN,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006149,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT WHILE DRIVING ABOUT 65 MPH, THE VISION, FUEL, AND EMISSION WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER AT: GLENBROOK DODGE, FT. WAYNE, IN, WHERE THE TECHNICIAN DIAGNOSED A DEF HARNESS FAILURE. THE TECHNICIAN PLUGGED NEW ENDS TO THE HARNESS BUT THE FAILURE RECURRED. THE VEHICLE WAS RETURNED TO THE DEALER BUT AND WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE PART WOULD NOT BE AVAILABLE UNTIL AUGUST. THE CONTACT STATED THAT THE MANUFACTURER DID NOT PROVIDE A RENTAL VEHICLE. THE FAILURE MILEAGE WAS 62,191.",
        "vin": "3C63RPHL7EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006167,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SIDE TIRE IS MORE THEN 5 DEGREES OUT OF CAMBER CAUSING THE TIRE PULL, CREATE MORE HEAT, AND WEAR OUT. I CONTACTED DEALER AND WAS INFORMED RAM DOESN'T HAVE A CAMBER ADJUSTMENT SO THERE'S NO WAY TO CORRECT IT WITH OUT PUTTING AFTERMARKET BALL JOINTS IN I NOTICED IT AT LESS THEN 5000 MILES",
        "vin": "3C63RRJL8EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/08/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993909,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE EXTENDED WARRANTY FOR MY 2014 RAM 35000 LONGHORN FROM DON VANCE DODGE IN MARSHFIELD MISSOURI IN FEBRUARY 2016 WHEN I BOUGHT THE TRUCK FROM THEM. WITHIN 10,000 MILES I NOTICED THAT THE RIGHT FRONT TIRE ON THE OUTER EDGE IS WEARING. I BROUGHT IT TO A LOCAL MECHANIC WHO RAISED THE TRUCK WITH A FLOOR JACK AND CHECKED THE TIRE. HE SHOWED ME HOW THE TIRE WOULD MOVE BACK AND FORTH AND SAID THAT THE UPPER BALL JOINT WAS BAD. I CHECKED IT ALSO AND IT HAD A LOT OF PLAY. I MADE AN APPOINTMENT WITH DON VANCE DODGE IN MARSHFIELD MISSOURI FOR THE WARRANTY WORK TO BE PERFORMED. THE SERVICE MANAGER CAME BACK ABOUT 3 1/2 HOURS LATER AND TOLD ME THAT THE BALL JOINT WAS GOOD AND WITHIN SPECS. I ARGUED WITH HIM ABOUT IT AND EXPLAINED THE ABOVE AGAIN TO HIM. HE REFUSED TO CHECK THE BALL JOINT AGAIN WITH A FLOOR JACK AND TOLD ME TO LEAVE. I WENT OVER AND SPOKE WITH THE MANAGER OF THE DEALERSHIP WHO SOLD ME THE TRUCK AND EXPLAINED WHAT JUST HAPPENED AND SHOWED HIM THE TIRE. THERE IS NO CAMBER ADJUSTMENT FOR THIS TRUCK AND EXPLAINED HOW THE BALL JOINT WAS BAD. HE ASKED ME TO CALL BACK TOMORROW AND SPEAK WITH THE GENERAL MANAGER.  THIS IS ONLY 1 OF 3 DEALINGS I'VE HAD WITH THIS SERVICE DEPARTMENT. ALL IN WHICH THEY WERE WRONG AND TRYING TO MAKE ME PAY FOR WARRANTY WORK WHICH THEY REFUSED TO FIX.",
        "vin": "3C63RRKLXEG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "05/16/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985985,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK AT FACTORY HIGH IDLE,  PARKED IN DRIVEWAY AC ON MAX COOL AND THE FAN CLUTCH ENGAGEMENT CAUSED THE RUBBER FAN SHROUD TO SUCKED INTO THE ENGINES COOLING FAN. RAM STAR CASE #: 1307000002. JUST PURCHASED USED, AND THERE ISNT EVEN A BOLT TO SECURE THE FAN SHROUD MAKING IT EVEN MORE SUSCEPTIBLE TO BECOME INTANGLED AND PUNCTURE OF THE RADIATOR IS THE RESULT. VEHICLE IF MOVING COULD CAUSE ENGINE FAILURES DUE TO EXTREMELY POOR DESIGN OF SOFT PLYABLE RUBBER TO BE IN A HIGH VOLUME NEGATIVE PRESSURE SITUATION. LOSS OF BRAKES AND STEERING COULD SOON FOLLOW. RAM KNOWS OF THE ISSUE YET DECLINES TO FIX UNDER POWER TRAIN WARRANTY BECAUSE THE RADIATOR AND ENGINE COOLING FAN DOESNT FALL UNDER POWERTRAIN, YET IT IS AS IMPORTANT OR MORE IMPORTANT THAN ENGINE LUBRICATION AND SAFETY OF OCCUPANTS IN THE VEHICLE IF DESCENDING A MOUNTAIN PASS PULLING A HEAVY LOAD WHICH COULD RESULT IN LOSS OF LIFE.",
        "vin": "3C63RRGL4EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10982992,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT AN ABNORMAL NOISE WAS HEARD COMING FROM THE VEHICLE. ALSO, WHILE THE VEHICLE WAS STOPPED, THE CONTACT HAD TO DOWNSHIFT DUE TO THE FAILURE. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC TESTING. THE DEALER HAD THE VEHICLE FOR LONGER THAN TWO WEEKS AND THE CONTACT WAS UNCERTAIN AS TO WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 18,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/30/2017",
        "dateOfIncident": "04/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981516,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRYING TO PULL OUT AT STOP SIGN, OR GREEN LIGHT TRUCK DOE NOTHING FOR @3 SECONDS. WE CALL IT DEAD PEDAL. MANY MORE PEOPLE HAVE SAME PROBLEM. DODGE SEEMS TO THINK THIS IS NORMAL, BUT IT IS NOT. VERY DANGEROUS SITUATION WHEN TRYING TO PULL OUT INTO TRAFFIC WITH YOUR FAMILY IN THE VEHICLE. THIS VEHICLE HAS A DIESEL ENGINE AND SHOULD HAVE A LOT OF POWER TO PULL OUT EMPTY.",
        "vin": "3C63R3DL1EG"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969834,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW ENGINE RPM THROTTLE RESPONSE FROM DEAD STOP OR ROLLING PACE (5-35 MPH) EXPERIENCES 3-5 SECOND LAG BEFORE ENGINE RESPONDS AND ACCELERATES. THIS HAS CAUSED NUMEROUS CLOSE CALLS WHEN TURNING IN FRONT OF ONCOMING TRAFFIC ON CLEAR ROAD CONDITIONS. TO COMPENSATE, MY DRIVING HABITS HAVE RESORTED TO \"POWER BRAKE\" THE VEHICLE TO INCREASE ENGINE RPM'S IN ORDER TO ACCELERATE AND CLEAR ONCOMING TRAFFIC. I HAVE OWNED/DRIVEN 3/4 & 1 TON CUMMINS DIESEL VEHICLES PRIOR TO MY 2014 MODEL WITH NO SIMILAR ISSUES. WHEN TOWING, THE ISSUE IS MUCH LESS NOTICEABLE. AT THIS POINT I AM READY TO SELL AND BUY ANOTHER BRAND DUE TO SAFETY CONCERNS. MY WIFE DOES NOT FEEL SAFE DRIVING OR RIDING IN THE VEHICLE AND IS CONCERNED THAT I TRANSPORT OUR KIDS TO AND FROM SCHOOL DAILY IN THE VEHICLE. ONLINE RESEARCH INDICATES THIS IS A COMMON ISSUE WITH THIS MODEL/YEAR GROUP AND HAS COINED THE CONDITION AS \"DEAD PEDAL\". IT SEEMS THAT THIS DEAD PEDAL CONDITION CONTINUES TO WORSEN WITH MY VEHICLE THE MORE IT IS DRIVEN. NOT SURE WHAT NEXT STEPS ARE HERE, I EXPLAINED MY EXPERIENCES TO MULTIPLE SERVICE TECHS AND LARRY H MILLER DODGE IN SANDY UT, WHERE I HAVE THE VEHICLE SERVICED... IT WAS THE \"FIRST TIME THEY HAD HEARD OF IT\" RESPONSE EACH TIME. NO HELP TO BE FOUND AT THE DEALERSHIP. NOT SURE WHERE ELSE TO TURN FOR HELP WITH MY ~$60K VEHICLE THAT MYSELF AND FAMILY DON'T FEEL SAFE DRIVING.",
        "vin": "3C63R3JL4EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968851,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2014 RAM 3500 THAT STARTED LEAKING WATER THROUGH THE THRID BRAKE LIGHT ON THE BACK OF THE CAB.  THIS IS A KNOWN PROBLEM ON THESE TRUCKS AND I KNOW HAVE MOLD GROWING ON THE INSIDE OF MY TRUCK.  I ALSO HAVE WATER DAMAGE TO THE INSIDE OF THE HEADLINER, BUT THIS IS THE LEAST OF MY WORRIES.  MY TRUCK WAS MANUFACTURED IN 8/2014 AND I STARTED NOTICING THIS PROBLEM IN FEBRUARY OF THIS YEAR.  I HAVE STARTED A CLAIM WITH CHRYSLER, HOWEVER THEY WANT ME TO PAY 200.00 TO REPLACE THE CARPET.  MY TRUCK DOES HAVE 46000 MILES ON IT BUT IT IS ONLY 2 1/2 YEARS OLD.  THIS IS NOT A PLACE THAT SEES ANY WEAR.  MY CONCERN IS THAT THIS IS A HEALTH ISSUE.  I HAVE ASTHMA AND AVE BEEN HAVING RESPIRATORY ISSUES SINCE JANUARY OR THIS YEAR.  I HAVE CONTACTED MOLD REMOVAL SPECIALIST (MULTIPLE) AND ALL HAVE SAID THAT DUE TO THE SPORES THAT MOLD RELEASES THAT ANY POROUS MATERIAL IN THE TRUCK WOULD HAVE TO BE REMOVED AND REPLACED AND THEN THE TRUCK WOULD HAVE TO BE TREATED WITH A FUNGICIDE.  THIS IS MY ONLY VEHICLE AND HAVE A 1 YEAR OLD SON.  I WILL NOT PUT HIM IN THIS TRUCK UNTIL I KNOW IT IS SAFE.  THIS IS NEGLIGENT ON CHRYSLERS BEHALF AND I KNOW HAVE A $66000 TRUCK THAT IS NOT SAFE TO BE IN.  I WOULD LIKE CHRYSLER TO EITHER FIX THE PROBLEM THE RIGHT WAY OR PURCHASE BACK THE VEHICLE.  THIS IS NOT SAFE FOR MY FAMILY OR ME TO BE IN.",
        "vin": "3C63R3ML7EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/30/2017",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948479,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE DRIVING APPROXIMATELY 25 MPH, THE CONTACT HEARD AN ABNORMAL NOISE. THE STEERING PULLED TO THE LEFT AND RIGHT AND THE CONTACT LOST CONTROL OF THE VEHICLE. THE CONTACT WAS ABLE TO MERGE THE VEHICLE TO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE REAR PASSENGER SIDE HUB ASSEMBLY HAD TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 22,000.",
        "vin": "3C6URVHD7EE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944070,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER RECALL #: R46  NHTSA RECALL #:  15V-541  I TOOK MY RECALL NOTICE AND RAM 3500 2014 TO THE DEALER TO HAVE THE RECALL FIX INSTALLED. DEALER NOTIFIED ME THAT CHRYSLER ENGINEERS WOULD NOT ALLOW THEM TO INSTALL THE RECALL/FIX BECAUSE THE TRUCK HAS THE WRONG FRAME INSTALLED. SINCE THE TRUCK WILL NEED TO BE TAKEN APART AND REBUILT IN THE FIELD I EXPRESSED MY CONCERNS AND OPENED A CASE WITH THE CHRYSLER CUSTOMER ASSISTANCE CENTER.  A TRUCK REPLACEMENT WAS SUGGESTED AND I AGREED. I WOULD LIKE YOUR HELP SINCE NOTHING HAS BEEN DONE SINCE THIS DECISION THAT HAPPENED ALMOST 6 WEEKS AGO. CHRYSLER ENGINEERS EXPRESSED CONCERNS SINCE THIS IS A SAFETY ISSUE SO I AM AFRAID TO DRIVE MY TRUCK.",
        "vin": "3C63R2BJXEG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2016",
        "dateOfIncident": "11/25/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929592,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED ON DIFFERENT OCCASIONS A STRONG SMELL OF DIESEL EXHAUST COMING INTO THE CAB OF MY TRUCK. IT DOES NOT SMELL LIKE THE EXHAUST EXITING THE REAR TAILPIPE (POST DPF/CATALYST). EACH TIME IT HAS HAPPENED, IT HAS BEEN WHEN I WAS STOPPED OR MOVING SLOW IN BOTH FORWARD OR REVERSE (ON A STREET, OR BACKING INTO A PARKING SPOT). THE FIRST COUPLE OF TIMES I THOUGHT IT WAS A SMELL COMING FROM A DIFFERENT VEHICLE, BUT THEN I FOUND THAT IT WAS HAPPENING WHEN THERE WERE NO OTHERS AROUND. I DID A QUICK INTERNET SEARCH, AND IT SEEMS AS THOUGH THIS IS A WIDESPREAD ISSUE.  *TR",
        "vin": "3C63R3DL6EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919932,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C7WRSAL1EG"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/27/2016",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919692,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE TWO FRONT TIRES BECAME WORN APPROXIMATELY EVERY THREE MONTHS, WHICH CAUSED THE FRONT END TO WOBBLE. THE VEHICLE WAS TAKEN TO TWO DEALERS FOR AN ALIGNMENT. THE TECHNICIANS FOUND NO ISSUES WITH THE ALIGNMENT. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "3C63RRNL5EG"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "10/20/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917462,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN ABSOLUTE DANGEROUS AMOUNT OF \"DEAD PEDAL\" BUILD INTO THE ECM TUNING ON THE  2011 AND UP CUMMINS TRUCKS WITH THE 6.7 DIESEL. TRYING TO PULL OUT ONTO THE HIGHWAY OR PASS SOMEON IS DOWNRIGHT DANGEROUS. YOU CAN PUT THE PEDAL TO THE FLOOR AND THE TRUCK JUST CUTS OUT AND GOES NOWHERE FOR UP TO 5 SECONDS COMPLETELY LOSING MOMENTUM. SOMETHING NEEDS TO BE DONE ABOUT THIS I AM NOT THE ONLY PERSON WITH THIS COMPLAINT.",
        "vin": "3C63RRML0EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VIBRATES/SHAKES AT AROUND 40 M.P.H. AND AGAIN AROUND 70-80 M.P.H. THIS HAPPENS ON ANY ROAD TYPE. I DON'T KNOW IF A SUSPENSION OR DRIVELINE ISSUE. I NOTICED IT SHORTLY AFTER BUYING IT, AND SEEMS IT GETS WORSE BY THE MILE. I HAVE REPLACED TIRES WITH MICHELINS AND ROAD FORCE BALANCED SEVERAL TIMES. CURRENTLY THE DEALER AND CHRYSLER/RAM DOESN'T KNOW WHAT IS CAUSING IT, THEREFOR DOESN'T KNOW HOW TO FIX IT. THE DEALER HAS HAD THE TRUCK SEVERAL DAYS OVER THE LAST SEVERAL MONTHS.",
        "vin": "3C63R3JL5EG"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "03/11/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915111,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2014 RAM 3500 TURBO DIESEL. THE COMPUTER SYSTEMS HAVE REQUIRED NUMEROUS UPDATES AND HAVE FAILED 3 TIMES WHEN TRAVELLING. THE BRAKES FAILED WHEN NEW AND A COMPUTER UPDATE FIXED THAT AFTER I HAD AN ACCIDENT. THE PCM ENGINE CONTROLLER FAILED AT 20,000 AND SHUT US DOWN WHILE TOWING A LARGE 5TH WHEEL. IN JULY 2016 THE PCM FAILED AND THE DEF WOULD NOT FEED; AGAIN BROKEN DOWN WITH A LARGE 5TH WHEEL ATTACHED TO THE TRUCK. ON OCTOBER 8, 2016 AT 41,700 MILES  THE DEF SYSTEM HAS FAILED AGAIN LEAVING US STRANDED AGAIN WHILE ON THE ROAD. IT IS EXTREMELY DANGEROUS TO BE STUCK BESIDE THE HIGHWAY WITH A BROKEN DOWN TRUCK DUE TO REPEATED COMPUTER FAILURES. THIS PROBLEM IS ALSO LIMITING OUR TRAVEL PLANS BECAUSE OF THE FEAR AND DANGER ASSOCIATED WITH AN UNRELIABLE TRUCK.  I THINK THAT THIS TRUCK SHOULD BE RETURNED TO THE DEALER AND WE SHOULD BE GIVEN A NEW TRUCK.",
        "vin": "3C63R3HL2EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903838,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16E039000 (ELECTRICAL SYSTEM, EXTERIOR LIGHTING) OVER SIX MONTHS AGO. THE DEALER WAS UNABLE TO SUPPLY THE PART WITHIN A REASONABLE TIME FRAME. THE MANUFACTURER WAS UNABLE TO PROVIDE A REASONABLE TIME FRAME TO SUPPLY THE PARTS TO THE DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 11/01/16*LJ  THE CONSUMER STATED THE DEALER INSPECTED THE VEHICLE AND INFORMED THE CONSUMER, THE VEHICLE DID NOT HAVE THE RECALLED COMPONENT. UPDATED 12/13/16.*JB",
        "vin": "3C7WRVLG2EE"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899737,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, THE ELECTRONIC STABILITY CONTROL (ESC) WARNING LIGHT ILLUMINATED ON THE DASHBOARD AND THE VEHICLE BECAME DIFFICULT TO CONTROL. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO A DEALER BUT HAD NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS ABOUT 62,000.",
        "vin": "3C6URVJD2EE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "12/18/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896022,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE SPRING MOUNT FRACTURED AND SEPARATED FROM THE SUBFRAME. THE CONTACT STATED THAT THE SPRING MOUNT WAS NOT PROPERLY WELDED TO THE SUBFRAME. THE CONTACT STATED THAT THE MOUNT WAS WELDED IN THREE SEPARATE LOCATIONS ON THE SUBFRAME; HOWEVER, TWO OF THE WELDS FRACTURED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 29,300.",
        "vin": "3C63R3GL0EG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "01/13/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894235,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "R46/NHTSA 15V-541. THIS RECALL CONCERNS THE FRONT SUSPENSION TRACK BAR FRAME BRACKET WELDS. I HAVE RECEIVED THREE WRITTEN SAFETY RECALLS FROM FCA US LLC; AND HAVE TAKEN MY TRUCK INTO MY DEALER; PRESTIGE CHRYSLER IN LAS VEGAS, NEVADA AT LEAST SIX TIMES; EACH TIME THEY TELL ME THEY HAVE THE BRACKETS TO WELD ON THE TRUCK; AND THEN WHEN I PICK THE TRUCK UP THEY TELL ME THAT THEY COULDN'T DO IT BECAUSE THE ONLY BRACKETS THEY HAVE ARE FOR THE FOUR WHEEL DRIVE TRUCK. THIS CONCERNS ME BECAUSE THIS IS A ONE TON DIESEL DUALLY TRUCK THAT I USE TO TOW MY FIFTH WHEEL TRAILER. THE POSSIBILITY OF HAVING AN ACCIDENT WHILE ON THE HIGHWAY WHILE TOWING A HEAVY TRAILER IS NOT SOMETHING THAT I WANT TO BE CONSTANTLY WORRIED ABOUT. THE DEALER KEEPS TELLING ME THAT CHRYSLER HASN'T SENT THE BRACKETS; BUT THIS IS THE THIRD RECALL I HAVE RECEIVED IN THE MAIL SINCE JANUARY FROM FCA US LLC.",
        "vin": "3C63RPGL2EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884977,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE FRONT SUSPENSION FRAME BRACKET FAILED. WHILE DRIVING 60 MPH, THE VEHICLE SHOOK UNCONTROLLABLY. THE CONTACT WAS ABLE TO MOVE THE VEHICLE OVER TO THE SHOULDER OF THE ROAD. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT SUSPENSION FRAME BRACKET FRACTURED DUE TO SEVERE CORROSION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 39,000.",
        "vin": "3C63RPGL2EG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/07/2016",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884765,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWER MOTOR RESISTOR FAILED CAUSING BLOWER MOTOR TO BURN AND THUS BURNING BACK TO THE WIRING HARNESS. SMOKE BEGAN COMING OUT FROM BEHIND THE HEATER AND RADIO KNOBS. AIR CONDITIONER WAS ON, BUT WHEN TURNED OFF IT CONTINUED TO BLOW. RADIO AND AIR/HEATER PANEL BECAME HOT TO TOUCH. INSTRUMENT CLUSTER LIGHTS BEGAN FLASHING.     INCINDENT HAPPENED ONLY A FEW BLOCKS AWAY FROM DEALERSHIP. VEHICLE WAS DRIVEN TO DEALER AND TURNED OFF. BATTERY WAS DISCONNECTED AND FIRE SELF-EXTINGUISHED.",
        "vin": "3C63RRGL7EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884800,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER FRONT TIRE WEARS ON THE OUTSIDE. PROBLEM WAS FIRST OBSERVED WITH LESS THAN 6,000 MILES. DEALERSHIP IN FAIRBANKS, AK CONTINUED TO POINT OUT THAT TIRES NEEDED TO BE ROTATED MORE OFTEN. TIRES WERE REGULARLY ROTATED. DEALERSHIP AND INDEPENDENT SHOP STATED THAT VEHICLE WAS IN ALIGNMENT AND DID NOT NEED WORK. ORIGINAL TIRES WERE REPLACED WITH HIGH QUALITY TIRES 16,000 MILES AGO. TIRES HAVE BEEN ROTATED TWICE SINCE THEN AND THERE IS SIGNIFICANT WEAR ON THE TIRES THAT HAVE BEEN IN THAT POSITION.",
        "vin": "3C63RRGL7EG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "05/24/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882032,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 24, 2016, I WAS STOPPED FOR A ROADSIDE DOT INSPECTION.  THAT INSPECTION REVEALED THAT THE BRAKE LIGHTS ON MY TRUCK WERE NOT WORKING.  ALL OTHER LIGHTS WERE OPERABLE, TURN SIGNALS, PARKING LIGHTS, TAIL LIGHTS, REVERSE LIGHTS, EMERGENCY FLASHERS.  HOWEVER THE BRAKE LIGHTS ON THE TRAILER I WAS TOWING WERE OPERATING PROPERLY.AS WERE ALL OTHER LIGHTS ON THE TRAILER.  AFTER ATTEMPTING REPAIRS MYSELF, CHECKING FUSES, INSPECTING WIRING, REPLACED BRAKE LIGHT CONTROL SWITCH, I TOOK THE TRUCK TO A RAM DEALER FOR REPAIRS.  THE TRUCK WAS TAKEN TO THE RAM DEALER MAY 31, 2016.  I AM TYPING THIS ON JULY 1, 2016.  THE DEALER HAS NOT BEEN ABLE TO MAKE REPAIRS AND STILL HAS THE TRUCK.  THE SERVICE MANAGER SAYS IT IS THE ABS BRAKE CONTROL MODULE THAT IS THE MALFUNCTION BUT THEY STILL HAVE NOT BEEN ABLE TO AFFECT A REPAIR.  THE DEALER HAS HAD THE TRUCK FOR MORE THAN A MONTH.",
        "vin": "3C7WRTBL4EG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "05/30/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881595,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nexen Tire Corporation",
                "productMake": "NEXEN",
                "productModel": "RODIAN HT",
                "productYear": "9999",
                "size": "P245/75R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500 EQUIPPED WITH NEXEN RODIAN HT XRX5 TIRES, SIZE: LT235/80/R17 (NA). WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE SHOOK. THE CONTACT NOTICED THAT BOTH FRONT TIRES EXPERIENCED TREAD SEPARATION. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THE TIRES WERE REPLACED. THE FAILURE RECURRED TO THE REAR PASSENGER TIRE. THE REAR PASSENGER TIRE WAS NOT REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE MANUFACTURER STATED THAT THE TIRES WERE ENTRY LEVEL TIRES AND SHOULD NOT BE ON THE VEHICLE. THE APPROXIMATE VEHICLE AND TIRE FAILURE MILEAGE WAS 6,500.",
        "vin": "3C63RRGL8EG"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2016",
        "dateOfIncident": "12/26/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874217,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE DRIVING 65 MPH, THE VEHICLE STALLED AND ALL THE WARNING LIGHTS ON THE INSTRUMENT CLUSTER ILLUMINATED. THE DRIVER WAS ABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT A MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE CONTACT WAS UNSURE ABOUT WHAT PART WAS REPAIRED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000. UPDATED 08/30/16*LJ",
        "vin": "3C6URVJD2EE"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "06/10/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872803,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE FRONT TIRES WERE WORN OUT PREMATURELY. IN ADDITION, ALL THE INTERIOR LIGHTS FLICKERED AND THE VOLUME FOR THE RADIO INCREASED AND DECREASED INDEPENDENTLY. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER WHO WAS UNABLE TO DIAGNOSE OR REPAIR THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 20,000.",
        "vin": "3C63RRNL5EG"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/12/2016",
        "dateOfIncident": "03/31/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10854977,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A HEAD-ON COLLISION AT 35 MPH AND THE VEHICLE THAT STRUCK ME WAS TRAVELING AT 50MPH. NONE OF THE AIRBAGS IN MY VEHICLE DEPLOYED AND THIS HAS ME VERY CONCERNED.",
        "vin": "3C63RRGL8EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "03/13/2016",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852954,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE THE VEHICLE WAS PARKED, IT CAUGHT ON FIRE. PRIOR TO THE FIRE, THERE WAS NO SMOKE OR ABNORMAL ODOR IN THE VEHICLE. THE FIRE DEPARTMENT WAS NOTIFIED OF THE FAILURE AND EXTINGUISHED THE FIRE. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FIRE ORIGINATED FROM THE ENGINE COMPARTMENT. THE VEHICLE WAS NOT REPAIRED. A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.  UPDATED 05/10/16*LJ  *TR",
        "vin": "3C63R3JL0EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "03/08/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL LETTER FOR THE FRONT SUSPENSION TRACK BAR  FRAME BRACKET. I TOOK MY VEHICLE TO LAREDO DODGE FOR  MAINTENANCE SERVICE ON MARCH 8, 2016 & A TOTAL OF 5 RECALLS  SHOWED UP FOR THE VEHICLE. THEY WERE CONCERNED ON THE  RECALL CODE (R46) AND TOLD ME THAT THE VEHICLE WAS NOT SAFE  (NOT DRIVE-ABLE), IF USED; IT COULD RESULT IN AN ACCIDENT. DAYS  LATER THE SERVICE MANAGER KENNETH PARKS ADVISED FOR ME TO  COMMUNICATE WITH DODGE CORPORATE SINCE THEY DIDN'T KNOW  WHAT TO DO WITH THE TRUCK. I HAD BEEN CALLING EVERYDAY SINCE  MARCH 8, 2015 TO BOTH LAREDO DODGE & CORPORATE AND HAVE  YET TO RESOLVE ANYTHING. I HAVE BEEN WITHOUT A VEHICLE EVER  SINCE. THE DEALERSHIP FAILED TO PROVIDE A RENTAL.  THE RECALL CODES ON THE VEHICLE ARE AS FOLLOW. (R46,  R40,R36,R26,R23)  AT LAREDO DODGE THEY MENTIONED THEY COULD WELD THE BROKEN  PIECE AND THAT COULD RESOLVE THE PROBLEM IN THE TRACK BAR  FRAME BRACKET. HOWEVER, I AM NOT SATISFIED; DUE TO THE FACT  THAT I WONT HAVE A PIECE OF MIND, THINKING THAT THE WELDED  AREA CAN FAIL AT ANY GIVEN TIME RESULTING IN A FATALITY SINCE  I'M ALWAYS ON THE ROAD.  ANOTHER OPTION THE SERVICE MANAGER MENTIONED WAS TO  REPLACE THE WHOLE CHASSIS, WHICH TO ME DOESN'T MAKE ANY  SENSE TO DISASSEMBLE THE WHOLE VEHICLE TO GET THE PROBLEM  FIXED.  DUE TO THE ABOVE MENTIONED REASONS I NO LONGER WOULD FEEL  SAFE DRIVING A VEHICLE WITH SO MANY RECALLS. DUE TO THE  EXTENT OF THE DAMAGE IT COULD RESULT IN ME LOOSING TOTAL  CONTROL OF THE VEHICLE IF THE REPAIR WOULD FAIL & COULD COST  MY LIFE AND THOSE WITHIN THE VEHICLE OR CAUSE AN ACCIDENT AND  TAKE THE LIFE OF INNOCENT PEOPLE.  THE DEALER HAS A CONCERN ON A LIFT KIT EXISTING ON THE VEHICLE,  PAGE 3 OF 3  WHICH THEY SAY IT COULD'VE CAUSED THE DAMAGE ON THE CHASSIS,  HOWEVER, HOW AM I LIABLE FOR A KIT THAT WAS ALREADY INSTALLED  WHEN I PURCHASED THE VEHICLE? I BELIEVE IS NOT A RELEVANT  ARGUMENT SINCE THE REC",
        "vin": "3C63R3HL7EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "03/03/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852169,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V541000 (SUSPENSION); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C63R3ELXEG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2016",
        "dateOfIncident": "08/27/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851840,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BALL JOINTS DRIVER SIDE FAILURE",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2016",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851841,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BALL JOINT FAILURE PASSENGER SIDE",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851842,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BALL JOINT FAILURE DRIVER SIDE",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850553,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "R46 FRONT SUSPENSION TRACK BAR FRAME THAT WAS IMPROPERLY WELDED DURING THE MANUFACTURING PROCESS -  WE ARE BEING TOLD BY THE DEALERSHIPS THAT NO PARTS ARE AVAILABLE TO FIX THIS AT THIS TIME.  THE ISSUE WITH THIS IS THAT WE PULL A LARGE HORSE TRAILER WITH THIS TRUCK AND ARE PUTTING OUR LIVES AND THE LIVES OF OUR HORSES IN JEOPARDY EVERY DAY WE DRIVE THIS TRUCK.  WE DID NOT SPEND $70,000 ON THIS VEHICLE TO HAVE IT BE A DEATH TRAP WHILE WE WAIT ON PARTS.  WE HAD A 2008 THAT THE TIE ROD BROKE JUST AS I PULLED INTO THE PARKING LOT AT WORK.  I WAS TOLD I WAS LUCKY THAT I WASN'T SERIOUS INJURED OR KILLED COMING DOWN THE HIGHWAY.  WE WERE TOLD AT THE TIME THERE WAS NO RECALL, GUESS WHAT, THE NEXT WEEK THE RECALL CAME OUT.  SO HERE WE ARE IN THE SAME ISSUE AGAIN, DIFFERENT PART, WITH NO HELP COMING FROM THE DEALERSHIPS, MOPAR ETC.",
        "vin": "3C63RRKL1EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/16/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850125,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FACTORY INTEGRATED TRAILER BRAKE MODULE (ITBM) ON MY 2014 RAM 3500 MEGACAB 4X4 CUMMINS DIESEL TRUCK DOES NOT SUPPLY PROPER VOLTAGE TO ACTIVATE THE ELECTRIC BRAKES ON A TOWED TRAILER. THE VOLTAGE SUPPLIED TO THE TRAILER BRAKES IS 7 VOLTS DC WITH THE GAIN SET AT MAX, CHECKED BY A TRAILER DEALER THAT DOES PA STATE INSPECTIONS, WHERE A TRAILER REQUIRES OVER 10 VOLTS DC TO PROPERLY ACTIVATE THE BRAKING SYSTEM ON THE TRAILER BEING TOWED TO SAFELY AID IN STOPPING BOTH THE TRAILER AND TOW VEHICLE. I RECENTLY HAD A NOTICE APPEAR IN THE ELECTRONIC DASH (EVIC) THAT THERE WAS A TRAILER BRAKE PROBLEM AND A NOTIFICATION THAT THE TRAILER WAS NOT CONNECTED WHEN IT WAS STILL CONNECTED TO THE TRUCK. THIS PROMPTED THE FIRST VISIT TO THE DEALER WHERE I WAS TOLD THERE WAS A PROBLEM WITH THE TRAILER. I HAVE HAD MY TRUCK TO THE DEALER TWO TIMES FOR THIS PROBLEM AND THE SECOND TIME THEY CHECKED THE VOLTAGE OF ANOTHER TRUCK THAT WAS 7 VOLTS DC AND SAID IT WAS OK.  I HAVE A 35 FOOT 5TH WHEEL RV TRAILER AND A 18FT FLAT TRAILER THAT DO NOT BRAKE PROPERLY WHEN ATTACHED TO THIS TRUCK. THE 18 FT TRAILER BRAKES WORK PROPERLY WHEN ATTACHED TO A DIFFERENT TRUCK.    I HAVE BEEN RESEARCHING THIS PROBLEM ON THE INTERNET AND HAVE FOUND THAT ON MANY OF THE FORUMS DEALING WITH CUMMINS DIESEL AND RAM TRUCKS THAT THIS PROBLEM IS WIDE SPREAD OVER MANY MODEL YEARS. ON THE DODGE RAM FORUM (WWW.RAMFORUM.COM - SEARCH BRAKE CONTROLLER) AN AUTOMOTIVE ENGINEER EVEN DOCUMENTED THE LACK OF OUTPUT OF HIS 2015 RAM 3500 TRUCK. AT 100% INPUT THERE WAS ONLY 66% OUTPUT TO THE TRAILER BRAKING SYSTEM.   I HAVE HAD 6 SAFETY RECALLS FOR THIS TRUCK SO FAR. THIS PROBLEM MAY NOT RECEIVE AS MUCH ATTENTION AS OTHER PROBLEMS DUE TO THE FACT THAT THERE IS A MUCH SMALLER NUMBER OF VEHICLES USED FOR TOWING. PLEASE DO NOT WAIT UNTIL SOMEONE IS KILLED BEFORE INVESTIGATING THIS PROBLEM.    THANK YOU FOR REVIEWING MY SUBMISSION.  *TR",
        "vin": "3C63R3ML5EG"
    },
    {
        "components": "STEERING,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846443,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 15V460000 (AIR BAGS, SEAT BELTS), 15V459000 (AIR BAGS) AND 15V541000 (STEERING) HOWEVER, THE DEALER INFORMED THAT THE RECALL REMEDY HAD ALREADY BEEN PERFORMED ON THE VEHICLE. THE CONTACT STATED THE VEHICLE WAS NOT TAKEN TO THE DEALER PREVIOUSLY TO BE SERVICED UNDER ANY RECALLS. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C63R3JJ2EG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2016",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845959,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT WHEN THE VEHICLE WAS STOPPED AT A STOP LIGHT OR A STOP SIGN, THE INSIDE OF THE VEHICLE WAS FILLED WITH FUEL FUMES. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "3C63RRHL7EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2016",
        "dateOfIncident": "10/16/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839156,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C63RRKL7EG"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "07/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838049,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V533000 (SEATS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C7WRVLGXEE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837095,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRAG LINK ADJUSTER FOR THE STEERING WHEEL WAS NOT TIGHTENED TO SPEC.  THIS CAN RESULT IN LOSING STEERING CONTROL WHILE DRIVING.",
        "vin": "3C63R3NLXEG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/17/2016",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836622,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. IN APRIL OF 2015, WHILE THE VEHICLE WAS IN REVERSE, THE BRAKES MALFUNCTIONED. THE CONTACT'S VEHICLE FAILED TO STOP AND BUMPED INTO A SECOND VEHICLE. THERE WERE NO INJURIES. WHILE DRIVING APPROXIMATELY 60 MPH, THE BRAKES SUDDENLY ACTIVATED WITHOUT THE BRAKE PEDAL BEING APPLIED. DURING THE INCIDENT, THE BRAKE SENSOR, ABS SENSOR AND THROTTLE SENSOR ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHO REPLACED THE BRAKE MODULE SENSOR AND TRANSMISSION SENSOR, BUT THE FAILURE RECURRED WHILE BEING TEST DRIVEN. IN NOVEMBER OF 2015, THE VEHICLE EXPERIENCED THE FAILURE AGAIN. THE VEHICLE WAS TAKEN TO THE DEALER WHO REPLACED THE STAR CONNECTOR. THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 7,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "08/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825061,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF FRONT HUB ASSEMBLY(BEARINGS) DUE TO EXCCESSIVE WEIGHT OF ENGINE ON UNDER RATED BEARING ASSEMBLY",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823640,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "INTEGRATED TRAILER BRAKE CONTROLLER FAILS TO PROVIDE SUFFICIENT BRAKING POWER TO TRAILER.  ON SEVERAL OCCASIONS, TRUCK AND TRAILER WERE IN NEAR-MISS POTENTIAL ACCIDENTS DUE TO INSUFFICIENT TRAILER BRAKING.  CONTROLLER WILL NOT HOLD TRAILER STILL WHILE THE TRUCK IS AT REST.  REGARDLESS OF SETTINGS, INCLUDING MAX POWER SETTINGS AND USING THE MANUAL SLIDER FULLY ENGAGED, THE CONTROLLER WOULD NOT ACTIVATE THE TRAILER BRAKES SUFFICIENTLY TO SAFELY SLOW THE TRAILER IN ANY SITUATION.  TRAILER IN QUESTION IS APPROXIMATELY 13,000#, DUAL AXLE WITH BRAKES ON BOTH AXLES.  SECOND TRAILER WAS USED FOR TESTING WITH SIMILAR RESULTS, INCLUDING THE INABILITY TO CAUSE BRAKE LOCKUP OF AN EMPTY FLATBED TRAILER.  DEALER REPLACED ITBM COMPONENT(S), WITH NO CHANGE.  EXCUSED AS WORKING PROPERLY, EVEN WITH OBVIOUSLY INSUFFICIENT BRAKING ABILITY.",
        "vin": "3C63R3GL1EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/29/2016",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823078,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE PARTS WOULD NOT BE AVAILABLE UNTIL MARCH OF 2016. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C63R3JL1EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/28/2016",
        "dateOfIncident": "11/24/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822883,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE ACCELERATOR PEDAL WAS DEPRESSED AND THE VEHICLE PULLED TO THE LEFT INTO ONGOING TRAFFIC. THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE HAD TO BE STEERED WITH EXCESSIVE FORCE BACK TO THE CORRECT SIDE OF THE ROAD. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 55 MPH WITH CRUISE CONTROL ENGAGED, THE ACCELERATOR PEDAL WAS DEPRESSED AND THE VEHICLE JERKED TO THE LEFT WITHOUT WARNING. THE FAILURES RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER ON NUMEROUS OCCASIONS WHERE THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.   *JS",
        "vin": "3C7WRVLG9EE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822242,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FUMES GETTING INTO THE CABIN OF MY VEHICLE. THE EGR VALVE HAS BEEN RPLACED ONCE ALREADY AT 16000 MILES. THE FUMES PERSIST AND HAPPEN AT RANDOM REGARDLESS OF DRIVING CONDITIONS. VEHICLE HEATER IS ON WITH OUTSIDE AIR ON, BUT SMELL WILL PERSIST EVEN WHEN VEHICLE IS IN MOTION AT HIGHWAY SPEEDS AND IS NOXIOUS ENOUGH TO CAUSE THROAT TO FEEL SORE AND EYES TO WATER. THIS IS NOT DUE TO BEING NEAR ANOTHER DIESEL VEHICLE. AGAIN HAPPENS AT RANDOM, FORUMS SUGGEST SMELL MAY BE LINKED TO REGEN PROCESS. REGARDLESS OF PROCESS FUMES SHOULD NOT BE ABLE TO ENETR VEHICLE.",
        "vin": "3C63R3DL0EG"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/22/2016",
        "dateOfIncident": "11/12/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821632,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE GPS IN THE VEHICLE WOULD NOT WORK AND THE MAINTENANCE WARNING INDICATOR WOULD NOT CLEAR OFF OF THE INSTRUMENT PANEL AFTER THE MAINTENANCE SERVICE WAS PERFORMED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE GPS FAILED AND THE UNIT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT REMAINED FOR OVER A MONTH UNTIL IT WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 28,447.",
        "vin": "3C6URVJG6EE"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/14/2016",
        "dateOfIncident": "11/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820192,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT WHILE DRIVING AT 20 MPH IN RAINY WEATHER, THE REAR PASSENGER SIDE OF THE ROOF STARTED TO LEAK. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE THIRD LIGHTHOUSE NEEDED TO BE REPLACED. IT WAS UNKNOWN IF THE VEHICLE WAS REPAIRED.  IN ADDITION, THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH, THE VEHICLE WOULD JERK VIOLENTLY. THE VEHICLE WAS TAKEN TO THE DEALER BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "3C63RPJL9EG"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/03/2016",
        "dateOfIncident": "09/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817482,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOV 11 2015 MY TRUCK FLIPPED DURING A LEFT HAND TURN WHILE PULLING A 3 CAR HAULER WITH 2 CARS ON TRAILER I WAS ABOUT 25000LBS GROSS PLUS OR MINUS 1000LBS. I WAS ON MY WAY TO TRUCK STOP FOR FUEL WHEN ACCIDENT HAPPENED. MY TRUCK HAS AN AUTOMATIC TRANSMISSION AND THE MONTH BEFORE WAS HAVING SHIFTING ISSUES ON LEVEL GROUND SO I TOOK TO DEALERSHIP FOR FREE FACTORY REPAIR/ REPROGRAM TRANSMISSION HAVE ALL DOCUMENTS. NEARLY 10,000 MILES LATER / 1 MONTH TURNING AND NOW MY TRUCK IS ON ITS SIDE MY GUESS IS IT DOWNSHIFTED AND PUH POW OVER IT WENT.",
        "vin": "3C63RRGLXEG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "12/20/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811486,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK OCCASIONALLY AFTER GOING OVER A BUMP IN THE ROAD AT HIGHWAY SPEEDS WILL DEVELOP A JARRING, CONSTANT SEVERE VIBRATION IN THE STEERING WHEEL AND SUSPENSION.  FROM WHAT I CAN TELL THIS IS THE \"DEATH WOBBLE\" I HAVE SEEN REPORTED ONLINE.  IT IS A VERY VIOLENT VIBRATION THAT CAN ONLY BE STOPPED BY SLOWING THE TRUCK BELOW 25-30MPH.  IT IS SO SEVERE THAT IT FEELS LIKE YOU ARE GOING TO LOSE CONTROL OF THE VEHICLE.  THIS HAS NOW HAPPENED 4 TIMES WITH THIS VEHICLE.  IT HAS APPROXIMATELY 44,000 MILES ON IT.",
        "vin": "3C63R3FL8EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "12/07/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808732,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING) HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C63R3HL5EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807708,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. WHILE DRIVING AT APPROXIMATELY 55 MPH, THERE WAS AN ABNORMAL NOISE, THE STEERING PULLED TO THE LEFT AND RIGHT, AND THE CONTACT LOST CONTROL OF THE VEHICLE. THE CONTACT WAS ABLE TO MERGE THE VEHICLE TO THE SIDE OF THE ROAD. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TRACK BAR BRACKET FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V541000 (SUSPENSION) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 27,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C63R3JJ8EG"
    },
    {
        "components": "STEERING,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/18/2015",
        "dateOfIncident": "09/02/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794580,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V460000 (AIR BAGS, SEAT BELTS), 15V459000 (AIR BAGS), AND 15V541000 (STEERING); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT ON NHTSA CAMPAIGN NUMBERS 15V460000 AND 15V459000. VIN TOOL CONFIRMS PART NOT AVAILABLE ON NHTSA CAMPAIGN NUMBER 15V541000.",
        "vin": "3C63RRGL4EG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/17/2015",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794520,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT STATED THAT THE TIRES ON THE VEHICLE WERE REPLACED THREE TIMES DUE TO THE FRONT WHEEL ALIGNMENT WEARING DOWN ON THE TIRES. THE VEHICLE WAS TAKEN TO A DEALER TO BE REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 31,000.",
        "vin": "3C63RRNL6EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/12/2015",
        "dateOfIncident": "11/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790039,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT STATED THAT WHILE DRIVING AT 45 MPH, THE STEERING WHEEL WAS DIFFICULT TO MANEUVER CAUSING THE VEHICLE TO VEER TO THE LEFT. THE CONTACT ALSO STATED THAT THERE WAS A LOAD NOISE COMING FROM THE STEERING WHEEL. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE PART FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 28,000. VIN TOOL CONFIRMS PART NOT AVAILABLE.",
        "vin": "3C63R3JJ8EG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2015",
        "dateOfIncident": "02/23/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787775,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PARKING (EMERGENCY BRAKE) DOES NOT WORK AND NEVER HAS SINCE VEHICLE WAS NEW.  IT WOULD LOCK UP AT TIMES BUT THEN NOT WORK TO KEEP VEHICLE FROM ROLLING.    THIS SEEMS RATHER INSIGNIFICANT UNTIL YOU UNDERSTAND THAT THE VEHICLE HAS NO PARK(NO PARKING POSTION) SO THE PARKING BRAKE MUST WORK TO KEEP VEHICLE FROM ROLLING, THIS VEHICLE WILL ROLL ANYTIME MOTOR IS OFF UNLESS PARKING BRAKE(EMERGENCY BRAKE) IS ENGAGED.  IT HAS BEEN IN THE SHOP MANY TIMES TO REPAIR THIS ISSUE AND IT HAS NEVER EVEN BEEN IMPROVED!!!       SAFETY ISSUE IS THAT VEHICLE SHOULD NEVER HAVE BEEN ALLOWED TO BE MANUFACTURED WITH NO PARK!  UNLIKE A STANDARD TRANSMISSION WHICH CAN BE PUT IN GEAR WITH MOTOR OFF TO STOP FROM ROLLING THERE IS NO WAY ON THIS VEHICLE OTHER THAN THE PARKING BRAKE!(EMERGENCY BRAKE)      I HAVE VIDEO OF THE PROBLEM AND HERE IS A LINK TO THAT VIDEO.      HTTPS://YOUTU.BE/EP_HP3DEKMY",
        "vin": "3C6URVHD7EE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/30/2015",
        "dateOfIncident": "10/29/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787285,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE STEERING COMPONENT BROK ON THE VEHICLE WHICH MADE IT VERY UNSTABLE TO DRIVE.   I HAD JUST DRIVEN THE CAR FROM THE DEALERSHIP TO HOME FOR REPAIRS FOR TWO OTHER WARRANTY ISSUES.  THEY SHOULD HAVE BEEN AWARE OF THE FAULTY WELDING ON THE STEERING COMPONENT AT THE TIME IT WAS IN THE SHOP ON 10/28-10/29/2015.  I TOLD THEM TO HAVE IT TOWED TO THEIR SHOP BUT THEY IGNORE ME AND DROPPED AN EMPLOYEE OFF TO DRIVE IT.  THE EMPLOYEE ATTEMPTED TO DRIVE THE VEHICLE AND ALMOST RAN OFF THE SIDE OF THE ROAD.  THE EMPLOYEE TURNED AROUND AND BROUGHT THE VEHICLE BACK.  I HAD TO USE MY AAA ACCOUNT TO HAVE THE TRUCK TOWED TO THEM.  VICTOR AT DODGE IN WATSONVILLE, CA CALLED LATER TO SAY THE PROBLEM WAS WITH A RECALL AND THAT THEY WILL GET BACK TO ME AFTER THEY TALK TO CHRYSLER.",
        "vin": "3C63RRJL7EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/30/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787299,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS NOTIFIED OF RECALL R-46 ON OR ABOUT 10/06/15 BY THE DEALER.  AT THAT TIME I WAS TOLD THAT IN THE OPINION OF THE DEALER, HE DID NOT FEEL THE VEHICLE WAS SAFE TO DRIVE IN THE MANNER THAT I USE THE VEHICLE.  I TOW A 16,000# FIFTH-WHEEL RV TRAILER.  I AM A FULL-TIME RVER AND TRAVEL MUCH OF THE TIME.  WHEN THE DEALER CONTACTED HIS COUNTERPART HE AGREED THAT THE VEHICLE WAS NOT SAFE TO OPERATE THE VEHICLE IN THE MANNER I INTEND TO USE IT.  PICTURES WERE TAKEN FOR THE RECORD.  WHEN FCA WAS CONTACTED AND THE PROBLEM WAS EXPLAINED THEY TOLD THE DEALER THAT A RENTAL VEHICLE WAS AT THE DEALERSHIP'S DISCRETION AND THE DODGE WOULD NOT AUTHORIZE ONE.  EVENTUALLY THE PICTURES WERE FORWARDED TO DODGE ENGINEERING TO REQUEST A FIX.  ENGINEERING SAID THAT THERE WAS NO PROBLEM AND THE DEALERSHIP RETURNED THE VEHICLE TO ME SAYING THEY COULDN'T HELP.  THE DEALERSHIP REQUESTED THAT ENGINEERING SEND SOMEONE OUT TO PHYSICALLY VIEW THE PROBLEM.  THEY REFUSED SAYING THE PICTURES DID DISPLAY ANY CRACKS AND THAT THE WELD LOOKED SUFFICIENT.  I LOOKED OVER THIS SITE AND FOUND THAT THIS PROBLEM WAS IDENTIFIED AS EARLY AS FEBRUARY 2014 AND CONTINUED TO DATE.  ON AUGUST 26, 2015, FCA STATED THAT THERE WAS INSPECTION AND CORRECTIVE ACTION IDENTIFIED IN A COMMUNICATIONS R46082615.  TO DATE, THE ONLY RESPONSE FROM THE FCA RECALL CENTER IS THAT THE REPAIR IS IN DEVELOPMENT AND NO PARTS ARE AVAILABLE.  THIS IS THE SECOND RAM THAT I HAVE HAD A RECALL THAT COVERED AN EXTENSIVE AMOUNT OF TIME.  FCA'S RESPONSE TO ME IS THAT THE ONLY PROBLEM I WOULD HAVE IF THE TRACK BAR BRACKET BROKE WOULD BE DIFFICULT STEERING AND POSSIBLY A CRASH.  THAT ISN'T ACCEPTABLE TO ME, MY WIFE, THE COST OF MY RV, OR THE LIABILITY TO OTHERS.  FCA NEEDS TO PROVIDE A FIX OR  GIVE US A LETTER STATING THAT THERE IS NO DEFECT.  AT THIS TIME I AM DRIVING MY VEHICLE AND TOWING MY RV BECAUSE IT IS THE ONLY VEHICLE AVAILABLE TO ME.",
        "vin": "3C63RPGL3EG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2015",
        "dateOfIncident": "01/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786645,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT STATED THAT THE VEHICLE FAILED TO SHIFT GEARS. IN ADDITION, THE TPM AND A/C FAILED TO FUNCTION PROPERLY, AND AN ABNORMAL NOISE COULD BE HEARD FROM THE VEHICLE. THE CHECK ENGINE WARNING INDICATOR HAD ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "3C63RRJL9EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786406,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SOMETIMES SIGNIFICANT DELAY IN RESPONSE WHEN PRESSING ACCELERATOR PEDAL AND ACTUAL ACCELERATION OF THE VEHICLE. THIS MAKES IT DIFFICULT TO JUDGE MERGES INTO TRAFFIC OR WHEN MAKING TURNS FROM A STOP INTO TRAFFIC. THE DELAY COULD BE RELATED TO THE TURBO CHARGER SPINNING UP, BUT IT DOES LEAD TO A DANGEROUS CONDITION. THIS IS PARTICULARLY NOTICEABLE WHEN THE VEHICLE IS COLD. I DID NOT NOTICE SUCH A PERCEPTIBLE DELAY IN ACCELERATION WHEN DRIVING AN OLDER MODEL DIESEL PICKUP ALSO MADE BY DODGE RAM.",
        "vin": "3C63REL2EG2"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786512,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT RECEIVED NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING). THE DEALER INDICATED THAT THE PART WAS NOT AVAILABLE TO REPAIR THE VEHICLE. THE DEALER PROVIDED NO ESTIMATED TIME FRAME FOR THE REPAIR AND THE CONTACT WAS WAITING FOR LONGER THAN A MONTH.  THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C63R3HL0EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/22/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785349,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V541000 (STEERING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C63R3EL4EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10784692,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ANYTIME I HAVE TO TAKE MY FOOT OFF THE ACCELERATOR PEDAL CAUSING THE TRUCK TO COAST A BIT,  AND THEN DEPRESSING THE ACCELERATOR PEDAL BACK DOWN IN AN EFFORT TO SPEED UP, THERE IS A 2 TO 4 SECOND PAUSE BEFORE THE TRUCK EVEN STARTS TO ACCELERATE. THIS ISSUE CHANGES IN DELAY TIME DEPENDING ON THE CURRENT SPEED YOUR COASTING AT. THE 25 TO 45 MPH RANGE SEEMS TO CREATE THE LONGEST DELAY. IN TWO INSTANCES, TRAVELING AT AROUND 35 MPH, I DEPRESSED THE ACCELERATOR PEDAL TWICE  WITHIN A SECOND OF EACH OTHER (IN AN EFFORT TO TIME MY ACCELERATION WITH THE TRAFFIC) AND THE TRUCK ACTUALLY STALLED OUT DARN NEAR KILLING ME. SINCE THEN I HAVE LEARNED THAT IF I KEEP THE TRUCK FROM COASTING WHEN I'M TRYING TO MERGE (A LITTLE ACCELERATOR WITH SOME BRAKE AT THE SAME TIME) WHICH KEEPS THE POWERTRAIN ENGAGED, ELIMINATES THE  ACCELERATION DELAY. NOT GOOD FOR MY BRAKES THOUGH, AND NOT ALWAYS ABLE TO ACCOMPLISH. MY HOPE IS THAT SOMEONE WILL DO SOMETHING ABOUT THIS BEFORE A SERIOUS INJURY OCCURS.",
        "vin": "3C63RRKLXEG"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783599,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK SHAKES VIOLENTLY BETWEEN 70-78 MPH.",
        "vin": "3C63R3CL2EG"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783601,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAS SEVERE DEAD PEDAL. IF I HAVE TO LET OFF THE GAS PEDAL FOR A SECOND TO MERGE INTO TRAFFIC THEN GIVE IT GAS AGAIN IT FALLS ON IT'S FACE AND DOESN'T MOVE OR DO ANYTHING AT ALL FOR UP TO 5 SECONDS. HAS ALMOST CAUSED 4 CRASHES.",
        "vin": "3C63R3CL2EG"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782271,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM # 1:  STRONG COOLANT AND BURNING RUBBER SMELL.  NO LEAKS FOUND.  PROBLEM #2:   DEFECTIVE FRONT WINDSHIELD (PRISM DISTORTION,  SAFETY ISSUE).  PROBLEM #3:   FRONT VIBRATION.  PROBLEM #4:  WIND NOISE ON LEFT DOORS.  PROBLEM #5:  RADIO TURNS-OFF AND/OR CD STOPS PLAYING ON BUMPY ROADS.",
        "vin": "3C63RRGJ1EG"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "10/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779922,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED AND OFF, THE DASHBOARD ELECTRICAL COMPONENTS MADE AN ABNORMAL NOISE. THE CONTACT RECEIVED A NOTICE FOR NHTSA CAMPAIGN NUMBERS: 15V459000 (STEERING) AND 15V541000 (SUSPENSION). THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED AND REPAIRED; HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE TIME FOR THE RECALL REPAIRS. IN ADDITION, THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 15V461000 (EQUIPMENT), BUT FAILED TO REMEDY THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 8,029. THE VIN WAS NOT AVAILABLE.   UPDATED 01/27/16*LJ",
        "vin": "3C63RR5L9F6"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/21/2015",
        "dateOfIncident": "09/17/2015",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10766496,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. WHILE DRIVING APPROXIMATELY 65 MPH AND APPROACHING A REST AREA, THE CONTACT DISCOVERED EXTENSIVE SMOKE COMING FROM THE TAIL PIPE. THERE WAS AN ABNORMAL NOISE AND THE VEHICLE SUDDENLY CAUGHT FIRE FROM UNDERNEATH. THE FIRE DEPARTMENT WAS ABLE TO EXTINGUISH THE FIRE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A DEALER WHO DIAGNOSED THAT THE WIRE HARNESS WAS DAMAGED DUE TO THE FAILURE AND INDICATED THAT THE FUEL INJECTORS FAILED CAUSING COMBUSTIBLE FRAGMENTS TO IGNITE THE FUEL, WHICH DAMAGED THE DEF SYSTEM. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBERS: 15V460000 (AIR BAGS) AND 15V459000 (STEERING); HOWEVER, THE RECALL REMEDY WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ASSIGNED AN INVESTIGATOR TO INSPECT THE VEHICLE FOR THE CAUSE OF THE FIRE. THE APPROXIMATE FAILURE MILEAGE WAS 110,214.",
        "vin": "3C63RRJL3EG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "12/31/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762647,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT NOTICED THAT ALL OF THE TIRES WERE ABNORMALLY WORN OUT. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE VEHICLE NEEDED A WHEEL ALIGNMENT. THE VEHICLE WAS REPAIRED, BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.",
        "vin": "3C63RRGL5EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2015",
        "dateOfIncident": "05/04/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749931,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OEM TRAILER BRAKE CONTROLLER DOES NOT WORK AS DESIGNED.  THERE HAS BEEN NUMBER OR TIMES THAT I CAME CLOSE HITTING A CARS.  THE BRAKE CONTROLLER IS NOT SUPPLYING ENOUGH VOLTS TO STOP MY 17K TRAILER.  TOOK IT TO THE DEALER AND THEY SAID OEM BRAKE CONTROLLER IS WORKING FINE.  WHEN I CHECK CONTROLLER IT'S ONLY SUPPLYING 6.5 VOLTS WHEN THE MANUAL SLIDE IS FULLY ENGAGED.  THIS IS A BIG PROBLEM AND NEEDS TO BE ADDRESS BEFORE SOMEONE GETS KILLED.  BY THE WAY MY TRAILER IS BRAND NEW AND WORKS FINE WITH FORD AND CHEVY OEM BRAKE CONTROLLER.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/08/2015",
        "dateOfIncident": "08/24/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747188,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS STOPPED AT A SIGNAL LIGHT AND THE TRUCK LURCHED FORWARD HITTING THE CAR IN FRONT. INSURANCE COMPANY HAD AN EXPERT CHECK THE TRUCK AND WE WERE ADVISED BY HIM NOT TO OPERATE THE VEHICLE. CHRYSLER HAD THEIR EXPERT EXAMINE IT ON 8/4/2015. I WAS INFORMED ON THAT DATE THAT HE AND THE DEALERSHIP WERE OUT OF THE LOOP AND I HAD TO SPEAK WITH CHRYSLER. THEY WILL NOT RETURN ANY OF MY HONE CALLS.",
        "vin": "3C63RML36EG"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "07/19/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746514,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE TIRE WAS WORN OUT CAUSING THE VEHICLE TO VEER TO THE RIGHT. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS CONFIRMED THAT THE TIRE WAS 1/4 WORN OUT. THE VEHICLE WAS NOT REPAIRED. THE CONTACT MENTIONED THAT THE VEHICLE WAS CAUSING THE TIRE TO WEAR OUT. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 6,500.    UPDATED 09/18/15*LJ",
        "vin": "3C63RRHL3EG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743721,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT STATED THAT THE STEERING WHEEL WAS UNSTABLE AND THAT IT CONTINUED TO VEER TO THE LEFT. THE VEHICLE WAS TAKEN TO THE DEALER MORE THAN FIVE TIMES, BUT THEY WERE NOT ABLE TO REMEDY THE FAILURE. THE DEALER PROVIDED AN ALIGNMENT MORE THAN FIVE TIMES, WHICH DID NOT REMEDY THE FAILURE. THE DEALER ROTATED THE TIRES ONCE AND THE CONTACT ALSO ROTATED THE TIRES, BUT THE FAILURE RECURRED. THE CONTACT INDICATED THAT THE FAILURE WAS GETTING PROGRESSIVELY WORSE. THE APPROXIMATE FAILURE MILEAGE WAS 1,500.",
        "vin": "3C63R3CJ2EG"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "03/18/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743992,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I GET A BAD VIBRATION AROUND 76-86 MPH. I ORIGINALLY BOUGHT A 2013 DUALLY LONGHORN DIESEL , BROUGHT BACK 5 TIMES TO DEALER AND COULD NOT FIX VIBRATION ISSUE, NOW HAVING SAME ISSUE WITH THIS TRUCK, 70K SHOULD NOT BE HAVING TO DEAL WITH THIS SAME THING AGAIN. I LOST WORK, PERSONAL TIME AND ALL AGGRAVATION WITH 2013 AND NOW 2014 SAME ISSUE. SOMETHING IS WRONG WITH THESE TRUCK WITH THE VIBRATION ISSUE AND NEED TO BE CORRECTED, IT'S GOING TO VIBRATE ITSELF APART AND GETTING RATTLE NOISES WHEN I DRIVE BESIDE THE FACT THAT IT'S SHAKING MY GUTS APART . I'VE ALREADY WENT THRU ONE SET OF REAR TIRES AND NOW HAVING TO PUT ANOTHER SET ON AT 28K. SOMETHING IS WRONG!!!",
        "vin": "3C63R3KL2EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2015",
        "dateOfIncident": "01/23/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743453,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING DOWNHILL THE ENGINE BRAKE WORKS INTERMITTENTLY AND THE TRANSMISSION SOMETIMES GOES INTO NEUTRAL. WHEN IN NEUTRAL YOU HAVE  TO INCREASE THE ENGINE RPM'S BY AT LEAST 1000 TO GET THE TRANSMISSION TO GO BACK INTO GEAR. TECHNICIANS TELL ME SOMETHING IS STRANGE BUT THEY ALL SAY CHRYSLER BACK EAST SOMEWHERE SAYS ALL IS NORMAL AND THAT IS ALL THEY CAN DO.",
        "vin": "3C63R3GL9EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2015",
        "dateOfIncident": "05/28/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733258,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. WHILE DRIVING AT APPROXIMATELY 30 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED BUT THE VEHICLE DID NOT ACCELERATE. THE FAILURE RECURRED NUMEROUS TIMES.  THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 400.   UPDATED 12/01/15*LJ    UPDATED 11/13/2017*CN",
        "vin": "3C63RRKL3EG"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC:I1530237A. 2015 DODGE RAM 3500. CONSUMER STATED THE CAMBER ADJUSTMENT ISSUE IS CAUSING UNEVEN AND PREMATURE TIRE WEAR. *LN  THE CONSUMER STATED THE UNEVEN AND PREMATURE WEAR OF THE TIRES, WERE ON THE EDGE OF THE FRONT TIRES. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2015",
        "dateOfIncident": "10/20/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716289,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V635000 (ENGINE AND ENGINE COOLING, FUEL SYSTEM, DIESEL); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C63RRGL3EG"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/24/2015",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712630,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT STATED THAT THERE WAS A DELAY WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE CONTACT STATED THAT THE FAILURE OCCURRED OCCASIONALLY. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN STATED THAT THE VEHICLE WAS WORKING UP TO SPECIFICATIONS. THE FAILURE MILEAGE WAS 4,600.   UPDATED 6/25/15*CN",
        "vin": "3C6UR5GL9EG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704604,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V294000 (AIR BAGS, ELECTRICAL SYSTEM, EXTERIOR LIGHTING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 5/18/15*CN",
        "vin": "3C6URVJG6EE"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704782,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS GOING TO MERGE ON TO THE FREEWAY THE CAR IN FRONT OF ME SLOWED DOWN SO I HAD TO TAKE MY FOOT OFF THE ACCELERATOR PEDAL. A HOLE OPENED IN TRAFFIC AND I STARTED TO CHANGE LANES PRESSED DOWN ON THE ACCELERATOR PEDAL TO GET UP TO THE SAME SPEED AS TRAFFIC AND THERE WAS A 2 TO 3 SECOND PAUSE BEFORE THE TRUCK STARTED TO ACCELERATE. IN THAT TIME I WATCHED THE TRUCK BEHIND ME GET DANGEROUSLY CLOSE AND THE HOLE I CAME OUT OF CLOSED UP I HAD NO WERE TO GO. I TOOK THE TRUCK TO THE DEALER AND THEY TOLD ME THAT IS THE WAY THE TRUCK IS SUPPOSE TO WORK. I TEST DROVE A TRUCK AT ANOTHER DEALER AND IT DID NOT HAVE THE SAME PROBLEM. TOOK IT BACK TO THE DEALER SHOP  AND THEY WERE STILL ADAMANT THAT THE TRUCK WAS WORKING CORRECTLY. I CAN DUPLICATE THE PROBLEM WHEN EVER I WANT.  *TR",
        "vin": "3C63R3JL7EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2015",
        "dateOfIncident": "05/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703796,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED A \"DEAD PEDAL\" ISSUE SINCE OWNING THE TRUCK WHICH HAS CAUSED MANY CLOSE CALLS WHEN TURNING IN TRAFFIC, LEAVING A STOP SIGN AND PASSING. THERE IS A SEVERAL SECOND DELAY BEFORE I GET ACCELERATION AND THE TRUCK GETS GOING. IT HAS CAUSED ME TO BE VERY NERVOUS WHEN DRIVING ESPECIALLY WITH FAMILY IN THE TRUCK WITH ME.  *TR",
        "vin": "3C63R3ELXEG"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/15/2015",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694325,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A DIP IN THE ROAD AT THE END OF A BRIDGE AND VEHICLE STARTED SHAKING SEVERELY. I BELIEVE THIS WAS AN OCCURRENCE OF WHAT HAD BECOME KNOWN AS \"DODGE RAM DEATH WOBBLE\". THIS IS AN UNMODIFIED 2014 RAM 3500 APPROXIMATELY 35000 MILES ON THE ODOMETER.   *TR",
        "vin": "3C63RRKL3EG"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/15/2015",
        "dateOfIncident": "03/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694327,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS DESIGNED AND CONSTRUCTED WITH NON ADJUSTABLE CAMBER FOR THE FRONT WHEELS. THIS IS CAUSING UNEVEN WEAR TO THE FRONT TIRES, OUTSIDE EDGE NOW BALD WHILE REST OF TIRE TREAD IS INTACT. THE ONLY KNOWN REPAIR IS USING AFTERMARKET PARTS AND A PROPER ALIGNMENT ALONG WITH NEW TIRES COSTING THE CONSUMER $1000 AND $1500 PER VEHICLE.  *TR",
        "vin": "3C63RRKL3EG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2015",
        "dateOfIncident": "12/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678164,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRYING TO PULL OUT OF A DRIVE WAY ON A COUNTRY ROAD. THE ROAD WAS OBSCURED AND HARD TO SEE AROUND THE CORNER. I STARTED TO PULL OUT SLOWLY TO SEE AROUND THE CORNER. I TOOK MY FOOT OFF THE ACCELERATOR PEDAL AT THAT TIME A LOADED LOG TRUCK CAME AROUND THE CORNER AND I WAS IN HIS WAY. I AUTOMATICALLY PRESSED DOWN ON THE ACCELERATOR PEDAL AND THE TRUCK JUST SAT THERE FOR ABOUT 2 TO 3 SECONDS BEFORE IT STARTED TO MOVE. THE LOG TRUCK HAD ALL ITS BRAKES LOCKED UP AND SMOKING. I?M REALLY GLAD THE TRUCK DRIVER HAD GOOD REFLEXES. I DON?T KNOW IF MY BOYS AND I WOULD HAVE MADE IT THROUGH A CRASH LIKE THAT.                                      I BELIEVE THIS IS A REALLY BIG SAFETY ISSUE AND IT SHOULD BE ADDRESSED AT ONCE. I WAS TOLD BY THE DEALER THAT IT IS THAT WAY FOR THE SAFETY OF THE DRIVE TRAIN. THAT JUST DON'T SEEM RIGHT TO ME. SAVE THE DRIVE TRAIN FORGET THE PEOPLE?  *TR",
        "vin": "3C63R3JL7EG"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "11/26/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669705,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK HAS BEEN TO THE DEALERSHIP SEVERAL TIMES FOR THE \"DEAD PEDAL\" ISSUE.  THERE IS A 3-4 SECOND DELAY FROM THE MOMENT YOU ASK THE TRUCK TO ACCELERATE BEFORE THERE IS ANY THROTTLE RESPONSE.  AND THEN ONCE IT DOES RESPOND, THE POWER DELIVERY IS EXTREMELY SLOW.  I HAVE HAD SEVERAL NEAR ACCIDENTS WHEN I WAS ATTEMPTING TO TURN LEFT IN FRONT OF ONCOMING TRAFFIC, AND THE TRUCK DOES NOT RESPOND TO FULL THROTTLE.    ONE TIME IS WAS SO BAD, I THOUGHT THE TRUCK STALLED, AND TURNED ON MY 4 WAY FLASHERS...   *TR",
        "vin": "3C63RRGL4EG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "11/27/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10666982,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A BRAND NEW 2013 RAM LARAMIE LONGHORN 1 TON 4X4 TRUCK WITH THE AISIN TRANSMISSION IN JULY 2013. THE TRUCK WOULD BUCK/JERK .  IT WENT BACK TO THE DEALER NUMEROUS TIMES.  EACH TIME I WAS TOLD THAT THERE WAS A \"SOFTWARE UPDATE,\" THAT MIGHT FIX THE PROBLEM.  AFTER NUMEROUS UPDATES &  NO FIX, THE DEALER CONSULTED W/ THE ENGINEERS AT RAM, IN WHICH IT WAS ADVISED FOR THE DEALER TO TRY & REPLACE THE TORQ CONVERTER. THE TORQ CONVERTER DID NOT FIX THE PROBLEM. THE TRUCK WAS NOT SAFE TO DRIVE.  I HIRED A LEMON LAW ATTORNEY & CHRYSLER BOUGHT THE TRUCK BACK & GAVE ME A 2014 LARAMIE LONGHORN 3500. ON NOVEMBER 21, 2014 I PICKED UP THE NEW TRUCK.  ON NOVEMBER 27TH, 2014 WHILE DRIVING THRU TOWN AT APPROX 40MPH & THE TRUCK STARTED THE SAME BUCKING/JERKING. I TOOK THE TRUCK BACK TO THE LOCAL DEALERSHIP (HATCH MOTOR COMPANY IN SNOWFLAKE, AZ) ON DECEMBER 3, 2014. THE TECH WAS ABLE TO DRIVE THE TRUCK & DUPLICATE THE BUCKING/JERKING.  THE SERVICE MANAGER CALLED RAM & WAS ADVISED THIS IS A \"NORMAL DRIVING CONDITION.\" THE TRUCK THEN SAT AT THE DEALER FOR 12 DAYS WHILE THE CHRYSLER REGIONAL REP/MANAGER, [XXX] CAME OUT & DROVE MY TRUCK & WAS ABLE TO DUPLICATE THE BUCKING/JERKING.  THE REP ALSO DROVE A 2015 TRUCK ON THE DEALERS LOT ALONG W/ 3 OTHERS & THEY ALL HAVE THE SAME BUCKING/JERKING PROBLEM.  SO AT THIS TIME CHRYSLER IS TELLING ME THAT IT IS A \"NORMAL DRIVING CONDITION\" FOR THEIR TRUCKS TO BUCK/JERK AT SPEEDS LESS THAN APPROX 45MPH OR LESS.  THEY CONSIDER 45MPH AN \"ABNORMAL DRIVING CONDITION\" MAKING THE BUCKING/JERKING A \"NORMAL DRIVING CONDITION.\"  I HAVE THIS STATED IN WRITING ON MY SERVICE INVOICE & WOULD BE HAPPY TO PROVIDE THIS TO YOU. WHAT I WANT IS SOME SORT OF RESOLUTION.  I'M STUCK WITH A $60K TRUCK THAT I CANT SAFELY DRIVE.  ITS NOT SAFE TO HAVE A TRUCK \"BUCKING/JERKING\" ESPECIALLY WHILE DRIVING THRU TRAFFIC IN WHICH YOU'RE ALWAYS DRIVING LESS THAN 45MPH.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "3C63R3FL0EG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "12/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663965,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 DODGE RAM 3500. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE WAS INVOLVED IN A CRASH AND THE AIR BAGS FAILED TO DEPLOY. IT WAS UNKNOWN IF THE CONTACT SUSTAINED ANY INJURIES OR IF A POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE AIR BAG SENSOR WAS NOT OFFSET. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 33,285.",
        "vin": "3C7WRTCJ5EG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "10/09/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658742,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE THE TRUCK ABOUT 25 MILES TO WORK THE MORNING OF OCT. 9 2014 PARKED THE TRUCK IN A PARKING SPACE IN FRONT OF THE OFFICE AT ABOUT 7:30  CAME OUT AT APPROX.4:45  GOT IN THE TRUCK TURNED THE KEY ON WAITED FOR THE WAIT TO START IND. NOTICED THE WINDSHIELD WIPERS WERE ON BUT THE SWITCH WAS OFF THEN NOTICED THE MESSAGE CENTER SAID AIR BAG MAT. REQUIRED  BUT THEN WENT AWAY VERY QUICKLY THEN WENT TO PUT ON MY SEAT BELT THEN THOUGHT WHAT I SAW WAS SMOKE COMING FROM THE STEERING COLUMN THEN SAW A RED SEAT BELT LITE COME ON IN THE INSTRUMENT CLUSTER THEN THE AIR BAG BLEW OUT IN MY FACE CAUSING BRUISING AND ABRASIONS TO MY FACE AND UPPER BODY AREA STINGING TO MY FACE A CO WORKER TOOK ME TO THE E R WERE  I WAS SEEN.  *TR",
        "vin": "3C63RRHL1EG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2014",
        "dateOfIncident": "10/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653567,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PICKED UP MY NEW 2014 DODGE RAM 3500 6.4 , I NOTICED A RATTLE COMING FROM IN OR UNDER THE DASH BOARD . I ALSO NOTICED MY CRUISE CONTROL WOULD NOT WORK  AND TRACTION LIGHT STAYED ON . THE RATTLE ONLY OCCURS WHEN I AM STEPPING ON THE GAS AND GOING OVER ROUGH ROADS , I LET OFF THE GAS AND THE RATTLE STOPS . I TOOK IT TO MY DEALER ( DICK POE DODGE , EL PASO , TX. ) AND THEY FOUND NOTHING WITH THE RATTLE , THEY FIXED THE OTHER ISSUES . THEY HEARD THE RATTLE BUT SAID THEY COULD NOT PIN POINT IT , THEY FELT IT MIGHT BE THE THROTTLE PEDAL IT SELF , BUT DODGE WOULD NOT LET THEM SWAP IT OUT UNLESS THEY WERE 100% SURE THAT WAS THE ISSUE . SO HERE I AM STILL DRIVING WITH THE RATTLE . I DID OFFER TO PAY FOR THE PART AND MY ADVISER SAID HE WOULD NOT ALLOW THAT ONLY CAUSE HE WAS NOT 100% SURE IT WOULD FIX THE ISSUE .  UNDERSTAND THE SERVICE DEPT DID ALL THEY COULD TO HELP ME , IT WAS DODGE THAT TIED THEIR HANDS .  *TR",
        "vin": "3C7WRSAJ3EG"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638288,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE UNDER ATTEMPTED HARD ACCELERATION, THE GAS PEDAL BECOMES UNRESPONSIVE FOR SEVERAL MOMENTS.    SEVERAL TIMES, THIS ALMOST CAUSED AN ACCIDENT WHILE PERFORMING EVASIVE MANEUVERS TO AVOID GETTING HIT..  *TR",
        "vin": "3C63R3FL2EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "07/11/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638306,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO ISSUES THAT ARE CAUSED BY THE SAME PROBLEM:    1. WHEN ACCELERATING FROM A STOP THERE IS LIMITED POWER. IF I STEP ON THE THROTTLE HARD, IT SEEMS TO NOT MOVE FOR A SECOND OR TWO, THEN TAKES OFF.    2. WHILE DRIVING IN TRAFFIC THERE IS A SIGNIFICANT DELAY IN THROTTLE RESPONSE. IF I AM ON THE ACCELERATOR TRYING TO BLEND INTO TRAFFIC, THEN HAVE TO TAKE MY FOOT OFF THE ACCELERATOR FOR SOME REASON, THEN TRY TO ACCELERATE, IT DOES NOTHING FOR SEVERAL SECONDS.    THIS IS A VERY UNSAFE SITUATION FOR THE OCCUPANTS OF MY VEHICLE AND ANYONE ELSE ON THE ROAD. I WANT IT ADDRESSED BEFORE CAUSING AN ACCIDENT, OR EVEN WORSE DEATH TO SOMEONE.   *TR",
        "vin": "3C63R3JL5EG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2014",
        "dateOfIncident": "04/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637163,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO CROSS MULTIPLE LANE DIVIDE HIGHWAY WHILE SYNCHRONIZING THE TIMING OF THE CROSSING I HAD TO LET UP AND THEN DEPRESS ACCELERATOR PEDAL AND GOT NO RESPONSE FROM THROTTLE...  THE CLASSIC DEAD PEDAL RESPONSE.  IT CAN BE AVOIDED BUT SOMEONE UNFAMILIAR WITH THE VEHICLE CAN GET SERIOUSLY HURT/KILLED BY NOT UNDERSTANDING THE DEAD PEDAL LAG AND THOSE SITUATIONS WHERE IT OCCURS...  THIS MUST BE FIXED.  *TR",
        "vin": "3C63RPMLXEG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2014",
        "dateOfIncident": "08/23/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627856,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ATTEMPTING TO PASS A SLOW MOVING VEHICLE. I WAS TRAVELING AROUND 35MPH AT THE TIME. RIGHT BEFORE I WENT TO OVERTAKE THE VEHICLE I HAD TO LET OFF THE ACCELERATOR. WHEN THE PASSING LANE WAS CLEAR I GAVE THE TRUCK THE THROTTLE NEEDED TO PASS THE SLOW CAR, BUT IT WAS A GOOD 3-4 SECONDS AFTER PUSHING THE ACCELERATOR BEFORE THE TRUCK RESPONDED AT ALL. THIS WAS NOT TURBO LAG, IT WAS SIMPLY THE TRUCK DID NOT RESPOND TO MY INPUT WHEN NEEDED. I HAVE HAD THIS HAPPEN ALSO WHEN TRYING TO MERGE INTO TRAFFIC OR PULL OUT ONTO A BUSY STREET. IT IS DANGEROUS.  *TR",
        "vin": "3C63RRJL3EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "10/23/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610867,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS MAJOR LAG BETWEEN THE WHEN THE THROTTLE IS APPLIED TO WHEN THE ENGINE RESPONDS.  MANY ARE CALLING IT \"DEAD PEDAL\" BECAUSE THE ENGINE JUST DOESN'T RESPOND TO THROTTLE INPUT WHEN PRESSED QUICKLY.  IF THE THROTTLE IS PRESSED SLOWLY, THE ENGINE RESPONDS AS ONE WOULD EXPECT, BUT IN AN EMERGENCY SITUATION, WHERE ONE HAS TO STOMP ON THE PEDDLE, THERE'S NO RESPONSE.  FOR ME, I CAN SOMETIMES DO A 3 COUNT.  THE ISSUE HAPPENS FROM A DEAD STOP OR WHEN YOU ARE CRUISING.  WHEN CRUISING, IT'S EASY TO REPLICATE BECAUSE ALL YOU HAVE TO DO IT GIVE IT A LITTLE FUEL, AS IF YOU'RE GOING UP A SMALL HILL, LET OFF, THEN STOMP ON IT...  WHEN THIS IS DONE, THE ENGINE ACTS AS IF YOUR FOOT IS STILL OFF THE PEDDLE FOR WHAT FEELS LIKE ETERNITY.  I HAVE TAKEN IT TO THE DEALER MULTIPLE TIMES AND EACH TIME, I'M TOLD THIS IS HOW IT'S SUPPOSE TO BE, SO THERE IS NO FIX ... BUT A FLASH MIGHT BE AVAILABLE IN FUTURE TO RESOLVE THIS.  THE PROBLEM IS, NO ONE CAN CONFIRM RAM IS WORKING ON A FIX.  *TR",
        "vin": "3C63R3EL6EG"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609188,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AN ONGOING PROBLEM WITH THROTTLE RESPONSE SINCE NEW.  THERE IS A 1-2 SECOND LAG WHEN ATTEMPTING TO ENTER TRAFFIC AND WHEN TRYING TO PASS ANOTHER VEHICLE.  THIS PROBLEM AFFECTS NUMEROUS ASIAN EQUIPPED TRANSMISSIONS IN THE DODGE DIESEL TRUCKS AND MANY OWNERS ARE HAVING THE SAME PROBLEM WITH NO RESOLUTION OFFERED FROM THE DEALERSHIPS OR CHRYSLER CORP.  IT IS VERY DANGEROUS BECAUSE YOU ARE ATTEMPTING TO ACCELERATE WITH SAFETY BUT HAVE TO ACCOUNT FOR A LAG IN PERFORMANCE.  IT ALSO DOES NOT OCCUR ON ALL TRUCKS SO EQUIPPED AND VEHICLES EQUIPPED WITH THE ASIAN PRIOR TO 2014.  I HAVE FOUND IT NECESSARY TO ABORT MY ATTEMPT TO ENTER TRAFFIC DUE TO THIS LAG IN RESPONSE AND WAS NEARLY HIT FROM THE REAR BECAUSE ANOTHER STOPPED VEHICLE THOUGHT I WAS LEAVING MY POSITION.  HOPEFULLY THIS PROBLEM CAN BE RESOLVED WITH A COMPUTER REFLASH BUT SO FAR, CHRYSLER IS NOT INTERESTED IN A FIX.  *TR",
        "vin": "3C63R3HL0EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2014",
        "dateOfIncident": "10/10/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608419,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGEROUS POUR LAG WHEN ACCELERATOR IS DEPRESSED.  A SOLID TWO SECOND DELAY WHEN, FOR EXAMPLE, THE ACCELERATOR PEDAL IS DEPRESSED TO ENTER AN ON RAMP TO A HIGHWAY.  IT IS NOT SAFE TO HAVE TO PREDICT WHEN YOUR POWER WILL BE AVAILABLE.   *JS",
        "vin": "3C63R3ML9EG"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2014",
        "dateOfIncident": "06/29/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606787,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE LEAVING THE LOT I GO TO ACCELRATE AND THE TRUCK SLOWLY INCREASES SPEED AND THEN STARTS TO MOVE. THIS HAPPENS ALL THE TIME AND I TOOK THE TRUCK INTO THE DEALERSHIP AND THEY STATED THIS IS CHRYSLERS TORQUE MANAGEMENT SYSTEM. THIS SYSTEM HAS ALMOST CAUSED ME TO GET INTO A WRECK TWICE. I KNOW OF ONE FRIEND WHO HAS GOTTEN INTO A WRECK. I RESEARCHED THIS ISSUE AND SURE ENOUGH THERE ARE HUNDREDS OF MEMBERS ON DODGE AND CUMMINS FORUMS COMPLAINING OF THIS ISSUE AND CHRYSLER WILL NOT DO ANYTHING ABOUT IT. HERE IS A LINK TO SOME THREADS.    HTTP://WWW.CUMMINSFORUM.COM/FORUM/2013-GENERAL-DISCUSSION/1193537-QUICK-RANT.HTML    HTTP://WWW.CUMMINSFORUM.COM/FORUM/2013-GENERAL-DISCUSSION/1179305-DEAD-PEDAL.HTML      PLEASE MAKE CHRYSLER DO SOMETHING ABOUT THIS.  *TR",
        "vin": "3C63R3JL2EG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "12/23/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605825,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TPMS (TIRE PRESSURE MONITORING SYSTEM) QUIT READING THE TIRE PRESSURE ON MY TRUCK WITHIN THE FIRST FEW HUNDRED MILES OF OWNERSHIP.  MY TRUCK HAS BEEN IN THE SHOP FOR A TOTAL OF 6 TIMES FOR 8-10 DAYS FOR THIS ISSUE.  THE DEALER COULD NOT FIGURE WHY THE SYSTEM QUIT....THEY HAVE REPLACED THE SENSORS, THE RF HUB, ETC.  I HAVE JUST OVER 7,000 MILES ON THIS TRUCK AND THEY FINALLY GOT IT TO WORK CORRECTLY ABOUT A MONTH AGO.  THIS WEEK, IT HAS STOPPED FUNCTIONING AGAIN.    IF THE NHTSA REQUIRES THESE SYSTEMS TO BE ON VEHICLES FOR SAFETY, THEN CHRYSLER/MOPAR/DODGE SHOULD BE HELD ACCOUNTABLE TO ADDRESS THE ISSUE.  *TR",
        "vin": "3C63RRHL5EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605683,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING IN RIGHT LANE OF 4 LANE HIGHWAY AT 55MPH.  ANOTHER VEHICLE PULLED OUT FROM THE RIGHT INTO MY LANE RIGHT IN FRONT OF ME.  I LET OFF THROTTLE AND APPLIED BRAKES.  NOTICED AN OPENING IN TRAFFIC IN THE LEFT LANE.  TURNED ON THE TURN SIGNAL, STARTED TO SHIFT LANES AND APPLIED THROTTLE.  TRUCK WOULD NOT ACCELERATE FOR WHAT FELT LIKE 2-3 SECONDS.  BY THAT TIME THE CAR BEHIND ME IN THE LEFT LANE WAS RIGHT ON MY BUMPER.   NO ACCIDENT OCCURRED, BUT IT WAS A CLOSE CALL.  I HAD NOTICED A 1-2 SECOND THROTTLE DELAY A COUPLE TIMES WHILE MANEUVERING THROUGH TRAFFIC EARLIER IN THE DAY AS WELL.   *TR",
        "vin": "3C63R3GL1EG"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/16/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583205,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTERED MY TRUCK, TO GO TO WORK.  SHUT THE DRIVERS SIDE DOOR, AND  THE REAR DRIVERS SIDE REAR DOOR WINDOW BLEW OUT.  THE TRUCK WAS NOT EVEN A MONTH OLD.  I LIVE IN A RURAL RESIDENTIAL AREA, AND NOTHING HAD HIT IT, TOUCHED IT, ETC.  TEMP IN THE 50'S WITH RAIN.  COVERED UNDER MY INSURANCE WITH NO DEDUCTIBLE, BUT EVEN THE GLASS COMPANY HAS SAID THIS IS A MANUFACTURERS DEFECT.  IMPERIAL DODGE IN MENDON, MA DUCKING MY PHONE CALLS. CHRYSLER., TO THERE CREDIT SAID THEY WOULD CHECK INTO IT, (EVEN THOUGH YOU KNOW THEY WON'T).     POINT BEING, \"WHAT IF THIS HAD HAPPENED WHILE I WAS DRIVING?\"   EVEN THOUGH IT'S COVERED UNDER INSURANCE, THIS IS A MANUFACTURERS DEFECT!  AND THE DEALERSHIP REFUSES TO MAN UP AND TALK TO ME.  *TT",
        "vin": "3C63R3DJ6EG"
    }
]