[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456058,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Subaru Outback. The contact stated that while driving the oil warning light illuminated and he added more oil. The contact stated that the oil level was low. The contact noticed that several times the oil level was low prior to the normal mileage interval to change the oil. The contact stated that the vehicle was taken to an independent mechanic who stated that the oil was low. The failure was not diagnosed or repaired, however, the independent mechanic stated that the failure could be related to a mechanical engine issue. The contact stated that he found a Technical Service Bulletin Number: 02-157-14R; NHTSA ID Number: 10188219 (Power Train, Engine) which he related to the failure. The contact stated that he recently had an oil change at 88,000 and the oil warning light illuminated at 91,217. The manufacturer was not notified of the failure. The approximate failure mileage was 88,000.",
        "vin": "4S4BRBPC4E3"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455192,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The Roll Connector Harness failed, and use of the horn was disabled.  It is due to the mechanical steering of the vehicle, and fails over time.  As a multiple Subaru owner this has been a topic of safety with most of the owners with 2014 Subarus.  Subaru changed the design/engineering of this part in 2016 due to the concern.  Because they won't issue a recall, and the cost of repair is high ($400+), mainly due to the location of the part, many will not fix the issue.  There is no way to warn other drivers or deer without use of the horn.  This has put me in harm's way multiple times until I finally got it fixed.  I have contacted my dealer who says it is one of the more common issues they see with this year and probably 2015 as well.  It needs to be recalled so everyone with this problem can get their cars fixed instead of Subaru charging for a known problem and making money over safety.",
        "vin": "4S4BRBCC2E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449124,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Parking break did not disengage. It also blocked the key hole and car could not be moved. I called AAA and they could not even tow it because the gears would not switch from parking to neutral. While manipulating the car, the AAA technician does not know how, but was able to move the key and the gear, and then the car could start.  After some online research, there has been recalls for this problem in Australia in Subaru Outbacks of around this year.  Since AAA technician did not have to move in the end the car, there is no receipt of this event. It has happened twice by now.",
        "vin": "4S4BRBMC2E3"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "12/27/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11445596,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "my air bags didn't deploy when I hit a tree, and the seat belt gave loose. A police report was filed, and the car was evaluated by a collision center. The insurance company has not yet evaluated the vehicle. The air bag indicator light indicated the air bags were in good working order. I slid off the road in snow and hit a tree dead on and my entire front end crumpled, but my air bags didn't deploy and my seat belt was fully extended when I exited the vehicle to get into the ambulance.",
        "vin": "4s4brbac8e3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443248,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The ODS in our 2014 Subaru Outback has failed, and there is a constant beeping indicating that the air bag system is not functioning properly.  This was definitely an issue the last two winters, too, but with covid quarantine and illness, we were not able to address it then.  The airbag warning lights and sounds persist whether the seat is unoccupied or occupied by a child (14 or 16) or adult.  The dealer has diagnosed that the passenger seatbelt switch is also not working properly.  Their recommended remedy is replacing the entire seat base (~$1,300).  This vehicle also had a recall of the passenger side airbag inflator, which was replaced in May 2019 when our mileage was 88,000.  The issue started when weather turned cold in the winter of 2019.  When it is below about 45 degrees, the beeping starts, and it only ceases when the vehicle is warmed up and the engine is turned off then on again.  Our temperatures here in Eastern Washington get up to 115 in summer and down to 10 in winter.    We are thinking that this ODS defect may be due to a loosening of the components during the airbag service or the exact same faulty ODS component that was recalled in the Subaru Forrester recall (NHTSA campaign number 19V701).  It is important to us to have a functional airbag in case of a crash.",
        "vin": "4S4BRBCC5E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "10/01/2021",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435692,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Subaru Outback. The contact stated while the vehicle was at a standstill when the contact saw unknown warning lights were flickering on and off. The contact parked the vehicle and went inside a store when approximately 10 minutes later the vehicle was on fire. Fire marshals and police extinguished the fire and a report was taken; no one was injured. The vehicle was then towed to an insurance lot where the contact was awaiting a diagnosis. The manufacturer was informed of failure and was awaiting a response. The failure mileage was approximately 64,000.",
        "vin": "4S4BRCCC8E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431152,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving at highway speeds with over half a tank of gas and car just shut down, no warning lights, no noise just shut down and lost all control.  Fortunately was able to safely move to shoulder.  Sat there for a few minutes, called subaru dealer (no suggestions though i now know there is a recall (NHTSA 21V587000) for an identical problem in newer subaru outbacks and also plenty of online sites suggesting this has happened to other outbacks.  Car restarted and we were able to complete our ride home, very scary to think of what could have happened if we were in a different situation of traffic or highway conditions.",
        "vin": "4S4BRBCC3E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/04/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423392,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Horn malfunctions.  Press horn on steering wheel is dead silent. However, if I enable the Panic button on key, the alarm sounds. When I start the car after pressing Panic button, the horn I steering wheel works.  Sporadic operation.",
        "vin": "4S4BRBNC8E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2021",
        "dateOfIncident": "06/06/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419799,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The center differential or Viscous Coupling locks up after any extended highway driving.  The car lurches when turning sharply.  This is a 6-speed manual transmission.  This started at around 70,000 miles and is getting progressively worse now at 80,000 miles.  The tires have always been all the same, inflated according to spec.  New tires at about 72,000 miles.  From online research, the Viscous Coupling on Subarus fails very frequently.  This is a defective design resulting in a safety hazard, and requires expensive replacement.",
        "vin": "4S4BRBAC2E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/14/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403676,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR VIEW CAMERA WAS NOT DESIGNED OR MANUFACTURED PROPERLY AND IT ALLOWS MOISTURE TO GET INTO THE CAMERA ITSELF. AFTER A WHILE THE CAMERA WITH FUZZY PICTURE AND EVENTUALLY YOU CAN NOT VIEW THINGS PROPERLY OR SEE THEM AT ALL.  THERE ARE MANY OTHER COMPLAINTS BY OTHERS ON THE INTERNET.  THIS MAKES IT UNSAFE TO BACK THE CAR UP IF TRYING TO USE THE CAMERA TO ASSIST IN CLEARING THE PATH ESPECIALLY AT NIGHT.",
        "vin": "4S4BRCNC5E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396469,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  REAR LIFTGATE WILL NOT OPEN WHEN USING REMOTE OR SENSOR ON VEHICLE.  ONLY WAY TO OPEN IS TO CRAWL FROM INSIDE TO THE BACK, POP A LID AND THEN MANEUVER LATCH RELEASE.  NO WAY TO OPEN LIFTGATE FROM OUTSIDE THE VEHICLE. I'M 66 AND DISABLED.  2.  EXCESSIVE OIL USE REPORTED BY TECHNICIANS DURING OIL CHANGE.",
        "vin": "4S4BRBCC4E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/19/2021",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388917,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL FRONT  BRAKE PADS HARDLY WARN AFTER 100000 MILES. REAR BRAKE PADS WARE OUT AT ABOUT 30000 MILES. CHECKED TEMPERATURE OF FRONT ROTORS AFTER DRIVING BARELY WARM, REAR BRAKE ROTORS EXTREMELY HOT.",
        "vin": "4S4BRCCC3E3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360716,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LEAKS WATER INSIDE ON DRIVER SIDE FLOOR AND PASSENGER FLOOR.",
        "vin": "4S4BRCNC0E3"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354171,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM UNABLE TO REMOVE MY VEHICLE KEY FROM THE IGNITION AFTER PLACING MY 2014 SUBARU OUTBACK INTO THE PARK POSITION WHILE THE VEHICLE IS STATIONARY AND I WANT TO GET OUT OF IT. THIS IS ALSO HAPPENING TO MY FATHER'S 2016 SUBARU OUTBACK.  I DON'T WANT TO LEAVE THE KEY IN THE IGNITION WHEN IT IS PARKED ON A STREET.  I CAN'T LOCK THE VEHICLE WITH THE KEY IN THE IGNITION BECAUSE I WOULDN'T BE ABLE TO GET BACK INTO IT UNLESS I CARRIED A SECOND KEY.  PLEASE POST THIS FOR OTHER USERS.  IT SEEMS A VEHICLE DEFECT AT LEAST WITH A SUBARU OUTBACK AS ANOTHER FRIEND ALSO HAD THIS HAPPEN TO HER.  IT COST OVER $300 TO GET REPAIRED.  THANK YOU.",
        "vin": "4S4BRBCC9E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354324,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE HIGHWAY, AFTER DRIVING A LITTLE MORE THAN TWO HOURS.  THE DASH BOARD LIT UP WITH MANY OF THE \"TROUBLE LIGHTS\".   THE BRAKE LIGHT BEGAN FLASHING, EYE SIGHT WAS LIT, MEANING THAT IT WAS NO LONGER ENGAGED.  AT OIL TEMP.   CHECK ENGINE  TRANSMISSION.     ALL OF THE ABOVE.   I AM LOOKING AT A PICTURE THAT I TOOK SHOWING THE MILEAGE AND THE WARNING LIGHTS.  THE CAR CONTINUED TO OPERATE, WITHOUT ANY HESITATION AND I FELT THAT IT MUST \"JUST BE AN ELECTRONIC ISSUE\".  IT HAPPENED TO ME ONCE BEFORE, ABOUT TWO YEARS AGO.   I TOOK IT TO AN AUTO PARTS STORE FOR A QUICK DIAGNOSTIC AND THE GUY SAID IT WAS FINE TO DRIVE UNTIL I COULD GET BACK HOME TO THE DEALERSHIP.  TWO DAYS LATER, THE WARNING LIGHTS DISAPPEARED!       I UNDERSTAND NOW FROM VARIOUS THREADS ON THE INTERNET, THIS IS A COMMON PROBLEM WITH THE SUBARU'S CVT.   IT IS SAD BECAUSE THEY APPARENTLY HAVE BEEN INFORMED OF THIS ISSUE AND THEIR ONLY RESPONSE IS A REPAIR TO THE CVT ($1500-2000) OR A NEW TRANSMISSION ALL TOGETHER ($5- 8K).   I BOUGHT THIS VEHICLE AS NEW...  I HAVE NOT OWNED A SUBARU BEFORE BUT WANTED THE \"SECURITY OF A RELIABLE CAR\".  I DID PURCHASE THE EXTENDED WARRANTY, BUT THIS HAPPENED AFTER THE 100K MILES SO I HAVE NO RECOURSE.   PLEASE HELP ALL OF THE SUBARU OWNERS OUT THERE!!    IT'S NOT JUST THE OUTBACK MODEL, BUT SEVERAL OF THEIR VEHICLES AND IT SEEMS THAT IT IS SOMETHING THAT HAS BEEN HAPPENING OVER THE YEARS BUT THEY HAVE NOT BEEN MADE TO ADDRESS THIS DESIGN FLAW.  SAFETY WISE-- I DON'T KNOW IF THE VEHICLE WILL JUST QUIT IN THE MIDDLE OF TRAFFIC, OR WHAT.  WE TRIED THE \"GENERAL FIXES\" .... UNPLUG THE BATTERY FOR A FEW HOURS; WE PURCHASED A NEW GAS CAP SEAL; BUT NEITHER OF THOSE DID THE TRICK.    I WANTED TO SEND MY CASE TO YOU BUT, ALSO, THIS COMING WEEK, I WILL BE DROPPING IT OFF AT THE DEALERSHIP TO SEE WHAT THEY HAVE TO SAY.",
        "vin": "4S4BRCPC0E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352232,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED THE VEHICLE NEW, I WAS TOLD THAT THE OIL CHANGE NEEDED TO BE COMPLETED EVERY 7,500 MILES.  ALMOST IMMEDIATELY, THE LOW ENGINE OIL LIGHT WOULD COME ON SHORT OF 7,500 MILES.  SUBARU CHANGED WHEN THE OIL NEEDED TO BE CHANGED FROM 7,500 TO 6,000 MILES DUE TO THE OIL USAGE WITH THE ENGINE IN THIS OUTBACK YEAR.  RECENTLY, I CANNOT DRIVE MUCH BEYOND 3,000 MILES WITHOUT THE LOW ENGINE OIL COMING ON AFTER NEW OIL CHANGES BY THE DEALERSHIP!!  IT APPEARS AS THE VEHICLE AGES THE ENGINE OIL LIGHT IS COMING ON SOONER AND SOONER!!  I CHECKED THE OIL LEVEL AND IT IS LOW WHEN THE LIGHT DOES COME ON.  I FEEL SOMETHING IS VERY WRONG AND SUBARU NEEDS TO RECTIFY THE PROBLEM WHICH IS BECOMING VERY SERIOUS.  THIS IS MY FIRST SUBARU AND I'VE NOT EXPERIENCED THESE ISSUES WITH ANY OTHER VEHICLE THAT I'VE OWNED FOR THE PAST 30+ YEARS.  THANK YOU FOR YOUR TIME.",
        "vin": "4S4BRCPC4E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338130,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE CHANGE MY EMERGENCY  BREAKS. HOWEVER.KEEP THE LIGHT ON.IDID TAKE TO SUBARU DEALER AND THEY TOLL ME NOT USES THE EMERGENCY BREAK..SAMETHING IS WRONG..",
        "vin": "4S4BRBDC3E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "05/17/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337870,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR MAKES EXCESSIVELY LOUD ROARING, WHINING NOISE IN ACCELERATION; IT'S RESPONSE IS UNPREDICTABLE. IT DOESN'T SHIFT AND THE DIFFERENTIAL IS THE LIKELY SOURCE OF PROBLEM. CAR HAS BEEN PROPERLY MAINTAINED ALL ALONG.TWO INDEPENDENT MECHANICS REPORTED THE CVT MUST BE REPLACED. SUBARU SERVICE INFORMED ME AFTER 120K MILE SERVICING. IT CAN STALL WITHOUT WARNING ANYWHERE ANYTIME CAUSING ACCIDENT, INJURY ETC. THOUGH I'M TOLD IT'S DANGEROUS TO DRIVE SUBARU IS UNWILLING TO TAKE RESPONSIBILITY, EXCEPT PAYING HALF OF THEIR $8000 CHARGE FOR A RE-MANNED CVT...NO RECALL! WHAT'S IT GOING TO TAKE SUBARU? YOUR INTEGRITY IS COMPROMISED; YOUR CLAIM OF QUALITY IS FALSE. YOU WANT OWNERS TO PAY FOR YOUR TECHNOLOGY PROBLEM. THOUGH THE CVT HAS A LONG HISTORY OF FAILURE, SUBARU HASN'T SOLVED THE PROBLEM OR IMPROVED THE TECHNOLOGY. INSTEAD OWNERS PAY $4,000 FOR A NEW, FAULTY CVT AND SUBARU CONTINUES TO AVOID RECALL. BUYERS ARE THE LOSERS.",
        "vin": "4S4BRCCC6E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331724,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC FAN CONTROL SWITCH AND CONNECTOR MELTED",
        "vin": "4S4BRBCC9E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326060,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK-UP CAMERA STARTED FLICKERING WHEN BACKING IN PARKING LOT.  THAT HAPPENED TWICE.  THE NEXT TIME IT COMPLETELY STOPPED WORKING WHEN BACKING OUT OF DRIVEWAY.  THE SCREEN DOESN'T EVEN SHOW THAT I'M BACKING-UP.  *TR",
        "vin": "4S4BRCMCXE3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2020",
        "dateOfIncident": "05/23/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325641,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR ENGINE DIES FOR A FEW SECONDS WHEN YOU MAKE A TURN OR ABOUT TO ENTER A HIGHWAY. THEN IT JUMPS AS IF NOTHING HAPPENED VERY DANGEROUS I AM SCARED TO DEATH.  *TR",
        "vin": "4S4BRBKC8E3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2020",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324815,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 50K MILES, A YEAR OR SO AGO, THIS CAR DEVELOPED A SERIOUS HESITATION WHEN TAKING OFF FROM A STANDSTILL OR TRYING TO GAIN SPEED FROM ANYWHERE FROM 20 TO 40 MPH. TRIED SEVERAL METHODS TO CORRECT THIS SUGGESTED BY OUR MECHANIC WHICH INCLUDED INJECTOR CLEANER, HIGH OCTANE GAS, MORE CLEANER, BETTER QUALITY GAS AND NOTHING HAS WORKED, WE HAVE READ THAT THERE NUMEROUS CUSTOMERS WITH THIS SAME PROBLEM BUT SUBARU DOES NOTHING. THERE SHOULD BE A RECALL ORE BUY-BACK. WE ARE CONCERNED WE WILL BE IN AN ACCIDENT BECAUSE IT WON'T MANEUVER PROPERLY WHILE IN TRAFFIC.  *TR",
        "vin": "4S4BRCAC3E3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318118,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DELAYED GAS PEDAL RESPONSE=HESITATION TO ACCELERATE WHEN GAS PEDAL ENGAGED FROM A STATIONARY STOP. I HAVE EXPERIENCED THIS FAILURE TO ACCELERATE THE VEHICLE FROM A STOPPED POSITION IN EXCESS OF 25 TIMES OVER A MORE THAN 5 YEAR PERIOD.  THE SUBARU IS NOT MINE BUT A RELATIVES CAR.   IN EARLY FEBRUARY 2019, I WAS STOPPED AT A LIGHT ATTEMPTING TO MAKE A LEFT HAND TURN.  TRAFFIC COMING AT ME WAS UP A HILL WITH A GRADE OF 6% OR MORE WHICH LIMITED THE LINE OF SIGHT FOR SOMEONE WANTING TO MAKE A LEFT HAND TURN AT THAT INTERSECTION. AS I STEPPED ON THE GAS TO MAKE THE TURN THERE WAS NO RESPONSE FROM THE CAR. THE CAR  COMING UP THE HILL WAS UPON ME. I PUMPED THE GAS SEVERAL TIMES AND LUCKILY WAS ABLE  TO MAKE IT THROUGH THE INTERSECTION. MY WIFE AND I WERE INCHES AWAY FROM BEING WACKED BY THE OTHER CAR. THE CAR APPROACHING HAS A SPEED LIMIT OF 45 MPH BUT WAS  MOST LIKELY TRAVELING IN EXCESS OF 45 MPH. ONCE THROUGH THE INTERSECTION, WE PULLED TO THE CURB TO GATHER OURSELVES.  THAT'S WHEN I SAID ENOUGH IS ENOUGH AND SENT TWO LETTERS TO TOM DOLL OF SUBARU. ONE   IN FEBRUARY & APRIL 2019. HE OF COURSE PASS IT ON TO CSERVICE. THE INDIVIDUAL WROTE  BACK SAYING NOTHING IS WRONG.  I AM A PROFESSIONAL ENGINEER AND HAVE BEEN FOR MANY YEARS. I POINTED OUT ALL ENGINEERS INCLUDING AUTOMOTIVE ENGINEERS MUST ADHERE TO A CODE OF ETHICS & ADHERE TO THE ''HIGHEST STANDARDS OF HONESTY AND INTEGRITY, AND MUST BE DEDICATED TO THE PROTECTION OF THE PUBLIC HEALTH, SAFETY AND WELFARE AND MUST ADHERE TO THE HIGHEST PRINCIPLES OF ETHICAL CONDUCT.'' THAT MEANT NOTHING TO SUBARU.  CLEARLY FROM MY EXPERIENCE THERE IS A PROBLEM WITH THE 2014 SUBARU OUTBACK AND IT'S  RANDOM FAILURE TO ACCELERATE DUE TO A DELAYED GAS PEDAL RESPONSE.",
        "vin": "4S4BRCMC1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11315685,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE AIR BAGS DEPLOYED WITH EXCESSIVE FORCE WHILE DRIVING AT APPROXIMATELY 20 MPH    THE CONTACT'S VEHICLE T-BONED THE FRONT OF ANOTHER VEHICLE    THE CONTACT SOUGHT MEDICAL ATTENTION FOR FIRST DEGREE BURNS AND A CUT ON ONE SIDE OF THE FACE.    THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 20 MPH, HIS VEHICLE T-BONED THE FRONT OF ANOTHER VEHICLE. AS A RESULT THE FRONTAL AIR BAGS DEPLOYED WITH EXCESSIVE FORCE. THE POLICE DEPARTMENT WAS PRESENT AND A REPORT WAS ISSUED. THE VEHICLE WAS TOWED TO AN IMPOUND LOT. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSTIC. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 140,000.",
        "vin": "4S4BRBLC0E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309305,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE LAST YEAR, THIS VEHICLE HAS HAD TWO DISTINCT TAKATA AIRBAG RECALLS.  I HAVE RECEIVED NOTICES FROM OUR DEALERSHIP AND FROM SUBARU CORPORATE, ATTACHED.  I AM LIVING IN BOSNIA AS A US DIPLOMAT.  THERE IS NOT A SUBARU DEALERSHIP IN THIS COUNTRY.  I ACCOMPLISHED THE LAST RECALL, WITH SIGNIFICANT LOGISTICAL DIFFICULTY, WITH THE HELP OF THE SUBARU DEALERSHIP IN CROATIA.    HOWEVER, THERE IS A CURRENT OPEN RECALL FOR THE PASSENGER-SIDE AIRBAG (RECALL ID BTM3-EFX).  DESPITE MULTIPLE EMAILS TO THE DEALER (BYER SUBARU IN ALEXANDRIA, VA) WHERE WE PURCHASED THE CAR AND TO MY CONTACTS IN CROATIA, I HAVE NOT RECEIVED ANY ASSISTANCE.  THE DEALERSHIP IN CROATIA WAS, SUPPOSEDLY, CONTACTING SUBARU ITALIA, BUT TO DATE, I HAVE NOT MADE ANY PROGRESS IN RESOLVING THIS RECALL.  I VERY MUCH NEED GUIDANCE AS THIS IS A FAMILY CAR AND, ACCORDING TO THE RECALL NOTICES, THIS IS A SIGNIFICANT SAFETY ISSUE.  WHEN I CONTACTED SUBARU CORPORATE IN THE PAST, I WAS ADVISED THAT, BECAUSE THE CAR WAS OVERSEAS, THEY BELIEVED THEY WERE ABSOLVED OF ANY RESPONSIBILITY, A RIDICULOUS CLAIM.",
        "vin": "4S4BRBNC6E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "12/11/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308821,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION ON MY 2014 SUBARU OUTBACK BLEW ON ME IN DECEMBER 2019.  I WAS IN MOTION TURNING OFF THE HIGHWAY TO AN INTERSECTION",
        "vin": "4S4BRCCCXE3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308094,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2014 SUBARU OUTBACK WITH AN EXCESSIVE OIL CONSUMPTION ISSUE. SUBARU RECENTLY SETTLED THE CLASS ACTION FOR THE SAME ISSUE FOR SEVERAL VEHICLE MODELS BUT NOT MY VEHICLE IS INCLUDED. MY VEHICLE HAS SHOWN THE EXCESSIVE OIL CONSUMPTION ISSUE WHEN I DROVE ABOUT 50K MILES. I WENT TO SUBARU DEALERSHIP, SUBARU IMPORTS OF TROY IN MI, FOR THE ISSUE BUT THEY JUST REFILLED THE OIL WHEN I ASKED THEM TO CHECK IT. AT 61,721 MILES, THE DEALERSHIP FIRST TESTED IT BUT I BELIEVE THEY OVERFILLED THE OIL WHEN TESTING BECAUSE THE ISSUE CAME BACK AFTER THE TEST. WHENEVER I COMPLAINED ABOUT THE ISSUE, THE DEALERSHIP JUST REFILLED THE OIL. BUT RECENTLY WHEN I STRONGLY COMPLAINED ABOUT IT BY MENTIONING REPORTING TO NHTSA, THE DEALERSHIP ASKED ME TO CONTACT SUBARU AMERICA AND TO GET THE APPROVAL OF EXTENDED WARRANTY SO THAT THEY CAN FIX MY CAR. I CONTACTED SUBARU AMERICA BUT THE CUSTOMER SERVICE SAID THAT THEY CAN'T PROVIDE ME WITH THE EXTENDED WARRANTY BECAUSE I HAVE PASSED 5YEAR/60KM WARRANTY ALREADY. I REPORTED THE ISSUE TO THE SUBARU DEALERSHIP BEFORE THE WARRANTY EXPIRED BUT THEY CHEATED ME TO OVERFILL THE ENGINE OIL AND KEPT REFILLING WHEN I WENT THERE WITH THE LOW ENGINE OIL WARNING LIGHT ON. THE FACT IS THAT THE ISSUE CAME BEFORE THE WARRANTY BUT IT WAS NOT TAKEN CARE OF IN A FAIRWAY. SUBARU AMERICA SHOULD TAKE THE RESPONSIBILITY OF THE DEFECTIVE PART FOR MY VEHICLE AND COMPENSATE MY TIMES AND STRESSES BECAUSE I HAVE HAD TO GO TO THE DEALERSHIP EVERY OTHER MONTH TO REFILL THE OIL AFTER 50K MILES. I HAVE HAD SEVERAL VEHICLES BUT SUBARU HAS ONLY THIS ISSUE. AND SUBARU AMERICA SHOULD CHECK THE DEFECTIVE ENGINE PARTS FOR OTHER VEHICLES, WHICH ARE NOT INCLUDED IN THE SETTLEMENT FOR THE SAFETY OF THEIR CUSTOMERS. I AM CONCERNED THAT THE DEALERSHIP AND SUBARU AMERICA KEEP CHEATING THE CUSTOMERS BY NOT TAKING CARE OF CUSTOMER SAFETY. THANKS,",
        "vin": "4S4BRCLC2E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306786,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BACK-UP CAMERA COMPLETELY STOPPED WORKING.  THE CAR DOESN'T EVEN SWITCH INTO A MODE WHERE I CAN SEE THE CAMERA WHEN I SHIFT THE CAR INTO REVERSE; IT STAYS ON WHATEVER SCREEN IT WAS ON.  NOTHING HAPPENED TO THE VEHICLE, IT JUST QUIT WORKING YESTERDAY AFTERNOON.",
        "vin": "4S4BRCNC9E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298349,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE 5/2019 MY SUBARU HAS BEEN IN FOR SERVICE 5 TIMES DUE TO THE DASHBOARD LIGHTS FLASHING WHILE DRIVING. THE BRAKE LIGHT, CHECK ENGINE LIGHT, AND THE CRUISE CONTROL LIGHT. MY REMOTE STARTER AND RADIO DO NOT WORK EITHER. EACH TIME IT'S BROUGHT IN FOR THE SAME PROBLEM I AM GIVEN A DIFFERENT REASON, CHARGED A FEE AND SENT ON MY WAY, UNTIL IT HAPPENS AGAIN! GETTING A LITTLE TIRED OF HAVING MY CHAIN YANKED. SUBARU NEEDS TO DO A RECALL FOR THIS RECURRING PROBLEM.MY CAR RAN FINE UNTIL THE PASSENGER AIR BAG WAS CHANGED, DUE TO A RECALL.",
        "vin": "4S4BRDKCXE2"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291766,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY WINDSHIELD CRACKED IN AN ARC PATTERN STARTING FROM THE DRIVERS SIDE TO PASSENGER SIDE RESULTING IN A PERFECT SYMMETRICAL PATTERN.  IT WAS AROUND 10 DEGREES OUTSIDE AND THE VEHICLES DEFROST AND HEAT WERE ON HIGH. NO OBJECT HIT WINDSHIELD BEFORE CRACK FORMED. VERY LOUD CRACKING NOISE AND SLOW FROM LEFT TO RIGHT FORMATION. I WENT TO THE DEALERSHIP TO HAVE THEM LOOK AT WHAT CAUSED CRACK AND THEY SAID \"MUST HAVE BEEN CAUSED BY A ROCK\".  AT THAT TIME THERE WAS NO EVIDENCE OF A CHIP IN WINDSHIELD, JUST THE CRACK. LATER IN THE YEAR I AGAIN WENT TO THE DEALERSHIP BECAUSE OF THE TECHNICAL BULLETIN ABOUT CRACKS HAPPENING IN THIS LOCATION ON THE WINDSHIELD AND WHILE USING DEFROSTER. THEIR RESPONSE WAS NOT OCCURRING WITH  2014 OUTBACKS.  IN JUNE I WENT TO LOU FUSZ DEALERSHIP TO DISCUSS THIS PROBLEM.  BY NOW MORE THAN 6 MONTHS SINCE OCCURRENCE, THERE ARE ROCK CHIPS IN WINDSHIELD THEREFORE THEY SAID CAUSED BY ROCK.  I FIRMLY BELIEVE THIS HAPPENED DUE TO THE DEFROST MECHANISM LOCATION AND THE INTEGRITY OF THE WINDSHIELD GLASS.",
        "vin": "4S4BRCLC6E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287867,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CVT TRANSMISSION STALLED ON FREEWAY, THEN LOCKED UP, PUTTING US INTO SKID. VERY DANGEROUS SITUATION THAT COULD HAVE RESULTED IN SERIOUS INJURY ACCIDENT.  WAS ABLE TO RESTART AND LIMP TO EMERGENCY LANE. SPEED WAS 65 MPH ZONE. VERY SCARY FOR US. HAD PREVIOUSLY COMPLAINED TO SUBARU OF PROBLEM, BUT THEY DIDN'T GIVE IT A FULL DIAGNOSTIC AND SAID TO DRIVE IT UNTIL IT BROKE. WE HAVE OPENED A CASE WITH SUBARU AMERICA.",
        "vin": "4S4BRBLC8E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "11/26/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287633,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY FAILING PREMATURELY EVEN NEW.  LEAVING DRIVERS AND OCCUPANTS STRANDED IN WINTER FREEZING , OR SUMMER HOT WEATHER.  I HAD TOTAL OF 4 EPISODES OF BATTERY FAILURE IN MY 2014 OUTBACK BOUGHT NEW ON 8/12/2014.  SUBARU FACTORY BATTERY FAILED TWICE WHEN CAR WAS LESS THEN 20K MILES IN JANUARY 2017, REPLACED UNDER WARRANTY, THEN AGAIN FAILED TWICE AGAIN WITH THE REPLACED BATTERY 11/26/2019 AT 47K MILES.  SUBARU DEALER REFUSED TO REPLACE THE BATTERY THIS TIME STATING WARRANTY HAD EXPIRED. RESEARCHED ONLINE FOUND SIMILAR COMPLAINTS ABOUT SUBARU BATTERIES BELOW:    VEHICLE 2015 SUBARU OUTBACK 2.5I LIMITED 4DR SUV AWD (2.5L 4CYL CVT) REVIEW I HAVE HAD PERSISTENT PROBLEMS WITH A DEAD BATTERY. IF I DON'T DRIVE THE CAR FOR AT LEAST ONE-HALF HOUR EACH DAY,THE ...  3.9/5(196)  MILEAGE: 106400  DRIVE TRAIN: ALL WHEEL DRIVE  MPG: 25 COMBINED MPG  SUBARU BATTERY PROBLEMS? QUESTIONS ABOUT SUBARU BATTERY ON ...  HTTPS://WWW.JUSTANSWER.COM/TOPICS-BATTERY    SUBARU BATTERY PROBLEMS A CAR OR AUTOMOBILE BATTERY IS A DEVICE WHICH STORES AND SUPPLIES ELECTRICAL ENERGY. THIS IS SUPPLIED TO THE IGNITION SYSTEM, APPLIANCES AND LIGHTS, AND TO POWER THE STARTER MOTOR. AN AUTOMOBILE BATTERY CAN BE RECHARGED WHICH BEGINS TO HAPPEN ONCE THE ENGINE IS STARTED.  BATTERY ON MY NEW 2017 SUBARU FORESTER RUNS DOWN - CAR ON ...  NOV 18, 2017  ABOUT 3 WEEKS AGO I HAD A DEAD BATTERY THAT I NEEDED ...  JUL 21, 2012  SUBARU ALTERNATOR TROUBLESHOOTING QUESTIONS ANSWERED",
        "vin": "4S4BRBPC4E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "07/11/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276865,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. WHILE DRIVING, THE TRACTION CONTROL, BRAKE, AND ATM OIL TEMPERATURE WARNING INDICATORS ILLUMINATED. WHEN THE FAILURE OCCURRED, THE GEARS AND CRUISE CONTROL FAILED TO FUNCTION. THE VEHICLE WAS TAKEN TO GROVE SUBARU OF SILVERTHORNE (171 9TH ST, SILVERTHORNE, CO 80498, (970) 276-6039) WHERE IT WAS DIAGNOSED THAT CODE: P0971 FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED DUE TO THE REPAIR FEES. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 95,000.",
        "vin": "4S4BRBCC1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270331,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING AT LOW SPEED, AIRBAG SPONTANEOUSLY DEPLOYED.",
        "vin": "4S4BRBCC6E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265900,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EBRAKE COMES ON INTERMITTENTLY WHILE DRIVING IN TOWN.",
        "vin": "4S4BRBMC5E3"
    },
    {
        "components": "AIR BAGS,STRUCTURE,VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255919,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT ABOUT 65 MILES/HOUR ON HIGHWAY 17 NEAR APALACHIN, NY,  WHEN A DEER JUMPED FROM THE RIGHT SIDE AND HIT THE FRONT OF MY CAR.  BOTH FRONT AIRBAGS DEPLOYED.  IMMEDIATELY, THE GAS RELEASED FROM THE  AIRBAGS COMPLETELY FOGGED THE WINDSHIELD REDUCING VISIBILITY ZERO, SO I  COULD NOT SEE WHERE I WAS GOING DURING THE BRAKING PERIOD.  FORTUNATELY,  I ONLY SHIFTED TO THE OTHER LINE AND THERE WERE NO OTHER CARS AROUND.  THE GAS DEPOSIT REMAINED ON THE WINDSHIELD AND I HAD TO USE A CLOTH TO  CLEAN IT.  IN MY OPINION, THE FOGGED WINDSHIELD RESULTING FROM THE  AIRBAG DEPLOYMENT WAS A MUCH HIGHER SAFETY HAZARD THAN THE COLLISION  WITH THE DEER ITSELF.    AN UNRELATED COMPLAINT IS THAT AFTER THE CAR STOPPED, THE DOORS WERE  BLOCKED (WOULD NOT OPEN) FOR HALF A MINUTE OR SO.",
        "vin": "4S4BRBCCXE1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253679,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LIGHT COMES ON AFTER 3000 MILES FROM OIL CHANGE. SOMETIMES IMMEDIATELY AFTER OIL CHANGE DESPITE HAVING FULL LEVEL. OIL LEVELS CAN DROP SIGNIFICANTLY FROM OIL CHANGES. OIL HAS BEEN CHANGED BY DEALER AND OWNER WITH SAME RESULTS. HAPPENS WHEN ASCENDING AND DESCENDING HILLS.",
        "vin": "4S4BRBDC7E3"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245404,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. DURING A RAINSTORM, WATER ENTERED THE VEHICLE THROUGH THE SUN ROOF AND DRENCHED THE CABIN. THE FAILURE CAUSED $1,769 WORTH OF DAMAGE. THE FAILURE OCCURRED BECAUSE A DRAIN TUBE ON THE SUN ROOF BECAME CLOGGED AND CAUSED THE WATER TO BACK UP AND ENTER THE VEHICLE. THE VEHICLE WAS TAKEN TO CHATHAM PARKWAY SUBARU (7 PARK OF COMMERCE WAY, SAVANNAH, GA 31405, (888) 430-0231) WHERE IT WAS DETERMINED THAT THE DRAINS WERE CLOGGED. THE DEALER CLEANED THE DRAINS, REPLACED THE CARPET, AND REPLACED THE AMPLIFIER AT THE CONTACT'S EXPENSE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT STATED THAT THE FAILURE WAS MISSED DURING AN EARLIER SERVICE VISIT WITH THE DEALER THAT COULD HAVE PREVENTED THE FAILURE. THE FAILURE MILEAGE WAS 89,904.",
        "vin": "4S4BRCNC8E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244900,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING LOCALLY THE INDICATOR LIGHTS ON THE DASHBOARD STARTED FLASHING (CRUISE CONTROL, CHECK ENGINE AND BRAKE LIGHTS).PARKED CAR, CHECKED GAS CAP AND DISCONNECTED BATTERY AND CLEANED TERMINALS, PROBLEM CONTINUED. TOOK THE CAR TO OUR LOCAL AUTO MECHANIC (AFTER SOME NOT SO PLEASANT DEALINGS WITH SUBARU) 7/22/19 HE PERFORMED COMPUTER DIAGNOSTIC AND FOUND FAULTY OXYGEN SENSOR. $601.38. CAR WORKED WELL UNTIL TODAY. RETURNING HOME FROM STORE THE LIGHTS ARE FLASHING AGAIN BACK TO THE MECHANIC. 18,000 MILES ON THE CAR!",
        "vin": "4S4BRDKCXE2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240854,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT HEARD AN ABNORMAL NOISE COMING FROM THE ENGINE AND THE LOW OIL PRESSURE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND IRA SUBARU (LOCATED AT 97 ANDOVER ST, DANVERS, MA 01923, (978) 739-8850) WHERE IT WAS DIAGNOSED THAT A SHORT BLOCK MOTOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE CONTINUED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 79,000.",
        "vin": "4S4BRBCC0E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234255,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT STATED THAT THE BRAKE INDICATOR ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO SUBARU NAPLETONS SCHAUMBURG SUBARU (911 WEST HIGGINS ROAD, SCHAUMBURG, IL 60195, (847) 884-6000) WHERE IT WAS DIAGNOSED THAT THE BRAKE MODULATOR FAILED. THE MODULATOR WAS NOT REPLACED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: N1-45447123655. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 57,000.",
        "vin": "4S4BRDMC0E2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11232730,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 SUBARU OUTBACK. THE CONTACT WAS DRIVING ABOUT 35 MPH, WHEN AN ONCOMING VEHICLE LOST CONTROL AND CRASHED INTO ANOTHER VEHICLE, HIT THE GUARD RAIL AND CAUSING THE CONTACT'S VEHICLE TO REAR END THE VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT AND TWO OF HER CHILDREN, IN THE VEHICLE, RECEIVED CUTS AND BRUISES THAT REQUIRED MEDICAL ATTENTION. ALL THREE WERE TAKEN TO THE EMERGENCY ROOM. THE VEHICLE WAS TOTALED AND WAS TOWED TO A TOW YARD. THE DEALER WAS NOT CALLED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND WAS PROVIDED A CASE NUMBER. THE CONTACT STATED THAT THREE MONTHS PRIOR TO THE CRASH, THE A RECALL (NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS)) WAS REPAIRED BY THE SHEEHY SUBARU OF SPRINGFIELD DEALER (70- 957-1623, LOCATED AT 6571 BACKLICK ROAD, SPRINGFIELD, VA 22150. THE FAILURE MILEAGE WAS 116,000.",
        "vin": "4S4BRCDC4E3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "09/30/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230806,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2017, THE DRIVER'S SIDE REAR DOOR CHILD SAFETY LOCK ON MY 2014 OUTBACK BECAME STUCK IN THE LOCKED POSITION. THIS MEANS PASSENGERS CANNOT GET OUT UNLESS SOMEONE OPENS THE DOOR FROM THE OUTSIDE. THIS IS A HUGE SAFETY CONCERN. ASKED DEALERSHIP TO FIX IT FOR FREE, BUT THEY WOULD ONLY GIVE ME HALF OFF. THEN TODAY (JULY 10, 2019) I DISCOVERED THAT THE SAME DOOR ON MY 2009 IMPREZA IS HAVING A SIMILAR PROBLEM. THE SWITCH CAN STILL MOVE FROM LOCKED TO FREE, BUT THE DOOR WILL NO LONGER OPEN FROM THE INSIDE. I THINK SUBARU HAS A DEFECTIVE CHILD SAFETY LOCK THAT NEEDS TO BE RECALLED.",
        "vin": "4S4BRBAC0E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/29/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228647,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE TRANSMISSION WILL SLIP OUT OF GEAR NOT ALLOWING YOU TO ACCELERATE AND THEN IT WILL GO BACK INTO GEAR SHIFTING INTO GEAR EXTREMELY HARD. NOT SAFE FOR HIGHWAY DRIVING",
        "vin": "4S4BRCCC9E3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11222307,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS PART OF THE TAKATA RECALL, WE HAD THE AIRBAGS ON OUR 2014 SUBARU OUTBACK REPLACED BY THE DEALER ON MAY 8, 2019.  ON MAY 22, 2019, WE WERE SITTING AT A CITY STOPLIGHT WHEN WE WERE HIT HEAD ON BY ANOTHER DRIVER GOING 40-50 MPH.  IN SPITE OF A DIRECT HIT TO THE FRONT AIRBAG SENSORS, THE AIRBAGS DID NOT DEPLOY ON OUR 2014 SUBARU OUTBACK.  WHEN WE NOTIFIED THE DEALER WHO DID THE REPLACEMENT OF THE FAILED AIRBAGS, THEY REFUSED TO COMMENT.",
        "vin": "4S4BRCDC8E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218011,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. WHILE REVERSING OUT OF A DRIVEWAY, THE CONTACT STOPPED THE VEHICLE, SHIFTED INTO PARK, AND EXITED THE VEHICLE. SUDDENLY, THE VEHICLE LURCHED FORWARD AND STRUCK AND DRAGGED THE CONTACT. THE VEHICLE DROVE OVER A BRUSH AND FINALLY CAME TO A STOP. THE CONTACT WAS NOT INJURED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT STATED THAT THE VEHICLE HAD AN EXTENDED WARRANTY UP TO 120,000 MILES. THE FAILURE MILEAGE WAS 93,880.",
        "vin": "4S4BRBLC1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217518,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG LIGHT AND WARNING TONE SOUND WHEN OCCUPANT IS IN SEAT AND CAR IS MOVING.  BEEN TO THE DEALER 6 TIMES.  THE SEAT BELT LATCH WAS REPLACED, OCCUPANT DETECTION SENSOR REPLACED, SEAT WAS REPLACED.  SENSORS RECALIBRATED BY DEALER.  PROBLEM STILL PERSISTS AND WE'RE NOW TOLD IT CAN'T BE FIXED.  DEALER WILL NOT SAY IF THE AIRBAGS WILL OR WILL NOT DEPLOY IN AN ACCIDENT.  CAR IS ESSENTIALLY UNDRIVEABLE AS THE WARNING TONE IS CONSTANT AND PASSENGER RESTRAINT AND SAFETY SYSTEM IS COMPROMISED.",
        "vin": "4S4BRBDC9E3"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216994,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF DRAINS CLOG CAUSING WATER TO LEAK INTO CAR.  THIS OCCURS WHEN RAINING OR WASHING CAR.  INTERIOR WINDOWS BECOME VERY FOGGY AND OFTEN TIMES IT IS NECESSARY TO WIPE THEM DOWN WITH A CLOTH.  DEALER WAS WILLING TO REMOVE STANDING WATER FROM CAR AND SEATS AS A \"ONE TIME COURTESY\" AND INDICATED THAT THEY WOULD CLEAR DRAINS DURING EACH CAR SERVICE PERFORMED BY THEM.  RECENTLY HAD THE DRAINS CLEANED, WE HAVE HAD 4 FLASH FLOOD WARNINGS SINCE THEN AND WATER CONTINUES TO LEAK INTO THE INTERIOR (BOTH WHEN DRIVING OR STATIONARY).  THIS IS A KNOWN PROBLEM TO SUBARU BUT I HAVE YET TO SEE A RECALL.  THIS IS CERTAINLY BOTH A SAFETY AND HEALTH ISSUE (VISIBILITY/MOLD/MILDEW). LEAKING HAS OCCURRED DURING THE PAST 3 YEARS, PERHAPS A BIT MORE. WE HAVE A 2006 VOLVO THAT HAS A SUNROOF AND NO LEAKS!",
        "vin": "4S4BRBDC4E3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/27/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210595,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS CRACK IN WINDSHIELD, BEGINNING AT THE BOTTOM CENTER, WHILE CAR WAS PARKED OVERNIGHT.",
        "vin": "4S4BRBLC0E3"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "04/28/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208459,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS KEEP BURNING OUT EVERY FEW MONTHS.",
        "vin": "4S4BRBEC0E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206590,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF THE NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIR WERE AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER BUD CLARY CHEVROLET (1030 COMMERCE AVE, LONGVIEW, WA 98632 (360)-423-1700) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION CONNECTED. .*BF  AIRBAG WAS REPLACED.*JB",
        "vin": "4S4BRBDC7E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204974,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SUMMER SUBARU (7211 W MEQUON RD, MEQUON, WI 53092, (262) 208-7660) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BRBLC0E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196000,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMAKA RECALL   NOTICE IN MARCH 2019 FOR THE PASSENGER FRONT AIRBAG REPLACEMENT AND CONTACTED MY TWO LOCAL DEALERS IN RICHMOND VA  FIND DAD ONE DEALER IS BROOKE UP TILL JULY 2 019 AND THE OTHER IS BOOKED UP UNTIL AUGUST 2019.CALL",
        "vin": "4S4BRCNC0E3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192490,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS IN THE LAST SIX MONTHS MY HOOD LATCH HAS RELEASED WHILE DRIVING ON THE HIGHWAY AT SPEEDS OF 65 TO 70 MPH. THE FIRST OCCASION WAS ON NOVEMBER 14, 2018 AND THE SECOND OCCASION WAS TODAY FRIDAY MARCH 29, 2019. ON BOTH OCCASIONS, THE SAFETY LATCH HELD BUT THE HOOD VIBRATED UP AND DOWN UNTIL I WAS ABLE TO COME TO A COMPLETE STOP AND PUSH DOWN ON THE HOOD TO RE-ENGAGE THE PRIMARY LATCH.  ON BOTH OCCASIONS I WAS SURROUNDED BY NUMEROUS VEHICLES GOING THE SAME SPEED. I HAVE SIGNIFICANT CONCERNS THAT THE HOOD MAY OPEN COMPLETELY WHILE I AM DRIVING DOWN THE HIGHWAY CREATING AN ACCIDENT AND OR INJURIES.  I HAVE CHECKED THE MECHANISM AND THERE ARE NO OBSTACLES. ADDITIONALLY, THE TIME BETWEEN THE FIRST DISENGAGEMENT AND THE SECOND WAS MORE THAN FOUR MONTHS AND THE VEHICLE HAD NOT BEEN IN FOR ANY SERVICES THAT WOULD REQUIRE THE HOOD BEING OPENED.  I HAVE SEEN THAT OTHER SUBARU MODELS HAVE BEEN RECALLED FOR THIS SAME ISSUE AND BELIEVE THIS NEEDS TO BE THOROUGHLY INVESTIGATED. A REVIEW OF THE WEB SHOWS NUMEROUS COMPLAINTS. I PURCHASED THIS VEHICLE NEW AND DID NOT HAVE ANY PROBLEMS PRIOR TO THESE TWO OCCASIONS.",
        "vin": "4S4BRCLC2E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/23/2019",
        "dateOfIncident": "03/23/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191094,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    RECEIVED RECALL NOTICE WEEK OF 3/11/2019.  CALLED SUBARU  DEALER (206-782-7475) AS INSTRUCTED IN LETTER ON 3/23/2019.  INFORMED THAT THEY WOULD BE UNABLE TO PERFORM RECALL SERVICE UNTIL 9/9/2019, EVEN THOUGH THEY *DO* HAVE SLOTS OPEN FOR OTHER WORK.  THIS DELAY (ALMOST 6 MONTHS) SEEMS UNREASONABLE.",
        "vin": "4S4BRBAC6E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190558,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS). CONTINENTAL SUBARU (4900 OLD SEWARD HWY, ANCHORAGE, AK) AND THE MANUFACTURER WERE NOTIFIED AND STATED THAT THE PARTS NEEDED TO REPAIR THE DEFECT WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4S4BRBDC1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190260,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - MY LOCAL DEALER (KOPPEL SUBARU - QUEENS, NY) CANNOT REPLACE MY PASSENGER AIRBAG PER THE RECALL UNTIL JUNE 14, 2019 - THE EARLIEST THEY CAN FIX - WHICH IS COMPLETELY INSANE SINCE I MADE THE APPOINTMENT TODAY ON MARCH 20TH SO I TECHNICALLY AM BEING ASKED TO WAIT ALMOST 3 MONTHS TO GET IT FIXED.",
        "vin": "4S4BRBCC9E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189895,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V008000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. DEVOE SUBARU OF NAPLES WAS CONTACTED BY PHONE AT (866) 982-1252 (LOCATED AT 1411 SOLANA RD, NAPLES, FL 34103) AND THE CONTACT WAS INFORMED THAT THE VEHICLE COULD BE REPAIRED ON APRIL 9, 2019. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BRBMC5E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190006,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V008000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. FIRST TEAM SUBARU (6520 PETERS CREEK RD, ROANOKE, VA 24019, (540)362-4800) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BRCAC1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187505,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. WALSER SUBARU (600 W 121ST ST, BURNSVILLE, MN 55337, (952) 314-1391) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BRCLC4E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189683,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PREMIER SUBARU (LOCATED AT 150 N MAIN ST, BRANFORD, CT 06405, (203) 481-0687) WAS CONTACTED AND STATED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BRDPC9E2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/16/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187234,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 SUBARU OUTBACK HAS BEEN RECALLED \"TAKATA RECALL\". UNFORTUNATELY, SUBARU OF AMERICA FAILED TO NOTIFY ME OF THIS RECALL AND WHEN I INQUIRED AT THE LOCAL DEALER, JIM KERAS SUBARU OF MEMPHIS, I WAS TOLD THAT IT WAS NOT THEIR RESPONSIBILITY TO NOTIFY ME OF ANYTHING...IN OTHER WORDS, TOO BAD, SO SAD, WE DON'T GIVE A HOOT! VERY DISAPPOINTING RESPONSE! AND TO MAKE MATTERS WORSE, THE DEALERSHIP CANNOT MAKE TO REQUISITE REPAIRS UNTIL 08 MAY. IN THE MEANTIME, I'LL BE DRIVING AT MY OWN RISK.",
        "vin": "4S4BRCDCXE3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186767,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SHORELINE SUBARU (LOCATED AT 17225 AURORA AVE N, SEATTLE, WA 98133, (206) 542-1166) AND THE MANUFACTURER WERE NOTIFIED AND STATED THAT PARTS WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *TT  CONSUMER RECEIVED THE AIRBAG RECALL NOTICE STATING NOT TO ALLOW PASSENGERS IN THE PASSENGER SEAT UNTIL THE AIRBAG WAS REPAIRED. CONSUMER WAS TOLD BY THE DEALER \"NOT TO WORRY\". CONSUMER WAS TOLD REPAIRS COULD NOT BE MADE UNTIL JULY - 4 MONTHS LATER.*JB",
        "vin": "4S4BRBAC8E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186396,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED PRIME SUBARU HYANNIS (24 RIDGEWOOD AVE, HYANNIS, MA 02601, 508-778-5066) AND WAS INFORMED THAT THE PARTS WERE ON BACKORDER UNTIL APRIL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "4S4BRBLC9E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186514,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION ON MARCH 11, 2019. THE CONTACT SPOKE WITH AN UNKNOWN SUBARU DEALER WHO STATED THAT THEY WERE ONLY SERVICING ONE VEHICLE PER DAY. THE CONTACT WOULD HAVE TO WAIT UNTIL AUGUST OF 2019 TO HAVE THE VEHICLE REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "4S4BRBLC5E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185960,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V009000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. SOUTHERN OREGON SUBARU (3103 BIDDLE RD, MEDFORD, OR 97504, (541) 245-2000) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4S4BRBCC9E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/07/2019",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185999,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS ENGINE FIRE WHILE DRIVING - MAR 07,2019 - 2014 SUBARU OUTBACK WITH CURRENT MAINTENANCE AND NO PRIOR HISTORY OF MALFUNCTION.  DURING A 2.1 MILE DRIVE ON CITY STREETS ELECTRICAL DISTURBANCES OF THE RADIO/MEDIA CONSOLE WERE NOTED, FOLLOWED SHORTLY THEREAFTER BY BLACK SMOKE FROM UNDER THE HOOD.  THE CAR WAS IMMEDIATELY PULLED TO THE SIDE OF THE ROAD.  UPON EXITING THE CAR, THE SMOKE HAD BECOME WHITE AND FLAMES WERE NOTED UNDER THE CAR.  THE FRONT OF THE CAR SOON BECAME ENGULFED IN FLAMES.  THE ENTIRE FRONT OF THE CAR WAS BURNT/MELTED.  NO ONE WAS INJURED.",
        "vin": "4S4BRCNC0E3"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183291,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEB 28, 2019 I WAS DRIVING MY 2014 SUBARU OUTBACK ON INTERSTATE 64 ON A STRAIGHT STRETCH AT APPROXIMATELY 70 MPH GOING UPHILL WHEN ACCELERATOR BECAME SUDDENLY AND COMPLETELY UNRESPONSIVE.  I WAS IN THE FAR LEFT LANE OF 3 LANES OF TRAFFIC ALSO TRAVELING AT A HIGH RATE OF SPEED AND HAD TO TRY TO GET TO THE EMERGENCY LANE TO THE RIGHT OF THE 3 LANES.  I HAD ABSOLUTELY NO RESPONSE WHEN PUSHING ON THE ACCELERATOR PEDAL AND COULD HAVE BEEN HIT BY NUMEROUS SEMI TRAILER TRUCKS.  I WAS ABLE TO COAST TO THE RIGHT INTO THE EMERGENCY LANE WHICH WAS A MIRACLE BECAUSE I WAS ON A STEEP UPHILL INCLINE.  WHEN I REACHED THE EMERGENCY LANE, I STOPPED THE CAR, SHIFTED INTO PARK, AND BACK INTO DRIVE MODE AND THE ACCELERATOR DID ENGAGE AT THAT POINT.  I IMMEDIATELY TOOK THE CAR TO A SUBARU DEALER BUT THEY HAVE NOT DIAGNOSED IT AS OF YET.  I HAVE BEEN RESEARCHING ON THE INTERNET TO SEE IF OTHER 2014 OUTBACK OWNERS HAVE THE SAME COMPLAINT AND CAME ACROSS NUMEROUS OTHER COMPLAINTS OF THE SAME PROBLEM ON THE WEBSITE WWW.CARCOMPLAINTS.COM.  THOSE COMPLAINING OF THE SAME PROBLEM HAVE NOT HAD ANY SUCCESS WITH A FIX FROM SUBARU.  PLEASE LOOK INTO THIS BEFORE SOMEONE IS INJURED OR KILLED AS I COULD HAVE EASILY BEEN TODAY.",
        "vin": "4S4BRCNC3E3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2019",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180651,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA ALLOWS WATER TO SEEP IN AND FRY THE CAMERA WHICH PRESENTS A SAFETY HAZARD WHEN BACKING UP (SMALL CHILDREN, PETS, ETC YOU COULDN'T SEE OTHERWISE IF DIRECTLY BEHIND -IN THE MOST DANGEROUS PLACE). SUBARU IS AWARE OF THIS DEFECT BUT HAS NOT CORRECTED IT, SO IF YOU HAVE THEM INSTALL A NEW CAMERA FOR APPROXIMATELY $350.00) YOU'RE GETTING ANOTHER LEAKY CAMERA THAT IS DOOMED TO FAIL. THE DEALER SAID REPLACEMENT CAMERA IS THE SAME ONE AS ORIGINAL.",
        "vin": "4S4BRBLC6E3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176156,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HOOD LATCH IS NOT HOLDING AT SPEEDS ABOVE 45 MPH EFFECTIVE 1/20/2019. OVER THE PAST WEEKS IT IS POPPING UP MORE FREQUENTLY. SO FAR SAFETY LATCH APPEARS TO BE HOLDING BUT DUE TO FREQUENT POP UPS, I HAVE SECURED MY HOOD WITH DUCT TAPE UNTIL I GET TO THE DEALER. IN CROSSING A BRIDGE ON 02/09/19 IN WINDY CONDITIONS, I BECAME VERY CONCERNED THAT THE LIFTING OF THE HOOD WOULD CAUSE A SAFETY ISSUE UNTIL I COULD SECURE IT. I HAVE AN APPT ON FRIDAY, 02/15,2019 BUT THEY INDICATE MY VIN IS NOT PART OF A SAFETY RECALL.",
        "vin": "4S4BRBCC7E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175770,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATES/DOES NOT RESPOND, INTERMITTENTLY BUT OFTEN, WHEN ACCELERATOR PEDAL IS PUSHED TO THE FLOORBOARD FROM A STOP. LAG/NO RESPONSE TIME IS ABOUT ABOUT 1 1/2 SECONDS. THIS RESULTS IN NEAR ACCIDENTS WHEN PULLING OUT INTO TRAFFIC AT AN INTERSECTION. CAR HAS BEEN TAKEN TO DEALER TWICE TO HAVE THIS ISSUE RESOLVED WITH NO SUCCESS.",
        "vin": "4S4BRBLC2E3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/08/2019",
        "dateOfIncident": "04/13/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175783,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN BE DRIVING DOWN THE ROAD AND GO TO MAKE A LEFT OR RIGHT HAND TURN AND WILL LOOSE ALL POWER STEERING ABILITY AND THE NEXT TIME THE STEERING WILL WORK FINE. I HAVE ALMOST HAD ACCIDENTS DUE TO THIS BECAUSE YOU NEVER KNOW WHEN IT WILL HAPPEN. THIS ALWAYS HAPPENS IN CITY STREETS OR TURNING OFF HIGHWAY.ALSO HAS HAPPENED WHEN PULLING OUT OF A PARKING STALL. SEEMS TO ALWAYS HAPPEN WHEN AT LOWER SPEEDS. HAVE HAD IT IN THE SHOP FOR REPAIR AND THEY CAN'T SEEM TO FIND THE PROBLEM. I WILL NOT LET MY WIFE DRIVE MY CAR BECAUSE SHE DON'T HAVE THE STRENGTH TO QUICKLY TURN THE WHEEL WHEN YOU DON'T KNOW WHEN IT WILL HAPPEN. ONE MINUTE IT WILL WORK THEN IT WON'T. IT DOES GIVE YOU A WORK OUT WHEN YOU LOOSE STEERING ABILITY FOR A LENGTHY PERIOD BUT YOU ALWAYS HAVE TO PAY ATTENTION WHEN YOU TURN LEFT OR RIGHT BECAUSE YOU NEVER KNOW WHEN YOU WILL LOOSE YOUR POWER STEERING. MY WIFE HAS REFUSED TO DRIVE MY CAR BECAUSE IT HAS HAPPENED TO HER ONCE AND DOESN'T FEEL COMFORTABLE WHICH IS SAD WHEN YOU SPEND THAT MUCH MONEY ON A CAR. WE PURCHASED THE VEHICLE USED AND WITHIN A VERY SHORT PERIOD OF TIME AFTER PURCHASE THIS PROBLEM CAME ABOUT. I JUST HOPE THIS PROBLEM CAN BE RESOLVED.",
        "vin": "4S4BRCCC6E3"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2019",
        "dateOfIncident": "01/31/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173783,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "3 TO 15 SECOND HESITATION IN THROTTLE RESPONSE.  LAST INCIDENT NEARLY RESULTED IN A COLLISION.  I STOPPED WAITING FOR TRAFFIC TO CLEAR BEFORE MAKING AN LEFT TURN.  MADE THE LEFT TURN, GENTLY APPLIED THE THROTTLE PEDAL, NO RESPONSE, PUSHED IT TO MAXIMUM TRAVEL, STILL NO RESPONSE, CAR COMING TOWARD ME IN ONCOMING LANE, THEN MY CAR SUDDENLY ACCELERATED SO THAT A COLLISION WAS AVOIDED.  CITY 2 LANE STREET, TURNING LEFT.",
        "vin": "4S4BRBLC2E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170374,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 70,000 MILES (ROUNDED) ENGINE BEGAN LEAKING OIL FROM BOTH CAM CARRIERS AND THE UPPER OIL PAN. OIL LEAKS ON EXHAUST SYSTEM CAUSING A BURNING OIL SMELL AND CAN SEE SMOKE EMITTING FROM UNDER THE CAR. ESTIMATE TO REPAIR IS $2050 FROM SUBARU DEALERSHIP. HAVE HEARD RUMORS OF OTHER 2.5I ENGINES HAVING SAME PROBLEM. VERY DANGEROUS, CAN CAUSE ENGINE FIRE AS OIL LEAKS DIRECTLY ON EXHAUST PIPE. PROBLEM (BURNING SMELL) IS MOST NOTICEABLE FIRST THING IN THE MORNING WHEN OIL HAS HAD CHANCE TO LEAK OVERNIGHT. MORE PREVALENT IN COLD WEATHER (WHEN METAL AND GASKETS CONTRACT FROM THE COLD).",
        "vin": "4S4BRBDC2E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161081,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TAIL RUNNING LIGHT BULBS INSIDE THE LIFT/TAIL GATE WERE BURNT OUT AND WHEN REPLACING THE BULBS THE PLASTIC HOUSING THE BULBS PRESS INTO WERE CHARRED AND CRACKED. I FEAR THIS IS A POTENTIAL FIRE HAZARD GIVEN THE STATE OF CHARRING. MY VEHICLE DID NOT EXPERIENCE A FIRE, BUT I AM SUBMITTING THIS COMPLAINT IN CASE SIMILAR VEHICLES HAVE CAUGHT FIRE FROM THIS AREA.",
        "vin": "4S4BRCCC3E1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154069,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT SENSOR FOR THE PASSENGER SIDE IS NOT WORKING IN COLD WEATHER, CAUSING THE AIRBAG TO BE DEACTIVATED. THE SEATBELT INDICATOR SIGNAL BEEPS REGARDLESS OF WHETHER SOMEONE IS SITTING IN THE SEAT WITH THE SEATBELT ON OR NO ONE IS SITTING IN THE SEAT.  THIS HAPPENS WHEN THE VEHICLE IS IN MOTION AND HAPPENS ANY TIME THE TEMPERATURE IN THE VEHICLE IS BELOW FREEZING.",
        "vin": "4S4BRCAC6E3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "10/29/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151133,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. WHILE ATTEMPTING TO EXIT A PARKING SPACE, THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER. PRESTIGE SUBARU (LOCATED AT 585 TUNNEL RD, ASHEVILLE, NC 28805, (888) 854-4293) WAS CONTACTED AND STATED THAT THERE WERE NO RECALLS ASSOCIATED WITH THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 38,000.",
        "vin": "4S4BRBLC3E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150809,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS USING WAY TOO MUCH OIL FOR A 4 YEAR OLD CAR. SOMETHING IS WRONG AND TWO PLACES I'VE GONE HAVE SUGGESTED IT COULD BE SOMETHING WRONG WITH THE PISTOLS IN THE ENGINE. I'VE READ ABOUT OTHER OWNERS OF THIS MODEL EXPERIENCING THE SAME TROUBLE. THIS IS HIGHWAY AND STREET DRIVING.",
        "vin": "4S4BRCNC6E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145346,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC PARKING BRAKE ACTUATOR FAILED.  WHEN THIS OCCURS YOU CAN'T USE THE PARKING BRAKE AND THE EYESIGHT SAFETY EQUIPMENT DOES NOT WORK.  THIS OCCURS AT STARTUP, WHEN THE VEHICLE GOES THROUGH IT'S DIAGNOSTIC CHECKS.  CAR HAS STRANDED US TWICE WITH THE BRAKE NOT ALLOWING US TO DISENGAGE.  EVENTUALLY, AFTER STARTING CAR MULTIPLE TIMES OR REMOVING BATTERY, IT WILL WORK BRIEFLY TO ALLOW TO DISENGAGE.  NOW WE DON'T SET THE PARKING BRAKE, OR USE THE EYESIGHT.  SUBARU HAS RECALLED THEIR MANUAL TRANSMISSION MODELS WITH THIS ISSUE, BUT NOT THE AUTOMATIC TRANSMISSION MODELS.",
        "vin": "4S4BRDPCXE2"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "10/25/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143356,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT OUTBACK FROM DEALER ON 9/26/2018, AND WHEN WEATHER TURNED COOL, WINDSHIELD CRACKED. I HAD SAFELITE/LIBERTY REPLACE ON 10/22/2018, AND DIDN'T DRIVE UNTIL WEDNESDAY, 10/24/2018 WHEN I DROVE ON I81. TRUCK THREW STONE AND I CALLED TO REPAIR, BUT THEY COULDN'T FIX IN AFTERNOON.  THURSDAY AT 8 A.M.  THE WINDSHIELD WAS ALREADY CRACKED BEYOND REPAIR. HAD TO CALL INSURANCE COMPANY AND REPLACE AGAIN ON 10/25/2018. SEEMS WINDSHIELDS ARE DEFECTIVE ONLY ON HIGHWAY TWICE, CRACKED TWICE! I HAD MY PREVIOUS CAR 17 YEARS AND NEVER CHANGED WINDSHIELD. I HAVE ONLY PUT APPROXIMATELY 500 MILES ON CAR AND HAVE TO CHANGE TWICE. AFRAID TO GO ON HIGHWAY. THANK YOU",
        "vin": "4S4BRBCCXE3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131806,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE KEEPS BURNING ENGINE OIL AFTER 3,000 TO 4,000 MILES DRIVING. I HAVE HAD THE ISSUE SINCE NOVEMBER 2017 AND WENT TO SUBARU DEALER TO CHECK IT AND THEY SAID AS LONG AS ENGINE OIL IS THE SAME LEVEL AFTER 1,200 MILES, ENGINE OIL BURNING IS NORMAL. WHEN I ASKED SUBARU DEALER TO ADD THE OIL, THEY CHANGED THE ENGINE OIL AND CHARGED ME BY SAYING THAT IT IS A NORMAL CONDITION. EVEN SUBARU ISSUED TECHNICAL BULLETIN FOR THE ENGINE OIL BURNING ISSUE, THEY TREAT THE COMPLAINING CUSTOMERS IN A SNEAKY WAY. THE SYNTHETIC OIL SHOULD RUN OVER 5,000 MILES WITHOUT BURNING IN THE ENGINE AND I HAD NO ISSUES WITH OTHER BRAND CARS SUCH AS FORD. NHTSA SHOULD WARN SUBARU TO MANAGE CUSTOMER COMPLAINTS IN A PROPER WAY. IT IS RELATED TO DRIVER'S SAFETY AS I FIND ONLY 1/4 QUART OIL LEFT AFTER 4,000 MILES DRIVING, WHICH I DON'T THINK IS NOT A NORMAL CONDITION FOR THE PASSENGER VEHICLES. THANKS FOR HELPING IN ADVANCE.",
        "vin": "4S4BRCLC2E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "08/24/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11129564,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. AFTER PARKING THE VEHICLE AND EXITING, THE CONTACT RE-ENTERED THE VEHICLE AND THE GEAR ROLLED OUT OF PARK. THE EMERGENCY BRAKE WAS NOT ENGAGED. AS A RESULT, THE VEHICLE CRASHED INTO THE BACK OF THE CONTACT'S HOUSE. THE CONTACT SUSTAINED BRUISES TO THE LEGS AND KNEES. THE CONTACT HELD ONTO THE DRIVER'S DOOR, BUT WAS UNABLE TO APPLY THE EMERGENCY BRAKE AS THE VEHICLE GAINED SPEED. NONE OF THE AIR BAGS DEPLOYED. A POLICE REPORT WAS NOT FILED. SUBARU OF LITTLE ROCK (12121 COLONEL GLENN RD, LITTLE ROCK, AR 72210, (501) 503-5454) WAS UNABLE TO DUPLICATE AND DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 63,200.",
        "vin": "4S4BRCAC6E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/08/2018",
        "dateOfIncident": "09/08/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128206,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "4 HEADLAMPS CHANGED. 2 FOG LAMPS, BOTH FRONT MARKER LIGHTS, BOTH REAR STOP LIGHTS AND TURN SIGNALS. UNIT WAS PURCHASED IN MAY OF 2014 FROM DEALER SHOWROOM. I HAVE CHANGED MORE LIGHTS ON THIS VEHICLE THAN MY LAST 5 CARS COMBINED. IS THERE AN ELECTRICAL OR WIRING ISSUE HERE?",
        "vin": "4S4BRBCC0E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "09/06/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128018,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE SHUDDER NOTICEABLE THROUGHOUT THE CAR AT VARIOUS SPEEDS INCLUDING ~35-40 MPH AND 78-83 MPH. I'VE TRIED NEW TIRES, REBALANCING WHEELS, ALL WHEEL ALIGNMENTS, ALL WITHOUT RELIED. THE DEALER HAS NOT BEEN HELPFUL. OCCURS IN MOTION. WE BOUGHT THE CAR IN SEPTEMBER 2015 WITH 31,000  MILES ON IT. I NOTICED THE SHUDDER ON A TEST DRIVE BUT THE DEALER PUT NEW TIRES ON IT AND IT SEEM TO GO AWAY. BUT I NOTICED IT AGAIN WITHIN A MONTH OF PURCHASING THE CAR AND IT'S ONLY GOTTEN WORSE",
        "vin": "4S4BRBEC4E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121326,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA IS NOT WORKING WHEN THE VEHICLE IS PLACED IN REVERSE.",
        "vin": "4S4BRDLC2E2"
    },
    {
        "components": "PARKING BRAKE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115213,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY E-BRAKE HAS NOT BEEN WORKING FOR THE PAST YEAR.  THE RED BRAKE LIGHT COMES ON AT RANDOM TIMES WHEN PARKED AND IN MOTION AND I CANNOT ENGAGE THE E-BRAKE.  SUBARU IS SAYING THAT I NEED TO REPLACE THE ENTIRE ELECTRONIC BRAKE MECHANISM FOR A COST OF $1,000.00 - THIS FOR A 2014 CAR.",
        "vin": "4S4BRBLC1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/28/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114262,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG SENSOR  MALFUNCTIONS AFTER ABOUT FIVE MINUTES OF ON THE ROAD DRIVING WITH A PASSENGER IN THE VEHICLE",
        "vin": "4S4BRBPC2E3"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "05/24/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113849,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REARVIEW CAMERA STOPPED WORKING. IT APPEARS TO BE IN WET CLIMATE, MOISTURE IS PENETRATING THROUGH THE REAR VIEW CAMERA AND CORROSION HAPPENS TO CAMERA WIRING AND STOPS TO DISPLAY THE IMAGE WHILE TAKING REVERSE/BACK. CAMERA DOES NOT DISPLAY ANY IMAGE (BLACK SCREEN) BUT SHOWS ONLY THE COLORED LINES.     ITS BEEN NOTICED THAT ITS HAPPENING IN MOST OF THE OUTBACKS, KINDLY VERIFY AND RECOMMEND FOR NECESSARY RECALL NOTICE AS THIS RELATES TO SAFETY FEATURE WHICH COMES AS STANDARD FEATURE.",
        "vin": "4S4BRCLC9E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/22/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112965,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS STOPPED, TRANSMISSION IS IN PARK AND IGNITION KEY CAN NOT BE REMOVED AFTER TURNING VEHICLE OFF. JIGGLING THE TRANSMISSION SHIFTER SEEMS TO FIX THE ISSUE.",
        "vin": "4S4BSACC8G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/14/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111365,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK UP CAMERA WENT OUT AT 60K MILES",
        "vin": "WVWAK73C17P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091668,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUBARU OUTBACK 2014 HAS 50,000 MILES, LOW OIL LIGHT COMES UP ABOUT 4000 MILES AFTER OIL CHANGE. SUBARU MANUAL SAID THAT IS 7500 MILES BETWEEN OIL CHANGE. SUBARU DEALER PERFORMS OIL CONSUMPTION TEST. SUBARU DEALER  TOLD ME IT IS NORMAL AND THAT I HAVE TO ADD OIL IF LOW OIL LIGHT COME UP. I FEEL LIKE THEY ARE CHEATING.",
        "vin": "4S4BRBDCXE3"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/19/2018",
        "dateOfIncident": "04/19/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089369,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 SUBARU OUTBACK. CONSUMER WRITES IN REGARDS TO SUNROOF DRAINS BEING CLOGGED WHICH CAUSED WATER TO LEAK INTO VEHICLE WHEN RAINING. *LD  *JS",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/16/2018",
        "dateOfIncident": "04/14/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088340,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "INSPECTION NOTED BELT SEPERATION ON GOODYEAR ASSURANCE TIRES, VEHICLE STATIONARY",
        "vin": "4S4BRCDC4E3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "03/29/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083240,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED CAR NORMALLY, POWER STEERING WAS NOT FUNCTIONING. RESTARTED CAR A FEW TIMES IN HOPES IT WOULD START WORKING AGAIN, IT DID NOT. NO DASH WARNING LIGHTS WERE ILLUMINATED. DROVE HOME WITH MANUAL STEERING ~30 MIN. RESTARTED AGAIN AT HOME, THEN IT WORKED PROPERLY. ONCE CAR SITS FOR A WHILE IT GOES BACK TO NOT WORKING. THIS PATTERN HAS CONTINUED FOR ABOUT A WEEK NOW. NO SQUEALING AND NO FLUID LEAKS. MUST BE ELECTRICAL ISSUE SOMEWHERE. BATTERY IS GOOD, ALTERNATOR IS GOOD.  2014 OUTBACK, 55,000 MILES, 2.5I BASE MODEL, MANUAL TRANSMISSION",
        "vin": "4S4BRCAC7E1"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "11/25/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11083319,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN HEAVY TRAFFIC ON I-17 NORTH OF PHOENIX AZ.  ADAPTIVE CRUISE CONTROL (ACC) WAS SET AND I WAS FOLLOWING THE CAR AHEAD AT THE MAXIMUM DISTANCE SET BY ACC.  MY FOOT WAS NOT ON THE ACCELERATOR OR THE BRAKE.      I SAW THE PRECEDING CAR'S BRAKE LIGHTS COME ON, AND I FELT MY CAR START TO SLOW.  THE PRECEDING CAR STOPPED AND IT BECAME APPARENT THAT MY CAR WAS NO LONGER BRAKING, OR IF IT WAS, NOT HARD ENOUGH TO STOP.  I APPLIED THE BRAKES BUT IT WAS TOO LATE AND WE HIT THE CAR IN FRONT OF US AT A SPEED GREAT ENOUGH TO DO $7000 OF DAMAGE TO THE FRONT OF MY CAR.  CURIOUSLY THE AIR BAGS DID NOT DEPLOY.    PASSENGERS IN THE CAR INCLUDED MY WIFE IN THE FRONT SEAT, WHO WAS THROWN INTO THE SEAT/SHOULDER HARNESS HARD ENOUGH TO KNOCK THE WIND OUT OF HER.  SHE COMPLAINED OF CHEST PAINS AND WAS TAKEN BY AMBULANCE TO THE HOSPITAL. NO SERIOUS INJURIES WERE FOUND.  MY DAUGHTER IN THE BACK SEAT AND I WERE RESTRAINED PROPERLY BY THE SEAT BELT AND SUSTAINED NO INJURIES.    I CONTACTED SUBARU AND TOLD THEM ABOUT THE ACCIDENT.  THEY RESPONDED BY TELLING ME THAT THEY WERE SENDING TWO ENGINEERS TO INSPECT MY VEHICLE.  AFTER A MONTH OR 6 WEEKS THEY RESPONDED THAT THEIR INVESTIGATION WAS COMPLETE.  THEY FOUND THAT 5 SECONDS BEFORE THE CRASH I WAS TRAVELING AT 45 MPH.  1.5 SECONDS BEFORE THE CRASH THE BRAKES WERE APPLIED (DISABLING ACC).  THEY TOLD ME THAT THE EYESIGHT WAS FUNCTIONING NORMALLY AND WILL NOT STOP ALL CRASHES.  SO SORRY.    I BELIEVE THERE IS SOMETHING WRONG, EITHER WITH THE DESIGN OR THE FUNCTIONING OF EYESIGHT AND ACC.  MY CAR HAD 60,000 MILES ON THE ODOMETER AT THE TIME OF THE CRASH.  I HAVE USED ACC HUNDREDS (PERHAPS THOUSANDS) OF TIMES IN HEAVY TRAFFIC.  IT HAD ALWAYS PERFORMED AS ADVERTISED, I.E.  MAINTAINING A CONSTANT DISTANCE BETWEEN ME AND THE CAR AHEAD.  IT SLOWED AS NEEDED, AND CAME TO A STOP WHENEVER TRAFFIC STOPPED.  THEN ONE DAY IT DIDN'T",
        "vin": "4S4BRDPC1E2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "03/05/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081925,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "4 YEAR OLD CAR'S TRANSMISSION WENT UP AT 114,000. ALTHOUGH THERE WAS A WARRANTY EXTENSION BECAUSE OF THE TRANSMISSIONS, SUBARU DID NOT DO A RECALL ON THE FAULTY TRANSMISSION. NOW THEY ARE QUOTING US $9000 FOR A NEW TRANSMISSION.",
        "vin": "4S4BRCAC9E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "03/12/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079818,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT STATED THAT THE VEHICLE ACCELERATED INTERMITTENTLY WHEN IT WAS NOT PROMPTED. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE OR AFTER THE FAILURE. THE VEHICLE WAS TAKEN TO GANLEY SUBARU OF BEDFORD (123 BROADWAY AVE, BEDFORD, OH) AND DIAGNOSED, BUT THE FAILURE WAS NOT ABLE TO BE DUPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 23,000. THE VIN WAS NOT PROVIDED. *TT",
        "vin": "4S4BRCCCE33"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064658,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- CONTACT OWNS A 2014 SUBARU OUTBACK. CLASS ACTION LAWSUIT THROUGH SUBARU FOR EXCESSIVE OIL CONSUMPTION. CONTACT TOOK VEHICLE TO SUBARU AND HAD ENGINE CHECKED FOR OIL CONSUMPTION AND ENGINE OIL WAS EMPTY. SUBARU SAID NO RECALL ON VEHICLE. CONTACT WANTS ENGINE BLOCK REPLACED FREE OF CHARGE.. SUBARU STATED ENGINE BLOCK IS NOT UNDER RECALL. 0 RECALLS ASSOCIATED WITH THIS VIN.",
        "vin": "4S4BRBAC5E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "08/31/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062788,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN USING OIL AFTER APPROXIMATELY 29,000 MILES. LOW OIL PRESSURE LIGHT WAS ILLUMINATED ON THE DASHBOARD. CONTACTED THE DEALER AND WAS TOLD TO BRING THE VEHICLE IN IMMEDIATELY. THE OIL AND FILTER WERE CHANGED AND I WAS INSTRUCTED TO BRING THE VEHICLE BACK AFTER 1200 MILES FOR A \"OIL CONSUMPTION TEST\" . THE TEST WAS PERFORMED AT THE DEALERSHIP, PATRICK SUBARU AND THE RESULTS, 1/3 QT. OF OIL WAS CONSUMED AND THE INFORMATION WAS  SENT TO SUBARU OF AMERICA. MY CLAIM WAS DENIED. I HAVE SINCE DRIVEN THE CAR 2789 MILES AND HAVE CONSUMED 1.1QTS OF OIL. I CONTACTED THE DEALERSHIP AND WAS TOLD ANOTHER OIL CONSUMPTION TEST MUST BE PERFORMED TO DETERMINE IF THE VEHICLE IS ELIGIBLE FOR REPAIR. PLEASE NOTE THAT A CLASS ACTION SUITE WAS AWARDED AGAINST SUBARU FOR 2012 TO 2014 VEHICLES USING EXCESSIVE OIL. THIS VEHICLE CARRIES THE \"PREZ\" EMBLEM FOR PARTICLE ZERO EMISSIONS. YET THIS VEHICLE EMITS OVER A QUART OF OIL EVERY 2790 MILES.",
        "vin": "4S4BRBCC9E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2017",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055058,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BURNING OIL.    EXCESSIVE OIL CHANGES",
        "vin": "4S4BRCCC1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052389,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "07/10/1977",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042156,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL WILL NOT LOCK IN EITHER UP OR DOWN POSITION",
        "vin": "4S4BRCLC4E3"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041678,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REGULAR DRIVING LIGHTS FOR NIGHT TRAVEL ARE TOTALLY INSUFFICIENT AND DO NOT FULLY LIGHT STREET MORE THAN 1- 2 CAR LENGTHS IN FRONT OF CAR. DEALER CHECKED DIRECTION AND POWER OF LIGHTS AND CLAIMS ALL IS NORMAL. WHEN I DRIVE IN A DARK AREA, I FEEL UNSAFE. I CAN;T BELIEVE THIS IS NORMAL BUT DEALER CLAIMS IT IS.",
        "vin": "4S4BRBDC6E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11036020,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGEROUS! INTERMITTENT DELAY OF 4 TO 6 SECONDS TYPICALLY PULLING OUT INTO TRAFFIC FROM A COMPLETE STOP.  OTHER CARS SLAMMING ON BRAKES TO PREVENT WRECK, SWERVING TO MISS MY STALLED CAR.  MY WIFE AND GRAND-KIDS HAVE BEEN ON PASSENGER SIDE WHEN THIS OCCURS WHERE THEY ARE MOST VULNERABLE SINCE MOST INCIDENCES OCCUR WHEN TURNING LEFT.  THIS CAR IS LIKELY TO KILL OR MANGLE SOMEONE IF THIS IS NOT RESOLVED. THE OL 'WE CAN'T CREATE IT' IS GETTING REALLY STALE FROM THE DEALER WHEN LIVES ARE AT RISK.  I'M ASSUMING IT'S GOING TO TAKE A FEW DEATHS BEFORE A RECALL OCCURS.   I WOULD LOVE TO RAISE THE MONEY TO PUT A FULL PAGE IN USA TODAY TO GET THIS DANGEROUS CONDITION SOME ATTENTION IF NOBODY ELSE IS GOING TO.",
        "vin": "4S4BRCMC2E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033222,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "V-BELT CHIRPING WHEN RUNNING ESPECIALLY WITH A/C ON",
        "vin": "4S4BRBLC4E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2017",
        "dateOfIncident": "11/24/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030642,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OUTBACK 2.5L. WE NOTICED OIL CONSUMPTION AFTER THE 3-4TH OIL CHANGE. ALL OIL CHANGES WERE PREFORMED AT SUBARU DEALERSHIP ( BROWNS MANASSSAS OR SHEEHY SPRINGFIIELD). WE ASKED WHY WE WERE HAVING TO ADD OIL AND TOLD THAT THIS WAS NORMAL. THE SITUATION HAS GOTTEN WORSE WITH LOW OIL LIGHT COMING ON AT ABOUT 4,000 MILES ON THE OIL CHANGE. WE NOTIFIED SUBARU HEADQUARTERS AND THEY SUGGESTED AN OIL CONSUMPTION TEST. THAT WAS THE FIRST TIME THAT HAD BEEN SUGGESTED. THE MILEAGE WAS ABOUT APPX 72,000 MILES. WE DID THEY OIL CONSUMPTION TEST ON THE NEXT OIL CHANGE AT APPX 78,800. WE BROUGHT THE VEHICLE IN AFTER 1,200MILES (80,000 MILES). THE VEHICLE USED 3 OZ. OF OIL IN 1,200 MILES. WE WERE TOLD THAT WAS IN NORMAL LIMITS OR SPECS. I HAVE NEVER HAD A VEHICLE THAT USED THAT MUCH OIL WITH SUCH LOW MILEAGE SINCE I HAD THIS START TO HAPPEN ABOUT 22,500 MILES.",
        "vin": "4S4BRCMC4E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "09/10/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022783,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT A STOP EITHER AT A 4 WAY, TRAFFIC LIGHT, OR WAITING TO MAKE A TURN, SOMETIMES THE CAR HESITATES A FEW SECONDS BEFORE GOING AND THEN SURGES FORWARD. I ALSO HAVE HAD IT STALL FOR OVER 20 MINUTES AND WOULDN'T START TILL AFTER 20 MINUTES.  THE HESITATION IS DANGEROUS WHEN MAKING TURNS ACROSS OR INTO TRAFFIC BECAUSE IT DOESN'T GO AND YOU CAN GET HIT. IT DOES NOT TRIP THE ENGINE LIGHT SO THE DEALER CAN FIX IT.",
        "vin": "4S4BRCLC3E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022926,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BLUETOOTH , WHEN I MAKE A CALL OR RECEIVE A CALL WHILE DRIVING VEHICLE IN MOTION ON THE CITY STREETS AND FREEWAY ,ON THE RECEIVERS END THE PERSON CAN HEAR A WHINNING NOISE LIKE A DENTAL DRILL. I BOUGHT A NEW CELL TO SEE IF IT CORRECTS THE PROBLEM AND IT DID NOT. I TOOK THE VEHICLE TO DEALERSHIP PRIOR TO PURCHASING A NEW CELL PHONE AND THE DEALERSHIP TOLD ME THEY ARE NOT ABLE TO HELP ME.",
        "vin": "4S4BRBNC1E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021148,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 38,000 MILES LOW-OIL LIGHT CAME ON WHILE DRIVING.  I STOPPED AT A MADISON WI DEALER WHO INDICATED THE CONSUMPTION IS NORMAL.  I ARGUED THAT I HAVE NEVER HAD A LOW-OIL LIGHT COME ON IN OVER FORTY YEARS OF DRIVING.  WAS TOLD THEY WOULD BE GLAD TO CONDUCT AN OIL CONSUMPTION TEST.  THERE IS NOW 40,000 MILES ON THE CAR AND IT IS USING A QUART EVERY 3,500 MILES.  THERE ARE MULTIPLE COMPLAINTS.  NHTSA NEEDS TO FORCE SUBARU TO REPLACE THESE ENGINES.",
        "vin": "4S4BRBLC6E3"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/25/2017",
        "dateOfIncident": "04/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019553,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO EMERGENCY BRAKE ON A 2014 OUTBACK,THE PARKING BRAKE DOES NOT WORK WHEN THE CAR IS MOVING.UNSAFE, IF ANYTHING HAPPENS WITH BRAKES THERE IS NOTHING TO STOP CAR FOR SAFETY THE HAND EMERGENCY BRAKE SHOULD BE IN THE CENTER CONSOLE, SO PASSENGER COULD ALSO PULL IT ON. .FRONT SPRINGS BOTTOM OUT FOR THE SLIGHTEST DIP IN THE ROAD.. I COMPLAINED  TO  SUBARU ABOUT THE BRAKE AND THEY TOLD ME BUY ANOTHER CAR",
        "vin": "4S4BRBAC4E1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019017,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"",
        "vin": "4S4BRDLC0E2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015970,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION FROM A STOP OR SLOW SPEED TAKES 5-6 SECONDS FOR A PROPER RESPONSE. TURNING LEFT IS A VERY REAL PROBLEM OR PULLING INTO ON COMING TRAFFIC. I HAVE YET TO HAVE AN ACCIDENT BECAUSE I AM EXTREMELY CAREFUL, BUT HAVE COME FRIGHTINGLY CLOSE A FEW TIMES.  CAN  THIS PROBLEM BE FIXED?  THIS HAPPENS WHEN THE VEHICLE IS STATIONARY, TURNING,BRAKING (SLOWING DOWN AND THEN TRYING TO GO BACK TO NORMAL SPEED.  THIS HAPPENS ON INTERSTATES, AROUND TOWN, ETC.",
        "vin": "4S4BRCLC0E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2017",
        "dateOfIncident": "08/17/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016013,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I WAS NEVER INFORMED FROM SUBARU INC., OR THE DEALER OF ANY RECALL SUBJECT TO THIS VEHICLE. IS THIS AUTO ON ANY RECALL LIST?",
        "vin": "4S4BRBCC7E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004884,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE EXPERIENCED UNINTENDED ACCELERATION WHEN APPROACHING A RED LIGHT. THE CONTACT'S FOOT WAS NOT DEPRESSING THE ACCELERATOR PEDAL AT THE TIME OF THE FAILURE. ALSO, THE RPMS INCREASED TO 3,000. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT HAD TO SHIFT THE VEHICLE INTO NEUTRAL IN ORDER TO REGAIN NORMAL FUNCTIONALITY. THE CONTACT STATED THAT THE FAILURE OCCURRED APPROXIMATELY TWELVE TIMES SINCE FEBRUARY OF 2017. THE CONTACT TOOK THE VEHICLE TO KINGS SUBARU OF MASON, OHIO TWICE, BUT THEY WERE NOT ABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 22,000. UPDATED 08/15/17*LJ    *CN  *TR",
        "vin": "4S4BRCMC9E3"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002734,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD THREE ACCIDENTS INVOLVING THE SAME THING.  YOU CAN'T SEEM TO SLOW THE CAR DOWN ENOUGH TO STOP IT. TWO OF THE TIMES, WE HAVE PULLED INTO A PARKING PLACE,GOING AT A LOW SPEED,AND WHEN YOU STEP ON THE BRAKE,THE CAR ACCELERATES AND JUMPS FORWARD INSTEAD OF STOPPING. ALSO THE AIR BAGS DOESN'T COME ON.",
        "vin": "4S4BRBAC5E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986087,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES COMPLETELY FAILED WHILE DRIVING ON A CITY STREET, SLOWING TO LET A PEDESTRIAN CROSS IN A CROSSWALK. THE VEHICLE HAD A 100% BRAKE FAILURE.  THE BRAKE PEDAL WENT TO THE FLOOR.  THERE SEEMED TO BE A MALFUNCTION IN THE DUAL BRAKING SYSTEM.      FRONT BRAKES AND REAR BRAKES WERE SERVICED AT A SUBARU DEALERSHIP AT DIFFERENT TIMES.  THE BOLTS HOLDING THE PASSENGER SIDE REAR CALIPER SEPARATED FROM THE CAR. THE BOLTS HAD BACKED OUT.  THE LOWER ONE WAS MISSING.  THE OTHER CALIPER BOLT HAD BACKED OUT OF THE THREADS BUT WAS LOOSELY HELD IN PLACE BY THE BRAKE HOSE. THE DRIVER SIDE REAR CALIPER DID NOT APPEAR TO BE LEAKING.",
        "vin": "4S4BRBCC3E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981147,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. WHILE STATIONARY, THE VEHICLE CONSUMED AN INORDINATE AMOUNT OF OIL. THE VEHICLE WAS DIAGNOSED AS HAVING AN OIL CONSUMPTION FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "4S4BRCLC0E3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/11/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980329,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT TIMES WHEN YOU PRESS THE ACCELERATOR FROM A STOP IT TAKES 5 OR 6 SECONDS TO RESPOND.I WAS PULLING ON TO THE HIGHWAY  TURNING LEFT.THIS COULD BE A VERY DANGEROUS OR EVEN FATAL INCIDENT IF THERE WAS ONCOMING TRAFFIC.READING FROM THE INTRNET I SEE THAT THIS HAS BEEN A PROBLEM AS FAR BACK AS 2013.SOMEONE NEEDS TO FIX THIS PROBLEM BEFORE SOMEONE DIES.",
        "vin": "4S4BRCCC2E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "03/21/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967819,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POSSIBLE OIL CONSUMPTION. I HAVE IT TWICE OR THIRD AND I HAVE NOTICED THAT OIL WAS GONE WHEN I CHECKED THE OIL LEVELER. YESTERDAY, I HAVE TALKED TO SUBARU SERVICE DEPT ABOUT IT AND HE SAID IT IS OK THAT KEEP POUR OIL INTO EVERY 1200 MILES (BURNED SOME OIL AND BETWEEN OIL CHANGE). I BOUGHT OIL AND POUR IT INTO. I DON'T BELIEVE IT WAS SO NORMAL FOR BURNED SOME OIL LIKE EVERY 1200 MILES. I AM CONCERNING ABOUT IT.",
        "vin": "4S4BRBCC3E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967846,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE SHOP FOR MOTOR PROBLEM AT DEALER GETTING FIX.",
        "vin": "4S4BRBCC7E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "05/12/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946925,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED AFTER 1 YEAR OLD FROM SUBARU DEALERSHIP. IN 2014 AT ABOUT 17,000 MILES.  AFTER EVER OIL CHANGE, THE OIL LIGHT GOES ON AT ABOUT - 1,500 MILES PRIOR. TONTHE OIL CHANGE BEING DUE. I WENT TO THE LOCAL DEALERSHIP AND THEY STAYED IT IS NORMAL WITH THAT LIGHTER AEGHT SYNTHETIC OIL.  RECOMMENDED OIL CONSUMPTION TEST IF IT KEPT HAPPENING.  NOW I FIND OUT TODAY FROM CORPORATE SUBARU # THAT WARRANTY EXPIRED AT 69,000.  I HAVE 66,000 ON MY OUTBACK.  THE LOCAL DEALER NEVER INFORMED ME ABOUT THE 60,000 LIMIT.  I & MY HUSBAND OWN AN INDEPENDENT GOODYEAR DEALERSHIP, HAVE 4 MECHANICS, WHY WOULD I WANT TO PAY ANOTHER DEALERSHIP TO GO A CONSUMPTION TEST.",
        "vin": "4S4BRBLC8E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946210,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 1ST AND AGAIN ON JANUARY 3RD AFTER VEHICLE WAS PARKED AT LEAST 5 HOURS, I CAME OUT OF BUILDING AND VEHICLE HAD ROLLED 2 FEET FORWARD FROM WHERE I ORIGINALLY PARKED IT. WENT AND TALKED WITH PATRICK MOTORS  WHERE I HAD PURCHASED THE CAR NEW. SERVICE FOREMAN SAID NEVER HEARD OF THAT. HE SAID MAKE APPT. AND THEY WILL SEE IF IT ROLLS. I THEN TALKED WITH SUBARU OF AMERICA AND WAS TOLD THE SAME THING. I LEFT THE CAR FOR 2 DAYS AND IT DID NOT ROLL. NOW HAVE BEEN TOLD NOTHING CAN BE DONE UNTIL IT ROLLS THERE. A FRIEND WAS WITH ME THE FIRST TIME THIS HAPPENED WHO IS AN ENGINEER. HER IMMEDIATELY SAID IT WAS SOMETHING TO DO WITH MY PARKING PIN. WHEN I LOOKED THIS UP WITH NHTSA , I FOUND THERE WAS A RECALL ON SOME OF THESE CARS FOR THAT PROBLEM. I DON'T KNOW HOW THEY NARROW IT DOWN TO ONLY CERTAIN CARS BUT MY CAR HAS ROLLED 2 TIMES AND HAS GOT TO HAVE SOMETHING TO DO WITH THE PARKING PIN.",
        "vin": "4S4BRDLC8E2"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "12/28/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940052,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD SEVERAL INSTANCES WHERE WHEN DRIVING IN SNOW ON INTERSTATE THE SNOW GETS PACKED IN THE WHEELS IT CAUSES SEVERE PROBLEMS STEERING. ON MORE THAN ONE INSTANCE I HAVE HAD TO PULL OFF THE ROAD AND FIND A CAR WASH TO CLEAN THE SNOW IN ORDER TO BE ABLE TO DRIVE SAFELY. FRONT END VIBRATES SO MUCH I HAD TO REDUCE SPEED TO BELOW 45 MPH AND TO PULL OFF THE ROAD. I HAVE ASKED SUBARU THROUGH THEIR NATIONAL SUPPORT HOTLINE HOW TO SOLVE THE PROBLEM. THEIR RESPONSE WAS THAT THEY HAD NEVER HEARD THIS COMPLAINT AND DID NOT HAVE A SOLUTION. I ASKED THAT THEY EMAIL THEIR RESPONSE SO I WOULD HAVE IT IN WRITING. THEY SAID THEY WOULD DO THAT BUT NO RESPONSE WAS EVER RECEIVED. I DID CONFIRM THEY HAD MY CORRECT EMAIL ADDRESS AND HAVE RECEIVED SURVEY FOLLOWUPS USING MY EMAIL ADDRESS BUT NOTHING FROM THE SUPPORT CENTER. PURCHASING REPLACEMENT STEEL WHEELS CAN RESOLVE THE PROBLEM BUT THEY ARE EXPENSIVE ( $400 TO $1000) DEPENDING ON WHEEL TYPE. THE LOCAL DEALER OFFERED THE SOLUTIONS OF SPRAYING PAM INSIDE THE WHEEL WELL, BUYING AFTER MARKET WHEEL COVERS ( NONE EXIST PER MY RESEARCH), OR DEALER REPLACING THE WHEELS AT COST OF $1200 WHICH MAY INCLUDE TIRES, NOT SURE. LOCAL DEALER ALSO OFFERED TO HOSE OUT MY WHEELS IF I BROUGHT IT IN WHICH WOULD REQUIRE DRIVING THE VEHICLE WITH THE PROBLEM WHICH IS UNSAFE. WHEN I ASKED ABOUT TOWING THEY POINTED OUT THE VEHICLE IS OUT OF WARRANTY, 39,000 MILES. I POINTED OUT THAT IT HAD HAPPENED PRIOR TO WARRANTY RUNNING OUT AND HAD BEEN PREVIOUSLY REPORTED WITH NO SOLUTION PROVIDED. I LIVE IN A SNOWY AREA AND HAVING TO PULL OFF THE ROAD EACH TIME THIS ISSUE OCCURS IS UNSAFE. MY CONCERN IS THAT SUBARU DOESN'T WANT TO ACKNOWLEDGE THE PROBLEM FORMALLY AND THAT THE SAFETY OF THE OWNERS SHOULD BE CONSIDERED.  *TR",
        "vin": "4S4BRCCC9E3"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/20/2016",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936591,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG ALARM SETOFF AND BLINKING WHETHER SOMEONE OCCUPIES THE PASSENGER SEAT OR NOT. CAN NOT TURN THE ALARM OFF",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2016",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935499,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED FEB 2014, SINCE THEN I HAVE HAD ISSUES WITH THE OIL LIGHT COMING ON.  THE FIRST TIME WAS AT 3400 MILES AND THE OIL IS LOW.  I HAVE ADDED UP TO A QUART OF OIL.  MY CAR HAS ABOUT 34,000 MILES ON IT NOW AND I HAVE HAD THE OIL LIGHT COME ON WITH LOW OIL ABOUT 7 TIMES.  THE LIGHT COMES ON USUALLY BETWEEN 3400 & 4000 MILES.  THIS IS MY SECOND OUTBACK AND I NEVER HAD ANY ISSUES WITH THE FIRST ONE.  I HAVE BEEN OUT OF TOWN ALL BUT 1 OF THESE TIMES WHEN THE LIGHT CAME ON.  I LIVE 1-1/2 HOURS FROM THE NEAREST SERVICE CENTER AND THEY KEEP HAVING ME COME EVERY 1200 MILES TO DO A OIL CHECK.  THE FIRST TIME THE LIGHT CAME ON IT WAS FEBRUARY 5, 2014 AND HAS COME ON 5-6 TIMES SINCE THEN.  *TR",
        "vin": "4S4BRBLC3E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/05/2016",
        "dateOfIncident": "10/18/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924424,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU OUTBACK MOON ROOF IS THE PROBLEM.  AND APPARENTLY THIS IS A KNOWN PROBLEM WITH SUBARU VEHICLES, AND YET,THEY CHOOSE TO NOT SHARE THIS INFORMATION, EVEN WHEN SPECIFICALLY DISCUSSED PRIOR TO PURCHASE.  EVEN IF YOU DO NOT OPEN THE ROOF, THERE ARE DRAINS THAT CAN CLOG, AND WHEN THEY CLOG, THE CAR STARTS FILLING WITH WATER.  THE CLOG, IN MY CASE, WAS FROM FIR NEEDLES, SINCE I LIVE IN THE MOUNTAINS. BUT THEY ALSO SAY THAT SIMPLY A SPIDERWEB OR ROAD DIRT CAN CAUSE A CLOG OF THESE VERY SENSITIVE DRAINS.  IN MY CASE, WATER WAS RUNNING DOWN THROUGH THE DRIVER SIDE SEAT BELT SHAFT, AND ON TO THE BACK SEAT FLOOR.  SINCE IT RAINS A LOT, THEN LOTS OF WATER CAN COME IN.  MANY, MANY GALLONS OF WATER.  IT HAPPENS BOTH WHEN THE VEHICLE IS PARKED AND WHEN IT IS MOVING.  WE HAD TWO OCTOBER STORMS THAT DROPPED A GREAT DEAL OF RAIN, WHICH CAUSED SO MUCH WATER TO ENTER THE CAR THAT IT SLOSHED WHEN DRIVEN; LITERALLY, LIKE DRIVING A SWIMMING POOL!  AFTER MUCH DISCUSSION, SUBARU AGREED TO CLEAN THE DISASTER ONCE ONLY UNDER WARRANTY, AND THEN THEY WERE DONE.  THERE IS NOTHING IN THEIR MANUALS ABOUT KEEPING THESE MYSTERY DRAINS CLEAR.  THEY JUST HOPE THAT IT WILL NOT BE A PROBLEM DURING THE WARRANTY PERIOD.  THEY WILL LIE TO YOUR FACE ABOUT THE INTEGRITY OF THE WATER TIGHT NATURE OF THAT ROOF WINDOW.  REPEATEDLY.  AND ONCE THOSE HIDDEN DRAINS START TO CLOG, THE WINDOWS INITIALLY START FOGGING UP, FOLLOWED BY LARGE AMOUNTS OF MOLD AND OTHER NASTINESS.  THEN THE CARPETING, UPHOLSTERY AND ALL OTHER \"SOFT\" COMPONENTS OF THE CAR NEED TO BE REPLACED.  BUT THERE IS NO WAY TO CLEAN THE AIR VENT SYSTEM, SO MOLD IS THERE TO STAY.",
        "vin": "4S4BRBLC9E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "05/05/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917603,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT STATED THAT THERE WAS AN INTERNAL OIL CONSUMPTION FAILURE. THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. AFTER THE VEHICLE WAS TAKEN TO THE DEALER THREE TIMES, THE VEHICLE PASSED AN OIL CONSUMPTION TEST TWICE. THE SERVICE ENGINE AND OIL INDICATORS RANDOMLY ILLUMINATED FOR MONTHS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT PROVIDED NO SOLUTION. THE FAILURE COULD CAUSE CATASTROPHIC ENGINE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2016",
        "dateOfIncident": "10/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917326,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL SENSOR LIGHT ON DASH ILLUMINATES. OIL IS LOW. SENSOR MEASURES PRESSURE NOT LEVEL. OIL PUMP HAS NOT BEEN REPLACED. DEALER HAS ATTEMPTED TO FIX ISSUE(4 TIMES). REPLACED SENSOR, OIL CONSUMPTION TEST. VEHICLE IN AGAIN AT 34000 MILES FOR SAME ISSUE. DEALER MENTIONED SUBARU IS AWARE OF THE PROBLEM. LAST RESORT IS A COMPLETE ENGINE REPLACEMENT.",
        "vin": "4S4BRBPCXE3"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904435,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT SENSOR FOR THE PASSENGER SIDE IS NOT WORKING CAUSING THE AIRBAG TO BE DEACTIVATED. THE SEATBELT INDICATOR SIGNAL BEEPS REGARDLESS OF WHETHER SOMEONE IS SITTING IN THE SEAT WITH THE SEATBELT ON OR NO ONE IS SITTING IN THE SEAT. IT IS FAILING TO SENSE ANY WEIGHT. I BOUGHT THIS CAR BRAND NEW ON 9/9/13 AND THIS SHOULD NOT BE FAULTY.",
        "vin": "VS4BRDLC6E2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "08/21/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898688,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PUT THE PARKING BREAK ON IT GOT STUCK THE LIGHT FINALLY WENT OFF AND THE AT OIL TEMP LIGHT CAME ON I TOOK CAR TO DEALERSHIP THEY INFORMED ME THAT THE CAR HAD NO TRANSMISSION FLUID AND THEY BELIEVED THAT THE PLACE THAT CHANGED MY OIL HAD ACCIDENTALLY DRAINED TRANSMISSION FLUID THAT'S NOT POSSIBLE I NEVER HAD ANY ISSUES OR LIGHTS ON UNTIL THE NIGHT I PUT PARKING BREAK ON THE CAR ALREADY HAD A TRANSMISSION PROBLEM",
        "vin": "4S4BRBCC8E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896517,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF EMERGENCY BRAKE.  FAILURE OCCURRED AT 13800 MILE AND AGAIN AT 13900 MILES WHILE BEING DRIVEN HOME FROM DEALERSHIP.  VEHICLE DIAGNOSED WITH FAILED EPB MODULE.  EMERGENCY BRAKE WILL NOT ENGAGE WHEN MODULE IS IN FAILED CONDITION.",
        "vin": "4S4BRCACXE1"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "06/28/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884119,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING CAR INTO PARKING SPACE AT SLOW SPEED WHEN CAR, WITHOUT DRIVER INPUT, SUDDENLY ACCELERATED.  HEAVY PRESSURE ON BRAKES, DRIVER FELT THE ABS CYCLING, DID NT STOP VEHICLE.  FINALLY, AFTER COLLIDING WITH A PARKED CAR, NOSE TO NOSE AND PUSHING OTHER CAR OUT OF ITS PARKING SPOT, DRIVER WAS ABLE TO STOP THE CAR MY MOVING TRANSMISSION GEAR SELECTOR TO PARK",
        "vin": "4S4BRBLC7E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "11/24/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820411,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OR ABOUT NOV 24, 2015, AN IGNITION PROBLEM DEVELOPED.  WHEN TURNING THE IGNITION SWITCH THERE WAS NO POWER.  WITH EACH TURN, MORE AND MORE POWER TURNED UNTIL IT FINALLY STARTED.  ACCORDING TO SHEEHY SUBARU, SPRINGFIELD, VA, THERE WAS NOTHING WRONG WITH THE VEHICLE AND STATED \"I NEEDED TO START THE CAR EVER COUPLE OF DAYS.\"  ABOUT 2 WEEKS LATER, REYNOLDS GMC SUBARU CAME AND PICKED UP THE CAR AND SAID THERE WAS TECHNICAL BULLETIN OUT FOR THIS PROBLEM (I WAS NOT ABLE TO LOCATE) AND THEY HAVE FIXED TWENTY OTHER CARS WITH THIS SAME PROBLEM.  THE CAR WAS FINE UNTIL JANUARY 11, 2016, THE CAR STARTED EXHIBITING THE SAME IGNITION ISSUES. I CONTACTED REYNOLDS WHO CONTACTED SUBARU ENGINEERS WHO SAID NOT TO HAVE MY FOOT ON THE GAS PEDAL WHEN I TURN THE IGNITION KEY.  THE VEHICLE STARTS WITH A FOOT ON THE GAS PEDAL OR NOT.  THEY STATED THE CAR WAS DESIGNED NOT TO START WITH A FOOT ON THE PEDAL.  I WAS CALLED BACK AND THEN TOLD THE SUBARU ENGINEERS SAID THE PROBLEM IS INTERMITTENT, SOME VEHICLES HAVE THIS PROBLEM AND OTHERS DON'T. DEAL WITH IT.  THE CAR HAS 15K MILES AND IS ALMOST BRAND NEW AND HAS MAJOR ELECTRICAL PROBLEMS.  ON TUESDAY, JANUARY 12TH, 2015, DASH INSTRUCTIONS BEGAN FLASHING ON AND OFF.  THAT IS NOT NORMAL.  PRIOR TO HAVING NITROGEN PUT IN THE TIRES, THE CAR CONSTANTLY PULLED TO THE RIGHT AND LOST AIR PRESSURE WEEKLY.  BUT NOW I AM VERY CONCERNED ABOUT THE ELECTRICAL PROBLEMS.  SUBARU HAS BEEN NOTIFIED.",
        "vin": "4S4BRCLC3E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2016",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818527,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2014 OUTBACK  WITH STATIC NOISE COMING FROM THE AUDIO / SPEAKER SYSTEM; BOTH WITH OR WITHOUT THE RADIO BEING TURNED ON. THIS WILL HAPPEN RANDOMLY, WITH NO PARTICULAR SET PATTERN OR OBVIOUS REASON; IT'S IMPOSSIBLE TO PREDICT WHEN THIS WILL HAPPEN OR EVEN TRY TO RE-CREATE. WE DON'T HAVE THE NAVIGATION PACKAGE. I HAVE A HARMON RADIO WITHOUT SATELLITE. THERE DOESN'T APPEAR TO BE A PATTERN AND THE DEALER CANNOT PINPOINT THE ISSUE. THIS HAPPENS EVEN WHEN THE RADIO IS OFF AND I AM NOT USING THE BLUETOOTH. THIS HAS HAPPENED WITH OR WITHOUT ENGINE RUNNING. THIS HAS CONTINUED TO HAPPEN SINCE I HAVE OWNED VEHICLE RANDOMLY.",
        "vin": "4S4BRBLC5E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817426,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 29000 MILEAGE ON THE MY 2014 SUBARU OUTBACK, I WAS DRIVING ON THE HIGHWAY AND THE OIL LEVEL LAMP ILLUMINATED. I PULLED OVER AND CHECKED THE OIL LEVEL AND FOUND IT TO BE NOT READABLE ON THE DIPSTICK. I ADDED A QUART, WHICH BROUGHT THE LEVEL TO HALF. I THEN REPORTED TO THE DEALER, BEARDMORE SUBARU IN BELLEVUE, NE. THEY UPDATED THE SOFTWARE AND REPLACED THE OIL LEVEL SWITCH. THEY ALSO INITIATED A AN OIL CONSUMPTION TEST AND I HAVE TO RETURN IN 1200 MILES TO HAVE LEVEL RECORDED. HOWEVER, WHEN I LEFT THE DEALERSHIP, I CHECKED THE OIL A FEW WEEKS LATER (APPROX 400 MILES DRIVEN), WHILE THE ENGINE WAS COOL, AND NOTICED THE OIL LEVEL WAS WELL ABOVE THE FULL MARK. CLEARLY THEY OVERFILLED THE ENGINE. ADDITIONALLY, THE MECHANIC LEFT OPEN THE TOP OF THE COOLANT RESEVOIR (WHICH I DID NOT ASK THEM TO EVEN CHECK). I WILL BE CALLING THEM ON MONDAY TO REPORT THIS ISSUE.",
        "vin": "4S4BRCPC2E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/28/2015",
        "dateOfIncident": "09/20/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816416,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I NEED TO PURSUE A CRITICAL PROBLEM THAT THE DEALER IS UNABLE TO RE-CREATE/SOLVE.  APPROXIMATELY A DOZEN TIMES(10 BY MY WIFE AND 3 BY ME), WE'VE TURNED LEFT FROM A STOP(TYPICALLY AT A RED-LIGHT) ONLY FOR THE CAR TO STALL FROM 3 TO 6 SECONDS.  THE 3 TIMES I WAS DRIVING, MY WIFE AND A GRANDCHILD WERE ON THE PASSENGER SIDE AND NARROWLY MISSED A DIRECT SIDE IMPACT.  THE PROBLEM IS INTERMITTENT, WE DON'T DRIVE WITH OUR LEFT FOOT ON THE BRAKE,  AND WE ESTIMATE IT TO OCCUR ONCE OUT OF EVERY 60 TO 75 LEFT TURNS AND WHILE I FULLY UNDERSTAND THE DEALER STATING THE PROBLEM CANNOT BE RE-CREATED AND THE COMPUTER ANALYSIS SHOWING NO PROBLEMS THUS MAKING IT DIFFICULT TO SOLVE, WHAT I WILL NOT UNDERSTAND IS WHEN ONE OF MY FAMILY MEMBERS ARE CRITICALLY INJURED BECAUSE \"WE CAN'T RECREATE THE PROBLEM\".  YOU'RE PROMPT ATTENTION ON THIS MATTER WOULD BE GREATLY APPRECIATED AS WE'VE ALREADY TAKEN THE CAR TO THE DEALER FOR THE SAME PROBLEM 3 TIMES(THE CAR IS AT THE DEALER NOW AND AGAIN NO PROBLEM COULD BE FOUND).",
        "vin": "4S4BRCMC2E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/17/2015",
        "dateOfIncident": "12/14/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810913,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PERIODICALLY THE VEHICLE WILL NOT ACCELERATE FOR 3-5 SECONDS FROM A STANDING STOP WHEN THE GAS PEDAL IS DEPRESSED . THIS IS WELL DOCUMENTED IN SEVERAL SUBARU USER GROUPS ON THE INTERNET. WHEN PULLING INTO BUSY TRAFFIC THIS PROBLEM IS TERRIFYING. THE CAR WILL JUST NOT ACCELERATE.    THE CAR WAS RETURNED TO THE DEALER AND, AS EXPECTED, HE COULD FIND NOTHING WRONG. WE TOLD THE DEALER THAT THE PROBLEM MAY ONLY OCCUR ONCE OR TWICE A WEEK, AND THAT HE WOULD NOT EXPERIENCE THE PROBLEM WITH A TEST DRIVE.    THE DEALER SAID THAT SUBARU BUILT IN A \"SAFETY SYSTEM\" THAT MAY CAUSE THIS IF ONE WAS DRIVING WITH TWO FEET. IN OTHER WORDS IF I HAD ONE FOOT ON THE BRAKE, AND ONE ON THE ACCELERATOR THE CAR WOULD \"DIE\". I TOLD HIM I DON'T DRIVE WITH TWO FEET. HE INSISTED THAT THAT MUST BE THE PROBLEM.",
        "vin": "4S4BRBLC6E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2015",
        "dateOfIncident": "02/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807300,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING AFTER A NEAR STOP, THE ENGINE HESITATES FOR AT LEAST 3 SECONDS AT ACCELERATION WHICH IN MANY INSTANCES HAS BEEN VERY DANGEROUS UPON ENTERING TRAFFIC, ESPECIALLY TURNING LEFT AND ENTERING A HIGH TRAFFIC STREET OR ROAD.",
        "vin": "4S4BRCLC6E3"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "11/18/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10806202,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HIT BY A 1979 DODGE PICKUP THAT RAN A RED LIGHT ON 6TH STREET WHILE I WAS DRIVING 30 MPH HEADED NORTH ON JACKSON STREET IN TOPEKA, KANSAS.  IT IMPACTED MY SUBARU ON THE PASSENGER SIDE IN THE AREA OF THE FRONT FENDER AND FRONT DOOR.  UPON IMPACT, NONE OF MY AIRBAGS DEPLOYED NOR DID MY SEAT BELT RESTRAIN ME.  I HIT THE STEERING WHEEL WITH MY CHEST....UPDATED 12/03/15 *BF UPDATED 04/25/18 *JB  *TR",
        "vin": "4S4BRCDC3E3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "11/18/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787922,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2014 SUBARU OUTBACK, NOVEMBER 2014. I WANT TO REPORT THAT THE STEERING PULLS TO THE RIGHT. WE HAVE NOT HAD AN ALIGNMENT DONE YET. I'M SEEING OTHER DOCUMENTED COMPLAINTS AND THOUGHT I SHOULD REPORT THIS AS WELL. SOUNDS LIKE HAVING IT ALIGNED WON'T CORRECT THE ISSUE. PLEASE RESPOND IF ANYONE HAS A POSSIBLE SOLUTION.",
        "vin": "4S4BRBCC5E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "09/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778864,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE TIMES ENGINE HAS FAILED TO RESPOND TO ACCELERATOR INPUT. DURATION, 3 TO 15 SECONDS.  HAPPENS AT LOW SPEED (<20MPH)  JUST  AFTER COASTING FOR A FEW SECONDS AND AS ENGINE IS HEATING UP.   LAST INCIDENT, 9/27/2015, BACKED OUT OF PARKING SPACE, THEN SHIFTED INTO FORWARD, DID NOT USE ACCELERATOR BECAUSE COLD ENGINE SPEED WAS HIGH ENOUGH TO MAINTAIN 5MPH THROUGH VERY CONGESTED PARKING LOT.  20 SECONDS LATER ATTEMPTED TO ACCELERATE TO 35MPH, ENGINE SPEED NEVER RESPONDED FOR THE NEXT 15 SECONDS, THEN ENGINE STARTED  RESPONDING NORMALLY.   NO CHECK ENGINE LIGHT.  THESE FAILURES STARTED 4 MONTHS AGO, AND HAPPENS WHEN CVT TRANSMISSION IS IN AUTO OR MANUAL MODE.      I CHECKED INTERNET AND FOUND SEVERAL SIMILAR REPORTS.   DEALERS AND SUBARU CORP., NO HELP AT ALL.    IN CERTAIN DRIVING SITUATIONS, LOSS OF ENGINE CONTROL COULD BE JUST AS DANGEROUS AS LOSS OF BRAKES.",
        "vin": "4S4BRBCC1E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/26/2015",
        "dateOfIncident": "08/23/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759466,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ATTEMPTING TO PULL MY SUBARU OUTBACK INTO MY GARAGE AND WAS HEADING  TOWARD THE GARAGE DOOR OPENING WHEN I THOUGHT I HAD PUT MY RIGHT FOOT ON THE FOOT BRAKE TO STOP THE CAR, HOWEVER, IT CONTINUED TO PROCEED FORWARD BECAUSE MY FOOT WAS UNDER THE BRAKE PEDAL. CONSEQUENTLY, I HIT THE CORNER OF THE GARAGE WITH MINOR DAMAGE TO MY FRONT BUMPER. UPON FURTHER CHECKING THE BRAKE AND GAS PEDALS , I CONFIRMED THE BRAKE PEDAL WAS SIGNIFICANTLY HIGHER THAN THE GAS PEDAL AND MY FOOT  COULD FIT UNDER THE BRAKE PEDAL AFTER MOVING IT SIDEWAYS FROM THE GAS PEDAL. IN ADDITION, ON TWO OTHER OCCASIONS, I HAD MOVED MY RIGHT FOOT FROM THE GAS PEDAL TO THE BRAKE  PEDAL AND WHEN PRESSING DOWN ON THE BRAKE PEDAL MY RIGHT FOOT WAS ALSO PRESSING ON THE GAS PEDAL AND THE CAR CONTINUED FORWARD (AT LOW SPEED) UNTIL I PLACED THE GEAR SHIFT IN PARK.    I'VE OWNED THIS CAR FOR ONE YEAR AND I THOUGHT I WAS COMPETENT IN IT'S DRIVING TECHNIQUES REQUIREMENTS,  BUT NOW I'M BEGINNING TO WONDER. I HAVE A WIDE FOOT, IS THERE A MINIMUM REQUIRED SIDEWAYS SPACING OR SIMILAR PEDAL HEIGHTS BETWEEN GAS AND BRAKE PEDALS WHICH PREVENTS THESE OCCURRENCES? I NEVER EXPERIENCED THESE INCIDENTS IN MY PREVIOUS CAR ( 2004 BUICK LESABRE) OR OTHER CARS I HAVE OWNED.",
        "vin": "4S4BRBLC5E3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/21/2015",
        "dateOfIncident": "07/18/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735635,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "CENTENNIAL TIRES",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY 2014 SUBARU OUTBACK 3.6R CAME WITH CONTINENTAL PRO CONTACT GX P225/60 R17 TIRES. NOTICE ONE OF THE TIRES WAS SIGNIFICANTLY DEFLATED. TOOK TO DEALER AND I WAS TOLD THAT THERE WAS A SMALL HOLE BUT NO NAIL AS THE CAUSE. NOW MY PASSENGER SIDE REAR TIRE HAS DEVELOPED SIDE WALL BUBBLE. I TOOK TO SUBARU DEALER WHO DID NOTHING AND TOLD ME TO CALL CONTINENTAL TIRES ABOUT WARRANTY (DIDN'T EVEN WARN ME OF THE DANGER NOR DID THEY PUT THE SPARE TIRE ON) CONTINENTAL SAID PASSED RESPONSIBILITY BACK TO DEALER. I THEN WENT TO DISCOUNT TIRES THEN AMERICAS TIRES. ALL SAID (BEFORE EVEN LOOKING AT THE TIRE) THAT IMPACT DAMAGE IS NOT COVERED. FIRST  95% OF MY DRIVING IS HIGHWAYS AND I HAVE HIT NO POT HOLES OR HAD ANY TYPE OF IMPACT. I HAVE BEEN DRIVING FOR 35 YEARS AND I HAVE NEVER HAD THIS PROBLEM WITH TIRES. THERE IS 350 COMPLAINTS IN DEPARTMENT OF CONSUMER AFFAIRS ABOUT SIDEWALL PROBLEMS WITH THESE TIRES. THIS IS UNACCEPTABLE. WHAT WILL IT TAKE FOR CONTINENTAL TO TAKE RESPONSIBILITY?",
        "vin": "4S4BRDLC8E2"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/13/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733544,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR BRAKE BEGAN TO CLATTER, THEN SCRAPE. THE ROTOR WAS BADLY SCORED. THE DEALER CLAIMED THAT THIS WAS DUE TO ROAD SALT AND NOT COVERED BY THE EXTENDED WARRANTY. THAT IS, CALLED IN \"NORMAL\" WEAR. THERE'S NOTHING NORMAL ABOUT ONE REAR BRAKE FAILING THAT EARLY ... AND WITH LITTLE WEAR SHOWING ON THE OTHER BREAKS. THE CALIPER WAS STICKING AND THAT'S A DESIGN/CONSTRUCTION FLAW.",
        "vin": "4S4BRCDCXE3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2015",
        "dateOfIncident": "03/26/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731810,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME ISSUE AS LISTED IN COMPLAINT 10715452.  WHILE MAKING A LEFT TURN ON  RETURN FROM VEHICLE PURCHASE, THE VEHICLE STOPPED IN THE MIDDLE OF THE INTERSECTION FOR SEVERAL SECONDS WITH THE ENGINE RUNNING.  I WAS NEARLY T-BONED WHILE WAITING FOR THE DRIVE SYSTEM TO RE-ENGAGE.  TO DATE, 2JUL15, THIS STALLING SITUATION HAS OCCURRED NUMEROUS TIMES.  I HAD THE DEALER INSPECT THE VEHICLE, BUT NO OUT OF SPECIFICATION CONDITIONS WERE FOUND.  I THINK THE PROBLEM RESTS WITH THE CVT TRANSMISSION TRYING TO SHIFT DURING ACCELERATION.  I RECENTLY LEARNED BY EXPERIMENTATION THAT I MIGHT BE ABLE TO MINIMIZE THE PROBLEM BY PLACING THE TRANSMISSION IN MANUAL MODE AND FORCING IT TO REMAIN IN 1ST DURING ACCELERATION.  I DO NOT BELIEVE THAT ONE SHOULD BE FORCED TO MANIPULATE AN AUTOMATIC TRANSMISSION TO AVOID A VERY DANGEROUS STALL DURING ACCELERATION.  SOMEONE IS GOING TO BE SERIOUSLY INJURED OR KILLED BECAUSE OF THIS PROBLEM.  A VEHICLE RECALL IS REQUIRED....UPDATED 09/22/15 *BF  UPDATED 10/13/2015*JS",
        "vin": "4S4BRBCC1E3"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "05/26/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731625,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTERIOR WINDOWS WILL SUDDENLY GET COVERED WITH FOG. THIS HAS HAPPENED OVER TWENTY FIVE TIMES TO MY CAR. IT DOESN'T MATTER WHAT THE WEATHER, OR OUTSIDE TEMP IS. THIS, CAUSES A SERIOUS PROBLEM TRYING TO SEE OUT OF THE CAR.  THE FIRST TIME IT HAPPENED I CALED THE DEALERSHIP. I WAS TOLD TO RUN THE AC. IT CAN HAPPEN EVEN WHEN THE AC , IS ALREADY ON. I'VE HAD IT INTO THE DEALERSHIP  FIVE TIMES IN THE  14 MONTHS I'VE HAD THE CAR. THEY CAN'T FIND THE PROBLEM. I'VE TAKEN CLEAR PHOTOGRAPHS 3 TIMES SHOWING CLEAR IMAGES OF HOW BAD THE INTERIOR FOGGING GETS. DEALERSHIP TOLD ME TO CONTACT SUBARU AMERICA ASK FOR RPLACMENT. I HAVE SPOKEN TO THREE PEOPLE AT SUBARU, PROVIDED ALL PHOTOS. THEY REFUSE TO REPLACE. THIS IS GOING TO CAUSE AN ACCIDENT. MUNN 16 2015 IT HAPPENED WHILE I WAS ON INTERSTATE I-205 AND IT MADE SEEING OUT OF THE CAR ALMOST IMPOSSABLE. I HAD TO CAREFULLY PULL OF TO ROAD SIDE WIPE WINDSHIELD AND ALL INTERIOR WINDOWS OFF. I HAVE TO CARRY TOWELS WITH ME AT ALL TIMES. PROBLEM HAPPENS WITHOUT ANY INDACATION, IT'S ABOUT TO HAPPEN. I'M DISABLED VETERAN AND REQUIRE A LOT OF MEDICAL APPOINTMENTS AT THE VA MEDICAL CENTER. I LIVE ALONE SO I'M TAKING A CHANCE JUST TRYING TO GET TO THE VA. AT SOME POINT THIS IS GOING TO CAUSE AN ACCADENT. SUBARU SHOWED LITTLE CONCERN, EVEN IF THERE ARE OTHERS WITH THE SAME OR SIMILE PROBLEM.",
        "vin": "4S4BRDLC2E2"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726419,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNGLASSES STORAGE COMPARTMENT DOOR OF THE OVERHEAD CONSOLE WILL NOT STAY LATCHED UP.  IN THE UNLATCHED POSITION THE DOOR BLOCKS THE REAR VIEW MIRROR.",
        "vin": "4S4BRCCC3E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2015",
        "dateOfIncident": "03/05/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723778,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE TIME I HAVE HAD THIS CAR, THERE IS A LOT OF ENGINE HESITATION GOING FROM REVERSE TO DRIVE. WE LIVE ON A BUSY STREET AND IT IS A SAFETY HAZARD WHEN WE BACK OUT OF THE DRIVEWAY, SWITCH INTO DRIVE, AND STEP ON THE GAS PEDAL - NOTHING HAPPENS FOR APPROXIMATELY 2 SECONDS, THEN THE CAR STARTS GOING FORWARD. THE DEALER HAS TRIED TO TELL ME IT IS THE CVT, BUT I WATCH THE TACHOMETER, AND THE ENGINE DOESN'T REV UP. I HAD SOME OF THIS PROBLEM WITH MY PREVIOUS (NON-CVT) 2005 OUTBACK, BUT THOUGHT IT WOULD BE BETTER 10 YEARS LATER. IT ISN'T - IT'S WORSE.  *TR",
        "vin": "4S4BRCLC0E3"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717483,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I USED THE OPTIONAL SEAT WARMERS AND TURNED THE ENGINE OFF AT THE END OF A TRIP.  WHEN I STARTED THE ENGINE AGAIN LATER THAT DAY, THE SEAT WARMERS WERE ON.  WHEN I FELT THE HEAT, I WAS CONFUSED, AND THOUGHT THERE MIGHT BE A FIRE, UNTIL I NOTICED THE SEAT WARMER LIGHT WAS ON.  I THINK WHEN THE CAR IS STOPPED AND TURNED OFF, THE SEAT WARMER FUNCTION SHOULD BE CANCELLED.",
        "vin": "4S4BRBLCXE3"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717533,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATES OCCASIONALLY ON ACCELERATION COMING OFF A STOP.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2015",
        "dateOfIncident": "05/07/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715452,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST FEW DAYS, MY VEHICLE MANY TIMES HESITATES FOR AT LEAST 3-5 SECONDS WHEN TRYING TO ACCELERATE FROM A STOP/REST AT A STOP LIGHT, ALMOST CAUSE ACCIDENT WHEN TRYING TO ENTER INTO AN INTERSECTION.  IT SEEMS TO HAPPEN AROUND 2000 - 3000/RPM.    THE CAR EVEN EXHIBITED SLIGHT JERKY WHEN AT THE START OF ACCELERATING UP A SLIGHT SLOPPY HILL.  THIS IS SERIOUS ISSUE AS ACCIDENT IS IMMINENT WHEN THE CAR HAS NO ACCELERATION WHEN TRYING TO GET GOING IN TRAFFIC.    THIS ISSUE IS COMMONLY EXPERIENCED BY OTHER DRIVERS (ONLINE FORUM) : HTTP://WWW.SUBARUOUTBACK.ORG/FORUMS/66-PROBLEMS-MAINTENANCE/98450-2014-OUTBACK-ACCELERATION-HESITATION.HTML",
        "vin": "4S4BRBPC5E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "11/15/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 9,
        "odiNumber": 10705991,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BACKED OUT OF MY DRIVEWAY AND PUT THE CAR INTO DRIVE AND THERE WAS A LONG, ABOUT 7 SECOND DELAY BEFORE THE CAR MOVED FORWARD. IT WAS IN GEAR AND MY FOOT WAS ON THE GAS BUT NOTHING HAPPENED.",
        "vin": "4S4BRBCC8E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2015",
        "dateOfIncident": "03/22/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703711,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3/22/15 WHILE APPROACHING A STOP SIGN THE ELECTRIC PARKING BRAKE LOCKED ON AT 10 MPH. AFTER PULLING OFF TO THE SIDE OF THE ROAD AND RELEASING AND APPLYING THE PARKING BRAKE SEVERAL TIMES IT FINALLY RELEASED WHILE THE CHECK ENGINE AND FLASHING BRAKE LIGHT REMAINED ON. AFTER SHUTTING THE VEHICLE OFF FOR 10 MINUTES THE SYSTEM RESET TO NORMAL. THE SYSTEM REMAINED NORMAL UNTIL ARRIVING AT A SUBARU DEALER ON 3/24/15 WHEN THE SAME PROBLEM OCCURRED. THE DEALER TOOK CONTROL, IDENTIFIED AND REPLACED A RELAY AND SEVERAL SENSORS. THE CAR PERFORMED NORMAL UNTIL 4/1/15 WHEN THE SAME PROBLEM OCCURRED WHILE TRAVELING 25 MPH. AFTER STOPPING AND RELEASING AND APPLYING THE PARKING BRAKE SEVERAL TIMES THE SYSTEM RESET BUT THE CHECK ENGINE, BRAKE AND CRUISE CONTROL LIGHTS REMAINED STEADY OR FLASHING. AFTER LETTING THE VEHICLE SET FOR A PERIOD OF TIME THE SYSTEM RESET ITSELF. ANOTHER APPOINTMENT HAS BEEN MADE AT THE DEALER FOR 4/6/15. THE CONCERN IS THAT IF THE PARKING BRAKE LOCKS AT HIGH SPEED OR IN HEAVY TRAFFIC IT COULD CAUSE A SERIOUS ACCIDENT.  *TR",
        "vin": "4S4BRBLC2E3"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/08/2015",
        "dateOfIncident": "03/08/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692840,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING UP TO PARK BEHIND A TOYOTA PRIUS ON A ROAD THAT WAS PARTIALLY COVERED WITH SNOW & ICE. THE WHEELS ON THE RIGHT SIDE OF THE VEHICLE WERE ON  SNOW & ICE AND THE WHEELS ON THE DRIVER'S SIDE OF THE CAR WERE ON DRY ROADWAY. I WAS DRIVING SLOWLY TO PARK WHEN THE CAR SUDDENLY ACCELERATED INTO THE REAR BUMPER OF THE TOYOTA PRIUS. THE ENGINE WAS RACING WILDLY AND MY ATTEMPT TO BRAKE WERE INEFFECTIVE. THERE WAS DAMAGE TO THE REAR TRUNK & BUMPER OF THE PRIUS AND DAMAGE TO THE FRONT OF THE SUBARU. I SUSPECT THAT THE SUBARU TRACTION/SPEED/STABILITY/ELECTRONIC THROTTLE CONTROLS HAD MALFUNCTIONED.  *TR",
        "vin": "4S4BRBCC6E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2015",
        "dateOfIncident": "02/09/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689951,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING A 2014 SUBARU OUTBACK I EXPERIENCE A 2-4 SECOND HESITATION UPON ACCELERATING.  IT FIRST HAPPEN WHEN TURNING LEFT, CROSSING TRAFFIC.  I STEPPED ON THE GAS PEDAL AND NOTHING HAPPENED FOR A FEW SECONDS AND THEN SUDDENLY ACCELERATED INTO ONCOMING TRAFFIC.  FORTUNATELY THERE WAS NO ACCIDENT JUST HORNS BEEPING FROM THE CAR I CUT OFF.  IT HAPPENED AGAIN WHEN ACCELERATING FROM A STOP ONTO A HIGHWAY.  THAT TIME I APPLIED THE BRAKES AS IT LUNGED FORWARD BEFORE ENTERING TRAFFIC.  IT HAPPENED A FEW MORE TIMES AT A STOP LIGHT IN THE 1 WEEK I DROVE IT.  THE ENGINE SEEMS TO STAY AT AN IDLE AND THEN AFTER THE 2-4 SECOND DELAY SUDDENLY ACCELERATES ACCORDING TO THE LEVEL THE PEDAL IS DEPRESSED.  THIS IS MY DAUGHTER'S VEHICLE AND I AM CONCERNED ABOUT HER AND HER FAMILY'S SAFETY.   THERE ARE MANY COMPLAINTS ON LINE REGARDING THIS PROBLEM WITH SUBARUS, NOT JUST OUTBACKS.  I ACTUALLY BROUGHT THE CAR IN TO GET THIS CHECKED OUT AND THEY TOLD ME THERE ARE NO SERVICE NOTIFICATIONS REGARDING HESITATIONS SO THEY CAN'T DO ANYTHING!  THEY STATED THAT IS NORMAL WITH A CVT TRANSMISSION.  BELIEVE ME, THAT IS NOT NORMAL AND IS AN ACCIDENT WAITING TO HAPPEN.  PLEASE REVIEW THE ON LINE COMPLAINTS.  *TR",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2015",
        "dateOfIncident": "02/19/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689615,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING WARMED UP THE CAR IN THE DRIVEWAY FOR FIVE MINUTES AND HAVING DRIVEN FOR APPROXIMATELY 10 MINUTES, BRAKING SEVERAL TIMES, DRIVER APPROACHED THE STOP SIGN AT THE TOP OF THE HILL WHERE THE ROAD INTERSECTS WITH A BUSY HIGHWAY.   SHE TRIED TO DEPRESS THE BRAKES AND NOTHING HAPPENED.  TO STOP THE CAR, SHE THREW THE CAR INTO PARK. \"CHECK ENGINE @ OIL TEMP\" LIGHT OR SOMETHING SIMILAR CAME ON.  SHE TURNED OFF THE CAR, WAITED A SHORT WHILE AND RESTARTED CAR, SHIFTED INTO DRIVE AND CAR WOULDN'T DO ANYTHING. TURNED OFF CAR.   A SHORT WHILE LATER SHE STARED AGAIN; AFTER PUSHING GAS HARD, CAR STARTED TO SLOWLY MOVE FORWARD. PUT CAR IN P AND WAITED FOR ASSISTANCE, LEAVING HEAT ON.  WHEN ASSISTANCE CAME 10-15 MIN LATER, CAR WAS ABLE TO BE DRIVEN TO A SAFE ROADSIDE SPOT AROUND THE CORNER.    CONDITION:  LOW TEMPS.  NO ICE ON ROADS.  *TR",
        "vin": "4S4BRCLC6E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2015",
        "dateOfIncident": "12/18/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683750,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG LIGHT WENT OFF WHEN NO ONE WAS IN THE SEAT.  THE DEALER SAID ALL SYSTEMS WERE FINE AND THAT THIS MIGHT BE DUE TO THE SEAT AND SENSOR BEING WET OR DAMP.  THIS IS NOT TRUE AS IT IS A PROBLEM AT LEAST TWICE A WEEK NOW.  I WILL RETURN AGAIN TO THE DEALER BUT HAVE NO FAITH IN THEM OR THE CAR.  I ALSO WONDER IF THE AIRBAG WILL WORK IN A REAL ACCIDENT.  I WOULD LIKE TO DITCH THE CAR AS AN HOUR AND A HALF RIDE WITH A CHIME GOING OFF IS CRAZY AND OF CONCERN.  *TR",
        "vin": "4SBRBCC9E32"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/08/2015",
        "dateOfIncident": "04/08/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681984,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE OUTBACK 3.6 R LIMITED BRAND NEW AND SOON AFTER I NOTICED THAT VEHICLE PULLED RIGHT AND I HAD TO CONSTANTLY CORRECT IT -WHICH BECAME EXHAUSTING AND A SERIOUS SAFETY ISSUE.  AT FIRST I THOUGHT IT WAS RELATED TO ALL WHEEL DRIVE (SINCE I NEVER OWNED AN ALL WHEEL DRIVE). AFTER SOME RESEARCH I REALIZED VEHICLE SHOULD NOT HAVE THIS ISSUE. I REPORTED THE PROBLEM WHEN I TOOK IT TO DEALER FOR ITS FIRST MAINTENANCE SCHEDULE AT 3,000 MILES. I WAS INFORMED THAT IT WAS THE WHEEL ALIGNMENT AND THEY FIXED.  THE PROBLEM APPEARED TO BE RESOLVED AT FIRST BUT AFTER 1 WEEK IT STARTED PULLING RIGHT AGAIN -BUT NOT AS NOTICEABLE AS BEFORE. I REPORTED TO DEALER BUT WAS TOLD THAT THAT IS THE WAY ITS SUPPOSE TO DRIVE. PLEASE INVESTIGATE AS MANY OTHERS HAVE HAD THE SAME COMPLAINT AND APPEARS TO BE A REPETITIVE PATTERN AND I AM VERY CONCERNED.   *JS",
        "vin": "4S4BRDLC8E2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680904,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE THAT  CONCERNS ME INVOLVES THE INITIAL HOOD RELEASE THAT IS LOCATED INSIDE THE CAR ALONG THE LEFT SIDE (DRIVER'S SIDE). SPECIFICALLY, ON NUMEROUS, RANDOM OCCASIONS THE TOE OF MY RIGHT FOOT RELEASED THE HOOD AS I AM PIVOTING TO EXIT THE CAR.   A FEW TIMES, I HAVE NOTICED THE HOOD IS SLIGHTLY RELEASED AND I SHUT IT. HOWEVER, MORE OFTEN, I  DIDN'T NOTICE THE HOOD UP SLIGHTLY AND STARTED OFF ON MY TRIP. FOR EXAMPLE IN SEPTEMBER/OCTOBER WE MADE A ROUND TRIP FROM MILFORD, CT TO BRADENTON, FL. AND RECENTLY REPEATED THE TRIP FROM MILFORD.   AT LEAST 6 OR 8 TIMES ALONG I-95 I-10 OR I-75, I NOTICED THE HOOD WAS RELEASED AND I HAD TO PULL OVER TO THE ROAD SIDE FROM A HIGHWAY WHERE THE SPEED LIMIT RANGES FROM 50-70 MPH.  AS I AM SURE YOU KNOW, THERE IS A SECONDARY HOOD RELEASE THAT HAS TO BE MANUALLY RELEASED FROM THE FRONT OF THE CAR. HOWEVER, SHOULD THAT SECONDARY RELEASE FAIL, THE HOOD WOULD BLOW OPEN WHILE WE WERE IN MOTION AND EITHER BLIND OUR VISION OR BLOW OFF TO ONLY GOD KNOWS WHERE.  I HAVE CALLED THIS MATTER TO THE ATTENTION OF PREMIER SUBARU IN BRANFORD, CT AND ASKED THAT THEY INFORM SUBARU. I HAVEN'T HEARD FROM EITHER COMPANY.  *TR",
        "vin": "4S4BRBLC9E3"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2015",
        "dateOfIncident": "11/16/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669957,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPS WITHOUT WARNING.  A CLICKING SOUND IS HEARD AND THEN THE FRONT DISPLAY PANELS BECOME BLANK.  THERE IS NO STEERING OR BRAKES.  THIS HAS HAPPENED 10 TIMES.  THERE IS NO WAY TO PREDICT WHEN THIS MIGHT HAPPEN AND THERE IS NO PRECIPITATING FACTORS.  HAVE HAD THE CAR TO THE DEALERSHIP TWICE, BUT THE PROBLEM CANNOT BE FOUND AND AM STILL DRIVING THIS UNSAFE CAR.  *TR",
        "vin": "4S4BRCEC2E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2014",
        "dateOfIncident": "12/24/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668476,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW CAR AND ENGINE BURNING OIL ISSUE:  SUBARU OF GEORGETOWN, TX, DEALER TOLD ME THAT I DID NOT HAVE TO CHANGE THE OIL UNTIL I REACHED 7500 MILES ON MY BRAND NEW 2014 SUBARU OUTBACK. AT 4900 MILES, OIL PRESSURE AND LOW OIL LIGHTS CAME ON BRIEFLY, THEN TURNED OFF 30 MILES LATER. I DIDN'T CHECK THE LEVEL SINCE THE  LIGHTS TURNED OFF. THEN 50 MILES LATER, BOTH TURNED ON AGAIN. I CHECKED THE DIPSTICK, AND THERE WAS APPROX. 1MM OF OIL REGISTERING ON THE BOTTOM OF THE DIPSTICK. THE SUBARU OF BATON ROUGE, LA DEALER TOLD ME THIS WAS NORMAL AND CHANGED THE OIL AT 5400 MILES.  *TR",
        "vin": "4S4BRCCC9E1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/16/2014",
        "dateOfIncident": "12/13/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664538,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTERING A MAIN STATE HIGHWAY FROM A RURAL ROAD I PRESSED DOWN ON THE ACCELERATOR RESULTING IN NO RESPONSE  PLACING MYSELF IN JEOPARDY  FOR A A COLLISION FROM RAPIDLY APPROACHING CARS BEHIND ME    THIS INTERMITTENT STALLING PROBLEM ALSO OCCURRED PREVIOUSLY AT SLOW SPEEDS UPON EXITING  A SHOPPING MALL ON TO A BUSY LOCAL HIGHWAY. *TR",
        "vin": "4S4BRBLC4E3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/15/2014",
        "dateOfIncident": "10/23/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655156,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DATE COMPLAINT FILED: 10/18/2014    COMPONENT(S): STEERING   DATE OF INCIDENT: 10/17/2014  NHTSA ID NUMBER: 10648531    DEAR NHTSA    CONCERNING ODI COMPLAINT NUMBER 10648531. THIS ISSUE HAS BEEN RESOLVED. AFTER FILING THE COMPLAINT I TOOK THE CAR TO THE DEALERSHIP ON 10/23/2014. THEY TEST DROVE THE CAR AND PERFORMED A 4 WHEEL ALIGNMENT WHICH CORRECTED THE PROBLEM. . SO IF OTHERS ARE EXPERIENCING THE SAME ISSUE OF WANDERING, ALIGNMENT MAY BE IN NEED OF ADJUSTMENT FOR THEIR VEHICLE AS WELL.    *TR",
        "vin": "4S4BRBCCXE3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654170,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE INCIDENTS OF LAG WHEN DRIVING SLOWLY INTO CROSS TRAFFIC OR FROM A DEAD STOP THAT SOMETIMES LAST UP TO SEVERAL SECONDS THAT HAS RESULTED IN SOME VERY CLOSE CALLS IN HEAVY TRAFFIC. THE WORST TIMES HAVE BEEN WHILE MAKING A LEFT TURN ACROSS TRAFFIC WHEN YOU ARE CREEPING OUT AND TRY TO ACCELERATE AND NOTHING HAPPENS!     I HAVE CALLED THE DEALER AND TAKEN IT INTO THE DEALER AND THEY TELL ME IT IS A DESIGN FLAW IN THEIR CVT TRANSMISSION AND THAT THERE IS NO FIX AT PRESENT. THEY DID SOME UPDATES TO THE CARS COMPUTER AND THOUGHT THAT MIGHT HELP BUT ON A TRIP IN ST. GEORGE UT A FEW DAYS LATER WE WERE ALMOST IN AN ACCIDENT MERGING RIGHT INTO HEAVY TRAFFIC WHEN WE WERE LEFT SITTING IN THE MIDDLE OF THE STREET FOR SEVERAL SECONDS BEFORE THE CAR WOULD MOVE. THE SERVICE WRITER SAID HIS 20013 LEGACY DOES THE SAME THING AND THIS IS A COMMON COMPLAINT.  I HAVE RESEARCHED THIS ON LINE AND CAN'T FIND ANYTHING ABOUT IT, WHY?     THIS IS A VERY DANGEROUS PROBLEM, WE PURCHASED THIS CAR WITH THE EYESIGHT  ACCIDENT PREVENTION SYSTEM BECAUSE WE WANTED ALL THE SAFETY FEATURES IT HAS, NOW WERE TOLD THAT IT'S NORMAL TO LEAVE YOU HANGING IN TRAFFIC WAITING FOR THE CAR TO RESPOND?  *TR",
        "vin": "4S4BRBPC2E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/26/2014",
        "dateOfIncident": "07/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650088,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WITH CRUISE CONTROL (CC) ENGAGED ON ROLLING TERRAIN, THE VEHICLE SPEEDS UP ON A DOWNHILL SLOPE UNTIL BRAKES ARE APPLIED (BY CC), THEN AT BOTTOM OF HILL PICKUP IS SLUGGISH AND SPEED FALLS OFF 2-3 MPH BELOW SET POINT. THEN THE POWER COMES ON LATE AND HARD, AND THE VEHICLE GOES OVER THE CREST OF THE HILL ACCELERATING AT PEAK POWER LEVEL, 2-3 MPH ABOVE SET POINT.  AN ASSOCIATED ISSUE, OBSERVED SINCE THE CAR WAS NEW, IS THAT WHEN CLIMBING A UNIFORM 3-4% GRADE AT HIGHWAY SPEEDS, THE ENGINE RPM CYCLES CONSTANTLY OVER A RANGE OF 800-1000 RPM AT A FREQUENCY AROUND 4 CYCLES/MINUTE. THIS IS ANNOYING TO THE DRIVER AND PASSENGERS, AND INCREASES THE STRESS LEVEL ON THE DRIVER. WE HAVE HAD THE VEHICLE BACK TO THE DEALER THREE TIMES, AND A FACTORY REP HAS EVALUATED IT, THE RESPONSE WE GET IS THAT THE VEHICLE IS OPERATING WITHIN SPECIFICATIONS, AND NO ACTION WILL BE TAKEN, NOR WILL ANY ADJUSTMENTS BE MADE.  *TR",
        "vin": "JF1SG65664G"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/18/2014",
        "dateOfIncident": "10/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648531,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING NEEDS CONSTANT CORRECTION, IF THE CAR DRIFTS TO THE RIGHT AND YOU CORRECT BY SLIGHTLY TURNING LEFT IT WILL OVER CORRECT & DRIFT TO THE LEFT FORCING THE DRIVER TO CORRECT BY SLIGHTLY TURNING RIGHT, WHICH IS THE CONSTANT CYCLE WHILE DRIVING THIS VEHICLE. IT WILL NOT TRACK STRAIGHT DOWN THE ROAD. THIS IS DANGEROUS AS IT CAUSES THE VEHICLE TO WEAVE BACK & FORTH IN THE LANE. YOU CAN NOT GET THE CAR TO TRACK STRAIGHT, IT IS ALWAYS EITHER PULLING RIGHT OR PULLING LEFT. THE DRIFTING IS NOT DRASTIC BUT IT IS CONSTANT. I HAVE OWNED MANY CARS AND TRUCKS INCLUDING 4 WD, THIS IS NOT NORMAL. I AM FILING THIS COMPLAINT IN ORDER TO HEIGHTEN AWARENESS OF THIS HAZARDOUS CONDITION WHICH IS COMPOUNDED BY THE FACT THAT IT CAUSES DRIVER FATIGUE, LESSENING THE DRIVER'S ABILITY TO REACT TO THE VEHICLES CONSTANT NEED FOR STEERING CORRECTION.   THE CONSUMER STATED THE ISSUE WAS RESOLVED. THE DEALER PERFORMED A FOUR WHEEL ALIGNMENT. UPDATED 12/02/14*JB",
        "vin": "4S4BRBCCXE3"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2014",
        "dateOfIncident": "10/04/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644957,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DOES NOT STAY ON.  STARTED THE CAR BY TURNING THE KEY TO THE \"START\" POSITION FROM THE \"ON\" POSITION.  THE CAR STARTS BUT ONCE THE KEY MOVES BACK TO \"ON\", THE CAR STOPS.  THIS IS THE SECOND TIME I'VE BEEN STRANDED BY THIS OCCURRENCE.  AFTER 20-30MINS, THE CAR STARTS AGAIN.  BOTH INCIDENTS OCCURRED WHEN IT WAS RELATIVELY HOT (+85 DEGREES F).  SEEMS TO BE AN IGNITION ISSUE.  *TR",
        "vin": "4S4BRBLCXE3"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/09/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643635,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A HESITATION WHEN ACCELERATING, IT HAPPENS FROM COMPLETE STOPS BY STEPPING ON THE GAS, AND WHILE TURNING YOUR VEHICLE. I WAS ON A 35MPH. BACK ROAD AND WENT TO TURN LEFT ONTO A SIDE STREET, I YIELDED FOR 2 CARS AND THEN WENT INTO THE TURN AND STEPPED ON THE GAS, IT HESITATED AND THEN I WAS HIT IN THE REAR SIDE OF MY VEHICLE. IF IT WOULD HAVE RESPONDED CORRECTLY I WOULD NOT HAVE GOTTEN INTO THE ACCIDENT.   *TR",
        "vin": "4S4BRBMC9E3"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630053,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH A PASSENGER IN THE FRONT SEAT AND THE SEAT BELT FASTENED, THE SEAT BELT WARNING CHIME AND LIGHT ACTIVATED AND THE PASSENGER AIR BAG WAS DEACTIVATED.  IN A LATER INCIDENT, THE PASSENGER MOVED TO THE BACK SEAT AND THE SEAT BELT WARNING CHIME AND LIGHT CONTINUED TO BE ACTIVATED WITH NO ONE IN THE PASSENGER SEAT (BUCKLING OR UNBUCKLING THE SEAT BELT MADE NO DIFFERENCE.  *TR",
        "vin": "4S4BRDMC5E2"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2014",
        "dateOfIncident": "08/31/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629818,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT APPROXIMATELY 20MPH, THE CAR SUDDENLY BEGINS TO SMELL OF GASOLINE. SOON THEREAFTER, ACCELERATION BECOMES HESITANT AND THE LOW-FUEL WARNING LIGHT ILLUMINATES. THE VEHICLE QUICKLY BECAME INOPERABLE IN THE MIDDLE OF A BUSY ROAD. THE VEHICLE IS A MODEL YEAR 2014 AND WAS PURCHASED BRAND NEW, LESS THAN SEVEN [7] MONTHS AGO (FROM THE DATE THIS COMPLAINT WAS POSTED). THE VEHICLE HAS ONLY APPROXIMATELY 9,000 MILES ON THE ODOMETER AND HAS NOT BEEN DRIVEN UNDER ANY ESPECIALLY SEVERE WEATHER CONDITIONS OR THROUGH TREACHEROUS TERRAIN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/16/2014",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622659,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU OUTBACK WAS STARTED IN A PARKING LOT IN ORDER TO COOL INTERIOR DOWN. DRIVER EXITED VEHICLE AND WALKED BEHIND AND AROUND TO OTHER SIDE. DRIVE OPENED FRONT PASSENGER DOOR RETRIEVED AN ITEM AND CLOSED DOOR. DRIVER THEN WALKED AWAY A FEW YARDS IN ORDER TO PROVIDE WATER FOR A DOG. DRIVER HEARD A LOUD CRASH AND TURNED AROUND TO FIND CAR HAD ROLLED BACKWARDS OUT OF PARKING SPOT AND HIT A VEHICLE PARKED BEHIND IT. CAR WAS STILL RUNNING AND FOUND TO BE IN REVERSE. NO ONE WAS IN EITHER CAR AND NO INJURIES. BOTH CARS WERE DAMAGED. SUBARU OUTBACK COULD NOT BE DRIVEN. CAR WAS PARKED ON A VERY SLIGHT INCLINE.  *TR",
        "vin": "4S4BRBKC1E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "04/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619362,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2014 SUBURU OUTBACK.  THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS, WHEN THE BRAKE PEDAL WAS DEPRESSED, THE PEDAL GOES ALL THE WAY DOWN TO THE FLOOR.  THE VEHICLE WAS TAKEN TO THE DEALER FOR A DIAGNOSTIC TEST AND THE MECHANIC STATED THAT THE BRAKE PEDAL WAS NORMAL AND WERE UNABLE TO LOCATE A PROBLEM.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE APPROXIMATE FAILURE MILEAGE WAS 1,600.",
        "vin": "4S4BRBAC4E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615451,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2014 OUTBACK 2.5 LIMITED AND HAVE BEEN HAVING STEERING ISSUES. THE CAR CONSTANTLY PULLS TO THE RIGHT AND LEFT THE STEERING IS VERY STIFF AND HEAVY. THIS CAR IS EXHAUSTING AND UNSAFE TO DRIVE!  *TR",
        "vin": "4S4BRBLC8E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2014",
        "dateOfIncident": "07/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611107,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ZERO OIL PRESSURE (RED) INDICATOR LIGHT ILLUMINATED AT SAFE AND PRUDENT OPERATING SPEED.  LOW OIL INDICATOR LIGHT (YELLOW) NEVER ILLUMINATED.    LIGHT REMAINED ON FOR THREE MILES, ONE AT SPEED 55 MPH TO ZERO AND TWO AT 20 MPH.  THEN WENT OUT.    INSPECTION OF OIL LEVEL SHOWED LEVEL APPROXIMATELY ONE CENTIMETER ABOVE LOW LEVEL MARKER ON DIPSTICK.   ADDITION OF .5 QUART US RAISES LEVEL TO APPROXIMATELY ONE CENTIMETER BELOW FULL LEVEL MARKER ON DIPSTICK.    VEHICLE RETURNED TO DEALERSHIP; HAD FULL OIL SERVICE PERFORMED 2,500 MILES AHEAD OF SCHEDULED SERVICE.    DEALERSHIP CLAIMS \"SENSOR RESISTANCE IS HIGH, WILL R&R.\"  DEALER FAILED TO PROVIDE EMPIRICAL OIL PRESSURE PSI READING DESPITE REQUEST.   PART REPLACEMENT YET TO BE DONE.  *TR",
        "vin": "4S4BRCCC8E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "12/28/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610814,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY SUBARU OUTBACK 2014 3.6R LIMITED IN MID DECEMBER 2013, I FELT THAT THE CAR PULLS TO THE RIGHT AFTER I DROVE THE CAR TO HOME, I CANNOT BELIEVE THERE IS ANY PROBLEM WITH A NEW CAR, WITH THAT I KEPT TO DRIVE AND MONITOR IT FOR 2 WEEKS THEN I CONFIRMED THIS IS REALLY AN ISSUE AND IT'S VERY EASY TO REPRODUCE. SO I BROUGHT THE CAR TO MY DEALER, THE TECHNICIAN SPENT HALF A DAY TO FIX, ROTATED TIRE, CHECKED PRESSURE AND CHECKED ALIGNMENT, FINALLY THEY REPLACED 4 BRAND NEW TIRES THEN THEY STATED THAT THE ORIGINAL TIRE IS NOT GOOD, THE PROBLEM WAS FIXED BY REPLACING NEW TIRES AND LET ME DROVE THE CAR BACK.  AFTER MORE THAN 3000 MILES DRIVING, THE SAME PROBLEM IS GETTING WORSE AGAIN, SO I WENT TO DEALER AND THEY CONFIRMED THIS IS REPRODUCIBLE, IT'S FUNNY THAT THEY REPLACED 4 NEW TIRES INCLUDING WHEEL HUB THIS TIME AGAIN, HOWEVER THIS ISSUE IS STILL NOT BEEN FIXED, THE TECHNICIAN CALLED SUBARU SERVICE REPRESENTATIVE, REPRESENTATIVE SUGGESTED TO LOOSE THE CAP OF SUSPENSION , BOUNCE THE CAR MULTIPLE TIMES THEN INSTALL THEM BACK, TECHNICIAN REPEATED THIS PROCEDURE FOR AT LEAST 2 TIMES, FINALLY THEN MENTIONED THE ALIGNMENT IS WITHIN SPEC, SERVICE ADVISE TOLD ME THE ISSUE IS BEEN FIXED.  I DROVE THE CAR FOR 2 WEEKS NOW, I'M STILL FEELING THERE IS SLIGHT PULLING TO RIGHT, AND THE STEERING WHEEL IS KEEPING TURN TO RIGHT BUT NOT BACK TO CENTER. I MAKE AN APPOINTMENT WITH MY DEALER TODAY, TECHNICIAN LEAD TESTED THE CAR WITH ME, HE WAS ABLE TO REPRODUCE THE PROBLEM I REPORTED, BUT HE SAID THIS IS NORMAL FOR SUBARU OUTBACK, AND LET ME CALL CUSTOMER SERVICE FOR FURTHER CHECKING. THIS IS SO BAD, I DROVE SO MANY CARS BEFORE BUT NEVER GOT THE SAME ISSUE, AND THIS IS NOT SAFE IF THE CAR CANNOT GO STRAIGHT.  *TR",
        "vin": "4S4BRDLC9E2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "06/02/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607646,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON INSPECTING THE TRAILER HITCH AND WIRING LOOM THAT THE RENO, NV, SUBARU DEALER INSTALLED FROM THEIR INVENTORY, THE WIRING LOOM AND CONNECTOR WHICH CONNECTS TO A TRAILER'S LOOM WAS FOUND TO BE HANGING FREELY IN THE WIND.  THE TRAILER'S LOOM RUNS BOTH BRAKE LIGHTS AND TAIL LIGHTS.  THE LOOM WAS ATTACHED TO THE TRAILER HITCH WITH A SINGLE PLASTIC WIRING TIE WHICH WENT THRU THE WHOLE IN THE TRAILER HITCH INTENDED FOR THE ATTACHMENT OF THE TRAILER'S SAFETY CHAINS.  THE PLASTIC TIE USED WAS OF THE TYPE NORMALLY USED TO HOLD A GROUP OF WIRES TOGETHER.  UPON ATTACHING THE SAFETY CHAINS, THE PLASTIC TIE WHICH SUPPORTED THE WIRING LOOM, CAME IN CONTACT WITH THE METAL SAFETY CHAIN HOOK.  NOWHERE ON THE HITCH WAS THERE ANY METAL BRACKET TO ATTACH THE WIRING LOOM PLUG TO PREVENT THE LOOM FROM SWINGING IN THE BREEZE.   IF THE PLASTIC TIE WERE TO BREAK OR BE WORN THRU BY ABRASION OF THE SAFETY CHAIN HOOK THE WIRING LOOM WOULD DRAG OF THE GROUND AND THE BRAKE AND TAIL LIGHTS ON THE TRAILER WOULD NO LONGER FUNCTION.  THE PLASTIC TIE WHICH WAS THE ONLY SUPPORT FOR THE WIRING LOOM AND COULD NOT BE EXPECTED TO WITHSTAND THE ENVIRONMENT CONDITIONS IT WOULD BE SUBJECTED TO LIKE; WIND, RAIN, SNOW, MUD, NOR COULD IT WITHSTAND CONSTANT ABRASION FROM THE SAFETY CHAIN HOOK.   THE WIRING LOOM WAS ATTACHED TO THE SAFETY CHAIN BRACKET HOLE 3 OR 4 INCHES FROM THE PLUG WHICH TERMINATED THE LOOM.   THIS CREATED A PINCH POINT IN THE WIRING LOOM WHERE IT WAS ATTACHED TO THE SAFETY CHAIN BRACKET.  AS THE LOOM WOULD SWING IN THE WIND, THE COPPER WIRES  WOULD BE CAUSED TO BEND AT THE PINCH POINT AND BREAK.  NORMALLY, A PINCH POINT IS AVOIDED BY FIRMLY ATTACHING THE PLUG AT THE END OF THE WIRING LOOM.  THE DEFECTS MENTIONED ABOVE WILL CERTAINLY CAUSE UNEXPECTED BRAKE LIGHT AND TAIL LIGHT FAILURE.  THIS PRODUCT SHOULD BE RECALLED.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604884,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING SYSTEM FAILED. WHEN CAR STOPPED, THE STEERING CAN NOT TURN. THE DEALERSHIP REPLACED A NEW ONE, BUT THE  STEERING IS STILL TOO HARD TO TURN AND FEEL EXHAUSTING TO DRIVE. AND THE DEALER SAID IT IS NORMAL.   *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/06/2014",
        "dateOfIncident": "06/05/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596742,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT STATED THAT WHILE TRAVELING 40 MPH, THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD. THE BRAKE PEDAL REQUIRED SEVERAL PUMPS IN ORDER TO STOP THE VEHICLE ON A HILL.  THE FAILURE OCCURRED ON MANY OCCASIONS.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE.  THE FAILURE AND CURRENT MILEAGE WAS 1,666.   UPDATED 08/11/14*LJ    UPDATED 8/30/2017*CN",
        "vin": "4S4BRBAC4E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "05/29/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594922,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN UPDATE:    DEALER CALLED US TO HAVE [XXX]  DRIVE THE CAR WITH A SERVICE TECHNICIAN PRESENT ( TECH NAMED [XXX]) CAR WAS DRIVEN APROX 5-6 MILES WITHOUT INCIDENT ...SYSTEM DID NOT FAULT.  DEALER TOLD US THEY HAVE BEEN ON THE PHONE WITH SUBARU TECH CENTER & COMPLETED ALL THE TEST PROCEDURES BUT HAVE NOT BEEN ABLE TO DUPLICATE ANY OF THE  BRAKE-CHECK/ ENGINE FAULTS EXPERIENCED 3 ON 5/22 OR 1 ON  5/23/2014.    [XXX]  SERVICE COORDINATOR IS NOT CERTAIN WHAT ELSE CAN BE DONE AT THE DEALERSHIP. WE ASKED IF THE VEHICLE WAS SAFE ONCE THE SYSTEM FAULTED & THE ELECTRONIC STABILIZATION & TRACTION CONTROL SYSTEM ARE SHUT DOWN ( AS A RESULT OF THE FAULT). I ASKED THEM NOT TO GUESS WHEN THEY ANSWERED THIS QUESTION.  DEALERSHIP HAS DECIDED TO KEEP THE CAR AN ADDITIONAL DAY FOR ADDITIONAL TESTING. THEY ARE TRYING TO GET THE SYSTEM TO FAULT WHILE UNDER TEST PROCEDURE.    THE DEALERSHIP APPEARS TO HAVE EXHAUSTED ALL THE STANDARD PROCEDURES TO DETERMINE  ROOT CAUSE. IT SEEMS  SUBARU FACTORY MUST GET INVOLVED WITH THIS VEHICLE BEYOND THE DEALERSHIP TELEPHONE CALLS. OUR CONCERN IS A VEHICLE WILL BE RETURNED TO US IN AN CONDITION WHICH MAY PROVE TO BE UNSAFE...SINCE THEY HAVE DONE ALL THEY CAN ON THE TELEPHONE.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4S4BRCMC9E3"
    },
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/28/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594708,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR OUTBACK ON APRIL 28,2014. ON MAY 1, 2014 WE BROUGHT INTO THE SERVICE DEPARTMENT BECAUSE IT WAS PULLING TO THE RIGHT. THEY APPARENTLY FIXED IT. THE NEXT DAY I WAD BACK AGAIN, THE CAR WAS STILL PULLING TO THE RIGHT. AFTER SEVERAL TIMES TRYING TO REALIGN THE CAR, IT WAS \"FIXED\". I HAD TO BRING IT BACK IN TODAY, IT IS PULLING AGAIN. THEY CAN'T FIX THE ISSUE BECAUSE NOW THEY SUSPECT IT IS A DEFECTIVE TIRE ISSUE. THEY ARE GOING TO REPLACE ALL 4 TIRES ON TUESDAY. I GET THE FEELING THERE IS SOMETHING MORE WRONG WITH MY CAR.  *TR",
        "vin": "4S4BRBLCXE3"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593593,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC PARKING BRAKE ENGAGES WHILE THE VEHICLE IS UNDERWAY. WHEN THE FAULT IS CLEARED AND DRIVING RESUMES THE ELECTRONIC PARKING BRAKE AGAIN ENGAGES.    THE MFG ( SUBARU) PROVIDES A SMALL TOOL & INSTRUCTIONS HOW TO CRAWL UNDER THE CAR, USE THE TOOL TO MECHANICALLY RELEASE THE ELECTRIC PARKING BRAKE. IF A TOOL IS PROVIDED ALONG WITH INSTRUCTIONS IN THE OWNER MANUAL HOW TO RELEASE A FAULTY ELECTRONIC PARKING BRAKE ( WHICH MAY ENGAGE WHILE THE VEHICLE IS UNDER WAY ) THIS IS A CLEAR WARNING OF A POSSIBLE UNSAFE OPERATING CONDITION.    THE CAR HAD TO BE TOWED TO THE DEALERSHIP FOR REPAIR. THE DEALERSHIP TELLS US ( THIS PARKING BRAKE PROBLEM HAS NEVER HAPPENED) THE TOW TRUCK OPERATOR TELLS US TOWING VEHICLES TO DEALERSHIPS BECAUSE OF FAULTY ELECTRONIC PARKING BRAKES IS A MAJOR PART OF HIS BUSINESS.  *TR",
        "vin": "4S4BRCMC9E3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593711,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND INCIDENT WHERE THE ELECTRIC PARKING BRAKE LIGHT INDICATES THE BRAKE HAS BEEN SET & NOT RELEASED.  THE CAR WAS TOWED INTO DEALERSHIP YESTERDAY (5/22/2014) FOR SAME REASON. DEALER STATED THEY SPOKE WITH SUBARU  & WERE UNABLE TO FIND ANY REASON FOR THE FAULT. THEY STATED COMPUTER INDICATED THE BRAKES WERE NOT ENGAGED BUT THAT THIS SAME SYSTEM DOES DISABLE THE ELECTRONIC STABILITY CONTROL WHEN THIS FAULT OCCURS.     WE ARE VERY CONCERNED THE VEHICLE IS SAFE TO DRIVE DESPITE THE ASSURANCES OF THE SERVICE MANAGER ( [XXX]) THAT THE VEHICLE IS SAFE (NO WORRIES).    THE INSTRUMENT LIGHT ON THE PANEL ALSO FLASHES \"CHECK ENGINE LIGHT AT THE SAME TIME LIGHT FLASHES INDICATING PARKING BRAKE HAS BEEN SET & NOT RELEASED.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4S4BRCMC9E3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/24/2014",
        "dateOfIncident": "04/13/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584654,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD POPPED AND CRACKED ACROSS THE BOTTOM FROM THE HEAT OF THE DEFROST FUNCTION.  *TR",
        "vin": "4S4BRCCC1E3"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2014",
        "dateOfIncident": "03/16/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572771,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN TANK ELECTRIC FUEL PUMP CONTINUED RUNNING AFTER CAR WAS SHUT OFF AND KEY WAS REMOVED.  *TR",
        "vin": "4S4BRBNC7E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2014",
        "dateOfIncident": "12/04/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572488,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LAG OF APPROX. 2 SECONDS LENGTH WHEN SHIFTING OUT OF REVERSE AND INTO DRIVE.  THE DRIVER CANNOT MOVE THE CAR DURING THIS LAG (IN FACT, THE CAR WILL ROLL BACKWARDS IF ON A HILL).  I HAVE TAKEN THE CAR TO THE SUBARU DEALER 3 TIMES, & SENT A COMPLAINT TO SUBARU OF AMERICA, AND EACH TIME THE RESPONSE IS \"CVT TRANSMISSION OPERATES AS DESIGNED\".  I CONSIDER THIS A SAFETY HAZARD, AND AM CONCERNED ABOUT DRIVING THE CAR IN CITY TRAFFIC, PARKING, ETC.  WHEN I SHIFT INTO DRIVE, I EXPECT THE CAR TO MOVE.",
        "vin": "4S4BRCLC2E3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "03/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568903,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW CAR. OK FIRST 200 MILES. THEN; STOPPED FOR RED LIGHT, ON GREEN PRESSED ACCELERATOR ( CONFIRMED BY VISUAL OBSERVATION, FOOT AND ACCEL. TO FLOOR ). HELD FOR 10 TO 15 SECONDS, WITH MUCH HONKING, THEN POWER RESUMED, AND I FINISHED LEFT TURN. NO WARNING LIGHTS ON DURING EPISODE, STEERING, BRAKES, AND AIR BAGS OK.  SIX MORE EPISODES DURING NEXT THREE DAYS. HAD CAR DELIVERED TO MILLER SUBARU, BOISE. ELECTRONIC CHECK, TEST DRIVE, AND MY SUBSEQUENT DRIVING, COULD DETECT NO PROBLEM. DRIVE WITH CAUTION, READY TO FLIP EMERGENCY FLASHERS AND PULL OVER WITH RECURRENCE, WHICH I EXPECT AT SOME TIME. HAPPENS IN DRIVE OR MANUAL MODES. PADDLE SHIFT MAKES NO DIFFERENCE.   *TR",
        "vin": "4S4BRBCC3E3"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/17/2014",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560426,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU OUTBACK. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE SUDDENLY DECELERATED. THE CONTACT HAD TO PUMP THE ACCELERATOR PEDAL SEVERAL TIMES BEFORE THE VEHICLE WOULD RESPOND AND DRIVE NORMALLY. THE CONTACT ALSO STATED THAT WHILE AT A STOP LIGHT, THE VEHICLE STALLED AS THE CONTACT PROCEEDED THROUGH A BUSY INTERSECTION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 5000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/13/2013",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552064,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED MY OUTBACK ON NOV 1 2013 AND HAVE BEEN HAVING A STEERING LANE CENTERING ISSUE SINCE DAY ONE. THE CAR WILL NOT DRIVE IN A STRAIGHT LINE WITHOUT MAJOR INTERVENTION BY CONSTANT CORRECTION. THE CAR WILL GO LEFT OR RIGHT, BUT WILL NEVER GO STRAIGHT. IF I CHECK MY MIRRORS AND BLIND SPOT FOR A LANE CHANGE BY THE TIME I LOOK BACK MY CAR HAS DRIFTED OUT OF LANE OR NEARLY OUT OF LANE. I AM NOT SURE WHAT IS MORE DANGEROUS AT THIS POINT CHECKING MY BLIND SPOT OR NOT CHECKING MY BLIND SPOT, SINCE EITHER CAN LEAD TO AN ACCIDENT. I DRIVE BETWEEN 25K-50K MILES A YEAR, AND HAVE NEVER EXPERIENCED A PROBLEM LIKE THIS. HOWEVER, THE DEALER TELLS ME THIS IS NORMAL AND WAS DESIGNED BY SUBARU TO DUE THIS. I CAN'T SEE HOW THIS IS POSSIBLE. I CHECKED WITH A FEW OTHER  FLEET OUTBACK DRIVERS WITHIN THE COMPANY, AND ALL OF THEM HAVE THIS SAME ISSUE. (FOUR) HOWEVER, NOT ALL THEIR LOCAL DEALERS SAY IT WAS DESIGNED TO DO IT, BUT SAY THERE IS NO FIX TO THE PROBLEM. I AM NERVOUS THAT I AM GOING TO LOOK LIKE A DRUNK DRIVER TO SOMEONE BECAUSE I AM CONSISTENTLY SWERVING, OR THIS ISSUE CAUSES A ACCIDENT. I HAVE FOUR KIDS AND I CAN'T RISK HAVING AN ACCIDENT. I AM REALLY NOT LOOKING FORWARD TO WINTER THIS YEAR WITH THIS PROBLEM.  I AM REPORTING THIS IN HOPES THAT THIS PROBLEM IS  ADDRESSED BEFORE SOMEONE DIES, IF THEY HAVEN'T ALREADY.  *TR",
        "vin": "4S4BRCCC5E3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/01/2013",
        "dateOfIncident": "10/28/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550472,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECENTLY PURCHASED A NEW 2014 OUTBACK.  I PURCHASED THE VEHICLE AND I NOTICED THE STEERING FELT A BIT \"OFF\" UPON DRIVING IT HOME BUT WAS CERTAIN IT WAS JUST AN ALIGNMENT ISSUE.  TOOK IT TO THE DEALER, WHO CORRECTED THE ALIGNMENT.  THE CAR STILL FELT OFF.  I NOTICE THAT THE WHEEL RETURNS TO CENTER WHEN TURNING LEFT, BUT THE WHEEL WILL NOT RETURN TO CENTER WHEN TURNING RIGHT.  IT WILL MOSTLY CENTER, BUT THE WHEEL REMAINS OFF BY ABOUT 15-DEGREES.  THIS CAN CAUSE AN ACCIDENT AS THE CAR WILL NOT POINT/TRACK STRAIGHT AFTER A TURN.  ALSO, IT KEEPS TURNING ANY TIME YOU SLIGHTLY TURN THE WHEEL TO THE RIGHT, BUT NOT THE LEFT.  SO, YOU CAN BE DRIVING ON THE HIGHWAY AND BUMP THE STEERING WHEEL AND IT WILL CONTINUE TO GO RIGHT AND DRIVE OFF THE ROAD.  THIS IS NOT SAFE!  *TR",
        "vin": "4S4BRCDC9E3"
    }
]