[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458048,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Subaru Impreza. The contact stated while the vehicle was parked, the driver’s side air bag exploded without warning or impact. The vehicle was towed to the dealer. The vehicle was not repaired. The manufacturer was informed of the failure but offered no assistance. The failure mileage was 105,000.",
        "vin": "jf1gjaa66eh"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455786,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "While under warranty, took my vehicle to a subaru dealership as I was having problems with the check engine light coming up and having no power. I was told they couldn’t replicate the problem. I drove home and on my way home my motor failed and wouldn’t start.",
        "vin": "JF1GV7E62EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/20/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453117,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I was starting to reverse out of a parking spot in an underground parking lot. (It was about 10 am). The car accelerated and went backwards at top speed into a wall and door that led to elevators. It happened very suddenly. I did not have time to brake before impact. The car was still running after impact and I had to switch off the ignition to stop the engine running.   The airbags did not deploy. A police report was not filed. I had ringing in my ears afterwards, was having difficulty focusing my thoughts. Pain in the tendons of my neck lasted a few days. I only realized later that I probably had a concussion from whiplash. My son was sitting in the back seat, and my daughter was standing nearby outside the car, but thank goodness, neither were injured. Fortunately no one was coming through the door into which the car crashed.   The car was drivable despite the severe damage to the rear end. I drove it up to street level, where it was towed from to a body shop. The following week it was declared a total loss, and sent to salvage. I have not yet reported this to the manufacturer. It was only while I doing research to get a new car, that I stumbled upon the issue of subaru imprezas suddenly accelerating on their own. Now everything makes sense, although it doesn't lessen the trauma that we all experienced. I truly hope this doesn't happen to anyone else.",
        "vin": "JF1GPAA67E8"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "10/24/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438969,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a The contact stated while driving approximately 10 mph when the contact was hit by a different vehicle which resulted in the air bags not deploying. The contact sustained a cut on his hand and soreness in his back. The vehicle was towed to a local mechanic where it was awaiting repairs. The manufacturer was informed of failure and was awaiting a response. The failure mileage was approximately 91,543.",
        "vin": "JF1GPAC69E8"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "10/10/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11438971,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Subaru Impreza. The contact stated while driving at 10 MPH, the contact was making a left turn when another vehicle struck the vehicle on the front driver side door which fractured the side mirror and glass on the driver side door. The air bag did not deploy. The contact was injured and sustained a cut on their left hand due to the glass but declined medical treatment at the scene from the ambulance. The contact mentioned that he will be seeking medical assistance in the future. A police report was filed. The vehicle was towed to a towed yard where the insurance provider inspected the vehicle. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was 91,554.",
        "vin": "jf1gpac69e8"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433394,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Not quite sure what specific part or wiring location but it’s somewhere in the electrical system. The car is available for inspection upon request.  Started out with electrical system on not allowing the windows to roll down and the Bluetooth connection malfunctioning to cause a high pitched screech. It is ear piercing and scared me half to death driving down the street with rush hour traffic and almost caused me to crash into someone. It does it at unprompted times and would be afraid to swerve into somebody and cause an accident. Trying to turn it off or turning the volume down makes it louder and the only way I’ve gotten it to stop is to turn off the car. A couple of days later, the power wouldn’t turn off on the media center or cycling through modes (FM/AM radio, Bluetooth, USB, CD) and caused the same high pitched screech.   Now the drivers window does not roll all the way down and slams the window down the door at random times. Followed by the airbag sensor not enabling when an adult is sitting in the passenger seat. This can put passengers at risk if involved in an accident and can’t climb out the windows or the airbags from being deployed.  The car is serviced at the dealership every time maintenance is needed. Dealership maintenance appoint is on Monday September 21st 2021 at the McCurley Dealership in Pasco Washington for other wear and tear maintenance but will ask them to inspect this as well.  There has been no prior messages, symptoms, warning or maintenance lamps before this issue occurred. It started to do this back in the beginning of August 2021",
        "vin": "JF1GPAC67E8"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432549,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine cooling system failed and put myself and my step-daughter at risk while driving on the freeway. When I got off the freeway, the vehicle stalled and I was unable to move the car. I got a tow to move the car. The electrical system was messing up for the windows and the radio, I was unaware of the other parts of the vehicle it was affecting. I just tolerated it for the time being. When my car overheated, The red warning temperature lights came on, the blue warning lamp that tells the temperature, and the tract warning lamp, as well as the check engine lamp. They did not turn on prior to this. I took the vehicle to John Hine Subaru.  The car went from being my most reliable, to this unpredictable incident.",
        "vin": "JF1GPAA68E8"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "08/13/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428911,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I own a 2014 Subaru Impreza WRX which was still under warranty(48xxx miles) I’ve been having issues with my vehicle where at times it shuts off on me whenever I come to a complete stop. I’ve taken it to a Subaru dealership multiple times and they always told me “They couldn’t replicate the problem or didn’t find any issue.” I was on my way back home from work when all of a sudden on the freeway the car completely turned off while driving highway speed. I was able to safely pull over on the highway and tried turning the car back on and the check Engine light was on with a flashing cruise control light, I turned it off and had it towed home. I read the code and it came out to be a P0011 and a P0021. I took it to a Subaru dealership that was close to me and was told they couldn’t find any problem and I insisted they check the car again and they said they did an inspection of the car and there wasn’t any problems. I was on my way to work as I began to accelerate the car stalled I turned the car on thinking I stalled the vehicle but a rattling sound became loudly audible. I checked my oil to see if it was low on oil but the dip stick still showed it had lots of oil. But I believe the engine is damaged. I’m tired of taking it to the dealership and being told there isn’t a problem when there’s in fact a major problem. I read through a lot of forums and bulletins and a lot of people have been having the same issues and I don’t know why there was never a recall to fix the faulty issues these vehicles have which is a horrible engine that is a ticking time bomb. This is a major issue and I believe this needs to be looked into.",
        "vin": "JF1GV7E62EG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/19/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425396,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A pebble hit the windshield while driving on the interstate highway which creating a roughly 12 inch crack starting in the upper passenger-side of the windshield. Within 24 hours, that crack has increased in length, now extending to the middle of the windshield. This has not been assessed by any repair facilities.",
        "vin": "jf1gpal66e8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423479,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this vehicle 06/23/2021. I drove it the first time long distance (Concord NH to Stoughton MA) with a passenger for the first time three days after purchase. The passenger air bag is off light came on and would not register my passenger. It worked on and off the entire ride, starting with it working and then would shut off, on the highway, while my passenger never moved from the seat. I called the dealership and they said they would look at it. They did nothing, they blamed it on the seats having been steam cleaned (that dampness messes with the sensors? as if that's a reasonable reason my airbag won't deploy?) I asked if they checked the connections and they just blanket answered that they'd need to see it with the light on, and that 'i'm sure the technician checked everything'. I'm unsure how to do that other than driving to the dealership with a passenger the next time it happened? Today I drove it, again with a passenger, and it worked only one way on the trip. I pulled over, tried to shut off the car and turn it back on, had my passenger get out and back in the vehicle, nothing would fix the light being on and the airbag indicator saying that the airbag was off. I'm extremely concerned and honestly don't understand why any vehicle would have a sensor that SHUTS OFF the airbag. There is already a recall for this issue in Suburu Foresters, years 2015-2018 I believe. I would also very much like this resolved in my model, it is extremely unsafe and I'd prefer not driving it at all but have no choice right now. I would be happy to have this inspected by someone. The internet suggested loose connections, or a faulty seatbelt, or the sensor itself which is connected to the passengers seat. This component has only been inspected by Ed Reilly Suburu on Manchester St., in Concord NH and they did not fix it. The vehicle only has 52,000 miles on it and is supposed to be one of the safest brands of vehicle to drive.",
        "vin": "JF1GPAC65E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/04/2021",
        "dateOfIncident": "07/04/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423385,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbag notification light sometimes turns to off even when a passenger is in passenger seat. This causes me great concern as if I were in an accident would my passenger be protected? Looks like Subaru issued a recall for the 2012 model but not for the 2014 model. Please help me keep my passenger in the front seat safe and have Subaru fix this known problem.",
        "vin": "jf1gpal63e8"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420972,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2 differt items not sure if interconnected.  Drove out of driveway and 3 blocks away the car was shaking violently and could not go more than 5 miles an hour.  Was able to turn around and pull into driveway and the car died and would not start.  Subarau dealer said it was the Engine Control Module and replaced it for free.  There was a recall done on the 2012 Impreza for same problem and mine is a 2014 with only 35,990 miles.  Should be a recall for this model year also.  This would have been very dangerous if I was on the freeway and I would hate to have it happen to someone else.  A week before the car died I was having problems with my key frequently getting stuck in the ignition when it was in park.  Had to pull the car in and out of parking spaces and play with steering wheel  constantly to release the key.  This was happening a lot.  When the car was at the dealer for the ECM, I also told them about the key getting stuck.  They said the problem was the release switch and replaced the switch guide plate for $564.  I saw on line that this also happened with the 2012 Impreza which were recalled for the keys getting stuck in the ignition but they told me I had to pay since there was no recall.  Apparently this problem is still continuing with the newer models.",
        "vin": "JF1GJAD61EH"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403460,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AIRBAG SHOWS OFF WHEN AN ADULT IS SITTING IN THE PASSENGER SEAT.   THIS HAPPENS AT START UP AND WHILE DRIVING. THERE ARE MANY SUCH PROBLEMS FOR THIS MODEL AND YEAR BEING REPORTED ONLINE.",
        "vin": "JF1GPAL60E9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/30/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394643,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IT IS HAPPENING WHEN I AM DRIVING OR PARKED.  PASSENGER OCCUPANCY NOT BEING DETECTED. WHEN PASSENGER SITS IN THE SEAT, AIR BAG LIGHT WILL COME ON ON THE DASHBOARD AND IT WILL SHOW THAT PASSENGER AIRBAG IS DISABLED, IT'S BEEN LIKE THAT FOR THE PAST 2 YEARS.  .",
        "vin": "JF1GPAA66E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/30/2020",
        "dateOfIncident": "06/08/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385680,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE CONTACTED THE COMPANY ABOUT GETTING THE RECALLED AIRBAGS FIXED AND THEY SAID THAT THEY WOULD CONTACT THE DEALERSHIP IN ORDER TO SET UP AN APPOINTMENT TO GET THEM FIXED AND THEY HAVE NEVER REACHED BACK OUT TO US IN ORDER TO RESOLVE THIS ISSUE.",
        "vin": "JF1GR7E64EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377543,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. THE CONTACT STATED THAT WHILE DRIVING, THE CHECK ENGINE WARNING LIGHT ILLUMINATED AND REMAINED ILLUMINATED. THE CONTACT ALSO STATED THAT THE AIR PUMP INADVERTENTLY ACTIVATED AND DEACTIVATED WHILE DRIVING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND WAS DIAGNOSED WITH A CODE P0410 (SECONDARY AIR INJECTION SYSTEM OR FUEL PUMP SYSTEM) THAT NEEDED REPLACEMENT. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. THE CONTACT STATED THAT A YEAR AGO, BLOOMINGTON SUBARU, 7801 LYNDALE AVE S, BLOOMINGTON, MN 55420, INFORMED HIM THAT THE MASS AIR FLOW SENSOR NEEDED TO BE REPLACED. THE CONTACT STATED THAT HE REPLACED THE MASS AIR FLOW SENSOR BY HIMSELF. THE CONTACT ALSO MENTIONED THAT HIS VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V738000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "JF1GR7E64EG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352554,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER OCCUPANCY SENSOR IS FAULTY AND IT CAUSES THE PASSENGER AIR BAG TO BE DISABLED WHEN A PERSON IS SITTING IN THE SEAT. OFTEN, IF THE PERSON IS SWEATING OR IF ANY PART OF THEIR CLOTHING IS MOIST THE AIR BAG WILL BE DISABLED. I HAD IT FIXED UNDER WARRANTY AND IT NEVER REALLY DID MUCH. THE PROBLEM PERSISTS. SOMETIMES THE PERSON CAN BE TOTALLY DRY AND IT WILL STILL BE DISABLED. THERE WAS A RECALL OF THIS EXACT PROBLEM IN PREVIOUS YEARS AND MODELS, AND IT IS PLAIN TO SEE THAT THE SAME ISSUE EXISTS FOR THE 2014 IMPREZA. JUST HAVE A LOOK AT THE NUMBER OF COMPLAINTS. IT IS CRIMINAL (LITERALLY) THAT A RECALL HAS NOT BEEN ISSUED.",
        "vin": "JF1GPAA61E8"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/16/2020",
        "dateOfIncident": "08/16/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349686,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT COMES ON (RED STICK FIGURE GETTING HIT IN THE FACE WITH WITH AIRBAG) ILLUMINATES IN DASHBOARD AT RANDOM TIMES. PASSENGER AIRBAG IS SWITCHED TO ON WHEN NO ONE IS IN THE SEAT, BUT TURNS OFF WHEN PASSENGER IS PRESENT. THE WEIGHT OF A CELLPHONE CAN TRIGGER PASSENGER AIRBAG TO COME ON WHICH THEY ARE CLAIMING IS NORMAL. WHEN DRIVING ALONE PASSENGER SEATBELT ALARM WILL DING FORCING ME TO KEEP PASSENGER SEATBELT PLUGGED IN MOST OF TIME. IVE TAKEN THE CAR IN MULTIPLE TIMES TO TWO DIFFERENT SUBARU DEALERSHIP BUT THEY BOTH CLAIM EVERYTHING IS WORKING IN PERFECT ORDER. THE NOTES I USE TO DESCRIBE THIS ISSUE IS ALWAYS DELETED WHEN I ARRIVE AT DEALERSHIP. I DO NOT EVEN WANT TO DRIVE THE VEHICLE AND CANT AFFORD THE DIAGNOSTIC FEES ON TOP OF MISSING DAYS FROM WORK. THE ISSUE HAPPENS WHEN CAR IS PARKED OR DRIVING. A LITTLE RESEARCH SHOWS SUBARU IS AWARE OF THIS ISSUE BUT CONTINUES TO PRETEND NOTHING IS WRONG - THEY INSTEAD OFFER ME TO TRADE IN VEHICLE. I WOULD RATHER DRIVE VEHICLE OFF A CLIFF THAN TO HAVE THEM RESELL VEHICLE TO ANOTHER PERSON WHO WILL END UP GOING THROUGH WHAT I WENT THROUGH SPENDING HUNDREDS OF DOLLARS OR WORSE - AIRBAG NOT DEPLOYING CAUSING INCREASED INJURY OR DEATH.",
        "vin": "JF1GPAA66E9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348865,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. THE CONTACT STATED THAT THE KEY WAS CEASED IN THE IGNITION. THE CONTACT STATED THAT THEY WOULD HAVE TO EXCESSIVELY TURN THE KEY WHEN IN THE IGNITION FOR THE KEY TO BE RELEASED. THE CONTACT CONTACTED THE DEALER (ANCHOR SUBARU - ADDRESS: 949 EDDIE DOWLING HWY, NORTH SMITHFIELD, RI 02896, PHONE: (401) 769-1199) WHO SCHEDULED AN UPCOMING APPOINTMENT HOWEVER, THE VEHICLE HAD NOT BEEN DIAGNOSED NOR REPAIRED AS OF YET. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 74,000.",
        "vin": "JF1GPAC64E8"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348670,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT OCCUPANCY SENSOR CONTINUALLY MALFUNCTIONS AND TURNS OFF THE AIRBAG WHILE A FRONT PASSENGER IS IN PLACE.  THIS IS THE SAME ISSUE FOR WHICH A NHTSA RECALL WAS PLACED ON 2013 SUBARU IMPREZAS, SO THE PROBLEM IS NOT LIMITED TO ONLY THAT ONE MODEL YEAR.  IN FACT, THIS APPEARS TO BE COMMON ACROSS ALL SUBARUS' ELECTROSTATIC CAPACITANCE SENSOR.  THIS RECALL MUST BE EXPANDED FOR THE PROTECTION OF PASSENGERS IN THESE CARS.",
        "vin": "JF1GPAL68EH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343109,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RECALL PART REPLACEMENT DIDN'T FIX MY BRAKE LIGHT ISSUE.  THE BRAKE LIGHTS WERE NOT FUNCTIONING BECAUSE OF A BRAKE LIGHT SWITCH DEFECT.  I TOOK MY VEHICLE TO THE SUBARU DEALER IN GLENDALE, CALIFORNIA FOR PART REPLACEMENT.  THEY SAID THEY REPLACED THE PART BUT THAT THE BRAKE LIGHTS STILL DO. IT WORK AND THAT IT WOULD COST $1000.00 FOR THEM TO FIX THE ELECTRICAL WIRES.",
        "vin": "JF1GPAC6XE9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341566,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A LOS 50.000 KM CAMBIO DE AROS Y RECALENTAMIENTO DE CAJA ...2016  A LOS 150.000 CAMBIO DE AROS , RADIADOR, ETC , 2019  A LOS  170.000 CAMBIO JUNTA MULTIPLE ESCAPE 2020",
        "vin": "JF1SJ9LC5EG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340082,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG WARNING LIGHT IS ON AND THE INDICATOR FOR THE PASSENGER AIR BAG SHOWS IT IS OFF EVEN THOUGH A 200LB PERSON IS IN THE SEAT. IF AIRBAGS ARE REQUIRED THEN SHOULDN'T THEY WORK? THE CAR HAS 60K MILES ON IT AND WE ONLY PUT ON 200 MILES SINCE WE BOUGHT IT. IF WE ARE IN AN ACCIDENT THIS TELLS ME NO AIRBAG DEPLOYMENT FOR THE PASSENGER",
        "vin": "JF1GPAC65E8"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339917,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ACCELERATED ON ITS OWN. WAS ABLE TO PULL CAR OVER QUICKLY AND THROW IT INTO NEUTRAL. IT THEN PRECEDED TO ACCELERATE RADICALLY ON ITS OWN. WHILE THIS WAS  HAPPENING, THE HORN LOST ITS CONNECTION AND I WAS NOT ABLE TO HONK AT THE PERSON IN FRONT OF ME. I AVOIDED A COLLUSION BY PULLING OVER IMMEDIATELY. THIS TOOK PLACE ON A CITY STREET GOING ABOUT 25 MILES AN HOUR DRIVING STRAIGHT.",
        "vin": "JF1GPAU69E8"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/08/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338109,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY CLUTCH AND BREAK SPOT WELDS WEAK. TWO HAVE COMPLETELY SHEARED FROM FIREWALL AND SQUEAK WHEN ENGAGING\\DISENGAGING CLUTCH PETAL. ENTIRE PEDAL ASSEMBLY FLEXES UNDER PRESSURE FROM THE CLUTCH OR BREAK PEDAL PRESS.",
        "vin": "JF1GV7E63EG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337744,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING (ON ANY KIND OF ROAD), A LIGHT INDICATING THE PASSENGER AIRBAG IS OFF WILL ILLUMINATE, EVEN WHEN THERE IS A PASSENGER IN THE SEAT.  THE LIGHT COMES ON INTERMITTENTLY, AND SOMETIMES THE PASSENGER AIRBAG WILL BECOME ACTIVE EVEN WITH NO PASSENGER IN THE SEAT. CHARGING A PHONE OR EVEN PLACING A PHONE IN THE SEAT SEEMS TO MAKE THE ISSUE WORSE.  TAKING IT TO A MECHANIC RESULTED IN FAULT CODE B1650: OCCUPANT CLASSIFICATION SYSTEM MALFUNCTION.  I HAVE SINCE LEARNED THIS EXACT ISSUE WAS THE SOURCE OF A 2012 SUBARU IMPREZA RECALL, BUT NOT FOR THE 2014 MODELS, WHERE THIS ISSUE IS OCCURRING.  THIS IS A MAJOR SAFETY ISSUE FOR 2014 SUBARU IMPREZA MODELS.  FORUM SEARCHING HAS REVEALED SEVERAL HUNDRED OTHER EXAMPLES OF THIS ISSUE, LARGELY IN 2013 AND 2014 MODELS.  THE 2012 RECALL SHOULD BE EXPANDED TO 2013 AND 2014 MODELS, AS THESE MODELS CLEARLY HAVE THE SAME ISSUE AS THE 2012 MODELS.",
        "vin": "JF1GPAC64E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316099,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 30,000 MILES THE PASSENGER SIDE AIRBAG OCCUPANCY SENSOR FAILED. IT DID NOT DETECT A PASSENGER PRESENT DESPITE AN AVERAGE SIZED ADULT BEING IN THE SEAT. THE DEALER REPLACED THE SENSOR. THE SAME THING OCCURRED AT ABOUT 75,000 MILES.",
        "vin": "JF1GPAA61E8"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302850,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START UP EVEN AFTER REPLACING THE BATTERY. THE VEHICLE WAS TOWED TO (CIOCCA SUBARU 4611 HAMILTON BLVD, ALLENTOWN, PA 18103 (610) 395-3745) WHERE IT WAS DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ENGINE CEASED. THE ENGINE WAS DIS ASSEMBLED. THE VEHICLE WAS TOWED TO FAULKNER SUBARU HARRISBURG 3233 PAXTON ST, HARRISBURG, PA 17111 (717) 564-4545), WHERE THE VEHICLE HAD BEEN PREVIOUSLY REPAIRED. THE CONTACT WAS NOTIFIED OF A FRACTURED VALVE SPRING IN CYLINDER NUMBER 3 WHICH CAUSED THE ENGINE TO CEASE AND CAUSED DAMAGE TO THE CYLINDER AND PISTON. THE TECHNICIAN REPLACED THE CYLINDER WITH AN UPDATED CAM CARRIER, VALVE SPRINGS, FRONT COVER WITH UPDATED CAM SHAFT SENSORS DUE TO OIL CONTAMINATION, AND THE SHORT BLOCK ASSEMBLY. THE MANUFACTURER INITIALLY OFFERED TO PAY $5,000 THEN AFTER NEGOTIATIONS STATED THEY OFFERED TO PAY EVERYTHING EXCEPT FOR $600. THE FAILURE MILEAGE WAS 77,794.",
        "vin": "JF1GJAC6XEG"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289189,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR BRAND NEW AND ABOUT SIX MONTHS AFTER OWNING IT MY CHECK ENGINE, HAZARDOUS ROADS AND CRUISE CONTROL LIGHTS CAME ON. THIS HAS CONTINUED TO HAPPEN NUMEROUS TIMES SINCE. I HAVE BEEN TOLD IT'S A SENSOR, MASS AIRFLOW SENSOR. OCV VALVES AND \"MAINTENANCE\" LIGHT. THE PROBLEM HAS NEVER TRULY BEEN RESOLVED AND NO ONE HAS BEEN ABLE TO TELL ME WHAT THE ROOT OF THE PROBLEM IS. THERE HAVE BEEN TIMES WHEN SERVICE WORKERS HAVE JUST CLEARED THE COMPUTER AND SENT ME ON MY WAY.",
        "vin": "JF1GJACG1EH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/29/2019",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282879,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS AN UNEVEN STEERING EFFORT.  THE STEERING IS TIGHTER AND MORE DIFFICULT TO STEER WHEN DRIVING, WHILE TURNING  RIGHT. THE PROBLEM IS GETTING WORSE IN THE TWO YEARS I'VE OWNED THIS CAR.    A SERVICE BULLETIN WAS RELEASED 7/24/18, NUMBER:  04-21-18, SHOWING SEVERAL MODELS OF SUBARU'S HAVE THIS STEERING ISSUE. I HAVE ATTACHED THE BULLETIN BELOW FOR YOUR REVIEW.  THE BULLETIN SAYS, \"IF A CRACK IS CONFIRMED, THE EPS STEERING GEAR BOX ASSEMBLY MUST BE REPLACED.\" THE WORD \"MUST\"  TELLS ME IT IS AN IMPORTANT SAFETY ISSUE.  SHORTLY AFTER PURCHASING THIS CAR, I RETURNED IT TO THE SUBARU DEALERSHIP  AND WAS TOLD THERE WAS NOTHING WRONG WITH THE STEERING.",
        "vin": "JF1GPAC65E8"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282483,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON OWNS A 2014 SUBARU WRX WITH A MANUAL TRANSMISSION. ON 25 NOV 2019 HE WAS DRIVING ON 501 TOWARDS LITITZ/LANCASTER PA WHEN HIS THIRD GEAR DECIDED TO DESTROY ITSELF WHILE DRIVING @ 45MPH.  I HAVE READ ABOUT SO MA Y OF THESE MANUAL TRANSMISSIONS DESTROYING THEMSELVES UNDER NORMAL DRIVING CONDITIONS.  THAT CAR IS HIS PRIDE & JOY UNTIL THIS HAPPENED.  HE PURCHASED THE CAR IN MARYLAND.  WATCHING A REBUILD ON YOUTUBE AFTER HIS PHONE CALL IT SEEMS THAT THIS IS A COMMON PROBLEM IN ANY HELICUT GEARS.  LOUSY MATERIALS USED.  BEING AROUND CARS, STREET & HI PERFORMANCE RIDES ALL MY LIFE I HAVE NEVER HEARD OF A MANUAL TRANSMISSION DESTROY ITSELF WHILE DRIVING AT NORMAL/HIGHWAY SPEEDS. EITHER SUBARU MANUFACTURES IT'S VEHICLES TO HAVE ISSUES SUCH A LOUSY GEAR BOX'S OR THEY ARE BUYING TRASH FROM LOUSY VENDORS. HIGH PERFORMANCE AMERICAN, GERMAN, FRENCH, ITALIAN & OTHER JAPANESE CARS WITH MANUAL TRANSMISSIONS DO NOT HAVE THIS ISSUE. IT SHOULD BE A RECALL ISSUE.  SUBMIT A QUESTION TO ALL SUBARU OWNERS WITH MANUAL TRANSMISSIONS TO SEE HOW MA Y OF THEM LOST GEARS IN THEM.   NO ACCIDENT HAD HAPPENED ONLY BECAUSE MY SON IS A LEVEL HEADED PERSON WITH GOOD COMMON SENSE FOR A 24 YEAR OLD THIS 3 DEC.",
        "vin": "JF1GR7E62EG"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278218,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. THE CONTACT STATED THAT THE AIR BAG INDICATOR DID NOT ILLUMINATE WHEN THE PASSENGER SEAT WAS OCCUPIED. THE VEHICLE WAS TAKEN TO METRO WEST SUBARU (948 WORCESTER ST, NATICK, MA 01760) WHERE IT WAS DIAGNOSED THAT THE AIR BAG SENSOR ON THE PASSENGER SEAT NEEDED TO BE REPLACED AND A NEW SEAT NEEDED TO BE PURCHASED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 51,000.",
        "vin": "JF1GPAL62E8"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2019",
        "dateOfIncident": "08/31/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252607,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I ADUJSTED STEERING WHEEL AND TRIED TO START THE IGNITION AND NO CRANK, NO LIGHTS ON DASH AND CAR WINDOWS WONT WORK. THIS CAR IS WELL TAKING CARE OF AT SUBARU DEALERSHIP ONLY. PLEASE HELP.",
        "vin": "JF1GPAL6XE8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "08/11/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243846,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE ABOUT A YEAR AFTER I GOT THE CAR, THE PASSENGER DETECTION SYSTEM WILL TURN OFF THE PASSENGER AIRBAG WITH AN ADULT IN THE SEAT, OR JUST WON'T TURN IT ON AT STARTUP. IT'S ALMOST ALWAYS OFF AT ANY TIME WHILE DRIVING WITH A PASSENGER. IT WILL ACKNOWLEDGE A PASSENGER, IF ONE IS PRESENT, AS IT DINGS TO BUCKLE THE SEAT BELT, BUT THE AIRBAG STAYS OFF. OR, IT WILL BE OFF, THEN DETECTS A PASSENGER AFTER A WHILE, AND TURN ON, ONLY TO TURN OFF A FEW MINUTES LATER.",
        "vin": "JF1GPAA68E8"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240363,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG SENSOR DEACTIVATES WITH PASSENGER IN SEAT. HAS OCCURRED DURING IN-TOWN AND HIGHWAY DRIVING. DOES NOT ALWAYS CORRECT WHEN VEHICLE HAS BEEN STOPPED, RESTARTED, ETC. DEALERSHIP SUGGESTED TELLING PASSENGERS TO REFRAIN FROM CELLPHONE/TECH USE IN THE PASSENGER SEAT, AS IF THAT IS A SOLUTION.",
        "vin": "JF1GPAA63E8"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234379,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL - UNABLE TO GET SERVICE IN REASONABLE TIME - HAVE CONTACTED DEALERS IN BOSTON AREA - ALL TO BUSY TO FIX THIS ISSUE    SUBARU SAFETY RECALL WUE-90  BRAKE LAMP SWITCH RECALL  NHTSA RECALL ID 19V-149  REGARDING VIN: JF1GPAD69E[XXX]  DEAR  [XXX],      THIS NOTICE IS SENT TO YOU IN ACCORDANCE WITH THE NATIONAL TRAFFIC AND MOTOR VEHICLE SAFETY ACT.    SUBARU OF AMERICA, INC. HAS DECIDED THAT A DEFECT, WHICH RELATES TO MOTOR VEHICLE SAFETY, EXISTS IN CERTAIN 2013-2017 MODEL YEAR CROSSTREK VEHICLES, 2014-2016 MODEL YEAR FORESTER VEHICLES, 2008-2016 MODEL YEAR IMPREZA (4-DOOR) VEHICLES, 2012-2016 MODEL YEAR IMPREZA (5-DOOR) VEHICLES, AND 2008-2014 MODEL YEAR WRX (4-DOOR) VEHICLES.    YOU RECEIVED THIS NOTICE BECAUSE OUR RECORDS INDICATE THAT YOU CURRENTLY OWN ONE OF THESE VEHICLES.    DESCRIPTION OF THE SAFETY DEFECT AND SAFETY HAZARD  DUE TO A POTENTIAL DEFECT IN THE BRAKE LAMP SWITCH IN YOUR VEHICLE, THE REAR BRAKE LAMPS MAY NOT ILLUMINATE AS INTENDED WHILE BRAKING. BRAKE LIGHTS THAT DO NOT ILLUMINATE PROPERLY WILL NOT ALERT OTHER DRIVERS THAT THE VEHICLE IS SLOWING OR STOPPING, INCREASING THE RISK OF A CRASH.    IN THE EVENT OF A BRAKE LAMP SWITCH FAILURE, THE BRAKES ON YOUR VEHICLE WOULD NOT BE AFFECTED.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "JF1GPAD69E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232640,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG TURNS OFF WHEN A PASSENGER HAS DAMP OR WET CLOTHES AND DOESN'T TURN BACK ON FOR OVER A DAY.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230482,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TOLD THAT MY CAR MIGHT HAVE A RECALL ON THE VALVE SPRING, TOOK IT IN THEY SAID THE VALVE SPRING WAS BAD BUT THAT MY CAR WAS NOT INCLUDED IN THE RECALL AND I HAD TO PAY 2200. NOT SURE WHY MY CAR WHICH IS THE EXACT YEAR FOR THE RECALL AND WAS ACTUALLY HAVING THE ISSUES CAUSED BY THE BAD VALVE WOULD NOT BE INCLUDED IN THE RECALL.",
        "vin": "JF1GPAA66E8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219773,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DONE A BUSY STREET IN DOWNTOWN GARDNERVILLE, NV WHEN TOXIC FUMES WERE EMITTED INTO MY CAR MAKING MY EYES WATER AND FEELING OF DISORIENTATION. LUCKILY I WAS ABLE TO PULL OVER QUICKLY.   INITIALLY I DID NOT KNOW WHAT WAS WRONG BUT WHEN I COMPLETED THE ERRAND I STOPPED FOR I REALIZED MY AIR CONDITIONING WAS NOT WORKING.   I TOOK THIS INTO MY MECHANIC WHO ADVISED MY OF ALL THE PARTS THAT NEEDED REPLACING.   I AM STILL WAITING ON A PART AND IN THE MEANTIME I HAVE A VISUAL OF WHAT HAPPENED.   THE AIR CONDITIONING DIAL IS A BURNT OUT MESS UNTIL THE FINAL REPAIR CAN BE ACCOMPLISHED.   IF THIS HAPPENED IN A LOCATION WHERE I COULD NOT STOP QUICKLY THIS MAY HAVE RESULTED IN A SERIOUS ACCIDENT.   I HAVE REQUESTED THE MECHANIC TO KEEP ALL THE PART AFFECTED IN THE EVENT THEY ARE NEEDED.",
        "vin": "JF1GPAL64E8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "05/14/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207820,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "YOUR SITE DOES NOT RESPOND QUICKLY TO ENTERING IN THE VIN NUMBER - IT JUST SITS THERE - DOES NOT RESPOND TO DATA BEING ENTERED ALSO, IT APPEARS TO HAVE A WEIRD DATE (17/17) WHAT IS THAT SUPPOSED TO MEAN? &#128078;DOES ANYONE REVIEW THIS STUFF????",
        "vin": "JF1GPAC6XEH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181383,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD NUMBEOUS REPAIRS STARTING AT 50000 MILES. HEATER BLOWER UNIT WENT OUT AT AROUND 50000 - WAS ACTUALLY MELTED ACCORDING TO MECHANIC. STARTER WENT OUT AT 90000. WAS NOT GETTING ENOUGH POWER TO STARTER. DROVE IT THE NEXT DAY AFTER THE $1000 REPAIR  AND IT'S SMELLS LIKE SOMETHING IS BURNING. THE VECHICLE DOES NOT SEEM TO BE GETTING ENOUGH POWER TO VITAL PARTS AND ARE OVERHEATING AND MELTING. I HAVE PAID OVER $6000 IN REPAIRS AND IT KEEPS GETTING WORSE. I'M AFRAID TO DRIVE IT FOR FEAR THE VEHICLE WILL CATCH ON FIRE. IT WAS ACTUALLY SMOKING THE DAY AFTER WE REPLACE THE STARTER AND SMELLED LIKE SOMETHING WAS BURNING. THE VEHICLE HAS LESS THAN 100000 MILES AND HAS CONSTANTLY HAD PROBLEMS SINCE 50000 MILES .",
        "vin": "JF1GJAC68EG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173840,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER 2014 AND AGAIN (TWICE) IN JANUARY 2018 I WAS DRIVING (IN MOTION) WITH A PASSENGER WHEN THE PASSENGER-SIDE AIRBAG SYSTEM TURNED OFF.    THE ONLY VARIABLE I KNOW FOR THE SECOND TIME WAS THAT THE PASSENGER WAS DAMP FROM SNOW-SPORTS.  EACH TIME IT PROVED IMPOSSIBLE TO GET THE CAR TO RECOGNIZE A PASSENGER IN THE FRONT SEAT, SO WE HAD TO DRIVE WITHOUT AIRBAG PROTECTION FOR THE PASSENGER.    THE FIRST TIME, THE SUBARU DEALERSHIP REPLACED (8/6/15)  THE PASSENGER SEAT-BOTTOM WITH SENSOR FREE OF CHARGE; THEY HAVE SAID THEY INTEND TO DO THIS AGAIN.   THE SERVICE TECHNICIANS TOLD ME THAT IMPREZA PASSENGER AIRBAG SENSORS CAN TURN OFF WHEN THE SEAT IS DAMP/WET.",
        "vin": "JF1GPAL64EH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172083,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FILING A COMPLAINT FOR MY SUBARU AS THE TRANSMISSION IS FAILING. I WAS UNAWARE OF THIS AND NEVER EVEN NOTIFIED OF AN ISSUE OR AN EXTENDED WARRANTY. MY SAFETY IS AT RISK AS THE VEHICLE IS NOT OPERATING AS IT SHOULD AND I WAS TOLD BY SUBARU THAT THEY ONLY HAD AN EXTENDED WARRANTY WHICH I AM OUT OF AND BASICALLY TOO BAD OUR KNOWN ISSUE IS NOT SUBARUS RESPONSIBILITY ONCE YOU HIT A 100,000 MILES.  HOW IS A KNOWN STALLING ISSUE DUE TO A TRANSMISION FAILURE IN A VEHICLE NOT A SAFETY ISSUE AND A RECALL?????  WHO IS RESPONSIBLE FOR THERE NOT BEING A RECALL? I NEED TO KNOW SO THAT IF AND WHEN MY SAFETY OR ANY OTHERS IS COMPROMISED GOD FORBID ANYONE IS HURT OR CRITICALLY INJURED, DUE TO THIS KNOWN PROBLEM,  WHICH HAS NOT BEEN RECALLED, WHO I WILL SUE.",
        "vin": "JF1GPAL66E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "10/09/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165187,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE AIRBAG SENSOR DOES NOT OPERATE PROPERLY. AIRBAG DOES NOT TURN ON WHEN A PASSENGER IS SITTING IN THE SEAT, BOTH WHEN STATIONARY AND IN MOTION.",
        "vin": "JF1GPAA63E8"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157068,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS GUAGE INNACCURATELY DESCRIBES HOW MUCH GAS IS LEFT IN THE TANK. I FILLED MY TANK FROM 40 MILES TWO WEEKS AGO. I PAID $32 FOR THE GAS AND IT ONLY READ 170 MILES TILL EMPTY UNLIKE THE USUAL 300 MILES. 5 HOURS LATER, WHEN IT CORRECTED ITSELF, RETURNING TO 300 MILES. THIS WEEK, UPON FILLING MY CAR UP AT 40 MILES TILL EMPTY, I PAID $28. MY CAR READ 280 MILES TILL EMPTY AND THEN SHOT UP TO 300 MILES HALF AN HOUR LATER. I FEEL UNSAFE TO LET MY CAR GO LONG PERIODS OF TIME WITHOUT FILLING WITH GAS. I CALLED MY LOCAL SUBARU DEALERSHIP AND THEY WANTED ME TO WAIT ALMOST 3 WEEKS TO BRING MY CAR IN, EVEN WHEN STATED THAT I HEARD OF THIS HAPPENING PREVIOUSLY WITH OTHER 2011-2016 SUBARU IMPREZAS. THEIR RESPONSE WAS LESS THAN COMFORTING \"CLAIMING\" THEY HAVE HAD NO PRIOR KNOWLEDGE OR TRENDS OF THIS HAPPENING WITH MY GENERATION IMPREZA, ONLY THE NEWER MODEL IMPREZAS AND CROSSTREKS.",
        "vin": "JF1GPAC69E8"
    },
    {
        "components": "TIRES,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/30/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152709,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 SUBARU IMPREZZA. CONSUMER WRITES IN REGARDS TO FAINT METALLIC SQUEAL ON LEFT SIDE OF VEHICLE. *LD    THE CONSUMER STATED THE METALLIC SQUEAL WAS DUE TO BRAKES THAT NEEDED TO BE REPAIRED PREMATURELY. THE TIRES MADE A SHIMMYING SOUND WHILE DRIVING. THE DEALER ADVISED THE SOUND WAS DUE TO ROCKS TRAPPED IN THE TIRE TREAD BEING TOSSED AROUND IN THE WHEEL WELLS. THE BREAKS WERE REPAIRED, BUT THE TIRES WERE NOT.  *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/08/2018",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150167,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO SPECIFIC ISSUES. 1) THE PASSENGER SIDE AIR BAG WILL NOT ACTIVATE, ACCORDING TO THE INDICATOR LIGHT, WHEN THERE IS A PASSENGER IN THE CAR. 2) THE SENSOR IN THE PASSENGERS SIDE THAT RINGS A BELL IF THE PASSENGER IS NOT WEARING A SEAT BELT WILL GO OFF WHILE THE CAR IS BEING DRIVEN, EVEN THOUGH THERE IS NO PASSENGER IN THE PASSENGER SEAT - DANGEROUSLY DISTRACTING FOR THE DRIVER. THE START DATE BELOW IS THE DATE THE CAR WAS PURCHASED, AS THE ISSUE HAS OCCURRED SINCE PURCHASE.",
        "vin": "JF1GPAA61E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144013,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS IN THE CAR SHUT OFF WHEN A PASSENGER GETS IN THE SEAT IF THEY HAVE EVEN A TINY AMOUNT OF MOISTURE....SUCH AS AFTER WORKING OUT AT THE GYM *AND CHANGING CLOTHES*. ALSO IF IT'S RAINING, THE 50' WALK FROM THE HOUSE TO THE CAR PUTS ENOUGH MOISTURE ON THE PASSENGER TO MAKE ALL OF THE AIRBAGS IN THE CAR SHUT OFF. CALLED THE DEALERSHIP AND THEY TOLD ME TO NOT GET THE SEAT WET. SEVERAL OTHER YEAR MODELS OF SUBARU HAVE BEEN RECALLED FOR THIS EXACT ISSUE- THIS IS A HUGE SAFETY ISSUE AND SOMEONE IS GOING TO GET KILLED.",
        "vin": "JF1GPAA68E8"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "08/07/1918",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123894,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE THIRD TIME, WHILE DRIVING THE SUBARU THE ENGINE DIED AND ALL DASH LIGHTS CAME ON.  CAR CONTROL WAS DIFFICULT.  THE FIRST TWO TIMES WAS ON A FREEWAY AND THE THIRD TIME WAS ON A MAJOR HIGHWAY.  CAR WAS TOWED TO A SUBARU DEALER WHO DETERMINED, THAT THE ELECTRICAL BULKHEAD HARNESS WAS DAMAGED DUE TO RODENTS CHEWING ELECTRICAL WIRES IN THE ENGINE COMPARTMENT RESULTING IN A BLOWN FUSE. AFTER THREE WEEKS OF REPAIR AND AT A COST OF $7173.65 THE CAR WAS REPAIRED, HOPEFULLY.  HAVING THE ENGINE SIMPLY FAIL, TWICE AT FREEWAY SPEEDS, WAS AN EXTRAORDINARILY DANGEROUS EXPERIENCE.  I HAVE A DETAILED REPAIR INVOICE BUT NO ABILITY TO SCAN IT.  MY INSURANCE CLAIM WAS DONE BY PHONE AND ELECTRONICALLY.",
        "vin": "JF1GPAC63E8"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123317,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEED (55MPH IN CALIFORNIA) I HEARD A LOUD SLAPPING SOUND COMING FROM THE ENGINE AREA. THE HIGHWAY WAS RELATIVELY STRAIGHT. A FEW MINUTES LATER THE ENGINE LIGHT CAME ON AND THE CAR BEGAN TO SLOW. I COULD NOT GIVE THE ENGINE MORE POWER BY STEPPING ON THE ACCELERATOR. I PUT THE CAR IN NEUTRAL AND COASTED TO THE FAR RIGHT SHOULDER.",
        "vin": "JF1GR8H69EL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118699,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCORDING TO THE DEALER, THE PASSENGER SIDE AIR BAGS IN MY 2014 IMPREZA STOPPED WORKING DUE TO A SENSOR MALFUNCTION AFTER THE PASSENGER SEAT CUSHION GOT WET (E.G., BY PEOPLE SITTING IN THE SEAT AFTER EXERCISING OR GETTING CAUGHT IN THE RAIN).      AN AIRBAG SENSOR SHOULD NOT DISABLE AN AIRBAG BECAUSE OF A WET SEAT.  THIS IS A SAFETY DEFECT, HAS BEEN WIDELY REPORTED FOR THE 2014 IMPREZA IN ONLINE MESSAGE BOARDS, AND IS VERY SIMILAR TO THE DEFECT THAT PRECIPITATED A 2012 IMPREZA SAFETY RECALL (RECALL #WQT-55, SAFETY CAMPAIGN 15V419000)    SUBARU SHOULD RECALL THE 2014 IMPREZA AND PAY FOR THE COST OF REPLACING DEFECTIVE AIRBAG SENSORS.",
        "vin": "JF1GPAC68E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103629,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT SEAT PASSENGER AIRBAG TURNS OFF SOMETIMES EVEN WHEN I HAVE PASSENGERS SITTING THERE. I TOOK THE CAR TO CARMAX, WHERE I PURCHASED IT AND THEY SAID THE SEAT SENSOR WAS MALFUNCTIONING DUE TO A WET SEAT. THE SEAT WAS NOT WET TO MY TOUCH AND NO LIQUID HAD SOAKED IT. SINCE THEN, THE AIRBAG HAS CONTINUED TO TURN OFF WITH A PASSENGER IN THE SEAT WHEN DRIVING. THIS HAS HAPPENED MORE THAN 5 TIMES IN A 6 MONTHS TIMESPAN. I HAVE A VIDEO DOCUMENTING ONE OF THE TIMES THIS HAS HAPPENED.",
        "vin": "JF1GJAA62EH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "06/18/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102810,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. WHILE THE VEHICLE WAS IDLING WITH THE HATCH OPEN, THE HATCH FELL DOWN WITHOUT WARNING. THE CONTACT NOTICED THAT THE DRIVER'S SIDE HATCH BOLT HAD FRACTURED IN HALF. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO A DEALER FOR DIAGNOSTIC TESTING AND REPAIR. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000.",
        "vin": "JF1GPAC67E8"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "08/21/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020153,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 SUBARU HAS LESS THEN 21,000 MILES AND THE FRONT BRAKES STARTED MAKING A GRINDING NOISE WHHILE THE CAR WAS MOVING. IT TURNS OUT THAT THE CALIPERS WERE BINDING UP DUE TO RUST, PRESUMABLY FROM ROAD SALT. MY CAR SPENT 2 WINTERS IN UTAH AND THE REMAINDER OF ITS SHORT 3 YEAR LIFE IN THE CALIFORNIA BAY AREA. I CONTACTED SUBARU CUSTOMER SUPPORT ABOUT THIS AND THEY INFORMED ME THAT MY CAR WAS 6 MONTHS OUTSIDE ITS 3 YEAR/36,000 MILE WARRANTY, THERE WERE NO OUTSTANDING RECALLS ON THE VEHICLE AND THAT THEY WOULD NOT HELP ME. BRAKE CALIPERS SHOULD NOT NEED REPLACING AT 21,000 MILES AND SHOULD LAST CLOSER TO 100,000 MILES. I BELEIVE THESE CALIPERS ARE DEFECTIVE AND A SAFETY HAZARD. SUBARU HAD TO RECALL 660,000 VEHICLES DUE TO RUST AFFECTING THEIR BRAKE LINES (HTTPS://WWW.NYTIMES.COM/2014/07/04/AUTOMOBILES/SUBARU-RECALLS-660000-VEHICLES-FOR-BRAKE-LINE-CORROSION.HTML?MCUBZ=3) AND I BELEIVE THAT THIS PROBLEM ALSO EXTEND TO THEIR BRAKE CALIPERS AND THAT THE RECALL SHOULD BE EXPANDED TO INCLUDE THIS PART OF THE VEHICLE. I THINK THE NHTSA NEEDS TO EXOAND THE SUBARU RECALL. I MENTIONED THIS RUST RELATED BRAKE RECALL TO SUBARU SUPPORT AND THEY REFUSED TO RECOGNIZE ANY CONNECTION BETWEEN MY ISSUE AND THE RECALLS THEY HAVE HAD.",
        "vin": "JF1GPAL63E8"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "08/02/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11013379,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. WHILE THE VEHICLE WAS IDLING AT A RED LIGHT WITH THE BRAKE PEDAL DEPRESSED, THE ENGINE REVVED AND THE VEHICLE ACCELERATED WITHOUT WARNING. AS A RESULT, THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUSTAINED A NECK INJURY THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO NAPLETON'S ARLINGTON SUBARU MAZDA (LOCATED AT 1555 E RAND RD, ARLINGTON HEIGHTS, IL 60004 (847) 255-5700), BUT THE FAILURE COULD NOT BE REPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 92,000.",
        "vin": "JF1GPAS67E8"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012263,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED SUDDEN EXTREME ACCELERATION JUST AFTER I PULLED INTO MY DRIVEWAY. THE CAR SUDDENLY--VERY RAPIDLY--ACCELERATED AND CRASHED THROUGH WOODEN GARAGE DOOR AND INTO THE POURED CONCRETE WALL AT BACK OF GARAGE, CRACKING THE WALL AND OF COURSE TOTALING THE CAR.",
        "vin": "1FTZR15X5WP"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012269,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD JUST PULLED INTO DRIVEWAY AND WAS PUTTING CAR INTO PARK WHEN IT SUDDENLY ACCELERATED--REVVED--AND CRASHED THROUGH THE WOODEN GARAGE DOOR AND INTO THE POURED CONCRETE WALL AT END OF GARAGE, CRACKING IT AND MOVING WALL BEHIND IT.",
        "vin": "JF1GPAC63E8"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/28/2017",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11011339,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. WHILE DRIVING AT A LOW RATE OF SPEED TO MAKE A LEFT TURN, ANOTHER VEHICLE WAS TURNING RIGHT AND THE CONTACT BUMPED INTO THE REAR OF THE VEHICLE. THE DRIVER'S SIDE AIR BAG DEPLOYED IN THE STEERING WHEEL AND BELOW THE KNEES. THE CONTACT SUSTAINED INJURIES TO THE HEAD, BACK, KNEES, NECK, AND FACE. MEDICAL TREATMENT WAS REQUIRED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A COLLISION CENTER WHO REPAIRED THE COSMETIC DAMAGES. THE MANUFACTURER WAS NOTIFIED AND DID NOT PROVIDE A DEALER AS A REFERRAL TO DIAGNOSE THE AIR BAG FORCE ISSUE. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS REPAIRED. THE CONTACT RECEIVED NO SOLUTION FROM THE MANUFACTURER. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "JF1GPAA65E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/09/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003986,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE BEEN HAVING A PROBLEM WITH OUR PASSENGER AIR BAG IS OFF AND THE AIR BAG WARNING LIGHT COMING ON THE INSTRUMENT PANEL WHEN SOMEONE IS SETTING IS THE PASSENGER SEAT. WE HAVE TWO VIDEO ONE JUST AFTER THE WARNING LIGHTS CAME ON AND THE SECOND AFTER WE STOP, SHUT THE ENGINE OFF AND RESTARTED TAKEN TODAY JULY 9 2017 AT 4:56PM. THIS HAS BEEN HAPPENING SINCE THE CAR WAS PURCHASE IN JULY 2014. WE HAVE TAKEN THE VEHICLE INTO ULTIMATE SUBARU OF FREDERICKSBURG, VA AND TO CREWS SUBARU NORTH CHARLESTON SC ABOUT THIS PROBLEM ON JULY 6 2017. I WAS INFORMED THERE WAS NOTHING THEY COULD DO SINCE THE LIGHT DOESN'T STAY ON. THEY ALSO COULDN'T TELL ME IF THE CAR WAS SAFE TO DRIVE WITH SOMEONE RIDING IN THE PASSENGER SEAT WITH THE WARNING LIGHTS ON.   THE TECHS AT CREW SUBARU NORTH CHARLESTON SC TOLD ME TO MAKE A VIDEO AND TO SEND IT TO SUBARU CORPORATE, NHTSA AND IIHS. MY RESEARCH ONLINE SHOWS THAT SUBARU HAD A RECALL ON THEIR 2012 IMPREZA RECALL #WQT-55, . THE FIX WAS TO REPLACE THE SEAT SENOR. SINCE WE HAVE CONTACTED TWO DEALERS ABOUT THIS ISSUE AND NOTHING HAS BEEN DONE. WE HAVE REPORTED THIS TO INSURANCE INSTITUTE FOR HIGHWAY SAFETY (IIHS) ON APRIL 20, 2017. TODAY I CONTACTED SUBARU CORPORATE CASE # 1-24758084454 I SPOKE WITH KIYA AT CUSTOMER SERVICE THIS MORNING JULY 10, 2017 SHE IS THE ONE PERSON WHOM STATED THAT IF THE WARNING LIGHTS ARE ON THEN THE AIR BAGS WOULD NOT WORK. I HAVE VIDEO SHOW THIS BUT CAN NOT UPLOAD IT TO THIS SITE. I CAN EMAIL IT TO THE RIGHT PEOPLE.",
        "vin": "JF1GPAA6XE8"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10986389,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. WHILE DRIVING APPROXIMATELY 5 MPH, THE CONTACT WAS INVOLVED IN A FRONT END COLLISION. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT'S SHINS AND CALVES SUFFERED NERVE DAMAGE, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A COLLISION SHOP AND REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED BY THE MANUFACTURER THAT THE AIR BAGS DEPLOYED AS DESIGNED. THE FAILURE MILEAGE WAS APPROXIMATELY 29,000.",
        "vin": "JF1GPAA65E8"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/20/2017",
        "dateOfIncident": "04/18/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979676,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE PASSENGER SEAT AIRBAG WILL SWITCH OFF WITH AN ADULT SEATED OR SWITCH IT ON WHEN NO ONE IS PRESENT. AT THE SAME TIME THE SEAT BELT LIGHT WILL TURN ON. WE HAVE FOUND THAT STOPPING THE VEHICLE TO RESTART THE VEHICLE CORRECT THIS ISSUE. ON THE 2012 SUBARU THERE WAS A PROBLEM JUST LIKE THIS THAT WAS RECALLED. SUBARU CAN'T FIND ANYTHING BECAUSE THESE PROBLEMS ARE CORRECTED AFTER THE VEHICLE IS STARTED AGAIN. NO ONE AT SUBARU CAN STATE THAT THE SYSTEM IS WORKING WHILE THIS HAPPENS.",
        "vin": "JF1GPAA6XE8"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970727,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. WHILE DRIVING 50 MPH, THE VEHICLE'S HOOD INDEPENDENTLY OPENED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE BODY SHOP, BUT WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE AS LISTED IN NHTSA CAMPAIGN NUMBER: 16V060000 (STRUCTURE, LATCHES/LOCKS/LINKAGES), BUT THE VIN WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 33,000.",
        "vin": "JF1GPAS6XE8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945873,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG FAIL, DRIVERS SIDE AND PASSENGER SIDE.  IN NOVEMBER OF 2016 THE ICON INDICATING \"PASSENGER AIRBAG FAIL\" STARTING COMING ON EVERY TIME I PICKED UP MY SON FROM SCHOOL ON A RAINY DAY OR AFTER SPORTS PRACTICE. HE WAS NOT WET, JUST DAMP OR HOT. THE ICON COMING ON WAS TOTALLY PREDICTABLE AT FIRST, ONLY UNDER DAMP CONDITIONS, THEN UNPREDICTABLE. IN SPEAKING TO THE SERVICE PERSON WHERE I BOUGHT THE CAR NEW, I WAS TOLD THAT THE LIT ICON WAS NORMAL, THEN TOLD THAT MY SON DIDN'T WEIGH ENOUGH (HE WRESTLES AT 156 LBS). I BROUGHT THE CAR TO THE DEALERSHIP WITHOUT AN APPOINTMENT AND WAS ABLE TO DEMONSTRATE THE PROBLEM. THE PASSENGER SEAT AIRBAG SENSOR WAS EVENTUALLY REPLACED  UNDER WARRANTY.    THE PROBLEM IS NOW REPEATING ITSELF WITH THE DRIVERS SIDE AIRBAG FAIL ICON. THE DEALERSHIP WAS UNABLE TO FIND A PROBLEM CODE WHEN DIAGNOSED.I WAS TOLD THE TECHNICIAN CALLED SUBARU TECH-SUPPORT AND THAT HE WAS TOLD THAT THE PROBLEM IS \"NORMAL\". I AM NOW TOLD THAT THE SENSOR CAN FAIL WHEN THE DRIVER'S SEAT IS DAMP, BUT WILL WORK WHEN IT DRIES OUT, THERE IS NO REPAIR POSSIBLE. IF THIS IS TRUE, I CANNOT SAFELY DRIVE MY CAR IN INCLEMENT WEATHER OR HOT WEATHER. I BOUGHT THIS CAR SPECIFICALLY FOR DRIVING IN LESS THAN IDEAL WEATHER.  THE PROBLEM WITH THE PASSENGER SIDE AIRBAG SENSOR WAS ADDRESSED BY THE  NHTSA  IN APRIL 4015 UNDER ACTION NUMBER PE15012, AND RECALL CAMPAIGN #   15V419000, BUT I CAN TESTIFY THAT THE PROBLEM STILL EXITS.  IT TOOK THREE DAYS FOR  THE DRIVERS SIDE AIRBAG SENSOR, OR ICON, TO STOP SHOWING FAILED, IT STOPPED RAINING A DAY BEFORE. IT IS A HIGHLY UNSAFE SITUATION IF IT IS TRULY UNREPAIRABLE.  *TR",
        "vin": "JF1GPAA68EG"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "12/04/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929918,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 65 MPH (TEMPERATURE 34 DEGREES, NO HEAT ON IN CAR) EARLY SUNDAY AM 12/4 (NO OTHER VEHICLES IN FRONT OF ME) AND MY SUNROOF GLASS EXPLODED.     DEALER IS TRYING TO TELL ME IT WAS FROM A ROCK OR OTHER PARTICLE ITEM (SERIOUSLY... NO ONE WAS IN FRONT ME). THE NOISE SOUNDED LIKE A GUNSHOT AND I IMMEDIATELY PULLED OVER.     I HAVE 5 TOTAL PICTURES BUT THE SYSTEM ISN'T ALLOWING ME TO ATTACH MORE.  *TR",
        "vin": "JF1GPAD66EH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "09/22/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908804,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE NOTICED THAT THE AIRBAG SENSOR LIGHT WILL COME ON AT RANDOM TIMES WHILE WE ARE DRIVING.  WE NOTICED THIS ISSUE SOON AFTER OUR LEASE BEGAN, IN EARLY 2014.  WE HAVE BEEN UNABLE TO ESTABLISH IF THERE IS A PATTERN OR REASON THAT THE LIGHT GOES ON.  ONCE THE LIGHT COMES ON, IT DOES NOT GO OFF UNTIL THE ENGINE IS TURNED OFF.  INITIALLY, THIS HAPPENED MAYBE ONCE A WEEK OR SO, BUT WE HAVE NOTICED THAT LATELY IT HAPPENS MORE FREQUENTLY.    WE HAVE DISCUSSED THIS PROBLEM WITH OUR LOCAL SUBARU DEALER (WAYNE NJ SUBARU).  ALTHOUGH WE BROUGHT THE PROBLEM TO THEIR ATTENTION, THEY NEVER ADVISED US THAT THERE HAD BEEN A RECALL FOR THIS EXACT ISSUE WITH PREVIOUS YEAR IMPREZAS.    IT WAS ONLY WHEN WE RESEARCHED THIS PROBLEM ON-LINE THAT WE DISCOVERED THAT THERE WAS IN FACT A RECALL FOR THIS EXACT SAME ISSUE, WITH EARLIER YEAR IMPREZAS.      THE DEALER HAS TOLD US THAT IT WOULD COST APPROXIMATELY $1,000.00 TO HAVE THE PROBLEM FIXED, AS IT INVOLVES REPLACING THE SEAT.    THIS CAR IS A LEASE.  WE DO NOT FEEL THAT WE SHOULD HAVE TO PAY FOR A REPAIR OF SOMETHING THAT IS A WIDESPREAD PROBLEM AMONG SUBARU IMPREZAS.  WE FEEL THAT OUR CAR SHOULD BE REPAIRED UNDER THIS RECALL.    NEEDLESS TO SAY, THIS PROBLEM IS ALARMING, AS WE ARE CONCERNED ABOUT WHETHER THE AIR BAG WOULD FUNCTION PROPERLY IF THE CAR WAS INVOLVED IN AN ACCIDENT.    PLEASE ADVISE HOW WE CAN RESOLVE THIS ISSUE.",
        "vin": "JF1GPAA65E8"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/05/2016",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840006,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH THE SUSPENSION SYSTEM ON THE SUBARU IMPREZA. THE INSIDE OF THE TIRES WILL WEAR OUT PREMATURELY AND THE OUTSIDE OF THE TIRE WILL HAVE PLENTY OF TREAD ON IT. IF THE OWNER DOES NOT CHECK THE WHOLE TIRE THEY WILL MISS IT AND COULD RESULT IN A BLOWN TIRE. HAVE HEARD OF MANY IMPREZA OWNERS HAVING THIS PROBLEM. TALKED TO A SERVICE MANAGER AND THEY INDICATED THAT THEY HAVE SEEN THIS PROBLEM ALSO. IT NEEDS LOOKED AT BEFORE SOMEBODY GET HURT OR KILLED.",
        "vin": "JF1GPAH66E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836242,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM PRESENTLY TRAVELING 60MPH ON THE FREEWAY. I AM SITTING IN THE PASSENGER SEAT. THE PASSENGER AIRBAG OFF LIGHT IS ON. I CAN ONLY ASSUME THIS HAS TO DO WITH MY BOTTOM BEING SLIGHTLY DAMP AFTER SNOW SPORTS. I ASSUME THIS BECAUSE THE PREVIOUS TIMES THAT THIS HAPPENED AND I TOOK IT TO THE DEALERSHIP IN AURORA COLORADO I WAS TOLD \"THE SENSOR WILL TURN THE AIRBAG OFF IF THERE IS ANY MOISTURE ON THE SEAT OR IF ELECTRONICS ARE SET ON OR NEAR THE SEAT. I WAS TOLD NOT TO DO THOSE THINGS. I CANNOT SEE HOW THIS CAN BE CONSIDERED SAFE.",
        "vin": "JF1GPAL60EH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "02/07/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824975,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SENSOR FOR THE AIR BAGS ISN'T WORKING RIGHT. IT TURNS THE PASSENGER AIR BAG OFF WHEN PEOPLE MUCH HEAVIER THAN 80 POUNDS ARE IN THE FRONT SEAT. WHEN NO ONE IS IN THE SEAT, SOMETIMES THE PASSENGER AIR BAG COMES ON. THIS HAPPENS BOTH IN PARK AND WHEN I AM DRIVING.",
        "vin": "JF1GJAA61EH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2015",
        "dateOfIncident": "11/05/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794753,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 6-8 MONTHS AGO AS I WAS MAKING A TURN I PRESSED THE BRAKE PEDAL AND INSTEAD OF SLOWING DOWN THE ENGINE THROTTLED UP.  AND AFTER A FEW MOMENTS WENT BACK TO NORMAL.  TWO WEEKS AGO  AS I PRESSED THE BRAKE PEDAL WHILE COMING TO A STOP SIGN THE ENGINE  THROTTLED  UP AND I HAD DIFFICULTY COMING TO A STOP.  I PUT THE CAR IN PARK AND TURNED IT OFF. WHEN I STARTED IT AGAIN THE ENGINE  IMMEDIATELY WENT TO HIGH THROTTLE TO THE POINT THAT THE FRONT OF THE CAR STARTED VIBRATING.  I TURNED IT OFF AGAIN AND RESTARTED IT AND THIS TIME IT WAS OK.  I TOOK THE CAR INTO THE SUBARU DEALERSHIP.  THEIR MECHANIC RAN THE DIAGNOSTICS AND WAS UNABLE TO PIN POINT THE PROBLEM.  THEY DECIDED TO CALL THE SUBARU TECHNICAL DEPARTMENT AND WERE TOLD TO NOT LET ME DRIVE THE CAR UNTIL THEIR ENGINEER TOOK A LOOK AT THE PROBLEM.  THIS WAS A WEEK AGO AND I HAVE NOT BEEN ABLE TO FIND OUT WHAT THEY HAVE FOUND.",
        "vin": "JF1GPAA63E8"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10767318,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE LIGHT SYSTEM OF MY VEHICLE IS DEFINITELY DEFECTIVE. DEALERSHIP ACKNOWLEDGED DEFECT & \"RESET\" TIRE PRESSURE SENSOR AFTER I GOT INVOLVED IN AN ACCIDENT ON THE FREEWAY FROM MY TIRE EXPLODING FROM A LACK OF TIRE PRESSURE & FAILURE OF LIGHT SHOWING ON MY DASHBOARD. AFTER THE ACCIDENT, A 3RD PARTY TIRE SHOP THEN PROPERLY INFLATED AIR PRESSURE TO ALL 4 TIRES WHICH THEN CAUSED THE AIR PRESSURE LIGHT TO APPEAR ON THE DASH... THIS REVEALS THAT THE TIRE PRESSURE ALERT SYSTEM IS WORKING IN THE OPPOSITE WAY THAT IT IS SUPPOSED TO. IN MY CASE; WHEN THE TIRE PRESSURE WAS LOW; I WOULD NOT GET AN ALERT (THIS IS WHEN IT SHOULD ALERT); BUT WHEN MY TIRE PRESSURE WAS INFLATED TO STANDARDS, THE LIGHT WOULD ALERT ON THE DASH (ERROR). THIS CAUSED ME TO GET INTO A CAR ACCIDENT ON THE FREEWAY AND IS A DANGER TO MANY DRIVERS DRIVING & AROUND THE DRIVERS OF OTHER AFFECTED SUBARUS.    THE 3RD PARTY TIRE SHOP TRIED RESETTING THE DEFECTED TIRE SENSOR; & WAS NOT ABLE TO RESET THE SENSOR THAT WAS NOT WORKING. SUBARU WAS ABLE TO RESET THE SENSOR. WHY WAS SUBARU ABLE TO RESET, BUT THE 3RD PARTY COULD NOT?-POSSIBLE RED FLAG.THE DEALERSHIP DID NOT ORDER ME A NEW TIRE SENSOR. THEY JUST \"RESET\" THE SENSOR WHEN ANOTHER TIRE COMPANY WAS NOT ABLE TO. RESET OR NOT; THE FACT OF THE MATTER IS THAT; THE DEALERSHIP ACKNOWLEDGED THAT THE SENSOR WAS DEFECTED (OR ELSE THEY WOULD NOT HAVE HAD A NEED TO \"RESET\" IT & GIVE ME A FREE MAINTENANCE SERVICE) AND KNOWS ABOUT THE ACCIDENT IT CAUSED ME AS A RESULT. BECAUSE WE KNOW THE TIRE SENSOR IS DEFECTED (OR ELSE THE DEALERSHIP WOULD NOT HAVE HAD TO \"RESET\" THE SENSOR); WHAT'S TO SAY THAT IT WILL NOT DEFECT AGAIN? WHAT IS TO SAY THAT THEY ILLEGALLY JUST TURNED OFF THE SENSOR LIGHT TO COVER UP THE PROBLEM WHEN THE TIRE SENSOR IS STILL DEFECTIVE? WHY DID THEY REINSTALL AN ACKNOWLEDGED DEFECTED TIRE SENSOR AS OPPOSED TO ORDERING ME A NEW TIRE SENSOR?INVESTIGATE PLS",
        "vin": "JF1GPAA62E8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2015",
        "dateOfIncident": "08/22/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760165,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG LIGHTS TURNS OFF AFTER SOME TIME DRIVING WITH A 200 LB PASSENGER IN THE PASSENGER SEAT.  THE LIGHT STARTS OFF ON AND TURNS OFF MEANING THE AIR BAG WILL NOT DEPLOY.  SUBARU DEALER REVIEWED PROBLEM AND DID NOT FIND ANYTHING WRONG EXCEPT FOR SOME HISTORICAL WET SENSOR ERROR CODES.  THIS IS UNSAFE AS AS THE AIR BAG WON'T DEPLOY IF I HAVE A CRASH.  I HAVE THE DEALER PAPERWORK WHERE THEY TESTED IT AND DID NOTHING !!",
        "vin": "JF1GJAC6XEH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "07/10/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744983,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM IT MAY CONCERN  MY SON HAS A 2014 SUBARU IMPREZA . LEASED BRAND NEW. WHILE DRIVING HOME FROM THE BEACH AND AFTER DRYING OFF THE PASSENGER NOTICED THAT THE AIR BAG DEPLOYMENT LIGHT WAS NOT ON. I TOOK THE CAR TO THE DEALER IN RAMSEY NEW JERSEY ?INVOICE 244854 .THEY HAD THE TECHNICIANS LOOK AT THE CAR AND WHAT THEY TOLD US WAS VERY UPSETTING AND SEEMS RIDICULOUS . IF THE PASSENGER SEAT IS THE LEAST BIT DAMP THE AIR BAG WILL NOT DEPLOY. I HAVE IN WRITING FROM SUBARU, OWNER?S MANUAL PAGE 1-47. SO IF THERE IS A CHILD THAT IS A PASSENGER AND HE SPILLS A SODA OR EVEN WATER THERE COULD BE A PROBLEM. HOW MANY PASSENGER DRINK COFFEE ON THEIR WAY TO WORK. THE ADVICE FROM SUBARU IS THAT IF THE SEAT GETS WET HAVE THE PASSENGER SIT IN THE BACK UNTIL IT TOTALLY DRIES. WHAT ?  THIS IS AN ACCIDENT WAITING TO HAPPEN?.REMEMBER TAKATA. I CAN?T BELIEVE A COMPANY LIKE SUBARU CANNOT FIX THIS PROBLEM, I UNDERSTAND THAT IT MAY ALSO BE AN ISSUE WITH THE OUTBACK AND FORESTER. ALL MODELS IF TRUE ARE ADVERTISED FOR THE OUT DOORS.   UPDATED 11/25/15*LJ",
        "vin": "JF1GPAA67E8"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717269,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK OIL LIGHT FIRST CAME ON AT 5000 MILES. AFTER CHECKING THE OIL, IT WAS DETERMINED THAT I WAS DOWN TWO QUARTS OF OIL. I GOT A COMPLETE OIL CHANGE WITH SYNTHETIC OIL WHICH IS NOT CHEAP. OIL LIGHT AGAIN CAME BACK ON AFTER ANOTHER 2500 MILES. HAD TO ADD ANOTHER QUART OF OIL. DEALERSHIP SAID THIS RATE OF OIL CONSUMPTION WAS NORMAL, HOWEVER I INSISTED ON AN OIL CONSUMPTION TEST. HAVING TO ADD OIL THREE TIMES IN 9000 MILES FOR A BRAND NEW CAR IS NOT NORMAL NO MATTER WHAT THE DEALERSHIP SAYS.     I HAD A 2011 SUBARU IMPREZA SPORT AND THE SAME THING HAPPENED.  I ACTUALLY RAN MYSELF OUT OF OIL AND THE CAR STALLED GOING 45 MILES AN HOUR DOWN THE FREEWAY.  I LIMPED IT TO THE DEALERSHIP AND THEY SAID I MUST HAVE HAD A MAJOR OIL LEAK.  MY GARAGE WAS AND IS CLEAN OF ANY SIGNS OF AN OIL LEAK. I WAS NOT EVEN DUE FOR AN OIL CHANGE WHEN THE CAR STALLED AND WAS OUT OF OIL.  I TRADED THE 2011 IMPREZA SPORT FOR A 2014 IMPREZA SPORT BECAUSE I THOUGHT THE 2011 MUST HAVE BEEN A LEMON. IT IS EXPENSIVE TO KEEP HAVING TO ADD SYNTHETIC OIL TO A BRAND NEW CAR BETWEEN OIL CHANGES TO KEEP IT RUNNING, AND I TRADED IN A CAR WITH NO CAR PAYMENT TO GET ANOTHER CAR WITH THE SAME ISSUE.  YET, I SEE THERE IS STILL NO RECALL FOR EITHER THE 2011 OR 2014.  SOMEONE ELSE IS GOING TO HAVE TO STALL AT HIGH SPEEDS AND CRASH BEFORE ANYTHING IS DONE BY SUBARU TO ADDRESS AND CORRECT THE PROBLEM, APPARENTLY.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/26/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669025,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 SUBARU IMPREZA.  CONSUMER WRITES IN REGARDS PEDAL ISSUE. *SMD  THE CONSUMER STATED HER FOOT BECAME STUCK UNDER THE ACCELERATOR PEDAL AND SHE CRASHED INTO THE GARAGE DOOR. IT WAS DETERMINED, HER SHOE BECAME CAUGHT IN A PLASTIC PIECE TO THE RIGHT OF THE ACCELERATOR PEDAL.  *JB",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/08/2015",
        "dateOfIncident": "12/12/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671205,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING LIGHT FLASHES FOR 30 SECONDS THEN STAY ON. CHECKED TIRE PRESSURE. ALL WERE GOOD.  *TR",
        "vin": "JF1GPAL66E8"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/09/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658465,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 SUBARU IMPREZA FELT AN UNUSUAL WIND PROBLEM WITH IT BEING VERY UNPREDICTABLE MAKING IT UNSTABLE. *TA  THE DEALER INFORMED THE CONSUMER, IT WAS A CHARACTERISTIC OF THE VEHICLE. *JB",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653289,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 SUBARU IMPREZZA. CUSTOMER IS CONCERNED ABOUT THE HEAD RESTRAINTS REGULATIONS AND THINKS THEY SHOULD BE MODIFIED. *CW  THE CONSUMER STATED THE HEAD RESTRAINTS, WERE OVERLY RESTRICTIVE, UNNECESSARY BAD FOR DRIVER'S POSTURE, AND DEVASTATING TO SHORTER PEOPLE AND OTHERS WITH EXISTING PR POTENTIAL SHOULDER, BACK AND NECK PROBLEMS. THE CONSUMER STATED DRIVING 30 MINUTES OR LESS SHE EXPERIENCED CONSIDERABLE NECK PAIN AND SHOULDER PROBLEMS, WHICH HAVE CONTINUED TO WORSEN. *JB",
        "vin": "JF1GPAL62E9"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "11/10/2014",
        "dateOfIncident": "11/07/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653860,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR UNEXPECTEDLY ACCELERATED IN A REMOTE AREA OF A PARKING LOT IN A MALL. WENT OVER A CURB, CROSSED A GRASSY AREA AND STRUCK A TREE. DRIVER INDICATES THAT BRAKES WERE APPLIED TO NO AVAIL. REAR DRIVING WHEELS WERE DEPRESSED INTO THE GROUND AFTER THE CAR WAS STOPPED BY THE TREE, INDICATING THE POSSIBILITY THAT THE CAR WAS STILL ACCELERATING AFTER IT WAS STOPPED BY THE TREE.  *TR",
        "vin": "JF1GJAH65EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "03/25/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652902,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK OIL LIGHT FIRST CAME ON AT 2500 MILES, HAD TO ADD A QUART OF OIL AND ALSO GOT A COMPLETE OIL CHANGE. HAD TO ADD ANOTHER 1/2 QUART OF OIL AT 6000 AND ANOTHER ONE AGAIN AT 9000 DUE TO CHECK ENGINE LIGHT COMING ON. AT 2500, DEALERSHIP SAID THIS OIL CONSUMPTION RATE WAS NORMAL. AT 9000, DURING ANOTHER MINOR SERVICE, WAS AGAIN TOLD MY CURRENT RATE OF OIL CONSUMPTION WAS NORMAL. HOWEVER, HAVING TO ADD OIL THREE TIMES IN 9000 MILES FOR A BRAND NEW CAR DOESN'T SEEM SAFE.   *TR",
        "vin": "JF1GPAL64E9"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639778,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED THE CAR ON THE SIDE OF THE ROAD ON A LARGE PULL OUT AREA.  I PUT THE CAR IN REVERSE, TURNED THE OFF AND TOOK THE KEYS OUT OF THE IGNITION AND GOT OUT OF THE CAR TO TAKE SOME PICTURES OF THE FALL COLORS.  I WAS OUT OF THE CAR FOR ABOUT 3 TO 5 MINUTES AND I LOOK BACK TO SEE THE CAR ROLLING DOWN THE SLOPE IN TO A TRUCK THAT WAS PARKED IN THE SAME AREA.  WHEN  I GOT BACK INTO THE CAR THE TRANSMISSION WAS IN NEUTRAL.  THE HOOD AND FRONT BUMPER WAS DAMAGED.  *TR",
        "vin": "JF1GPAL61EG"
    },
    {
        "components": "SUSPENSION,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/08/2014",
        "dateOfIncident": "07/30/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10620908,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER WAS PARKING VEHICLE IN A PARKING LOT WHEN IT SUDDENLY ACCELERATED FORWARD, CROSSING PARKING BARRIER, BUSHES IN PLANTING AT EDGE OF LOT,  AND SIDEWALK HITTING A PARKED CAR. DRIVER STATES THAT BRAKE WAS DEPRESSED AT TIME OF INCIDENT.  *TR",
        "vin": "JF1GPAS60E8"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604863,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. THE CONTACT STATED THAT AFTER PARKING THE VEHICLE AND TURNING IT OFF, THE VEHICLE ROLLED DOWN AN EMBANKMENT AND CRASHED. THE CONTACT TURNED THE VEHICLE OFF,  AND WAS ABLE TO REMOVE THE KEY FROM THE IGNITION SWITCH WHILE THE SHIFTER WAS STILL IN DRIVE. THE VEHICLE WAS DESTROYED. THERE WERE NO INJURIES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 1,073.",
        "vin": "JF1GJAD61EH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "05/09/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588015,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU IMPREZA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 70 MPH, THE ENGINE SUDDENLY STALLED. THE VEHICLE RESTARTED IMMEDIATELY AND RESUMED IN NORMAL OPERATION. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 424. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/30/2014",
        "dateOfIncident": "04/29/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585771,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "AVID",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "HIT SMALL POT HOLE WHICH OTHER CARS WERE DRIVING OVER WITH NO FAILURES. I CALLED SUBARU ROADSIDE ASSISTANCE. THEY PUT DONUT FLAT ON.    *JS",
        "vin": "JF1GPAL66E8"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/06/2014",
        "dateOfIncident": "02/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577808,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE MONTH OF JANUARY 2014 I HAD A FEW QUESTIONABLE INCIDENTS THAT HAPPENED PULLING IN TO VARIOUS PARKING SPACES, WHETHER IT WAS THE SUPERMARKET OR THE SCHOOLS WITH WHICH MY CHILDREN ATTEND AND THAT I WORK. I DIDN'T THINK ANYTHING OF IT AS THIS IS A NEW CAR AND IT SHOULD WORK PERFECTLY.   THE WEEK OF FEBRUARY 17TH  THIS WAS THE MOMENT I KNEW I WASN'T IMAGINING THINGS,  MY FIRST MOMENT OF COMPLETE PANIC AS MY BRAND NEW CAR UNINTENDED ACCELERATED TOWARD MY GARAGE. I HAD JUST DROPPED OFF MY CHILD AND A NEIGHBORS CHILD AT SCHOOL. WE CARPOOL TO HELP EACH OTHER OUT. I APPLIED AS MUCH PRESSURE I COULD TO BRAKE THAT CAR. I KNEW AT THIS MOMENT IT WASN'T ME AND THAT I SHOULD HAVE TAKEN MORE NOTICE AND ACTION IN JANUARY.   MARCH 7TH  IT WAS JUST ANOTHER TYPICAL DAY OF DRIVING MY AND MY NEIGHBORS' CHILDREN  TO AND FROM SCHOOL. WE HAD MY SON'S FRIEND IN THE CAR, BOTH ARE ONLY 9/8 YEARS OF AGE, MY DAUGHTER, 11, HAD HER FRIEND IN THE CAR. WE WENT FROM THE LIBRARY DROPPED OFF MY SON'S FRIEND AND PROCEEDED HOME. WE WERE ALL LAUGHING AND HAVING A GOOD TIME AS WE PULLED IN TO THE  DRIVEWAY. ALL OF SUDDEN THE CAR HAD AN UNINTENDED ACCELERATED MOMENT AND RACED TOWARD THE GARAGE. ONCE THE VEHICLE FINALLY STOPPED THERE, WAS COMPLETE DEAD SILENCE. SKID MARKS ON MY DRIVEWAY. I IMMEDIATELY WENT IN TO CALL THE DEALERSHIP TO INFORM AND FIND OUT WHAT TO DO.  MARCH 14TH  LOADED 2 DOGS IN TO THE CAR TO GO TO THE PARK. AS WE BACKED OUT I SAW THE OTHER TWO AND DECIDED IT WOULD BE A FAMILY AFFAIR. WE HAVE 4 LABRADORS. SO AS I PULLED BACK IN TO THE DRIVEWAY AND AS WE (THE DOGS AND I) PULLED IN, THE CAR AGAIN ACCELERATED TOWARDS THE GARAGE. AT THIS POINT I CALLED THE DEALERSHIP AGAIN AND SAID THAT IT HAS HAPPENED AGAIN. STILL THEY CAN'T FIND ANYTHING WRONG AND EVEN CAME AND DROVE IT AT MY HOUSE WITH THE CAR COMPUTER ATTACHED TO A LAPTOP. WE DROVE IN AND OUT OF OUR DRIVEWAY 2 TIMES.   *TR",
        "vin": "JF1GPAR64EH"
    }
]