[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277308,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 THOR CHALLENGER 37K. WHILE INSIDE THE RV, THE CONTACT ATTEMPTED TO OPEN THE DOOR; HOWEVER, THE DOOR FAILED TO UNLOCK. THE CONTACT HAD TO DRIVE THE RV TO THE DEALER (EXIT 1 RV, FAIRHAVEN, VERMONT) WHERE THE DOOR WAS REMOVED IN ORDER FOR THE CONTACT TO EXIT THE RV. THE DEALER REMOVED THE LATCH LOCK FROM THE DOOR OF THE RV; HOWEVER, THEY DID NOT HAVE A REPLACEMENT FOR THE DOOR LATCH AT THAT TIME. THE RV WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 25,000. THE VIN WAS UNKNOWN.",
        "vin": "1F66F5DY6D0"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/09/2018",
        "dateOfIncident": "12/05/2014",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100686,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I TOOK DELIVERY OF OUR THOR RV AT 7PM ON 12/05/14 WITHOUT THE BENEFIT OF EVER BEING ALLOWED TO TEST DRIVE THE RV. MANY EXCUSES BY CAMPING WORLD.  LEFT DEALER AND DROVE 300 YEARS ON NEARBY SURFACE ROAD AND BRAKED TO JOIN ENTRANCE RAMP TO INTERSTATE 75. BRAKES FAILED BECAUSE 3 POUND, RIGID 4 FOOT VINYL-CLAD, WOODEN FRAME COVERING HAD DISLODGED FROM THE ELECTRIC OVERHEAD BUNK FRAME AND DROPPED TO THE DRIVER'S FLOOR BEHIND BRAKE AND GAS PEDALS. COULD NOT SLOW COACH FROM 35MPH BUT FORCED TO THE SHOULDER OF ROAD UNDER OVERHEAD INTERSTATE EXCHANGE.  TO STOP RV, DRIVER HAD TO DOWNSHIFT, THEN PLACE RV INTO NEUTRAL AND EVENTUALLY ENGAGE EMERGENCY BRAKE AS RV CAREENED TO A STOP ON GRASSY SHOULDER JUST BEFORE SPLASHING INTO A 2 ACRE, 6 FOOT DEEP WATER COLLECTION POND AT HIGHWAY EXIT. CAMPING WORLD STORE HAD CLOSED BUT WE DROVE BACK ANYWAY TO SEE IF WE COULD GET HELP.  NO ONE WAS AVAILABLE. AT LEAST TWO COACH STEEL BRACE COVERS  RISING FROM THE CAB FLOOR HAD BEEN PREVIOUSLY HELD IN PLACE WITH HOOK-AND-LOOP CLOSURE (VELCRO) FROM THE THOR FACTORY. VELCRO ADHESIVE HAD MELTED AND FLOOR SUPPORT COVERS DISLODGED ONCE COACH WAS DRIVEN AWAY FROM LOT. COACH HAD BEEN ON DEALER'S LOT FOR 12 MONTHS BEFORE OUR PURCHASE. EXCESSIVE HEAT AND HUMIDITY DEGRADED VELCRO ABILITY TO HOLD THE THREE POUND FRAME PROTECTION IN PLACE. REPORTED ISSUE TO RV DEALER AND THEY ATTEMPTED REPAIR. REPAIR NOT ACCEPTABLE.  OWNER DRILLED THROUGH VINYL COVER AND WOOD STRUCTURE INTO STEEL BRACE TO SECURE BRACE COVER. INSTALLED VINYL BUTTONS FOR DRESS.  SCARY, SCARY EPISODE.    ALL THOR COACHES MUST BE INSPECTED - DEATH OR INJURY COULD OCCUR.  VELCRO TAPES MUST BE REPLACED WITH VALID FASTENERS.",
        "vin": "1F66F5DYXE0"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/23/2016",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909412,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN HEAVY RAIN AT HIGHWAY SPEED MY WIPERS WENT ALL THE WAY TO THE DRIVER'S SIDE OF THE WINDSHIELD, AND STOPPED THERE. THOR ONCE REPLACED THEM BUT ABOUT A YEAR LATER THE NEW WIPER ASSEMBLY DID THE SAME THING UNDER THE SAME CONDITIONS. THROUGH ONLINE FORUMS I KNOW THAT SEVERAL OTHERS WITH THE SAME MODEL MOTOR HOME HAVE EXPERIENCED THE SAME OCCURRENCE. I CAN SUPPLY THEIR NAMES.",
        "vin": "1F66F5DY0D0"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/04/2016",
        "dateOfIncident": "09/15/2013",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872519,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "THOR",
                "productModel": "CHALLENGER",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER WIPER COMES LOOSE AT SPLINE AND FALLS BELOW WINDSHIELD.  THIS HAPPENS WHEN TRAVELING AND WIPERS ARE IN USE.",
        "vin": "1F66F5DY3D0"
    }
]