[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "02/02/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122679,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 34,000 MILES WHILE IN A DRIVING TO WORK I STARTED HEARING A KNOCKING NOISE  BY THE TIME I MADE THE 5 MILE JOURNEY TO WORK THE KNOCKING HAD GOTTEN SO BAD, THAT I HAD TO HAVE IT TAKEN TO THE DEALERSHIP.  THE OIL WAS JUST CHANGED AT THE DEALERSHIP TWO DAYS BEFORE AND WAS STILL FULL. THEY SUBARU DEALERSHIP WOULD NOT WARRANTY THE MAIN BEARING OR ROD KNOCK FAILURE THAT OCCURRED.  WHEN I CONTACTED SOA, THEY WERE ALSO NOT ABLE TO HELP. THE DEALERSHIP QUOTED ME ROUGHLY $7,800.00 TO COVER A COMPLETELY NEW SHORT BLOCK.  I ONLY HAD THE CAR FOR 3 MONTHS.  THIS SEEMS TO BE A REOCCURRING ISSUE WITH MY MODEL OF WRX.  I HAD TO SHELL OUT MORE THAN $8,000.00 TO REPLACE THE ENGINE WITH BETTER MORE RELIABLE PARTS BY A PRIVATE PARTY, BECAUSE I DID NOT TRUST THE DEALERSHIPS OR SOA.",
        "vin": "JF1GR7E6XEG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "09/04/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044036,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH THROW OUT BEARING PREMATURE FAILURE (ALSO KNOWN AS RELEASE BEARING).  REPLACED TOB AT APPROX 16,000 MILES, 33,000 AND 44,000 MILES.  THE CAR IS NOW ON IT'S 4TH THROW OUT BEARING WITH 46,000 MILES AND THE BEARING IS ALREADY MAKING NOISE AGAIN.  THE SYMPTOM IS A CHIRPING BEARING SOUND WHEN THE CLUTCH IS PUSHED PARTIALLY OR FULLY TO THE FLOOR, AND AGAIN WHEN YOU START TO LET THE CLUTCH BACK OUT.  THE NOISE GOES AWAY WHEN THE CLUTCH PETAL IS OUT (NOT IN USE).  THIS HAPPENS WHETHER THE CAR IS STATIONARY OR IN MOTION.  THE SOUND GOES AWAY AFTER THE CAR HAS BEEN DRIVEN A FEW MILES, BUT HAPPENS EVERY TIME THE CAR IS DRIVEN AFTER IT'S BEEN SITTING FOR A WHILE (LONG ENOUGH TO COOL DOWN).  EVEN THOUGH IT SEEMS LIKE THIS IS NOT A SIGNIFICANT PROBLEM BECAUSE THE NOISE GOES AWAY AFTER YOU DRIVE A FEW MILES, EVERY TIME I HAVE HAD THE TRANSMISSION REMOVED SO THE CLUTCH CAN BE INSPECTED THE THROW OUT BEARING SHOWS SIGNIFICANT WEAR AS WELL AS THE FINGERS ON THE PRESSURE PLATE.  THE CLUTCH PLATE ITSELF AND FLYWHEEL SHOW ONLY NORMAL WEAR, BUT THE THROW OUT BEARING FAILURE IS CHRONIC AND REOCCURRING (IT'S HAPPENED WITH FOUR BEARINGS NOW ON THIS CAR).  I BELIEVE THAT IF THE THROW OUT BEARING WAS NOT REPLACED AT THE FREQUENCY THAT I REPLACED IT, IT WOULD LEAD TO SIGNIFICANT DAMAGE TO THE ENTIRE CLUTCH ASSEMBLY AND POSSIBLY TRANSMISSION.  SUBARU PAID FOR THE FIRST TWO REPAIRS, BUT NOT THE MOST RECENT ONE.  AT THIS POINT I THINK IT IS A MANUFACTURER DEFECTIVE PART (THE THROW OUT BEARING) - BUT SUBARU IS NOT TAKING RESPONSIBILITY AND I HAVE VERY LITTLE OPTIONS OTHER THAN PAYING FOR A $1,500 REPAIR (ALL LABOR FOR A $50 PART - THAT'S RIGHT - THE TOB IS ONLY A $50 PART) EVERY 10,000-15,000 MILES.  THAT'S A HELL OF A MAINTENANCE SCHEDULE.",
        "vin": "JF1GV7F62EG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885144,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE EXPERIENCED ROD BEARING FAILURE ON TWO ROD BEARINGS. WAS TRAVELING DOWN HIGHWAY WHEN ENGINE DIED. COASTED OFF OF THE HIGHWAY AND STOPPED. WHEN TRYING TO RESTART THE VEHICLE, THE ENGINE WAS HARD TO TURN OVER, AND KNOCKED WHILE RUNNING AFTER IT STARTED.",
        "vin": "JF1GR7E60EG"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2015",
        "dateOfIncident": "09/26/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777875,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DEPRESSING THE CLUTCH OR BRAKE PEDAL IN THE VEHICLE I SEE EXCESSIVE FLEX AT THE FIREWALL AND NOTICEABLE MOVEMENT OF BREAK AND CLUTCH CYLINDERS. MY SPOT WELDS DO NOT APPEAR BROKEN AT THIS TIME HOWEVER THEY ARE LIKELY TO FATIGUE AND BREAK. THIS APPEARS TO BE A MAJOR DEFECT WHICH IS A SAFETY CONCERN AS IT AFFECTS BREAKING AND SHIFTING. SUBARU SHOULD BE HELD ACCOUNTABLE AND CORRECT THE PROBLEM.",
        "vin": "JF1GV7F61EG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616858,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 SUBARU WRX.  THE CONTACT STATED THAT WHILE DRIVING IN STOP AND GO TRAFFIC, THE BRAKES FAILED TO RESPOND.  THE VEHICLE WAS TAKEN TO A INDEPENDENT MECHANIC, WHO REPAIRED THE VEHICLE.  THE CONTACT WAS UNAWARE OF THE EXACT REPAIRS MADE TO THE VEHICLE. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "JF1GV7F65EG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "01/21/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561915,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN *EXTREMELY* COLD WEATHER - BELOW OF - THE VEHICLE WILL START SUCCESSFULLY HOWEVER THE STABILITY/TRACTION CONTROL, ANTI-LOCK BRAKES, AND \"HILL-ASSIST\" (PART OF THE ABS SYSTEM) TROUBLE INDICATOR LIGHTS WILL LIGHT AND STAY LIT.     BASED ON THE INSTRUCTION MANUAL IF THIS OCCURS, I SHOULD CYCLE THE IGNITION TO SEE IF THE CODE CLEARS. THIS IS AN UNACCEPTABLE SOLUTION BECAUSE THE CAR'S BATTERY IS ALREADY EXTREMELY STRESSED DUE TO THE COLD TEMPERATURE AND MAY NOT RESTART THE VEHICLE. HOWEVER, ON ONE OCCURRENCE I DID CYCLE THE IGNITION AND THE PROBLEM REMAINED.     WHILE I RECOGNIZE THAT A MORE VICIOUS BRAKE FLUID IS NEEDED IN A PERFORMANCE VEHICLE OF THIS TYPE, IF THE ABS PUMP'S ORIFICES WERE LARGER THIS ISSUE MIGHT NOT OCCUR. THE OTHER POSSIBILITY IS THE BRAKE FLUID USED DURING ASSEMBLY IS ALREADY SUPERSATURATED WITH MOISTURE AND THE COLD TEMPS ALLOWED THE SUSPENDED WATER TO FALL OUT OF SUSPENSION AND FREEZE IN THE HYDRAULIC LINES.    VEHICLE WAS SAFE TO DRIVE, THE BRAKE'S MECHANICAL ACTION WAS UNAFFECTED BY THE FAULT. THE BRAKE AND CLUTCH PEDALS (WHICH I BELIEVE TO USE THE SAME FLUID) IT DID FEEL LIKE I WAS PUSHING THROUGH MUD.     I DID CONFIRM THE ABS WAS NOT FUNCTIONAL.  *TR",
        "vin": "JF1GR7E66EG"
    }
]