[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454872,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2014 Toyota Sienna (as indicated by VIN number) and I currently reside in the United Kingdom on US military orders. After getting notice from the NHTSA about the fact that my vehicle had an open recall I contacted my local Toyota dealership here in the UK. I was able to have the affected parts replaced after they were shipped from the US. However, the UK Toyota dealership has been unable to update the NHTSA database due to being outside the US. We have been trying to correct this issue through Toyota and the NHTSA for well over a year but no progress has been made. I have paperwork that shows the recall work was carried out. Please help me figure out how to get this updated. My family has received orders to return to the US but we are unable to ship our vehicle with an open NHTSA recall.",
        "vin": "5TDKK3DC9ES"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430733,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Toyota Sienna. The contact stated that while attempting to turn the vehicle to the left or to the right, there was a grinding sensation in the steering column. The contact stated that the vehicle felt as if it was losing traction. There was no warning light illuminated. The contact had not taken the vehicle to the dealer. The vehicle was not diagnosed or repaired. The manufacturer was not made aware of the failure. The approximate failure mileage was 125,000.",
        "vin": "5tdxk3dc1es"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407223,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE REAR DOOR DOES NOT OPEN PROPERLY ALL THE TIME,  IT JAMS PARTIALLY OPEN.  THE CAR IS STATIONARY AND NOT MOVING.",
        "vin": "5TDYK3DC4ES"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405752,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT THE SPARE TIRE CARRIER CABLE WAS RUSTED. THE CONTACT WAS CONCERNED THAT THE TIRE COULD DETACH FROM VEHICLE AND CAUSE AN ACCIDENT. THE VEHICLE WAS TAKEN TO JOSEPH AIRPORT TOYOTA (1180 W NATIONAL RD, VANDALIA, OH 45377, (937)898-8060) WHERE THE VEHICLE WAS INSPECTED AND THE CONTACT WAS INFORMED THAT THE SPARE TIRE CARRIER ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND THE CONTACT WAS REFERRED TO THE DEALER FOR ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 111,423.",
        "vin": "5TDKK3DC4ES"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390594,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SEATBELT ON MY WIFE'S CAR STOPPED FUNCTIONING AND WILL NOT LATCH. NOTHING APPEARS TO BE STUCK IN IT. LOOKING INSIDE THE FEMALE PART, IT LOOKS LIKE IT HAS COME APART. THE VEHICLE HAS NEVER BEEN IN AN ACCIDENT. THE DEALER CANNOT EXPLAIN WHY IT BROKE.",
        "vin": "5TDJK3DC9ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386865,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS GETTING INTO THE VAN VIA THE DRIVER SIDE SLIDING DOOR. HIS BACKPACK BUMPED THE SENSOR, AND THE DOOR OPENED AND FROZE HALFWAY OPEN. I DISENGAGED THE AUTOMATIC OPENING, BUT THE DOOR HAD DIFFICULTY CLOSING. I NOTICED THAT THE CABLE TO THE SLIDING DOOR HAD SNAPPED. I WAS EVENTUALLY ABLE TO CLOSE THE DOOR, BUT NOW THE DOOR WILL NOT OPEN AT ALL.",
        "vin": "5TDDK3DC6ES"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382904,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 15TH AT APPROXIMATELY 3:30 PM (CT) MY 2014 TOYOTA SIENNA WAS PARKED IN MY DRIVEWAY WITH THE ENGINE ON, UNATTENDED, WHEN IT MOVED FORWARD UP THE SLIGHT INCLINE OF MY DRIVEWAY, STRUCK ANOTHER VEHICLE THAT WAS PARKED IN THE GARAGE AND KEPT MOVING FORWARD UNTIL IT STRUCK THE FRONT WALL OF THE GARAGE.  PRIOR TO THE ACCIDENT, I HAD REVERSED THE VAN OUT OF THE GARAGE AND LEFT THE VAN IGNITION ON AND IN PARK AS I EXITED.  I KNOW FOR CERTAIN THAT THE VAN WAS IN THE PARK POSITION SINCE THE AUTOMATIC LOCKS LET ME EXIT THE VEHICLE WITHOUT HAVING TO MANUALLY UNLOCK THEM AND THE ALARMS DID NOT SOUND AS I EXITED.  THE VAN ALSO DID NOT ROLL FORWARD IR BACKWARD AS I EXITED.  I THEN WALKED IN FRONT OF THE VAN TO ENTER MY HOUSE THROUGH THE GARAGE.  I WAS IN THE HOUSE FOR LESS THAN 5 MINUTES WHEN I HEARD THE LOUD CRASH OF THE VAN STRIKING THE GARAGE WALL.  MY TOYOTA SIENNA WAS MANUFACTURED ON JUNE 6, 2014.  AFTER THE ACCIDENT I DISCOVERED THERE IS AN ACTIVE RECALL (RECALL: TRANSMISSION SHIFT CABLE/ROLLAWAY/FMVSS 102) FOR AN ISSUE THAT CAUSES ROLLAWAYS EFFECTING CARS MANUFACTURED BETWEEN JUNE 17, 2014 THROUGH JUNE 24, 2014.  I TOOK MY VAN TO TOYOTA EXPECTING MY ISSUE TO BE RELATED TO THIS RECALL.  TOYOTA HAD THE BLACK BOX INSPECTED AND THE TRANSMISSION INSPECTED AND DETERMINED THEY WERE NOT LIABLE SINCE THEY WERE NOT ABLE TO REPLICATE THE ISSUE AND DID NOT FIND ANY DEFECTS.  WHEN I TOOK MY CAR IN ORIGINALLY THE TECHNICIAN STATED THAT THERE WAS NOT A GOOD WAY TO DETERMINE IF THE SHIFT CABLE WAS DEFECTIVE AND THEY WERE SIMPLY REPLACING THE PART AS PART OF THE RECALL, WHICH MY CAR DID NOT QUALIFY FOR SINCE IT WAS MANUFACTURED 11 DAYS PRIOR.  A CAR SHOULD NEVER MOVE ITSELF FROM THE PARK POSITION AND SOMETHING HAS TO BE FAULTY WITH THE CAR IN ORDER FOR IT TO DO SO.",
        "vin": "5TDYK3DC5ES"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337754,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "3 TIMES THIS YEAR, WHEN SLOWING TO A STOP WITH MY FOOT ON THE BRAKE, THE CAR SUDDENLY ACCELERATED, REQUIRING ME TO APPLY AS MUCH BRAKE PEDAL PRESSURE AS I COULD, AS WELL AS SHIFTING TO NEUTRAL TO STOP THE CAR.  THIS HAS OCCURRED ONCE WHEN COMING UP TO A STOP SIGN, AND TWICE WHILE PULLING INTO A PARKING SPACE.  BOTH TIMES WHEN PULLING INTO THE PARKING SPACE, I WAS BARELY ABLE TO STOP IN TIME, ALMOST HITTING A CAR IN THE SPACE IN FRONT OF ME.  AFTER THE LAST TIME THIS OCCURRED (7/3/2020), THE CAR WAS TAKEN TO ST. CHARLES TOYOTA ON 7/6, WHERE THEY FOUND NOTHING WRONG WITH THE VEHICLE.  THIS STARTED JUST THIS YEAR; THE VEHICLE HAS APPROX. 70,000 MILES ON IT. WE HAVE OWNED THE VEHICLE SINCE NEW - IT DID NOT DO THIS FOR THE FIRST 4.5 YEARS OF SERVICE.",
        "vin": "5TDKK3DC3ES"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "11/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330552,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE), HOWEVER THE FAILURE RECURRED. THE CONTACT STATED WHILE STOPPED, THE DRIVER'S SIDE REAR DOORS FAILED TO LOCK SECURELY. ON SEVERAL OCCASIONS THE DOORS WERE UNABLE TO BE UNLOCKED FROM INSIDE OR OUTSIDE OF THE VEHICLE. THE CONTACT STATED THE DOORS WOULD UNLOCK WHILE DEPRESSING THE UNLOCK BUTTON ON THE DASHBOARD. THE VEHICLE WAS TAKEN TO TOYOTA OF SCRANTON LOCATED AT 3400 N MAIN AVE, SCRANTON, PA 18508, WHERE THE VEHICLE WAS DIAGNOSED AND THE CONTACT WAS INFORMED THAT AN UNKNOWN PART NEEDED TO BE REPLACE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "5TDJK3DC0ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316311,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/20/19 IN MY 2014 TOYOTA SIENNA THE SLIDING DOOR NEXT TO MY 3 YEAR OLD OPENED WHILE I WAS DRIVING. I WAS IN THE MIDST OF ACCELERATING AFTER A LIGHT TURNED GREEN WHEN THE CAR STARTED NOTIFYING ME THAT A DOOR WAS AJAR AND THE PASSENGER-SIDE SLIDING DOOR STARTED OPENING. THE DOOR OPENED FULLY AND REMAINED OPEN AS I WAS AT SPEED IN THE MIDDLE OF AN INTERSECTION.    NOTE THAT ALL DOORS WERE CLOSED AND LATCHED BEFORE I PUT THE VEHICLE IN DRIVE, AND THIS ONLY OCCURRED AFTER A FEW MILES OF DRIVING. I TOOK THE CAR TO THE DEALERSHIP AND THEY REPLACED THE LATCH ASSEMBLY IN BOTH SLIDING DOORS. THE DEALERSHIP COULDN'T TELL ME WHAT FAILED OR IF THE REPLACED LATCHES WOULD SOLVE THE PROBLEM, SO I CALLED TOYOTA CORP. I LEARNED THAT TOYOTA ALREADY KNEW ABOUT THIS ISSUE. WHEN I ASKED IF THEY COULD ASSURE ME THAT THE SLIDING DOORS WOULDN'T OPEN WHILE DRIVING AGAIN, THEY COULDN'T. THEY TOLD ME THAT THEY COULDN'T CONFIRM THAT THE LATCHES WERE THE PROBLEM, AND WHILE THE REPLACEMENT LATCH HAS A DIFFERENT MODEL NUMBER THAN THE ORIGINAL, THEY DON'T KNOW IF IT IS IN FACT A DIFFERENT PART AND IF SO, HOW. THE ONLY ASSURANCE THAT TOYOTA COULD GIVE ME IS THAT 'OF THE PEOPLE IN YOUR REGION THAT THIS HAS HAPPENED TO, IT HASN'T HAPPENED A SECOND TIME THAT WE KNOW OF'. THE MORE QUESTIONS I ASKED, THE CLEARER IT BECAME THAT THIS COULD HAPPEN AGAIN.    PLEASE NOTE THAT THIS ISSUE IS ENTIRELY DIFFERENT FROM THE '16 RECALL THAT INVOLVED SLIDING DOORS OPENING WHILE DRIVING (ALL ASSOCIATED RECALLS HAD BEEN PERFORMED BY TOYOTA DEALERSHIPS PRIOR TO THIS INCIDENT). WE HAD NOT PREVIOUSLY REPORTED THIS TO NHSA AS WE HAD ASSUMED THAT TOYOTA REPORTED THIS INCIDENT AS PART OF OUR CASE WITH THEM.",
        "vin": "5TDJK3DC2ES"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311595,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY WHEN FROM A STOP OR AFTER SLOWING DOWN AND THEN ACCELERATING RAPIDLY, THE CAR DOES NOT DO ANYTHING AND ALMOST GETS REAR ENDED.  I HAVE TOLD THE DEALER AND THEY SAID IT IS NO UNUSUAL WITH TOYOTA'S..... DALLAS CORPORATE SAYS SEE DEALER.  I JUST QUITE COMPLAINING AFTER A COUPLE YEARS, BUT WAS TOLD TO CHECK WITH YOU. MOST EVERY THING ELSE I LIKE ABOUT TOYOTA...",
        "vin": "5TDKK3DC6ES"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311383,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. WHILE DRIVING 15 MPH THE BRAKE PEDAL WAS APPLIED HOWEVER DEPRESSED TO THE FLOORBOARD, THE VEHICLE ACCELERATED AND SURGE FORWARD WITHOUT WARNING. THE CONTACT SHIFTED INTO NEUTRAL AND TURNED THE IGNITION TO THE OFF POSITION. THE VEHICLE WAS TOWED TO ROMANO TOYOTA 6400 BASILE ROWE, EAST SYRACUSE, NY 13057(315) 445-1070, WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE OPERATED AS DESIGNED. THE VEHICLE WAS DIAGNOSED BUT NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 78,929. *BF*JB",
        "vin": "5TDKK3DC9ES"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309860,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING HAPPENED TO THE VEHICLE, BUT NORTH HOLLYWOOD TOYOTA REFUSED TO REPLACE THE AIRBAGS ( AFTER WAITING IN THEIR SERVICE DEPARTMENT FOR 5 HOURS) BECAUSE THEY SAID WE 'ALTERED' THE VEHICLE. IT IS A MOBILITY VAN PURCHASED THRU MOBILITYWORKS- WHO ADDED A RAMP FOR A WHEEL CHAIR. THE FRONT BUMPER AND DASH WERE NOT ALTERED.",
        "vin": "5TDYK3DC0ES"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309306,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BEFORE THE VEHICLE COMES TO A FULL STOP, THERE IS UNINTENDED ACCELERATION AND I COULD SEE EVEN THE RPM(SCALE) TO SPIKE TEMPORARILY. THIS HAS BEEN HAPPENING EVERY TIME WHEN OUTSIDE TEMP IS COLD AND VEHICLE IS DRIVEN WITH COLD OR SLIGHTLY ABOVE COLD ENGINE TEMPERATURE. THERE IS A RISK OF HITTING ANOTHER VEHICLE OR MEETING ACCIDENT IF MISJUDGE MY BRAKING BECAUSE OF THIS PROBLEM. HOWEVER IT DOES IT EVEN ON HIGHWAY UNDER NORMAL TEMPERATURE WHILE I'M BRAKING OR SLOWING DOWN.",
        "vin": "5TDKK3DCXES"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ABOUT 60,000 MILES MY CHECK ENGINE LIGHT ILLUMINATES WITH CODE P0012 EVERY 1,000 MILES AND WHEN I TAKE IT TO TECHNICIAN THEY FIND NOTHING WRONG AFTER RESETTING.  THEN AGAIN IT RANDOMLY APPEARS AND HAS BEEN DOING SUCH FOR THE LAST 10,000 MILES.  FRUSTRATING.    ALSO THE FRONT BRAKES SQUEAL EVERYTIME I TOUCH THE BRAKE PEDAL REGARDLESS OF WHICH PADS I USE OR IF THEY ARE NEW OR USED.",
        "vin": "5TDYK3DC4ES"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299172,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATES WHEN TRYING TO STOP/ PRESSING BREAKS",
        "vin": "5TDKK3DC7ES"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290904,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY MINIVAN GETTING IN THE HIGHWAY WHEN IT JUST STOP RUNNING PERIOD IN THE MIDDLE OF THE ROAD. I COULD HAVE BEEN DEAD BY NOW SPECIALLY IN A HIGHWAY. LUCKILY, I WAS ABLE TO PULL TO THE SIDE VERY QUICK WHEN CAR DIED ON ME. I HAD TO PAY A TOW TRUCK TO TAKE MY VEHICLE HOME NOW TOYOTA DOES NOT WANT TO FIX IT. ALSO, SLIDING DOOR WON'T CLOSE. WHEN PRESSING DOOR BUTTON TO CLOSE, DOOR SLIDES RIGHT BACK. IT DOES NOT MAKE IT ALL THE WAY TO BE ABLE TO LOCK THE DOOR. THIS HAPPENED WHILE PASSENGER WAS GETTING IN THE VEHICLE WAS WE WERE NOT ABLE TO LOCK THE DOOR. I WAS PARKED ON THE STREET. UNFORTUNATELY, I DID NOT TAKE ANY PICTURES.",
        "vin": "5TDKK3DC1ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/03/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255564,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT THE VEHICLE'S SLIDING DOOR FAILED TO FUNCTION WHEN USING THE POWER BUTTON. THE CONTACT HAD TO MANUALLY OPEN AND CLOSE THE SLIDING DOOR FROM THE EXTERIOR HANDLE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "5TDYK3DCXES"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230729,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 65 MPH, A LOUD EXPLOSION WAS HEARD. THE CONTACT DISCOVERED THAT THE SUN ROOF EXPLODED. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO HOOVER TOYOTA (2686 JOHN HAWKINS PKWY, HOOVER, AL 35244) TO BE REPAIRED. THE CAUSE OF THE FAILURE WAS NOT DISCLOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "5TDYK3DC7ES"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222068,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY TOYOTA SIENNA VAN TO TOYOTA OF PHARR TO HAVE MY PASSENGER AIR BAG REPLACE DUE TO A RECALL. I MADE A SCHEDULE APPOINTMENT ON     AND IT WAS COMPLETED, HOWEVER, SERVICE PERSON INFORMED ME THAT I NEEDED TO HAVE MY ' CONTROL ARM ' REPLACED AS WELL. HE STATED IT IT WASN'T UNDER WARRANTY AND NO RECALL ON IT. THE COST TO HAVE IT DONE IS $2,381.07.  I ASKED HIM HOW DID THIS HAPPENED. HE STATED IT'S THE DRIVING CONDITION AND MILES. I TOLD HIM MY WIFE IS RETIRED AND HARDLY DRIVES IT AND ONLY DRIVES IT ON PAVE ROAD. ALSO, IT ONLY HAS 70,000 MILES. I TOLD GENTLEMAN THAT THAT WAS TOO MUCH MONEY. I ASKED HIM IF IT'S SAFE TO DRIVE AND SAID YES. DO, I BROUGHT IT HOME. MY WIFE AND I ARE STILL PAYING FOR OUR VEHICLE AND HOW CAN  THIS HAPPEN? CAN YOU PLEASE CHECK IF THERE IS A RECALL ON THIS PART? IF NOT, CAN TOYOTA PAY FOR IT OR AT LEAST MOST OF IT ? WE'VE PURCHASED  VEHICLES FROM TOYOTA FROM THE PAST FOR MANY MANY YEARS....PLEASE HELP US OUT. THANK YOU.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STATIONARY, THE SLIDING DOOR CABLE SNAPPED WHILE IT WAS AUTOMATICALLY OPENING AND HAS IMPEDED THE SLIDING DOOR TO EVEN OPEN MANUALLY WHICH LEADS TO SAFETY CONCERNS AS THE DOOR WILL NOT OPEN UP AS THE CABLE IMPEDES IN ITS WAY.",
        "vin": "5TDKK3DCXES"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218634,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MY 2014 TOYOTA SIENNA WAS IN MOTION ON THE HIGHWAY GOING A STEADY 75 MPH. AND THE TRAC OFF LIGHT WENT ON AND WE TRIED TURNING IT OFF LIKE WE USUALLY DO WHENEVER WE TURN IT ON ON ACCIDENT. AND AFTER A MILE DOWN THE HIGHWAY IT STARTED FUMING INTENSELY SO WE STOPPED AT A GAS STATION.",
        "vin": "5TDKK3DC9ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208740,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE CAR IN PARK AND ATTEMPTING TO OPEN THE DRIVER SIDE SLIDING DOOR, IT REFUSES TO OPEN AND STOPS ABRUPTLY DURING THE SLIDE ONLY OPENING A FEW INCHES (NOT ENOUGH TO RENDER THE OPENING USABLE) BECAUSE THE FUEL DOOR IS NOT SUFFICIENTLY CLOSED TO DEPRESS THE PUSH BUTTON THAT TELLS THE VAN'S SYSTEM THAT THE FUEL DOOR IS FULLY SHUT. THUS THE SLIDING DOOR STOPS ABRUPTLY (AS PROGRAMMED) TO AVOID A COLLISION WITH AN OPEN FUEL DOOR.  HOWEVER, THAT IS NOT THE CASE HERE. UPON FURTHER INSPECTION IT IS NOTICED THAT THE SPRING ON THE PUSH BUTTON HAS SUCH A SEVERE STIFFNESS THAT THE FUEL DOOR'S HINGE SYSTEM WAS NOT DESIGNED DURABLE ENOUGH TO COMPENSATE FOR THE OUTWARD LOAD EXERTED BY THE PUSH BUTTON WHEN THE FUEL DOOR IS CLOSED AND LOCKED. FOR THIS REASON, THE FUEL DOOR HINGE, OVER TIME, EXPERIENCES A FATIGUE FAILURE AT THE TOP OF THE HINGE ONLY. THAT IS TO SAY, THE LOWER HALF OF THE HINGE REMAINS CONNECTED AND OPERABLE WHILE THE TOP HALF OF THE HINGE SHEARS IN TWAIN. NOW SHEARED, THE FUEL DOOR IS PUSHED FREELY AWAY BY THE PUSH BUTTON AND THE TOP FORWARD MOST CORNER OF THE FUEL DOOR PROTRUDES PAST THE VAN'S PROFILE BY HALF AN INCH OR MORE.  IT IS THE FAILURE OF THE FUEL DOOR HINGE, CREATED BY THE OVERDESIGN OF THE SPRING ON THE PUSH BUTTON, THAT ALLOWS THE DOOR TO NOT OPEN PROPERLY DESPITE THE DRIVER DOING EVERYTHING TO KEEP THE PATH OF THE DOOR CLEAR.  UNFORTUNATELY, FOR EMBARKING, THIS RENDERS THE SLIDING ACCESS POINT AS DIFFICULT AS YOU HAVE TO MANUALLY PUSH AGAINST THE FUEL DOOR WHEN OPENING THE SLIDING DOOR UNTIL IT HALFWAY OPEN.  FOR DISEMBARKING THIS IS THE SAFETY HAZARD, AS THERE IS NO WAY TO \"RIG\" THE SYSTEM TO OPERATE FROM THE INSIDE AND DURING EMERGENCY EGRESS FROM THE VEHICLE. IF THE PASSENGER DOOR IS BLOCKED OR BROKEN AS THE RESULT OF A HAZARD OR CRASH, OCCUPANTS IN THE REAR OF THE VEHICLE CAN BECOME TRAPPED INSIDE BEING FORCED TO CLIMB INTO THE FRONT SEAT OR TRUNK",
        "vin": "5TDYK3DC9ES"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186128,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SIENNA MINIVAN WITH 38K MILES TOLD NEEDS 4 NEW TIRES. PURCHASED CERTIFIED PREOWNEN-21KMILES- REPORT GAVE TIRES OK- PAID $26K- TIRES ROTATED 1/2019 NO WORD OF TIRE DRY ROT- MARCH 2019 TOLD 1/4 IN TREAD AND ROT STARTING. READ CARGURUS ON LINE AND 20 PAGES OF E-MAIL REPORTS OF TIRE FAILURES AT 20-30K MILES ON SIENNAS- MULTIPLE REPLACEMENTS NECESSARY. NO DISCLOSURE OF THIS ONGOING PROBLEM BY DEALER.  THIS PRESENTS DANGER ON THE ROAD IF TIRES NOT REPLACED AND ECONOMIC HARDSHIP TO CAR OWNERS.",
        "vin": "5TDYK3DCXES"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185825,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V005000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. HAYWARD ALLEN TOYOTA (2910 ATLANTA HWY, ATHENS, GA 30606, (706) 549-7002) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDZK3DC7ES"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185032,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2014 TOYOTA SIENNA ON JULY 4TH 2017. SINCE THE DAY I PURCHASED THE VEHICLE I HAVE BEEN HAVING ELECTRICAL PROBLEMS WITH BOTH SLIDING DOORS AND THE TRUNK. TOYOTA STILL HAVEN'T FIXED THE PROBLEMS WITH THE DOORS I JUST DON'T FEE SAFE HAVING MY KIDS AND OTHER PEOPLE KIDS IN THE CAR",
        "vin": "5TDYK3DC6ES"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11184758,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEATBELT WOULD NOT RELEASE AND BECAME ONLY TIGHTER WHEN WE TRIED TO RELEASE IT. A CHILD ALMOST SUFFOCATED BECAUSE IT WAS SO TIGHT AROUND HER STOMACH THAT SHE COULD NOT BREATHE. WE HAD TO CUT THE SEAT BELT. NOW, WE ARE MISSING A SEAT BELT AND TOYOTA REFUSED TO ACKNOWLEDGE THAT IT WAS A DEFECT AND/OR REPLACE IT.",
        "vin": "5TDDK3DC7ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CABLE ON DRIVER SIDE SLIDING POWER DOOR IS DEFECTIVE.  DOOR NO LONGER FUNCTIONS PROPERLY.",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175126,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   AIRBAG WARNING LIGHT CAME ON WHILE DRIVING ON HIGHWAY. HAD DIAGNOSTIC SCAN RAN AND FOUND CODE FOR SQUIB CABLE OR CLOCK SPRING IS BAD. CAR IS ONLY FIVE YEARS OLD WITH A LITTLE OVER 60K MILES. THIS CABLE IS MANUFACTURER BUILT FOR THIS SPECIFIC VAN AND COST ALMOST $700! I CAME IN FOR A RECALL ON MY TAKATA PASSENGER AIRBAGS AND WOUND UP DROPPING MORE MONEY! I HAVE WAITED FOR ALMOST A WEEK FOR RECALL. NOW I'M WAITING LONGER FOR THIS REPLACEMENT.",
        "vin": "5TDKK3DC2ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172389,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOOR ISSUES - THIS IS A FOLLOW UP TO PREVIOUS COMPLAINTS REGARDING ISSUES I WAS HAVING WITH GETTING THE SLIDING DOORS ON MY 2014 TOYOTA SIENNA FIXED.  THE ORIGINAL RECALL DID NOT SOLVE THE PROBLEM, THE TWO WARRANTY ENHANCEMENTS DID NOT SOLVE THE PROBLEM, AND IT WAS FINALLY DETERMINED THAT THE SLIDING DOOR HINGES WERE THE PROBLEM.  I REACHED OUT TO TOYOTA MOTOR CORPORATION AFTER HAVING NO LUCK DEALING WITH THE LOCAL DEALERSHIP AND THE GENTLEMEN I WORKED WITH ON MY COMPLAINT WAS EXTREMELY HELPFUL.  WE WERE ABLE TO GET THE HINGES REPLACED ON BOTH SLIDING DOORS FOR $140 VS $758 AND THEY ARE NOW WORKING AS THEY SHOULD.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/28/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163867,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A FOLLOW UP TO AN EARLIER COMPLAINT REGARDING THE SLIDING DOORS ON MY 2014 TOYOTA SIENNA NOT CLOSING.  THEIR WAS A RECALL AND WARRANTY EXTENSIONS ISSUED.  I HAD THE RECALL ISSUE ADDRESSED, WHICH DID NOT FIX THE PROBLEM, SO AFTER SEVERAL MONTHS I WAS FINALLY ABLE TO GET THE LOCAL TOYOTA DEALER TO TAKE CARE OF THE WARRANTY EXTENSIONS ADDRESSED, AND STILL NOT FIXED.  I WAS THEN TOLD THAT UNTIL I GET THE HINGES ON THESE DOORS REPLACED THE PROBLEM WILL CONTINUE.  SO, AFTER ALL THAT, I AM TOLD THAT THE HINGES ARE THE PROBLEM!  THE WARRANTY COVERAGE PROGRAM I PURCHASED DOES NOT COVER THE HINGES (I PURCHASED ONE OF THE BEST WARRANTIES) AND THE HINGES ARE GOING TO COST ME $758.  SHOULDN'T THEIR BE A RECALL ON THE HINGES TO ADDRESS THIS PROBLEM?  I SURE AM HOPING SO.",
        "vin": "5TDYK3DC9ES"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Giti Tire (USA), Ltd.",
                "productMake": "PRIMEWELL",
                "productModel": "VALERA TOURING II",
                "productYear": "9999",
                "size": "235/60R17 102T",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA EQUIPPED WITH PRIMEWELL VALERA TOURING II TIRES, SIZE: 235/60R17. WHILE DRIVING, THE CONTACT HEARD AN ABNORMAL TICKING NOISE COMING FROM THE FRONT DRIVER'S SIDE TIRE. THE VEHICLE WAS TAKEN TO TOYOTA OF MUSCATINE (LOCATED AT 3000 N HWY 38, MUSCATINE, IA 52761) WHERE IT WAS DIAGNOSED THAT ALL FOUR TIRES HAD CRACKS AND NEEDED TO BE REPLACED. THE CONTACT CALLED FIRESTONE COMPLETE AUTO CARE AND SCHEDULED A DIAGNOSTIC APPOINTMENT. THE VEHICLE WAS NOT REPAIRED. THE TIRE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17T013000 (TIRES). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT TO CALL THE DEALER. THE APPROXIMATE VEHICLE FAILURE MILEAGE WAS 86,000. THE TIRE FAILURE MILEAGE AND VIN WERE UNKNOWN. *DT*JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162105,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPPED ABRUPTLY WITH A SHAKE WHILE REDUCING SPEED AT A TRAFFIC SIGNAL. I WAS IN THE MIDDLE OF THE ROAD. A MILD BURNING SMELL CAME OUT FROM THE HOOD. THE CAR WAS SERVICED ONE MONTH BACK AND AS PART OF IT THEY DID 128 POINT( DO NOT REMEMBER EXACT NUMBER ) AND ALL REPORTED ISSUES WERE FIXED. AROUND $1000/- WAS SPENT ON THE CAR. SINCE BATTERY WAS JUST 1 YEAR OLD, I DID NOT EXPECT A PROBLEM WITH THE BATTERY AS WELL. STILL I SWITCHED OFF ALL LIGHTS AND TRIED TO RESTART. THERE WAS NO FURTHER RESPONSE FROM THE VEHICLE. I WAS BLOCKING TRAFFIC FROM BEHIND AND POLICE CAME TO CONTROL TRAFFIC. ONLY OPTION WAS TO TOW THE VEHICLE. I TOOK IT TO THE SAME TOYOTA AUTHORIZED SERVICE CENTER WHERE I DID THE PREVIOUS SERVICE ( I HAD PURCHASED THE CAR FROM THE SAME DEALER ).  NEXT DAY TOYOTA SERVICE STAFF CALLED ME AND ASKED DETAILS OF WHAT HAPPENED. BY EVENING THEY SAID THAT SOME SPRING BREAK IN CYLINDER 4 WHICH CLOGGED AT SOME OTHER PART WITHIN THE ENGINE. IN THE PROCESS, THERE ARE SCRATCHES IN OTHER PARTS AND THE ENGINE OIL WAS FILLED WITH METAL PARTS. SENIOR TECHNICIAN SAID THIS IS A MAJOR ISSUE AND THEY HAVE INVITED TOYOTA FIELD ENGINEER TO COME AND INSPECT THE ENGINE AND ASSOCIATED ISSUES. PRELIMINARY ASSESSMENT IS THAT THE ENGINE MIGHT NEED A REPLACEMENT AS CHANGING FEW PARTS MAY NOT BE SUFFICIENT TO KEEP THE VEHICLE SAFE BACK ON STREET. INCIDENT HAPPENED IN CITY STREET AND WHEN THE SPEED WAS LOWERED TO 20. TODAY IS MONDAY, BUT TOYOTA DEALER WHO IS DOING THE SERVICE HAS NOT UPDATED ME YET WITH THE MAGNITUDE OF COMPLETE PROBLEM NOR THE TIME THEY NEED. I AM HEART BROKEN TO HEAR THAT THE ROUGH ORDER MAGNITUDE COST TO FIX THE CAR IS BETWEEN $18K TO $20K.",
        "vin": "5TDYK3DC8ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161412,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BOTH SIDES POWER SLINGING DOOR IS UNABLE TO BE OPENED AND CLOSED WHEN COMMANDED.",
        "vin": "5TDKK3DC1ES"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161231,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. WHILE DRIVING VARIOUS SPEEDS, THE FUEL DOOR OPENED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO MAC HAIK TOYOTA (2112 GULF FWY S, LEAGUE CITY, TX 77573, (281)-884-3744), BUT WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THERE WERE NO RECALLS OR WARRANTIES FOR THE VEHICLE. THE FAILURE MILEAGE WAS 73,000.",
        "vin": "5TDXK3DCXES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160702,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT THE REAR DRIVER'S SIDE POWER SLIDING DOOR MALFUNCTIONED DUE TO A FRACTURED CABLE. THE CONTACT INDICATED THAT THE DOOR WAS EXTREMELY HEAVY AND COULD ONLY BE OPENED AND CLOSED MANUALLY. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER (NORTH HILLS TOYOTA, 711 BROWNS LN, PITTSBURGH, PA) AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157116,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE 'S VERY HARD BRAKE WITH DTC C1441 , ODOMETER ONLY 25.036 MILEAGE  I NEED A LONG DISTANCE TO STOP THE CAR",
        "vin": "5TDKK3DC0ES"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155534,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL OF THE SUDDEN, AFTER A LONG DRIVE ON HIGHWAY, I PARKED AND FUEL MY CAR AND MY CAR WOULD NOT CHANGE GEARS PROPERLY OR VERY SUDDEN BURST THEN STUCK IN GEAR, THEN AFTER LITTLE WHILE I STOP ON THE SIDE AND NOW IT  WON'T DRIVE OR REVERSE OR SOMETIMES WON'T GO PARK.",
        "vin": "5TDDK3DC0ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154096,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED HAVING ISSUES WITH LEFT & RIGHT SLIDING DOORS NOT CLOSING ON 2014 TOYOTA SIENNA ROUGHLY 18 MONTHS AFTER PURCHASE.  LATER RECEIVED A RECALL NOTICE FOR THE INSTRUMENT PANEL JUNCTION BLOCK AND NEW WIRE HARNESSES AS WELL AS WARRANTY ENHANCEMENTS FOR SLIDING DOOR FRONT AND REAR LOCK ASSEMBLIES.  BROUGHT IN TO WHITE RIVER TOYOTA IN WHITE RIVER JUNCTION, VT FOR REPAIR AND WAS TOLD THAT ALL THAT COULD BE DONE WAS THE RECALL ITEM AS THEY COULD NOT DUPLICATE THE SLIDING DOOR ISSUE NOT CLOSING.  HAVE CONTINUED TO HAVE THIS PROBLEM AND HAVE HAD TO CLOSE DOORS MANUALLY.  BROUGHT IN AGAIN TO HAVE REPAIRED APPROXIMATELY A YEAR LATER AND WAS LED TO BELIEVE THE WARRANTY ENHANCEMENT REPAIRS WOULD BE DONE ONLY TO BE TOLD THAT THEY NEEDED TO ORDER THE PARTS AND THAT THE TECHNICIAN RECOMMENDED THE REPLACEMENT OF BOTH SLIDING DOOR HINGES AT A COST OF $758.  THE EXTRACARE WARRANTY THAT I HAD PURCHASED WHEN I BOUGHT THE VEHICLE WILL NOT COVER THE HINGES AS THESE WERE NOT COVERED WHEN THE WARRANTY WAS PURCHASED.  THIS VEHICLE IS A 2014 AND I STARTED HAVING THESE ISSUES WITHIN TWO YEARS OF PURCHASE.  WHY ISN'T TOYOTA STEPPING UP TO THE PLATE AND FIXING THESE ISSUES?  THESE PROBLEMS ARE WELL DOCUMENTED AND TOYOTA SUPPOSEDLY PRIDES THEMSELVES ON CUSTOMER SATISFACTION.  ARE THEY WAITING UNTIL THESE DOORS CAN'T BE CLOSED AT ALL AND/OR FALL OFF BEFORE THEY WILL BE FORCED TO FIX?  I WILL NEVER PURCHASE ANOTHER TOYOTA OR RECOMMEND A TOYOTA FOR THE SIMPLE FACT THAT CUSTOMER SATISFACTION AND SAFETY DOES NOT APPEAR TO BE THEIR #1 PRIORITY.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149960,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. ONCE THE GEAR WAS PLACED IN NEUTRAL, THE VEHICLE STARTED. THE VEHICLE WAS TAKEN TO GULLO TOYOTA OF CONROE (LOCATED AT 500 INTERSTATE 45 S, CONROE, TX 77304, (936) 441-4141) WHERE IT WAS DIAGNOSED THAT THE SHIFTER CABLE DETACHED AND NEEDED TO REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL AND REFERRED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 46,423. *DT  CONSUMER STATED CAR WAS REPAIRED. UPDATED 01/31/19*JB",
        "vin": "5TDZK3DC9ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142546,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL DOOR HINGE HAS BROKEN LOOSE DUE TO THE SLIDING DOOR SAFETY BUTTON (MECHANISM) THAT IS EXERTING TO MUCH PRESSURE ON THE INSIDE OF THE FUEL DOOR.  THE UPPER LEFT PORTION OF THE FUEL DOOR.  THIS PLUNGER EXERTS SO MUCH PRESSURE ON THE FUEL DOOR THAT IT WARPS/FLEXES THE GAS DOOR AWAY FROM THE BODY.  IT TAKES AN EXTREME AMOUNT OF FORCE TO PUSH THIS SAFETY BUTTON (PLUNGER) IN. THIS PLUNGER CLEARLY WAS NOT DESIGNED PROPERLY.  NOW, THE DRIVER SIDE SLIDER DOOR WILL NOT OPERATE DUE TO THE PLUNGER/MECHANISM NOT BEING FULLY DEPRESSED IN.  THIS IS A SAFETY CONCERN IF SOMEONE NEEDED TO EXIT THE VEHICLE IN AN EMERGENCY.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "12/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139560,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EATING TIRES, IN FOUR YEARS I WENT THRU 4 SETS OF TIRE, I DID 4 TIME ALIGNMENT AND AT LEAST 10 TIME BALANCE AND ROTATION",
        "vin": "5TDKK3DCXES"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139575,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR ABOUT 3 WEEKS MY SPOUSE NOTICED A MUSTY SMELL INSIDE THE VAN AND THEN NOTICED THAT THE ENTIRE CABIN CARPET WAS SOAKING WET.  ON 09/14/18, I TOOK THE VAN TO TEAM TOYOTA IN GLEN MILLS, PA AND HAD THE AC LINES DRAINED.  THE CARPET WAS STILL GETTING WET AFTER HAVING THIS SERVICE DONE.  ON 10/09/18, I TOOK OUR VAN BACK TO TEAM TOYOTA  TO HAVE A COMPANY CALLED THE \"WATER DOCTOR\" TO DIAGNOSE THE WATER LEAK PROBLEM.  TEAM TOYOTA ADVISED THAT THE \"WATER DOCTOR\" DISCOVERED THE LEAK WAS COMING FROM BELOW THE FRONT WINDSHIELD COWL.  THE \"WATER DOCTOR\" APPLIED A SEALANT TO THE EFFECTED AREA. TEAM TOYOTA REPLACED THE PADDING AND DEODORIZED THE CABIN AREA.  MY BILL TO HAVE THIS REPAIRED WAS $551.20.",
        "vin": "5TDKK3DC2ES"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "10/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139072,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE EVENING OF OCTOBER 7, 2018 THE DRIVER'S SIDE SLIDING DOOR MADE A CLICKING & POPPING SOUND AS IF THE AUTOMATIC OPEN HAD BEEN ACTIVATED. THE KEYS WERE IN THE IGNITION AND IN THE ACC POSITION. THE NOISE CONTINUED AFTER THE CAR WAS STARTED AND IN THE 30 MINUTE DRIVE HOME I HEARD THE NOISE 2-3 MORE TIMES. MAX SPEED WITH THIS INCIDENT WAS 40MPH.    THIS MORNING (OCTOBER 8, 2018), I HAD JUST DROPPED OFF MY KIDS AT SCHOOL AND I WAS THE ONLY PERSON IN THE CAR. THE SAME DOOR THAT MADE THE SOUNDS OPENED WHILE THE CAR WAS IN MOTION (ALL DOORS WERE LOCKED). I STOPPED THE CAR AND TRIED TO SHUT IT, BUT IT WAS JAMMED AND WOULDN'T CLOSE 100%. I TURNED OFF THE AUTOMATIC DOORS THINKING THIS WOULD PREVENT THE DOOR FROM OPENING AGAIN, THEN CONTINUED TO DRIVE SLOWLY, AS I WAS ONLY A FEW BLOCKS FROM HOME. LESS THAN A MINUTE LATER, THE DOOR OPENED AGAIN AND THIS TIME IT WAS VERY FAST DUE TO THE AUTO DOOR BEING TURNED OFF. ONCE AGAIN I TRIED TO CLOSE IT, AND WAS WITHOUT SUCCESS.   I CHECKED OUT THE REAR OF THE DOOR AND NOTICED THAT THE LATCH WAS CLOSED. I MANAGED TO GET IT OPEN ENOUGH TO CATCH WHEN ATTEMPTING TO CLOSE IT, WHICH WORKED, BUT THE DOOR WAS NOT CLOSED SECURELY. I GOT HOME SAFELY AND WAS ABLE TO COMPLETELY CLOSE THE DOOR.   FAST FORWARD TO THIS AFTERNOON: I START THE CAR AND ALTHOUGH AUTOMATIC DOORS HAVE BEEN TURNED OFF, THE DOOR IS CLICKING/POPPING AS IF TRYING TO OPEN. THE NOISE STOPPED WITHOUT ANY INTERVENTION FROM ME. AS OF THIS MOMENT (AFTERNOON OF 10/08/2018) NO OTHER INCIDENT HAS OCCURRED.   THE CLICKING/POPPING SOUNDS OCCURRED BOTH WHILE STATIONARY AND DRIVING ON CITY STREETS. THE DOOR OPENING OCCURRED WHILE IN MOTION ON CITY STREETS TRAVELING APPROXIMATELY 25MPH.",
        "vin": "5TDXK3DCXES"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132658,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED NOTICING A CLUNKING NOISE WHEN TURNING RIGHT AT SLOWER SPEEDS, WHILE TURNING INTO DRIVEWAY OR TURNING WHILE IN A NEIGHBORHOOD. I WAS TOLD BY THE DEALERSHIP THAT IT IS THE INTERMEDIATE STEERING SHAFT, TOYOTA IS AWARE OF THE PROBLEM, THERE IS NO RECALL (MY VAN HAD 50,000 MILES) IT IS EXPENSIVE TO FIX AND NOT TO WORRY ABOUT IT. I FEEL IT WILL BE A SAFETY ISSUE WHEN I'M DRIVING AND IT TOTALLY FAILS! COMPLETELY UNSAFE TOYOTA! SHAME ON YOU FOR INSTALLING THESE AFTER YOUR PRIUS RECALL.",
        "vin": "5TDYK3DC6ES"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132664,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CLUNKS FROM REAR, WHEN GOING OVER BUMPS, OR BACKING UP OUT OF DRIVEWAY. SEATBELTS ARE SECURE, JACK AND SPARE TIRE ARE SECURE. DEALERSHIP COULD NOT FIND ANYTHING WRONG, CONTINUES TO MAKE NOISES DAILY.",
        "vin": "5TDYK3DC6ES"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131779,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONARY, BOUGHT FROM THE DEALERSHIP IN FEB (PRESENT MONTH: SEPT). LESS THAN 53K. ONE DAY INSTRUMENT CLUSTER WAS CLEAR, DROVE HOME IN THE RAIN. THE NEXT MORNING I WENT OUT TO GO TO WORK THE SPEEDOMETER WAS NON-FUNCTIONAL, ABS, VSC, TRAC, EPS LIGHTS WERE ALL ON AND THE EXCLAMATION MARK WAS LIT ALSO. THE CAR RAN FINE. AT THE DEALERSHIP NOW; DEALERSHIP SAYS THAT IT IS THE ABS ACTUATOR. IT'S \"BAD.\" HOW DOES THE ABS ACTUATOR OF A CAR THAT ISN'T FIVE YEARS OLD \"BAD?\" THEY SAY IT WILL COST $3258.04 TO FIX ...AND OF COURSE, OUT OF WARRANTY. THIS DOESN'T MAKE SENSE AND SEEING THAT TOYOTA HAD OVER 600,000 CASES IN THE PAST OF BAD ACTUATORS, I BELIEVE THIS IS A CASE INTO WHICH SHOULD BE LOOKED.",
        "vin": "5TDYK3DC2ES"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123424,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS CITY STREET BRAKING DECELERATION IS ENDING, THE ENGINE SUDDENLY SURGES AND ACCELERATES RPM. I MUST IMMEDIATELY APPLY HARD PRESSURE ON BRAKE PEDAL TO PREVENT VAN FROM SURGING AHEAD AND ALSO IMMEDIATELY MOVE AUTOMATIC SHIFT LEVER TO NEUTRAL TO DISENGAGE POWER TRAIN. AFTER ABOUT 2 SECONDS THE RPM ACCELERATION WILL STOP AND RETURN TO NORMAL. TOYOTA DEALER CHECKED ISSUE MULTIPLE TIMES, FINDING NO ISSUES. THIS IS A RANDOM OCCURRENCE THAT STARTED SHORTLY AFTER PURCHASE AND CONTINUES TO THIS DAY AND I'VE COME WITHIN INCHES OF SMASHING INTO VEHICLES IN FRONT OF ME. I REPORTED TO TOYOTA CORPORATION BUT THE OMBUDSMAN BLEW ME OFF SAYING THERE IS NO KNOWN SUDDEN ACCELERATION ISSUES. NO OFFERS TO RESOLVE FROM TOYOTA. THIS HAS HAPPENED SO MANY TIMES, I CAN NO LONGER REMEMBER THE INITIAL DATE AND EXACT MILEAGE THIS ISSUE STARTED TO OCCUR OTHER THAN WITHIN THE FIRST 4 TO 6  MONTHS OF PURCHASE. ADDITIONALLY THE SPEED CONTROL WAS NEVER ACTIVATED WHEN ISSUE OCCURRED.",
        "vin": "5TDYK3DC5ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123237,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS (BOTH SIDES) POWER SLIDING DOOR IS UNABLE TO BE OPENED AND CLOSE WHEN COMMANDED.",
        "vin": "5TDKK3DC1ES"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121023,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. WHEN THE VEHICLE WAS STARTED, THE DRIVER'S SEAT RECLINED ON ITS OWN AND ALL THE WARNING INDICATORS ILLUMINATED. IN ADDITION, THE AIR BAG INDICATOR REMAINED ILLUMINATED AND \"CHECK SRS AIR BAG SYSTEM\" WAS DISPLAYED. THE VEHICLE WAS TAKEN TO SPARKS TOYOTA (4855 US-501, MYRTLE BEACH, SC 29579, 843-236-2161) WHERE IT WAS DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE FOUND. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED A CASE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS APPROXIMATELY 4,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120366,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/2/18, WHILE DRIVING MY 2014 TOYOTA SIENNA VAN, BOUGHT NEW FROM A LOCAL DEALER WITH APPR. 89,000 MILES AND METICULOUSLY MAINTAINED FOR ALL SERVICE, I WAS DRIVING ON A CITY STREET WHEN THE BRAKES FAILED AFTER PUMPING THEM THREE TIMES. THE BRAKE FAILURE CAUSED MY VEHICLE TO REAR-END THE VEHICLE I WAS FOLLOWING. NO INJURIES, BUT THE VAN WAS TOTALED. NO CITATION WAS ISSUED BY NORMAN, OK. POLICE, ACCIDENT REPORT #2018-57682. PASSENGERS IN MY VAN WITNESSED THE BRAKE FAILURE.",
        "vin": "5TDKK3DC8ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115221,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TAIL GATE DOOR FUNCTION FAILED IN A SERIES OF PROBLEMS OVER ABOUT ONE WEEK'S TIME.  FIRST, IT SUDDENLY STARTED CRASHING DOWN UNEXPECTEDLY WHILE LOADING.  THE VEHICLE WAS STATIONARY.  THEN IT WILL NOT OPEN/CLOSE WITH THE REMOTE WITHOUT A LOT OF CRASHING NOISE AND SHAKING/VIBRATING THE WHOLE VAN.  THEN IT WILL NOT STAY OPEN AT ALL, EVEN FOR A MOMENT.  THE ONLY WAY TO DEAL WITH THE TAIL GATE DOOR NOW IS TO MANUALLY OPEN, MANUALLY LIFT, AND MANUALLY HOLD IT UP AT ALL TIMES.  IT IS DANGEROUS TO OPERATE AT THIS POINT.",
        "vin": "5TDYK3DCXES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/05/2018",
        "dateOfIncident": "06/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109677,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SLIDING DOORS DO NOT CLOSE. HAVE TO PUSH HARD ON THE DOORS TO CLOSE. PROBLEM STARTED WITH BOTH DOORS AT THE SAME TIME, AND AFTER THE FACTORY RECALL WORK WAS COMPLETED SIX MONTHS AGO. DEALER WANTS TO CHARGE $862 TO FIX BOTH DOORS.    TAIL GATE DOOR COMES CRASHING DOWN. SERIOUS INJURY HAZARD WHEN CHILDREN ARE CLOSE TO THE DOOR. DEALER WANTS TO CHARGE $490 TO FIX TAIL GATE DOOR.     PROBLEM WITH TAIL DOOR STARTED THREE WEEKS AFTER SLIDING DOOR PROBLEM STARTED.    FIELD COMPLAINT WITH TOYOTA. DOOR OPERATION IS A SIGNIFICANT SAFETY PROBLEM THAT TOYOTA SHOULD ADDRESS IMMEDIATELY.    OPENING AND CLOSING DOORS ARE WITH THE VEHICLE STATIONARY.",
        "vin": "5TDDK3DC6ES"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104672,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY, AT APPROXIMATELY 80,000 MILES, THE UPPER HINGE OF THE FUEL FILLER DOOR (THE DOOR COVERING THE GAS TANK ACCESS) FAILED. THIS APPEARS TO HAVE BEEN CAUSED BY PRESSURE EXERTED ON THE DOOR BY THE SAFETY SWITCH GOVERNING THE DRIVER SIDE SLIDING PASSENGER DOOR. THIS IS A KNOWN ISSUE, DOCUMENTED HERE: HTTP://WWW.SIENNACHAT.COM/FORUM/67-PROBLEMS-MAINTENANCE-REPAIR-GEN-3/19274-FUEL-FILLER-DOOR-HINGE-BROKE-ANYONE-ELSE-HAVE-HAPPEN.HTML#. I BROUGHT MY VAN TO MY LOCAL DEALER REPAIR FACILITY, NOVATO TOYOTA, AT APPROXIMATELY 81,000 MILES AND WAS TOLD THAT THE COST TO REPAIR WOULD BE AROUND $380. I WAS TOLD THAT NEITHER TOYOTA NOR THE COMPANY PROVIDING MY EXTENDED WARRANTY WOULD COVER IT.  IN ADDITION TO BEING CAUSED BY A MECHANICAL DESIGN DEFECT THAT COULD NOT HAVE BEEN FORESEEN, IT CAUSES A SAFETY ISSUE, AS IT WILL PREVENT OPENING OF THE REAR PASSENGER DOOR WHEN THE SWITCH IS ACTIVATED.  PHOTO ATTACHED IS NOT MY VEHICLE, BUT A PHOTO FOUND ONLINE OF THE SAME ISSUE.",
        "vin": "5TDXK3DC3ES"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103067,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 SIENNA HAS A POPPING NOISE FROM THE FRONT SUSPENSION IT HAS 32000 MILES ON IT I CAN'T LOCATE THE CAUSE IT POPS ON TURNS AN BUMPS",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101890,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. WHILE ATTEMPTING TO STOP THE VEHICLE BY DEPRESSING THE BRAKE PEDAL, THE VEHICLE FAILED TO RESPOND AND THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER (LARRY H. MILLER TOYOTA MURRAY, 5650 STATE ST, MURRAY, UT 84107), BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 80,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "02/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA SIENNA. CONSUMER WRITES IN REGARDS TO VEHICLE DOOR OPENING ON ITS OWN WHILE VEHICLE WAS IN MOTION. *LD  *TR",
        "vin": "5TDKK3DC9ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "02/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079004,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CABLE ON ELECTRIC SIDE DOOR BROKE - DOOR CAN SLIDE AND PIN CHILD.",
        "vin": "5TDDK3DC7ES"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/28/2018",
        "dateOfIncident": "02/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION THE STEERING LOCKED UP AND MADE THE VEHICLE UNSTEERABLE LEADING TO A COLLISION",
        "vin": "5TDKK3DC1ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2018",
        "dateOfIncident": "01/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062595,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SIENNA IS 3.5 YEARS OLD AND ONLY HAS 33,178 MILES ON IT, WHICH MEANS IT IS OUT OF WARRANTY FOR YEARS, AND IT NEEDS A NEW RADIATOR DUE TO ENGINE COOLANT LEAK. OIL CHANGES AND MAINTENANCE HAS BEEN NORMALLY DONE AT OUR LOCAL DEALERSHIP. SEEMS ODD FOR A RADIATOR TO GO TO SOON SO MONEY IS OUT OF POCKET TO FIX.",
        "vin": "5TDYK3DC3ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/26/2017",
        "dateOfIncident": "12/17/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056644,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. WHILE ATTEMPTING TO MANUALLY OPEN THE DRIVER'S SIDE SLIDING DOOR, THE DOOR WOULD SOMETIMES REMAIN CLOSED OR BECOME VERY DIFFICULT TO OPEN. THE FAILURE WAS INTERMITTENT. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED AND THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "5TDZK3DC5ES"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "11/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052278,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MXV TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA EQUIPPED WITH MICHELIN PRIMARY MXV TIRES, SIZE: PT335/60/R17 (NA). WHILE DRIVING,  THERE WAS AN ABNORMAL, LOUD NOISE. THE CONTACT NOTICED THAT THE REAR DRIVER'S SIDE TIRE BLEW OUT AND THE TREAD SEPARATED FROM THE SIDEWALL. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC.  THE LOCAL DEALER WAS NOT CONTACTED. THE REAR DRIVER'S SIDE TIRE WAS REPLACED. THERE WERE NO ISSUES WITH THE OTHER TIRES ON THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN AND DOT NUMBER WERE UNKNOWN. THE VEHICLE AND TIRE FAILURE MILEAGE WAS 24,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "11/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052117,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "PRIMACY MXV4 TL",
                "productYear": "9999",
                "size": "225/55 R17 97H",
                "type": "Tire"
            }
        ],
        "summary": "COMING OFF THE BAY BRIDGE, APPROACHING THE EMERYVILLE OFF-RAMP, A LOUD NOISE EMANATED FROM THE DRIVER'S REAR OF THE MINIVAN. MOVED FROM THE NEXT TO OUTSIDE LANE TO SIDE OF THE FREEWAY & CALLED AAA. DROVE HOME ON MINI TIRE.  WAS SENT TO AMERICA'S TIRE BY MY USUAL MECHANIC. TIRE REPLACED WITH SAME MAKE AND MODEL.  NO COMMENTS RE OTHER TIRES OR ONE WITH SHREDDED SIDEWALL. TIRE RECYCLED. AUTO & TIRE 23,000 MILES. CAR INDOORS 90%+ OF THE TIME. HAVE TIRE PHOTOS.",
        "vin": "5TDKK3DCXES"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "11/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052116,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "PRIMACY MXV4 TL",
                "productYear": "9999",
                "size": "225/55 R17 97H",
                "type": "Tire"
            }
        ],
        "summary": "COMING OFF THE BAY BRIDGE, APPROACHING THE EMERYVILLE OFF-RAMP, A LOUD NOISE EMANATED FROM THE DRIVER'S REAR OF THE MINIVAN. MOVED FROM THE NEXT TO OUTSIDE LANE TO SIDE OF THE FREEWAY & CALLED AAA. DROVE HOME ON MINI TIRE.  WAS SENT TO AMERICA'S TIRE BY MY USUAL MECHANIC. TIRE REPLACED WITH SAME MAKE AND MODEL.  NO COMMENTS RE OTHER TIRES OR ONE WITH SHREDDED SIDEWALL. TIRE RECYCLED. AUTO & TIRE 23,000 MILES. CAR INDOORS 90%+ OF THE TIME. HAVE TIRE PHOTOS.",
        "vin": "5TDKK3DCXES"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047756,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "5TDYK3DC6ES"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046972,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SLIDING DOOR RECALL 16V-858.  THE LOCAL TOYOTA DEALER IS UNABLE TO REPAIR MY VAN UNTIL NEXT SPRING BECAUSE REPLACEMENT PARTS ARE IN SUCH HIGH DEMAND.  THIS IS AN UNACCEPTABLY LONG WAIT TO COMPLETE A REPAIR ON AN \"URGENT SAFETY RECALL\", ESPECIALLY OF A FAMILY CAR THAT IS USED EVERYDAY.      THE REPAIR IS GOING TO TAKE 3 HOURS.  I OR MY SPOUSE WILL NOT BE REIMBURSED FOR OUR TIME MISSING WORK TO TAKE CARE OF THIS REPAIR THAT IS NOT OUR OWN FAULT.",
        "vin": "5TDKK3DC2ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "10/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046530,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT RIGHT AROUND 50,000 MILES, THE CABLE ON ONE OF MY POWER SLIDING DOORS SNAPPED.  THIS I HAVE ALREADY FILED A COMPLAINT FOR.  BUT THEN AT AROUND 52,000 MILES, THE CABLE ON THE OTHER POWER SLIDING DOOR SNAPPED.  NOW BOTH DOORS HAVE TO BE USED MANUALLY, WHICH WOULD BE FINE EXCEPT FOR THE DOORS ARE SO INCREDIBLY HEAVY THAT IF THE CAR IS ON ANY SORT OF HILL, MY CHILDREN CAN BARELY GET THE DOORS OPEN BECAUSE THEY ARE SO HEAVY.  ON TOP OF THAT, THEY DON'T ALWAYS LOCK OPEN WHEN BEING USED MANUALLY.    A CHILD WOULD EASILY BE CRUSHED BY THESE DOORS IF THEY LOST CONTROL OF THEM OR IF ANOTHER CHILD LET GO OF THE DOOR.  THIS IS AN INCREDIBLY DANGEROUS HAZARD THAT TOYOTA SHOULD FIX.",
        "vin": "5TDKK3DC3ES"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "11/24/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044004,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OUTER WEAR ON FRONT TIRES, SINCE MAY 2015 I PUT THREE SET OF TIRES ALL FRONT WEAR OUT VERY QUICK. LOCAL DEALER HAVE ALL RECORD AND ALSO I HAVE RECEIPT FOR ALL",
        "vin": "5TDKK3DCXES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "07/05/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041152,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE SLIDING DOOR ASSEMBLY RUSTED.  BOUGHT VAN IN NOV 2013 AND BY JULY 5, 2015, ABOUT 18 MONTHS, SLIDING DOOR ASSEMBLY IS RUSTED (SEE PICTURES 1-3) - REPORTED THIS TO TOYOTA DEALER WHEN REPORTING SLIDING DOOR CLOSURE ISSUES DURING SUMMER \\ FALL 2015. VAN IS PARKED IN GARAGE WHEN NOT AT WORK SO IT DOES NOT SIT OUT IN THE ELEMENTS 24/7, JUST OUTSIDE 8-9 HOURS MONDAY THROUGH FRIDAY.    IN 2015, TOYOTA DEALER SAID THEY WOULD NOT DO ANYTHING SO I SPRAYED WD-40 ONTO SURFACE IN ATTEMPT TO KEEP FROM FURTHER RUSTING.  ATTACHED IS A PICTURE #4 OF SAME DOOR ASSEMBLY FROM TODAY (OCTOBER 30, 2017).  WE HAVE NOT HAD VAN 4 YEARS YET, ABOUT 66,000 MILES, AND THIS COMPONENT CONTINUES TO RUST.    IF DOOR ASSEMBLY FAILS, DOOR COULD CLOSE ON PERSON BY ITSELF CAUSING INJURY ESPECIALLY IF VEHICLE IS PARKED ON HILL.",
        "vin": "5TDYK3DCXES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033186,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A RECALL LISTED FOR MY 2014 TOYOTA SIENNA (NHTSA RECALL NUMBER:16V858, MANUFACTURER RECALL NUMBER: G04. I REQUESTED THE REPAIR DURING A VEHICLE SERVICING ON 7/24/17, AND WAS ADVISED THEY DIDN'T HAVE THE PART AND NEEDED TO ORDER IT AND WOULD CONTACT ME TO INSTALL THE PART. CAVENDER TOYOTA (877) 676-9734",
        "vin": "5TDKK3DC4ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/28/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030315,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (BILL PENNEY TOYOTA, 4808 UNIVERSITY DR NW, HUNTSVILLE, AL 35816) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDKK3DC8ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025478,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL DOOR HINGE BROKE BECAUSE THE FUEL DOOR PIN HAS SO MUCH TENSION THAT IT BROKE THE HINGE.  THIS CAUSED A SAFETY ISSUE BECAUSE THE DOOR CANNOT BE OPENED FROM THE INSIDE IF IT IS NOT CLOSED ALL THEY WAY OR PUSHED CLOSED ENOUGH FOR THE SENSOR TO ALLOW THE SLIDING DOOR TO OPEN. THIS EVENT WAS REPORTED PAST THE 36 MONTH WARRANTY, (AT 40 MONTHS, BUT LESS THAN THE MILEAGE WARRANTY), BUT HAD BEGUN BEFORE THE WARRANTY HAD ENDED.  CURRENT OWNERS SHOULD BE AWARE THAT IF THERE ARE INSTANCES BEGINNING OF THE DOOR NOT BEING ABLE TO BE OPENED, SHOULD CHECK THE HINGE AND PIN TENSION AND HAVE IT FIXED WHILE IT COULD BE UNDER WARRANTY.  THIS SHOULD BE AN ITEM COVERED UNDER AN EXTENDED WARRANTY DUE TO THE SAFETY ISSUE OF NOT BEING ABLE TO EXIT THE VEHICLE IN AN EMERGENCY SITUATION.  THIS HAPPENED SEVERAL TIMES WHILE PARKED AND EXITING THE VEHICLE.  CURRENTLY GETTING AN ESTIMATE FROM THE DEALERSHIP.  THERE ARE OTHER INSTANCES OF THIS ISSUE ON DIFFERENT SIENNA AND TOYOTA FORUMS.",
        "vin": "5TDYK3DC2ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2017",
        "dateOfIncident": "09/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023608,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CABLE FOR ONE OF MY POWER SLIDING DOORS SNAPPED.  THE DOOR IS THEN DIFFICULT TO USE, AND DOES NOT LOCK IN THE OPEN POSITION.  THOSE DOORS ARE TOO DANGEROUS TO NOT LOCK IN WHEN IN THE OPEN POSITION.  THIS IS A VEHICLE DESIGNED FOR CHILDREN WHO WOULD BE SEVERELY INJURED IF THE DOOR SLID SHUT ON THEM.  THE VEHICLE WAS PARKED AND ONE OF MY DAUGHTERS WAS OPENING THE DOOR WHEN THE CABLE SNAPPED.    THE VEHICLE ONLY HAS 50,000 MILES ON IT.   THIS IS A CAR DESIGNED FOR CHILDREN!  SO FOR THE DOOR TO BE SUDDENLY UNSAFE WHEN THE CAR ONLY HAS 50,000 MILES ON IT SEEMS UNACCEPTABLE TO ME.",
        "vin": "5TDKK3DC3ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA SIENNA.  CONSUMER WRITES IN REGARDS TO SLIDING DOOR OPENING OPERATION ISSUES RECALL NOTICE.  *LD    THE CONSUMER REQUESTED ASSISTANCE HAVING THE RECALL REPAIR COMPLETED. UPDATED 09/12/2017*JS",
        "vin": "5TDDK3DCXES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "11/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. MARK MILLER TOYOTA LOCATED AT 730 S W TEMPLE, SALT LAKE CITY, UT WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *BF    THE CONSUMER STATED THE VEHICLE WAS REPAIRED. *JS",
        "vin": "5TDXK3DC4ES"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/29/2017",
        "dateOfIncident": "08/20/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020294,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR SIENNA HAS EXPERIENCED UNREASONABLY EXCESSIVE TIRE WEAR EVEN WITH PROPER ROTATION. THE VEHICLE HAS BEEN DRIVEN NORMALLY AND NEVER BEEN IN AN ACCIDENT OR HAD A MAJOR MISALIGNMENT-CAUSING ISSUE. THE OUTSIDE TREAD OF THE FRONT TIRES HAS BEEN ESPECIALLY AFFECTED. THIS HAS LEAD TO EXCESSIVE RISK WHILE DRIVING UNDER NORMAL ASSUMPTIONS ABOUT TIRE WEAR. THE IMAGE UPLOADED SHOWS THE FRONT TIRE (TOP) AND REAR TIRE (BOTTOM). THE WEAR IS ON THE TOP TIRE ON THE RIGHT SIDE OF THE IMAGE. NOTE THAT BOTH SIDES OF TIRES WERE NEARLY IDENTICAL, INDICATING A TOE ISSUE OR THAT THERE IS A TOYOTA DESIGN ISSUE THAT LEADS TO EXCESSIVE WEAR. INCIDENTALLY, ONLINE FORUMS AND TOYOTA DEALERSHIP EXPERIENCES HAVE SHOWN THIS TO BE A CONSISTENT AND COMMON PROBLEM",
        "vin": "5TDKK3DC9ES"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/29/2017",
        "dateOfIncident": "08/29/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CALLED THE DEALERS AS PER THE WEBSITE AND THEY ARE NOT FIXING THE PROBLEM YET. LEXUS DEALER SAYS CALL TOYOTA AND TOYOTA DEALER SAYS WE DON'T HAVE A FIX YET.",
        "vin": "5TDYK3DC0ES"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2017",
        "dateOfIncident": "08/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019141,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"   NOTHING HAPPENED YET.  I RECEIVED A SETTLEMENT NOTICE BY ADMINISTRATOR  \"REAR DOOR RECALL\"",
        "vin": "5TDYK3DC4ES"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004347,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S WINDOW SEAL COMES DETACHED WHEN WINDOW RETRACTS AND YOU CANNOT PUT WINDOW BACKUP USING CONTROL BUTTON AS SENSOR DETECTS INTERFERENCE \\ RESISTANCE AND AUTOMATICALLY RETRACTS WINDOW TO OPEN POSITION.  THIS CREATES A DANGEROUS SITUATION WHEN DRIVING AS ITS A MAJOR DISTRACTION TO THE DRIVER AS THE SEAL HANGS LOOSE AND CAN INTERFERE WITH UNOBSTRUCTED VIEWABILITY OF SIDE MIRROR. IN INCLEMENT WEATHER THIS IS A REAL DRIVING HAZARD. TEMPORARY FIX IS TO PULL UP ON WINDOW SEAL AND PUSH BACK INTO POSITION    ESTIMATED FIRST TIME PROBLEM NOTICED. SORRY FOR SLOW REPORTING JUST FOUND THIS WEBSITE TO REPORT PROBLEM.",
        "vin": "5TDYK3DCXES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003946,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE: BODY); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER DAYTONA TOYOTA IN DAYTONA BEACH, FLORIDA WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. ..UPDATED 08/22/17 *BF    *CN",
        "vin": "5TDKK3DC1ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002910,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS STOPPED AT RED LIGHT IN UPHILL AND TRIED TO TAKE MY FOOT OFF BRAKE TO GO ON GREEN LIGHT, MY CAR STARTED ROLLING BACKWARD BADLY IN DRIVE MODE.  IT WAS ABOUT 20 DEGREE INCLINE.  I BELIEVE THAT ALL AUTOMATIC TRANSMISSION SHOULD NOT ROLL BACKWARD.  I BROUHT IT UP TO ONE OF THE TOYOTA SERVICE ADVISOR WHEN I TOOK MY CAR THERE FOR SERVICE, HE SAID THAT IS NORMAL WHEN CAR IS IN DRIVE MODE.  I BELIEVE THIS IS A CRITICAL  SAFETY ISSUE.  IT WAS ROLLED BACK ABOUT 1 FOOT BEFORE I HIT THE GAS PEDAL. I ALMOST GOT AN ACCIDENT.  PLEASE INVESTIGATE THIS.  THANKS.",
        "vin": "5TDXK3DC9ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002100,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE SUPERIOR TOYOTA DEALER WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYK3DCXES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/31/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992460,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE TOYOTA DEALER WAS NOT CONTACTED AND THE VEHICLE WAS NOT TAKEN TO THE LOCAL DEALER. THE TOYOTA MANUFACTURER WAS CONTACTED AT 888-270-9371, WHERE THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WERE NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC0ES"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/29/2017",
        "dateOfIncident": "05/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING ON DRY, FLAT HIGHWAY AT APPROX 60 MPH OR AROUND SLIGHT CURVES, TRACTION CONTROL ENGAGES INTERMITTENTLY.  WHEN THIS HAPPENS, LIGHT ON DASH ILLUMINATES, BEEPS ARE HEARD AND VAN MAY SWERVE.",
        "vin": "5TDZA22C34S"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/26/2017",
        "dateOfIncident": "11/24/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991818,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN MY 2014 TOYOTA SIENNA, DOOR SLIDE OPEN ON MY 11 YEAR OLD SON AT THE TIME . HE HAS SINCE TURNED 12. MY DAUGHTER FRANTICALLY GRABBED HER BROTHER  (WHOM WAS BUCKLED)  THANK GOD. UNTIL I WAS ABLE TO PULL OVER TO SAFETY. I BROKE DOWN INTO TEARS KNOWING MY HUSBAND AND I PAID $43,298.43 TO PROVIDE A SAFE\" HOME AWAY FROM HOME \" FOR MY FAMILY OF 6. WAS COMPLETELY UNAWARE OF AIRBAG RECALL UNTIL APRIL, HAVE ASKED TOYOTA TO DO THE RIGHT THING. SALESMAN OFFERED $20,000.00 IN EXCELLENT CONDITION BUT WITH OPEN RECALL. WAS TOLD BY SERVICE MANAGER IT WAS \"ILLEGAL\" FOR US TO SELL OUR CAR. HAVE TRIED NUMEROUS TIMES TO WORK OUT RESOLUTION WITH TOYOTA. OFFERED TO BUY 3 SEPARATE VEHICLES FROM THEM 1. 2017 TOYOTA SIENNA SE PREMIUM 2.  2017 TOYOTA 4RUNNER AND LASTLY 2017 TOYOTA HIGHLANDER LIMITED PREMIUM. KEEP GETTING TOSSED AROUND BY SEVERAL DIFFERENT PEOPLE. I AM CURRENTLY IN A 5 PASSENGER 4RUNNER FOR A FAMILY OF 6. I CANNOT DRIVE DUE TO NOT ENOUGH ROOM AND IT HAS BUGS IN IT. NEW CAR SALES MANAGER IS AWARE OF THAT AS OF YESTERDAY MAY 25,2017 OFFERED NO KIND OF SWAP OF VEHICLE. I HAVE BEEN ADVISED BY AUTOTRADER , CREDIT UNION, AND EVEN OTHER TOYOTA DEALERSHIPS TO HIRE A LAWYER. I DO NOT WANT TO DO THAT. I SIMPLY WANT THE RIGHT THING TO BE DONE, WHETHER THAT BE PAYOFF MY EXISTING PAYOFF OF WHAT I CONSIDER A DEATH TRAP OF DILIGENTLY TRY AND PUT FORTH BEST EFFORT TO PUT MY FAMILY INTO A SAFE TOYOTA VEHICLE, WITHOUT CHARGING US AN ARM AND A LEG.",
        "vin": "5TDYK3DC1ES"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "06/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (LATCHES/LOCKS/ LINKAGES). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. IN ADDITION, THE CONTACT STATED THAT THE PASSENGER SIDE LOCKS FAILED AND SHE PAID OUT OF POCKET TO HAVE THEM REPLACED. AFTERWARDS, THE DRIVER SIDE DOOR LOCKS ALSO FAILED. THE CONTACT MENTIONED BECAUSE THE DOORS WERE SO HEAVY AND SHE HAD TO OPEN AND CLOSE THEM MANUALLY, SHE WAS CURRENTLY EXPERIENCING SHOULDER ISSUES. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER STATED THAT THEY DID NOT HAVE A REMEDY AND THE CONTACT WOULD RECEIVE A LETTER WHEN THE PARTS AND REMEDY WERE AVAILABLE. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE....UPDATED 11/15/17 *BF    THE CONSUMER STATED THE VEHICLE WAS TRADED IN. *JS",
        "vin": "5TDKK3DC2ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991053,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER DID NOT KNOW WHEN THE PARTS WOULD BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYK3DC2ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/18/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990466,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER STATED THAT THE PARTS WERE NOT AVAILABLE AND THE CONTACT DID NOT KNOW WHEN THEY WOULD ARRIVE. THE CONTACT STATED THAT THE REAR DRIVER'S SIDE DOOR MADE AN ABNORMAL NOISE AND BECAME DIFFICULT TO CLOSE. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDYK3DC4ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985793,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN DECEMBER OF 2016. THE DEALER STATED THAT THE PART WAS NOT AVAILABLE FOR REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 58,000.",
        "vin": "5TDKK3DC2ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/10/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC1ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "05/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5TDYK3DC2ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A LETTER FROM TOYOTA STATING THAT THEY HAVE DETECTED A DEFECT WHERE THERE IS A POSSIBILITY THAT THE SLIDING DOOR OPENING OPERATION IS IMPEDED AND THE SLIDING DOORS CAN OPEN ON THEIR OWN WHILE DRIVING. WE RECEIVED THIS LETTER IN AUGUST OF 2016. WE SPOKE WITH OUR LOCAL DEALER AND THEY STATE NO SOLUTION HAS BEEN FOUND YET AND WE CONTINUE TO HAVE AN UNSAFE CAR AND THE AUTOMATIC SLIDING DOORS OFF THAT I AM PAYING EXTRA TO HAVE AUTOMATIC DOORS. I HAVE 2 SMALL CHILDREN AND I STILL WORRY FOR THEIR SAFETY SINCE THEY SIT NEXT TO EACH SLIDING DOOR EVEN THOUGH THE AUTOMATICITY IS OFF BECAUSE WE DON'T KNOW IF IT CAN STILL HAVE A PROBLEM. I NEED THIS SITUATION TO BE FIXED ASAP SINCE I CANNOT CONTINUE TO WORRY ABOUT A DEFECT THEY CREATED. THEY NEED TO TAKE ACCOUNTABILITY AND EITHER FIX THE ISSUE OR CHANGE MY CAR WITH NO COST TO ME.",
        "vin": "5TDKK3DC5ES"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980515,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A HANDICAP VEHICLE EQUIPPED WITH ELECTRIC RAMP. PROBLEMS WITH SLIDING DOORS UNLOCKING, NOT LOCKING OR DOORS OPENING MAKING IT AN EXTREME SAFETY BASED. INTERIM RECALL RECEIVED RECOMMENDATION RECEIVED IN NOVEMBER TO OPERATE DOORS IN MANUAL MODE IS UNACCEPTABLE WITH RAMP AND HANDICAPPED DRIVERS. CONTACTED TOYOTA CORPORATE AND WOULD NOT PROVIDE ASSISTANCE OR ACCOMMODATION.",
        "vin": "5TDYK3DC0ES"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/09/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971480,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO CAR PARKED FOR THREE DAYS - SUNROOF SHATTERED OUTWARD. 4/7/17 NOT THE FIRST TIME - ON. 8/25/14 IT SHATTERED WHILE DRIVING (7978 MILEAGE)- A LOUD EXPLOSION AND NO OTHER CARS IN SIGHT. ALSO EXPLODED OUTWARD. OPENED A CASE WITH TOYOTA RELATIONS WHO ASKED WE BRING TO DEALERSHIPS FOR REVIEW. FIRST TIME TECHNICIAN BLAMED ON OBJECT HITTING US FROM ROAD - TOYOTA PAID FOR REPLACEMENT AS GOOD WILL GESTURE. NOW TECHNICIAN SAY SOMEONE PUNCHED IT FROM BELOW WITH COVER CLOSED - HAVE PICS BELOW. ALSO STATED HAD TO BE BROKEN FROM WITHIN - BASICALLY ACCUSED US OF PUNCHING IT. AFTER THE FIRST TIME WE KEEP COVER CLOSED AND NEVER USE IT FOR FEAR IT WOULD HAPPEN AGAIN.",
        "vin": "5TDDK3DC2ES"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970928,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR ON JANUARY 1, 2017 FROM A DEALERSHIP IN SUNNYVALE AS A CERTIFIED TOYOTA.  I NOW HAVE 11K MILES AND THE FROM TIRES ARE COMPLETELY BALD.  I DON'T UNDERSTAND HOW THIS COULD HAPPEN.  AFTER SEARCHING THE INTERNET I FOUND A LOT OF CONSUMERS COMPLAINING ABOUT THE SIENNA VAN FRONT WHEEL DRIVE TIRES WEARING BALD IN UNUSUALLY LOW MILES.  I BELIEVE THE SUSPENSION, STEERING OR SOME OTHER ENGINEERING ISSUE IS FLAWED.  THERE IS NO REASON WITH 5K ROTATION AND PROPER ALIGNMENT THAT THE SIENNA SHOULD BE EATING TIRES BALD AT 1/3 OF NORMAL TIRE LIFE.  THIS COULD BE DEEMED A SAFETY ISSUE AS THE CUSTOMER MAY NOT BE AWARE THAT FRONT TIRES ARE WORN PREMATURELY AND THAT MAY CAUSE A POTENTIAL DISASTER.  I SEARCHED THE INTERNET AND FOUND THAT TOYOTA COMMONLY SENDS THE COMPLAINING CUSTOMERS TO THE TIRE MANUFACTURER WHICH TAKES THE BLAME OFF OF THEM AND LEAVES THE TIRE MANUFACTURERS WITH LIABILITY OF EARLY TREAD USE.  ITS OBVIOUS THAT WITH THE NUMBER OF COMPLAINTS ON THE INTERNET THAT AN INVESTIGATION NEEDS TO BE STARTED INTO THE CAUSE OF THIS EARLY TREAD BURNING.",
        "vin": "5TDYK3DC5ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970955,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A POSSIBILITY THAT UNDER CERTAIN LIMITED CONDITIONS, IF THE SLIDING DOOR OPENING OPERATION IS IMPEDED, THE SLIDING DOOR MOTOR CIRCUIT COULD BE OVERLOADED, OPENING THE FUSE FOR THE MOTOR. IF THIS OCCURS WHEN THE DOOR LATCH IS IN AN UNLATCHED POSITION, THE DOOR COULD OPEN WHILE DRIVING, INCREASING THE RISK OF INJURY TO A VEHICLE OCCUPANT.",
        "vin": "5TDYK3DC5ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "03/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970442,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT THE REAR PASSENGER SLIDING DOOR OPENED INDEPENDENTLY. ONCE THE BUTTON WAS PRESSED TO CLOSE THE DOOR, THE DOOR ATTEMPTED TO CLOSE, BUT DID NOT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT WAS NOTIFIED THAT THE MANUFACTURER CONSIDERED THE FAILURE COLLATERAL DAMAGE AND IT WAS MORE COST EFFECTIVE FOR THE CONTACT TO DRIVE THE VEHICLE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS APPROXIMATELY 67,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC DOOR STOPPED MOVING AND I COULD SMELL A BURNING ELECTRICAL ODOR. AUTOMATIC DOORS NO LONGER WORK.",
        "vin": "5TDKK3DC7ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/15/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966127,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE BEEN HAVING ISSUES FOR OVER A YEAR NOW WITH THE DRIVERS SIDE REAR SLIDING DOOR NOT CLOSING ALL THE WAY. IT WOULD CLOSE ALL BUT THE LAST 6 INCHES OR SO AND THEN RE-OPEN. I TOOK IT TO THE DEALERSHIP 3 TIMES AND THEY SAID THEY FOUND NO ISSUES, BUT GREASED THE DOOR. 2 WEEKS AGO THE DOOR WOULD NOT OPEN OR CLOSE AT ALL (EVEN MANAULLLY - THUS THE REASON FOR MY COMPLAINT). I TURNED THE AUTOMATIC FEATURE OFF AND COULD NOT GET THE DOOR TO OPEN AT ALL!!! MAJOR SAFETY ISSUE! I LOOKED AND NOTICED THAT THE CABLE HAD SNAPPED. I TOOK IT TO THE DEALERSHIP AGAIN AND THEY REPLACED THE CABLE AND SAID THAT WAS THE PROBLEM WITH THE DOOR NOT CLOSING PROPERLY TOO. THAT COST ME $320. THE NEXT DAY THE SAME ISSUE RETURNED OF THE DOOR NOT CLOSING ALL THE WAY. I TOOK IT BACK IN AND THEY DIAGNOSED IT AGAIN IN LESS THAN A MINUTE AS THE ROLLER ON THE HINGE. THEY AGREED TO REPLACE IT AT NO CHARGE TO ME, BUT DID NOT LET ME SEE THE CLAIMED BAD PART. MY MAJOR CONCERN IS THAT THIS DOOR WOULD NOT OPEN AT ALL EVEN IN THE MANUAL MODE AND THAT THE DOOR CONSISTENTLY WOULD NOT CLOSE ALL THE WAY. ALL THESE SYMPTOMS OCCURRED WITH THE VEHICLE FULLY STOPPED AND IN PARK.",
        "vin": "5TDDK3DC5ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2017",
        "dateOfIncident": "12/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965859,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5TDYK3DC3ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965866,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC8ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/09/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959329,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA SIENNA.  CONSUMER WRITES IN REGARDS TO VEHICLE DOORS MALFUNCTION AND RECALL NOTICE 16V-858 ISSUES.  *SMD  THE CONSUMER STATED IN THE MIDST OF DRIVING 70 MPH, BOTH OF THE DOORS OPENED. *JB",
        "vin": "5TDYK3DCXES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2017",
        "dateOfIncident": "01/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959118,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. WHEN THE CONTACT ATTEMPTED TO OPEN THE VEHICLE'S SLIDING DOORS, BOTH THE DRIVER AND PASSENGER DOORS FAILED TO OPEN. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 40,886. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC7ES"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/06/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949785,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V858000 (LATCHES/LOCKS/LINKAGES). THE CONTACT STATED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE STILL NOT AVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYK3DC5ES"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2016",
        "dateOfIncident": "12/21/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937414,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES THE CAR STALLS UPON ACCELERATION. THEN IT SURGES FORWARD. WHEN DRIVING, IT WILL ACCELERATE AT RANDOM. HAD VEHICLE TO DEALER, EVANS TOYOTA IN FORT WAYNE, IN. ON 12/21 & 12/23/2016. THEY SAY IT'S FINE. I DISAGREE. IT'S NOT RIGHT.  *TR",
        "vin": "5TDYK3DC6ES"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930371,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT THE DOOR AJAR SENSOR ILLUMINATED. THE SENSOR WAS REPLACED BY THE DEALER, BUT THE FAILURE CONTINUED. THE DEALER AND MANUFACTURER WERE UNABLE TO PROVIDE A REPAIR SOLUTION. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2016",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF ACCELERATION AFTER BRAKING.  VEHICLE WILL CEASE RESPONDING TO THE ACCELERATOR PEDAL AFTER BRAKING, WILL CONTINUE TO GO SLOWLY (~20 MPH) FOR 3-5 SECONDS, THEN ACCELARATION WILL RESUME.  HAPPENS AT ANY TIME IN ANY SITUATION; BRAKES JUST HAVE TO BE TAPPED TO LOSE ACCELERATION, HAS BEEN HAPPENING SINCE VEHICLE NEW.",
        "vin": "5TDDK3DC8ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910695,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CLOSED DRIVER SLIDING DOOR WITH INSIDE BUTTON. WENT INTO GROCERY STORE. CAME BACK OUT AND SLIDING DOOR WAS WIDE OPEN. TRIED TO SHUT DOOR WITH FOB AND IT GETS ABOUT 3/4 CLOSED, STOPS, THEN OPENS AGAIN. HAD TO SHUT MANUALLY. TOOK CAR TO TOYOTA MOTORCARS IN MAYFIELD HEIGHTS, OHIO. WHILE PARKED IN THE SERVICE DEPARTMENT, SERVICE ADVISOR GEORGE MADISON TRIED TO CLOSE IT THREE TIMES WITH SAME RESULT. HE HAD A TECHNICIAN LOOK AT IT. SAYS DOOR WORKS FINE FOR TECHNICIAN SO THERE IS NOTHING HE CAN DO. GEORGE, A TOYOTA SERVICE ADVISOR, WITNESSED THE DOOR FAIL BUT WOULD NOT EVEN TRY TO FIND OUT WHAT IS WRONG. I AM STILL UNDER MANUFACTURER WARRANTY. TOYOTA'S SIENNA SLIDING DOORS ARE WELL-KNOWN TO HAVE PROBLEMS.",
        "vin": "5TDYK3DC3ES"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/18/2016",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907438,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "\"CLUCK\" NOISE IN THE REAR SUSPENSION.  RIGHT SIDE FIRST AFTER ONE YEAR OF NORMAL USE AND 13K (MI)  LEFT SIDE AT 17K (MI)   NOW BOTH SIDE HAVE'S A NOISE WHEN DRIVING IN A NORMAL ROAD CONDITION.  BOTH SIDE BOX OR DRAWER'S ON REAR PASSENGER COMPARTMENT ARE EMPTY WHEN NOISE IS PRESENT AND ALL SEAT BELT WAS LATCHED FOR ACCURATE HEARING AND A BETTER DIAGNOSTIC. ROAD TESTS THE SIENNA WITHOUT ANY LOAD AND NOISE IS PRESENT, LOAD THE CARGO AREA AND NOISE ARE INTERMITTENT WHAT IT MEAN IS NO ALWAYS PRESENT. NOISE IS PRESENT ALWAYS IN MOTION AND AFFECTED BY ROAD CONDITION. MORE LIKELY HAPPENS ON SMALL ROAD BUMPS OR NO PAVEMENT DRIVEWAY. INSPECTED REAR JACK COMPARTMENT AND REAR A/C UNIT, FOUND NOTHING LOSE OR SING OF CHAFING.   VISUAL INSPECT THE VEHICLE AND FOUND A REAR RIGHT SHOCK ABSORBER WEAR AND RUST IN THE CENTER AREA. THE PICTURE IS ATTACHED DOWN BELLOW.",
        "vin": "5TDKK3DC3ES"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904341,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ABOUT 30K MILES ON THE VAN AND HAVE HAD TO HAVE THIS VEHICLE ALIGNED THREE TIMES AND ROTATE THEM AS PER THE OWNERS MANUAL BUT IT CONTINUES TO JUST CHEW TIRES, ESPECIALLY THE FRONT TIRES. I DRIVE THIS VEHICLE AS A \"KID SHUTTLE\" SO THERE IS NO HARD DRIVING, NO GRAVEL ROAD'S AND NO OFF ROADING. I JUST DON'T UNDERSTAND WHY IT GOES THROUGH TIRES SO BAD.",
        "vin": "5TDYK3DC9ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/17/2016",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865301,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CAR TURNED OFF",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863265,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RUBBING NOISE IN THE STEERING WHEEL WHICH IS ANNOYING AND THE DEALER REFUSED TO RECTIFY IT.",
        "vin": "5TDYK3DC0ES"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/16/2016",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849963,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT STATED THAT DUE TO HIS WIFE'S RECENT WEIGHT LESS, THE FRONT PASSENGER AIR BAG SENSOR DID NOT RECOGNIZE THE SEAT WAS OCCUPIED. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 14,000.   UPDATED 05/10/16*LJ  UPDATED 05/10/16.*JB",
        "vin": "5TDYK3DC5ES"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/04/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839951,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2014 PRE OWNED CERTIFIED TOYOTA SIENNA WITH 24K MILES ON DECEMBER 2014.  WE WERE TOLD THAT THE TIRES WERE INSPECTED AND ALL HAD A 6/32\" THREAD DEPTH.  WE TOOK THE VAN FOR SERVICE A YEAR AND TWO MONTHS LATER TO THE SAME TOYOTA DEALER, AFTER DRIVING IT FOR 8K MILES.  THEY TOLD US THAT ARE TIRES WERE WORN OUT AND WE NEED TIRES ASAP.  THREE TIRES ARE 3/32\" AND ONLY ONE IS 6/32\". I ASKED HOW CAN THIS HAPPEN IF WE ONLY DROVE IT 8K MILES AND HE DIDN'T ANSWER.  MY KIDS AND I AT THIS TIME ARE IN DANGER BECAUSE THE TIRES CAN POP AT ANY TIME.  WE CONTACTED TOYOTA AND FILED A COMPLAINT.  WE RECEIVED A CALL FROM THE MANAGER AT THE DEALER AND SAID SHE COULD NOT DO ANYTHING ABOUT THE SITUATION.  WE TRIED TO ASK HER WHY ARE THREE TIRE WORN OUT BUT ONE IS STILL 6/32\" AND THE MANAGER IGNORED THE QUESTION, SAYING THAT THEY GAVE US 6/32\" THREAD DEPTH TIRES.  AT THIS TIME I DO NOT KNOW WHAT TO DO.  HOW CAN THE CAR HAVE 32K MILES AND NEEDS TIRE REPLACEMENT.  I DON'T BELIEVE THAT 8K MILES BROUGHT 6/32\" TO 3/32\" ON ONLY THREE TIRES.  I WANT TO KNOW IF IT IS THE TIRE THAT IS DEFECTIVE OR THE VAN ITSELF.  PLEASE HELP US FIGURE THIS SITUATION OUT.",
        "vin": "5TDKK3DC2ES"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "01/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823778,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING 11-YR OLD WRAPPED SEAT BELT AROUND LEGS. AFTER VAN STOPPED IN HOME DRIVEWAY, BELT WAS  RELEASED AND RETRACTED, AND IT'S ATTACHED TO TOP OF VAN SO FEET WENT UP IN THE AIR--PULLS CHILD OFF THE SEAT AND THERE IS NO SLACK FOR REMOVING LEGS.  AFTER 30 MIN WITH MOTHER & 2 NEIGHBORS TRYING TO RELEASE IT, CHILD'S FEET WERE TURNING BLUE WHEN  NEIGHBOR FOUND A BOLT AND LOOSENED IT ENOUGH TO GET FEET OUT.  WHY IS THERE NOT A CLEARLY MARKED RELEASE BUTTON SOMEWHERE?  IF IT HAD BEEN CHILD'S HEAD/NECK THERE WOULDN'T HAVE BEEN TIME TO GET SCISSORS TO CUT IT LOOSE WITHOUT SERIOUS INJURY.  GUESS SCISSORS SHOULD BE A NECESSITY IN THE CAR NOW, AS IT COULD'VE HAPPENED SOMEPLACE WHERE SCISSORS WEREN'T AVAILABLE.  WHAT A FREAK ACCIDENT THAT YOU JUST DON'T THINK ABOUT.",
        "vin": "5TDKK3DC4ES"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/25/2015",
        "dateOfIncident": "10/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785861,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT RANDOM AND INTERMITTENTLY THE BRAKE PEDAL FEEL CHANGES FROM FIRM TO MUSHY WITH THE PEDAL TRAVELING TO OR NEAR THE FLOOR DURING THE STOPPING. ALSO AT RANDOM AND INTERMITTENTLY THE CAR CAN BE STOPPED WITH THE BRAKE PEDAL APPLIED LIGHTLY TO PREVENT CAR MOVEMENT WHEN THE PEDAL SUDDENLY SLOWLY BEGINS DROPPING AND WILL GO DOWN TO THE FLOOR. I HAVE HAD NO ACCIDENT FROM EITHER BRAKE FAILURE CONDITION, BUT SEVERAL TIMES I FELT READY TO GO INTO CRASH AVOIDANCE MODE WHEN THERE WAS THE CHANCE THAT THIS MIGHT ALSO MIGHT BE ON THE VERGE OF LOOSING BRAKING ACTION.   I HAD THIS CHECKED BY TWO TOYOTA SHOPS BUT THEY SAID THEY FOUND NOTHING WRONG. I ALSO CALLED TOYOTA FOR ASSISTANCE AND A CASE NUMBER (1510051721) WAS ASSIGNED. THE REP TALKED WITH BOTH SHOPS AND LASTLY SAID HE WAS GOING TO TALK TO SOMEONE ELSE AND CALL BACK. HE NEVER CALLED.   WHEN I DROVE FROM THE 2ND TOYOTA SHOP, THE BRAKES FAILED AGAIN AND I WENT RIGHT BACK. THE SHOP REP AND I TOOK THE CAR OUT FOR A TEST DRIVE AND THE BRAKES WERE OK. WE SWITCHED DRIVING AND 3 BLOCKS FROM THE SHOP THE BRAKES FAILED APPROACHING A STOP LIGHT. THE LIGHT CHANGED BEFORE WE HAD TO STOP. AT THE SHOP, I STOPPED THE CAR IN DRIVE AND WITH MY FOOT LIGHTLY ON THE PEDAL AS IN A NORMAL WAIT FOR THE STOP LIGHT TO CHANGE. AFTER A SHORT TIME, THE BRAKE FAILED AND SLOWLY DROPPED TO THE FLOOR. THIS TIME THE REP (WHO WAS STILL IN THE PASSENGER SEAT) HAD THE FAILURE BROUGHT TO HIS ATTENTION AND HE ACTUALLY SAW THE PEDAL FALL TO THE FLOOR. HE IMMEDIATELY TOOK THE CAR INTO THE SHOP, BUT AGAIN THE TECH FOUND NO PROBLEM OR FAILURE.   I ASKED THE TOYOTA REP TO HAVE A ENGINEER OR BRAKE EXPERT DECIDE WHAT COULD CAUSE THIS AND PRECAUTIONARY REPLACE THE PRIMARY CHOICE. THIS WAS REFUSED. THIS VAN WAS BOUGHT NEW IN JANUARY, 2015. THE PROBLEM WAS FIRST NOTICED IN MARCH. I NOW HAVE ONLY 6,400 MILES ON IT.",
        "vin": "5TDYK3DC3ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/11/2015",
        "dateOfIncident": "08/08/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE HOOD OPEN WITH PROP ROD INSTALLED, I PUSHED DOWN SLIGHTLY ON THE HOOD AND IT CRUMPLED LIKE THIN FLIMSY METAL AT THE POINT WHERE THE ROD CONNECTS TO THE HOOD.  I AM NOT STRONG - 6'2'' AND ONLY 175 POUNDS.  NOW THE HOOD HAS A BEND AND COSMETIC DAMAGE AT THE CRUMBLE POINT.",
        "vin": "5TDXK3DC1ES"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/08/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 TOYOTA SIENNA HAS PROBLEMS WITH THE VSC TAKING OVER THE VEHICLE AT DIFFERENT TIMES AND THERE IS NO PROBLEM. IT SLOWS YOU DOWN FAST AND YOU HAVE NO CONTROL. BELLS RING AND LIGHTS FLASH, THEN IT WILL FINALLY GO OFF. IT IS VERY DANGEROUS. I HAVE READ FORUMS OF OTHER PEOPLE HAVING THE SAME PROBLEM. SOME SAY TOYOTA FIXED IT FOR FREE. OTHERS SAY DEALERS WANT OVER $800. TO FIX IT. SOME SAY IT IS A SENSOR ISSUE. OTHERS SAY A NEW SENSOR DID NOT FIX THE PROBLEM. OTHERS SAY IF THE TIRE SENSORS ARE NOT ZEROED OUT AFTER NEW TIRES ARE INSTALLED OR IF YOU HAVE TO CHANGE A TIRE OR GET THEM ROTATED THIS COULD BE THE PROBLEM. IT IS A VERY DANGEROUS ISSUE AND TOYOTA IS AWARE OF THIS BUT WILL NOT DO A RECALL. SOMEONE IS GOING TO GET KILLED OR MAIMED  IF THEY HAVE NOT ALREADY.  TOYOTA NEEDS TO RECALL AND FIX THESE PROBLEMS AND NOT HAVE DANGEROUS VANS ON THE ROAD. THEY NEED TO CHECK THE VANS FOR EACH PROBLEM BECAUSE MANY PEOPLE HAVE THIS PROBLEM AND WHILE LINKED TO THE  VSC ,THE PROBLEMS ARE NOT ALWAYS EXACTLY THE SAME. SOME HAVE MORE DANGEROUS PROBLEMS AND MORE FREQUENT PROBLEMS.   THANK YOU.",
        "vin": "5TDZA22C84S"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TIRES ARE WEARING HIGHLY ABNORMALLY QUICKLY.",
        "vin": "5TDKK3DC0ES"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2015",
        "dateOfIncident": "11/25/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 2000 MILES ON THE ODOMETER THE TRANSMISSION IN MY 2014 TOYOTA SIENNA FAILED. IT WAS REPLACED WITH A NEW TRANSMISSION, AND THAT TRANSMISSION SUBSEQUENTLY FAILED AT 10,800 MILES. BOTH TIMES, IT CAME WITHOUT WARNING, AND THE SECOND TIME WAS AT HIGHWAY SPEEDS. NO DAMAGE TO THE VEHICLE EVER PRECEDED THESE FAILURES. TOYOTA AND THE DEALERSHIP CLAIM TO NOT HAVE ANY EXPLANATION FOR THIS FAILURE.",
        "vin": "5TDDK3DC2ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "9545 MOORES POINT PLACE    I WAS DRIVING OUT OF THE PARKING LOT FROM THE GROCERY STORE, I STOPPED TO ENTER ONTO ROUTE 301 MAKING A RIGHT TURN ON TO THE ROAD WHEN THE VAN ACCELERATED, IT WAS ALL I COULD DO WITH ALL OF MY WEIGHT ON THE BRAKES TO STOP THE CAR FROM HITTING ANOTHER CAR. IT WAS FRIGHTENING.",
        "vin": "5TDJK3DC5ES"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/09/2015",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724247,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY, JUNE 6, 2015, MY 2014 TOYOTA SIENNA LIMITED AUTOMATICALLY BRAKE WITH VERY SIGNIFICANT FORCE WHILE THE CRUISE CONTROL WAS ENGAGED AT APPROXIMATELY 45 MPH.  NO VEHICLES OR OBSTACLES WERE AHEAD AND I WAS DRIVING ON A STRAIGHT AND RELATIVELY LEVEL STREET THAT HAS A 45 MPH SPEED LIMIT.     THIS PROBLEM ALSO OCCURRED MANY, MANY TIMES IN THE FIRST SEVERAL MONTHS AFTER PURCHASING THIS VEHICLE NEW IN APRIL 2014.  I REPORTED THIS PROBLEM TO MOLLE TOYOTA, KANSAS CITY, MISSOURI WHEN IT FIRST HAPPENED AND AT THE 5,000 AND 10,000 SERVICES AND THEY COULD FIND NO PROBLEMS WITH THE ADAPTIVE CRUISE CONTROL SYSTEM.  DURING THE FIRST FEW MONTHS OF OWNERSHIP I TRIED DRIVING TO THE MOLLE TOYOTA DEALERSHIP WHEN THE PROBLEM OCCURRED AND THE DEALERSHIP WAS OPEN BUT EACH TIME THE PROBLEM STOPPED HAPPENING BEFORE I GOT TO THE DEALERSHIP.    THE PROBLEM USUALLY HAPPENS \"OUT OF THE BLUE\" AFTER I HAVE BEEN DRIVING FOR A WHILE.  ONCE THE PROBLEM FIRST OCCURS, IT THEN HAPPENS OVER AND OVER EACH TIME I REENGAGE THE CRUISE CONTROL. STOPPING THE VEHICLE AND RESTARTING THE ENGINE ALMOST ALWAYS STOPS THE PROBLEM FROM RECURRING.  AND AS I INDICATED ABOVE, SOMETIMES THE PROBLEM WILL STOP ON ITS OWN WITHOUT RESTARTING THE ENGINE.     I AM SUBMITTING THIS COMPLAINT AT THIS TIME AFTER SEEING IN THE NEWS THAT THERE HAVE BEEN SIMILAR COMPLAINTS ON JEEPS.  THE JUNE 6 INCIDENT WAS ALSO MUCH WORSE THAN PREVIOUS INCIDENTS DUE TO ANOTHER CAR FOLLOWING VERY CLOSELY BEHIND ME WHEN THE SIENNA BRAKES AUTOMATICALLY SLAMMED ON.  I WAS ALSO CONCERNED THAT THE DRIVER BEHIND ME MIGHT HAVE THOUGHT THAT I HAD BRAKED HARD ON PURPOSE.    I HAVE BEEN ABLE TO COPE WITH THIS PROBLEM BUT MY MAIN CONCERN IS WITH ALLOWING OTHERS TO DRIVE THE SIENNA AND THAT THEY MAY NOT BE ABLE TO QUICKLY TURN THE CRUISE CONTROL OFF WHEN THE PROBLEM HAPPENS.   *TR",
        "vin": "5TDYK3DC0ES"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/18/2015",
        "dateOfIncident": "04/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10706399,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING 45 MPH CROSSING EAST A 3 LANE INTERSECTION WITH A GREEN LIGHT WHEN ANOTHER VEHICLE GOING SOUTH RUN A RED LIGHT. SINCE I HAD THE RIGHT OF WAY AND MY VAN WAS AT STEADY SPEED OF 45 MPH, I HAD NO TIME TO REACT TO PREVENT FROM HITTING THE INCOMING CAR. I HIT THE OTHER VEHICLE'S PASSENGER SIDE DAMAGING BOTH FRONT AND REAR DOOR. THE IMPACT TOTALLY RUINED THE FROM OF MY 2014 TOYOTA SIENNA VAN WITH JUST 6277 MILES. MY INSURANCE COMPANY'S ADJUSTER DECLARED THE VAN A TOTAL LOST. WITH THAT STRONG IMPACT THAT TOTALLY DESTROY THE FRONT OF MY VEHICLE, I WAS SURPRISED THAT THE AIR BAG IN THE DRIVER SIDE DID NOT DEPLOY. SO, I AM REPORTING THIS INCIDENT FOR POSSIBLE PRODUCT DEFECT ON AIR BAGS INSTALLED IN MY 2014 TOYOTA SIENNA LE VAN TO PREVENT FUTURE INCIDENT ON AIR BAG FAILURE.  *TR",
        "vin": "5TDKK3DC2ES"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "04/11/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705599,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TO SAVE MONEY TOYOTA INSTALLED A VIDEO BACK-UP CAMERA WITH NO AUDIO WARNING. IF TOYOTA WOULD HAVE SPENT THIRTY MORE DOLLARS AND INSTALLED AN AUDIBLE ALARM MY FAMILY MAY HAVE SAVED A THOUSAND DOLLARS. WE WOULD NOT BE REPLACING OUR GARAGE DOOR. THANK YOU.   *TR",
        "vin": "5TDKK3DC5ES"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/20/2015",
        "dateOfIncident": "03/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700585,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS IN REFERENCE TO NHTSA CAMPAIGN ID 08V244000.  THE POWER REAR LIFTGATE STRUTS ON MY 2004 TOYOTA SIENNA WILL NO LONGER SUPPORT THE GATE, AND IT HAS CLOSED ON SOMEONE STANDING UNDERNEATH IT SEVERAL TIMES.  I WENT TO A TOYOTA DEALER TO REPAIR THE PROBLEM, AND THE DEALER QUOTED A VERY HIGH REPAIR PRICE (APPROXIMATELY $500), AND DID NOT MENTION THAT THERE WAS A SERVICE CAMPAIGN FOR THIS ISSUE.  I CONTACTED TOYOTA ON MARCH 19, 2015 USING THE TOLL FREE NUMBER LISTED IN THE SERVICE CAMPAIGN LISTED ON THE NHTSA CAMPAIGN ID NUMBER.  TOYOTA INFORMED ME THAT THIS WAS NOT A RECALL SITUATION, BUT A VOLUNTARY TOYOTA SERVICE CAMPAIGN, AND THAT THE PERIOD FOR THE FREE REPAIR ENDED IN 2010.  THERE IS NO END DATE FOR THE SERVICE CAMPAIGN LISTED IN THE NHTSA CAMPAIGN NOTES.  NO RESOLUTION WAS PROVIDED BY TOYOTA, OTHER THAN TO GO TO THE DEALER TO HAVE THE LIFTGATE STRUTS REPLACED, AND THAT I WOULD HAVE TO PAY FOR THE REPAIR MYSELF.  *TR",
        "vin": "5TDBA22C64S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/27/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628681,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL - THE CONTACT OWNS A 2014 TOYOTA SIENNA. THE CONTACT WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V414000. THE CONTACT STATED WHILE THE KEY WAS IN THE IGNITION HE TURNED IT ON FOR THE POWER TO COME ON BUT THE ENGINE WAS OFF. THE CONTACT MENTIONED HE WAS ON A HILL AND PUT THE VEHICLE IN THE REVERSE POSITION WHILE THE ENGINE WAS STILL OFF AND THE VEHICLE BEGAN TO ROLL BACKWARDS. THE CONTACT STATED HE WAS UNABLE TO STOP THE VEHICLE WHEN APPLYING THE BRAKES. THE CONTACT MENTIONED THE VEHICLE STOPPED ONCE IT HIT A FLAT SURFACE AND HE TURNED THE VEHICLE ON. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 6,000. BT",
        "vin": "5TDJK3DC3ES"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/24/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628310,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PART IS NOT ON NHTSA AFFECTED PARTS LISTS AND NEEDS TO BE UNDER (SUNROOF / MOONROOF /PANORAMA )  WHILE DRIVING FROM FLORIDA JUST OUTSIDE THE LINCOLN TUNNEL ON A SUNNY 65 DEGREE MORNING (7:30 AM, SUNDAY) WE HEAR A LOUD BOOM. NOTHING WAS IN FRONT OF US, NO OVERPASS. I SLIDE THE MOONROOF (ALL OTHER CARS CALL IT A SUNROOF)  COVER BACK AND GLASS FALLS IN - IT LOOK AS IF IT HAD EXPLODED UPWARD.  THANK GOODNESS I HAD THE COVER CLOSED. DEALERSHIP DETERMINES IT WAS CAUSED BY IMPACT BECAUSE OF THE GLASS BREAK PATTERN. I ASKED HIM IF HE HAD EVER SEEN THE PATTERN OF GLASS IF IT WAS DEFECTIVE, IF THERE WOULD SHOW A WEAK POINT.  HE SAID HE HAD NOT AND THEN SAID HE DID NOT KNOW FOR SURE - IT WAS JUST FROM HIS EXPERIENCE HE DETERMINED THIS - EVERYONE AT DEALERSHIP HAD NEVER HEARD OF A SPONTANEOUS BLOW OUT IN THE MOONROOF /SUNROOF.  THERE IS A LOT DOCUMENTED ON EDMUNDS.COM AND OTHER PLACES SO I SENT LINKS TO THIS INFO TO THE DEALERSHIPS. I HAVE OPENED A CASE WITH TOYOTA, THEY HAVE YET TO DETERMINE. THEY NEED TO BE HELD RESPONSIBLE - THEY NEED TO DE RESEARCH - WE COULD HAVE BEEN HURT IF THE COVER WAS OPENED.  *TR",
        "vin": "5TDDK3DC2ES"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "03/14/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621981,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA'S DESIGN DOES NOT PERMIT THE DASHBOARD LIGHTING OF THE INSTRUMENTS AND DIALS UNLESS ONE TURNS ON THE LIGHT SWITCH FOR (1) PARKING LIGHTS OR (2) HEADLIGHTS.  THE DASHBOARD LIGHTING DOES NOT TURN ON WHEN ONE STARTS THE ENGINE.  IT DOES NOT TURN ON WHEN ONE TURNS ON THE FRONT DRIVING LIGHTS.      TOYOTA'S GAUGES AND SPEEDOMETER ARE RECESSED UNDER A HOOD IN ORDER TO PREVENT GLARING OF SUNLIGHT.  PREVIOUS TOYOTA VEHICLES WOULD TURN ON THE DASHBOARD LIGHTS WHEN YOU STARTED THE ENGINE.  THIS IS NOT THE CASE WITH OUR 2014 TOYOTA.    IF THE DRIVER IS OPERATING HIS VEHICLE IN THE DAYLIGHT HOURS AND SUDDENLY RUNS INTO DARKNESS CAUSED BY CLOUDS, DUST STORM, ETC., HE WILL HAVE A DIFFICULT TIME SEEING THE INSTRUMENTS AND GAUGES.  HE MAY HAVE TO DIVERT HIS ATTENTION TO TURN ON HIS DASHBOARD LIGHTS.      THIS VEHICLE DOES NOT TURN ON RUNNING LIGHTS WHEN YOU TURN ON THE MOTOR.  THE DRIVER MUST ENGAGE THESE LIGHTS WITH THE STALK CONTROLS WHICH OFFER FOUR POSITIONS:    1.  OFF  2.  RUNNING LIGHTS  3.  PARKING LIGHTS AND INSTRUMENT CLUSTER LIGHTING  4.  HEADLIGHTS AND INSTRUMENT CLUSTER LIGHTING.  *TR",
        "vin": "5TDZK3DC7ES"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "05/30/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615543,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1) DRIVERS SEAT CAUSING SEVERE PAIN ON THE LEFT SIDE OF MY BACK. SEAT SEEMS TO BE LEANING TO THE LEFT CAUSING PRESSURE ON THE LEFT SIDE OF MY RIBCAGE. I CAN FEEL THE SIDE AIR BAG LOCATION CAUSING THIS.     2) FIRST AND SECOND ROW HEADRESTS RISE UP WITHOUT ANY MANUAL INTERVENTION. WILL NOT STAY DOWN IN LOCKED POSITION.  *TR",
        "vin": "5TDKK3DC3ES"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "02/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614878,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA EL 400",
                "productYear": "9999",
                "size": "255/40R18",
                "type": "Tire"
            }
        ],
        "summary": "TIRE FAILURES- THREE SIDEWALL BLOWOUTS  AFTER SMALL POTHOLE IMPACTS FIRST IN FEBRUARY 2014 ( 30-35  MPH- POT HOLE ABOUT 4 INCHES DEEP)   SECOND- TWO TIRES  JULY 4TH  2014 (  60 MPH- POT HOLE ABOUT 2\" DEEP) NO RIM DAMAGE OR OTHER COMPONENT DAMAGE.  *TR",
        "vin": "5TDJK3DC2ES"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605279,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA SIENNA.  CONSUMER WRITES IN REGARDS TO ACCELERATOR PEDAL & SURE GRIP BRAND HAND CONTROLS.  *SMD  THE CONSUMER STATED WHILE DRIVING, THE ENGINE REPEATEDLY RACED.  ALSO, THE VEHICLE ACCELERATED WHEN THE PEDAL WAS APPLIED AND THEN IT BECAME STUCK MOMENTARILY. THE CONSUMER STATED WHEN THE HAND CONTROLS, THAT WERE INSTALLED IN THE VEHICLE WERE USED, THAT'S WHEN THE ENGINE ACCELERATED AND THE PEDAL WOULD STICK. *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2014",
        "dateOfIncident": "05/24/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593914,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 TOYOTA SIENNA DOES NOT HAVE THE DASHBOARD INSTRUMENT LIGHTS ON WHEN DRIVING.  THE INSTRUMENT CLUSTER IS HOODED TO SHIELD IT FROM SUNLIGHT.  AUXILIARY LIGHTING IS REQUIRED TO CLEARLY SEE AND READ THE DIALS AND INSTRUMENTS. NOT BEING ABLE TO QUICKLY AND EASILY READING THESE DIALS CAN BE A SAFETY ISSUE.    THE ONLY WAY TO TURN ON THE DASHBOARD LIGHTS IS TO (1) TURN ON THE PARKING LIGHTS OR (2) TURN ON THE HEADLIGHTS.    THIS IS CONTRARY TO OTHER VEHICLES WE HAVE OWNED, INCLUDING TOYOTAS.    TOYOTA HAS TOLD ME THAT THIS IS STANDARD.  I DISAGREE.  I FEEL THAT TOYOTA SHOULD TURN ON THE INSTRUMENT LIGHTS WHEN I START THE ENGINE.  .   *TR",
        "vin": "STBRV54187S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "04/17/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN I-95 TO FLORIDA FROM NC, TRAVELING 70 MPH IN THE LEFT LANE WHEN I NOTICED A CAR COMING UP FROM BEHIND DRIVING ALMOST ON THE CENTER LINE.  I STAYED IN MY LANE AND THE CAR CAME UP AND IMPACTED THE RIGHT SIDE OF MY VEHICLE, ROTATING THE CAR 90 DEGREES AND SENDING ME AND MY FAMILY OFF THE INTERSTATE ONTO THE RIGHT SHOULDER. THE SIDE AIRBAG DID NOT DEPLOY EVEN THOUGH THE POINT OF IMPACT RESULTED IN DAMAGE TO THE PASSENGER AND SIDE DOORS OF THE MINIVAN.    *TR",
        "vin": "5TDYK3DC4ES"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/24/2014",
        "dateOfIncident": "01/26/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565623,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO ILLUMINATION OF THE MAIN DASHBOARD DISPLAY-SPEED, RPM, TEMPERATURE AND FUEL LEVEL WHEN LIGHT CONTROL IS AT OFF OR DRL (DRIVING LIGHTS) POSITION.  I WENT TO DEALER AND SERVICE MAN SAID THAT IS THE WAY IT IS AND ANOTHER NEW VEHICLE ON THEIR LOT WAS THE SAME.  THE GAUGE LIGHTS ARE ON BUT DIM IN PARKING AND HEADLIGHT POSITION. (TOYOTA MANUAL SAYS USE DRL IN DAYTIME TO SAVE FUEL AND ELIMINATE CHANCE OF BURNING OUT DRIVING LIGHTS.) I CALLED TOYOTA AND THEY SAID AFTER 2 WEEKS OF INVESTIGATION THAT THIS IS THE WAY IT IS.  THIS IS A SAFETY ISSUE BECAUSE WE CANNOT SEE THE SPEED ON CLOUDY DAYS OR WITH SUNGLASSES ON SUNNY DAYS.  MY PREVIOUS TOYOTA- 2006 SIENNA AND 2013 AVALON HAVE ILLUMINATION ANYTIME THE IGNITION IS ON FOR DRIVING.  WHEN YOU CAN'T SEE THE SPEED EASILY, THIS IS A SAFETY RISK- THERE IS NO DIGITAL DISPLAY OF SPEED ON THIS VEHICLE.  *TR",
        "vin": "5TDKK3DCXES"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/26/2014",
        "dateOfIncident": "01/26/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561560,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY CAR ON AN UPWARD INCLINING DRIVEWAY AND LEFT IT IN IDLE.  I WENT INSIDE THE HOUSE TO GO AND GET MY DOG AND SPEAK TO MY IN-LAWS.  I BROUGHT THE KENNEL OUT TO THE CAR, LIFTED THE TAILGATE AND PUT THE KENNEL IN.  I WENT BACK IN THE HOUSE, GOT THE DOG FOOD, PUT THE DOG FOOD IN THE TAILGATE.  I WENT BACK INSIDE AND WAS SPEAKING TO MY IN-LAWS WHEN ALL OF A SUDDEN WE HEARD A LOUD CRASH.  WE WENT OUTSIDE AND MY CAR HAD ACCELERATED AND CRASHED INTO THEIR GARAGE.  THERE WAS NO ONE IN THE CAR AT THE TIME OF THE ACCELERATION.  THE DOG WAS STILL IN THE HOUSE WITH US.  THE CAR WAS IN PARK.  THE TAILGATE WILL NOT LIFT UNLESS THE CAR IS IN PARK WHILE IDLING.  WHEN THE CAR IS IN DRIVE, THE DOORS LOCK.  SO, WE KNOW IT WAS IN PARK.  THE CAR CAUSED EXTENSIVE DAMAGE TO THE GARAGE FROM THE FORCE OF THE ACCELERATION.  THE CAR ALSO HAD GRAVITY WORKING AGAINST IT, AS IT WAS AT AN UPWARD INCLINE.    *TR",
        "vin": "5TDJK3DC6ES"
    }
]