[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11458765,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbags did not deploy when I got into an accident on I-91. The car has been totaled and is in Allstate's possession, and I believe it is available for inspection.  My safety was put at risk because the airbags didn't deploy in a head-on collision with multiple objects (reflector pole, trees).  The vehicle is in the process of being inspected by Allstate insurance representatives.  There were no warning messages or symptoms prior to this incident.",
        "vin": "JTDKN3DU3E0"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454143,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Blizzard Pearl White paint started peeling off the car's body around the top areas of the 4 side doors (passenger & driver sides).  There seems to be an active recall on this from Toyota for the same paint color and type, but the Prius model is not included in the active recall for this same condition. It has become a hazard such that such paint chips can be ingested by children. I took it to the Santa Monica, CA Toyota dealership and it was verified by the dealership representative there that this was a condition caused by a defect in the original paint with exposure to sunlight.",
        "vin": "JTDKN3DU3E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450554,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE BOASTER FAILURE.  Dashboard lights illuminated: Brake, ABS and Traction.  Brakes themselves felt spongy.  Car felt very unsafe.  I did find out that Toyota has a hidden Customer Support Program ZJB.  However, the dealer found my diagnostic code to be c1202 and the Customer Support Program ZJB only supports repairs for codes c1391, c1252, c1256 or c1253.  However, the exact same symptoms and safety issues were experienced and all the exact same warning lights also came on.  The dealer’s diagnostics resulted in a $2,087 replacement of the brake booster.  The dealer did contact the Toyota district manager along the way.  He denied coverage based on the diagnostic codes reported BUT again I am arguing that my crazy expensive repair had the EXACT same symptoms, safety issues, and repair (e.g, brake booster replacement).  The car clearly could not be driven.  Note my Prius only has 92K miles.  Attached is a picture of the dashboard warning lights that came on and the dealer invoice for the repair. ",
        "vin": "JTDKN3DU4E1"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/22/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441377,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Toyota Prius. The contact stated that the seat belts would not lock properly. The vehicle was taken to a local mechanic where it was diagnosed with needing the buckles replaced. The manufacturer was informed of the failure and informed the contact that the VIN was not included in a recall. The failure mileage was approximately 88,000.",
        "vin": "JTDKN3DU7E1"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2021",
        "dateOfIncident": "10/27/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441194,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving, I received a warning \"hybrid system malfunction\".  Within seconds, the vehicle powered off and the steering wheel LOCKED.  I had no control of the car and came to an abrupt stop in lane 1 of a two lane road.  I was fortunate that it was late in the evening with few cars on the road, had I been on the highway during rush hour the outcome, due to loss of power and control (steering), could have been catastrophic and perhaps fatal for me or other commuters. I note that in 2014, Toyota notified NHTSA of a recall to, \"rectify software in two of the Prius's electronic control units, one for the motor/generator and the other controlling the hybrid system.\" Further Toyota said, \"In rare circumstances, it could shut down the hybrid system itself, resulting in loss of power and the vehicle coming to a stop\".  This is exactly what happened to me the other night.  Toyota claims, in 2014, that \"it has received no reports of accidents or injuries related to the problem.\"  This seems to be an extraordinarily amount of good luck as I could have been easily rear-ended the other night. Curiously, in this NHTSA data base, another owner reported an incident (11439720) on November 8, 2021, that is similar to the experience I had just days prior.  And our VINS are eerily close.  Coincidence?  Not likely. Does the 2014 recall apply to my car and if not, why not given I experienced the exact same symptoms?",
        "vin": "JTDKDTB39E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "11/07/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439720,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving on the interstate yesterday my Prius computer shut down entirely.",
        "vin": "JTDKDTB31E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437384,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake being less effective  to be spongy and keep losing pressure. The brake actuator constantly making boosting noise.  Making driving unsure that the brake working even no warning light on yet.",
        "vin": "Jtdkn3du1e1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432288,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The seal of the rear lamp assembly becomes unsealed and lets water in. Burns our bulbs and short out electrical system because of this. Second right rear assembly was replaced today and now front units are also foggy so I know that the seal on the lamp unit is also wearing. I read about this with other Prius and other c models. I had to buy actual Toyota parts as there are no aftermarket units.",
        "vin": "JTDKDTB33E1"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429735,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake failure / Unintended Acceleration / Unknown cause   Driving at approx 25mph on urban street (road in good condition no potholes, ramps, etc) I began to slowly brake as I approached a red traffic light. Instead of braking, the car began to accelerate quickly. I pressed the brake pedal again - no response. Pressed down hard for a third time which executed an emergency stop. This all happened within 1 or 2 secs.   There were no injuries or involvement of other cars on this occasion. However, had I been any closer to the car in front, I believe I would have rear-ended it.   Had this occurred a few moments later, at the busy junction 400m ahead, it could have been fatal.   I am absolutely sure it was not driver error. I was not distracted, drive regularly, and have been a confident and safe driver for over 30yrs. I have never experienced this in a car before, and in fact wasn't aware that it could happen until I researched it on this site.   No warning lights or indicators came on. The car ran normally for the remaining 2 miles back home.    I didn't think anything of it before, but prior to this incident (in our 5 yrs ownership) there were approx. 5 instances when the engine would \"roar\" as if it wanted to accelerate but didn't when I was breaking or slowing down on a highway.   Also, there were perhaps 3 instances when the car felt as though it was \"running away\" i.e. a slight acceleration - for no obvious reason. As neither of these represented safety issues, I assumed the car was just a bit old and these issues would be addressed as part of any service. Now I wonder if they are related to the sudden acceleration.   The car is currently having a \"health checks\" run, but nothing has been found. I am reluctant to drive this vehicle if neither my dealer or Toyota can discern the problem.   Overall we have been happy with this car and its performance, but this is an unacceptable \"anomaly\" as far as safety is concerned.   Vehicle available for inspection.",
        "vin": "JTDKDTB39E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "06/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426958,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Originally, Toyota issued a safety recall in 2014 to address the inverter defect in model years 2010 to 2014, an attempt to fix the problem on about 800,000 cars in the U.S. by modifying software that controls the hybrid electrical system. It was intended to fix the overheating problems. The inverter controls the power flowing between the battery and electrical motors. The inverter boosts the battery from 200 - 500 volts. They inspected my car saying it was in excellent condition. After, the software upgrade i had major problems. My original Prius battery with around 65,000 miles stopped holding a charge. My 12 volt battery also died shortly after. And my power outlets in my got super hot and spiratually worked off and on. And my driver seat gets hot when i turn on car even though seat button is off. I am sweating all the time. Plus, i have skin conditions and asma. I talked to dimitri, and they tried to charge me 1200for unnecessary repair. Also, failed to call NHTSA as promised",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,HYBRID PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414427,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED WHILE DRIVING 75 MPH, THE CONTACT RELEASED HER FOOT OFF OF THE BRAKE PEDAL AND DEPRESSED THE ACCELERATE PEDAL HOWEVER, THE VEHICLE FAILED TO RESPOND. AN UNKNOWN WARNING LIGHT ILLUMINATED AND WAS FLASHING ON THE INSTRUMENT PANEL. THE CONTACT COASTED THE VEHICLE TO THE SHOULDER OF THE ROADWAY AND STOPPED THE VEHICLE. THE VEHICLE WAS NOT TURNED OFF. AFTER WAITING FOR APPROXIMATELY 10 MINUTES, THE VEHICLE RESUMED NORMAL FUNCTIONALITY. THE VEHICLE WAS DRIVEN TO TOYOTA TOWN OF STOCKTON (2150 E HAMMER LN, STOCKTON, CA 95210, (209) 751-4077) TO BE DIAGNOSED. THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT MENTIONED THAT WHILE READING THE INFORMATION FROM THE DIAGNOSTIC TEST, SHE NOTICED THAT THE INVERTER HAD NOT BEEN DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 14V053000 (HYBRID PROPULSION SYSTEM, ELECTRICAL SYSTEM) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CONFIRMED THAT THE VIN WAS NOT UNDER RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 44,250.",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414444,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING 70 MPH COMING DOWN A STEEP HILL ON A FREEWAY IN SOLID TRAFFIC, THE CARS AHEAD IN MY LANE SUDDENLY STOPPED. I HAD TO SLAM ON THE BRAKES. MY FOOT WAS ON THE BRAKE AND MY HANDS ON THE WHEEL. WHEN THE CAR AHEAD STARTED MOVING, I PUT MY FOOT ONTO THE GAS PEDAL BUT THE CAR WOULD NOT MOVE. ALL THAT I SAW ON THE DASHBOARD WAS A LIGHT GREEN LONG ARROW POINTING LEFT (NOT THE TURN SIGNAL HIGHER ON THE DASH). I MANAGED TO ROLL INTO THE LEFT SHOULDER. I NEVER TURNED OFF THE CAR BUT AT THAT POINT PUT IT INTO PARK. (BEFORE THAT I HAD NOT TOUCHED THE GEAR SHIFT.)CALLED 911. CALLED THEM AGAIN 10 MINUTES LATER AS NO ONE HAD ARRIVED. SHE ASKED IF I COULD DRIVE THE CAR. AT THAT POINT I PUT THE CAR INTO DRIVE AND MANAGED TO DRIVE A SHORT DISTANCE IN THE SHOULDER. (WHILE I WAS DRIVING BEFORE THE SUDDEN STOP I WAS NOT IN CRUISE CONTROL AS THERE WAS TOO MUCH TRAFFIC.) I MANAGED TO DRIVE HOME WITHOUT ANY DIFFICULTY. ON TELLING THIS TO MY SON, HE SENT ME AN ARTICLE STATING THAT THIS HAS HAPPENED TO OTHER TOYOTA PRIUS DEALERS WHERE THE CAR WOULD NOT MOVE. ( HTTPS://WWW.LATIMES.COM/LOCAL/CALIFORNIA/LA-FI-TOYOTA-PRIUS-INVESTIGATION-20180423-STORY.HTML  ) I CALLED THE DEALER AND SPOKE TO A REPAIR PERSON WHO SAID HE NEVER HEARD OF SUCH A THING.  AFTER THE WEEKEND I CALLED THE SERVICE MANAGER AND SAID THEY NEEDED TO CHECK OUR CAR AND THEY DID THAT. HOWEVER, FROM WHAT I SEE, THEY DID NOT CHECK THE INVERTER WHICH IS WHAT CAN CAUSE THE PROBLEM I HAD. I WAS TOLD THAT THE TESTS SHOWED THAT THE CAR WAS IN NEUTRAL AT SOME POINT. HOW COULD THEY EXPLAIN THAT? COULD  THE CAR SWITCH ITSELF TO NEUTRAL? SEVERAL DAYS AGO I CONTACTED THIS MANAGER AGAIN AND HE HAS NOT EVEN RETURNED MY CALL. WE DON'T KNOW IF WE CAN FEEL SAFE DRIVING IN THIS VEHICLE.  I HAVE AN OBI NUMBER WHICH IS 11414427",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402751,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HYBIRD SYSTEM MALFUNCTION. CAR LOST POWER AND STALLED WHERE WE CANNOT SHIFT. THAT HAPPENED AFTER DRIVING THE CAR HOME AND LATER TRIED TO START IT IN OUR DRIVEWAY.",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384959,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 PRIUS HAD A LOSS OF POWER AND CHECK ENGINE LIGHT CAME ON AND MSG CHECK HYBRID SYSTEM APPEARED WHILE STARTED IN THE MORNING AND DROVE OUT OF MY GARAGE. THAT DAY I WENT TO SAN FRANCISCO TOYOTA AND THEY DID A DIAGNOSIS AND TOLD ME THAT MY HYBRID SYSTEM BATTERY WAS BAD AND NEED REPLACEMENT AND QUOTED $3600. I ASKED THAT IF THEY  CAN DO THE RECALL BECAUSE I WAS 90% SURE THAT THE PROBLEM WAS DUE TO THE RECALL, BUT THEY TOLD ME THAT THEY CANT UNLESS THE ERROR CODE CLEARS OUT BY REPLACING THE HV BATTERY. I DROVE MY CAR BACK HOME AND THE NEXT DAY I WENT TO A HV BATTERY SPECIALIST AND FOUND OUT THAT MY HV BATTERY IS IN GOOD CONDITION AND DOESNT NEED REPLACEMENT.     NOW I AM 100% CERTAIN THAT THE PROBLEM IS DUE TO THE RECALL BUT TOYOTA IS NOT FIXING THE ISSUE THEY ARE SAYING ITS THE HV BATTERY WHICH IS NOT. THE TOYOTA OF S.F NOT ONLY DIAGNOSED MY CAR WRONG THEY TRIED TO RIP ME OFF BY SPENDING $3600 ON A HV BATTERY THAT DOESNT NEED ANY REPLACEMENT! ON TOP OF THAT THEY ARE REFUSING TO DO THE RECALL.",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,HYBRID PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362052,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED WHILE DRIVING 35 MPH, THE VEHICLE LOSS MOTIVE POWER WITH THE CHECK ENGINE AND HYBRID BATTERY WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO LITHIA TOYOTA OF MEDFORD (1420 N RIVERSIDE AVE, MEDFORD, OR 97501) WHERE IT WAS DETERMINED THAT THE HYBRID BATTERY INTAKE FAILED AND NEED TO BE REPLACED. THE VEHICLE WAS REPAIRED. TWO WEEKS LATER FAILURE AN ABNORMAL SOUND WAS HEARD COMING FROM THE BRAKES. THE VEHICLE THEN WAS TAKEN BACK TO THE SAME DEALER HOWEVER, A DIAGNOSTIC TEST WAS STILL PENDING. THE CONTACT REFERENCED NHTSA ACTION NUMBER: DP19004 (SERVICE BRAKES, HYDRAULIC) 18V684000 (HYBRID PROPULSION SYSTEM) AS POSSIBLE SOLUTIONS TO THE FAILURES HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 112,971.",
        "vin": "JTDKN3DU4E1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361547,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON A HIGHWAY, CHANGED LANES TO AVOID IN ACCIDENT, CAR BEHIND ME CHANGED LANES TOO.  CAR BEHIND FAILED TO SLOW DOWN AND SMASHED TRUNK AND PUSHED ME INTO A STEEL GUARD RAIL.  SIDE, FRONT, AND KNEE AIR BAGS DID NOT DEPLOY.  SEAT BELT PRETENSIONERS DID NOT ENGAGE.  NOR DID HEAD RESTRAINTS.",
        "vin": "JTDKN3DU5E1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361341,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FACING MANY PROBLEMS WITH MY CAR LATELY; IT OVER HEATS ALOT AND SUDDENLY THE SPEED DROPS WHILE THE CAR IS MOVING IN A VERY DANGEROUS HIGHWAY AND I CAN THEN HARDLY DRIVE IT TO PARK IT ASIDE. A MESSAGE STARTED ALSO TO APPEAR FREQUENTLY \"CHECK HYBRID SYSTEM\". I WAS INFORMED BY THE OFFICIAL TOYOTA AGENT IN JORDAN (MARKAZIA) THAT THIS PROBLEMS IS CAUSED BY THE INVERTOR. HOWEVER, THEY ARE DENYING THAT THE INVERTOR FOR THIS CAR WAS RECALLED, CONTRARY TO WHAT THE OFFICAL TOYOTA WEBSITE STATES WHEN I ENTER THE VIN. THEY ALSO CALIM THAT THEY ARE OBLIGATED BY THE MAIN OFFICE TO OFFER A SOFTWARE UPDATE ONLY.",
        "vin": "JTDKN3DU6E0"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11359778,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD ON COLLISION HITTING A TREE, AIRBAGS DID NOT DEPLOY, VEHICLE TOTALED DRIVER IN THE HOSPITAL. ACCIDENT  ON SEPTEMBER 1, 2020 IN TALLAHASSEE, FL",
        "vin": "JTDKN3DU8E0"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352569,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 28,2020 WE WERE DRIVING IN HEAVY RAIN FOR 1 1/2 HRS TO FAYETTEVILLE. OUR BRAKE ABS AND ENGINE LIGHT CAME ON. WE ASSUMED THE LIGHTS WOULD GO OFF, WHEN WE DID NOT DRIVE IT DOING THE NIGHT, BUT NEXT MORNING IT CAME BACK ON. WE CARRIED TO MECHANIC SHOP TODAY SEPT. 1, 2020. THEY COULD NOT READ ANY ERRORS AND SAID NEED TO CARRY IN TO A TOYOTA DEALER. WE HAVE NOT SET UP APT. JUST LEFT VM. HOPEFULLY THEY WILL CALL US BACK TODAY",
        "vin": "JTDKN3DU6E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SPORATIC NON START. NOW EXTREMELY OFTEN,",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321209,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BEING DETAILED, PUDDLE LIGHT WAS SEEN SMOKING ON DRIVERS SIDE DOOR. IT MELTED THE BODY OF DOOR AND HAD TO BE REMOVED. I ALSO HAVE VIDEO OF IT SMOKING AND MELTING DOOR.",
        "vin": "JTDKN3DU3E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310098,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED ON MY VEHICLE AND WHEN I SWITCHED GEARS, FROM PARK TO DRIVE, IT DID NOT REGISTER THAT IT WAS IN DRIVE. WHEN I TRIED TO DRIVE AWAY, THERE WAS NO ACCELERATION AND LACK OF POWER. MY BATTERY WAS OPERATING AT ALMOST MAX CAPACITY.",
        "vin": "JTDKDTB31E1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11306168,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING OUR 2014 TOYOTA PRIUS EASTBOUND ON BROADWAY RD., APPROACHING SOSSAMAN RD., IN MESA, AZ, ON FRIDAY DECEMBER 13, 2019 AT ABOUT 10:00 AM.  WEATHER CONDITIONS WERE CLEAR AND DRY.  SHE WAS ALONE IN THE VEHICLE, WEARING HER SEAT BELT, TRAVELING AT 20 MPH IN A CONSTRUCTION ZONE, WANTING TO TURN SOUTHBOUND ON SOSSAMAN RD., SOME 200 YARDS FURTHER EAST.  CONSTRUCTION CREWS HAD REMOVED A PORTION OF THE ROADWAY, CREATING A DITCH, ABOUT 8 FEET LONG IN THE DIRECTION OF TRAVEL, ABOUT 10 TO 12 INCHES DEEP AND ABOUT TWO LANES WIDE.  AFTER PASSING A CONSTRUCTION VEHICLE, SHE BEGAN HER TURN TO THE RIGHT AND RAN INTO THE DITCH.  THE FRONT WHEELS OF THE PRIUS DROPPED INTO THE DITCH AND PROCEEDED ACROSS THE OPENING SOME 8 FEET, AT A SLIGHT ANGLE, AND IMPACTED THE CONCRETE ROADWAY ON THE OTHER SIDE, CAUSING A SUDDEN AND VIOLENT DECELERATION.  DUE TO THE RELATIVELY SHALLOW DITCH, AND THE LOW GROUND CLEARANCE OF THE PRIUS, THE CAR RODE UP ON THE CONCRETE AND THE BRUNT OF THE IMPACT WAS ABSORBED BY THE UNDERCARRIAGE.  THERE WAS SOME FASCIA AND BUMPER DAMAGE.  THE WHEELS DID NOT IMPACT THE CONCRETE BARRIER.  THE DRIVER'S SIDE AIRBAG DID NOT DEPLOY.  I FILED A CLAIM WITH TOYOTA, AND THEY AGREED TO HAVE THE VEHICLE'S EVENT DATA RECORDER DOWNLOADED.  ANALYSIS OF THE EVENT DATA RECORDER INFORMATION, PROVIDED BY TOYOTA, SHOWS A TOTAL TIME OF 123 MILLISECONDS FOR THE VEHICLE TO REACH A COMPLETE STOP FROM THE POINT OF INITIAL IMPACT, WITH A MAXIMUM LONGITUDINAL DECELERATION OF -14G'S (MY CALCULATION.)  MY WIFE SUFFERED SEVERE NECK INJURIES.  TOYOTA SENT ME A LETTER SAYING THE AIRBAG SYSTEM OPERATED AS DESIGNED AND WAS NOT AT FAULT (MY SUMMARY.)  I DON'T SEE HOW THAT CAN BE, DUE TO THE EXTENT AND NATURE OF MY WIFE'S INJURIES.  OR, TOYOTA'S DESIGN CRITERIA ARE AT FAULT AND DID NOT ANTICIPATE THIS TYPE OF COLLISION.",
        "vin": "JTDKN3DU2E0"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298226,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS TRAVELING DOWN 121 BY GRAPEVINE MILLS MALL. SHE NOTICED A DRIVER BEING AGGRESSIVE. SO SHE ATTEMPTED TO SWITCH TO GET AWAY FROM HIM. WHEN SHE WAS CHECKING TO MERGE TO NEXT LANE THE AGGRESSIVE DRIVER STOPPED FOR NO REASON. INTENTIONELLY WRECKING HER CAR. THEN DRIVING OFF.   HER VEHICLE HAD EXTENSIVE DAMAGE AND HER AIR BACKS NEVER DEPLOYED. HER PRIUS C HAD DRIVER SIDE FRONT END DAMAGE. THE FRONT DRIVER SIDE FENDER WAS RIPPED FROM THE VEHICLE.",
        "vin": "JTDKDTB32E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291370,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS BURNING OIL INTERNALLY.  OIL IS BURNING UP IN 4 WEEK S TUME",
        "vin": "JTDKN3DU6E1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11290363,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAGS DEPLOYED PRIOR TO IMPACT AT A SPEED OF LESS THAN 25 MPH. I APPLIED THE BRAKES VERY FORCEFULLY AND THE AIRBAGS DEPLOYED PRIOR TO IMPACT.  I HAD LITTLE FRONT END DAMAGE AND EVERY SINGLE AIRBAG DEPLOYED.",
        "vin": "JTDKN3DU3E0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "11/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281512,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE HEADLIGHT, RUNNING HIGH BEAMS AND LOW BEAMS, HAVE STOPPED WORKING DESPITE CHANGING THE BULBS. IT SEEMS TO BE AN ISSUE WITH THE BALLAST GOING OUT AND/OR JUST NOT WORKING ANYMORE. THIS SEEMS LIKE A MAJOR SAFETY ISSUE.",
        "vin": "JTDKN3DU9E0"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/09/2019",
        "dateOfIncident": "11/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279107,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED FROM THE SIDE WITHOUT PROVOCATION. ITS POSSIBLE A PEBBLE CAUSED IT, BUT A VERY SMALL PEBBLE AS I NEVER HEARD ANY ROCKS HIT THE WINDOW.",
        "vin": "JTDKN3DU4E0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277409,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLIZZARD PEARL PAINT BEGAN SPLITTING AND FLAKING OFF MY PASSENGER SIDE DOOS. THE LOCATION ON BOTH DOORS IS THE AREA RIGHT BELOW THE WINDOWS. THIS STARTED SEVERAL MONTHS AGO AND NOW LARGE CHUNKS ARE COMING OFF DESPITE HAVING USED A 3 PAINT TOUCH UP PROCESS. NOW THE PATTERN IS REPEATING ON MY DRIVER'S SIDE.",
        "vin": "JTDKN3DU7E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258853,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES THE CAR NOTHING IN THE CAR WILL LIGHT UP NOR WILL IT START.  WE REPLACED THE BATTERY IN THE REAR.  WE REPLACED THE FOB BATTERY.  SOMETIMES WE OPEN THE DRIVER'S DOOR AND SHUT IT AND IT WILL MAKE THE DASH LIGHTS GO ON AND THE CAR WILL THEN STAT WHEN THE START BUTTON IS PUSHED.  THE CAR REMAINS DEAD SOMETIMES NO MATTER HOW MANY TIMES YOU OPEN AND CLOSE THE DRIVERS DOOR.  COME BACK 15 MINUTES LATER AND THE LITTLE RED CAR LIGHT ON THE DASH IS BLINKING AND THE CAR THEN WILL START WHEN START BUTTON IS PUSHED.  OTHER TIMES THE LITLE RED CAR LIGHT ON THE RIGHTSIDE BOTTOM OF THE DASH LIGHTS REMAINS OFF AND CAR REMAINS DEAD.",
        "vin": "JTDKN3DU6E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258035,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER DOOR AND PASSENGER DOOR LOCKS ONLY WORK SOMETIMES AND IT SEEMS TO BE A ELECTRICAL ISSUE BECAUSE I HAVE NOTICED OTHER ODD THINGS WITH THE ELECTRICAL IN THE CAR",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256504,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PRIUS VEHICLES COVERED ONLY BY WARRANTY ENHANCEMENT ZJB ARE SUFFERING THE SAME DANGERS FROM BRAKE BOOSTER PUMP FAILURES AS THOSE TOYOTA COVERED SAFETY RECALLS D0H AND K0L. BY EXCLUDING PRIUS WITH DEFECTIVE BRAKES FROM D0H AND K0L, TOYOTA HAS LEFT THE OWNERS TO HELPLESSLY EXPERIENCE LIFE-THREATENING BRAKE FAILURES OR MALFUNCTIONS BEFORE TOYOTA WILL PROVIDE THE REPLACEMENT BRAKE COMPONENTS NEEDED TO MAKE THE CAR SAFE. THE LAW REQUIRES TOYOTA TO PREVENT THE LIFE-THREATENING DANGERS OF THIS DEFECT BEFORE BRAKE FAILURE OCCURS. TOYOTA'S COST-CUTTING STRATEGY IS CAUSING CRASHES.     INJURIES AND CRASHES CAUSED BY THE BRAKE DEFECT EXPLAINED HEREIN HAVE BEEN REPORTED TO NHTSA. TOYOTA'S DECISION TO PROVIDE POST-FAILURE REPAIR REIMBURSEMENT - INSTEAD OF A PREVENTATIVE SAFETY RECALL REMEDY - EXPLAINS MANY OF THE CRASHES AND INJURIES REPORTED TO NHTSA. HERE IS A LIST OF RELEVANT COMPLAINTS FROM SAFERCAR.GOV:    10794873,10875685,10876015,10927047,11231660,11219354,11014878,11151142,10680404,10627821,11154835,10983408,10704553,10734278,11173353,11064519,10971881,11186947,10923921,10573591,11243249,10819439,10592400,10919990, 10851950,10855586,11240240,11197067,11193820,11173721,11156466,11144698, 11235210,10550179,11253950,11102264,11044156,11253725,10616134,10875625, 11231596,10584723,11207636,10749388,11014797,11203834,11203591,11193354, 11182610,11155778,11130742,11129946,11164336,10498096,11219901,11154783, 10598545,11228248,10547701,11110691,11164990,11222966,11207630,11192342, 11184751,11183661,11183178,11173804,11173173,11173044,11162242,11144888, 11139660,11121916,11088447,11080403,11061959,10984549,11073636, 11034572, 10870866,10929397,11104163    WHEN THE BRAKE BOOSTER PUMP ASSEMBLY FAILS IN A PRIUS VEHICLE EXCLUDED FROM D0H, C1256, C1253, C1252, C1391, U0293, AND OTHER DTCS INDICATING DANGERS AND FMVSS NONCOMPLIANCE ARE BEING STORED.   *TR",
        "vin": "2014 TOYOTA"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CITY STREET ...PRESSED ON GAS AFTER THE LIGHT CHANGED AND IT DID NOT GO FORWARD AND THEN WAIVERED FOR AWHILE. I WAS VERY CLOSE TO HOME. I DO NOT KNOW HOW IT WILL WORK TOMORROW . NO WARNING LIGHTS WERE ON. IT HAS ACTED FUNNY BEFORE LIKE THIS  ON HIGHWAY TRIPS AND THEN IT WOULDN'T DO IT. TOYOTA DEALERS DO NOT EVEN KNOW ABOUT THEM AND IT IS ANNOYING. IT FEELS LIKE A TRANSMISSION SLIPPING BUT HAS LESS THAN 70,000 MILES. I THOUGHT MAYBE HEAT IS DOING IT BUT NOW THAT IT IS OUT  OF WARRANTY IE OVER 5 YEARS OLD, I DO NOT KNOW WHAT TO DO. I AM UNSURE WHAT CAUSES THIS SINCE NO LIGHTS WARN ANYTHING IS WRONG.",
        "vin": "JTDKDTB3XE1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235086,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE DRIVING 40 MPH, THE VEHICLE STALLED ON THE ROAD. THE CONTACT WAS ABLE TO VEER TO THE SHOULDER OF THE ROAD. THE VEHICLE WAS LATER TOWED TO WHITE RIVER TOYOTA (303 SYKES MOUNTAIN AVE, WHITE RIVER JUNCTION, VT 05001, (802) 299-2800) TO BE DIAGNOSED, BUT THE FAILURE COULD NOT BE DUPLICATED. THE MECHANIC ALSO STATED THAT IF THEY COULD NOT DUPLICATE THE FAILURE, THEN THERE WAS NO FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS 63,000.",
        "vin": "JTDZN3EU1E3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231470,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO CROWN TOYOTA (LOCATED AT 255 W PERSHING RD, DECATUR, IL 62526, (217) 615-1049) AND THE CONTACT WAS INFORMED TO HAVE IT DIAGNOSED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 113,127.",
        "vin": "JTDZN3EU2E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "'TAKATA RECALL\"  RECALL DATE: OCTOBER 4, 2018  I TOOK THE CAR ON 12/01/2018 CAR WAS NOT CHECKED BY DEALER FOR RECALL  THE DEALER SHOULD HAVE NOTIFIED US FOR RECALL AND SHOULD HAVE FIXED.",
        "vin": "JTDKN3DU8E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222977,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I START THE CAR AND IT BECOMES IDLE THE BRAKE PEDAL BECOMES STIFF AND GETS STUCK. I HAVE TO PUT THE CAR BACK IN PARK AND RESTART IT FOR THE BRAKE TO WORK PROPERLY. THIS DOESN'T HAPPEN ALL THE TIME BUT HAPPENS ENOUGH FOR ME TO BE CONCERNED. I TOOK IT TO TWO TOYOTA DEALERS AND THEY COULDN'T DUPLICATE IT AND COULDN'T FIND A PROBLEM BUT IT IS STILL HAPPENING. THIS ONLY HAPPENS WHEN I START CAR NOT WHILE DRIVING.",
        "vin": "JTDZN3EUOE3"
    },
    {
        "components": "STRUCTURE,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "12/24/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11208117,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS C. WHILE DRIVING 45 MPH OR ABOVE, WHEN A LARGE VEHICLE PASSED, IT WOULD PULL THE CONTACT'S VEHICLE INTO ITS PATHWAY. THE CONTACT STATED THAT THE FAILURE ALSO OCCURRED IN HIGH WIND CONDITIONS. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT HAD TO SLOW DOWN TO REGAIN CONTROL OF THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. ON MAY 15, 2017, THE VEHICLE WAS INVOLVED IN A COLLISION WITH AN 18-WHEELER. THE CONTACT BELIEVED HE LOST CONTROL OF THE VEHICLE DUE TO THE FAILURE. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUFFERED PAINS AND SOUGHT MEDICAL ATTENTION A MONTH LATER. A POLICE REPORT WAS FILED. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE BODY DAMAGE TO THE PASSENGER SIDE OF THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE PULLING FAILURE AND PROVIDED CASE NUMBER: 1804052396 IN 2018 AS WELL AS CASE NUMBER: 1905141699 FOR THE RECENT FAILURE. THE CONTACT WAS CONCERNED FOR HIS SAFETY BECAUSE THE VEHICLE WAS REAR ENDED ON JANUARY 8, 2019, WHICH DAMAGED THE CHASSIS AND HYBRID BATTERY CAGE. THE CONTACT STATED THAT THE INSURANCE COMPANY REPAIRED THE CHASSIS; HOWEVER, THE HYBRID BATTERY CAGE AND BATTERY WERE NOT REPLACED. THE CONTACT WAS VERY CONCERNED THAT THE VEHICLE COULD CATCH FIRE IN THE EVENT OF A CRASH. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "JTDKDTB37E1"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "01/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180019,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING SUDDENLY I STARTED TO LOSE POWER WITHIN FEW SECOND THE CAR STALLED AND GOT AN HYBRID ERROR AND THE CAR WENT IN SAFE MODE THE CAR DOESN'T GO IN D ONLY N OR P, ALSO THE DASHBOARD LIGHTING GOES ON AND OFF AND SMOKING SO I TOWED THE CAR TO LARRY H MILLER TOYOTA CORONA CA, THE MANAGE DUSTIN SAID THIS IS RECALL ISSUE AND WE NEED TO UPDATE THE SOFTWARE TWO DAYS LATER THE SERVICE AGENT MRS LORENA SAID WE FOUND COOLANT IN THE OIL AND OUR SERVICE TECH THINKS I HAVE BLOWN HEAD GASKET BUT TALKING WITH TOYOTA MANUFACTURER IS COVERED AND I CAN GET RENTAL CAR TOO BUT I NEED TO AUTHORISE $2040 YEAR DOWN BECAUSE TOYOTA WANTS TO KNOW WHAT CAUSE THE HEAD GASKET TO FAILED BUT MRS LORENA ASSURED ME 'I 100% COVERED AND I WILL NOT HAVE TO PAY' SO I AGREED  TWO DAYS LATER DUSTIN THE SERVICE MANAGER CALLED AND SAID I NEED TO COME TO DEALER SHOP HE WANTS TO SHOW ME SOMETHING SO I HAD TO CALL THE BASE (AIR FORCE) AND GET HALF DAY OFF WHEN I GOT THERE MY CAR WAS DISASSEMBLED EXCEPT I COULD SEE THE PISTONS AND THE BLOCK TOYOTA TECH HAD RULERS AND FILLERS GAGE AND SHOWING ME THAT MY BLOCK IS WARPED ABOUT 0.008 INCH AND I NEED A NEW ENGINE AROUND $11,000 OR USED ABOUT $8,200 OR I CAN TAKE MY CAR AS IS WITHOUT PAYING ANYTHING I TOLD I CANNOT AFFORDS IT SO I TOWED THE CAR HOME, PRIOR TO BECOMING AN ENGINEER I WAS MACHINEST  SO I SENT THE HEAD TO MACHINE SHOP FOR EXAMINATION THE CYLINDER HEAD WAS FLAT AND HAS NO CRACK OR SIGN OF FAILURE AND MADE OF ALUMINIUM IF THE BLOCK IS WARPED THE HEAD SHOULD BE WARPED TOO AND THE TECH MEASUREMENTS WAS INCORRECT BECAUSE AFTER CLEANING THE BLOCK SURFACE FROM GASKET DEBRIS WAS FLAT TOO SO I CALLED THE DEALER ABOUT MY FINDING I WAS TOLD DUSTIN IS IN VACATION AND COMING BACK ON 2/12/2019 TODAY IS 2/14/2019 AND HE IS NOT RETURNING MY CALL I TOOK THE CAR RUNNING BUT DOESN'T GO TO DRIVE FOR RECALL NOW I HAVE DISASSEMBLED CAR. THIS IS 2ND TIME HYBRID ISSUES.",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176429,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER MECHANICS AT TOYOTA BERKELEY, TOYOTA VALLEJO AND CITY IN DALY CITY ALL HAVE STATED THAT THE CRACK IN MY OIL TANK IS A 'WELL KNOWN' MANUFACTURER DEFECT. THE MECHANICS STATE WHEN BUILDING THAT PART, A MACHINE CLAMPED THE 2 PARTS TOGETHER. BUT THE MACHINE DOESN'T  WIPE IT DOWN BEFOREHAND AND ANY OIL WILL KEEP THE 2 PIECES SEPARATED, WHICH EVENTUALLY FORM A CRACK. WHEN THE OIL IS LEFT UNCHANGED FOR A PERIOD OF TIME THE CRACK GETS BIGGER, THE OIL LEAKS AND EVENTUALLY DOESN'T WORK. I WAS TOLD IF I KEEP UP WITH MY REGULAR OIL CHANGES, IT SHOULD WORK. BUT I GET ANXIETY NOW EVERY TIME THAT MAINTENANCE LIGHT GOES ON AND I FEEL LIKE I HAVE TO CHANGE THE OIL IMMEDIATELY OR ELSE.",
        "vin": "JTDKN3DU9E1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173353,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EDR REPORT CLEARLY SHOWED THAT THE BRAKE OIL PRESSURE CHANGES DID NOT CORRELATE WITH THE PROGRESSIVELY INCREASING VEHICLE DECELERATION. THE ISSUE IS OCCASIONAL, RARE AND CANNOT BE REPRODUCED EVERY SINGLE TIME. THIS LEADS TO DISPARITY IN ASSUMED BRAKING DISTANCE FROM ROUTINE EXPERIENCE BY DRIVING THE VEHICLE AND ACTUAL BRAKING DISTANCE AT THE TIME OF FAILED BRAKING WHICH SUPPOSEDLY MAY BE AS A RESULT OF INVERTER ISSUES THAT ARE RESPONSIBLE FOR EXCLUSIVELY REGENERATIVE BRAKING AT LOW (<50 MPH) SPEEDS.",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR NHTSA - MY NAME IS [XXX]; I RESIDE IN CA.   1. I HAVE A 2000 TOYOTA CAMRY & A 2014 TOYOTA PRIUS.   2. THE 2000 TOYOTA CAMRY HAS THE DAY TIME RUNNING LIGHTS AS A STANDARD FEATURE.   3. THE 2014 TOYOTA PRIUS DOES NOT HAVE THE DAY TIME RUNNING LIGHTS AS A STANDARD FEATURE.  4. IN STATES LIKE CA & I BET IN OTHER STATES - DAY TIME RUNNING LIGHTS & HEAD LIGHTS GETTING TURNED ON WITH LIMITED SUN LIGHT SHOULD BE MADE MANDATORY.   5. THIS IS MORE OF A SAFETY FEATURE THAN AN OPTION.  6. IT WILL HELP PREVENT ACCIDENTS, IT WILL HELP COMPLIANCE WITH THE LAW WHERE APPLICABLE WHEN IT IS RAINING & HEAD LIGHTS ARE MANDATORY  7. IT WILL ALSO SAVE ANYONE FROM GETTING TRAFFIC VIOLATION TICKETS  8. CAN YOU ALL PLS LOOK INTO THIS & HELP REVIEW TO MAKE THIS AS A MANDATORY FEATURE?    THANKS IN ADVANCE  [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *CW  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11154835,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES COMPLETELY FAILED AND I REAR ENDED A CAR.  I WAS STOPPING NORMALLY ON A CITY STREET.  ACCORDING TO DASHCAM I WAS TRAVELING AT ABOUT 25MPH.  THE CAR SLOWED TO ABOUT 12MPH WHEN THE BRAKES WENT DOWN TO THE FLOOR AND THE CAR ACCELERATED.",
        "vin": "JTDKN3DU4E0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154525,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS C. WHILE DRIVING 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE MANAGED TO RESTART AFTER A FEW ATTEMPTS AND THE FAILURE WAS CORRECTED. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE HOME. A DEALER AND THE MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 49,000. *DT  CONSUMER STATED DEALER RAN COMPLETE DIAGNOSTICS AND FOUND NO FAULTS LOGGED. CONSUMER WILL REPLACE INVERTER. *JB",
        "vin": "JTDKDTB31E1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151409,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING DOWN THE HIGHWAY AT ABOUT 70 MPH WHEN ALL THE SUDDEN THE  PRIUS LOST POWER. THE PRIUS DROPPED DOWN TO ABOUT 55 MPH. AFTER A SHORT PERIOD OF TIME THE POWER PICKED UP. I GOT OFF THE HIGHWAY AND TOOK THE BACK ROADS. IT WAS A VERY HOT DAY.",
        "vin": "JTDKN3DU2E0"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151142,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR BRAKES FAILED AT LOW SPEEDS (10-15 MPH) AND BUMPED INTO THE CAR IN FRONT IN A STOP-AND-GO TRAFFIC ON THE WET FREEWAY AFTER A RECENT RAIN. THE BRAKE PEDAL WENT ALL THE WAY DOWN TO TOUCH THE FLOOR, AS IF THE BRAKE PEDAL WAS DISENGAGED FROM THE BRAKING SYSTEM AND THE ABS LIGHT DID NOT TURN ON AT THE TIME OF BRAKING. THE CAR WAS DRIVING IN THE STRAIGHT LINE AND IMMEDIATELY BEFORE THIS I WAS ABLE TO SUCCESSFULLY BRAKE THE CAR ON THE VERY SAME TRIP. SO THE PROBLEM IS INTERMITTENT. THIS IS THE SECOND TIME WITH THIS CAR, AS MY SPOUSE ALSO EXPERIENCED THE SIMILAR BRAKE FAILURE AT EVEN LOWER SPEEDS (<10 MPH) RESULTING IN TOUCHING THE CAR IN FRONT AND MINOR SCRATCH ON THE BUMPER. IT WAS A DRY DAY THEN AND ALMOST SIMILAR CIRCUMSTANCES. ASSOCIATED GEICO CLAIM NUMBER IS 0423477190101054. WE OPENED A CASE WITH TOYOTA TO CHECK THE DATA RECORDER. ASSOCIATED TOYOTA CASE NUMBER IS 181112370.",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151007,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW LIGHT BEAMS ON THE CAR BURNOUT EVERY FEW WEEKS. IT MAKES IT VERY DIFFICULT AND UNSAFE TO DRIVE AT NIGHT. I WILL BUY A NEW BULB AND INSTALL IT AND THEN IT BURNS OUT IN A FEW DAYS OR A WEEK OR TWO LATER. I HAVE TRIED  VARIOUS BRANDS OF BULBS BUT I JUST DO NOT THINK IT IS A BULB ISSUE. I HAVE ALSO BROUGHT THE CAR TO A MECHANIC TO REPLACE THE BULBS BUT THE SAME ISSUE CONTINUES.",
        "vin": "JTDKN3DU4E0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139354,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON AN INTERSTATE HIGHWAY USING CRUISE CONTROL AND GOING ABOUT 72MPH.  THE PRIUS SUDDENLY SHUT DOWN.  AT FIRST I THOUGHT I HAD BUMPED THE CRUISE CONTROL SO I TRIED RESETTING IT BUT NOTHING HAPPENED.  I STEPPED ON THE GAS AND NOTHING HAPPENED I CONTINUED TO SLOW DOWN.  MADE IT TO THE SIDE OF THE HIGHWAY WHERE I SAT WONDERING WHAT HAD HAPPENED.  AFTER SHUTTING THE CAR DOWN I RESTARTED IT AND IT SEEMED TO BE OK SO I CONTINUED MY TRIP.  NEVER FORGOT THE EPISODE.",
        "vin": "JTDKN3DU9E0"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/07/2018",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IN MOTION IN A RESIDENTIAL AREA, MOVING AT A LOW SPEED, UNDER 25MPH. WHILE IN AN UNDULATING PORTION OF THE ROAD, DURING ENTRY AND EXIT FROM A DIP AND SLIGHT TURN IN THE ROAD, THE ENGINE STALLED FOR A BRIEF MOMENT, FOR NO MORE THAN A SECOND OR SO THE ACCELERATOR WAS NON-RESPONSIVE, CAUSING ME TO FORCE A STOP BY USING THE BRAKE, AFTER WHICH TIME THE MOTOR RE-ENGAGED AS NORMAL. UNKNOWN CAUSE, HAPPENED ONCE IN MY EXPERIENCE WITH THE CAR AND NEVER AGAIN. CAR HAS BEEN DRIVEN BY MY DAUGHTER FOR THE LAST 3+ YEARS, SHE HAS NOT REPORTED A RECURRENCE OF THE PROBLEM.",
        "vin": "JTDKDTB30E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "07/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING THE FRONT WHEEL ROLLED OVER A SUNKEN SEWER COVER CAUSING TEMPORARY BRAKING FAILURE AND A SLIDING SENSATION.",
        "vin": "JTDKN3DDU5E"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11114182,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 TOYOTA PRIUS C. WHILE DRIVING APPROXIMATELY 30 MPH, THE FRONT DRIVER SIDE OF THE CONTACT'S VEHICLE WAS STRUCK BY ANOTHER VEHICLE. THE SIDE AND FRONT DRIVER SIDE AIR BAGS DEPLOYED, BUT NEITHER STOPPED THE DRIVER FROM MAKING CONTACT WITH THE WINDSHIELD. IN ADDITION, THE SEAT BELT DID NOT RESTRAIN THE DRIVER. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED FACIAL LACERATIONS, CONTUSIONS TO THE LEFT ARM, SHOULDER, AND HIP, AND SEVERE HEADACHES THE REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED A TOTAL LOSS BY THE INSURANCE COMPANY. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO DETERMINE THE CAUSE OF THE FAILURES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "JTDKDTB3XE1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "07/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113935,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BATTERY CEASED FUNCTION FOLLOWING HEAT WAVE - REQUIRED SECONDARY BATTERY REPLACEMENT. VEHICLE WAS STATIONARY AFTER SHORT DRIVE (1 MILE) FOLLOWING 24 HOUR NON OPERATION DURING HIGH HEAT (100+). ATTEMPTED TO TURN CAR ON AND ENGINE WOULD NOT START. REQUIRED A TOW AND FULL BATTERY REPLACEMENT.",
        "vin": "JTDKDTB39E1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "03/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110145,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE DRIVING HOME IN THE 55 SOUTH WITH MY FAMILY I HAD FOURTH MONTH OLD AND 2 YEAR OLD AND MY WIFE ALL OF SUDDEN THE CAR WAS STALLED IN THE CARPOOL LANE.IT WAS SCARY PART ME WHAT CAN DO.I NEED TO REACT FAST.WE WHERE THANKFUL THAT WE PULLED OUT SAFELY.THE NEXT DAY I WENT TO THE DEALERSHIP TO INSPECTION AND THEY TAKE A WHILE TO CHECK SO I LEFT MY CAR FOR TWO DAYS.AND THEY SAID THAT FIVE DIFFERENT CODES AND I'M GONNA PAY 3K JUST TOO TAKE IT APART AND PLUS LABOR AND PARTS.I TELL MY STORY WHAT HAPPENED THEY WANT ME TOO PAY.THE WAS WELL MAINTAINED AND THAT DAY ALL THE LIGHTS WHERE ON THE DASHBOARD.I CALLED THE TOYOTA HEADQUARTERS  ON COSTA MESA.BUT THEY SAID MY WARRANTY WHERE EXPIRED. SO CANNOT HELPED ME. BUT FOR FAMILY SAFETY I JUST WANTED TO SAY IF JUST FIXED THE DEFECTS ON THE CAR OR JUST RECALLED.I STILL HAD THE CAR AND ABLE TO DRIVE.I FILLED THIS TODAY BECAUSE I HAPPEN AGAIN.",
        "vin": "JTDKN3DU6E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103641,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR DOOR LOCK ACTUATORS HAVE FAILED ON MY 2014 VEHICLE. TOYOTA DENIES ANY KNOWLEDGE OF THIS AS A COMMON PROBLEM, BUT THE INTERNET SHOWS THAT IT IS A PROBLEM AFTER ONLY 3 OR 4 YEARS OF PURCHASE OF A BRAND NEW VEHICLE. REPAIR COSTS ARE VERY HIGH FOR EACH DOOR FOR THIS PROBLEM. THERE IS ONLY ONE DOOR WITH KEY ENTRY.",
        "vin": "JTDKDTB39E1"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098503,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIUS WINDSHIELD IS PRONE TO CRACK WHEN TRAVELING ON HIGHWAY.  I WAS TRAVELING ON HIGHWAY WHEN A TINY ROCK HIT THE LOWER RIGHT SIDE OF MY WINDSHIELD. THEN I COULD SEE THE TINY CRACK GETTING LONGER UNTIL IT NEARLY REACHED THE MIDDLE IN A MATTER OF TWO MINUTES. PRIUS OWNER SHOULD NOT HAVE TO PUT UP WITH THIS EXPENSIVE AND DANGEROUS DEFECT.",
        "vin": "JTDKN3DU5E0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/25/2018",
        "dateOfIncident": "04/14/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090167,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I ACTUALLY WOULD LIKE TO FILE A CONCERN REGARDING THE 2010 - 2014 INVERTER/COMPONENT FAILURES.  THIS PROBLEM WAS BROUGHT TO MY ATTENTION BY MY DEALER INDICATING THAT THE MOTOR/GENERATOR ECU COULD RESET, CAUSING THE HYBRID SYSTEM TO SHUT DOWN, RESULTING IN MY VEHICLE STOPPING WHILE BEING DRIVEN AND SUBJECTING ME OR WHOM EVER IS DRIVING AT RISK OF A CRASH.  I CALLED TOYOTA CUSTOMER SERVICE AND SHOW LITTLE CONCERN FOR THIS POTENTIAL PROBLEM BUT JUST TOLD ME THAT I SHOULD VERIFY WITH MY DEALER THAT THE EOE-PRIUS RECALL TO REFRESH SOFTWARE IN THE INVERTER WAS PERFORMED.  IT WAS CONFIRMED THAT IT WAS PERFORMED ON MY CAR ON 2/14/14 AT SAN FRANCISCO TOYOTA AND THAT THEY TENDED THE WARRANTY FOR 15 YEARS, UNLIMITED MILEAGE.  MY DEALER TOLD ME THAT SOME VEHICLES  THAT HAVE HAD THE EOE-PRIUS RECALL HAVE STILL SUFFERED INVERTER FAILURE.  IS TOYOTA GOING TO WAIT FOR SOMEONE TO DIE, BEFORE THEY WILL CORRECT THIS PROBLEM.      A VERY  CONCERNED PIRUS OWNER! IM JUST WONDERING IF I SHOULD SELL MY PIRUS BEFORE IT (TOYOTA) KILLS ME OR SOMEONE I LOVE.",
        "vin": "JTDKN3DUXE1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088619,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING INTO A PARKING STALL ALMOST STOPPED.  MY CAR SUDDENLY ACCELERATED AND JUMPED THE CURB.",
        "vin": "JTDKN3DU0E0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084469,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A FREEWAY OFF RAMP WHEN THE POWER JUST STOPPED. IT DID NOT SLOW BUT STOPPED AND I MANAGED TO PULL OVER. THE WARNING SIGNALS ALL CAME ON AND SO I COULD NOT LOOK UP THE PROBLEM. SINCE THEN THEY SAY THERE IS A PROBLEM WITH THE INVERTER BUT THE DEALER WILL NOT FIX IT EVEN THOUGH WE ARE UNDER THE ORIGINAL WARRANTY AS WELL AS BUYING AN EXTRA CERTIFIED PLATINUM WARRANTY FOR $2000!",
        "vin": "JTDKN3DU8E0"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083178,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALL . SHOW 'CHECK HYBRID SYSTEM '   STOP THE VEHICLE IN A SAFE PLACE'  DEALER SAID PROBABLY INVERTER IPM FAILED.",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078355,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING THE STEERING WHEEL MORE THAN QUARTER TURN. RATTLING, CLICKING NOISE IS APPARENT OUT OF CENTER STEERING CONSOLE. TURNING THE STEERING WHEEL MORE THAN 360 DEGREES. THERE ARE SEVERAL RATTLES AND CLICKS IN THE WHEEL. DRIVING IS NOT AFFECTED. IT FEELS AS IF SOMETHING IS LOOSE INSIDE THE AIRBAG. THE MAIN CONCERN IS A FEELING OF LOOSENESS NEAR THE AIRBAG CENTER. THE VEHICLE CAN BE STATIONARY IN MOTION. IT DOES NOT MATTER IF THE VEHICLES IN MOTION. THE ONLY THING IN MOTION IS THE STEERING WHEEL.",
        "vin": "JTDZN3EU5EJ"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "11/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A  2014 TOYOTA PRIUS C 10-07-2017 FROM CARVANA WITH LESS THAN 30,000 MILES. WITH 2 NEW TIRES IN THE FRONT BRIDGESTONE ECOPIA 175/65 R15. IT  WOBBLES AT SPEEDS ABOVE 50 MPH AND SLOPPY STEERING THE ROAD WAS DRY. WELL AT THAT TIME THE THE CAR WAS STILL UNDER WARRANT WITH CARVANA SO IF I CHANGE MY MIND ABOUT IT I COULD GET ANOTHER CAR. SEARCHED THE WEB FOR SIMILAR COMPLAINTS AND FOUND A FEW. SO WE TOOK THE CAR TO A PLACE THAT SOLD BRIDGESTONE TIRES TO REPLACE THE REAR TIRES THAT WERE ORIGINAL BUT GOODYEAR BRAND SAME SIZE. SO NOW WE HAVE 4 TIRES THE SAME AND QUESS WHAT HAPPEN THE SAME WOBBLY DRIVING AND SLOPPY STEERING AT 50 MPH. SO WE TOOK THE CAR BACK TO THE SHOP. THE MECHANIC SAID I GUESS THAT IS WHY THEY PUT THE 2 NEW TIRES IN THE FRONT TO CORRRECT THE PROBLEM BUT WHAT YOU NEED AFTER MY TEST DRIVE IS A 4 WHEEL ALIGNMENT. SO I SAID GO AHEAD AND DO IT. DURING THE PROCESS THE ALIGNMENT MECHANIC GUY SAID THE FRONT PASSED BUT THE REAR FAILED. SO THEY CALLED TOYOTA DEALERSHIP AND ASKED IF THEY WERE SPECIAL SHIMS TO FIX THE REAR ALIGNMENT.  THE TOYOTA DEALERSHIP SAID THERE ARE NO PARTS FOR THAT BECAUSE THAT CAR MODEL DOES NOT REQUIRE A REAR ALIGNMENT. THE C IN TOYOTA PRIUS MEANS C IS FOR CITY DRIVING ONLY. WE WERE STUNNED. I SAID I KNEW THEY HAD A REASON WHY THEY GOT RID OF THE CAR BUT CAN YOU FIX IT ? THE MECHANIC SAID IT IS A POSSIBLE FACTORY DEFECT AND WE SEE SOME OF THOSE SOMETIMES BUT I THINK WE CAN FIX IT AND SOLVE YOUR PROBLEMS WITH THAT CAR. WE CAN USE SOME SHIMS THAT ARE MADE FOR A DIFFERENT TYPE OF TOYOTA CAR AND SEE IF WE CAN GET IT IN PROPER ALIGNMENT. I SAID I AM WILLING TO GAMBLE ON YOUR EXPERTISE GO AHEAD AND DO IT. IT IS STILL UNDER WARRANTY WITH CARVANA BUT I DO LIKE THE HATCHBACK CAR. AFTER THE WORK WAS DONE THE TEST DRIVE PROVED THE SUCCESS AND THE PROBLEM WAS GONE. OH AND BY THE WAY IT DRIVES GREAT ON THE HIGHWAY AND I STILL OWN IT.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/02/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 'LEATHER' PACKAGE UPGRADE. SEATS STARTING SEPARATING A YEAR AGO. GOT TIRED OF RUN AROUND WITH DEALER TO MAKE REPAIRS. TOOK IT TO ANOTHER DEALER TO BE TOLD SEATS WERE SIMULATED VINYL LEATHER. GOT SEATS REPAIRED OUT OF MY OWN POCKET. NO MORE TOYOTA'S FOR US!",
        "vin": "JTDZN3EU5EJ"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064519,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A WINTER DAY MY CAR SLID DOWN A STEEP ROAD AND WOULD NOT STOP WHILE BREAKING,  BOTH FRONT FENDER FLARES BROKE OFF CAUSING THE CAR TO ACT LIKE IT WAS ON A SLED.  THE CAR EVENTUALLY STOPPED AFTER I PLACED IT IN NEUTRAL AND THEN SLID AGAIN AND THEN IT FINALLY STOPPED.  I ALMOST KILLED MYSELF.",
        "vin": "JTDKN3DU0E0"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "01/12/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063809,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, JANUARY 12, 2018 I FOUNT THE CAR SEAT SEVERELY SMOLDERING ON THE PASSENGER SIDE.  THE CARE WAS FILLED WITH BROWN SMOKE AND TOXIC FUMES.  THE SEAT WAS COMPLETELY BURNED AND MELTED AND TOXIC RESIDUE.  FIRE DEPARTMENT PUT OUT FIRE WITH WATER.  CAR SEAT HEATER APPARENTLY DID NOT TURN OFF AND SMOLDERED ALL NIGHT.  TOYOTA GIVING ME THE RUN AROUND, DELAYING INVESTIGATION AT LEAST 5 WEEKS OR MORE. THE CAR WAS PARKED IN GARAGE, LAST DRIVEN BRIEF DISTANCE EVENING BEFORE.  GARAGE NOW WITH TOXIC FUMES AND RESIDUE.  CAR LIKELY TOTALED, AND TOYOTA TRYING TO GET OUT OF ANY ASSISTANCE/RESPONSIBILITY.  THEY ARE ON PURPOSE BEING VERY DIFFICULT, AND FORCING ME TO COMPLY WITH THEIR AGENDA, OR LOSE OPTION FOR THEIR TAKING SOME RESPONSIBILITY.",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/07/2018",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "A LOS 3 MESES DE COMPRADO FUE EN MARZO 2017 DIO LA PRIMERA VEZ EL PROBLEMA EN TODO EL SISTEMA DE FRENOS LO REPARE Y AL MISMO TIEMPO EXACTO FINALES DE JUNIO 2017 VOLVIO A DAR EL MISMO PROBLEMA EL CONCESIONARIO NO QUIZO RESPONDER NI PORQUE TENIA GARANTIA LLEVE EL CARRO Y COMO NO SE PODIA MANEJAR POR LOS FRENOS NO SERVIAN ME ENVIARON EL CARRO EN GRUA A MI CASA NO LO USO DESDE AGOSTO Y LO ESTOY PAGANDO Y POR LOGICA YA SUCEDIO DOS VECES EL CARRO NO SIRVE Y YA NO SE A QUIEN PEDIR AYUDA PORQUE EL CARRO AUNQUE SE REPARE SU PROBLEMA SE VOLVERA A REPETIR PORQUE EL CARRO NO SIRVE Y ME E ENCONTRADO UN COMUNICADO DONDE DICEN QUE LOS PRIUS MUCHOS HAN RESULTADO CON EL MISMO PROBLEMA DE LOS FRENOS. TOYATA DIJO EN UNOS DE MIS RECLAMOS QUE ERA MI CULPA Y NI EN LO MAS ABSOLUTO NL ES MI CULPA SOY DUEA DE 3 CARROS MAS Y MAS VIEJOS Y CON NINGUNO HE TENIDO PROBLEMAS DE NINGUNA INDOLE ESPERO PUEDAN AYUDARME PORQUE MI VIDA Y LA DE MI HIJA CORREN PELIGRO AL MANEJAR ESE VEHICULO. ADJUNTO FOTO DE CUANDO DEL DEALER MANDARON MI CARRO PORQUE NO ES NADA SEGURO MANEJARLO.&#128544;",
        "vin": "JTDKDTB39E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/27/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056896,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WITHOUT WARNING, THE FRONT PASSENGER SIDE GLASS WINDOW FRACTURED. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER OR AN INDEPENDENT MECHANIC. THE CONTACT REPLACED THE PART DUE TO THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THIS WAS NOT A KNOWN ISSUE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/11/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054636,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I TRIED TO MAKE A RIGHT TURN AT A VERY BUSY INTERSECTION, I HEARD A STRANGE NOISE AND TOTALLY LOST CONTROL OF THE STEERING WHEELING. I TURNED THE STEERING WHEEL 360 DEGREES ALL THE WAY, AROUND AND AROUND, BUT THE CAR KEPT GOING STRAIGHT... AFTER A MINUTE OR SO, THE COORDINATION BETWEEN THE STEERING WHEEL AND THE WHEELS RE-ESTABLISHED AND I COULD MANAGE TO DRIVE TO A NEARBY PARKING LOT. THE SITUATION HAPPENED AGAIN IN THE PARKING LOT BEFORE IT CAME BACK TO NORMAL. WE TOOK THE CAR TO A LOCAL TOYOTA DEALERSHIP AND LEFT IT THERE FOR 2 DAYS. HOWEVER, TECHNICIANS SAID THEY COULD NOT DUPLICATION THE ISSUE MEANING THEY COULD NOT FIND ANY PROBLEM WITH IT. THEY TOLD US THAT IT IS PROBABLY THE ELECTRICITY PART! WE ARE VERY UNSATISFIED WITH THE ANSWER AND VERY CONCERNED ABOUT THE UNSAFE CONDITION IT MAY CAUSE.",
        "vin": "JTDKN3DU4E0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053939,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON PRIUS ARE NOT BRIGHT ENOUGH TO SEE THE ROAD AHEAD OF THE CAR. THE ARE ON BUT SOMEWHAT DIM. OTHER DRIVERS CAN SEE THE LIGHTS, BUT THE LIGHTS ARE NOT BRIGHT ENOUGH TO ILLUMINATE THE ROAD IN FRONT OF THE CAR.  THIS OCCURRED AFTER I TOOK  THE CAR IN TO THE DEALER TO COMPLAIN ABOUT A SERIES OF ELECTRICAL RELATED PROBLEMS THAT ALL STARTED HAPPENING AT THE SAME TIME. THE DEALER REPLACED THE HEADLIGHTS AFTER THEY DETERMINED THE HEADLIGHTS HAD BURNED OUT. IMMEDIATELY, I NOTICED THAT DURING TIMES WHEN I WAS DRIVING AT NIGHT, THE NIGHT VISIBILITY WAS NOT WHAT IT HAD BEEN PRIOR TO PROBLEM FIRST OCCURRING. I HAVE TAKEN THE CAR BACK TO THE DEALER BU THEY SAY THERE IS NOTHING WRONG WITH THE HEADLIGHTS.",
        "vin": "JTDKN3DU3E0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11052847,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOV 22 2017 I PARKED MY CAR AT 1719 BRADER PL. SOUTH IN SEATTLE, WASHINGTON IN A CITY STREET.  APPROXIMATELY AT 1500 PM, I PULED THE CAR FROM THE STREET PARKING I-ORDER TO PICK A PASSENGER ABOUT 4 FEET AND THE CAR  ACCELERATED BY ITSELF TOWARD RIGHT INTO THE BUILDING COMPLEX ON RIGHT AND FLIPPED ON THE SIDE OF THE DRIVER SIDE.  THE CAR WAS ON DRIVE BUT I WAS TRYING TO STOP TO PICK UP A PASSENGER, BUT FAILED TO STOP AND ACCELERATED AND TURNED AND FOUND MYSELF FLIPPED ON THE SIDE AS YOU CAN SEE ON PICTURE.",
        "vin": "JTDKN3DU8E0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT NIGHT ON BACK ROADS WHEN BOTH HEADLIGHTS WENT OUT.  I STOPPED THE CAR, TURNED IT OFF AND RESTARTED IT TO SEE WHAT WOULD HAPPEN.  THE LIGHTS DID NOT GO ON, HOWEVER, I FOUND THAT IF I HELD THE SWITCH UP AS THOUGH I WAS TURNING ON HIGH BEAMS, THE HIGH BEAMS WORKED.  I COULD NOT GET THE LOW BEAMS TO WORK.  I WAS TAKING SOMEONE HOME AND STOPPED AT THEIR HOUSE.  WHEN I CAME BACK TO THE CAR AND TURNED IT ON, THE LIGHTS WORKED NORMALLY.",
        "vin": "JTDKDTB36E1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021694,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "PROXES 4 PLUS",
                "productYear": "9999",
                "size": "P205/55R/R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS EQUIPPED WITH TOYO PROXES A20 (NA) TIRES, SIZE: P215/50/R17 (NA). WHILE THE TIRES WERE BEING REPAIRED AT GATEWAY TIRE (8115 MACON ROAD, CORDOVA, TN 38018; 901-624-0911), THE CONTACT WAS INFORMED OF A SLIGHT TEAR THAT CIRCLED THE INSIDE OF ALL FOUR TIRES, CAUSING THE TREAD TO SLIGHTLY SEPARATE. THE DEALER DIAGNOSED THAT ALL FOUR TIRES NEEDED TO BE REPLACED. THE TIRES WERE REPLACED. THE TIRE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND OFFERED TO PAY A PORTION OF THE REPLACEMENT COST. THE DOT NUMBER WAS UNKNOWN. THE APPROXIMATE VEHICLE AND TIRE FAILURE MILEAGE WAS 40,694",
        "vin": "JTDZN3EU3E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015750,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC BURNING SMELL EMANATING FROM FRONT OF CAR SMELL COMING QUESTIONABLY THROUGH AIR DUCTS WHICH COMES/GOES AND IS NOTED UPON STARTING CAR AND FOR FIVE MINUTES DURATION AFTER START. INCREASE INCIDENCE OF BURNING SMELL ON DAYS WHEN AMBIENT AIR TEMPERATURE IS 90 OR HIGHER. I WONDER IF I AM INHALING TOXIC FUMES . WILL CONSIDER REPORT OF PROBLEM TO THE EPA.  CHECKED BY POHANKA TOYOTA IN EARLY SUMMER \"COULD NOT DUPLICATE SMELL PROBLEM\" NO FOLLOW-UP. REPORT MADE TO TOYOTA MOTORS PER EMAIL AND TO REPRESENTATIVE AS WELL  AT TOYOTA. STATED \" WE WILL REPORT YOUR ISSUE TO THE ADMINISTRATION; \"NO RECOMMENDED FOLLOW-UP. INTERNET SEARCH INDICATES THERE ARE SEVERAL MODELS OF TOYOTAS WITH SIMILAR COMPLAINTS. IT IS ABOUT TIME THERE WOULD BE A RECALL AND SOMETHING DONE ABOUT THIS  BLOCK BELOW ASKING WHEN DID THIS HAPPEN IS FORCED CHOICE FOR DATE(SO NOT ACCURATE REFLECTION OF THE PROBLEM); THIS HAS BEEN HAPPENING ON/OFF SINCE MAY 2017    S. I DID INFORM THE TOYOTA REP BY PHONE THAT I WOULD FILE A COMPLAINT WITH MY STATE ATTORNEY GENERAL'S OFFICE AND THE BETTER BUSINESS BUREAU.",
        "vin": "JTDKN3DUXE1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/16/2017",
        "dateOfIncident": "05/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995639,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR USED, IN MAY 2017 WITH 14,500 MILES. I AM HAVING AN INTERMITTENT PROBLEM OF THE CAR SHIFTING BACK INTO REVERSE WHEN I AM TRYING TO SHIFT FROM REVERSE TO DRIVE. IT HAS HAPPENED APPROXIMATELY A DOZEN TIMES SINCE IN 5 WEEKS. I HAVE BROUGHT IT TO THE DEALERSHIP WHERE I PURCHASED THE CAR 3 TIMES. THEY ARE CURRENTLY KEEPING THE CAR OVERNIGHT. THEY HAVE NOT BEEN ABLE TO DUPLICATE THE PROBLEM, AS IT IS INTERMITTENT, AND DO NOT GET ANY CODES WHEN THEY'VE CHECKED THE CAR. THE ARE SUGGESTING IT IS A \"DRIVER ERROR\". IT DOES NOT SEEM TO MAKE A DIFFERENCE IF IT IS HOT OR COLD, ON A SLOPE OR FLAT SURFACE, OR IF THE CAR HAS BEEN SITTING IDLE FOR SOME TIME, OR HAVING BEEN DRIVEN A LONG DISTANCE. IT HAS HAPPENED IN EVERY SUCH SITUATION.",
        "vin": "JTDKN3DU3E0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/03/2017",
        "dateOfIncident": "05/29/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10992976,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED, THE STRUTS THAT HOLD OPEN THE REAR LIFT HATCH FAILED SUDDENLY, CAUSING THE HATCH TO FALL ON THE HEAD OF PERSON LOADING THE CAR. THE HATCH WAS CAUGHT BY A SECOND PERSON, PREVENTING SERIOUS INJURY.  ON INSPECTION, THE STRUTS WERE LEAKING OIL.",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/29/2017",
        "dateOfIncident": "05/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992060,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN UNINTENDED ACCELERATION.  2014 PRIUS WAS PARKED FOR A FEW DAYS IN HOT, HUMID WEATHER.  WHEN PULLING THE CAR INTO THE DRIVEWAY AT A LOW SPEED, THE CAR SUDDENLY ACCELERATED TO A VELOCITY FAST ENOUGH TO COLLIDE WITH AN SUV PARKED IN THE DRIVEWAY, KNOCKING IT THROUGH A METAL FENCE AND INTO THE BACKYARD.  IT ALSO CAUSED THE DRIVER OF THE PRIUS WHIPLASH AND A HEAD INJURY.  THE BRAKE PEDAL WAS DEPRESSED AS THE CAR ACCELERATED.  WE BELIEVE THAT THE CAR ONLY STOPPED ACCELERATING WHEN THE RADIATOR WAS PUSHED INTO THE ENGINE BY THE IMPACT WITH THE BUMPER OF THE SUV.",
        "vin": "JTDKN3DU1E0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986015,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RODENTS CHEWED ELECTRICAL WIRING MAKING THE VEHICLE UNSAFE TO DRIVE. THE ELECTRONIC SENSORS WERE RENDERED INOPERABLE. THE VEHICLE WAS PARKED IN MY GARAGE FOR THE WEEK END. NEVER HAD THIS PROBLEM WITH MY OTHER VEHICLES PARKED IN SAME GARAGE! REPAIR COST,NOT COVERED UNDER WARRANTY WAS $ 1100.00.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "04/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INCREASED ACCELERATION WHILE MAKING A RIGHT-HAND TURN AND BRAKING, INTO A COVERED PARKING STALL.  VEHICLE DID NOT STOP UNDER BREAKING UNTIL FRONT END WENT OVER CEMENT PARKING BUMPER.",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/11/2017",
        "dateOfIncident": "04/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971881,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE DRIVING, THE BRAKE PEDAL WAS APPLIED, BUT THE VEHICLE FAILED TO RESPOND.THE VEHICLE WAS TAKEN TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE CONTACT DID NOT WANT TO PAY FOR THE REPAIR BECAUSE THE VEHICLE WAS STILL NEW AND SHOULD NOT HAVE ANY ISSUES. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "JTDKDTB32E1"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "10/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10970913,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN SAN FRANCISCO I HAD THREE PASSENGER WITH ME IN THE CAR AND WHEN I WAS GOING UP TO THE HILL THE CAR POWER  STARTS GETTING   WEAKER AND I WAS HEARING THAT CARES IN THE CAR I DON'T WANT TO GO UP THE HILL NOW I'M LIKE IT'S KEEPS GOING WEAKER AND WEAKER AND WEAKER AND ALL THE SUDDEN THE CAR STARTED ROLLING BACK ON ME I THINK THE CANNOT TAKE MORE THAN FOUR PEOPLE IN THE CAR  AND I THINK YOU CANNOT DRIVE THE SCORE IN SAN FRANCISCO AND THIS HAPPENED TO ME TWICE AND THE FIRST TIME I HAD AN ACCIDENT AT THE CORNER BEHIND ME BECAUSE THE CAR COULDN'T GO UP THE HILL AND IT'S NOT EVEN BIG HILL IS A SMALL HILL IT'S ALL OVER SAN FRANCISCO THOSE HILLS.",
        "vin": "JTDKDTB3XE1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948489,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RODENTS CHEWED THROUGH MAJORITY OF THE WIRING UNDER THE HOOD AND BUILD NESTS IN THE ENGINE. THIS HAS HAPPENED TWICE AND I HAVE ONLY OWNED THE CAR FOR 5 MONTHS AND COST ME A LOT OF MONEY FOR REPAIRS WHICH TOYOTA WILL NOT COVER AND SAID IT IS NOT THEIR RESPONSIBILITY FOR USING THESE SOY BASED WIRES THAT ATTRACTS RODENTS.",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10946989,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 TOYOTA PRIUS C. THE CONTACT STATED THAT WHILE DRIVING AT 3 MPH FROM A STOP LIGHT, ANOTHER VEHICLE T-BONED INTO THE DRIVER'S SIDE DOOR. THE CONTACT MENTIONED THAT THE OTHER DRIVER FAILED TO STOP FOR THE RED LIGHT WHICH CAUSED THE CRASH.  THE AIR BAGS IN THE VEHICLE FAILED TO DEPLOY CORRECTLY. THE CONTACT SUSTAINED A NECK AND BACK INJURIES WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED AND DEEMED DESTROYED. A POLICE REPORT WAS FILED. THE CONTACT NOTIFIED THE MANUFACTURER OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "JTDKDTB39E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947274,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT LIGHT STAYED ON, SWERVE LIGHT OCCASIONALLY. PROVED TO BE RODENT DAMAGE ON WIRE INSTRUMENTS AND BLOWER, PANEL INSTRUMENT, ANTENNA ASSEMBLIES REACHING $3,900. VEHICLE PARKED OUTSIDE RESIDENTIAL BUILDING ON PUBLIC STREET IN COLD RAINY WEATHER. VEHICLE IN EXCELLENT CONDITION. NEVER HAD SUCH A PROBLEM WITH ANY OTHER VEHICLES WHILE LIVING HERE OVER 20 YEARS. COULD SOY BASED ENCASING AROUND WIRING CONTRIBUTE TO THIS?  *TR",
        "vin": "JTDKN3DU9E1"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/16/2016",
        "dateOfIncident": "10/09/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935859,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DOING A SLOW TURN IN A DRIVEWAY, MY BRAKE FAILED AND THE CAR CONTINUED TO ACCELERATE IN A FORWARD MOTION.  WHEN I SHIFTED INTO REVERSE, THE CAR REVVED AND ROARED ACCELERATING AT FULL TILT.  IT RACED ACROSS A ROAD INTO ANOTHER DRIVEWAY ONLY STOPPING WHEN WEDGED BETWEEN A GARAGE DOOR AND A TREE.  TOYOTA TOOK THE TOTALED CAR AND HAD IT INSPECTED BY ENGINEERING ASSOCIATES  AND INSURANCE AUTO AUCTIONS.  THEIR RESPONSE IS THAT \"THERE WAS NO SERIOUS DEFECTS IDENTIFIED.\"  OBVIOUSLY, THE MOMENTARY MECHANICAL OR ELECTRONIC FAILURE OF MY CAR COULD NEVER BE DETECTED, SO ACCORDING TO TOYOTA, THERE WAS NOTHING TO CAUSE THE FAILURE.  I FEEL TOTALLY VICTIMIZED AND BELIEVE TOYOTA SHOULD TAKE RESPONSIBILITY AND COMPENSATE ME FOR THE LOSS OF MY CAR.",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "12/26/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927342,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN DURANGO COLORADO. THE TRACTION CONTROL FUNCTION DEEMED TO BE DANGEROUS LAST WINTER. MY VEHICLE WAS SPINNING OUT ON ICE COVERED HIGHWAYS AND I COULD NOT TURN THIS FUNCTION OFF. NEWER VEHICLES HAVE THE ABILITY TO TURN THIS FUNCTION OFF IN ORDER TO AVOID THIS ISSUE. THIS IS VERY DANGEROUS. I ALMOST GOT HIT BY SEMI TRUCK.",
        "vin": "JTDKDTB31E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884290,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS AND CABIN LIGHTS FAILED TO TURN OFF WHEN REMOTE LOCK WAS ACTIVATED.  LIGHTS WERE THEN TURNED OFF MANUALLY.  FIVE HOURS LATER, IN THE PARKING LOT, THE CAR WAS NEARLY COMPLETELY DEAD.  LAST TIME IT HAPPENED, WE LEFT IT AND IT RECHARGED ITSELF.  THIS TIME, IT DID NOT RECHARGE ITSELF; IT WAS COMPLETELY DEAD THE NEXT DAY.  WE HAD TO HAVE IT TOWED TO THE DEALERSHIP, WHO \"JUMPED\" IT AND LET IT SIT OVERNIGHT.  THEY SAY IT NOW HAS NO PROBLEM.",
        "vin": "JTDKN3DU0E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE DRIVING 55 MPH, ALL FOUR DOOR WINDOWS HAD LONG SCRATCHES THAT CREATED HOLES IN THE WINDOWS. THE SCRATCHES WOULD NOT ALLOW THE CONTACT TO SEE THROUGH THE REARVIEW MIRROR. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 21,300.....UPDATED 0711/16 *BF      *CN",
        "vin": "JTDKDTB30E1"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "04/27/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862592,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED THAT THE DRIVER AND PASSENGER SIDE SUN VISORS WERE FRACTURED. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT REPAIRED BECAUSE THE MILEAGE WAS OUT OF WARRANTY. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS  42,000. UPDATED 09/22/16*LJ    *CN",
        "vin": "JTDKDTB34E1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "02/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838083,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE HEADLIGHTS - NOT DRL - ARE ON AND THE DASH LIGHTS ARE ON LOW THE INSTRUMENT PANEL LIGHTS GO DARK WHILE CROSSING UNDER SHADOWS (BRIDGES, TREES, ETC.) IN DAYLIGHT AND AT NIGHT WHEN GOING FROM BRIGHT LIGHTS ON HIGHWAY EXCHANGES BACK TO DARK.  TOYOTA DEALERSHIP WAS ABLE TO REPRODUCE THE DAY-TO-SHADOW PROBLEM IN THE SHOP (SHOP MANAGER)  THE SERVICE MANAGER WAS ABLE TO REPRODUCE THE DAY-TO-SHADOW PROBLEM ON A 2065 PRIUS V.  I WAS TOLD THAT THIS MUST NORMAL FOR NEWER PRIUSES AS NO ONE ELSE HAS COMPLAINED ABOUT IT. IT CAN ALSO APPEAR TO HAPPEN DURING DAYLIGHT HOURS WHEN WEARING POLARIZED SUNGLASSES.  THE DASH LIGHTS ARE ON HIGH, THE HEADLIGHTS ARE ON: DRIVING UNDER THE UNDERPASS THE PANEL LIGHT LOWERS SO MUCH THEY APPEAR TO GO OUT.  THE CAR IS A NEW-USED CAR.  THE PROBLEM DID NOT APPEAR DURING TEST-DRIVES, ALL TAKEN IN BRIGHT TEXAS SUN.    THE FIRST TIME THIS OCCURRED WAS ON A SUNNY MORNING WHILE DRIVING THROUGH A PARK.  AS I WENT FROM BRIGHT LIGHT TO SHADE THE DASH LIGHTS WOULD GO DARK.  IT FRIGHTENED ME, BUT I FORGOT ABOUT IT, UNTIL I WAS DRIVING ON I-35 IN RUSH HOUR TRAFFIC AT 4PM ON A SUNNY DAY: THE INTERSTATE IN DOWNTOWN HAS UPPER AND LOWER LEVELS; WHILE ON THE LOWER-LEVEL THE INSTRUMENT PANEL WOULD GO DARK, THEN LIGHT AS THE SHADOWS WERE EXACERBATED BY THOSE CAST BY TALL BUILDINGS NEAR THE INTERSTATE.  IT OCCURRED MOST RECENTLY AFTER LEAVING THE DEALER YESTERDAY.  DRIVING ON I-410 IN SAN ANTONIO ON AN OVERCAST DAY, EVERYTIME I DROVE UNDER AN OVERPASS, THE DASH, RADIO, CLIMATE LIGHTS ALL WENT OUT.  AT NIGHT, IT OCCURRED WHEN TRAVELING ON US-281 NEAR LOCKHART, TX:  ONCE I WAS UNDER FULL-LIGHT, THE DASH LIGHTS, ETC. WENT OUT UNTIL I HAD BEEN DRIVING IN THE DARK FOR ABOUT 10-20 SECONDS.",
        "vin": "JTDZN3EU3E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836548,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR STALLS ...THERE ARE NO BRAKES..HAPPENED TO ME 4 TIMES.  HIT OBJECTS 3 TIMES TO STOP.",
        "vin": "JTDZN3EU2E3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764119,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED THAT THE WIRE HARNESS WIRING WAS BEING DAMAGED BY ANIMALS BITING THE WIRING. THE VEHICLE WAS KEPT AT THE DEALER FOR DIAGNOSTIC TESTING FOR OVER A MONTH, BUT IT WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO REMEDY. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 7,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "08/07/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10762201,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE DRIVING 5 MPH, THE VEHICLE ACCELERATED WHEN THE BRAKE PEDAL WAS DEPRESSED. AS A RESULT, THE CONTACT CRASHED THE VEHICLE INTO A BUILDING AND THE AIR BAGS FAILED TO DEPLOY. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT SUSTAINED CHEST INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 2,700.   UPDATED 01/20/16*LJ    *CN",
        "vin": "JTDKDTB36E1"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10750068,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OTHER CAR DRIVER JUMP RED LIGHT AND T-ZONE HIT MY CAR FROM FRONT PASSENGER SIDE ,EVERYTHING FROM PASSENGER SIDE WAS BROKEN AND WHOLE INTERIOR WAS BROKEN TILL DRIVER SEAT. LATER ON THE CAR WAS DECLARED TOTAL LOSS. IN THIS BIG CRASH ALSO NONE OF THE AIR BAG WAS DEPLOYED TO SUPPORT DRIVER.......UPDATED 12/10/15 *BF      *CN",
        "vin": "JTDKN3DPXE3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750088,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME (APPROXIMATELY 100 MILE JOURNEY) - THE \"CHECK HYBRID SYSTEM\" LIGHT CAME ON AND CAR WARNINGS INDICATED NEEDED TO STOP DRIVING AND HAVE CAR TAKEN TO SERVICE IMMEDIATELY.  HAD CAR TAKEN TO DEALER FOR \"WARRANTY\" SERVICE - WAS TOLD A RODENT HAD EATEN THE HIGH VOLTAGE WIRING INSULATION - NOT COVERED BY WARRANTY.  HAVE HAD NO EVIDENCE OF RODENT ACTIVITY AT OUR LOCATION, AND OTHER VEHICLES PARKED HERE HAVE NOT HAD ANY PROBLEMS.  BEING TOLD $2700 REPAIR NOT COVERED BY WARRANTY THAT I NEED TO CLAIM ON MY CAR COMPREHENSIVE COVERAGE.  CONCERNED THAT IF IT IS RODENT DAMAGE, IS IT DUE TO MATERIALS USED THAT ARE ATTRACTIVE TO RODENTS (WOULDN'T THIS BE A PROBLEM FOR ALL PRIUS OWNERS), ESPECIALLY IN AREAS THAT HAVE MORE OF A VISIBLE SMALL RODENT POPULATION?  ALSO, DON'T KNOW HOW TO PROVE IT WAS MANUFACTURER OR DESIGN DEFECT - ASKING DEALER TO DOCUMENT HOW THEY CAME TO BELIEVE IT IS A RODENT PROBLEM.",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "08/04/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN THE LAST SIX MONTHS, AND ABOUT FOUR TIMES, I HAD EXPERIENCED ROUGH/HIGH IDLING DURING HOT DAYS AND AFTER DRIVING OVER 80 MILES; USING AIR CONDITIONING.  (I WORK OVER 70 MILES FROM HOME.)  I DECIDED TO TAKE THE CAR TO THE TOYOTA OF REDLANDS DEALERSHIP ON AUGUST 4, 2015, BECAUSE THE CAR WAS DISPLAYING THE SAME CONDITIONS. WHILE ON THE WAY TO THE DEALERSHIP, AND ON THE FREEWAY, THE CAR BEGAN TO IDLE HEAVILY. I MERGED TO EXIT THE FREEWAY AND WHILE ON THE OFF RAMP, STOPPED, THE CAR COMPLETELY SHUT OFF.  THE DISPLAY READ \"CHECK HYBRID ENGINE. STOP PARK THE CAR SAFELY.\"  I WAS ABLE TO RESTART THE VEHICLE TO MOVE FROM OFF-RAMP TRAFFIC AND PARK IT. THE MESSAGE ON DISPLAY WAS STILL THERE. I SHUT OFF THE CAR AND CALLED THE DEALERSHIP. THEY  RECOMMENDED  I HAVE THE CAR TOWED TO  THEM. WHEN TOW TRUCK ARRIVED, I TURNED ON THE CAR TO POSITION IT FOR THE TOWING BED. THE MESSAGE NO LONGER DISPLAYED .  THE CAR STAYED WITH DEALERSHIP ALL DAY ON AUGUST 5, 2015. ACCORDING TO THE DEALERSHIP, THE DISPLAY SHOWED NO MESSAGE AND THERE IS NO CODE TO INDICATE A MALFUNCTION OCCURRED. THEY WERE NOT ABLE TO DIAGNOSE THE PROBLEM. I AM KEEPING THE VEHICLE AT THE DEALERSHIP ON AUGUST 6, 2015, FOR FURTHER EVALUATION. MY CONCERN IS TWO-FOLD: 1. MY SAFETY, 2. IF THE SYSTEM DISPLAYED A MESSAGE, WHY DOES THE SYSTEM NOT PRODUCE A CODE FOR THE TECHNICIANS AS A NON-HYBRID CAR WOULD?  THIS ITSELF PRESENTS A SERIOUS ISSUE.",
        "vin": "JTDKDTB39E1"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/15/2015",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734278,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE DRIVING APPROXIMATELY 25 MPH, THE CONTACT ATTEMPTED TO DEPRESS THE BRAKE PEDAL, BUT THE VEHICLE DID NOT STOP. AS A RESULT, A CRASH OCCURRED AND THE AIR BAGS DID NOT DEPLOY. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT WAS NOT INJURED AND A POLICE REPORT WAS FILED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 3,200.",
        "vin": "JTDKDTB31E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731590,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS A LITTLE OVER 3 MONTHS OLD AND HAS HAD ELECTRICAL PROBLEMS THROUGH THIS PERIOD.  WHEN PUT IN REVERSE ON OCCASION IT FREEZES AND ALL THE LIGHTS ON THE DASH GO ON AND STAY ON (INCLUDING THE YELLOW TRIANGLE) AND THE CAR DOES NOT MOVE.  THE PRIUS C NEEDS TO BE SHUT DOWN EVERY TIME THIS HAPPENS AND RESTARTED TO WORK.  THIS HAS HAPPENED 5 TIMES IN THE LAST 3 MONTHS SINCE PURCHASED NEW.  WORSE YET, THE LAST TIME WHEN IT WAS PUT IN REVERSE (YESTERDAY)  ALL THE LIGHTS FROZE ON THE DASH HOWEVER THIS TIME THE CAR LURCHED FORWARD EVEN THOUGH THE GEAR SHIFT WAS IN REVERSE AND THE DASH SAID 'R' FOR REVERSE.  THE CAR WAS PURCHASED NEW FROM THE DEALER.",
        "vin": "JTDKDTB33E1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2015",
        "dateOfIncident": "05/07/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE DRIVING AT 5 MPH, THE VEHICLE ACCELERATED UNEXPECTEDLY. THE FAILURE PREVIOUSLY OCCURRED ONCE BEFORE. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 11,687.",
        "vin": "JTDKN3DPXE3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2015",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726300,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CARS AV SMELLS LIKE MOLD AV CONDENSER CLOGGED SMELL GET WORSE AS TIME GOES ON CAR IS UNBEARABLE TO DRIVE NOW",
        "vin": "JTDKN3DU2E0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2015",
        "dateOfIncident": "05/29/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723667,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON STREET I NOTICED IN THE MIDDLE OF MY STEERING WHEEL (WHERE YOU PRESS THE HORN) THERE WERE RAISED MARKS.  VERY PROMINENT CENTER OF STEERING WHEEL LEFT SIDE.  SLIGHTLY RAISED ON THE RIGHT.  I COULD SEE THE RAISED SHAPE AS A QUARTER OF A BUNDT CAKE.  I GOT REALLY SCARED AND DROVE TO TUSTIN TOYOTA. I ASK THE SERVICE ADVISER WHERE MY STEERING WHEEL AIR BAG WAS, HE POINTED TO THE RAISED SECTION ON MY STEERING WHEEL.  I SHOWED HIM THE RAISED MARKS AND THAT IT APPEARS THAT SOMETHING PERHAPS THE AIR BAG WAS PUSHING OUTWARD.  I TOLD HIM THAT NOT ONLY CAN YOU SEE THE RAISED MARKS YOU CAN SEE THEM.  HE WENT AND CHECKED ANOTHER PRIUS V ON THE SHOWROOM FLOOR, THAT STEERING WHEEL WAS COMPLETELY FLAT.  WENT ON TO SAY \"GOOD CALL\" THIS IS A SAFETY ISSUE WITH THE AIRBAG.  THE R/O READS:  CK STEERING WHEEL LEFT SIDE AIR BAG IS RAISED.    REPLACED THE PAD ASSY.  I AM CONCERNED THAT THERE MAY BE A PROBLEM WITH THE AIRBAG ITSELF BECAUSE IT WAS STARTING TO PUSH OUTWARD.    HOW SAFE IS IT TO DRIVE MY PRIUS V.  SHOULD I BE CONCERNED WITH THE AIRBAG  WHAT IF THE AIRBAG DECIDES TO INFLATE WHILE I AM DRIVING  WHAT IF THE AIRBAG DOES NOT INFLATE IF I HAVE AN ACCIDENT  PLEASE FEEL FREE TO CONTACT ME .  *TR",
        "vin": "JTDZN3EU3E3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "08/25/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10720980,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I FREQUENTLY GET A MUSTY SMELL OUT OF MY VENTS THAT I HAVE NOTICED FROM TIME OF TAKING OWNERSHIP. I WAS TOLD AT THAT TIME TOYOTA WAS AWARE OF IT AND THE SOLUTION WAS TO TAKE THE SYSTEM OUT OF RECIRCULATE A FEW MILES FROM HOME ALLOWING OUTSIDE FRESHER AIR IN TO REMOVE THE APPARENT MOISTURE BUILDUP. I TRIED TO LEAVE THE SYSTEM IN THE FRESH AIR MODE MOST OF THE TIME, BUT STILL EXPERIENCE THIS SMELL/ODOR.   AT MY 10K SERVICE I BROUGHT THIS UP AGAIN AND WAS OFFERED A 'GOODWILL' SYSTEM CLEANING AND A CHARCOAL FILTER.  THE MECHANIC PERFORMED THE PROCEDURE (ALTHOUGH I AM NOT SURE IF IT WAS FOR THE RECOMMENDED TIME FRAME, DASH-CAM INSIDE VEHICLE CAUGHT THE WHOLE 10K SERVICE) THE SMELL IS STILL THERE AND SOMETIMES EVEN OVERWHELMINGLY BAD.",
        "vin": "JTDKN3DU5E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/08/2015",
        "dateOfIncident": "05/07/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715324,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A PARKING LOT AND PUT THE CAR IN REVERSE.  THEN I HEARD A \"BOOM\" AND I THOUGHT THAT I BACKED INTO SOMETHING, SO I QUICKLY PUT THE CAR INTO DRIVE.  I THEN FELT THE CAR EXCELERATING FAST AND I WAS PUSHING THE BRAKE AS HARD AS I COULD AND COULD NOT STOP THE CAR FROM MOVING FORWARD.  THE CAR PROCEEDED TO EXCELLERATE AND WHEN OVER A CURB UP ONTO PAVEMENT AND THROUGH A METAL FENCE AND BENT A 5 INCH ROUND METAL FENCING DOWN TO THE GROUND AND THE CAR KEPT GOING ANOTHER 30 FEET TILL IT FINALLY STOPPED.  YOU CAN SEE THE SKID MARKS IN THE THE PARKING LOT.",
        "vin": "JTDKN3DPXE3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "08/28/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704553,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED MY 2014 TOYOTA PRIUS SLOWLY OUT OF A PARKING SLOT IN A SMALL PARKING LOT TURNING IT THE DIRECTION I WANTED TO GO ON A VERY SLIGHT SLANT DOWNHILL.  BEFORE I COULD PUT IT IN DRIVE FROM REVERSE IT STARTED ROLLING DOWNWARD ON ITS OWN.  WHEN I WENT TO APPLY THE BRAKES, THEY WERE SQUISHY AND DID NOT ENGAGE.  I TRIED SEVERAL TIMES TO GET THEM TO ENGAGE BUT THEY NEVER DID.  I WENT TO PUT THE EMERGENCY BRAKE ON BUT IT IS LOCATED SO HIGH UP IT WAS DIFFICULT TO GET MY FOOT UP THERE QUICKLY.  MEANWHILE THERE WAS A TRUCK PARKED ACROSS THE END OF THE PARKING LOT LANE SO MY CAR ROLLED INTO THE TRUCK CREATING DENTS IN THE FRONT DOOR PANEL AND REAR DOOR PANEL.  THIS WAS OBVIOUS BRAKE FAILURE.  I WENT TO THE LOCAL TOYOTA REPAIR AND DEALERSHIP AND SPOKE WITH A SHOP EMPLOYEE.  HE TOLD ME THAT THIS CAN ACTUALLY HAPPEN WHERE YOU CAN BACK A CAR UP AND TURN IT AND IT WILL GO ON ITS OWN (BUT IT SEEMS HE IMPLIED THAT THE \"READY\" LIGHT MIGHT NOT HAVE ENGAGED) AND THAT HE \"HAD SEEN IT HAPPEN HIMSELF\".  IF THE TRUCK HAD NOT BEEN THERE, MY CAR WOULD HAVE ROLLED DIRECTLY OUT INTO ONCOMING TRAFFIC ON THE MAIN THOROUGHFARE THROUGH TOWN WHICH HAD THE HUGE POTENTIAL OF CAUSING A MAJOR ACCIDENT WITH INJURIES. I DID TRY TO RECREATE THE EVENT IN A NONPOPULATED AREA IN A VERY SAFE MANNER AND WAS UNABLE TO DO SO.  THAT EVEN SCARES ME MORE!!! AS YOU HAVE NO IDEA IF IT CAN OR WILL HAPPEN AGAIN.  I SPENT $20,000 PLUS FOR A NEW CAR THAT I AM ALWAYS HYPER-CAUTIOUS IN BECAUSE NO ONE WILL FESS UP TO PROBLEMS. IF I SELL THE CAR IT WILL BE AT A GREAT LOSS WHICH I CANNOT AFFORD!  IN THE INTERNET I NOTE THAT THERE WERE SIMILAR PROBLEMS WITH THE BRAKES, ESPECIALLY AROUND 2007 - MANY WERE DOCUMENTED BUT TOYOTA WAS NEVER TAKEN TO TASK RE: THESE CONSUMER COMPLAINTS AS I SUPPOSE THE CONSUMERS JUST COULDN'T \"PROVE\" THEM. AS USUAL MONEY TRUMPS HUMAN LIVES AND SAFETY. TOYOTA SHOULD BE ASHAMED OF  THEMSELVES.   *TR",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "03/27/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703006,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE FLEW TO SEA TAC (SEATTLE WA ) AIRPORT FROM SLC UT. WE PLANNED ON ATTENDING A FAMILY GATHERING AND RENTED A CAR FROM HERTZ.  WE HAVE OWNED A 2006 PRIUS AND ASKED IF THEY MIGHT HAVE A NEW MODEL TO RENT FOR COMPARISON ON OUR PART, WHICH THEY DID, HOWEVER IT TURNED OUT TO BE A PRIUS C, WHICH WAS NOT AT ALL LIKE OUR PRIUS.   THE TRAFFIC ON THE FREEWAY WAS STOP AND GO SLOW ON A MULTI LANE FREEWAY AND WERE ON AN INNER LANE. (  I - 405 NORTH BOUND )   AS I ROLLED UP TO WHAT MIGHT HAVE BEEN A STOPPING SITUATION THE TRAFFIC STARTED TO MOVE FORWARD, AND AS I STEPPED ON THE PEDAL TO MOVE FORWARD, I NOTICED THAT NOTHING WAS HAPPENING AND THE CAR SOON CAME TO A COMPLETE STOP. THE CAR WAS ABSENT AND VISIBLE POWER, NO VISUAL INFORMATION ON THE MPH SCREEN, THE EMERGENCY LIGHT WOULD NOT WORK, I WAS NERVOUS AND SCARED AND EVERYTHING HAD GONE DARK, I DID NOT WHAT TO DO, I TRIED TO MOVE THE KEY POSITION    THE CARS BEHIND ME STARTED TO HONK, AND THEY WERE ALSO TRYING TO GET AROUND ME, JUST AS I WAS STARTING TO CALL 911 FOR SOME HELP THE CAR POWERED BACK UP WITH A MESSAGE TO PUT THE CAR IN PARK AND START THE MOTOR     I MOVED OUT OF THE SITUATION AND GOT OFF THE FREEWAY AND TOOK BACKROADS TO REACH THE MOTEL, WITH THE INTENT TO NEVER DRIVE THIS CAR AGAIN, THE NEXT AM I CALLED HERTZ AND THEY MADE ARRANGEMENTS TO TRADE THE CAR OUT AT OUR MOTEL, WHICH THEY DID.    THE TOW TRUCK DRIVER INDICATED THAT THE PROBLEM ON THIS SPECIFIC CAR WAS CAUSED BY ITS SOFTWARE AND HE WAS AWARE OF OTHER DRIVERS FACING THE SAME SITUATION, BUT I SHOULD COUNT MY BLESSING THAT I WAS NOT INVOLVED IN A MAJOR ACCIDENT    I DO NOT THINK THIS CAR SHOULD EVER BE ALLOWED ON OUR ROADS JUST BASED ON THIS EXPERIENCE.    FOR YOUR REVIEW AND VALIDATION - HERTZ RENTAL RECORD [XXX] LIC [XXX]      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690226,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2014 PRIUS. THE CONTACT STATED THAT VEHICLE INTERMITTENTLY SHIFTED INTO NEUTRAL. THE CONTACT MENTIONED THAT THE DRIVE AND/OR REVERSE GEAR NEEDED TO BE HELD IN ORDER FOR THE GEAR NOT TO SHIFT INTO NEUTRAL. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 20,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "02/08/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I CLOSED THE TRUNK DOOR, AND THE BACK LIGHT GLASS (REAR WINDOW) COMPLETELY SHATTERED. WHEN THIS OCCURRED, THE GLASS WAS NOT CRACKED AND WE WERE NOT IN EXTREME TEMPERATURES (IT WAS ABOUT 65 DEGREES). I TOOK IT TO THE TOYOTA DEALERSHIP, AND THE SERVICE GUY SAID IT'S \"IMPOSSIBLE\" FOR THE GLASS TO BREAK AS IT DID. IT'S OBVIOUSLY NOT IMPOSSIBLE IF IT CAN HAPPEN WITH NORMAL CLOSING OF THE TRUNK DOOR. VEHICLE WAS PURCHASED NEW LESS THAN A YEAR AGO.  *TR",
        "vin": "JTDKN3DP0E3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "01/31/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680404,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS CROSSING THE TRAIN TRACKS IN PALO ALTO ON CHARLESTON ST NEAR ALMA AND TRIED TO STOP AT A STOP LIGHT RIGHT AFTER THE TRACKS. WHEN I STEPPED HARD ON THE BRAKES, THE BRAKES DID NOT WORK AT ALL. MY CAR DID NOT SLOW DOWN AT ALL AND I HIT THE CAR IN FRONT OF ME.   *TR",
        "vin": "JTDKN3DU5E0"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "12/06/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678985,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MUSTY SMELL IN VEHICLE, SICK W/ RESPIRATORY SYMPTOMS, INCLUDING DISTRESS AFTER USING AIR CONDITIONING OR HEATING SYSTEM OR DEFROSTERS. I BROUGHT MY CAR TO DEALER FOR 5000 MILE SERVICE AND MANAGER TOLD ME THE \"THERE IS MOLD INSIDE THE AIR CONDITIONER AND HEATING AND ALL VENTED AIR SYSTEM. THIS IS THE WAY THE NEW DESIGN IS, THE AIR SYSTEM IS CLOSED OFF AND THE MOISTURE LAYS IN THERE GROWING MOLD.\" HE SAID \"YOU HAVE TO OPEN THE WINDOWS, IF YOU ARE SENSITIVE, OR HAVE IT CLEANED EVERY WEEK TO KEEP THE SMELL OUT.\" HE SAID \" THAT IS A CHARGE NOT COVERED BY YOUR LEASE, I'LL TAKE THE DASH OFF AND PUT A NEW FILTER AND FLUSH THE AIR HANDLING SYSTEM OUT FOR YOU, THIS TIME. IT USUALLY COST OVER $250.DOLLARS. YOU CAN DO IT YOURSELF BY SPRAYING A WHOLE CAN OF LYSOL BEHIND THE CABIN FILTER EVERY WEEK\".   MOLD IS KNOWN TO BE DEADLY AND THIS SHOULD NOT BE AN ALLOWED DESIGN. I HAVE SOUGHT MEDICAL ATTENTION FOR THIS PROBLEM AND NOW REFERRED TO A PULMONOLOGIST FOR SPECIAL TEST. I DEFINITELY WOULD NOT HAVE OBTAINED THIS CAR IF THE DEALER HAD DISCLOSED THIS KNOWN PROBLEM. BAD.  *TR",
        "vin": "JTDKN3DU3E0"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676597,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER PURCHASING MY 2014 TOYOTA PRIUS IN JUNE 2014, I STARTED NOTICING A MOLDY SMELL COMING FROM THE AIR CONDITIONER.  THE HOTTER OUTSIDE IT GOT, THE WORSE THE SMELL INSIDE GOT.  I TOOK THE CAR TO THE DEALER TO DISCUSS THE PROBLEM WITH THEM.  THEY INFORMED ME THAT TOYOTA SAYS THIS IS AN \"ENVIRONMENTAL ISSUE\" AND CAN HAPPEN IN NEW CARS AND IS THEREFORE NOT WARRANTIED.  THE SERVICE MANAGER INSTALLED A CHARCOAL AIR FILTER IN THE CABIN AIR FILTER AND SAID THAT IT WOULD HELP ELIMINATE THE ODOR.  IT DID NOT. IN FACT, THE CHARCOAL AIR FILTER REDUCED THE AIR FLOW INTO THE CABIN WHICH CAUSED THE AC TO NOT COOL.  I HAD THE SERVICE DEPARTMENT REPLACE THE CHARCOAL WITH AN ORIGINAL AIR FILTER IN SEPTEMBER AFTER COMPLAINING THAT THE AC WASN'T COOL.  THE SMELL IN THE AC PERSISTS.  IT'S NOT JUST A BIT WHEN THE CAR IS TURNED ON.  NO MATTER WHAT SETTING I PUT THE AC ON, IT DOES NOT HELP (FRESH AIR OR RECIRC). WHEN IT RAINS OR WHEN IT IS REALLY HUMID OUTSIDE, THE CAR SMELLS LIKE A SWAMP (EVEN BEFORE IT IS TURNED ON).  THERE IS ALSO HUMIDITY INSIDE THE CAR WHEN OPENING THE DOOR.  I'VE ASKED MULTIPLE TIMES TO HAVE THE EVAPORATOR REPLACED BECAUSE I FEAR THAT IT IS NOT DRAINING AND CAUSING MOLD AND MILDEW TO FORM.  BREATHING IN THE MOLD IS A SERIOUS HEALTH CONCERN AND TOYOTA WILL NOT AGREE TO ANY KIND OF FIX. I'M ALSO HAVING OTHER VARIOUS HVAC PROBLEMS SUCH AS CONTINUOUSLY FOGGING WINDOWS AND A DRAFT FROM THE DRIVERS SIDE DOOR.  THE CAR DOES NOT HOLD HEAT AND IS VERY COLD DURING THE WINTER MONTHS.  *TR",
        "vin": "JTDKN3DU7E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A VISIBILITY ISSUE ON BOTH THE RIGHT HAND AND LEFT HAND SIDE OF THE WINDSHIELD. THE RIGHT HAND SIDE HAS A GLARE/BLURRY EFFECT WHEN MAKING TURNS. THE LEFT SIDE HAD SOME SORT OF CIRCULAR EFFECT THAT NEGATIVELY EFFECTS MY VISION. THE DEALER ATTEMPTED TO TREAT THE WINDSHIELD WITH RAIN X AS SOME SORT OF FIX. THIS DID NOT HELP. THIS WAS A VERY UNPROFESSIONAL FIX. IN FACT, I BELIEVE THE RAIN X MADE THE PROBLEM WORSE.    I DON'T REMEMBER THE ISSUE OCCURRING UNTIL A FEW WEEKS AFTER THE INITIAL PURCHASE OF THE VEHICLE.",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/25/2014",
        "dateOfIncident": "11/26/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668230,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE BRAND NEW FROM A DEALERSHIP.  WITHIN A FEW WEEKS, I NOTICED THAT WHEN MY HUSBAND SAT IN THE FRONT PASSENGER SEAT (300LBS) THE NOTIFICATION LIGHT SAID \"PASSENGER AIR BAG ON\".  WHEN MY STEPSON SAT IN THE FRONT PASSENGER SEAT THE LIGHT SAID \"PASSENGER AIR BAG OFF\".  I TOOK A PICTURE TO SHOW THE NOTIFICATION LIGHT AND THE SIZE OF MY 15 YR OLD STEPSON 5' 10\" & 175LB-FULLY ADULT SIZE. I CALLED THE DEALERSHIP AND THEY TOLD ME THEY HAD \"NEVER HEARD OF THE PROBLEM\" AND SAID IT WAS JUST THAT THE PASSENGER AIRBAG NEEDED TO BE RECALIBRATED.  AFTER DOING SOME SEARCHING, I REALIZED THAT THE 2012-2013 MODELS HAVE ALREADY BEEN RECALLED FOR THAT EXACT SAME REASON. I AM VERY CONCERNED THAT THE PROBLEM HAS NOT BEEN FIXED WITH TOYOTA, AND THAT NEW CARS ARE BEING SOLD WITH THE SAME PROBLEM.  NEEDLESS TO SAY, I AM NOT HAPPY WITH TOYOTA RIGHT NOW AND THIS IS A HUGE SAFETY PROBLEM.  I ALSO HAVE CONCERNS ABOUT THE BACK SEAT BELTS NOT LATCHING PROPERLY WHEN A CAR SEAT IS BEING USED, BUT THAT'S ANOTHER STORY....  *TR",
        "vin": "JTDZN3EUXEJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/24/2014",
        "dateOfIncident": "12/17/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668198,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED OUT ON  THE ROAD & THE IT DIED. IT A LITTLE BIT IT STARED UP. THE SAME THING HAPPENED LAST SUMMER.  *TR",
        "vin": "JTDKN3DUXE0"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "12/12/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664218,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A NEW TOYOTA PRIUS THAT CAME WITH YOKOHAMA ALL SEASON RADIALS.  BECAUSE THE TIRE LIGHT CAME ON, I CHECKED THE AIR PRESSURE IN THE TIRES AND SET THEM TO THE PSI AS RECOMMENDED AT ABOUT 1000 MILES.  THERE WAS A MINOR IMBALANCE OF 3-4 PSI IN SOME TIRES, BUT NO SERIOUS UNDER  INFLATION. WE NOTICED SOME MINOR ROAD NOISE AND VIBRATION.  WE HAD A MECHANIC INSTALL MUD FLAPS AND INSPECT THE TIRES, WHEELS, AND BRAKES AT ABOUT 1500 MILES TO SEE IF THERE WAS A VISIBLE REASON FOR VIBRATION.  THERE WAS NOTHING OBVIOUS.  WE WERE CONCERNED ABOUT THE ROAD NOISE AND ABOUT 2000 MILES WE TOOK THE CAR BACK TO THE TOYOTA DEALER WHO INSPECTED THE TIRES, CHECKED THE AIR PRESSURE, AND DECLARED THAT THEY DIDN'T SEE ANYTHING WRONG.    AT ABOUT 3000 MILES DRIVING AT A SLOW SPEED (35 MPH OR LESS) IN A SCHOOL ZONE, WE HAD A COMPLETE BLOW OUT OF THE LEFT REAR TIRE.  FORTUNATELY, THERE WAS A GRASSY SHOULDER AND NO TRAFFIC, SO WE HAD NO INJURIES OR OTHER DAMAGE.  THE TREAD APPEARED TO SEPARATE AND THERE WAS A SIDEWALL TEAR STARTING AT THE TREAD.    WE RETURNED TO THE TOYOTA DEALER AND ALSO SHOWED THE TIRE TO THREE DIFFERENT TIRE SHOPS (ALL THREE SELL YOKOHAMA TIRES).  THE TOYOTA DEALER DID NOT OFFER AN OPINION OTHER THAN TIRE DEFECT - SO WE NEEDED TO DEAL WITH THE MANUFACTURER.  TWO TIRE SHOPS THOUGHT IT WAS A DEFECT (EVEN THOUGH THEY SAID IT WAS A HASSLE TO GET A REPLACEMENT PAID FOR BY YOKOHAMA).  ONE SHOP REPORTED IT WAS A DEFECT UNLESS THE TIRE WAS UNDER INFLATED, BUT THEY DIDN'T SEE ANY WEAR PATTERN THAT INDICATED UNDER INFLATION.      BECAUSE OF THE BLOWOUT AND A SECOND SUSPICIOUS TIRE OF THE FOUR, WE REPLACED ALL FOUR WITH A DIFFERENT BRAND.  AS FAR AS WE CAN TELL, THE YOKOHAMA TIRE(S) WERE DEFECTIVE AS NEW ON THE CAR.  *TR",
        "vin": "JTDKN3DU6E1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/01/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661378,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA'S ENTUNE NAVIGATION SYSTEM RANDOMLY FREEZES AND RESETS. WHEN THIS HAPPENS AT HIGH SPEEDS ON A HIGHWAY WHERE A PERSON IS DEPENDING ON THE SYSTEM TO GET SOMEWHERE, IT CAUSES A MASSIVE DISTRACTION AND A RISK TO LIFE AND LIMB. TOYOTA IS OFFERING NO RESOLUTION TO THIS ISSUE AND IT'S DEALERSHIPS ARE REFUSING TO EVEN REGISTER USER COMPLAINTS - \"UNLESS THEY CAN REPLICATE THE ISSUE\" WHICH IS RATHER DIFFICULT SINCE THE PROBLEM IS RANDOM AND THE DEALERSHIPS WILL NOT TAKE USER REPORTS OF THE ISSUE AS CREDIBLE.   *JS",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/11/2014",
        "dateOfIncident": "08/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644101,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA'S ENTUNE NAVIGATION SYSTEM RANDOMLY FREEZES AND RESETS. WHEN THIS HAPPENS AT HIGH SPEEDS ON A HIGHWAY WHERE A PERSON IS DEPENDING ON THE SYSTEM TO GET SOMEWHERE, IT CAUSES A MASSIVE DISTRACTION AND A RISK TO LIFE AND LIMB. TOYOTA IS OFFERING NO RESOLUTION TO THIS ISSUE AND IT'S DEALERSHIPS ARE REFUSING TO EVEN REGISTER USER COMPLAINTS - \"UNLESS THEY CAN REPLICATE THE ISSUE\" WHICH IS RATHER DIFFICULT SINCE THE PROBLEM IS RANDOM AND THE DEALERSHIPS WILL NOT TAKE USER REPORTS OF THE ISSUE AS CREDIBLE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638950,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA PRIUS. CONSUMER WRITES IN REGARDS TO PUSH START IGNITION SYSTEM. *TGW  THE CONSUMER STATED THE VEHICLE BELONGS TO HIS PARENTS. HE NOTICED THE ENGINE TURNED ON BY ITSELF. HE WAS ABLE TO OPEN THE DOOR AND NOTICED THE POWER PUSH BUTTON WAS LIT WHICH INDICATED THE ENGINE WAS ON. THE SCREEN ON THE CENTER CONSOLE STATED NO KEY WAS DETECTED. HE PRESSED THE POWER BUTTON TO TURN THE ENGINE OFF. THE DEALER INFORMED THE CONSUMER, IF HE WALKED AWAY FROM THE VEHICLE WITHOUT TURNING OFF THE IGNITION, THE VEHICLE WOULD STAY ON. THE ENGINE TURNED ON BECAUSE THE VEHICLE WAS IN BATTERY MODE TO REPLENISH THE BATTERY POWER, WHEN THE SYSTEM DETECTS THE BATTERY CHARGE HAS DROPPED BELOW A CERTAIN LEVEL. *JB",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638772,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE DROVE OVER A POTHOLE, WHICH CAUSED THE REAR OF THE VEHICLE TO ELEVATE. THE CONTACT LOST CONTROL OF THE STEERING AND BRAKES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,500.  THE CONSUMER STATED HE TOOK THE VEHICLE TO THE DEALER, FOR ERRATIC STEERING WHEN GOING AROUND CURVES AT MODERATE SPEEDS. THE SAME MORNING, WHILE DRIVING, THE VEHICLE WENT OVER A DIP IN THE PAVEMENT. THE REAR OF THE VEHICLE WENT AIRBORNE AS IF, IT WAS ON A HYDRAULIC LIFT. THE CONSUMER HAD NO CONTROL OF THE STEERING OR BRAKING.  WHAT SAVED HIM WAS THE LEFT REAR BRAKE AND THE TIRE JERKED ON THE PAVEMENT AND PULLED THE VEHICLE BACK STRAIGHT. HE EXPERIENCED THE FAILURE FOR A SECOND TIME. UPDATED 10/29/14   UPDATED 11/21/14*CN    THE CONSUMER STATED THE DEALER COULD NOT DUPLICATE THE FAILURE. THE FAILURE DOESN'T OCCUR WITH MULTIPLE PEOPLE IN THE VEHICLE. THE DEALER REFUSED TO DRIVE THE VEHICLE ALONE.*JS",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/17/2014",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10636921,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE STEERING WHEEL BECAME EXTREMELY LOOSE CAUSING THE VEHICLE TO SWAY ABNORMALLY.  THE CONTACT INDICATED THAT THE STEERING WHEEL WAS DIFFICULT TO MANEUVER WHEN MAKING A TURN. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,100.",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/17/2014",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637123,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I FINALLY REALIZED THAT THE DRIVERS SIDE HEAD RESTRAINT ON THIS CAR IS CAUSING ME CHRONIC NECK AND HEAD PAIN.  IT PUSHES MY HEAD FORWARD, WRECKING MY POSTURE.  SITTING PARKED, WITH THE HEADREST REMOVED, THE SEAT IS COMFORTABLE AND ALL THE CONTROLS ARE WITHIN REACH OF MY HANDS AND FEET.  I UNDERSTAND THAT YOUR NEW REGULATIONS CALL FOR A MINIMUM OF 2\" FROM THE BACK OF THE HEAD TO THE HEAD RESTRAINT. I HAVE ZERO ROOM, AND MY HEAD IS PUSHED FORWARD.   THERE REALLY NEEDS TO BE SOME ADJUSTMENT TO ACCOMMODATE PEOPLE WITH DIFFERENT BODY TYPES.   I'M A MALE, 5' 9\" AND ABOUT 160 LBS.    *TR",
        "vin": "JTDZN3EU7E3"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633228,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION  DRIVING EAST ON US RTE. 50 AT ABOUT 60 MPH: VEHICLE ACCELERATED FOR NO APPARENT REASON. I NEARLY RAN INTO THE CAR AHEAD OF ME. THIS CAR IS EQUIPPED WITH RADAR ADAPTIVE CRUISE CONTROL, WHICH WAS ENGAGED AT THE TIME. I TURNED OFF THE CRUISE CONTROL IN TIME TO AVOID A COLLISION. UNINTENDED ACCELERATION HAS SPORADICALLY OCCURRED, BUT IT IS USUALLY FAIRLY MILD. THIS TIME IT WAS SO POWERFUL THAT IT FELT LIKE I HAD STOMPED ON  THE ACCELERATOR; THE ENGINE ROARED AND THE CAR TOOK OFF AT FULL THROTTLE. THANKFULLY I WAS TRAVELING AT THE MAX DISTANCE OF THE CRUISE CONTROL. ACCELERATION WAS NOT CAUSED BY FLOOR MATS. I WATCHED WHILE THE DEALER SERVICE MANAGER CHECKED.    DECELERATION  DRIVING EAST ON I-70: THE CAR AHEAD OF ME SIGNALED TO EXIT THE INTERSTATE AND TURNED SMOOTHLY ONTO THE EXIT RAMP. AS SOON AS HE WAS OUT OF MY LANE MY CAR'S CRUISE CONTROL LOCKED ON TO THE THAT OF THE EXITING CAR AND VIGOROUSLY APPLIED THE BRAKES. STEPPING ON THE ACCELERATOR DID NO GOOD.  *TR",
        "vin": "JTDKN3DU2E1"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/09/2014",
        "dateOfIncident": "09/07/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. WHILE IN THE PROCESS OF PARKING THE VEHICLE, THE BRAKES DISENGAGED AND THE VEHICLE ACCELERATED FORWARD UNEXPECTEDLY. THE CONTACT CRASHED THE VEHICLE INTO THE PRECEDING VEHICLE. WHILE ATTEMPTING TO REVERSE THE VEHICLE, THE BRAKES DISENGAGED AND THE VEHICLE ACCELERATED BACKWARDS. THE CONTACT CRASHED THE VEHICLE INTO THE VEHICLE BEHIND IT AND THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES.  THE VEHICLE WAS TOWED TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50.",
        "vin": "JTDKN3DU8E1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "03/07/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629428,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED THAT IT WAS DIFFICULT TO VIEW ANY OF THE GAUGES ON THE INSTRUMENT PANEL WHILE OPERATING THE VEHICLE. ADJUSTING THE DIMMER SWITCH DID NOT REMEDY THE FAILURE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER SEVERAL TIMES, BUT NO REMEDY WAS PROVIDED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 200.",
        "vin": "JTDKN3DP5E3"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/24/2014",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10627821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A CONVENIENCE STORE IN MY 2014 PRIUS. AS I WAS GLIDING IN, I DEPRESSED THE BRAKE PEDAL AND THE CAR KEPT GOING. I CONTINUED TO PRESS IT AND THE CAR STARTED TO ACCELERATE, I COULD FEEL THE SURGE OF POWER. I WAS COMPLETELY UNABLE TO STOP THE CAR AND RAN INTO PARKING POSTS AT THE FRONT OF THE STORE. ALL AIRBAGS WERE DEPLOYED. I GOT A CUT ON MY FOREHEAD, AN AMBULANCE CAME BUT I DECLINED AND MY HUSBAND DROVE ME TO THE ER LATER WHERE I RECEIVED TREATMENT. I WAS COMING HOME FROM THE GYM AT 9 AM I HAVE NEVER BEEN AT FAULT IN AN ACCIDENT BEFORE. I HAVE A WITNESS THAT SAID HE HEARD A CHIRPING SOUND COMING FROM THE BRAKES BEFORE I CRASHED. TOYOTA COMPLETELY DENIES THERE IS ANYTHING WRONG WITH THE CAR, BUT GIVES NO EXPLANATION AS TO HOW THIS COULD HAVE OCCURRED. THEY WILL NOT HELP AT ALL. SOMEONE IS GOING TO GET SERIOUSLY INJURED OR KILLED. THIS NEEDS TO BE INVESTIGATED BY SOMEONE OTHER THAN TOYOTA.  *TR",
        "vin": "JTDKN3DU1E7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2014",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10627837,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A CONVENIENCE STORE IN MY 2014 PRIUS. AS I WAS GLIDING IN, I DEPRESSED THE BRAKE PEDAL AND THE CAR KEPT GOING. I CONTINUED TO PRESS THE BRAKE AND THE CAR STARTED TO ACCELERATE. I COULD FEEL THE SURGE OF POWER. I WAS COMPLETELY UNABLE TO STOP THE CAR AND I RAN INTO PARKING POSTS AT THE FRONT OF THE STORE. ALL AIRBAGS WERE DEPLOYED. I GOT A CUT ON MY FOREHEAD AND WAS BLEEDING. AN AMBULANCE ARRIVED AND MY HUSBAND DROVE ME TO THE ER AFTERWARDS AND I RECEIVED TREATMENT. I WAS COMING HOME FROM THE GYM AT 9AM IN THE MORNING. I HAVE NEVER BEEN AT FAULT IN AN AUTO ACCIDENT BEFORE. I HAVE A WITNESS THAT SAID HE HEARD A CHIRPING SOUND COMING FROM MY BRAKES RIGHT BEFORE THE CRASH. I HAVE THE PIN DRIVE FROM THE CAR THAT A REPRESENTATIVE, SUPPOSEDLY FROM AN OUTSIDE SOURCE, THAT RETRIEVED IT. THIS IS WHAT TOYOTA USED TO CONDUCT THEIR \"INVESTIGATION\" INTO THE INCIDENT. THEY CONCLUDED THAT IT WAS COMPLETELY NOT THEIR FAULT, NOT INDICATING HOW IT COULD HAVE HAPPENED. THEY ARE NOT GOING TO HELP AT ALL. SOMEONE OTHER THAN TOYOTA NEEDS TO INVESTIGATE THIS PROBLEM BEFORE SOMEONE ELSE GETS KILLED. ( I FILED A PREVIOUS COMPLAINT THIS MORNING BUT REALIZED I HAD ENTERED THE VIN NUMBER WRONG. THIS IS THE SAME COMPLAINT WITH THE CORRECT VIN NUMBER.  *TR",
        "vin": "JTDKN3DU1E1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2014",
        "dateOfIncident": "07/16/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611282,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE RECENTLY PURCHASED A 2014 TOYOTA PRISM THAT NOW HAS LESS THAN 4000 MILES ON THE ENGINE.  IN A VERY SHORT PERIOD WE HAVE EXPERIENCED A MASS AMOUNTS OF DEFECTS WITH THE CAR.  THE FIRST REPAIR WAS TOYOTA HAD TO REPLACE THE BATTERY FROM OUR HOME.   THE SECOND WAS A RECALL DEALING WITH A NATIONAL RECALL WITH SOFTWARE UPDATES.  ON JULY 16TH THE YELLOW LIGHT CAME ON AS SOON AS WE STARTED TO DRIVE THE CAR.  IT WAS THE BRAKE INDICATOR AND THEY ASKED MY WIFE TO DRIVE IT TO THE DEALERSHIP 25 MILES AWAY?  I CALLED INTO QUALITY IMPORTS TOYOTA IN FT. WALTON BCH , FLORIDA WHERE WE PURCHASED THE CAR AND VENTED MY FRUSTRATIONS.  I WAS NOT SATISFIED WITH THEM ASKING US TO DRIVE THE CAR WITH A BRAKE LIGHT INDICATOR THAT JUST CAME ON.  WE ARE FEARFUL OF THE NEXT FAILURE WITH THIS VEHICLE.  THE MANUFACTURE GAVE ME A CLAIM NUMBER 1407161970 TO START THE PROCESS OF THE COMPLAINT.   I GOT A CALL FROM THE TOYOTA CASE MANAGER [XXX] WHO BASICALLY SAID WE HAVE TO FILL OUT A LOT OF FORMS FOR THE LEMON LAW AND ARBITRATION PROCESS.  BASICALLY WE WERE ASKED TO DRIVE THE CAR UNTIL 30-40 DAYS LATER FOR THE PROCESS.  I TOLD [XXX] WE DON'T FEEL SAFE IN THE CAR AND THAT THEY SHOULD LET US USE A LOANER.  HE DENIED THE REQUEST?? REQUEST TO HAVE THIS INVESTIGATED.      'INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "05/18/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609372,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA PRIUS.  CONSUMER WRITES IN REGARDS TO ENGINE FAILURE.  *SMD  THE CONSUMER STATED A BROWN COLORED ALARM APPEARED ON THE DASH, WHICH FLASHED ON THEN OFF, AS THE VEHICLE STARTED TO SLOW DOWN. IF HE TRIED TO ACCELERATE, THE LIGHT WOULD COME ON, BUT NO RESPONSE TO INCREASE SPEED. HE MANAGED TO PULL OVER, AND STOPPED THE VEHICLE. AFTER A FEW SECONDS, HE TRIED TO RE-START THE ENGINE AND WAS SUCCESSFUL. THE DEALER WAS UNABLE TO DUPLICATE, THE PROBLEM THE CONSUMER EXPERIENCED.",
        "vin": "JTDKN3DU7E1"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "06/30/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "POINT SOURCES OF LIGHT (I.E. BRAKE LIGHTS, HEADLIGHTS, TRAFFIC LIGHTS, ETC.) AT NIGHT TIME AND TO A LESS VISIBLE EXTENT IN THE DAY TIME ARE DUPLICATED OR TRIPLICATED AT DISTANCES THROUGH THE FRONT WINDSHIELD.  AS THE LIGHT SOURCE IS CLOSER TO THE CAR, THE GHOSTING EFFECT DIMINISHES.  THIS PROBLEM DOES NOT OCCUR WHEN LOOKING OUT THE SIDE WINDOWS OR REAR WINDSHIELD, BUT ONLY OCCURS THROUGH THE FRONT WINDSHIELD.  THIS PRISM EFFECT INDUCES NAUSEA AND IS INCREDIBLY DISTRACTING WHILE DRIVING.  *TR",
        "vin": "JTDKN3DPXE3"
    },
    {
        "components": "ELECTRICAL SYSTEM,HYBRID PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/18/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599173,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2014 TOYOTA PRIUS ON MAY 31, 2014.  TODAY 6/18/14 I FOUND OUT THERE WAS A RECALL ON THIS MODEL VEHICLE.  I CALLED TOYOTA AND I WAS INFORMED THE RECALL SERVICE HAD NOT BEEN PERFORMED.  I CALLED A LOCAL DEALER (DIFFERENT FROM THE ONE WHERE I PURCHASED THE VEHICLE) AND THEY INFORMED ME THAT WHEN THEY PULLED THE VIN, IT SHOWED STOP SALE IN EFFECT.   I DO NOT BLAME TOYOTA AS OBVIOUSLY IF ONE DEALER COULD SEE THE STOP SALE SO COULD THE OTHER.  I THINK THAT THERE SHOULD BE STRICTER REGULATIONS ON DEALERSHIPS TO MAKE SURE THESE RECALLS ARE COMPLETED BEFORE THE SALE!!  JUST LIKE THE GENTLEMAN THAT COMPLAINED EARLIER I ALSO PURCHASED A BRAND NEW DEFECTIVE VEHICLE,  HOW CAN THIS HAPPEN SEVERAL MONTHS AFTER THE RECALL. !!  NOW I HAVE TO TAKE THE TIME OFF TO TAKE IT IN TO HAVE THE RECALL FIXED.  THIS IS A MAJOR INCONVENIENCE, LOSS OF USE OF VEHICLE AND LOSS OF TIME FROM WORK.  I ALSO WANT TO KNOW HOW TO GET COMPENSATED FOR THE INCONVENIENCE AND TIME, PLUS THE FACT THEY SOLD AND I  HAVE BEEN DRIVING AN UNSAFE VEHICLE.  *TR",
        "vin": "JTDKN3DUXE1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/12/2014",
        "dateOfIncident": "01/25/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597984,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING IN SLIPPERY CONDITIONS I ATTEMPTED TO NAVIGATE A RIGHT HAND TURN. THE CAR BEGAN TO SLIDE WHILE BRAKING INDICATING POSSIBLE SNOW BUILDUP IN FRONT OF TIRES. I ATTEMPTED TO ACCELERATE OUT OF THE SLIDE WHICH IS PROPER IN FRONT WHEEL DRIVE VEHICLES. THE CARS DASH LIGHTS LITE UP AND THE SLIDE INDICATOR STARTED BEEPING. THE CAR BECAME COMPLETELY UNRESPONSIVE TO THE GAS PROVIDING NO POWER WHATSOEVER. THE CAR SLID OVER THE CURB AND CRASHED INTO A HIGHWAY SIGN AND FINALLY CAME TO REST.   *TR",
        "vin": "JTDKN3DUXA0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/20/2014",
        "dateOfIncident": "05/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592866,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS. THE CONTACT STATED THAT THE VEHICLE WOULD REVERSE WHEN SHIFTED TO DRIVE WITHOUT WARNING. THE VEHICLE WAS NOT TAKEN TO A DEALER OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 3,000 AND THE CURRENT MILEAGE WAS 3,002.",
        "vin": "JTDKDTB3XE1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA PRIUS.  CONSUMER WRITES IN REGARDS TO VEHICLE SAFETY FEATURES.  *SMD  THE CONSUMER BELIEVED BACK-UP CAMERAS SHOULD COME STANDARD ON VEHICLE.  HE ALSO BELIEVED AUTO BRAKING SHOULD BE A STANDARD FEATURE. *JB",
        "vin": ""
    },
    {
        "components": "HYBRID PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584837,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA PRIUS.  CONSUMER WRITES IN REGARDS TO  ELECTRICAL SYSTEM SOFTWARE RECALL NOTICE AND REQUESTS FINANCIAL COMPENSATION. *SMD  THE CONSUMER STATED TOYOTA AND THE DEALER KNOWINGLY SOLD HIM A DEFECTIVE VEHICLE, IN WHICH THEY WERE FULLY AWARE OF RECALL # 14V053000. *JB",
        "vin": "JTDKN3DUXE1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2014",
        "dateOfIncident": "04/08/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY AT HIGHWAY SPEEDS A SERIES OF YELLOW TRIANGLES SUDDENLY FLASHED ON THE DASHBOARD ALONG WITH SOME BEEPS. THE ENGINE THEN STALLED AND THE GAS PEDAL NO LONGER RESPONDED TO ANY INPUTS. DUE TO A COMBINATION OF SHEER LUCK AND DRIVER PRESENCE OF MIND THE CAR WAS STEERED TO THE SHOULDER OF THE HIGHWAY WHERE IT CAME TO A HALT. THE EXPERIENCE OF TRYING TO CONTROL A CAR WITH A STALLED ENGINE AND SAFELY STEER IT TO THE SHOULDER IN HEAVY TRAFFIC WAS TERRIFYING TO SAY THE LEAST.  THE CAR WAS TAKEN STRAIGHT TO THE DEALER WHERE IT WAS LEFT FOR SERVICE. AFTER DIAGNOSIS A COUPLE OF DAYS LATER THE DEALER CALLED BACK AND SAID THAT THE ENGINE CONTROL MODULE HAD FAILED WHICH IS WHY THE ENGINE HAD STALLED. THE CAR IS STILL WITH THE DEALER SINCE THE PART IS NOT AVAILABLE AND NEEDS TO BE SHIPPED FROM TOYOTA. THE DEALER CLAIMED THAT THIS WAS SUCH A RARE OCCURRENCE THAT THEY DID NOT HAVE THE PARTS AVAILABLE. THEY ALSO CLAIMED THAT THEY DID NOT KNOW ANYONE ELSE FOR WHOM THIS HAD HAPPENED. MAYBE SO BUT THIS WAS AN INCIDENT THAT COULD HAVE BEEN FATAL. THE FACT THAT NOBODY GOT KILLED IS JUST PLAIN LUCK.   *JS",
        "vin": "JTDKN3DU5E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/13/2014",
        "dateOfIncident": "12/28/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564240,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELDS ON PRIUS MODELS 2010 AND HIGHER ARE AFFECTED.    WHILE MOST OBVIOUS AT NIGHT, EXTERNAL LIGHT SOURCES VIEWED THROUGH THE FRONT WINDSHIELD CAN BE MIRRORED IN TRIPLICATE VIA A \"PRISM\" OR \"REFRACTION\" EFFECT.  INTERIOR OCCUPANTS WILL WITNESS LIGHT SOURCES BEING REPLICATED 3 TIMES.    THE RESULTING EFFECT CAN CREATE NAUSEA OR DIZZINESS IN OCCUPANTS, AND IS EXPERIENCED WITH MAXIMUM EFFECT AT NIGHT DURING TRAFFIC WHEN THE ABILITY TO SAFELY NEGOTIATE ROADWAYS IS PARAMOUNT.  *TR",
        "vin": "JTDKN3DU8E1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/10/2014",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559321,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA PRIUS HYBRID. THE CONTACT STATED WHILE TRAVELING VARIOUS SPEEDS, A PASSENGER PUT THEIR ARM  OUT OF THE WINDOW AND IT ERRONEOUSLY CLOSED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 358.",
        "vin": "JTDKN3DP9E3"
    }
]