[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "07/08/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423951,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbag light on and needs spiral cable. safety is at risk because the mechanism to deploy air bag is not functioning confirmed by both dealer and outside mechanic Has been inspected by Toyota dealership there has been multiple airbag recalls for Toyota vehicles during the year my car came out. I feel there needs to be a recall on this airbag issue",
        "vin": "5tdby5g15es"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317112,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DOESN'T WANT TO START. ALL LIGHTS ARE ON THE DASHBOARD. THE CAR RUNS TERRIBLY AND STALLS AT TIMES. THE CODE STATES THE FUEL PUMP NEEDS TO BE REPLACED. FUEL PUMP HAS BEEN ON BACKORDER FOR 5 WEEKS. OVER 1300 REQUESTS FOR THE PART IN THIS AREA ALONE. OBVIOUSLY THIS IS A PROBLEM WITH OTHER SEQUOIAS AS WELL.",
        "vin": "5TDJW5G11ES"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311824,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT SEATS ARE BROKEN. THIS IS A VEHICLE THAT IS NOT DRIVEN THAT MUCH IT IS THE 2ND CAR AND USED ON WEEKENDS MOSTLY. I HAVE ONLY HAD THE CAR FOR A SHORT PERIOD OF TIME NEVER HAVE HAD CAR SEAT OR SEATS BREAK  AT ALL NOW BOTH FRONT SEATS ARE BROKEN I THOUGHT SCREWS WERE LOOSE DEALER SAID BROKEN. WTF",
        "vin": "5TDZY5G14ES"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300637,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 TOYOTA SEQUOIA IS STALLING AT LOW SPEEDS, I.E. WHEN MAKING U TURNS OR SLOWING UP AND PRESSING THE GAS, THERE IS  A 5-7 SECOND DELAY IN THE ENGINE RESPONDING, THIS IS CAUSING A SAFETY ISSUE WHEN YOU NEED TO GET OUT ON A BUSY ROAD AND YOU DON'T HAVE THE POWER NEEDED. I HAVE SPENT SEVERAL HUNDRED DOLLARS AT THE TOYOTA DEALERSHIP WITH STILL NO RESOLUTION AND RECENTLY HAD THE SPARK PLUGS REPLACED. I HAVE READ ON NEWER MODELS THE FUEL PUMPS HAVE HAD A RECALL, BUT AT THIS TIME NOT THE 2014. PLEASE NOTE FOR THE QUESTION BELOW, WHEN DID THIS HAPPEN, ITS BEEN GOING ON NOW FOR OVER A YEAR.",
        "vin": "5TDDW5G17ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195608,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-10 IN LOUISIANA (DRIVING FROM TEXAS TO GEORGIA) WHEN I HEARD A LOUD GUNSHOT NOISE. I PULLED OVER AND LOOKED AT MY TIRES AND AROUND THE BODY OF THE CAR AND THEN LOOKED UP ON THE ROOF. THE SUNROOF WAS SHATTERED WITH A HUGE HOLE IN THE MIDDLE. I HAD A DOG AND 2 AND 4 YEAR OLD IN MY CAR. NO OVERPASSES OR OTHER CARS AROUND ME. NOTHING HIT THE CAR. IT WAS A SPONTANEOUS SHATTER. NO DRAMATIC WEATHER CHANGES.",
        "vin": "5TDDW5G14ES"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "12/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170486,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING OUT OF A PARKING LOT AND THE LEFT REAR PASSENGER DOOR FLEW OPEN AT RANDOM. I BROUGHT THE CAR INTO A TOYOTA DEALER AND WAS TOLD THE LOCK ACTUATOR WAS MALFUNCTIONING AND THEY REPLACED IT. THANKFULLY THERE WERE NO PASSENGERS IN THAT SEAT.",
        "vin": "5TDJY5G14ES"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "02/25/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958848,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF ON VEHICLE EXPLODED WITH NO WARNING OR VISIBLE CAUSE WHEN DRIVING ON INTERSTATE 70  A FEW MILES WEST OF DENVER, CO.   EXPLOSION WAS SUDDEN AND LOUD CAUSING IMMEDIATE SHATTERING OF SUNROOF GLASS.  INTERIOR PORTION WAS CLOSED FORTUNATELY OR GLASS WOULD HAVE FALLEN INTO PASSENGER COMPARTMENT. 0225201",
        "vin": "5TDBW5G14ES"
    },
    {
        "components": "STEERING,SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875117,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA SEQUOIA.  CONSUMER WRITES IN REGARDS TO ONGOING STEERING WHEEL VIBRATION ISSUES.  *SMD  THE CONSUMER STATED FROM THE DAY OF PURCHASE, THE VEHICLE EXHIBITED A SLIGHT VIBRATION. AS THE DAYS WENT ON, THE VIBRATION BECAME MORE SEVERE.  THE CONSUMER RETURNED TO THE DEALER. HOWEVER, THEY WERE UNABLE TO FIND A PROBLEM.  THE CONSUMER WENT TO ANOTHER DEALER AND WAS INFORMED, THE VEHICLE HAD A HISTORY OF HAVING WARPED ROTORS, BUT THEY COULDN'T FIX IT, DUE TO WARRANTIES FROM THE PURCHASING DEALER.  THE NEXT DAY, THE STEERING WAS VIBRATING EVEN MORE, SO THE DEALER REPLACED AND BALANCED THE TIRES. THREE MONTHS LATER, THE STEERING VIBRATION HAD RETURNED. THE DEALER ROTATED THE TIRES.  SEVEN MONTHS LATER, THE VIBRATION RETURNED AGAIN. THE DEALER BALANCED THE TIRES.  *JB",
        "vin": "5TDYY5G13ES"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2016",
        "dateOfIncident": "11/25/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821915,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "1.THE WINDSCREEN CANNOT RESIST TINY PIECES OF STONE-LIKE DEBRIS OF ABOUT .001CM DIAMETERS THAT SOMETIMES FALL FROM BIGGER TRUCK AND TRAILER AHEAD OF YOU. I HAVE A PROBLEM OF THE DESCRIPTION ABOVE (MY WINDSCREEN HAS A TINY DEFORMATION AS A RESULT OF UNSUSPECTED CONTACT WITH SUCH ROAD HAZARDS) OF WHICH I CALLED TOYOTA AND FILED A COMPLAINT. I WAS TOLD TO TAKE MY CAR TO DEALERSHIP FOR INSPECTION, THEY CONCLUDED THAT THEY WILL NOT COVER IT BECAUSE IT'S EXTERNAL FACTOR. THIS CAR IN QUESTION IS LESS THAN 12,000 MILES WHEN IT OCCURRED. I HAVE OTHER CARS I HAVE DRIVEN FOR MORE THAN 10-13 YEAR UNDER SIMILAR CONDITION WITHOUT INCIDENT.    2.RECENTLY I NOTICED MY GPS AND ENTERTAINMENT SYSTEM WAS FROZEN UP OR RESTART IN THE MIDDLE OF MY TRIPS. WHEN IT FROZEN I WOULD BE UNABLE TO ADJUST THE VOLUME OF THE RADIO OR TUNE OFF OR ON. THE GPS WILL RESTART AND RE-ROUTE ME TO UNDESIRED DESTINATION. THIS HAS BEEN FRUSTRATING FOR ME AND MY FAMILY.    3.THE TIRE PRESSURE MONITOR IS MALFUNCTION; EVEN IF MY TIRE PRESSURE IS AT A RECOMMENDED LEVEL IT WILL STILL DISPLAY THE NOTIFICATION.",
        "vin": "5TDKY5G11ES"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "09/29/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT AND REAR PARKING ASSIST SONAR FAILED TO WORK.  THE SONAR FAILED TO GO OFF BEFORE HITTING A 4 FOOT TALL PARKING POLE ON PASSENGER FRONT BUMPER.  CAUSING DAMAGE TO THE FRONT BUMPER.  TWO DAYS LATER A DIFFERENT DRIVER BACKED INTO A 5 FOOT TALL TRASH CAN ON BACK DRIVER BUMPER. AGAIN, THE SONAR DID NOT GO OFF. THE TOYOTA DEALERSHIP SAID THEY KNEW IT WAS FRUSTRATING, BUT THEIR BEST ADVICE WAS JUST TO DRIVE IT LIKE WE DIDN'T HAVE SONAR. WE EXPLAINED WE BOUGHT THE VEHICLE FOR IT'S SAFETY DEVICES. HAVING SMALL CHILDREN, SONAR WAS A BIG PART OF OUR PURCHASE DECISION. WE JUST HAD TO KEEP TAKING IT BACK OVER AND OVER. AFTER TAKING THE VEHICLE BACK TO TOYOTA DEALERSHIP 8 TIMES TELLING THEM THE PARKING SONAR DOES NOT WORK, THE SENSORS FINALLY STOP WORKING AND WOULD NOT TURN ON.   WE IMMEDIATELY BROUGHT IT TO THE DEALERSHIP SO THEY COULD SEE THE SONAR WHEN IT WAS MALFUNCTIONING. PRIOR TO THIS, IT WAS INCONSISTENT. THIS TIME, IT COMPLETELY STOPPED WORKING.",
        "vin": "5TDDW5G17ES"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568523,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA SEQUOIA. THE CONTACT STATED THAT THE VEHICLE STALLED RECURRING. THE VEHICLE WAS TAKEN TO THE DEALER, WHO WAS UNABLE TO DUPLICATE THE FAILURE. NO REPAIRS WERE PERFORMED. THE RECURRING FAILURE PROGRESSED AND THE CONTACT WOULD HAVE TO WAIT SEVERAL MINUTES BEFORE THE VEHICLE COULD BE RESTARTED.  THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE CONTACT WAS AWAITING THE RESULTS OF THE DEALER?S INVESTIGATION OF THE FAILURE. THE VIN WAS NOT AVAILABLE.  THE APPROXIMATE FAILURE MILEAGE WAS 400.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566920,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA  SEQUOIA SR/5       I JUST LEASED THE ABOVE VEHICLE.  IT IS THE THIRD TOYOTA PASSENGER VEHICLE THAT I HAVE OWNED AND/OR LEASED.     THIS VEHICLE HAS A PROBLEM THAT POSES A SERIOUS THREAT TO LIFE AND LIMB OF THOSE WHO OPERATE IT AS WELL AS  OTHERS  ON THE HIGHWAY AND NEARBY.    THE PROBLEM IS THAT INSTRUMENT PANEL IS SO BADLY LIGHTED IN THE DAYTIME THAT DURING  BRIGHT DAYLIGHT HOURS WITH THE INSTRUMENTS BEING  SHADED BY THEIR LOCATION WITHIN THE PANEL THEY CANNOT BE READ.      THIS IS A TERRIBLE DISTRACTION TO THE DRIVER WHO IS TRYING TO CHECK INSTRUMENTS WHILE ALSO DRIVING THE VEHICLE.  ONE REALLY NEEDS TO USE A FLASHLIGHT TO SEE SPEED, HOW MUCH FUEL IS IN THE AUTO AND TO CHECK ON OTHER FUNCTIONS SUCH AS OIL, ENGINE TEMPERATURE, RADIO TUNING AND OTHER ITEMS REFLECTED IN THE INSTRUMENT PANEL.  SORT OF LIKE ?TEXTING?  WHICH OCCUPIES AND DEMANDS ONE?S ATTENTION WHILE TRYING TO ?SEE? THE CONDITIONS REFLECTED BY THE INSTRUMENTS ON THE PANEL, RATHER THAN CONCENTRATING ON OTHER TRAFFIC, ROAD AND OTHER CONDITIONS.    THIS IS THE THIRD TOYOTA I HAVE USED OVER THE PAST TEN YEARS AND THE PROBLEM HAS BEEN PRESENT IN EACH OF THE VEHICLES, THOUGH WITH THE ABOVE MODEL THE PROBLEM IS GETTING WORSE RATHER THAN BETTER.    TOYOTA SHOULD BE REQUIRED TO \"FIX\" THIS PROBLEM BEFORE SOMEONE HAS BEEN INJURED OR KILLED?WHICH HAS PROBABLY ALREADY HAPPENED.  *TR",
        "vin": "5TDBW5G19ES"
    }
]