[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/31/2022",
        "dateOfIncident": "03/31/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459056,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Audio System, Navigation. Cannot enter and use set up Menu for Radio, CD. The Panel continuously displays the screen of the software, hardware, Entune starting and restarting.",
        "vin": "JTMBFREV3EJ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450140,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I have been experiencing a strange burning smell in my RAV4 for the past week but was unable to locate the source. No warning lights were active on the dash and the vehicle was functioning properly. Because I live in a colder climate I generally use the heated seat function daily, but would like to clarify that the use of my vehicle amounts to less than an hour a day with my combined morning and afternoon commute. Today I noted that there is a sizeable hole in my driver seat that is burned and melted from the heated seat function. I have not turned the heated seat function back on for fear of a fire.",
        "vin": "JTMRFREVXED"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/05/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442707,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Shortly after I purchased the vehicle, the Entune application began sending “movement alerts” and frequently showed that it was in a different location.  The dealership said that an update was required, but that did not fix the problem.  About a year later, it began to drain batteries repeatedly (4 in one year).  The Toyota dealership could not find a problem.  After the last battery replacement, I noticed that the Entune app shows that I have over 960,000,000 miles on the vehicle (when the odometer isn’t even at 85,000) and the battery voltage was 14.6 volts! My car was broken into and the front window was broken, but the app failed to inform me of that!  About a month ago, I left home and all of the lights on the dash started flashing.  The engine temperature was rising (according to the temperature gauge), and then the gauges stopped functioning.  The tachometer showed 0 RPMs and I was unable to see the odometer, temperature, or even my speed.  After disconnecting and reconnecting the battery cables, it appeared to solve the problem.  I am afraid of what may happen next and would trade it in if I could afford to.",
        "vin": "2t3yfrev7ew"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440729,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2014 Toyota RAV4 had an accident (front end collision) No air bags deploy",
        "vin": "2T3RFREV5EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440515,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicles transmission torque converter has issues and makes entire vehicle shake while driving. It causes issues when going up and down hills and shifting gears to maintain appropriate speeds. Vehicle shakes aggressively when at high speeds making highway travel impossible and unsafe. Toyota dealerships quote $3000 in repairs to replace defective part.",
        "vin": "2T3YFREV1EW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439947,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "My husband made sure he took the car into the dealership before his current deployment & records showed nothing was wrong. About 2 months ago I noticed the vehicle would jump from 2 to 3 RPM. He changed the spark plugs and battery. The drive improved but soon started revving again. In September, I called the dealership & described the issue & noted that there was no check engine light or any light indicating anything was wrong. The maintenance personnel said to drop it off for further diagnosis. On October 15, I took the vehicle in for a diagnostic it came back with another clean report and was advised to bring it back in if the problem persist. The next morning, I noticed the vehicle was still behaving the same way. I called the dealership and told them I will bring the vehicle back in. I was insistent on finding out what the problem was & showed them a video of what I was describing the vehicle was doing. The dealership said they would keep it overnight to try & figure out what was wrong. The following evening October 21, I got a call stating that my transmission fluid was black with metal shavings and it was supposed to be red. The transmission fluid could no longer be changed at this point but instead the entire transmission needed to be replaced for $8,947.95! Keep in mind that the average cost of changing the transmission fluid is $250. If my vehicle was properly maintained when took it to Toyota dealerships since 2014 for ALL the recommended maintenance, we would not be having this issue. We TRUSTED the dealerships to tell us what maintenance was needed. The transmission fluid should have been replaced at 60,000 miles & it was not. Now we have to replace the entire transmission. Toyota needs to take ownership of their mistake; not properly maintaining our vehicle. It is no fault of our own that it was never indicated to us that the transmission fluid needed to be replaced. His family with no vehicle, exactly what he was trying to avoid before he deployed.",
        "vin": "2T3DFREV3EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/29/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431159,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "On Sunday, Aug 29th, our RAV4 caught fire in our driveway. The vehicle was off/parked at the time and required the fire department to extinguish.  The fire spread to our truck which was parked next to the RAV4. Both are a complete loss.",
        "vin": "JTMRFREVXED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/29/2021",
        "dateOfIncident": "08/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430946,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The first thing that happened was while driving in the day my dash board lights shut off and back on three different times with in 5-7 minutes.  Then the next day while driving down the road by vehicle electrical dash board system shut itself off and came back while I was driving. The warning symbol for the electrical steering power flashed on and my steering wheel locked up as I was turning and caused me not to be able to steer normally.  Also, my air conditioning shut off and back on during these incidents.",
        "vin": "2T3BFREV4EW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "08/15/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429690,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Toyota Rav4. The contact stated while driving 20 MPH, the power steering assist message displayed, and the steering wheel became very difficult to turn in either direction. The next day the vehicle was towed to the local dealer who was unable to duplicate the failure. The cause of the failure was not determined, and no repairs were performed. The manufacturer was contacted regarding the failure, but no assistance was offered. The contact was informed that the vehicle was not included in the NHTSA Campaign Number: 15V144000 (Steering). The contact indicated that the vehicle had experienced the same failure listed in the recall. The failure mileage was 74,800.",
        "vin": "2T3DFREV2EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/16/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425497,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2014 Toyota RAV4. The contact stated while driving 15 mph, the vehicle stalled without warning. After multiple attempts, the contact was able to restart the vehicle. Soon after the vehicle was restarted there was smoke coming from the vehicle and the vehicle stalled again. The contact stated that the battery had caught on fire. The battery was destroyed. The fire department was not notified of the fire. There was no injury sustained. Due to the failure, the contact had the vehicle towed to an independent mechanic for repair. Neither the dealer nor the manufacturer was notified of the failure. The vehicle was not repaired and remained in the possession of the mechanic. The failure mileage was approximately 135,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/01/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424423,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2014 Toyota Rav4. The contact stated while making a right turn at an undisclosed speed, the steering wheel was difficult to turn. During the failure, the instrument panel flashed approximately 4-5 times before going black. The contact stepped out to look under the hood and noticed a small fire. The police department was contacted and arrived and put out the fire. A police report was filed. The vehicle was towed away and deemed a total loss. The contact was not injured. Medical attention was not needed. The dealer was not contacted. The manufacturer was made aware of the failure and opened a case. The approximate failure mileage was 102,000.",
        "vin": "2t3wfrev3ew"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "06/06/2021",
        "dateOfIncident": "06/04/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419845,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "After a minor front end collision, the RAV4 immediately began smoking and caught fire. With a minor accident where the other car only had their front bumper minorly damaged, the RAV4 should not have caught fire.  Their must be a defect in either the battery or oil line for the car to have caught fire.   The car is a total loss and I am asking for a full investigation as my  2 children were in the car when the fire started.",
        "vin": "JTMZFREV3EJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2021",
        "dateOfIncident": "05/31/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419257,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Making a turn onto a local toll road and entire car went dead without warning of any kind.  I had to struggle with loss of power steering to complete turn without going off road.  Car came to a stop. I tried to call my wife to advise her I was having car problems which is surprising as I haven't had issues previously and had an earlier version of the RAV4 that I drove for 210,000 miles. Anyway, another vehicle stopped alongside and inquired if I needed assistance.  As I talked, I noticed a smokey smell from what I had initially assumed was steam.  I stepped outside the vehicle and observed through the drivers side front wheel well to see fire at the bottom of the engine compartment. Since I was driving to trails to ride my mountain bike, I had a water bottle and squeezed it onto the flames which partially extinguished and then relit. I hit the hood release but decided it was better to leave the hood down.  I went to the rear lift gate to open it to retrieve my expensive carbon fiber mountain bike but it was locked.  I tried to open the back driver side door also without success and tried hitting the unlock button on the drivers door but there was no power. About this time the smoke coming from the hood increased and I decided to heed the advise being given to step away from the car.  Had I remembered sooner, I probably could have reached around the driver's seat to recover my wallet from the back pocket of the seat.  As the fire increased, I stepped increasingly further back from the vehicle. About 5 minutes into the fire a state trooper arrived and expended his only extinguisher in an unsuccessful attempt to put out the fire. It was probably another 12-15 minutes before the fire department arrived to extinguish the fire but by that time, the car and its contents were a total loss.",
        "vin": "2T3ZFREV3EW"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418136,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the road. I slowed up for a light and it turned green and started to go and my car turned off. Electrical still worked but engine was off.",
        "vin": "Jtmbfrev3ed"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417929,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "All but one lock has now failed.  The truck is not able to be opened.  There were no warnings/indications, and now the company is telling me that it is no longer under warranty and it cannot be repaired unless paid for.  I do find similar stories online and that the locks fail a second time in some cases.",
        "vin": "2T3BFREV9EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "03/20/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406924,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 20, MY 2014 TOYOTA RAV4 CAUGHT FIRE. IT WAS PARKED IN MY GARAGE AND HAD NOT BEEN MOVED FOR AT LEAST 24 HOURS. THE CAR FIRE CAUGHT THE RAFTERS IN MY ATTACHED GARAGE AND THEN CAUGHT THE REST OF MY HOME ON FIRE.",
        "vin": "2T3DFREV3EW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/24/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404722,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING IN CAPITOL REEF NATIONAL PARK ON A WELL GRADED AND FULLY MAINTAINED DIRT ROAD, ALL THE LIGHTS IN MY DASH STARTED FLICKERING, AND THEN MY CARS ENGINE SHUT DOWN. IT FELT LIKE I WAS DRIVING / COASTING IN NEUTRAL. I PULLED OVER AND PUT THE CAR IN PARK, THEN SMOKE STARTED COMING FROM BENEATH THE HOOD. I GOT OUT OF THE CAR. IT WAS A LITTLE SMOKE, THEN MORE, AND THEN SUBSIDED TO BEING BARLEY NOTICEABLE AFTER A COUPLE OF MINUTES. AFTER IT SUBSIDED, I GOT BACK IN THE CAR TO TRY TO START IT, HOPING IT WAS AN OVERHEATED ENGINE AND I MIGHT GET THE CAR TO TURN OVER. IT WOULD NOT START. I CALLED A TOW TRUCK. SHORTLY AFTER THAT, I NOTICED A HISSING NOISE COMING FROM BENEATH THE HOOD, SAW A LIQUID DRIPPING BENEATH THE THE FRONT LEFT (DRIVERS SIDE) PART OF THE CAR. I ALSO SAW A SMALL FLAME. I CALLED 911 TO REPORT THAT MY CAR WAS ON FIRE. WITHIN 10-15 MINUTES, THE CAR WAS COMPLETELY ENGULFED IN FLAMES. THE PARK RANGER, SHERIFF, AND FIRE DEPARTMENT SHOWED UP SHORTLY AFTER THAT. A CHARRED CAR FRAME IS ESSENTIALLY WHAT'S LEFT.",
        "vin": "2T3BFREV5EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398781,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE PAST THREE MONTHS, THE ELECTRICAL SYSTEM WILL RESTART WHILE I'M DRIVING, USUALLY WHEN FLICKING ON MY BRIGHTS. I GOT THE CAR CHECKED AND THE MECHANICS STATED IT PROBABLY WAS FROM THE BUILD UP ON THE BATTERY. THERE WERE A COUPLE DAYS WHEN THE BATTERY WAS COMPLETELY DEAD. THANKS FOR ANY ADVICE.",
        "vin": "2T3BFREV0EW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/22/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394683,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2014 TOYOTA RAV4. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 5 MPH, THE VEHICLE CAUGHT ON FIRE COMING IN THE DRIVER'S SIDE ENGINE COMPARTMENT. THE FIRE DEPARTMENT WAS CONTACTED AND ARRIVED AT THE SCENE AND EXTINGUISHED THE FIRE. THE VEHICLE WAS TOWED TO INDEPENDENT MECHANIC WHERE IT WAS DEEMED A TOTAL LOSS. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 15V011000 (TRAILER HITCHES, EXTERIOR LIGHTING) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 51,000.",
        "vin": "2T3DFREV7EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391014,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEAD UNIT WHICH PROVIDES NAVIGATION, SOUND, HANDS FREE PHONE, BLUETOOTH AND MUSIC OPTIONS CONTINUALLY ATTEMPTS TO RELOAD.  SO I HAVE NONE OF THE ABOVE FEATURES TO USE.  THIS PRESENTS A PROBLEM, AS IF I WANT TO MAKE OR RECEIVE A PHONE CALL, OR SPEAK HANDS FREE, THE OPTION NO LONGER EXISTS.  I HAVE REVIEWED WEBSITES LIKE YOUTUBE AND CARCOMPLAINTS.COM, AND THERE ARE A LOT OF OWNERS OF NOT JUST A RAV4, BUT OTHER TOYOTA BRANDS WHO ARE HAVING OR HAVE EXPERIENCED THE SAME ISSUE.  I'VE CALLED TOYOTA, AND THEY SAID THERE IS NO RECALL ON THIS SYSTEM.  I DON'T SEE HOW NOT HAVING YOUR NAVIGATION, OR HANDS FREE PHONE SERVICES NOT WORKING, CANNOT BE A SAFETY CONCERN!  THE WHOLE POINT OF HANDS FREE IS INDEED A SAFETY ISSUE!  IT DOESN'T MATTER WHETHER YOU ARE DRIVING OR NOT, THE SYSTEM JUST WANTS TO CONTINUALLY REBOOT.  FROM WHAT I'VE READ AND WATCHED, THIS IS A KNOWN MANUFACTURING FLAW WITHIN THE 'ENTUNE' SYSTEM.  I'M HOPING YOUR ORGANIZATION CAN REVIEW THIS ISSUE AND SUPPORT THE MILLIONS OF TOYOTA OWNERS ACROSS THE NATION.",
        "vin": "JTMRFREV1EJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388530,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "GREETINGS AND SALUTATIONS.  THIS COMMUNICATION IS ABOUT THE DEFECTIVE TORQUE CONVERTER IN THE TRANSMISSION THAT TOYOTA IS AWARE OF. I ACQUIRED THE VEHICLE AT ABOUT 33,000 MILES AND I NOTICED THAT IT HAD THIS PROBLEM OF A SLIGHT INTERMITTENT SHUDDER, WHAT SOME WOULD CALL A SHAKE OR VIBRATION, DURING ACCELERATION COMING FROM THE TRANSMISSION. IT DID NOT AFFECT THE PERFORMANCE OF THE VEHICLE SO I IGNORED IT MAINLY BECAUSE I DID NOT HAVE THE TIME TO ADDRESS IT. AS TIME WENT ON THE CONDITION BECAME MUCH MORE NOTICEABLE AND TOYOTA SENT ME A LETTER EXPLAINING THAT THEY WERE AWARE OF THE PROBLEM AFFECTING SOME OF THEIR VEHICLES AND THAT THEY WERE EXTENDING THE WARRANTY. I HAVE ATTACHED PHOTOS OF THIS LETTER WITH THIS COMMUNICATION. I FOUND OUT THAT THIS EXTENDED WARRANTY IS CONSIDERED A COURTESY AND CERTAINLY IT COVERED UP TO A CONSIDERABLE MILEAGE HOWEVER MY POSITION IS THAT BECAUSE THIS CONDITION EXISTED AT EARLY MILEAGE AND GREW CONSIDERABLY WORSE WITH EXTENDED MILEAGE AND TIME, THAT PERHAPS YOU MAY CONSIDER THAT TOYOTA SHOULD CORRECT THIS PROBLEM REGARDLESS OF MILEAGE OR TIME. MY VEHICLE IS PAST THE ALLOWABLE MILEAGE IN THE EXTENDED WARRANTY. I KNOW TOYOTA DOESN'T WANT TO HEAR THAT BUT PERHAPS THIS PROBLEM THAT THEY ARE AWARE OF IS FOUND IN A RELATIVELY SMALL NUMBER OF VEHICLES THAT IT MAY NOT CAUSE THEM MUCH GRIEF AT ALL. THANK YOU.",
        "vin": "2T3ZFREV4EW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MILEAGE ON THE VEHICLE IS HIGH, OVER 188,000 MILES BUT I THINK THIS ISSUE IS IMPORTANT ENOUGH TO MAKE NOTE OF IT. THE PLASTIC COUPLER AT THE UPPER END OF THE RADIATOR HOSE STARTED LEAKING COOLING FLUID AND I FOUND THAT IT HAD DETERIORATED TO THE POINT THAT THE END OF THE PLASTIC COUPLER INSIDE OF THE RUBBER HOSE WAS BROKEN AND WHEN REMOVED I FOUND THAT IT WAS BRITTLE TO THE TOUCH. I HAVE ATTACHED PHOTOS OF THE PART IN QUESTION. I THINK IF TOYOTA COULD MAKE THIS PARTICULAR PART OUT OF METAL IT WOULD NOT COST MUCH AND COULD SAVE THE CONSUMER FROM A SERIOUS ISSUE.",
        "vin": "2T3ZFREV4EW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382777,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS IN MOVEMENT AT SPEED OF 20 OR30 MPG CHANGING CAUSE A  SHIVERS INTO A JERKING FEELING",
        "vin": "2T3WFREV4EW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2020",
        "dateOfIncident": "12/14/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374185,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A USED 2014 TOYOTA RAV4 ON 01-2018 FOR THE PURCHASE PRICE OF $12,000. IT HAD 36,198 MILES AT THE TIME OF PURCHASE. APPROXIMATELY ONE YEAR AFTER PURCHASE, NOTICED A SHUTTERING WHILE AT CERTAIN SPEEDS. LOOKED INTO RECALLS AND FOUND THAT THERE WAS A SERVICE BULLETIN REGARDING THESE SYMPTOMS. CALLED TOYOTA AND THEY TOOK MY CAR'S INFORMATION. THEY SAID THAT MY CAR WAS 'ELIGIBLE' FOR THE REPAIRS TO BE DONE. HOWEVER, TOYOTA CALLED THE NEXT DAY AND SAID MY CAR DID NOT QUALIFY BECAUSE IT WAS A 'TOTAL LOSS' VEHICLE. I WAS SHOCKED TO HEAR THIS AS I PURCHASED IT WITH A BLUE TITLE. UPON FURTHER INVESTIGATION, I FOUND THE VEHICLE HAD HAIL DAMAGE AND THE INSURANCE COMPANY OPTED TO ISSUE A TOTAL LOSS CLAIM BUT DID NOT FEEL OBLIGATED TO BADGE THE TITLE AS SALVAGE. I FILED COMPLAINT WITH TEXAS BOARD OF INSURANCE BUT THEY HAVE BEEN NO HELP. MY QUESTION TO NHTSA IS HOW CAN TOYOTA REFUSE TO PERFORM WORK ON A VEHICLE THAT HAS A BLUE TITLE? IT HAS NEVER BEEN DEEMED OR BADGED AS SALVAGE AND YET I AM LEFT TO CONTINUE DRIVING A POSSIBLY UNSAFE VEHICLE THAT I PAID FULL MARKET PRICE FOR.",
        "vin": "2T3ZFREV3EW"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11366198,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS WERE NOT DEPLOYED AFTER A CRASH THAT LEFT THE CAR CONSIDERED A 'TOTAL LOSS'. THE CAR HIT A POLE AND THE AIRBAGS DID NOT DEPLOY AT ALL. CAUSING DRIVER TO INJURE FINGER AND MISS TIME FROM WORK.",
        "vin": "2T3BFREV8EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363684,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD MULTIPLE ISSUES WITH THIS CAR. THE LOCK ACTUATORS ON ALL THE DOORS AND REAR HATCH CONSTANTLY BREAK, THE RADIO COMPLETELY STOPPED WORKING AND A NEW AFTER MARKET RADIO HAD TO BE INSTALLED SINCE TOYOTA WON'T RECALL THE RADIOS, THE AC BLOWER MOTOR KEEPS SHORTING OUT, AND THE USB PORTS SHORT OUT AND STOP WORKING.",
        "vin": "2T3YFREV4EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362799,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO SCREEN ONLY DISPLAYS THE TOYOTA SIGN. IT WILL CHANGE STATIONS WITH THE PRE SET ON THE STEERING WHEEL BUT YOU CAN NOT DO ANYTHING ELSE CUZ THE SCREEN DOES NOT DISPLAY ANYTHING OTHER THAN THE TOYOTA SIGN.",
        "vin": "2T3YFREVXEW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348761,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RUSTING INSIDE VEHICLE AND BOLTS FOR HATCH BACK IS RUSTING OUT",
        "vin": "2T3WFREV4EW"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. THE CONTACT STATED WHILE THE VEHICLE WAS STATIONARY, THE FRONT PASSENGER'S SIDE SEAT BELT FAILED TO RETRACT. THE CONTACT STATED THAT THE SEAT BELT WARNING INDICATOR WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO LOCAL DEALER COAD TOYOTA LOCATED AT 357 SIEMERS DR, CAPE GIRARDEAU, MO 63701, (573) 335-2927, WHERE IT WAS DIAGNOSED WITH NEEDING SEAT BELT ASSEMBLY TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339686,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAGE LIGHT IS ON EMPTY BUT THE CAR HAS A FULL TANK",
        "vin": "2T3DFREV9EW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11337736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SISTER ACCIDENTALLY RAN INTO THE BACK OF A BOX TRUCK ON 7/2/2020 AND THE KNEE AIRBAG IN HER TOYOTA 2014 RAV4  DEPLOYED. THE AIRBAG OR COVER CAUSED MAJOR GASHES IN HER LEG AND SHE IS NOW IN THE HOSPITAL AND WILL NEED TO HAVE SKIN GRAFTS. THERE IS A POLICE REPORT THAT IS NOT YET READY. I AM ATTACHING PICTURES OF THE LEG. I HAVE NEVER SEEN DAMAGE LIKE THIS CAUSED BY AIRBAG AND WONDERING IF THERE IS SOME TYPE OF ISSUES WITH KNEE AIRBAGS?",
        "vin": "JTMRFREVXED"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331641,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS RAV4 IN FEBRUARY 2017, AFTER DRIVING FEW I REALIZED MY CAR IS BURNING TOO MUCH OIL. I HAD PURCHASED EXTENDED WARRANTY BUT BY THE TIME I WENT FOR MY ISSUE MY WARRANTY HAD EXPIRED. I CALLED TOYOTA COMPANY AND EXPLAINED MY OIL BURNING ISSUE, THEY GAVE ME A CASE NUMBER AND TOLD ME THEY WOULD CALL ME LATER. I RECEIVED A CALL FEW DAYS LATER AND THEY OFFERED ME $1000.00 TOWARDS PAYMENT FOR REPAIRS, WHICH WASN'T ENOUGH. BECAUSE TOYOTA DEALERS TOLD ME THEY WOULD HAVE TO REPAIR THE WHOLE ENGINE IN ORDER TO STOP OIL BURNING PROBLEM, WHICH WOULD COST ALMOST $5000.00. SO I DIDN'T ACCEPT $1000.00 OFFER FROM TOYOTA MOTORS, EVER SINCE I AM PUTTING ONE QUARTER OIL EVERY 500 MILES. SO I DON'T KNOW WHAT TO DO WITH THIS ISSUE. PLEASE HELP ME OUT. THANKS",
        "vin": "JTMRFREV6ED"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327437,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RAV4 2014 XLE RADIO/BLUE TOOTH STOPPED WORKING ABOUT 3 YRS AGO.  I CALLED TOYOTA, BUT THEY REFUSE TO FIX. THE RADIO SCREEN IS BLUE , AND KEEP REBOOTING.  IT WAS ONLY 3 YRS OLD AND WE ARE TAKING CARE OF THE CAR VERY GOOD. IT COST 1500 TO REPLACE A NEW ONE, BUT I THINK IT'S NOT CUSTOMER FAULT, AND I'M STILL DRIVING WITHOUT THE RADIO.  I FEEL THAT IT'S NOT CUSTOMER FAULT AND TOYOTA MAY GET THE DEFECT RADIO TO INSTALL IN THE CAR.  I DID RESEARCH AND SEE LOTS OF CUSTOMER HAS SAME ISSUE.  I SEE THERE IS FEW RECALLS FOR RAV4 2014, BUT I NEVER GET A LETTER FROM TOYOTA TO GET THE CAR FIXED.  *TR",
        "vin": "2T3RFREV4EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320480,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO WILL COMPLETELY STOP WORKING TO WHERE YOU HAVE TO BUY A NEW $1200 RADIO FROM THE DEALER. ALL DOOR LOCK ACTUATORS WILL STOP WORKING AFTER A PERIOD OF TIME CAUSING YOU TO NOT BEING ABLE TO UNLOCK OR OPEN YOUR DOORS.",
        "vin": "2T3YFREV4EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316695,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2014 TOYOTA RAV 4.  OVER THE PAST YEAR--THE ELECTRIC LOCKS ON ALL FOUR DOORS STOPPED WORKING--TOOK TO LOCAL MECHANIC AND TOYOTA DEALERSHIP WHO SAID IT WAS THE ACTUATORS IN THE DOORS AND WOULD COST OVER $2000 TO FIX THEM.  I WOULDN'T HAVE A PROBLEM, BUT THIS CAR IS ONLY 6 YEARS OLD AND HAS 60,000 MILES ON IT. I FIND IT VERY HARD TO BELIEVE THAT ALL FOUR WOULD BE KNOCKED OUT AT ONCE, AND SUSPECT THAT IT IS A . IT IS A SAFETY CONCERN. I SUSPECT THAT THEY USED INFERIOR/FAULTY PARTS.",
        "vin": "JTMBFREV8EJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309607,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO CONTROL UNIT WENT INTO A REBOOT CYCLE AND NEVER COMPLETES.  THE ENTIRE UNIT IS UNABLE TO BE USED FOR ANY OF IT'S FUNCTIONS.  RADIO, BLUETOOTH, GPS, ETC.  THERE ARE A LOT OF TOYOTA OWNERS REPORTING THIS PROBLEM ESPECIALLY WITH THE 2014 RAV4.  THERE ARE MANY EXAMPLE AND VIDEOS ON YOUTUBE.",
        "vin": "2T3RFREV3EW"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11301354,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HER HUSBAND WHO OWNS A 2014 TOYOTA RAV4. THE CONTACT STATED WHILE HER HUSBAND WAS AT A STOP LIGHT, A VEHICLE APPROACHING BEHIND REAR ENDED THE VEHICLE. DUE TO THE IMPACT, THE VEHICLE JOLTED FORWARD AND CRASHED INTO THE VEHICLE IN FRONT AND ANOTHER VEHICLE WHICH WAS TO THE LEFT. THE FRONT DRIVER SEAT COLLAPSED AND WAS DEFORMED DURING THE IMPACT. IN ADDITION, THE HEAD REST COMPLETELY DETACHED FROM THE FRONT DRIVERS SEAT. THE CONTACT WAS ASKED ABOUT THE AIR BAG DEPLOYMENT AND CONFIRMED THAT NO AIR BAGS DEPLOYED DURING THE IMPACT. THE DRIVER SUSTAINED CHEST INJURIES AND WAS TAKEN TO THE HOSPITAL FOR MEDICAL ATTENTION. A PASSENGER SITTING IN AN UNKNOWN LOCATION OF THE VEHICLE WAS ALSO INJURED AND SOUGHT MEDICAL ATTENTION.  THE VEHICLE WAS TOWED TO A IMPOUND LOT AND THEN TOWED BY THE INSURANCE COMPANY WHERE AN ADJUSTER WAS TO INSPECT THE VEHICLE. A POLICE REPORT WAS FILED. A LOCAL DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 17,000.",
        "vin": "2T3DFREV1EW"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED, JUST TURNED THE CAR FROM ENGINE ON TO OFF WITH JUST THE BATTERY ON RUNNING THE RADIO WHILE I WAS PREPARING TO EXIT THE VEHICLE. SUDDENLY THE ENTIRE RADIO SYSTEM COMPLETELY STOPPED WORKING. I LOOKED AT MY INFOTAINMENT SCREEN AND IT WAS CERTAINLY HAVING A ISSUE BECAUSE EVER SINCE THAT DAY OVER ONE YEAR AGO I HAVE NOT BEEN ABLE TO LISTEN TO RADIO, USE GPS, USE BLUETOOTH, ETC.    I BELIEVE THIS TO BE UNDER A SAFETY ISSUE DUE TO 1) LOSS OF PHONE/BLUETOOTH (USE OF MOBILE PHONES WHILE OPERATING THE VEHICLE IS REQUIRED IN MANY STATES TO GO THROUGH BLUETOOTH) AND I CANNOT COMPLY WITH THESE LAWS IF MY SYSTEM HAS MALFUNCTIONED, 2) I PAID FOR A VEHICLE WITH A GPS NAVIGATION FOR A REASON AND NOW I LOST THAT EXPENSIVE CAPABILITY AS WELL, 3) RADIO'S ARE USED TO KEEP THE DRIVER ALERT AND FOCUSED AND THIS WAS LOST 4) THE LOOPING SCREEN IS EXTREMELY BRIGHT, CANNOT BE DARKENED AND IMPOSSIBLE TO DRIVE AT NIGHT WITH IT. I HAVE HAD TO COMPLETELY COVER OVER MY SCREEN SO NOW IT'S LIKE I'M DRIVING A FLINTSTONES VEHICLE WITH NOTHING TECHNOLOGY WISE IN THIS $25,000 VEHICLE I PAID FOR.    \"TOYOTA CUSTOMER CARE CONTACT US - I CONTACTED TOYOTA VIA PHONE CALL EARLIER TODAY WITH LIMITED RESULTS, BUT LATER EMAILED TOYOTA AND PROVIDED A LINK TO THIS PAGE. THE CUSTOMER CARE REPRESENTATIVE SUGGESTED THAT ANYONE HAVING PROBLEMS WITH THEIR RADIO/NAVIGATION SYSTEM SHOULD CALL AND EMAIL THEIR COMPLAINTS. TOYOTA IS NOT CURRENTLY OFFERING ANY REMEDY OR ASSISTANCE TO PREMATURELY FAILING RADIO SYSTEMS THAT ARE OUT OF WARRANTY, BUT ALL CALLS AND EMAILS ARE MONITORED AND WHEN THERE ARE MULTIPLE COMPLAINTS, TOYOTA WILL RECOGNIZE A PROBLEM AND MAY OFFER ASSISTANCE OR REIMBURSEMENT.\"    HTTPS://WWW.CARCOMPLAINTS.COM/TOYOTA/RAV4/2014/ACCESSORIES-INTERIOR/",
        "vin": "2T3RFREV8EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "11/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287661,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHILE OPERATING THE VEHICLE, THE NAVIGATION/INFORMATION SYSTEM SUDDENLY MALFUNCTIONED. THE SCREEN TURNED A BLUE COLOR AND THE SYSTEM BECAME INOPERABLE.  SCREEN KEEPS ATTEMPTING TO RELOAD BUT IT FAILS.  RADIO OR NAVIGATION INOPERABLE BUT THE REAR VIEW CAMERA DOES WORK.  OCCURRED AT 60,000 MILES.",
        "vin": "2T3RFREV6EW"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11281992,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INCIDENT OCCURRED ON 11/13/2019 @ 8:30AM. I HAD STARTED MY 2014 TOYOTA RAV4, PULLED OUT FROM UNDER THE CARPORT APPRX. 25FT AND PUT THE VEHICLE IN PARK AND FULLY ENGAGED THE PARKING BRAKE I ALWAYS DO THIS IF I NEED TO LEAVE THE VEHICLE RUNNING FOR ANY REASON. IN THIS CASE I WAS HEATING THE INTERIOR AS IT WAS CHILLI. I WENT BACK INSIDE MY HOME TO GET THE ANIMAL CRATE THAT CONTAINED MY CAT WHO NEEDED TO GO TO THE VET.  AS I WAS LOADING THE CRATE INTO THE FRONT SEAT THE VEHICLE BEGAN MOVING IN REVERSE.  I WAS BETWEEN THE OPEN DOOR AND THE VEHICLE ITSELF AND AFTER FREAKING OUT A SECOND LOOKED TO SEE IF THE PARKING BRAKE HAD DISENGAGED. IT HAD NOT.AT THAT POINT I WAS ALONG FOR THE RIDE AND THE CAR DRUG ME TOWARD THE LAUNDRY ROOM AND I WENT UNDERNEATH THE OPEN DOOR HOLDING ONTO THE ARMREST. WHEN I HAD TO RELEASE MY TRIP I WAS LAID OUT ON MY BACK WITH MY ARMS AND HANDS RAISED.  THE RIGHT FRONT TIRE CAME INTO CONTACT WITH FIRST MY LEFT ELBOW THEN WRIST THEN HAND WRENCHING MY LEFT SHOULDER AS IT DID SO.  THIS ACCIDENT SHOULD NEVER HAVE OCCURRED. THE SAFETY MEASURES FAILED.  I BOUGHT THE CAR IN OCTOBER 2017 AND HAD NO TROUBLE DOING THE EXACT SAME THING AS DESCRIBED MANY MANY TIMES.  TOYOTA HAS BEEN NOTIFIED AND NOW NEEDS TO GO TO ANY LENGTHS NECESSARY TO MAKE SURE THIS DOES NOT HAPPEN TO ANYONE ELSE.",
        "vin": "2T3WFREV6EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281128,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION AND ENTERTAINMENT PANEL WENT OUT WHILE VEHICLE WAS IN USE. SON WAS DRIVING IN AN UNFAMILIAR AREA AND WAS USING NAVIGATION SYSTEM TO GET HOME WHEN SYSTEM WENT OUT.",
        "vin": "2T3WFREV2EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271680,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RANDOMLY STOPPED ACCELERATING WHILE ON THE FREEWAY. THE CHECK EV SYSTEM LIGHT CAME ON WITH A TURTLE IN A CIRCLE AS WELL. THANKFULLY WE WERE ABLE TO PUSH TO SIDE OF ROAD.",
        "vin": "2T3YL4DVXEW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268220,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO IN MY 2014 RAV4 WON'T TURN ON OR OFF. THE SCREEN LOOKS LIKE IT IS TRYING TO REBOOT BUT GETS TO A CERTAIN POINT THEN STOPS AND STARTS AGAIN. IT CREATES SAFETY ISSUES AS IT DIVERT DRIVER EYES WHAT HAPPEN AND HAVE TO USE CELL PHONE WHILE DRIVING TO CHECK ROAD CONDITIONS. IT PREVENTS DRIVERS FROM UP TO DATE TRAFFIC CONDITIONS AND CAR CONDITION. EVERYTHING USED TO DISPLAY IN RADIO SCREEN.",
        "vin": "JTMWFREV1ED"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267775,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUDDERS AT BETWEEN 20-40 MPH WHEN SHIFTING BETWEEN GEARS, UP AND DOWN, LOSES POWER BRIEFLY, BELIEVE IT IS A TORQUE CONVERTER ISSUE",
        "vin": "2T3RFREV4EW"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267320,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STOP UPON TURNING RIGHT  TO BLEND WITH TRAFFIC ENGINE LOOSES ALL POWER , RPM DROPS FROM 1500 TO 400 , THEN WILL CATCH IN ABOUT 4 TO 5 SECOND AND ACCELERATE , HAS HAPPENS 12 TIMES IN THE LAST 2 MONTHS  CAR HAS 11000 MILES ON IT",
        "vin": "2T3RFREV0EW"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254248,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION/BLUETOOTH/MEDIA FUNCTION SCREEN NO LONGER WORKS, IT HAPPENED WHEN I STARTED IT ABOUT A MONTH AGO AT 65,750 MILES ON MY CAR. I'VE READ THAT THIS USUALLY HAPPENS AROUND 65,000 MILES TO  70,000 MILES FOR THIS MODEL AND CAN COST UP TO $2,000 TO $3,000 TO GET IT FIXED. IT STARTS OFF AS A BLACK SCREEN THEN LIGHTS UP LIKE ITS DOWNLOADING SOMETHING THEN GOES BLACK AGAIN. ITS A SAFETY ISSUE BECAUSE DRIVING AT NIGHT OR EARLY MORNING WHEN ITS DARK NO MATTER HOW LOW OF A SETTING YOU HAVE FOR YOUR DASH LIGHTING SETTING WHEN IT LIGHTS UP ITS EXTREMEY BRIGHT. AND EVEN THOUGH I KNOW IT WILL HAPPEN IT STILL MAKE ME TAKE MY EYES OF THE ROAD TO LOOK AT IT. AND LIVING IN THE COUNTRY THAT IS A COUPLE OF SECONDS I CAN'T AFFORD, LUCKILY I HAVE YET TO HIT A DEER OR OTHER LIVING THING.",
        "vin": "JTMRFREV3ED"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243800,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 46K MILES, DRIVER DOOR LOCK/ACTUATOR BEGAN TO FAIL WHEN UNLOCKING WITH KEYFOB/HAND SENSOR WHEN VEHICLE WAS STATIONARY. PRESSING THE LOCK/UNLOCK ON KEY FOB/DOOR PANEL WORKED 50% OF THE TIME. AT 50K MILES, ALL DOORS (DRIVER, PASSENGER, DRIVER REAR, AND PASSENGER REAR) NO LONGER UNLOCK/LOCK EXCEPT WHEN DONE MANUALLY THROUGH INSERTION OF KEY IN DRIVER DOOR AND MANUALLY UNLOCKING ALL OTHER DOORS (PASSENGER, PASSENGER REAR, AND DRIVER REAR) FROM EACH INDIVIDUAL DOOR LOCK .",
        "vin": "2T3YFREV7EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219536,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. THE CONTACT STATED THAT THE INSTRUMENT PANEL LIGHTING WAS DIM. THE CONTACT HAD DIFFICULTY VIEWING THE GAUGES. LAST WEEK, THE CONTACT ALMOST CRASHED BECAUSE HE WAS FOCUSING SO HARD ON TRYING TO SEE THE SCREEN. YARK TOYOTA (1377 CONANT ST, MAUMEE, OH 43537, (419) 737-4373) WAS NOTIFIED, BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER STATED THAT THE INSTRUMENT PANEL LIGHTING WAS NORMAL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND AGREED WITH THE DEALER. THE FAILURE MILEAGE WAS 18,000. THE VIN WAS INVALID.",
        "vin": "JTMZFREZ6FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/24/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206100,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO STOPPED WORKING ON 4-24-2019",
        "vin": "2T3ZFREV1EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204112,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. ALL OF THE DOORS ON MY 2014 RAV4 LOCK AND UNLOCK WHEN THEY CHOSE TO. NORMALLY WHEN THE CAR IS IN DRIVE THE DOORS ALL LOCK HOWEVER AS OF JANUARY 2019 THEY HAVE BEEN LOCKING AND UNLOCKING WHEN THEY DECIDED TO WORK. USING THE EXTERNAL KEY BUTTON TO LOCK AND UNLOCK THE DOORS WORKING MAYBE 50% OF THE TIME ON ABOUT 2 TO 3 OF THE DOORS. THE SAME GOES FOR THE INTERNATIONAL LOCK BUTTONS AND WHEN THE CAR IS SHIFTED INTO DRIVE. THIS IS EXTREMELY DANGEROUS FOR ME AND MY CHILDREN WHO I AM NOT TERRIFIED TO HAVE IN MY CAR. SHOULD THE DOORS CHOSE TO NOT LOCK AND THEY ACCIDENTALLY PULL THE DOOR OPEN IT WOULD BE A HORRIFIC ACCIDENT. AND MY YOUNGEST HAS A PANIC ATTACK WHEN I GO TO GET HIM FROM THE CAR BUT CANT BECAUSE THE DOORS NEVER UNLOCKED WHEN WE PARKED. PLEASE FIGURE THIS PROBLEM OUT I LOVE MY RAV BUT IT IS NOT SAFE RIGHT NOW.",
        "vin": "2T3BFREVXEW"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDIO NOT WORKING REPEAT RELOADING . SOME HOW BACKUP CAMERA IS WORKING",
        "vin": "2T3DFREV5EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THE APPS ON THE DASH BOARD, INCLUDING RADIO ARE GONE{WHITED OUT}.  I AM AFRAID IF EVERYTHING IS SHUTING DOWN ALL AT ONCE WHILE I DRIVE AS IT DID ON THIS ONE",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183882,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR TAIL LIGHT - WATER IS ACCUMULATING INSIDE THE TAIL LIGHT LENSE - POTENTIAL FOR ELECTRICAL SHORTAGE AND INABILITY TO WARN VEHICLES BEHIND RAV4 THAT CAR IS TURNING OR BRAKING",
        "vin": "2T3RFREV8EW"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162919,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHILE THE CONTACT WAS ATTEMPTING TO PULL INTO A PARKING SPOT, THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO A PARKED VEHICLE. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS DRIVEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE BODY REPAIR WOULD COST APPROXIMATELY $4,700. THE MECHANIC SUGGESTED THAT THE ACCELERATION MAY HAVE BEEN CAUSED BY THE TRANSMISSION. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 32,000.     THE CONSUMER STATED THAT THE FRONT AIRBAG DID NOT DEPLOY.  *JS",
        "vin": "2T3DFREVXEW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162462,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO/INFOTAINMENT SYSTEM ON THESE VEHICLES ARE FAILING (OURS FAILED LAST WEEK), WITH NUMEROUS EXAMPLES POSTED BY OWNERS ONLINE. A DEALERSHIP EVENTUALLY DETERMINED THAT THE ENTIRE RADIO UNIT NEEDED REPLACEMENT AT QUOTED COST OF $1160 TOYOTA CUSTOMER SUPPORT IS COURTEOUS BUT UNWILLING TO ASSIST WITH REPAIRS.     THE RADIO SYSTEM APPEARS TO ENTER A BOOT LOOP WHERE A LOADING TYPE SCREEN APPEARS FOR SEVERAL SECONDS FOLLOWED BY THE SCREEN TURNING OFF FOR A TIME BEFORE RESTARTING THE LOOP. WHILE I WOULDN'T CONSIDER THE RADIO/INFOTAINMENT TO BE A CRITICAL SAFETY COMPONENT, THIS CONSTANT ON/OFF OF THE RADIO SCREEN IS A DISTRACTION FOR THE DRIVER. AT NIGHT ESPECIALLY, THE CHANGE IN BRIGHTNESS FROM SCREEN OFF TO SCREEN ON LIGHTS UP THE ENTIRE CABIN. FURTHERMORE, THE BOOT LOOP CANNOT BE STOPPED- NO BUTTONS WORK AND THE SEQUENCE REPEATS ITSELF FOREVER AS LONG AS THE KEY IS ON.",
        "vin": "2T3RFREV2EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155457,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I HAD MY CAR IN PARK MY STEREO STOPPED WORKING. NO RADIO, NO SATELLITE, NO NOTHING OTHER THAN BACK UP CAMERA.  WHEN I START THE CAR I GET A BLUE PICTURE OF THE STEREO AND A STATUS BAR LOADING LIKE ON COMPUTERS WHEN A PROGRAM IS LOADING.      I TOOK THE CAR TO THE TOYOTA DEALER AND HE EXPLAINED THAT THE REPLACEMENT WOULD COST 2,500 DOLLARS TO REPLACE AND HE EXPLAINED THERE WAS NO MEANS TO FIX IT. I WENT TO ANOTHER MECHANIC AND HE TOLD ME THE SAME THING.    I HAVE HAD THE CAR FOR ONLY 1 YEAR AND 6 MONTHS WITH 45000 MILES AND IT JUST SUDDENLY STOPPED WORKING. I BELIEVE THERE IS A DEFECT IN THESE RADIOS THAT CAUSE THIS ENDLESS LOOP TO OCCUR. MANY OTHERS HAVE EXPERIENCED SIMILAR PROBLEMS WITH THE SAME MODEL OF CAR AS WELL.",
        "vin": "2T3RFREV1EW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/30/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154831,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES HAVE MADE A HARD SCRATCHING SOUND IF VEHICLE HAS NOT BEEN DRIVEN DAILY SINCE ITS PURCHASE. AT 30000 MILE SERVICE, MECHANIC HAS NOTED THAT REAR ROTORS ARE NOT MAKING FULL CONTACT.",
        "vin": "JTMBFREVXED"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150774,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE IS STOPPED AND PARKED THE SMART KEY SYSTEM INDICATOR LIGHT FLASHES IN YELLOW FOR 15+ SECONDS WHEN BOTH ELECTRONIC KEYS ARE IN THE VEHICLE.  VEHICLE WILL NOT START.  SYSTEM WORKS NORMAL WITH ONLY ONE (EITHER) ELECTRONIC KEY.  BOTH KEYS HAVE NEW DURACELL 3.0V CR2032 LITHIUM BATTERY INSTALLED AND ISSUE PERSISTS.   USER CHECKED FOR PRESSED BUTTON(S) ON ELECTRONIC KEY.  KEY IS NOT ENCLOSED IN CASE, PURSE, OR HOLDER.  NO IR OR RF INTERFERENCE.     ISSUE HAS ALSO BEEN OBSERVED WHILE VEHICLE IS RUNNING WITH TRANSMISSION IN (P)ARK AND SECOND ELECTRONIC KEY IS INTRODUCED INTO VEHICLE (PICK UP PASSENGER WITH SECOND KEY) AND THE SMART KEY SYSTEM INDICATOR LIGHT FLASHES IN YELLOW FOR 15+ SECONDS.  THE ISSUE HAPPENS ON RESIDENTIAL PROPERTY, COMMERCIAL PROPERTY, AND AT ANY ELEVATION (PARKING GARAGE ABOVE OR UNDER GROUND) OR INSIDE A GARAGE.  THIS ISSUE BEGAN AFTER 50,000 MILES (4 YEARS OF SERVICE).   VEHICLE WAS PURCHASED NEW AND ONLY ONE OWNER.",
        "vin": "2T3YFREV5EW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132378,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TOP OF WINDSHIELD IS COMPLETELY BLACK WHEN DRIVING IN THE DARK AT NIGHT. VISIBILITY IS SPECIFICALLY IMPAIRED WHEN TRAVELING DOWN A HILL IN THE DARK.",
        "vin": "JTMRFREV8ED"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "01/19/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130650,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO NAVIGATION QUIT WORKING AFTER BATTERY REPLACEMENT. IT IS CONSTANTLY REBOOTING. DEALER SAYS NEED NEW RADIO WHICH WILL COST ABOUT $1200.00. CANNOT USE BLUETOOTH, HANDS-FREE, CD PLAYER, OR RADIO. TOYOTA WILL NOT REPLACE EVEN THOUGH MANY OTHERS HAVE SAME ISSUE BECAUSE IT IS NOT A SAFETY ISSUE.",
        "vin": "2T3YFREV4EW"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124602,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE EXPERIENCED THE CLASSICALLY DESCRIBED SUNROOF EXPLOSION (A.K.A. SPONTANEOUS SUNROOF BREAKAGE) THAT SOUNDED LIKE A LARGE OBJECT CRASHED INTO OUR 2014 TOYOTA RAV4, OR AN OR AN EXPLOSION OCCURRED RIGHT OVER OUR HEADS. MY GIRLFRIEND IMMEDIATELY ASKED 'WAS IT A BLOW OUT', AND I RESPONDED NO BECAUSE THANKFULLY, I HAD 100% CONTROL OF THE VEHICLE AND DID NOT SWERVE OR BRAKE OR FEEL ANY MECHANICAL ISSUES BUT, APPARENTLY LET OFF THE GAS AND WAS SLOWING DOWN. THEN, THE DRIVER OF A PICK-UP TRUCK OVERPASSING US ON THE RIGHT GAVE US DIRTY LOOKS AND WAVED TO US LIKE WE NEEDED TO PULL OVER. WE EXITED ON THE NEXT EXIT (S. ACADIANA THROUGHWAY). THE SUNROOF VISOR WAS THANKFULLY CLOSED, AND UPON OPENING IT UP WE NOTICED THE CONVEX CRATER-LIKE SHATTERED SUNROOF, AND IMMEDIATELY SHUT IT WHEREUPON WE TOO NOTICED THE EXCESSIVE NOISE DUE TO WIND CONTACTING THE OPENING. THE SUNROOF EXPLODED OUTWARD, WITH A CONVEX, VOLCANO-LIKE CRATER, AND THOUSANDS OF STRESS CRACKS WITH HUNDREDS OF LITTLE GLASS SHARDS EVERYWHERE AROUND THE OPENING. THIS OCCURRED IN THE CENTER, WITH ABOUT  OF THE TOTAL SUNROOF SURFACE AREA MISSING (EJECTED).  THIS OCCURRED ON SATURDAY, SEPTEMBER 1, 2018 TRAVELLING ROUGHLY 65MPH ALONG I-10 IN BATON ROUGE, LEFT-HAND LANE, WESTBOUND NEAR THE MERGER OF I-12, DURING LIGHT RAIN, NO VEHICLES IMMEDIATELY IN FRONT OF ME, SMOOTH SURFACES, NO CONSTRUCTION IN VICINITY, WITH NO OVERHEAD LAMPS OR OVERPASSES. WIDE OPEN DIVIDED HIGHWAY. TEMPERATURE WAS 76F, PER CAR.",
        "vin": "2T3YFREV1EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119517,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO NAVIGATION QUIT WORKING AT 52000 MILES.ITS CONSTANTLY REBOOTING. DEALER SAYS NEED NEW RADIO WHICH WILL COST ABOUT $1200.00",
        "vin": "2T3WFREV4EW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119277,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTRUCTION ON 59/20 BROKEN WINDSHIELD",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114603,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK THIS MORNING IN MY RAV 4, I HEARD AN INCREDIBLY LOUD BOOM THAT STARTLED ME. IT SOUNDED AS THOUGH SOMEONE HAD FIRED A GUN JUST OUTSIDE MY CAR. I THEN FELT SOME GLASS SHOWERING DOWN ON ME. I QUICKLY LOOKED AROUND TO SEE IF SOMEONE HAD THROWN A ROCK THROUGH A WINDOW OR SHOT AT MY CAR, BUT ALL WINDOWS WERE INTACT. I THEN LOOKED UP AND SAW THAT MY SUNROOF WAS SHATTERED AND MOST OF THE GLASS WAS GONE. LOOKING IN FRONT OF MY CAR, THERE WEREN'T ANY TRUCKS FROM WHICH ROCKS MIGHT'VE FALLEN. AND LOOKING BEHIND ME, I HADN'T DRIVEN UNDER ANY BRIDGES FROM WHICH SOMETHING MIGHT'VE FALLEN OR BEEN THROWN.    I PULLED OFF AT THE NEXT EXIT TO SEE WHAT MIGHT'VE CAUSED THE SUNROOF TO SHATTER. THERE WAS NOTHING TO BE FOUND IN MY CAR TO EXPLAIN IT (NO ROCKS OR OTHER OBJECTS THAT MIGHT'VE FALLEN INTO THE CAR). I THEN NOTICED SOMETHING STRANGE - THE GLASS THAT REMAINED ON THE SUNROOF WAS BENDING UPWARD (AWAY FROM THE CAR) AS THOUGH SOMETHING INSIDE THE CAR CAUSED THE GLASS TO SHATTER. HERE'S A VIDEO I RECORDED SHOWING THE REMAINING GLASS:    HTTPS://YOUTU.BE/NZE6NT829TM    IT WAS A SCARY EXPERIENCE. I'M GLAD I WASN'T HURT, AND I THANK G-D THAT MY KIDS WEREN'T IN THE BACK SEAT WHEN THIS HAPPENED.",
        "vin": "JTMRFREV8EJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2018",
        "dateOfIncident": "07/28/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114328,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING WESTBOUND ON INTERSTATE 295 IN JACKSONVILLE FLORIDA, WE HAD JUST GOT ON TO THE BUCKMAN BRIDGE WHEN THE CAR SLOWED, UNCOMMANDED  TO 20MPH. I LOOKED AT THE INSTRUMENT CLUSTER AND THE ALTERNATOR AND THE AUTO LSD OR TRACK LIGHTS WERE ILLUMINATED. THE ENGINE OPERATING TEMPERATURE WAS NORMAL. SINCE THE ENGINE TEMPERATURE WAS NORMAL I TOLD MY DAUGHTER TO KEEP DRIVING TO GET OFF THE BRIDGE, I FELT AS THOUGH THE BRIDGE WAS A BAD PLACE TO PULL OVER. AFTER ABOUT A MINUTE WE STARTED TO SMELL SOMETHING BURNING AND AT THIS POINT WE DECIDED TO PULL OVER. WHEN WE CAME TO A COMPLETE STOP WE SAW SMOKE COMING FROM THE DRIVERS SIDE OF THE ENGINE COMPARTMENT. THREE OF US THEN EVACUATED THE VEHICLE AND STARTED WALKING AGAINST TRAFFIC ON THE BRIDGE. AS WE WERE WALKING AWAY THE SMOKE INTENSIFIED AND THEN ERUPTED INTO FLAMES THAT EMANATED FROM  THE DRIVERS SIDE JUST BELOW THE WINDSHIELD. I CALLED 911 AND THE FIRE DEPARTMENT CAME AND EXTINGUISHED THE FIRE. I HAVE ATTACHED PICTURES OF THE DAMAGE. I BELIEVE IT WAS AN ELECTRICAL FIRE.",
        "vin": "2T3WFREV5EW"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113647,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 10 MPH APPROACHING A RED LIGHT, THE CONTACT ATTEMPTED TO STOP THE VEHICLE, BUT THE BRAKE PEDAL TRAVELED ALL THE WAY TO THE FLOORBOARD. THE BRAKE PADS AND ROTORS WERE CHECKED BY THE CONTACT AND FOUND TO BE IN GOOD WORKING CONDITION. THE VEHICLE WAS TAKEN TO THE DEALER (HIXSON TOYOTA, 11981 LAKE CHARLES, LEESVILLE, LA 71446) WHERE IT WAS DIAGNOSED THAT THE MASTER CYLINDER FAILED AND NEEDED REPLACEMENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "JTMRFREV2EJ"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103034,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHILE OPERATING THE VEHICLE, THE NAVIGATION/INFORMATION SYSTEM SUDDENLY MALFUNCTIONED. THE SCREEN TURNED A BLUE COLOR AND THE SYSTEM BECAME INOPERABLE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (PREMIER TOYOTA, 47190 COOPER FOSTER PARK RD, AMHERST, OH) WHERE IT WAS DIAGNOSED THAT THE ENTIRE INFORMATION/NAVIGATION SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS ALSO NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 63,194. *TT",
        "vin": "2T3YFREV9EW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "2013-2015 TOYOTA RAV4 TRANSMISSION SHUDDER WARRANTY EXTENSION ZE5. MY CAR IS CURRENTLY BEING REPAIRED UNDER THIS WARRANTY EXTENSIONAT 0 COST TOME.    THIS SHOULD BE A L. IT RECALIS A KNOW DEFECT BUT THEY WAIT FOR SOMEONE TO COMPLAIN BEFORE THEY DO THE FIX. I SEARCHED THE INTERNET TO FIND IT BEFORE I TOOK THE CAR IN SO THE ENTIRE PROCESS IS FREE INCLUDING A LOANER CAR.      THE SPECIFIC COMPONENT(S) COVERED BY THIS WARRANTY ENHANCEMENT IS/ARE AS FOLLOWS:  *TORQUE CONVERTER KIT (INCLUDES TORQUE CONVERTER, GASKETS, ADDITIONAL TRANSMISSION PAN MAGNETS)  *UPDATED ENGINE CONTROL SOFTWARE",
        "vin": "JTMZFREVXED"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "05/23/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101950,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ALWAYS MADE HARSH SOUNDS AT LOW SPEEDS. AND THE BREAKS WORE OUT BY 30000. THE DEALERSHIP ALSO ADVISED ME THAT MY ROTORS HAD TO BE REPLACED.",
        "vin": "2T3DFREV5EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096988,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR  RADIO WENT ON A LOADING SCREEN LOOP, AND NOW IS STUCK ON A LOADING SCREEN  . I WENT TO DEALER TO FIX IT OR UPLOAD NEW SOFTWARE BUT THEY SAD THAT RADIO WOULD NOT TAKE. I CAN'T USE  CELL HEANDS FREE",
        "vin": "2T3DFREV5EW"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093365,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HATCH WILL NOT CLOSE FULLY UNLESS I PUSH ON IT.  IT'S A SELF CLOSING DOOR.  NOW IT STOPS 3/4 OF THE WAY DOWN AND STAYS OPEN.  THE VEHICLE IS BEING LOADED AND THEN CLOSED.  IT IS STATIONARY..  I'VE HAD IT IN THE DEALERSHIP 3 TIMES. I'VE QUERIED ON-LINE AND OTHERS HAVE HAD THIS PROBLEM",
        "vin": "2T3DFREV3EW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088608,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LA TRANSMISSION TARDA EN APLICAR EL DRIVE",
        "vin": "2T3ZFREV9EW"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 50 MPH, AN ABNORMAL NOISE WAS HEARD. THE CONTACT NOTICED THAT THE SUN ROOF FRACTURED AND EXPLODED. GLASS PIECES SHATTERED BETWEEN THE HEAD LINER AND THE METAL ROOFING. THE SOFT COVER WAS CLOSED AND PREVENTED GLASS FROM ENTERING THE INNER PART OF THE VEHICLE AND INJURING THE CONTACT. THE DEALER (TOYOTA OF BOERNE, 31205 FRONTAGE RD, BOERNE, TX 78006, (888) 311-6058) REPLACED THE PART AND CLEANED THE INTERIOR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "2T3YFREV2EW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2018",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075521,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXCESSIVE OIL CONSUMPTION.  1 QUART PER 500 MILES CONSUMED WHILE DRIVING ANYWHERE, IN TOWN AND HIGHWAY DRIVING.",
        "vin": "JTMBD31V475"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTOMATIC DOOR LOCK FAILED. LOCK ACTUATOR REPLACED UNDER WARRANTY ON JANUARY 24, 2017. IT IS NOW FEBRUARY 2018 AND THE DOOR LOCKS HAVE FAILED AGAIN. I CANNOT LOCK MY CAR AS I CANNOT EVEN MANUALLY UNLOCK THE FRONT DOOR AS THE LOCK WILL NOT ALWAYS RESPOND TO THE TURN OF THE KEY.   MY VEHICLE IS GARAGE KEPT.",
        "vin": "JTMRFREV7ED"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/30/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066101,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY WHEN THE CAR SHUT OFF COMPLETELY AND TURNED ON AND OFF REPEATEDLY, AND INSTANTANEOUS FOR A FEW SECONDS (LIKE IT WAS BLINKING) SUPER FAST. EVERYTHING WAS GOING ON AND OFF. AS I WAS PULLING ONTO THE SHOULDER FROM THE MIDDLE LANE ON THE HIGHWAY, IT SHUT OFF COMPLETELY!!! I COULDN'T EVEN PUT MY HAZARDS ON. I WAS WAITING IN THE CAR FOR A TOW TRUCK AND MY HUSBAND, I WAS WITH MY DAUGHTER. THE CAR STARTED TO SMOKE AND FLAME AND WAS ON FIRE. WE JUMPED OUT AND YET WAS UP IN FLAMES!!!!!!!",
        "vin": "2T3YFREV6EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065324,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE FIRST STARTED WHEN BATTERY HAD TO BE JUMPED.  THEN A FEW DAYS LATER WHEN IN MOTION DRIVING TO THE BANK, THE RADIO STARTED ACTING UP AND GOT STUCK ON STATION AND SONG AND THEN JUST WENT BLACK THEN A PICTURE OF THE RADIO APPEARED THE ON THE SCREEN AND WAS ATTEMPTING TO UPDATE BUT WOULD GO BLACK AGAIN AND THEN START OVER SO WAS STUCK IN SOME KIND OF REBOOT.  NOT SURE IF ELECTRICAL PROBLEM OR WHAT SO TOOK IT IN TO DEALERSHIP AND THEY TOLD ME I SHOULD ONLY HAVE TO PAY $50-60 TO REBOOT IT.  THEY CHECKED THE BATTERY AND SAID THE BATTERY WAS LOW CHARGE AND REPLACED IT AT NO CHARGE BUT SAID THEY WERE UNABLE TO REBOOT THE SYSTEM BECAUSE IT WOULD NOT STAY UP LONG ENOUGH BEFORE IT WOULD BLACK OUT AGAIN.  SINCE IT WAS BARELY PAST THE WARRANTY PERIOD TOYOTA WOULD NOT COVER THE SYSTEM AND I WOULD HAVE TO PAY $1000 TO HAVE REFURBISHED SYSTEM INSTALLED.  AFTER RESEARCHING ONLINE I FOUND THIS WAS A COMMON COMPLAINT AND FOUND ONE HERE AT THIS SITE AS WELL SO ADDING MINE.  I SENT LETTERS AND EMAILS TO TOYOTA TO STAND BEHIND THEIR LONG TIME CUSTOMERS AND PRODUCTS BUT THEY WOULD NOT BUDGE.  MULTIMEDIA SYSTEMS SHOULD NOT FAIL AFTER 3 YEARS.  I CALL THAT A DEFECT BUT I GUESS BECAUSE IT IS NOT CONSIDERED A SAFETY ISSUE IT IS NOT IMPORTANT TO TOYOTA. WE ARE A TOYOTA FAMILY AND HAVE BEEN DRIVING TOYOTA'S SINCE MY FIRST CAR BACK IN THE 70'S.  I WILL PROBABLY GO AHEAD AND REPLACE WITH REFURBISHED SYSTEM HOPING THIS IS NOT AN ELECTRICAL ISSUE AND REPEAT BUT I WILL CERTAINLY RECONSIDER BEFORE PURCHASING ANOTHER TOYOTA IN THE FUTURE.",
        "vin": "2T3YFREV7EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058456,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A TOYOTA RAV4 2014 XLE AWD.  THE RADIO SYSTEM WENT OUT SHOWING A PICTURE ON THE SCREEN OF THE RADIO AND WHAT SEEMED TO BE A REBOOTING OF THE SYSTEM CONSTANTLY. THE USB PORT IS ALSO SHORTING OUT. TO NOTE WHAT I WAS DOING, I WAS TURNING THE CAR ON IN MY GARAGE TO LEAVE AND RUN ERRANDS FOR THE DAY.  THIS ALL HAPPENED ON THE SAME DAY.  I ONLY USE THE SYSTEM FOR CD PLAYING, RADIO PLAYING, AND OCCASIONALLY NAVIGATION.  WHEN I CALLED THE DEALERSHIP THE FIRST RESPONSE WAS I WOULD HAVE TO PAY $98 EACH FOR A SYSTEM CHECK ON BOTH PROBLEMS.  ALSO, I GAVE THE VIN NUMBER TO THE TOYOTA SERVICE REP AND HE STATED THERE WAS AN UPDATE AVAILABLE AT NO COST TO ME.  I DROPPED THE CAR OFF AND THE REP CALLED ME AND SAID HE MADE A MISTAKE; THERE WAS NO UPDATE AND THE RADIO IS NOT WORKING AT ALL. THE COST WOULD BE $1200.  HE WANTED TO KNOW HOW MANY MILES I HAD ON THE CAR AND IF BOUGHT IT NEW, WHICH I DID BUY IT NEW AT HIS DEALERSHIP.      I RESEARCHED THIS PROBLEM WITH OTHER RAV4 VEHICLES WITH SAME YEAR.  ALSO, OTHER TOYOTA VEHICLES WITH SAME TYPE RADIO SYSTEM AND THERE IS A PROBLEM WITH ALL OF THEM DOING THE SAME THING MINE IS DOING.  I FEEL A VEHICLE THAT IS ONLY 3 YEARS OLD SHOULD NOT BE HAVING THIS TYPE OF ISSUE AND IT SHOULD BE FIXED WITH AN UPGRADE, NOT THE FACT THE RADIO IS BROKEN AS WELL AS USB PORT NOT WORKING.  I TAKE CARE OF MY CAR.  IT STILL LOOKS NEW!    I HAVE OWNED TOYOTA VEHICLES SINCE I WAS 16 AND I AM NOW 54.  I AM VERY DISAPPOINTED WITH THE FACT THE TYPE OF RADIO MOST OF THE NEWER TOYOTAS HAVE INSTALLED ARE HAVING THIS ISSUE AND TOYOTA IS NOT ADDRESSING IT AS THEY SHOULD.     I KNOW THIS IS NOT A SAFETY ISSUE, BUT I FEEL IT IS AN ISSUE THAT NEEDS TO BE ADDRESSED BY TOYOTA AS I FEEL THERE IS CLEARLY A PROBLEM.",
        "vin": "2T3RFREV5EW"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "12/04/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NAME IS [XXX]. THE TOYOTA SERVICE HISTORY OF MY VEHICLE FROM TOYOTA. IT STATES IN FEBRUARY 2017 BRAKES IS GOOD WITH 8MM ON THE FRONT BRAKE PADS. NEXT SERVICE IS IN JUNE 2017, WITH 5,174 MILES LATER BRAKES ARE AT 3.5MM AND NEEDS TO BE REPLACED. I WAS NOT TOLD THAT THE DRIVER SIDE IS AT 3.5 AND THE PASSENGER SIDE WAS 6.0 MM. THE ISSUES STARTED WHEN THEY WERE REPLACED ON 12/4/2015. [XXX]STATED IT WAS ON MY DRIVING AND NOT THE BRAKES. IT CONTINUES FROM THE FIRST BRAKE SERVICE TILL TODAY. IF YOU WANT ANY MORE OF THE SERVICE HISTORY I DO HAVE IT IF YOU NEED IT.    'INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "09/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RAV4 W/15,500MI... ENGINE PAUSE. IT HAPPENS RANDOMLY WITH NO WARNING. THE ENGINE DEFINITELY SLOWS DOWN AND YOU THINK IT IS GOING TO STOP BUT WHEN YOU HIT THE ACCELERATOR IT RESUMES SPEED. IT IS FRIGHTENING AS THE CAR SLOWS DOWN AND YOU DON'T KNOW IF IT WILL RESUME SPEED. IT PAUSES FOR WHAT SEEMS LIKE 3 OR 4 SECONDS. IT HAS HAPPENED 4 OR 5 TIMES,TRYING TO GET ON A HIGHWAY..AROUND TOWN, YOU NEVER KNOW WHEN THIS WILL HAPPEN.",
        "vin": "JTMRFREV5ED"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "09/20/2017",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034782,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RAV4 2014 CAUGHT A FIRE WHEN WAS DRIVEN. THE STEERING WHEEL WAS SUDDENLY STUCK WHEN WAS DRIVEN ON THE LOCAL ROAD AT SPEED LESS THAN 40 MILES, SO PULLED OVER TO THE SHOULDER ON THE ROAD. SUDDENLY THE SMOKES CAME OUT UNDER THE HOOD, AND TURN TO FLAME. THE CAR BURNED ALL FRONT WINDSHIELD, ENGINE, BATTERY, AND HOOD. FIRE TRUCK COMES UP AND POLICEMAN HELP TO EXTINGUISH THE FIRE. IT WAS NO ACCIDENT, NO HIGH SPEED ON LOCAL ROAD, AND NO RAINNING DAY.",
        "vin": "JTMDFREV7ED"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/23/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025455,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A LEFT HAND TURN, AS I WAS COASTING INTO A PARKING SPOT AT MY PLACE OF EMPLOYMENT, I INEXPLICABLY HEARD MY ENGINE RACE AT AN ALARMING PITCH AND ALMOST SIMULTANEOUSLY MY CAR ACCELERATED AT AN UNPRECEDENTED RATE. I IMMEDIATELY SLAMMED ON THE BRAKES AS HARD AS I COULD AND MY VEHICLE CAME TO A SCREECHING STOP AFTER TRAVELING A FEW FEET.",
        "vin": "JTMBFREV5ED"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004137,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON THE TOP OF THE CAR IS PEELING.",
        "vin": "2T3DF4DV8CW"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "02/18/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001934,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHEN THE CONTACT ATTEMPTED TO LOCK THE VEHICLE DOORS, BOTH THE FRONT DRIVER AND PASSENGER DOOR LOCKS FAILED TO LOCK AND UNLOCK ELECTRONICALLY. THE CONTACT STATED THAT THE DOORS HAD TO BE LOCKED AND UNLOCKED MANUALLY. IN ADDITION, THE REAR PASSENGER DOOR LOCK ALSO FAILED TO UNLOCK WHEN LOCKED. THE VEHICLE WAS TAKEN TO THE DEALER (DICK DYER TOYOTA, LOCATED ON 240 KILLIAN COMMONS PARKWAY COLUMBIA, SC 29203) WHERE IT WAS DIAGNOSED THAT DOOR ACTUATORS ON BOTH SIDES NEEDED TO BE REPLACED. THE DEALER ALSO STATED THAT THE WARRANTY WAS EXPIRED. THE VEHICLE WAS NOT REPAIRED DUE TO THE COST. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,312.",
        "vin": "JTMWFREV5ED"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "03/08/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000089,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHILE DRIVING VARIOUS SPEEDS AND DEPRESSING THE BRAKE PEDAL, THERE WAS A LOUD CLICKING NOISE COMING FROM THE BRAKE PEDAL. IN ADDITION, WHEN THE VEHICLE STRUCK A POTHOLE OR WHEN MAKING A TURN, THE CLICKING NOISE WOULD GET LOUDER. THE FAILURE RECURRED EACH TIME THE VEHICLE WAS DRIVEN. THE VEHICLE WAS TAKEN TO THE DEALER (DALLAS TOYOTA LOCATED ON DELTON DR DALLAS, TX 75229) WHO STATED THAT THE VEHICLE WAS NOT COVERED BY THE WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 36,000.",
        "vin": "2T3ZFREV0EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2017",
        "dateOfIncident": "05/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "DUNLOP GRAND TREK TIRES TREAD SEPERATION",
        "vin": "2T3BFREV2EW"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/07/2017",
        "dateOfIncident": "05/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983910,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "DUNLOP",
                "productModel": "GRAND TREK",
                "productYear": "9999",
                "size": "P265/65R17",
                "type": "Tire"
            }
        ],
        "summary": "DUNLOP GRAND TREK TIRES ARE SEPERATING AT TREAD-DOT U2F5 3M5R3413",
        "vin": "2T3BFREV2EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "HI I AM WRITING ABOUT MY 2014 RAV4 MY MILEAGE IS 62,000. PRIOR TO THIS CAR BEING 3 YEARS OLD AND 55,000 MILES THE RADIO SHORTED OUT INCLUDING THE BLUETOOTH AND NAVIGATION.  I AM SHOCKED TOYOTA HAS NOT DONE A RECALL WHEN IT IS EVIDENT THIS IS A COMMON DEFECT. BROWSING YOU TUBE SHOWS MANY, MANY PEOPLE HAVE THE SAME PROBLEM WITH THEIR TOYOTA RADIO.   AFTER MONTHS OF SILENCE I ENDED UP PAYING $1345.41 TO REPLACE THIS UPON REASEARCH SEEMS TO BE A COMMON KNOWN PROBLEM. MY INVOICE #TOCS231192 WITH DUBLIN TOYOTA IS DATED 3/16/2017. I AM ASKING FOR YOUR REVIEW, CONSIDERATION AND RESPONSE IN THIS MATTER",
        "vin": "JTMRFREV2ED"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/01/2017",
        "dateOfIncident": "06/23/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957766,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING IN HEAVY  STOP & GO TRAFFIC ON THE HIGHWAY.  ALL THREE LANES WERE STOPPED. AND ALTERNATELY INCHING FORWARD DUE TO ACCIDENTS FURTHER DOWN THE ROAD.  I  WAS STOPPED WITH MY FOOT ON THE BRAKE.  MY VEHICLE - THE RAVE 4  SUDDENLYSURGED FORWARD AND HIT THE VEHICLE IN FRONT OF ME.  I STOOD ON THE BRAKES AS HARD AS POSSIBLE  BUT COULD NOT STOP THE VEHICLE (RAV 4).  ALL MY  AIRBAGS DEPLOYED.  I HAD AN INFANT IN THE BACK SEAT IN A CAR SEAT.  I WAS EXTREMELY IN SHOCK AND SHAKEN AND HAD TROUBLE GETTING OUT OF THE VEHICLE AND BACK IN TO GET THE BABY OUT.  MY VEHICLE WAS DECLARED A TOTAL LOSS.  I ALSO QUESTION WHY ALL AIRBAGS DEPLOYED. TAKATA AIRBAGS",
        "vin": "JTMRFREV9EJ"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "02/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10944768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SHADE POPPED OFF THE WINDOW AND SMACKED THE CONSUMERS CHILD IN THE FACE. IT SEEMS LIKE THE CORNERS WERE WAY TOO HEAVY FOR THIS PRODUCT TO BE CONSIDERED SAFE IN A CAR. *BF  THE CONSUMER STATED HER DAUGHTER HAD A SWOLLEN LIP AND HER LIP WAS BLEEDING. SHE LATER HAD BRUISING ON HER FACE AND HER LIP STAYED SWOLLEN FOR DAYS. *JB...*BF    *CN",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2016",
        "dateOfIncident": "08/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905635,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY I WAS DRIVING MY 2014 RAV4 NEAR DOWNTOWN TAMPA ON ADAMO DRIVE AND WAS TAKING A LEFT TURN, AND SUDDENLY I HEARD SOME KIND OF NOISE AND FELT LIKE MY VEHICLE WENT DEAD WITHOUT ANY ELECTRICAL POWER AND IT STARTED REVERSING ON IT'S OWN AND SPUN TO RIGHT.  FORTUNATELY SINCE I WAS TAKING A TURN I WAS HARDY AT A SPEED OF ABOUT 10 MPH AND HENCE MY FRONT RIGHT PASSENGER SIDE DOOR & HEAD LIGHT ETC. GOT DAMAGED AND THERE WAS A VERY MINIMAL DAMAGE TO THE FRONT FENDER ON THE DRIVER SIDE OF THE VEHICLE BEHIND OUR RAV4. FOR THE SAME REASON NONE OF US - EITHER MYSELF, MY FRONT CO-PASSENGER OR THE DRIVER OF THE VEHICLE BEHIND OUR RAV4 WERE PHYSICALLY HURT AND WERE VERY SAFE AFTER THIS INCIDENT. THE DRIVER OF THE VEHICLE BEHIND OUR RAV4 INFORMED THAT HE HEARD A KIND OF STRANGE SOUND AND SAW OUR RAV4 REVERSING & TURNING RIGHT, AND HE MOVED AWAY INTO THE RIGHT LANE. THE POLICE OFFICER, WHO HAS COME ALSO INFORMED THAT SHE HAS COME ACROSS THIS KIND OF INCIDENTS WITH TOYOTA VEHICLES RECENTLY, AND DID NOT GIVE ME CITATION AFTER REVIEWING MY INCIDENT FREE DRIVING RECORD AND ALSO SHE COULD NOT FIND REASON FOR THIS FREAK INCIDENT WHICH LOOKS MORE LIKE A MECHANICAL DEFECT OF MY RAV4, AND ADVISED TO TAKE TO TOYOTA DEALER FOR FURTHER INVESTIGATION & RESOLUTION. ON FURTHER RESEARCH WE FOUND THAT THERE IS A SERIOUS RECALL - \"ELECTRICAL POWER ASSIST SYSTEM\" (EPS) FOR 2014 RAV4 WHICH WAS IDENTIFIED & DOCUMENTED BY TOYOTA ON 03/13/2015 BUT WAS NOT NOTIFIED TO THE CUSTOMERS. WE HAVE CONTACTED TOYOTA COMPANY, COMPLAINED ABOUT THIS INCIDENT, INFORMED THE RECALL AND WE ARE WAITING FOR A RESPONSE FROM TOYOTA AFTER A THOROUGH INVESTIGATION, COMPUTER DATA ANALYSIS FROM OUR RAV4. I AM HEREWITH ATTACHING THE DOCUMENTATION FOR THE RECALL. I AM VERY MUCH WORRIED & CONCERNED ABOUT THIS INCIDENT, SINCE IT IS OF VERY SERIOUS SAFETY ISSUE. PLEASE REVIEW AND REPLY AS SOON AS POSSIBLE. THANK YOU IN ADVANCE.  *TR",
        "vin": "2T3YFREV0EW"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "06/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10881642,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RAV4 2014 BACK SEAT PASSENGER DOORS HAVE SHARP EDGES AND HAVE HIT MY 2.5 YRS OLD DAUGHTER MANY TIMES. IT IS A DANGEROUS EDGE AND IT COMES AT THE HEIGHT OF 2.5 TO 3 YEAR OLDS WHEN THEY TRY TO GET IN THE BACK SEAT. I HAVE TO BE ALWAYS LOOKING AFTER IT TO BE CAUTIOUS. IT COULD LEAD TO A DANGEROUS EVENT IF NOT PREVENTED. TOYOTA SHOULD PROVIDE GUARD TO COVER THOSE SHARP EDGES AS IT IS A FAMILY VEHICLE AND SAFETY SHOULD BE TOP PRIORITY. EVEN FOR ADULTS IT CAN CAUSE SHARP CUT WHICH WOULD BE A CASUALTY IF NOT PREVENTED. PLEASE TAKE A LOOK INTO THIS. APPRECIATE YOUR HELP ON THIS THANKS",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/28/2016",
        "dateOfIncident": "04/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10861920,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-82 BETWEEN SELAH AND YAKIMA AT APPROXIMATELY 65 MILES PER HOUR.  THE WIND WAS BLOWING FAIRLY AGGRESSIVELY OUTSIDE THAT DAY AND THE TEMPERATURE WAS ROUGHLY 70 - 75 DEGREES.  WHILE DRIVING MY SUNROOF SUDDENLY EXPLODED.  NO ROCK HIT THE CAR AND I WAS NOT DRIVING UNDER AN UNDERPASS WHERE ANYONE COULD HAVE THROWN SOMETHING AT MY CAR.  THE SOUND WAS LIKE A GUNSHOT.   I SINCERELY THOUGHT I HAD BEEN SHOT AT.  GLASS FLEW EVERY WHERE.   MY SUNROOF VISOR WAS OPEN SO THE SHARDS RAINED DOWN INTO MY CAR AND ALL OVER ME.  I HAD GLASS DOWN MY NECK, IN MY HAIR, AND EVEN FOUND A PIECE ON MY EYELID WHEN I RUBBED MY EYE AND CUT MY EYELID AND THE SKIN NEAR MY INNER EYE.  THERE WAS NOTHING I WAS AWARE OF THAT OCCURRED ON THE ROAD THAT DAY THAT WOULD HAVE CAUSED THE SUNROOF TO BREAK.  BUT IT BLEW OUT WITH EXTREME FORCE.  *TR",
        "vin": "JTMRFREV6EJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "05/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854379,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO ACCELERATE FROM A TRAFFIC LIGHT  OR STOP THE SUDDENLY STOPS ACCELERATION CAUSING A VERY HAZARDOUS CONDITION, HAS HAPPENED NUMEROUS TIMES, BACK TO DEALER TWICE WITH NO RESOLUTION, WILL BE TAKING IT BACK TO DEALER AGAIN , AFTER 6 TOYOTAS IF THIS CAN'T BE RESOLVED IT WILL BE TRADED FOR ANOTHER MFG. VERY DISAPPOINTED WITH TOYOTA.",
        "vin": "2T3YFREV0EW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/07/2016",
        "dateOfIncident": "04/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854070,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "REMEDY FOR THIS PROBLEM HAS NOT BEEN FORTHCOMING IN A TIMELY MANNER. WHAT'S THE POINT OF ALERTING OWNERS THAT THEY HAVE A PROBLEM THAT NEEDS IMMEDIATE ATTENTION ONLY TO HAVE NO CORRESPONDING SOLUTION AVAILABLE FROM THE MANUFACTURER? THERE SHOULD BE A DEADLINE FOR THIS SORT OF THING.",
        "vin": "2T3ZF4DV8CW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "03/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853928,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE FIRST TIME, I DROVE THIS CAR TO PICK MY DAUGHTER UP FROM HER SCHOOL. WHEN I WAITED FOR MY DAUGHTER,I WASN'T TURN OFF THE ENGINE, JUST STEPPED ON THE BREAK UNTIL MY DAUGHTER GOT ON ABOUT ONE MINUTE. AND THEN I RELEASED THE BREAK WANTED TO MOVE ON. I COULDN'T  TURNED THE STEERING WHEEL AND THE CAR JUST MOVE STRAIGHT. I RESTARTED MY CAR AGAIN AND THE CAR COULD MOVE NORMALLY. AT THE SECOND TIME, WHEN I WAS WAITING AT A TRAFFIC LIGHT, MY CAR SUNDDENLY SHAKED ABOUT FOUR SECONDS AND THEN THE ENGINE OFF AUTOMATICALLY AND THE STREERING WHEEL COULDN'T TURNED TOO. WHEN I RESTARTED THE CAR AND IT COULD MOVE AGAIN.",
        "vin": "JTMWFREV0EJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "08/08/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ROOF RACK CROSS BARS DO NOT STAY IN PLACE WHILE BEING USED AND CAR IS IN MOTION.  WE PURCHASED A ROCKYMOUNT FOR OUR BIKES THAT CONNECTS TO THE ROOF CROSSBARS AND WHEN DRIVING ON THE INTERSTATE, THE STOCK CROSS BARS MOVED BACKWARDS SO THAT OUR BIKES WERE HANGING OVER THE BACKSIDE OF THE CAR.",
        "vin": "2T3YFREV7EW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823830,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "LARGE BLACK AREA AT TOP OF WINDSHIELD WHILE DRIVING AT NIGHT. MAINLY ON DARK ROADS.  THIS IS WHILE DRIVING WITH HEADLIGHTS ON.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/31/2016",
        "dateOfIncident": "01/04/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823312,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS REGARDING RAV4EV - ELECTRIC CAR.     I HAD ~50MILES LEFT ON THE BATTERY AND YET I LOST TRACTION MIDDLE OF THE ROAD A MONTH AGO. RADIO AND ALL OTHER THINGS WERE FINE. I HAD THE DASHBOARD SAY \"CHECK EV SYSTEM\". I HAD TO PULL OVER AND THANKFULLY I WAS ON THE RIGHT MOST LANE WHEN IT HAPPENED. SO I CALLED SOS AND HAD TO TOW THE CAR TO THE SERVICE CENTER. THEY REPLACED DRIVE UNIT, TRACTION MOTOR AND NEGATIVE MOTOR. WHOLE THING TOOK ALMOST GOOD 3.5 WEEKS.    I GOT THE RECALL TAKEN CARE LAST AUG 2015 - SO THIS ISSUE IS AFTER THE RECALL.    NOW, I DON'T HAVE ANY CONFIDENCE WITH THE VEHICLE. WHAT IF THIS THING HAPPENS ON THE FREEWAY? I AM PRETTY SCARED. I HAVE ONE MORE YEAR ON THE LEASE.",
        "vin": "2T3YL4DV7EW"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "09/24/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807599,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "UNINTENDED ACCELERATION. BEFORE STARTING WORK, MY WIFE WAS ATTEMPTING TO SLOWLY PARK OUR 2014 RAV4 AT LESS THAN 2 MPH IN AN EMPTY PARKING SPACE IN THE PUBLIC PARKING LOT WHERE SHE WORKS WHEN THE VEHICLE SUDDENLY ACCELERATED ON ITS OWN REACHING A FINAL SPEED OF 21 MPH IN THE SPAN OF APPROXIMATELY 2 TO 3 SECONDS. DURING THESE 2 TO 3 SECONDS THE VEHICLE TRAVELED A DISTANCE OF APPROXIMATELY 27 FEET FROM THE EMPTY PARKING SPACE, RUNNING OVER THE PARKING SPACE CONCRETE CURBS AND HIT A PARKED VEHICLE ON THE RAV4 RIGHT AND THEN RAN INTO A TREE, WHICH WAS THE ONLY THING THAT STOPPED THE VEHICLE. MY WIFE APPLIED THE SERVICE BRAKE TO TRY TO STOP THE VEHICLE BUT THIS EFFORT DID NOT PREVENT THE VEHICLE FROM ACCELERATING.  AFTER HITTING THE TREE MY WIFE SHIFTED THE VEHICLE INTO PARK AND PUSHED A BUTTON TO TURN THE ENGINE OFF.  THE AIR BAGS DID NOT DEPLOY AFTER HITTING THE TREE AT 21 MPH. WE NOTIFIED TOYOTA OF THE PROBLEMS REGARDING SUDDEN ACCELERATION, SERVICE BRAKE AND THE NON-DEPLOYED AIR BAGS. TOYOTA OPENED A CASE AND SENT AN INSPECTOR TO INSPECT THE RAV4.  WE RECEIVED A LETTER FROM TOYOTA STATING THEY FOUND NO EVIDENCE OF ANY TYPE OF MANUFACTURING OR DESIGN DEFECT. WE DO NOT FEEL SAFE IN THIS VEHICLE.  WE ARE NOT DRIVING THE 2014 RAV4 DUE TO THIS SERIOUS SAFETY DEFECT OF SUDDEN UNINTENDED ACCELERATION. VEHICLE SAFETY FAILURE MILEAGE WAS 2,577 MILES.",
        "vin": "2T3DFREV6EW"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2015",
        "dateOfIncident": "11/09/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A TURN UNDER 10 MPH THE VEHICLE SUDDENLY ACCELERATED WITH THE FOOT OFF THE ACCELERATOR PEDAL. THIS HAS HAPPENED 3 TIMES WITH 2 TRIPS TO THE DEALERSHIP RIGHT AFTER. DEALER COULD NOT FIND ANYTHING WRONG. ONLY A QUICK REACTION ONTO THE BRAKE PEDAL STOPPED THE CAR FROM HITTING SOMETHING. 2 OF THE TIMES THE VEHICLE WAS TURNING UP A SLIGHT HILL. THIS NEEDS TO BE INVESTIGATED SINCE TOYOTA CAN'T FIND AN ISSUE, A UN-EXPERIENCED DRIVER MAY NOT REACT FAST ENOUGH TO PREVENT AN ACCIDENT.",
        "vin": "2T3DFREV7EW"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "11/02/2015",
        "dateOfIncident": "10/29/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10787567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR 1 CUT IN FRONT OF CAR 2, CAR 3 (OURS) STOPPED 1 CAR LENGTH AWAY, WHEN STARTED TO DRIVE PAST THE CRASH SUDDENLY CAR 4 SLAMMED INTO CAR 3 (OURS) AND PUSHED MY WIFE'S CAR INTO CAR 2 AND CAR 2 INTO CAR 1 AGAIN. AIRBAG FAILED TO DEPLOY, SEAT BELT LOCKED AND EMS HAD TO GET MY WIFE OUT. WHEN THIS HAPPENED MY WIFE WAS DRIVING ON I95 HEADING SOUTH JUST PASSING EXIT 60 HYPOLUXO DR AT ABOUT 45MPH WHEN SHE WAS ABLE TO STOP. SHE WAS GOING LESS THAN 5 MPH WHEN SHE WAS HIT BY CAR 4....UPDATED 11/05/15 *BF   *JS",
        "vin": "2T3YFREV3EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/26/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786504,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL WIRING WAS EATEN BY A RODENT.  THE RODENT MADE A NEST IN THE ENGINE AREA AFTER EATING THE WIRES.  THE REPAIR OF THE VEHICLE IS COSTING US $1510 PLUS A RENTAL CAR.",
        "vin": "JTMBFREV6ED"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785348,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/19/2015 THE ELECTRONIC STEERING SYSTEM WARNING PANEL ACTIVATED, LOCKING MY STEERING COLUMN AND PREVENTING THE START OF THE RAV4.  TOWING COMPANY ARRIVED, EXPERIENCED/WITNESSED SAME EVENT. RAV4 TOWED TO DEALERSHIP.  10/20 DEALERSHIP STATED \"NO REPAIRS PERFORMED VEHICLE OPERATING AS DESIGNED.\"  10/20/2015 THE CUSTOMER REPRESENTATIVE STATED \"THERE WAS NO ELECTRONIC FOOTPRINT IN THE MEMORY CARD, INDICATING THIS EVENT TOOK PLACE.\"  NO ACTION BY DEALERSHIP.  REPORTED TO GENERAL MANAGER AND TOYOTA CO.  TOYOTA CASE #1510220162.  TOYOTA STATED THEY WILL NOT BE MAKING ANY REPAIRS BECAUSE THE VIN IS NOT PART OF RECALL NUMBER 15V144000 DATED 3/13/2015.  DEALERSHIP AND CORPORATION STATED THE VEHICLE MUST PRESENT THE ISSUE AT THE SHOP OR ON THE ROAD (AT THIS POINT THERE WILL BE A CRASH) BEFORE THEY WILL TAKE ANY ACTION.",
        "vin": "2T3DFREV1EW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "10/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783846,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2014 RAV4 HAS A FUEL LINE LEAK.  THE SERVICE DEPARTMENT CLAIMS IT IS DUE TO A MOUSE AND WILL NOT FIX IT UNDER WARRANTY.  I THINK IT APPEARS THAT THE LINE HAS BEEN SCRAPED RATHER THAN CHEWED. BUT IF IT WAS DAMAGED BY A MOUSE THIS IS ALSO AN ISSUE. THE FUEL LINE SHOULD NOT BE EDIBLE BY RODENTS.  WAY TOO MANY AUTOMOBILE PARTS ARE BEING MADE FROM \"EDIBLE\" COMPONENTS.  THIS IS A SERIOUS SAFETY HAZARD.  I HAVE BEEN WARNED I SHOULD NOT DRIVE MY CAR - THAT IT COULD CAUSE A FIRE.  FROM INFORMATION AVAILABLE ON THE INTERNET AND FROM A LOCAL REPAIR PLACE I HAVE FOUND THAT A LOT OF WIRING AND OTHER PARTS ARE RODENT EDIBLE AND CAUSING A LOT OF DEFECTS.",
        "vin": "JTMRFREVXEJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "06/18/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779897,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED SUDDEN ACCELERATION WHILE SLOW MOVING IN A CROWDED PARKING LOT. WHEELS CONTINUED TO SPIN AND ACCELERATE EVEN AFTER CAR HAD COLLIDED WITH OTHER (PARKED) CARS, AND CONTINUED TO ACCELERATE WITH NO RESPONSE FROM THE BRAKES. IT COLLIDED IN QUICK SUCCESSION WITH FOUR CARS UNTIL IT FINALLY STOPPED (CAR WAS TURNED OFF). LUCKILY NO ONE WAS INJURED, THERE WERE DOZENS OF PEDESTRIANS RETURNING TO THEIR VEHICLES AFTER A CLASSIC CONCERT. I ASKED FOR AN INVESTIGATION BY THE CAR MAKER. INVESTIGATION WAS CONDUCTED ON 6 JULY (CDR/EDR RECORD RECOVERED FROM SRS MODULE). IN SEPTEMBER I RECEIVED A LETTER FROM TOYOTA SAYING NO MECHANICAL DEFECT WAS FOUND. HOWEVER, I BELIEVE IT IS NOT A MECHANICAL DEFECT BUT A SOFTWARE DEFECT THAT CAUSED THE ACCELERATION. I'VE OWNED TOYOTAS FOR OVER 15 YEARS - WHICH I HAD ALWAYS CONSIDERED A VERY RELIABLE COMPANY - HAVE BEEN A DRIVER FOR OVER 30 YEARS AND NEVER HAD A SINGLE ACCIDENT. THE EXPERIENCE WAS SO TERRIFYING IN SPITE OF TOYOTA REASSURANCE I FELT THE CAR WAS UNSAFE AND TRANSFERRED THE LEASE TO A DEALER (BEARING SOME MONETARY LOSS, UNFORTUNATELY). I FILE THIS COMPLAINT SO THAT FUTURE OWNERS CAN BE MADE AWARE, AND IN ORDER TO ASSIST ACCURACY OF STATISTICS AND STUDIES ON SUDDEN UNINTENDED ACCELERATION EVENTS.",
        "vin": "2T3DFREV6EW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778728,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION SCREEN IS DANGEROUSLY UNREADABLE IN SUNLIGHT; THE GLARE IS IMPOSSIBLE TO SEE THROUGH.",
        "vin": "2T3DFREV2EW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/13/2015",
        "dateOfIncident": "08/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748492,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON AN OVERPASS AND WAS ABOUT TO TURN ONTO AN ON RAMP TO ENTER INTERSTATE 70 IN LIMON COLORADO AND I STRUCK A VEHICLE ON THE FRONT DRIVERS SIDE OF BOTH OUR CARS. AND MY AIRBAG DIDN'T DEPLOY. I HIT THE STEERING COLUMN WITH MY RIGHT ARM AND LEFT SIDE OF MY CHEST AND STOMACH.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/11/2015",
        "dateOfIncident": "08/05/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747781,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING DOWN THE INTERSTATE AT ABOUT 65 MPH AT AROUND 9 AM WHEN WE HEARD WHAT SOUNDED LIKE A BOOM ON TOP OF OUR 2014 RAV4.  THERE WERE OTHER VEHICLES ON THE ROAD BUT THERE WAS NOTHING THAT WE SAW FLY UP OFF THE ROAD AND IMMEDIATELY TURNED TO SEE WHAT MIGHT HAVE FLOWN OFF THE BACK OF THE VEHICLE AND SAW NOTHING.  WE WERE ABLE TO EXIT THE FREEWAY AND FIND A PARKING LOT TO SEE WHAT HAPPENED TO OUR VEHICLE.  OUR SUNROOF HAD A BIG HOLE IN THE MIDDLE AND ALL THE REST OF THE GLASS WAS CRACKED LIKE A SPIDER WEB.  THERE WAS NOTHING FOUND SUCH AS ROCK OR OTHER OBJECT IN THE GLASS THAT COULD HAVE HIT THE VEHICLE AND NO OTHER DAMAGE TO THE ROOF.  THANKFULLY THE COVER WAS CLOSED AT THE TIME.  WE DID NOT HAVE A CHOICE BUT TO BREAK OUT ALL THE REMAINING GLASS AFTER CONTACTING THE TOYOTA DEALERSHIP/AND INSURANCE COMPANY, SO AS NOT TO SPRAY GLASS ON THE ROAD OR DRIVERS ON OUR 45 MILE DRIVE BACK HOME.  TOYOTA DEALERSHIP TOLD US IT WOULD NOT BE COVERED UNDER OUR WARRANTY AND WOULD HAVE TO BE AN INSURANCE CLAIM.  WE FEEL THAT THIS IS A MANUFACTURER DEFECT.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747665,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 60MPH, MANUFACTURER INSTALLED SUNROOF EXPLODED.  OUTSIDE AIR TEMP WAS 88DEG. SOUNDED LIKE A GUNSHOT, AND CAUSED ME TO SWERVE OFF ROAD THINKING MY CAR HAD BEEN HIT.  NO OTHER CARS OR PEOPLE ON ROADWAY AT THE TIME OF THE INCIDENT. NO OVERPASSES OR TREES, EITHER.  NO ROCKS OR DEBRIS WERE FOUND IN THE BROKEN GLASS.  COVER WAS CLOSED, OR I WOULD HAVE BEEN COVERED IN GLASS. TOYOTA HAS HAD COMPLAINTS ABOUT THIS PROBLEM, AND REFUSES TO ACCEPT RESPONSIBILITY FOR THIS KNOWN DEFECT.",
        "vin": "JTMWFREV7EJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/26/2015",
        "dateOfIncident": "05/25/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721455,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 3 MPH AND MAKING A RIGHT TURN, THE VEHICLE ACCELERATED UNEXPECTEDLY AND CRASHED INTO A WOODED AREA. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6,000.",
        "vin": "JTMRFREV9ED"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2015",
        "dateOfIncident": "05/02/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715127,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 2, 2015, AT ABOUT 10:00 A.M. WE WERE DRIVING TO THE SCRANTON, PA, AREA. WE HAD JUST ENTERED THE ON-RAMP TO I-81 NORTH FROM RT. 309 WHEN WE HEARD A VERY LOUD BANG AND ROARING SOUND SIMILAR TO A DOOR ON A JET BLOWING OFF MID-AIR IN A MOVIE.  THERE WAS NOTHING ON THE ROAD TO RUN OVER AND THE CLOSEST VEHICLE TO US WAS A TRUCK TRACTOR AT LEAST 500 YARDS AHEAD OF US AND NOT DRIVING ON AN ANGLE THAT WOULD SEND ANYTHING AIRBORNE TO OUR AREA; NOR WERE WE NEAR AN UNDERPASSR. WE PUT OUR FLASHERS ON AND PULLED OVER AT THE FIRST SAFE AREA.  UPON CHECKING OUR VEHICLE, WE DISCOVERED OUR SUNROOF GLASS HAD 'EXPLODED' WITH AN APPROXIMATE 8-10 INCH CIRCULAR HOLE DEAD CENTER AND THE REST OF THE GLASS FRACTURED.  WE HAD THE INTERIOR SUNROOF COVERING PULLED CLOSED WHEN THIS OCCURRED.  THE EDGES OF THE HOLE WERE BENT SLIGHTLY UPWARD INDICATING AN UPWARD FORCE.  WE DIDN'T RUN OVER ANYTHING AND NOTHING STRUCK US, SO WE WERE FAIRLY SHOCKED.   WE CHECKED OUR CELL PHONES AND DISCOVERED INDEPENDENCE TOYOTA, HAZELTON, PA, WAS ABOUT 5 MINUTES AWAY AT OUR NEXT EXIT.  WE PULLED IN AND BOTH THE SALES PEOPLE AND SERVICE PEOPLE EXAMINED THE DAMAGE AND WERE AS SURPRISED AS US.  NOTHING WAS FOUND IN THE GLASS DEBRIS THAT WOULD INDICATE SOMETHING STRUCK THE GLASS.  INDEPENDENCE TOYOTA WAS GREAT BY CLEANING UP THE GLASS, PLACING TWO LAYERS OF HEAVY PLASTIC OVER THE SUNROOF OPENING AND TAPING IT SHUT.  I AM A RETIRED POLICE LIEUTENANT. I KNOW WHAT IMPACT DAMAGE LOOKS LIKE AND THIS WAS NOT IT.  UPON CHECKING ONLINE, THIS OCCURRENCE APPEARS MORE FREQUENTLY THAN ONE WOULD THINK IN VARIOUS MAKES OF VEHICLES.  PRICE TOYOTA IN NEW CASTLE, DE IS DECLINING TO COVER THIS UNDER WARRANTY CITING THIS IS NORMAL GLASS BREAKAGE.  I HAVE HAD WINDSHIELDS STRUCK BEFORE. THIS IS NOT REMOTELY CLOSE. IT IS NOT OKAY TO BE DRIVING YOUR VEHICLE AND SUDDENLY HAVE THE SUNROOF \"EXPLODE\" WITH NO CAUSING FACTORS PRESENT.  *TR",
        "vin": "2T3DFREV0EW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "02/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706096,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN ONGOING INTERMITTENT PROBLEM. I NOTICE IT WHILE MOVING SLOWLY AND TURNING.  THE STEERING HAS A SPOT WHERE IT IS HARDER TO TURN. IT FEELS LIKE THE POWER STEERING MOMENTARILY STALLS.  I TOLD THE DEALERSHIP AT THE FIRST SERVICE APPOINTMENT AND THEY COULDN'T FIND ANYTHING.  *TR",
        "vin": "JTMRFREV6ED"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705833,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHY ARE THE WIPERS AND WINDSHIELD SO BAD, I CAN SEE BETTER IN THE RAIN WITH THE WIPERS OFF.    THERE IS NO DIRT ON MY WINDSHIELD OR DEAD BUGS, I CLEANED THE WINDSHIELD IN MY GARAGE AND THEN DROVE IN THE RAIN TO PROVE A POINT. WHEN THE WIPERS ARE ON IT IS VERY HARD TO SEE BECAUSE OF THE BLURRING ON THE WINDSHIELD IT IS CLEARER JUST LOOKING THROUGH THE RAIN.  *TR",
        "vin": "2T3YFREV8EW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "09/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISE WHEN BRAKING,AND PADS NOT RELEASING FROM ROTORS COMPLETELY.  *TR",
        "vin": "2T3BFREV0EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "01/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676497,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 8:20 AM ON FRIDAY, JANUARY 16TH, 2015, I WAS PULLING INTO AN EMPTY PARKING SPOT IN FRONT OF MY APARTMENT COMPLEX AFTER DROPPING MY 6 YEAR-OLD AT SCHOOL. THIS WAS A ROUTINE AS I DO THIS EVERY MORNING. HOWEVER, AS I WAS SLOWING THE CAR DOWN PREPARING TO PARK (5-10 MPH), THE CAR SUDDENLY ACCELERATED (APPROXIMATELY 25-30 MPH) AND RAN OVER THE SIDEWALK, BUSHES AND INTO THE SIDE OF MY APARTMENT COMPLEX. DESPITE MY ATTEMPTS TO BRAKE, THE CAR WOULD NOT STOP. IN THE PROCESS I RAN THROUGH THE SIDE OF MY APARTMENT COMPLEX WALL AND FRONT GATE, NEARLY GOING RIGHT THROUGH MY FRONT DOOR AND LIVING ROOM WHERE MY 6 MONTH OLD AND WIFE WERE PLAYING. I HAD TO PLACE THE CAR IN PARK AND TURN THE CAR OFF. THAT STOPPED THE CAR. I THEN TURNED THE CAR BACK ON AND REVERSED. LUCKILY NO ONE WAS INJURED, BUT THERE WAS SUBSTANTIAL DAMAGE DONE TO THE SIDE OF MY APARTMENT COMPLEX AND MY VEHICLE. SHOULD BE NOTED, THAT DESPITE THE IMPACT, NO AIRBAGS WERE DEPLOYED. AT THE MOMENT, MY INSURANCE COMPANY HAS ME AT FAULT. I HAVE FILED WITH TOYOTA CORPORATE AND THEY ARE HAVING A SPECIALIST INVESTIGATE THE VEHICLE. I DO NOT FEEL SAFE IN THIS CAR. AND HOPE THAT THIS IS INVESTIGATED FURTHER. HAD I NOT TURNED OFF MY CAR, I WOULD HAVE SURELY GONE THROUGH MY FRONT DOOR AND INTO MY LIVING ROOM, POTENTIALLY HURTING MY 6 MONTH OLD AND WIFE.  *TR",
        "vin": "JTMRFREV6ED"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "11/16/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10676527,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BOTTOM OF ALL FOUR DOOR WHERE THE DOOR AT THE BOTTOM MEETS THE HARDEN RUBBER OR PLASTIC. LOOKING AT THE DOORS FROM THE OUTSIDE IT WOULD ALWAYS BE IN THE LOWER RIGHT CORNERS AT WHERE THE CURVED PART OF THE DOOR MEETS THE STRAIGHT PIECE RUNNING ALONG THE BOTTOM.    EACH OF THESE CORNERS ARE EXTREMELY SHARP AND HAVE CAUSED UPON CLOSING BY WIND TO CUT THE CALF OF THE LED, WHICH LED TO OPENING TWO BLOOD VESSELS, REQUIRING EMERGENCY ATTENTION AND STITCHES.    HAVE CHECKED AT LEAST 10 OTHER RAV4'S SAME MODELS SAME YEAR IN ADDITION TO FOUR ON TWO SEPARATE DEALER LOTS.    ALL HAVE THE SAME ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW RAV-4 WAS SLIGHTLY MORE THAN 1 MONTH OLD (7/1/14 TO 8/11/14).  WE WERE DRIVING BACK TO ATLANTA FROM VACATION IN THE OUTER BANKS,   WE WERE USING CRUISE CONTROL TO MAINTAIN SPEED ON THE EXPRESSWAY.  WE CAME ACROSS A SLOWER MOVING TRUCK AND PULLED INTO THE PASSING LANE, STILL USING CRUISE CONTROL.  WHILE PASSING SLOW TRUCK, ANOTHER TRUCK CAME UP ON OUR TAIL AT A HIGHER RATE OF SPEED.  I STEPPED ON THE GAS TO GET IN FRONT OF THE SLOW TRUCK, INTENDING TO ENABLE THE FAST TRUCK TO PASS US ONCE WE WERE IN FRONT OF THE SLOW TRUCK AND BACK IN THE NORMAL LANE.  INSTEAD OF SPEEDING UP, RAV-4 LOST POWER AND QUICKLY SLOWED DOWN, TO THE POINT OF NEEDING TO PULL BEHIND THE SLOW TRUCK THAT WE WERE TRYING TO PASS AND HAVING TO PULL TO THE SHOULDER OF THE ROAD.  THE FAST TRUCK ON OUR TAIL STARTED TO (SLIGHTLY) FISHTAIL AND MIGHT HAVE CRASHED INTO US IF THE TRUCK DRIVER HAD LOST CONTROL OF HIS VEHICLE.  WE PULLED TO THE SIDE OF THE ROAD AND TRIED TO REV THE ENGINE, BUT GOT NO RESPONSE, THE ENGINE ALMOST STALLING.  SINCE THE ENGINE WAS NOT RESPONDING, WE SHUT THE CAR OFF, AND RESTARTED, AND WERE ABLE TO CONTINUE WITH NO FURTHER PROBLEMS, BUT DIDN'T USE THE CRUISE CONTROL AGAIN FOR THE REST OF THE RIDE HOME.  WE REPORTED THE INCIDENT TO OUR DEALER, AND WERE TOLD THAT THIS WOULD BE VERY DIFFICULT TO TROUBLE-SHOOT, AND TO CONTINUE TO DRIVE AND BRING IT BACK IF IT HAPPENS AGAIN.  WE NO LONGER TRUST THE CRUISE CONTROL ON THIS VEHICLE AND WILL NOT USE IT AGAIN.  *TR",
        "vin": "2T3YFREV4EW"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SEATS",
        "crash": true,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10640943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON BUSINESS AND VACATION, COMING FROM LA TO ATLANTA...I WAS DRIVING SPEED LIMIT IN FAR LEFT LANE, ON INTERSTATE, IN LAGRANGE ,GA, A TRUCK COMING ONTO THE INTERSTATE MERGING  FROM FAR RIGHT LOSS CONTROL BECAUSE SHE WAS SPEEDING AND THE ROADS WERE SLICK FROM A LIGHT RAIN, SHE FISHTAILED FROM THE FAR RIGHT , CROSSING THE RIGHT LANE AND COMING HEAD ON IN OPPOSITE DIRECTION OF TRAFFIC , HITTING MY RENTAL VEHICLE..RAV 4. HIT US HEAD ON...THE AIRBAGS POPPED OUT EVERYWHERE, BLOCKING ESCAPE EXITS, WE THOUGHT THE TRUCK WOULD CATCH AFIRE, BECAUSE OF SMOKE SMELL, WE TRIED TO GET OUT, ALL DOORS ON THE LEFT OF THE VEHICLE WOULD NOT OPEN, ALTHOUGH IT WASN'T HIT IN ANY WAY, HAD TO CRAWL OVER SEATS AND UNDER AIRBAGS TO ESCAPE ON THE RIGHT SIDE OF VEHICLE. EVEN THE HATCH BACK DOOR AT REAR OF VEHICLE WOULD NOT OPEN AT ALL. WE JUST BARELY ESCAPED WITH OUR LIVES,AND INJURIES, BECAUSE IF WE DIDN'T PUSH THE RIGHT SIDE DOORS WE WOULD HAVE BEEN TRAPPED.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "08/27/2014",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632313,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER GETTING T-BONED AT AN INTERSECTION, MY TOYOTA RAV4 IMMEDIATELY CAUGHT FIRE.  THE CAR WAS HIT ON THE PASSENGER SIDE BY THE RIGHT WHEEL AND RIGHT TO MID SECTION OF THE HOOD.  WHEN I GOT OUT OF THE CAR IT WAS ALREADY ON FIRE.  *TR",
        "vin": "2T3RFREV6EW"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630245,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY BRAND NEW TOYOTA 2014 RAV4,  THEY WERE THE FOLLOWING:     1. THE CAR WAS VIBRATING SLIGHTLY AND THE CAR WAS STUCK IN FIRST GEAR.     2. THE ?CHECK ENGINE\" LIGHT CAME ON ALONG WITH THE AWD DRIVE AND TRACTION CONTROL LIGHTS.     3. THE STEERING WHEEL WAS BECOMING FIRM ALONG WITH THE BRAKE PEDAL. REMEMBER, THIS WAS ALL WHILE THE CAR WAS STILL RUNNING.     4. I MANAGED TO PULL OVER AND TURN OFF THE CAR.     5. I TRIED TO RESTART THE VEHICLE, BUT THE CAR WOULD NOT START AND WOULD ONLY USE THE BATTERY.     6. I TRIED TO START THE CAR FOR THE THIRD TIME, BUT STOPPED WHEN I COULD SMELL BURNING RUBBER.      I WAS VERY NERVOUS WHEN THIS HAPPENED. MOREOVER, I HAVE LOST CONFIDENCE, TRUST, AND A SENSE OF SAFETY IN THIS VEHICLE. BASICALLY, I NO LONGER FEEL SAFE AND SECURE IN THIS CAR. MY EXPERIENCE YESTERDAY    09/01/2014 WAS TERRIFYING, I WAS AFRAID THAT SOMEBODY WAS GOING TO HIT ME FROM BEHIND. WHEN THE VEHICLE STARTED TO SHUT DOWN I WAS SCARED FOR MY FRIENDS LIFE AND MINE.    I HAD NO CHOICE BUT TO STOP THE CAR AS MUCH AS I COULD TO THE SIDE SAFELY AND PUT ON MY HAZARD LIGHTS ON, AND CALL FOR HELP. THERE WAS NO SHOULDER I HAD TO STOP ON A BUSY ROAD, WHERE CARS DRIVE OVER THE SPEED LIMIT.   WHEN I WAS BUYING THE VEHICLE THEY WERE MY BEST BUDDY OFFERING YOU WATER, PIZZA, AFTER THE DEAL SHAKING HANDS  20 TIMES, WHEN YOU GO BACK ITS LIKE WE ARE VERY BUSY. TOYOTA CARE WILL TAKE CARE OF IT, DON'T REALLY WANT TO KNOW YOU!  AT THE MOMENT IT IS AT THE DEALERSHIP BEING CHECKED! LETS SEE WHAT HAPPENS.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614831,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST GOT A LEASED A BRAND NEW RAV4-2014 ON JULY 1, 2014. I REPORTED TO THE DEALER THE FOLLOWING ISSUES:  ON 7/6/14, I CALLED THE DEALER TO REPORTED. I WAS TOLD TO WAIT UNTIL FRIDAY, WHILE THEY ORDERED THE PART.    HOWEVER, ANOTHER ISSUES I REPORTED:  A(  ON 7/1/14 WHILE DRIVING TOWARDS MY HOME THE LEFT FRONT HUBCAP, CAME OFF.  IS DEFECTIVE.  B) REAR HUBCAP, PASSENGER SIDE, WITH DAMAGE, ANYTIME IS GOING TO COME OFF WHILE DRIVING, MAY HIT A PEDESTRIAN OR ANOTHER CAR.   C)  REAR BACK BODY OF THE CAR, A PLASTIC PIECE IS PEELING BACK, MAY COME OFF WHILE DRIVING AND HIT A PEDESTRIAN OR ANOTHER VEHICLE.  D)  FRONT DOOR PASSENGER SIDE.  BENEATH THE HANDLE THERE 2 LARGE WITHE, DEEP SCRATCHES.   E)  INTERIOR DOOR PANEL, PASSENGER SIDE, IT LOOKS DIRTY AND WITH SPOTS.  F)  TWO TIRES HAVE BEEN MARKED WITH BIG RED DOTS.  I HAVE NO IDEA WHY, IS THE FIRST TIME  NEVER ON MY OTHER PREVIOUS CARS.     I AM AFRAID THAT THE DEALER GAVE ME A LEMON CAR. HOWEVER IS FULL THE MANUFACTURER'S RESPONSIBILITY TO FIX THE CAR, AND MAKE SURE THAT THERE ARE NO OTHER FUTURE ISSUES.   FINALLY, NOBODY AT THE DEALER IS SHOWING ANY INTEREST TO TAKE CARE OF MY COMPLAINT.  I'VE LEFT SEVERAL MESSAGES TO CALL ME BACK.  UP TODAY NOBODY HAS TRIED TO CALL ME BACK, EITHER TO ANSWER THE PHONE WHEN I CALL ANY OF THE MANAGERS.  LAST FRIDAY, I RECEIVED A CALL FROM THE DEALER BUT ONLY TO PICK IT THE PLATES AND THE NEW REGISTRATION. I BROUGHT COPIES OF THE DAMAGES, NOBODY EVEN TRY TO TALK TO ME, WAS LIKE SAY, THEY JUST LOOK AT ME, AS IF SAYING \"WHATEVER\".  I NEED YOUR HELP.   THANK YOU.  *TR",
        "vin": "2T3BFREV4EW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/18/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10614535,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "RAV 4 TRAVELING ON ROADWAY WHEN ANOTHER VEHICLE STRUCK ITS RIGHT FRONT FENDER AND FRONT DOOR IN T-BONE IMPACT.  FORCE OF IMPACT WAS ENOUGH TO MOVE RAV 4 TO THE LEFT 2.5 LANES.  RIGHT SIDE CURTAIN AIRBAGS DID NOT DEPLOY.  *TR",
        "vin": "JTMZFREV3EJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/16/2014",
        "dateOfIncident": "06/30/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10610930,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2014 TOYOTA RAV4. THE CONTACT STATED THAT THE DEALER ADVISED THAT THE ON AND OFF BUTTON TO THE BLUETOOTH THAT WAS STANDARD WITH THE VEHICLE SHOULD SHUT ON AND OFF BY USING THE POWER BUTTON. THE CONTACT STATED THAT THE POWER BUTTON WAS DEFECTIVE AND WOULD NOT TURN THE BLUETOOTH OFF WHEN IT WAS ENGAGED. THE CONTACT'S HEART ALSO BEGAN TO FUNCTION ABNORMALLY AND SHE BECAME EXTREMELY WEAK, NEARLY COLLAPSING AFTER EXITING THE VEHICLE DUE TO THE INABILITY TO TURN THE BLUETOOTH OFF AND ON IN ORDER TO PREVENT IT FROM INTERFERING WITH HER PACEMAKER. THE CONTACT ALSO STATED THAT SHE ADVISED THE DEALER PRIOR TO PURCHASING THE VEHICLE THAT SHE HAD A PACEMAKER.  THE CONTACT WAS CONCERNED ABOUT THE SAFETY HAZARD OF DRIVING THE VEHICLE BECAUSE THE OWNER'S MANUAL INDICATED CAUTION IF THE OPERATOR OF THE VEHICLE HAD MEDICAL DEVICES SUCH AS PACEMAKERS. THE GENERAL MANAGER WAS NOTIFIED THAT THE CONTACT BECAME ILL AND STATED THAT SHE SHOULD HAVE BEEN CAREFUL.  ADDITIONALLY, THE VEHICLE COULD NOT BE LOCKED OR UNLOCKED USING THE REMOTE KEY FOB. INSTEAD, THE VEHICLE WOULD EXHIBIT AN ABNORMAL SOUND AND THE LIGHTS ILLUMINATED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2T3RFREV7EW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/04/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608190,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LAG IN THE ACCELERATOR WHEN MOVING FROM VERY SLOW OR FROM A STOP. WHEN MOVING INTO CROSS TRAFFIC IT IS HAZARDOUS AS YOU LOSE SIGNIFICANT SPEED OR ACCELERATION CREATING AN UNREASONABLE RISK THAT THE CROSS TRAFFIC WILL COLLIDE WITH YOUR VEHICLE.  THIS IS NOT A ONE TIME OCCURRENCE AS IT HAPPENS ON A CONTINUOUS BASIS.    THE DEALER TAKES NO RESPONSIBILITY AND IS DUCKING THE ISSUE.  I AM AFRAID IT IS JUST A MATTER OF TIME BEFORE THEY MAY BE SERIOUS INCIDENTS AS OTHER OWNERS HAVE SAID THE SAME THING TO ME.  *TR",
        "vin": "JTMYFREV8ED"
    },
    {
        "components": "STEERING,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/12/2014",
        "dateOfIncident": "05/08/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587726,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW CAR DUNLOP TIRES HAVE SEVERE ROAD HAZARD.  EVERY SMALL  ROAD CONDITION MAGNIFIES INTO  GREAT STEERING PROBLEM.  *TR",
        "vin": "2T3RFREV4EW"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "05/08/2014",
        "dateOfIncident": "05/08/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587235,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS STARTED AND PUT INTO REVERSE THE BACKUP CAMERA IS DIM AND UNVIEWABLE FOR 15 SEC.  BACKING UP DURING THIS PERIOD IS OBVIOUSLY HAZARDOUS AND IT IS VERY ANNOYING TO HAVE TO WAIT UNTIL IT BECOMES VISIBLE.  THIS IS RELATED TO THE WHOLE DISPLAY CONSOLE AS THE RADIO, NAV SYSTEM, AND BU CAMERA ALL COME ON AFTER 15 SEC. THIS DOES NOT HAPPEN ON MY WIFE'S 2007 PRIUS ALTHOUGH OCCASIONALLY IT DOES NOT SWITCH TO THE BU CAMERA AT ALL.  *TR",
        "vin": "2T3YFREV1EW"
    }
]