[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905135,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 VICTORY CROSS COUNTRY. THE CONTACT STATED THAT WHILE DRIVING AT 5 MPH AND MAKING A RIGHT TURN INTO A PARKING LOT, A CRACKING NOISE OCCURRED. THE FAILURE OCCURRED WHEN MAKING RIGHT TURNS. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT A CLIP WAS DETACHED FROM THE TRANSMISSION SHAFT AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 22,000.",
        "vin": "5VPTW36N8E3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2015",
        "dateOfIncident": "07/14/2015",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733851,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 VICTORY CROSS COUNTRY MOTORCYCLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V002000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS WERE UNAVAILABLE TO PERFORM THE REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5VPDA36N8E3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/19/2015",
        "dateOfIncident": "03/18/2015",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706561,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "BEFORE 6 APRIL 2015, I NOTICED THAT MY SADDLEBAGS WERE OPENING WHILE DRIVING. THE RIGHT SIDE OPENED HALF A DOZEN TIMES, AND SHOWS A WORN AREA WHERE THE STRIKER HAD BEEN HITTING, DUE TO POOR ENGINEERING. I ONLY HAVE 1480 MILES NOT NORMAL WEAR AND TEAR. THE DEALER DENIED ANY ISSUE BUT WHEN I SEARCHED THE INTERNET I FOUND A CLASS ACTION SUIT FILED IN CHICAGO IN DECEMBER 2014, AND MANY CITATIONS ON MOTORCYCLE FORUMS SHOWING THAT 2010 TO 2015 MOTORCYCLES HAVE PROBLEMS WITH SADDLEBAGS. IT SHOULD HAVE BEEN CORRECTED. I AGAIN WENT TO THE DEALER TO SHOW HIM THE ISSUE ON 4/7/2015; HE SAID HE WAS NOT ONLY AWARE OF IT, BUT REFUSED TO PERFORM THE PROPER REPAIR, ORDERING AND INSTALLING THE NEW LATCH UNDER THE FACTORY WARRANTY.  HE STATED THAT HE FOUND VICTORY WOULD NOT PAY FOR THE PROPER REPAIR, BUT HE WOULD ADJUST THE LATCH.  HE HAD A TECHNICIAN ADJUST THE STRIKER.  I'M NOT SURE HOW THIS WILL WORK, OR FOR HOW LONG.    THIS IS SO OBVIOUSLY A DESIGN FAULT THAT VICTORY SHOULD RECONSIDER ITS REFUSAL TO HONOR THE FACTORY WARRANTY (IT COVERS DEFECTS IN MATERIALS AND WORKMANSHIP, FOLKS. I UNDERSTAND THAT THE LATCH REPLACEMENT HAS COST SEVERAL OWNERS OVER $400, SINCE VICTORY ONLY OFFERS THE LATCH AS A SET.  THE DEALER SHOULD HAVE VOLUNTEERED TO BRING THE ISSUE TO THE DISTRICT SERVICE MANAGER (ASSUMING THERE IS ONE, LIKE AUTOMOBILE DEALERS), OR TO THE FACTORY SERVICE REPRESENTATIVE.  VICTORY SHOULD WANT TO INSURE SATISFIED, REPEAT CUSTOMERS BY IDENTIFYING AND REMEDYING OBVIOUS FAULTS SIMPLY, QUICKLY, AND PERMANENTLY.    OTHERS HAVE ALSO LAMENTED THE FACTORYS INDIFFERENT ATTITUDE TOWARDS MAKING THIS RIGHT FOR THEIR VALUED CUSTOMERS.  I FIND IT INCREDIBLE THAT THE NUMBER OF COMPLAINTS HAVE NOT RAISED CORPORATE CONSCIOUSNESS TO THE LEVEL OF ACTION; ITS NOT NORMAL WEAR AND TEAR, NOR IS IT DUE TO THE RIDERS ERROR.   *TR",
        "vin": "5VPDB36N2E3"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651741,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLED.  *TR",
        "vin": "5VPTW36N9E3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2014",
        "dateOfIncident": "07/06/2014",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648305,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY AFTER A FEW DAYS OF OWNERSHIP WITH LESS THAN 200 MILES ON THE ODOMETER, THE MOTORCYCLE HAS DEVELOPED A STALLING PROBLEM AND HAS CONTINUED WITH OVER 5,000 MILES ON THE ODOMETER. THE STALLING OCCURS, EITHER WHEN DOWNSHIFTING AND APPLYING A LIGHT QUICK THROTTLE ACTION TO BRING RPMS UP OR WHEN ACCELERATING FROM A STOP AND APPLYING A LIGHT QUICK THROTTLE ACTION TO BRING RPMS UP.  NUMEROUS OCCURRENCES HAVE BEEN REPORTED BY OWNERS OF THIS TYPE OF MOTORCYCLE WITH NO CORRECTIVE ACTION BY VICTORY TO DATE. OWNERS ARE EXTREMELY CONCERNED.  *TR",
        "vin": "5VPTW36N7E3"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "10/14/2014",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644696,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH ON THE RIGHT LUGGAGE BAG DOES NOT ALIGN WITH THE LOCKING CLASP AND THEY RUN TOGETHER WHEN CLOSED, CAUSING THE LATCH TO WEAR AWAY AT THE CLASP AND BASICALLY \"EAT\" THROUGH IT, WHICH WILL EVENTUALLY CAUSE TOTAL FAILURE.  *TR",
        "vin": "JYAVP04E5AA"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "10/11/2014",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644694,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH ON THE RIGHT LUGGAGE BAG DOES NOT ALIGN WITH THE LOCKING CLASP AND THEY RUN TOGETHER WHEN CLOSED, CAUSING THE LATCH TO WEAR AWAY AT THE CLASP AND BASICALLY \"EAT\" THROUGH IT, WHICH WILL EVENTUALLY CAUSE TOTAL FAILURE.  *TR",
        "vin": "5VPDW36N5E3"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "09/29/2014",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640050,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SADDLE BAG LATCHES USED ON THE HARD BAGS ON THE VICTORY MOTORCYCLE ARE WEARING THROUGH THE LATCH WHICH CAUSES THE SADDLE BAG NOT TO PROPERLY LATCH ON THE LOOP, WHICH IN RETURN MEANS IT COULD OPEN UP AS YOU GO DOWN THE HIGH WAY. THIS IS HAPPENING ON MY 2014 VICTORY CROSS COUNTRY. THEY NEED TO BE RECALLED AND REPLACED BY VICTORY NO MATTER WHAT YEAR OF BIKE. IT WILL END UP BEING A DANGER TO ALL WHO HAVE THE HARD BAGS.  *TR",
        "vin": "5V2PDW36N6E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "08/29/2014",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631092,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "CROSS COUNTRY",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING IN STOP AND GO TRAFFIC FOR ABOUT 10-15 MINUTES.  WEATHER WAS 100DEGF DAY.  WHEN I WAS FINALLY ABLE TO GO BACK TO REGULAR STREET SPEED (45 MPH) THE ENGINE ON THE BIKE SEIZED RESULTING IN REAR TIRE SLIDING. I WAS ABLE TO PULL CLUTCH (ALLOWING REAR WHEEL TO ROLL). BIKE DID NOT CRASH. BIKE WOULD NOT TURN OVER FOR APPROXIMATELY 45 MINUTES FOR ENGINE TO COOL DOWN (MY ASSUMPTION).     SOUNDS VERY MUCH LIKE THIS RECALL... WHICH MY VEHICLE VIN IS NOT INCLUDED IN...  REPORT RECEIPT DATE: MAY 01, 2014   NHTSA CAMPAIGN NUMBER: 14V227000   COMPONENT(S): ENGINE AND ENGINE COOLING   POTENTIAL NUMBER OF UNITS AFFECTED: 872   *TR",
        "vin": "5VPDB36N4E3"
    }
]