[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404427,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "ROUTAN",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 VOLKSWAGEN ROUTAN. THE CONTACT STATED THAT WHILE REVERSING, THERE WAS AN ABNORMAL SOUND BEFORE THE DRIVER'S SIDE HEADREST DEPLOYED INDEPENDENTLY. THERE WAS NO WARNING LIGHT ILLUMINATED. THERE WAS NO INJURIES. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER NAPLETON'S NORTHLAKE CHRYSLER DODGE JEEP RAM (3701 NORTHLAKE BLVD, LAKE PARK, FL 33403, (888)786-6360) AND SCHUMACHER BUICK GMC OF NORTH PALM BEACH (3720 NORTHLAKE BLVD SUITE C, PALM BEACH GARDENS, FL 33403, (561)935-4212) AND WERE MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 47,000.",
        "vin": "2C4RVABG5ER"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897876,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "ROUTAN",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "VW ROUTANS ARE KNOWN BY THE MANUFACTURER TO HAVE THE TOTALLY INTEGRATED POWER MODULE OR \"TIPM\" FAIL CAUSING THE ELECTRICAL SYSTEM TO SHUTDOWN.  THIS FAILURE IS RANDOM AND HAPPENS WITH NO WARNING.  MY PERSONAL VEHICLE EXPERIENCED THIS FAILURE WHILE PULLING UP TO A STOP SIGN AND LOSING ALL POWER.   THE ENGINE DID RESTART AFTER CYCLING THE IGNITION SWITCH AND DROVE FINE AFTERWARDS.  THE ROUTAN IS A JOINT VENTURE VEHICLE WITH CHRYSLER WHO HAS HAD THE SAME \"TIPM\" ISSUES AND HAS ISSUED RECALLS TO CORRECT THE SAFETY CONCERN AS THIS EVENT COULD HAPPEN WHILE GOING 70 MPH DOWN THE HIGHWAY POTENTIALLY CAUSING AN ACCIDENT AND SERIOUS HARM TO THOSE INVOLVED.  VW USA HAS ALREADY TOLD ME THEY DO NOT RECOGNIZE THE FAILURE OF THIS \"TIPM\" AND IT IS A CONCERN OF THE CONSUMER AND NOT THE MANUFACTURER.    MY LOCAL DEALER HAS ACKNOWLEDGE THIS FAILURE AND HAS STATED MANY OTHER CONSUMERS HAVE PAID OUT OF POCKET, $1,200.00 APPROXIMATELY, AS VW USA DECLINED TO ASSIST AND THE CONSUMERS NEEDED TO FIX THEIR VEHICLES.    TO DATE THE ONLY TIME VW WILL ACKNOWLEDGE AND/OR PAY FOR THE REPAIR IS IF THE DEALER CAN DUPLICATE THE FAILURE MODE, WHICH BY ITS VERY NATURE IS RANDOM AND DOESN'T PRODUCE A FAULT CODE, WHICH BASICALLY MAKES IT IMPOSSIBLE FOR THE DEALER TO CORRECT AND FILE A WARRANTY CLAIM AGAINST IT.",
        "vin": "2C4RVABG6ER"
    }
]