[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/09/2022",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453874,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "Wipers continually run. Headlights will not flip to high beam at times.",
        "vin": "YV4902DZ3E2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398489,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED TWO RECALL NOTICES FOR DEFECTIVE DRIVER AND FRONT PASSENGER SEAT BELT FASTENERS (NHTSA RECALL 20V-378).  THE NOTICES ARE DATED 29 AUG 2020 AND 9 DEC 2020.  I HAVE CALLED THE LOCAL VOLVO DEALER REPEATEDLY TO SCHEDULE FOR COMPLETION OF THIS RECALL.  EACH TIME THEY SAY THEY DO NOT HAVE THE PARTS AND APOLOGIZE.  IN THE MEANWHILE, THE RISK OF THE SEAT BELT FAILING PERSISTS.  MORE THAN SIX MONTHS HAVE PASSED SINCE THE INITIAL NOTICE WHICH I CONSIDER TO BE AN EXCESSIVE PERIOD OF TIME.  WHAT CAN BE DONE TO EXPEDITE THE COMPLETION OF THIS RECALL?  ANY ADVICE YOU CAN PROVIDE, OR ACTIONS YOU COULD TAKE WOULD BE APPRECIATED. THANK YOU FOR CONSIDERATION OF THIS REQUEST. [XXX] CINCINNATI, OH [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "YV4952DZ5E2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383501,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 VOLVO XC60. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V378000 (SEAT BELTS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. BILL PEARCE VOLVO CARS (11555 S VIRGINIA ST, RENO, NV 89511, (775) 337-9653) WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "YV4902DZ8E2"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298172,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE A WEEK AGO, I USED THE EMERGENCY BRAKE WHICH I USE WHEN I PARK IN MY DRIVEWAY BECAUSE IT'S SLANTED. WELL AFTER THE FIRST TIME I DISENGAGED IT WENT TO DRIVE AND HEARD A WEIRD NOISE WHEN COMING TO A STOP WHICH ONLY GOT WORSE. I BROUGHT IT BACK TO THE DEALER TO FIND OUT THAT THE E-BRAKE NEVER FULLY DISENGAGED ON THE RIGHT SIDE ONLY. I WAS ABLE TO GET THE ENTIRE ASSEMBLY REPLACED BUT NOW I'M NOT COMFORTABLE USING THE E BRAKE AT ALL OUT OF FEAR IT WILL DESTROY ANOTHER ASSEMBLY. ALSO SINCE I GOT IT BACK I HAVE NOTICED WEIRD ELECTRICAL ISSUES LIKE ALL MY 12V SOCKETS ARE OUT OR I COME TO A STOP AT A RED LIGHT 2 CAR LENGTHS AWAY AND ALL MY BLIND SPOT SENSORS GO OFF FOR LIKE 30 SECONDS THEN STOP.",
        "vin": "YV4952DL1E2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244892,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC INSTRUMENT CLUSTER FAILURE RENDERED VEHICLE SPEED AND OTHER CHARACTERISTICS INOPERABLE.  THERE IS NO BACKUP ANALOG CLUSTER IN THIS VEHICLE, SO THERE WAS NO WAY TO DETERMINE VEHICLE SPEED.",
        "vin": "YV4952DL6E2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232225,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JUNE 2018, I RECEIVED A LOW OIL LIGHT ALERT.  AUTO WAS 2.QUARTS LOW IN OIL.  DEALERSHIP STATED THAT IT WAS A SOFTWARE /DIPSTICK ISSUE.  AUTO WAS REPAIRED.  JUNE 2019, LOW OIL LIGHT ALERT AGAIN.  AUTO WAS 2.5 QUARTS LOW IN OIL.  DEALERSHIP  FOUND  CYLINDER LEAK, INSPECTED SPARK PLUGS, AND INSPECTED VALVE COVER GASKET.  LEAK WAS CAUSED BY POOR SEAL ON VALVE COVER.  DEALERSHIP REPLACED VALVE COVER GASKET AND SPARK PLUGS.",
        "vin": "YV4902DZ5E2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "09/22/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811573,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 VOLVO XC60. THE CONTACT STATED THAT WHILE TURNING THE VEHICLE, THE ENGINE STALLED. THE VEHICLE WAS ABLE TO RESTART. IN ADDITION, THE CONTACT MENTIONED THE VEHICLE WAS JERKING WHILE THE GEAR WAS SHIFTING. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE VEHICLE NEEDED A SOFTWARE UPGRADE. THE VEHICLE WAS REPAIRED BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 13,219.",
        "vin": "YV4940DL2E2"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633335,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS OPERATING A VERY BRAND NEW 2014 XC - OWNED FOR 6 WEEKS - WHEN DRIVING IT ON A HIGHWAY IT BEGAN TO FRIGHTENINGLY SLOW DOWN AND SPUTTER. SHE WAS ABLE TO GET IT OFF THE HIGHWAY, AND IT TURNED OUT THE CAR HAD RUN OUT OF GAS. HOWEVER: THE COMPUTER FUEL GAUGE STILL SHOWED ALMOST HALF A TANK REMAINING. THIS WAS OBVIOUSLY A SCARY INCIDENT. THE CAR WAS THEN TAKEN TO THE DEALER FOR REPAIR, REPLACING THE GAUGE DID NOT WORK, AND THEN THEY HAD TO REPLACE THE GAS TANK IN ITS ENTIRETY TO REPAIR THE ISSUE.   *TR",
        "vin": "YV4902DZ9E2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2014",
        "dateOfIncident": "06/25/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631272,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 25 NEW CAR, MILEAGE 6844. ENGINE OIL LIGHT ON. DOWN 1.5 QT. OIL DEALER LOOKS FOR LEAKS FINDS NONE PERFORMS OIL CHANGE. SCHEDULES VEHICLE IN FOR DIAGNOSTICS. CAR SERVICED JULY 7 UNTIL JULY 14 MILEAGE 7313 TWO PAGES OF PARTS REPLACED. SEPTEMBER 3 CAR RETURNED TO DEALER ENGINE OIL LIGHT ON AGAIN MILEAGE BETWEEN TWO PAGE REPAIR AND 3 RD REPAIR LESS THAN 2000 MILES. VEHICLE IN AT 9384 . SUGGESTED REPAIR BY VOLVO NEW ENGINE.  *TR",
        "vin": "YV4902DZ1E2"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "07/06/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10615386,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM COMPLAINING ABOUT UNINTENDED ACCELERATION RECENTLY EXPERIENCED WHILE PARKING MY CAR IN A PARKING LOT AND THE MANUFACTURING CANNOT TELL ME IF AND WHEN ANY RECALLS WERE UPDATED ON MY CAR PRIOR TO PURCHASE. THE CAR STARTED ACCELERATING AFTER I REMOVED MY FOOT FROM ACCELERATOR AND STARTED TO BREAK INTO A STOP SO I COULD PARK THE CAR IN THE PARKING LOT.  BECAUSE THE CAR LURCHED FORWARD IN FULL THROTTLE IT CAUSED ME TO CRASH INTO THE BRICK BUILDING.  THE HIGH VROOM NOISE STARTED AS SOON AS I TURNED INTO THE PARKING SPOT AND STARTED TO BREAK. THE AUTOMATIC BREAKING SYSTEM NEVER ENGAGED WHICH IN THIS MODEL SHOULD HAVE PREVENTED THE CRASH.  THE BREAKS WERE OF NO USE SINCE THE HIGH SPEED IN LESS THAN 4 FEET OF THE PARKING SPOT AND WALL.  THE CAR IS NEW WITH ONLY ABOUT 1200-1300 MILES AND I AM BEING TOLD THAT IT WAS MY FAULT WHEN I KNOW IT WAS ELECTRONIC FAILURE CONTROLLING THE ACCELERATION.  THE DAY BEFORE IN A PARK POSITION ON A SUNNY DAY THE WIPERS WENT ON AUTOMATICALLY AND I HAD TROUBLE MAKING THEM STOP.  WEDNESDAY AND THURSDAY PRIOR TO THE ACCIDENT THE SIDE MIRRORS KEPT AUTOMATICALLY ON THEIR OWN MOVE TO A DOWNWARD POSITION MAKING IT DANGEROUS TO DRIVE AND I HAD TO MANUALLY OVERRIDE IT SEVERAL TIMES TO BE IN THE RIGHT POSITION.  EVEN WHEN I ADJUSTED THE SIDE MIRRORS THEY WOULD MOVE DOWNWARD WHILE I DROVE FORCING ME TO READJUST THE MIRRORS. IN ADDITION MY FRONT SEAT WOULD GET REPROGRAMMED WHEN I EXITED THE CAR AT LEAST EVERY OTHER TIME I WOULD EXIT.  I WAS PLANNING ON TAKING THE CAR INTO THE DEALERSHIP AFTER THE HOLIDAY WEEKEND BUT THE ACCIDENT HAPPENED THAT WEEKEND.  PLEASE INVESTIGATE SINCE THE PRIOR ELECTRICAL PROBLEMS COULD BE INDICATORS TO FUTURE PROBLEMS THOUGH THE PROBLEMS WERE INTERMITTENT - WINDSHIELD WIPERS ON WHEN NOT INTENDED, SIDE MIRRORS MOVING WHEN NOT INTENDED AND MY FRONT SEAT REPROGRAMMING WHEN NOT INTENDED.   *TR",
        "vin": "YV4902DZ9E2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/24/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594212,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2014 VOLVO XC60.  I COULD FEEL THE CAR STOPPING.  LUCKILY I WAS ON A LOCAL ROAD AND WAS ABLE TO PULL INTO A PARKING LOT WITHOUT INCIDENT.  THE VOLVO HAD RUN OUT OF GAS, BUT THE FUEL GAUGE WAS SHOWING THAT MY TANK WAS MORE THAN HALF WAY FULL.  THIS IS THE SECOND TIME THAT I HAVE HAD THIS PROBLEM WITH THE CAR, AND THIS IS MY SECOND REPORT.  THE CONFIRMATION NUMBER FROM MY PREVIOUS COMPLAINT WAS 10569092.  *TR",
        "vin": "YV4902DZ7E2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/13/2014",
        "dateOfIncident": "03/05/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569092,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2014 VOLVO XC60, I STOPPED AT A RED LIGHT AND STARTED TO FEEL A VIBRATION IN THE CAR.  WHEN THE LIGHT TURNED GREEN, I PRESSED ON THE ACCELERATOR AND A WARNING CAME UP THAT I NEEDED TO EITHER SLOW DOWN OR DOWN SHIFT.  I BEGAN TO MOVE TO THE RIGHT LANE AND THEN MY CAR STOPPED.  AFTER RECEIVING A TOW TO THE DEALER, I WAS TOLD THAT IT WAS A SOFTWARE PROBLEM THAT CAUSED MY CAR TO NOT DISPLAY AN ACCURATE AMOUNT OF FUEL AND I WAS OUT OF GAS.  THEY UPGRADED MY SOFTWARE AND IT FIXED THE PROBLEM, BUT IT WAS NOT A MANDATORY UPGRADE AND WAS NOT MADE AWARE OF IT UNTIL THE PROBLEM.  *TR",
        "vin": "YV4902DZ7E2"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "08/27/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544018,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC60",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VOLUME LEVEL OF THE LANE CHANGE WARNING SIGNAL IS EXTREMELY SOFT AND LARGELY UNDETECTABLE WITH BACKGROUND ROAD NOISES.   THIS PRESENTS A SAFETY ISSUE AS THE DRIVER IS NOT ALERTED TO INADVERTENT LANE CHANGES AS HE/SHE SHOULD BE.   I CAME PRETTY CLOSE TO HAVING AN ACCIDENT SINCE I HAD EXPECTED THE ALERT AND IT DID NOT OCCUR AT A VOLUME LEVEL THAT I COULD HEAR.   (I HAD A 2010 VOLVO XC60 WITH THIS SAME FEATURE BUT THE VOLUME LEVEL OF THE LANE CHANGE WARNING WAS MUCH LOUDER).  THE VOLVO DEALER CONFIRMS THAT THE VOLUME LEVEL OF THE LANE CHANGE WARNING IS NOT USER NOR DEALER ADJUSTABLE;  IT WILL REQUIRE A SOFTWARE UPGRADE BY VOLVO.    I HAVE INFORMED VOLVO CUSTOMER SERVICE OF THIS ISSUE.  THEY SAY THEY ARE AWARE, BUT COULD NOT PROVIDE ANY DATE FOR THE SOFTWARE UPGRADE TO FIX THIS IMPORTANT ISSUE.      SOME URGENCY NEEDS TO BE PROVIDED IN FIXING THIS AS IT IS A SIGNIFICANT SAFETY ISSUE.  *TR",
        "vin": "YV4952DL5E2"
    }
]