[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "03/02/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455029,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A6. The contact stated while driving 65 MPH, the oil warning light illuminated. The contact veered to the side of the road and called for roadside assistance. The vehicle was towed to a local dealer to be diagnosed. The contact was informed that the oil level was extremely low due to an oil leak. The contact was informed that the timing chain kit and camshaft cover needed to be replaced. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was 85,000.",
        "vin": "WAUDFAFC6FN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447108,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The car will randomly die without notice and then will not start.  There's an EC fault but no other identifiers and the car won't start for quite some time.  After sitting for a couple hours or more it will finally start.  It happens at a minimum of 1-2 times per month.",
        "vin": "WAUGFAFC2FN"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "12/17/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384223,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ARE GRABBY AND WITH A GENTLE DEPRESSION OF THE BRAKE PEDAL THE CAR COMES TO A SUDDEN JERKY STOP. USUALLY HAPPENS FROM SLOWING DOWN FROM 10MPH TO 0MPH  THE TRANSMISSION JERKS HARD WHEN SPEED DROPS FROM 15MPH  THE ENGINE ERRONEOUSLY SHOWS CHECK ENGINE LIGHT DURING NORMAL DRIVING. CYLINDERS SHOW OIL LEAKAGE REPEATEDLY. THIS HAS BECOME A REPEAT ISSUE AND HAVE ASKED THE DEALER / SERVICE CENTER TO REPORT THIS AS A MANUFACTURING ISSUE",
        "vin": "WAUGFAFC3FN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341874,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE MOUNTS ARE LEAKING AND NEED TO BE REPLACED.  ONLY 65K MILES AND CAR IS 5 YEARS OLD - GARAGE KEPT.",
        "vin": "WAUGFAFC9FN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278672,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT THERE WAS A FLASH FLOOD ON A KNOWN FLOOD ROAD. AFTER PROCEEDING THROUGH WHAT WAS MAYBE 6\"-12\" OF WATER, VEHICLE'S AMBER STEERING DEFECTIVE WARNING LIGHT APPEARED WITH THE NOTIFICATION STATING THAT THE VEHICLE WAS SAFE TO DRIVE. THE NEXT DAY WHILE DRIVING, THE AMBER STEERING DEFECTIVE LIGHT TURNED RED WITH A NOTIFICATION STATING NOT TO DRIVE THE VEHICLE. UPON THIS HAPPENING, THE VEHICLE LOST ALL POWER STEERING, TPMS FAULT, STABILIZATION FAULT, AND ACC BRAKING GUARD FAULT APPEARED. THANKFULLY, I WAS NOT DRIVING TO WORK THAT MORNING AND WAS GOING LESS THAN 30MPH RATHER THAN 70MPH. AUDI SERVICE ADVISOR STATES THAT THERE ISN'T A WAY THAT THIS WAS CAUSED DUE TO WATER DAMAGE. I DISAGREE. I BELIEVE WATER ENTERED THE STEERING MODULE (EVEN THOUGH THIS IS SUPPOSED TO BE A SEALED UNIT) AND CAUSED AN ELECTRICAL SHORT TO THE MODULE. DUE TO THE FACT THAT THE SERVICE ADVISOR RELAYED HIS SUPPOSED FINDINGS TO THE INSURANCE ADJUSTER. I AM CURRENTLY LIABLE FOR THE REPAIRS ON THE VEHICLE.",
        "vin": "WAUHGAFC1FN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184510,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER WAS NOTIFIED OF SAFETY RECALL 19N4 - DISCONNECT ELECTRIC COOLANT PUMP AND HAD THE RECALL SERVICE PERFORMED ON 29 DEC 2018. OWNER WAS INFORMED THAT AN ADDITIONAL SAFETY RECALL (19O2) WILL REPLACE THE COOLANT PUMP WITH A NEW ONE.  ON 04 MARCH 2019, WE CALLED AUDI USA AND WERE TOLD THAT THE REPLACEMENT WAS NOT YET AVAILABLE.      THE COOLANT PUMP ALSO AIDS IN PROVIDING ADDITIONAL CABIN HEAT WHICH IS IMPORTANT DURING THE WINTER MONTHS FOR THE COMFORT AND SAFETY OF OCCUPANTS IN THE VEHICLE.     DUE TO THE PUMP BEING DISCONNECTED, THE CABIN HAS BEEN VERY SLOW TO WARN, INCLUDING THE WINDOW DEFROSTERS. THIS PRESENTS AN EXTREME SAFETY ISSUE ESPECIALLY DURING THE WINTER MONTHS.    IT ALSO PRESENTS A POSSIBLE DAMAGE ISSUE SINCE THE AFTER COOLANT PUMP IS USED TO ALLEVIATE HEAT FROM THE TURBOCHARGER.    AUDI USA STATED ON 04 MARCH 2019 THAT THE NEW COOLANT PUMPS WILL BE AVAILABLE SOMETIME IN THE FUTURE.",
        "vin": "WAUGFAFC4FN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171485,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IM AN ACTIVE DUTY MILITARY SERVICE MEMBER STATIONED OVERSEAS IN SOUTH KOREA. I CURRENTLY OWN A 2015 AUDI A6. I WAS RECENTLY NOTIFIED THAT MY VEHICLE HAD 2 RECALLS PLACED, SPECIFICALLY ON THE ELECTRIC COOLANT PUMP AND ON THE PASSENGER OCCUPANT DETECTION SYSTEM (PODS). I VISITED MY LOCAL AUDI DEALERSHIP IN KOREA AND THE AUDI STAFF SAID THAT THEY CANNOT FIX OR REPAIR THE ISSUE SINCE IT IS A U.S. SPECIFIC RECALL. I CALLED THE U.S. AUDI SERVICE DESK AND THEY ALSO SAID THAT THEY CANNOT HELP WITH THE ISSUE AND TOLD ME TO CHECK WITH NHTSA. I FULLY UNDERSTAND THE LIMITATIONS IN THIS MATTER BUT I DO WANT TO APPEAL THAT THERE ARE SEVERAL MILITARY MEMBERS IN THE SAME SITUATION. AS A SERVICE MEMBER, HUSBAND, AND A FATHER, I AM DEEPLY CONCERNED ABOUT THE SAFETY OF MY CAR. I SINCERELY WANTED TO REACH OUT AND SEE IF THERE IS ANY POSSIBLE WAY TO RESOLVE THIS ISSUE OVERSEAS. YOUR THOUGHTS IN THIS MATTER WILL BE DEEPLY APPRECIATED, THANK YOU VERY MUCH FOR YOUR TIME.  *TR",
        "vin": "WAUGFAFC6FN"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120016,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M EXTREMELY FRUSTRATED AND DISAPPOINTED IN OUR CHECK AND BALANCES WITH AUDI AND THESE SAFETY RECALLS. I OWN A 2015 AUDI A6, BACK IN JUNE I FOUND THAT THERE ARE TWO SAFETY RECALLS WITH THE FRONT AIRBAGS THAT HAVE KILLED 20 AND INJURED OVER 100 PEOPLE. I'VE DONE A LOT OF RESEARCH. THE AIRBAGS ARE MORE LIKELY TO EXPLODE IN HOT STATES AND I'M LOCATED IN SOCAL, PARTICULARLY THE VALLEY, WHICH IS THE HOTTEST PART OF LA, REACHING 100 DEGREES + THROUGHOUT THE SUMMER. I'VE TRIED TO RESOLVE THIS WITH AUDI, BUT THE PARTS ARE NOT AVAILABLE AND THEY HAVE NO IDEA WHEN IT WILL BE AVAILABLE; THE HOPE IS OCTOBER, BUT I WAS TOLD AUGUST BEFORE. MY PASSENGER SIDE AIRBAG IS OFTEN DISABLED AUTOMATICALLY WHEN THERE IS A PASSENGER IN MY CAR, THE LIGHT COMES ON AND OFF AT THE WRONG TIMES!!!. YOU CAN IMAGINE HOW ON EDGE I FEEL ABOUT DRIVING AROUND, GOING TO WORK, HAVING MY CHILD, OR FAMILY IN THE CAR... ITS SCARY. NO DEALERSHIP WILL BUY THIS CAR BACK BECAUSE IT CANNOT SALE WITH AN OPEN RECALL, AND OR IT MAKES IT HARDER. ADDITIONALLY, THE CAR WON'T PRIVATELY SALE EITHER BECAUSE THERE IS THIS OPEN SERIOUS RECALL THAT CURRENTLY CANNOT BE FIXED, AS I'VE TRIED. I REQUESTED THAT AUDI GIVE ME THE KELLY BLUE BOOK VALUE OF THE CAR BECAUSE IT IS UNSAFE, THEIR RESPONSE WAS NOT TO HAVE PEOPLE IN THE FRONT SEATS, WHICH DOESN'T MAKE SINCE BECAUSE I HAVE TO DRIVE. ADDITIONALLY, I'M PAYING ALOT OF MONEY, NOT TO USE MY FRONT SEAT? THAT'S 1/4 OF MY CAR. I'M NOT ASKING FOR MUCH, BUT I WANT TO GET OUT OF AN UNSAFE CAR THAT DOESN'T HAVE A DATE FOR REPAIR ANYTIME SOON. I'M MORTIFIED EVERY TIME I DRIVE, READING THE STORIES OF THE PEOPLE WHO'VE DIED BECAUSE THE AIRBAGS MALFUNCTIONED AND OR BLEW UP. CAR MANUFACTURES SHOULD BE HELD ACCOUNTABLE WHEN THEY PUT THE PUBLIC SAFETY AT RISK. THEY SHOULD ALSO HAVE STRICT TIME FRAMES TO REPAIR OR PAY DAMAGES OR AT LEAST OFFER RENTALS. WHAT CAN BE DONE TO RESOLVE THIS FAST?",
        "vin": "WAUCFAFC8FN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104079,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A6. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE MADE AN ABNORMAL NOISE. THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME SYMPTOMS AS LISTED IN TSB: 401548. THE VEHICLE WAS TAKEN TO KANSAS CITY AUDI (10330 MADISON AVE, KANSAS CITY, MO 64114) WHERE IT WAS DIAGNOSED THAT THE WHEEL BEARING NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THERE WAS NO RECALL ON THE VEHICLE.  THE FAILURE MILEAGE WAS APPROXIMATELY 71,000.",
        "vin": "WAUGFAFC8FN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "05/28/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101645,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A6. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (AUDI NORTH ORLANDO, 139 N. OREGON ST., SANFORD, FL 32771) AND WAS REFERRED TO NHTSA. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  *TR",
        "vin": "WAUGFAFCXFN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/13/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062628,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE HIGHWAY, MY A6 TURNED PERPENDICULAR AND WAS HIT BY A SEMI TRUCK.  SPEAKING WITH THE AUDI REPRESENTATIVES THEY DID NOT UNDERSTAND HOW THIS COULD HAPPEN. IS THERE A DEFECT THAT WOULD ALLOW THE CAR WITH A QUATTRO SYSTEM TO MAKE SUCH A DRAMATIC TURN TRAVELLING AT 60 MILES AN HOUR?",
        "vin": "WAUGFAFC0FN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/26/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056629,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  DEALERSHIP INDICATES THAT THIS REPLACEMENT PRODUCT IS NOT AVAILABLE ANYWHERE TO HAVE IT FIXED.",
        "vin": "WAUDG74F35N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024530,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A LETTER FROM AUDI OF AMERICA DATED MARCH 2017 CALLED DEALER IN BLOOMFIELD IN MICHIGAN LAVERY AUDI REPORTED THIS LETTER BUT UP NOW SEPTEMBER 19, 2017 HAVE NOT HARD FROM THEM. HOW LONG SHOULD I WAIT UNTIL THIS PROBLEM RESOLVED.",
        "vin": "WAUDG74F35N"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/20/2015",
        "dateOfIncident": "09/20/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10765794,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHIBITS AN ALARMING TENDENCY TO WEAVE FROM SIDE TO SIDE WITHOUT A STEERING INPUT. THIS OCCURS WITHOUT A CHANGE IN STEERING WHEEL POSITION, VEHICLE SPEED, OR CHANGE IN ROAD SURFACE OR PREVAILING WIND DIRECTION. IT IS MORE PRONOUNCED AT HIGHWAY SPEEDS AND WHEN WHEEL IS CENTERED AT 12 O'CLOCK BUT DOES OCCUR AT ALL SPEEDS AND STEERING VECTORS. AUDI DEALERSHIP NOTES THE PROBLEM AND BLAMES THE NEW ELECTRIC STEERING SYSTEM BUT STATES IT IS A \"CHARACTERISTIC\" OF THE SYSTEM AND IS NOT A DEFECT. I DISAGREE AND FEEL ANY DIRECTION CHANGE IN A VEHICLE WITHOUT A DRIVER INPUT OR A EXPLAINABLE EXTERNAL FACTOR CONSTITUTES A POTENTIAL SAFETY ISSUE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/25/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712887,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI BRAKE GUARD ACTIVATED SPONTANEOUSLY BECAUSE THE CAR SENSED AN IMPENDING IMPACT WITH A VEHICLE IN FRONT OF ME.  HOWEVER, THERE WAS NO VEHICLE IN FRONT OF ME, BUT THE BRAKE GUARD APPLIED STRONG BRAKING ACTION ON AN OPEN ROAD, BRINGING ME TO AN IMMEDIATE STOP.  HAD THERE BEEN A CAR BEHIND ME, IT WOULD HAVE LIKELY HIT MY VEHICLE, SINCE I CAME TO A SUDDEN STOP ON AN UNOBSTRUCTED ROADWAY FOR NO REASON.  *TR",
        "vin": "WAUHMAFC8FN"
    }
]