[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442215,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Torque converter shutter at speeds of 30mph - 45mph causing erratic acceleration fluctuations.   I addressed the concern with the dealership at around 72,000 miles (just out of manufacturers warranty). I told there was a fluid recall. They changed the fluid which remedies the issue.  The transmission fluid has to be changed every 5,000-10,000 for the vehicle to perform with a less noticeable transmission shudder. Manufacturers recommends changing every 30,000 miles to prevent transmission slipping.  I did contact Acura and they dismissed my concerns, stating I drove the vehicle too much. After researching online this seems to be a common concern/problem other Acura MDX owners are experiencing.",
        "vin": "5fryd4h49fb"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414706,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CAR IS SHIFTING IDLE HANGS AND SHUTTERS AROUND 1600-2000 RPM. LEFT FRONT AND REAR SHOCKS HAVE LOUD NOISES WHEN TRAVELING OVER BUMPS.",
        "vin": "5FRYD4H47FB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383219,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "APPEARS TO HAVE ISSUES SHIFTING FROM D4 TO D5 OR WHILE IN D5. ROUGHLY AROUND 1.6K RPM THE VEHICLE SOUNDS LIKE IT IS DRIVING OVER RUMBLE STRIPS. I THINK IT MIGHT BE A TORQUE CONVERTER PROBLEM.",
        "vin": "5FRYD3H24FB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348639,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS ,AND HESITATES TO SHIFT  NORMALLY AND THEN GOES NORMAL AGAIN. VEHICLE IS IN MOTION WHEN THIS OCCURED ,IT HAPPENED WHILE  CRUSING AT 35 MPH, AND AT 50 MPH, STREET ,AND HIGHWAY.      .",
        "vin": "5FRYD3H42FB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331362,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING SLOWLY (IE PARKING LOTS), THERE IS KNOCKING/CREAKING SOUND HEARD ON THE DRIVER'S SIDE.  DEALER CONFIRMED NOISE BUT NOT ABLE TO SAY EXACTLY WHAT IS WRONG OR WHY OTHER THAN TO SAY THAT IT NEEDS FRONTS AXLES ON BOTH SIDES REPLACED AT COST OF $1200+.  IN MY OPINION, THEY DIDN'T PROPERLY DIAGNOSE IT (AND REALLY ARE JUST GUESSING AT PROBLEM).  THEY ONLY TEST DROVE IT AND THAT IS NOT ONLY WAY TO DIAGNOSE PROBLEM WITH VEHICLE.  IT APPEARS TO BE A PRODUCT QUALITY ISSUE IN MANUFACTURING.  THE CAR IS 5 YEARS OLD AND HAS 70,000 MILES. ALL SIGNS SHOWED THAT IT HAS BEEN TAKEN CARE OF BY PREVIOUS OWNER AND NOW BY ME.  I HAVE HAD IT FOR ABOUT YEAR WHEN IT HAD 65000 MILE.  AT THIS STAGE OF ITS LIFE, IT SHOULD NOT NEED AXLES REPLACED.  IF THIS WAS A GM CAR, I'D SAID THAT'S PROBABLY TRUE BUT THIS IS AN ACURA WE ARE TALKING ABOUT.  THE CAR HAS NOT EVEN BEEN BROKEN INTO AT THIS MILEAGE.",
        "vin": "5FRYD4H49FB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/09/2020",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320641,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 80 MPH ON THE HIGHWAY WHEN THE PASSENGER SIDE WINDSHIELD GARNISH FLEW OFF THE CAR. AFTER INSPECTION, IT APPEARS THE CLIPS THAT HOLD THE GARNISH ON WERE BROKEN.",
        "vin": "5FRYD4H49FB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 01/18/2020. I CAN NOT START MY 2015 ACURA MDX ANYMORE WHEN I WAS ON THE WALMART PARKING LOT, POWER STEERING SYSTEM ( EPS) PROBLEM \" LIGHT WAS ON, THE STEERING WHEEL WAS LOCKED UP. THE CAR HAS 61,035 MILES.",
        "vin": "5FRYD4H81FB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258246,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUDDERS AT 35-40 MPH, THE SHUDDERING IS HARDER WHEN GOING UP A SLIGHT INCLINE. IT SEEMS THAT THE VEHICLE DOESN'T WANT TO SHIFT DOWN A GEAR. I HAVE TO EITHER LET GO OF THE GAS OR GIVE IT MORE GAS FOR THE SHUDDERING TO STOP.",
        "vin": "5FRYD4H61FB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "03/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184340,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON PARTICULARLY COLD DAYS IN TEXAS BETWEEN 30 AND 45 DEGREES FAHRENHEIT, MY ACURA WILL NOT START.  THE ELECTRONIC COMPONENTS WORK, BUT THE ENGINE REVS UP FOR ABOUT 5 SECONDS THEN IT TURNS OFF. AFTER THAT THE WARNING LIGHTS FOR STABILITY CONTROL, POWER STEERING EPS, LANE DEPARTURE ASSIST, CHECK ENGINE LIGHT, EMISSION SYSTEMS, HILL START ASSIST, COME ON AND STAY ON BUT THE ENGINE IS OFF. AFTER I TRY TO TURN IT ON AND TURN IT OFF COMPLETELY FOR OVER FIVE TIMES, THEN THE ENGINE CAME ON AND THE MDX WAS DRIVEABLE. WHILE WE DROVE, THE WARNING LIGHTS STAYED ON. WHEN WE GOT TO OUR DESTINATION, WHICH WAS ABOUT 3 MILES, TURNED OFF THE CAR, AND THEN TURNED IT BACK ON, ALL THE WARNING SIGNS WERE GONE. THIS IS THE SECOND TIME IT HAPPENS, THE FIRST TIME IT HAPPENED WAS ABOUT THREE MONTHS AGO. THE NIGHT BEFORE, THE BLINKERS WERE ACTING UP. THE LEFT BLINKER SIGNAL INSIDE, WAS SOLID GREEN AND THE SIGNAL LIGHT OUTSIDE WAS FLASHING VERY DIMMLY AND SLOW, THE CLICKING SOUND TO ALERT THAT THE SIGNS LIGHT WAS ON WAS NOT CLICKING. THE RIGHT BLINKER SIGNAL INSIDE FLASHED BUT DID NOT MAKE THE CLICKING SOUND TO ALERT THAT IT IS ON, THE LIGHT OUTSIDE BLINKED NORMALLY. TODAY EVERYTHING IS BACK TO NORMAL.",
        "vin": "5FRYD3H80FB"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166773,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT OUR 2015 ACURA MDX LESS THEN 6 MONTHS AGO FROM A CERTIFIED USED ACURA DEALER. LAST WEEK, THE EMS, POWER STEERING AND TRANSMISSION LIGHT CAME ON.  CAR STAYS IN FIRST GEAR AND JERKS WHILE DRIVING. SPEEDOMETER IS WEIRD. BROUGHT TO ACURA DEALER, OF COURSE THE LIGHTS WERE OFF BY THEN. WAS TOLD WE NEED TO DO SPECIAL TRANSMISSION FLUSH. A WEEK LATER LIGHTS ARE LOL BACK ON! I DRIVE MY KIDS TO AND FROM SCHOOL AND DON'T FEEL SAFE ANYMORE WITH MY CAR",
        "vin": "5FRYD3H28FB"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165618,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "1. ENGINE EMMISION PROBLEM INDIACTOR -  ACURA MAINTANANCE PERSONAL TOLD ME THAT THE WARNING IS BECAUSE OF THE CATALYST SYSTEM EFFICIENCY IS BELOW THRESHOLD NUMBERS AND THEY GOING ADJUST THE SOFTWARE TO INCREASE THE THRESHOLD AND I SHOULD PAY FOR THE UPDATE.    2. STEERING COLUMN SCREECHES OR SQUEALS WHEN IT IS ADJUSTED.",
        "vin": "5FRYD4H68FB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "11/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150754,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPS ACCELERATING WHILE DRIVING AND LOSES POWER WITHOUT WARNING.  MULTIPLE ENGINE LIGHTS GO OFF:  CHECK ENGINE, EMISSION SYSTEM PROBLEM, ALL WHEEL DRIVE SYSTEM PROBLEM, POWER STEERING SYSTEM EPS PROBLEM, VEHICLE STABILITY ASSIST VSA PROBLEM, HILL START ASSIST PROBLEM, TRAILER STABILITY ASSIST PROBLEM.  CAR STARTS SMOKING EXCESSIVELY.  RETURNED TO THE DEALER SEVERAL TIMES IN JUST A FEW DAYS AND THEY HAVE NOT BEEN ABLE TO DIAGNOSE THE PROBLEM.  PROBLEM APPEARS TO RESOLVE AND THEN RETURNS AFTER DRIVING NO MORE THAN 10 MILES.  INCIDENTS HAVE OCCURRED WHILE OPERATING THE VEHICLE IN 45 MPH SPEED ZONES WHERE WE HAD THE ABILITY TO PULL OVER AND GET OUT OF TRAFFIC.  THIS WILL BE CATASTROPHIC IF DRIVING ON THE HIGHWAY AS THE EFFECT OF THIS MALFUNCTION IS EQUIVALENT TO HITTING THE BREAKS WHILE TRAVELING AT HIGH SPEED.  CAR IS CURRENTLY BACK WITH THE DEALERSHIP FOR THE 3RD TIME IN 4 DAYS.  ACURA MDX DRIVERS SHOULD BE ALERTED TO THIS PROBLEM IMMEDIATELY - IT HAPPENS WITH NO WARNING.",
        "vin": "5FRYD4H43FB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "10/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149574,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTED TO DRIVE 'JUMPY', THE LOCAL SHOP DID DIAGNOSE A TRANSMISSION ISSUE ABOUT WHICH ACURA HAD A SERVICE BULLETIN- AT LOW SPEED OR AT SUDDEN ACCELERATION CAR WOULD DRIVE UNEVEN, INTERRUPTED; AT CONSTANT HWY SPEED THERE WOULD NOT BE A PROBLEM; CHECK ENGINE LIGHT TURNED ON EMISSION SYSTEM PROBLEM. LOCAL SHOP DID REGULAR MAINTAINENCE AS THE SERVICE LIGHT HAD TURNED ON, DIAGNOSED THE FAULT IN CONCORDANCE TO ACURA'S OWN SERVICE BULLETIN HOWEVER UPON TRAVEL TO ACURA DEALERSHIP THIS WAS 'NOT REPRODUCIBLE'. UPON RETURNING HOME CAR STARTED AGAIN TO INTERRUPT WITHOUT CHECK ENGINE LIGHT ON. DIAL OF RPM JUMPS UP AND DOWN WITHOUT REMAINING EVEN ATA CONSTANT SPEED.  CAR HAS NEW SPARK PLUGS, OIL, FILTERS, HOWEVER THE LOCAL SHOP HAS DEFERRED THE REST FOR THE DEALERSHIP. ACURA DEALER IN SAVANNAH EXPLAINED THAT THE ISSUE IS IN FACT NOT A 'RECALL' AND I SHOULD BRING THE CAR BACK IF IT DOES THE SAME. HOWEVER PER BULLETIN THE COVERAGE LASTS FOR CARS UP TO 80K MILES AND MINE STARTED THIS AT 79+ AND BY THE TIME I WOULD DRIVE BACK TO THE NEAREST DEALERSHIP IT WOULD PROBABLY EXCEED 80K MILES, WHICH THEY SAID THEY WOULD TAKE INTO CONSIDERATION SHOULD THIS RECUR.  OBVIOUSLY THE ISSUE IS KNOWN BUT BECAUSE IT IS NOT A OFFICIAL 'RECALL' THEY WOULD DO NOTHING.",
        "vin": "5FRYD3H45FB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "02/15/2018",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128827,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD NUMEROUS PROBLEMS THROUGHOUT THE FIRST TWO YEARS OF OWNERSHIP, WHICH THE DEALERSHIP WAS VISITED FOR REPEATEDLY.  THESE PROBLEMS OCCURRED WHEN THE WEATHER WAS VERY COLD, USUALLY BELOW ZERO (F), AND INVOLVED MULTIPLE DISFUNCTIONAL SENSORS ALL DISPLAYING INOPERATIVE.  WHEN THESE SENSORS DISPLAYED ERRORS, THAT COMPONENT OF THE CAR WOULD NOT FUNCTION CORRECTLY.  (ONE TIME THERE WAS AN ISSUE WITH THE COLLISION MITIGATING SYSTEM, AND THE BRAKES AUTOMATICALLY ENGAGED ON AN ICY ROAD AT FULL SPEED--ANOTHER THERE WAS A PROBLEM WITH THE AWD WHICH TURNED THE VEHICLE INTO A FRONT WHEEL DRIVE OPERATION).  DEALERSHIP DISCOVERED AFTER MULTIPLE VISITS, AND WHEN WE TOLD THEM WE WERE GOING TO TRY TO PURSUE A LEMON LAW PROTECTION ON THE VEHICLE, THAT IT WAS A POWER CONTROL MODULE THAT WAS BAD.  THIS WAS REPLACED.  VEHICLE RAN MOSTLY ERROR FREE FOR SOME TIME AFTER.  ON THE MORNING OF 2/15/2018, THE VEHICLE WAS STARTED IN ORDER TO WARM UP.  WHILE PARKED WITH THE ENGINE RUNNING, VEHICLE CAUGHT ON FIRE SOMEWHERE BEHIND THE DASH ON THE PASSENGER SIDE.  WE PUT THE FIRE OUT USING A FIRE EXTINGUISHER.  THANKFULLY, I WAS NOT DRIVING THE VEHICLE AS I WOULD HAVE BEEN 5 MINUTES LATER, AS I HAD NO FIRE EXTINGUISHER IN THE CAR; AND ALSO THANKFULLY THERE WAS NOT GOING TO BE A PASSENGER IF I HAD BEEN DRIVING, AS THE FLASH WAS IMMEDIATE AND INTENSE ON THE PASSENGER SIDE.  FURTHER, IT DID NOT CATCH OUR HOUSE OR SHOP ON FIRE WHEN IT WENT, AS IT COULD HAVE.  VEHICLE WAS A TOTAL LOSS.  DOCUMENTATION OF NUMEROUS PROBLEMS (RECEIPTS OF VISITS TO DEALERSHIP) AND PHOTOS OF DAMAGE TO CAR AFTER FIRE ARE AVAILABLE UPON REQUEST.",
        "vin": "5FRYD4H84FB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2018",
        "dateOfIncident": "03/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119473,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC SAFETY DOOR RELOCK FAULTY. THE REMOTE WAS USED TO UNLOCK THE DOORS. THE REAR DOOR WAS OPENED AND THE BABY WAS PLACED IN THE CAR SEAT. THE DIAPER BAG WAS THEN PLACED ON THE FLOOR OF THE BACK SEAT. DOORS AUTOMATICALLY RE-LOCKED AFTER 30 SECONDS WITH BABY AND CAR KEYS STUCK INSIDE. 911 WAS CALLED TO RESCUE THE BABY AND BUST OPEN THE DOOR. THIS SHOULD ABSOLUTELY NEVER HAPPEN. AFTER CHANGING THE SETTINGS TO 90 SECONDS, THE CAR STILL LOCKS AT 30. ACURA DENIES HEARING THIS HAPPEN. ACURA SAYS THERE IS NO WAY TO DISABLE THIS \"FEATURE\".",
        "vin": "5FRYD4H26FB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "07/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113640,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPENING THE AUTOMATIC TRUNK IT STARTS COMING AND FALLING DOWN RAPIDLY AS TO ALMOST HAVE OUR HEADS TRAPPED. IT'S A DEATH AND INJURY AWAITING TO HAPPEN. I HAVE CONTACTED BOTH ACURA DEALERSHIP AND ACURA CUSTOMER CARE AND THEY REFUSE TO NOTATE THIS SAFETY ISSUE AND RESOLVE. THEY WANT ME TO PAY FOR A NEW PART WHEN IN NO WAY DID WE CAUSE THIS MALFUNCTION TO OCURR.",
        "vin": "5FRYD3H29FB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096370,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. THE CONTACT STATED THAT THE LED HEADLAMPS FAILED TO FUNCTION IN GENERAL AND DURING INCLEMENT WEATHER. THE DEALER (MIKE HALE ACURA, 5601 STATE ST, MURRAY, UT 84107, (801) 263-0202) WAS CONTACTED SEVERAL TIMES TO REACH THE MANUFACTURER TO DETERMINE A SOLUTION. THE SERVICE CENTER MANAGER STATED THAT HE WOULD FURTHER ADDRESS THE MATTER; HOWEVER, AN APPOINTMENT HAD NOT YET BEEN SCHEDULED. THE MANUFACTURER WAS NOTIFIED. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089732,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS APPROACHING THE RED LIGHT ABOUT MAKE COMPLETE STOP , SUDDENLY MY CAR SHAKE VIOLENTLY  AND THEN THE ENGINES SHUT OFF, I HAVE TO PUT IT BACK INTO PARK START UP AGAIN, I START FOR COUPLES TIME BEFORE IT LET ME ENGAGE TO DRIVE MODE.  I TOOK THE CAR TO THE DEALER THEY CHECK BUT THEY FOUND NOTHING.  FEW DAYS LATER IT HAPPEN AGAIN.",
        "vin": "5FRYD4H45FB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11062332,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2015 ACURA MDX, WHICH I BOUGHT BRAND NEW. IT IS IN EXCELLENT CONDITION WITH LIMITED MILEAGE. TWO DAYS AGO WHILE I WAS DRIVING RIGHT BEFORE I REACHED MY HOUSE, SUDDENLY THERE WAS A LOUD EXPLOSION FROM MY LEFT SIDE. I STOPPED THE CAR AND FOUND THE LEFT SIDE MIRROR CASE COMPLETELY CRACKED WITH HOLES AND PIECES, HANGING BY THE WIRES THAT CONNECT IT TO THE REST OF THE UNIT.  THIS IS A SMALL NEIGHBORHOOD SITUATED AT A CUL DE SAC. THERE WERE NO TRAFFIC, DEER, BIKERS, OR BIRDS AT THE TIME.  I COULD NOT FIND ANY FALLING OBJECTS EXCEPT THE BROKEN PIECES FROM THE MIRROR CASE AND SOME LANDED 20 FEET AWAY.  I AM SURE IT WAS NOT SHOT BY ANY GUN.  IF I HAD NOT BEEN IN THE CAR WITH THE WINDOW CLOSED, I COULD HAVE EXPERIENCED SERIOUS INJURIES. IF SOMEONE HAPPENED TO BE NEAR THE MIRROR, THE PERSON'S FACE COULD HAVE BEEN BLOWN OFF.    THE NEXT DAY I CALLED THE ACURA CLIENT RELATIONS AND I WAS TOLD THEY HAVE NEVER HEARD OF THIS TYPE OF INCIDENT. HOWEVER, I CHECKED ONLINE AND FOUND A LIST OF ACURA CONSUMERS HAVE COMPLAINED ABOUT SIMILAR ISSUES SINCE 2006 AND ACURA HAD NEVER ADDRESSED THIS SAFETY ISSUE AND CONTINUES TO DISMISS OR DENY THE ISSUE (LINK: HTTP://WWW.MDXERS.ORG/FORUMS/14-PROBLEMS/25607-REAR-VIEW-MIRROR-LEAK-EXPLOSION-3.HTML). I AM NOW WORRIED ABOUT THE OTHER MIRROR MIGHT EXPLODE ONE DAY AND CAUSE SERIOUS SAFETY COMPLICATIONS.",
        "vin": "5FRYD4H47FB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058534,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE MONTHS AFTER OWNING THIS 2015 MDX MY POWER STEERING FAILED AS I WAS DRIVING (EPS FAILURE) AND MAKING A LEFT TURN. THIS CAUSES THE VEHICLE TO LOSE POWER STEERING MAKING IT ALMOST IMPOSSIBLE TO STEER. THIS SAME EPS FAILURE HAS OCCURRED 4 TIMES WITHIN 11 MONTHS WITH THE VEHICLE, ALWAYS WHEN TURNING LEFT. THE VEHICLE HAS APPROXIMATELY 33,000 MILES, THE FIRST TIME IT OCCURRED THERE WERE APPROXIMATELY 15,000 MILES ON IT. TWICE THIS HAPPENED IN PARKING LOTS AND TWICE IT HAPPENED WHEN DRIVING ON MAJOR ROADS WHILE TURNING. IT HAD TO BE TOWED ALL 4 TIMES AS THIS RENDERS IT UNDRIVEABLE AND UNSAFE.",
        "vin": "5FRYD4H44FB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "04/18/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034227,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. AFTER DRIVING OVER ANY ROAD SURFACE, AN ABNORMAL NOISE WAS HEARD. THE NOISE OCCURRED AT LOWER SPEEDS. THE VEHICLE WAS TAKEN TO NORRIS ACURA WEST (8559 BALTIMORE NATIONAL PIKE, ELLIOTT CITY, MD) WHERE IT WAS DIAGNOSED THAT THIS WAS A COMMON FAILURE THAT WAS INHERENT TO THIS VEHICLE MODEL. THE VEHICLE WAS ALSO TAKEN TO TISCHER ACURA (3506 LAUREL FORT MEADE RD, LAUREL, MD), BUT THE FAILURE COULD NOT BE REPLICATED. THE MANUFACTURER WAS CONTACTED, BUT DID NOT RESPOND. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS APPROXIMATELY 48,000.",
        "vin": "5FRYD4H88F3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "10/16/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034320,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EMISSIONS SYSTEM PROBLEM LIGHT IS COMING ON AND JUST WANTED TO SEE IF THERE IS A PROBLEM WITH THIS.",
        "vin": "5FRYD4H8XEB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022388,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING SYSTEM (EPS) PROBLEM. STEERING JAMMED. VERY HARD TO STEER.",
        "vin": "5FRYD4H48FB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020656,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS ENTRY COMMUNICATION ISSUE ON 2015 ACURA MDX   FOR REFERENCE, KEY FOB LOCATED IN PURSE. PURSE DRAPED OVER RIGHT SHOULDER AND RESTING AGAINST THE CAR DOOR, KEY FOB NOT SITTING NEXT TO A CELL PHONE. KEYLESS ENTRY WILL NOT UNLOCK WHEN HANDLE PULLED OR LOCK WHEN BUTTON ON DOOR HANDLED PUSHED WITH INDEX FINGER. TO SOLVE, KEY FOB MUST BE PULLED OUT OF MY PURSE AND LOCK/UNLOCK BUTTON PRESSED. MY PURSE MUST BE PLACED AGAINST THE TAILGATE DOOR LOCKING MECHANISM FOR THE SENSOR TO ACKNOWLEDGE THE SIGNAL AND UNLOCK. MY KEY IS IN EXACTLY THE SAME LOCATION IT WAS THE THREE YEARS I OWNED MY 2013 AUDI Q5. NO PROBLEMS WITH KEYLESS ENTRY. THIS IS A SAFETY ISSUE IF I NEED TO GET INTO MY CAR QUICKLY (E.G. DUE TO BEING FOLLOWED, FEELING UNSAFE IN A PARTICULAR LOCATION, NIGHTTIME IN A DARK PARKING LOT, PUTTING KIDS AND GROCERIES IN THE CAR, ETC.). I HAVE PUT ITEMS DOWN ON GROUND OR IN CART, UNZIP PURSE AND GET KEY FOB OUT.  DEALER REFUSING TO FIX PROBLEM BECAUSE THEY CANNOT REPLICATE. REFERENCE NHTSA ID NUMBER: 10945870; 10759256; 10725514",
        "vin": "5FRYD4H84FB"
    },
    {
        "components": "STEERING,SEATS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980532,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2015 ACURA MDX HAS BEEN AT THE DEALERSHIP 8 TIMES. OUR VEHICLE HAS BEEN OUT OF SERVICE FOR APPROXIMATELY 64 DAYS TOTAL. IT HAS BEEN AT THE DEALER FOR ELECTRICAL GLITCHES STARTING WITH SEATS, STEERING WHEEL, GPS AND FOR RAUTOMATIC BRAKING ISSUES.     STEERING WHEEL AND POWER SEATS REPEATEDLY NOT SETTING TO APPROPRIATE KEY FOB SETTINGS. CAR HAS BEEN TO DEALER FOR THIS ISSUE 4 TIMES. DEALER UNABLE TO REPRODUCE ISSUE OR SHOW \"TROUBLE CODES\" UNTIL 4TH TIME IN SHOP.     THE NEXT GLITCH MOVED INTO THE GPS SYSTEM AND CONTROLS ON GPS SCREEN. THE SCREEN REMAINED BRIGHT AT NIGHT. THE CONTROLS DISAPPEARED FROM SCREEN. THIS WAS VIDEO RECORDED.  THE DEALER STATED THIS MUST HAVE BEEN A GLITCH. THE DEALER STATED UNABLE TO REPRODUCE THE GLITCH. THE DEALER STATED NO \"TROUBLE CODE\" DETECTED ALTHOUGH IT WAS CLEARLY VIDEO RECORDED WITH DATE.     THE VEHICLE LOCKED THE BRAKES UP WHILE IN OPERATION WITH NO VEHICLE IN FRONT. THE OPERATOR WAS NEARLY IN A REAR END COLLISION HAD THE DRIVER BEHIND NOT BEEN FOLLOWING AT A SAFE DISTANCE. ON THE NEXT OCCASION, WHILE AT A RED LIGHT STOPPED, THE \"BRAKE\" WARNING CAME ON. THIS WARNING IS DESIGNED TO COME ON WHEN IN MOTION. OPERATOR WAS CONCERNED IF THE VEHICLE HAD BEEN IN MOTION AGAIN IT COULD HAVE CAUSED THE VEHICLE TO BRAKE SUDDENLY.  THESE INCIDENCES COULD HAVE CAUSED SERIOUS INJURY OR DEATH.     THE DEALERSHIP SIMPLY STATED THEY COULD NOT REPRODUCE THE EVENT AND STATED THE VEHICLE WAS OPERATING AS DESIGNED. OWNER SENT RECALL ARTICLES AS IT RELATED TO BRAKING ISSUE BUT WAS INFORMED VEHICLE DID NOT FALL UNDER RECALL. OWNER IS SIMPLY ILLUSTRATING WITH DETAILED NOTES AND VIDEOS THAT THE VEHICLE HAS ELECTRONIC ISSUES THAT VARY AND ULTIMATELY HAVE TURNED INTO SAFETY CONCERNS.     OWNER WANTED \"SAFETY CONCERN\" TO BE DOCUMENTED IN WORK ORDER BUT DEALER DID NOT DOCUMENT THIS AS SUCH. REQUESTED DEALER PUT US IN A SAFE CAR OF EQUAL VALUE. THEY REFUSED.",
        "vin": "5FRYD4HXFB0"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR MDX HAS HAD NUMEROUS INFOTAINMENT ISSUES. THE TAILGATE WILL OPEN WITHOUT BEING PRESENT ON SEVERAL OCCASIONS. DOORS WILL NOT UNLOCK ON OCCASION ON DRIVERS SIDE WITH KEY FOB. WIPERS WILL COME ON WITHOUT ANY MOISTURE ON VARIOUS TIMES. BRAKE WARNING LIGHT WILL COME ON WHILE DRIVING WITHOUT ANY TRAFFIC IN FRONT OF THE VEHICLE. REAR BRAKES WILL HANG UP AND THEN RELEASE WHILE MOVING SLOWLY.  *TR",
        "vin": "5FRYD4H40FB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "10/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927028,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CROSSCONTACT LX",
                "productYear": "9999",
                "size": "235/65R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX EQUIPPED WITH CONTINENTAL CROSSCONTACT LX SPORT TIRES, SIZE: 245/55/R919 103H (NA). THE CONTACT STATED THAT THE FRONT PASSENGER SIDE TIRE PREMATURELY DETERIORATED WITH HOLES AND GOUGES ON BOTH SIDES OF THE OUTER TREAD. IN ADDITION, THERE WAS AN ABNORMAL NOISE PROGRESSING FROM THE FRONT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER AND THE FRONT PASSENGER SIDE TIRE WAS REPLACED WITH A SPARE TIRE. THE TIRE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO A TIRE REPAIR SHOP WHO VISUALLY INSPECTED THE TIRES. THE TIRE SHOP PROVIDED NO WRITTEN INSPECTION AND DIAGNOSIS REGARDING THE CONDITION OF THE FRONT PASSENGER SIDE TIRE AS WELL AS THE OTHER THREE TIRES. THE CONTACT WAS INFORMED BY THE TIRE REPAIR SHOP TO CALL THE TIRE MANUFACTURER. THE TIRE MANUFACTURER PROVIDED NO ASSISTANCE. THE TIRE WAS TAKEN TO AN INDEPENDENT TIRE REPAIR SHOP WHO REMOVED THE TIRE FROM THE RIM. UPON FURTHER INSPECTION OF THE FRONT PASSENGER SIDE TIRE, IT WAS NOTICED THAT THE INNER TIRE WAS SHREDDED ALL THE WAY AROUND WITH A BLACK POWDERY SUBSTANCE ON THE INNER AND OUTER PART OF THE TIRE. THE CONTACT REPLACED ALL FOUR TIRES. THE TIRE AND VEHICLE FAILURE MILEAGE, DOT NUMBER, AND VIN WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2016",
        "dateOfIncident": "10/18/2016",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925103,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY (MORNING TRAFFIC MOVING AT SPEED LIMIT - 65-70 MPH) I SMELLED SMOKE.  IMMEDIATELY FOLLOWING THIS THERE WAS A THUD AND THEN THE CHECK ENGINE, LDW AND OTHER LIGHTS ILLUMINATED ON THE DASH, ALONG WITH AUDIBLE ALARM SOUND.  SMOKE WAS NOW VISIBLE, COMING FROM THE ENGINE (UNDER THE HOOD).  I WAS ABLE TO MOVE FROM THE MIDDLE LANE TO THE RIGHT LANE/EXIT LANE AS I KNEW I NEEDED TO PULL OVER IMMEDIATELY.  SINCE I WAS IN AN EXIT LANE THERE WAS NO REAL SHOULDER AND I STARTED DOWN THE EXIT RAMP.  THE SMOKE WAS VERY STRONG AT THIS POINT.  I WENT TO DEPRESS THE BRAKES TO SLOW DOWN ON THE EXIT RAMP AND TRY TO PULL THE CAR OVER BUT I HAD NO BRAKES.  THE BRAKE PEDAL WENT RIGHT TO THE FLOOR.  I HAD LIMITED STEERING CONTROL AND WAS DRIVING ERRATICALLY TRYING TO KEEP CONTROL OF THE CAR WHILE ON THE EXIT RAMP.  I TRIED TO PUT THE TRANSMISSION IN PARK - NO EFFECT TO SLOW THE CAR.  I TRIED TO POWER THE CAR OFF - DID NOT WORK.  I HAD TO DEPRESS THE EMERGENCY BRAKE TO STOP THE CAR.  IT TOOK OVER 100 FEET TO STOP THE CAR (LUCKILY NO OTHER CARS ON THE EXIT RAMP) AT WHICH POINT I COULD PULL OVER ON THE SIDE OF THE ROAD.  AT THIS POINT THERE WAS SMOKE BILLOWING OUT OF THE ENGINE AREA, SMOKE COMING IN TO THE CAR.  I CALLED 911 AND THEY RESPONDED IN ABOUT 5 MINUTES.  AFTER I GOT A SAFE DISTANCE FROM THE CAR I COULD SEE FLAMES COMING FROM THE BOTTOM OF THE ENGINE.  FROM THERE I COULD SEE THE FIRE START TO GROW IN THE ENGINE COMPARTMENT AND ONCE THE FIRE DEPT ARRIVED IT WAS ENGULFED IN FLAMES.  THE CAR HAS BEEN DEEMED A TOTAL LOSS BY MY INSURANCE COMPANY.  THIS IS A VERY CONCERNING SITUATION AS THE CAR HAD A MAJOR, CATASTROPHIC FAILURE WITH ESSENTIALLY NO WARNING, INCLUDING COMPLETE LOSS OF BRAKING AND SIGNIFICANT LOSS OF STEERING, FOLLOWED BY A FIRE.  THE CAR HAD LESS THAN 12K MILES AND WAS ABOUT ONE YEAR OLD.  NO ISSUES OR SERVICE OTHER THAN STANDARD MAINTENANCE.",
        "vin": "5FRYD4H81FB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "09/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911093,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. WHILE DRIVING 50 MPH, ALL THE WARNING INDICATORS ON THE INSTRUMENT CLUSTER ILLUMINATED AND THE VEHICLE BEGAN TO VIBRATE. THE VEHICLE WAS TAKEN TO A DEALER WHO WAS UNABLE TO DIAGNOSE OR REPAIR THE FAILURE. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 23,000.",
        "vin": "5FRYD4H43FB"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10894999,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. AFTER PARKING ON AN INCLINE, THE VEHICLE STARTED TO ROLL FORWARD AND CRASHED INTO A GARAGE WALL. THE CONTACT SUSTAINED TWO FRACTURED RIBS AND CONTUSIONS THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 24,000.  UPDATED 09/20/16 *BF  UPDATED 09/26/16.8JB",
        "vin": "5FRYD4H42FB"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "05/23/2016",
        "dateOfIncident": "04/23/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10870341,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE WAS INVOLVED IN A REAR END COLLISION. THE AIR BAGS DID NOT DEPLOY AND THE HEADREST DETACHED FROM THE SEAT. THE VEHICLE WAS TOWED TO A SALVAGE YARD WHERE IT WAS DEEMED DESTROYED. A POLICE REPORT WAS FILED. THERE WERE THREE INJURIES THAT REQUIRED MEDICAL ATTENTION. THE CONTACT SUFFERED FROM NECK AND BACK INJURIES. THE PASSENGER WAS PREGNANT AND THE EXTENT OF HER INJURIES WERE UNKNOWN. THE REAR PASSENGER INJURED HIS SHOULDER, BACK, AND NECK. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 12,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863343,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANT TO KNOW IF THERE IS A RECALL ON MY 2015 ACURA MDX FOR THE TAKATA AIRBAGS.  I HAVE NOT BEEN NOTIFIED ABOUT THIS CLUTCH BOLT FROM THE AIR CONDITION UNIT CORRODING THAT NEEDS TO BE REPLACED.",
        "vin": "5FRYD3H44FB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "12/21/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10860763,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 ACURA MDX.  CONSUMER WRITES IN REGARDS TO VEHICLE AIRBAGS NEVER DEPLOYED DURING COLLISION WITH ANOTHER VEHICLE.  *SMD  THE CONSUMER WAS SERIOUSLY INJURED IN THE ACCIDENT.*JB",
        "vin": "5FRYD4H23FB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/31/2016",
        "dateOfIncident": "12/22/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823285,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION JERKS (BADLY) AROUND 3RD GEAR, IN LOW SPEED.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/14/2015",
        "dateOfIncident": "04/14/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809940,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED UNINTENDED MOVEMENT AND THE BRAKES DID NOT FUNCTION WHILE IDLED. THE VEHICLE THEN LUNGED FORWARD. THE CONTACT STATED THE FAILURE OCCURRED DURING COLD WEATHER. THE FAILURE OCCURRED APPROXIMATELY THREE TIMES. THE VEHICLE WAS TAKEN TO THE DEALER HOWEVER, THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.  UPDATED 03/09/16*LJ; UPDATED 05/10/18*JB",
        "vin": "5FRYD3H48FB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/18/2015",
        "dateOfIncident": "10/12/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794682,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MDX WITH 8000 MILES ON IT MAKES A LOUT THUMP NOISE COMING FRONT THE REAR SUSPENSION. HAD DEALER CHECK BUT SAID THERE IS NOTHING WRONG AND EVERYTHING APPEARS CORRECT. ISSUE HAS GOTTEN LOUDER. AFTER LOOKING ONLINE FOR SIMILAR ISSUES THIS APPEARS TO BE COMMON ON ALL MDX CARS FROM 2014 ON AND APPEARS TO BE A DESIGN FLAW. NOT SURE HOW THIS RELATES TO THE SAFETY OF THE VEHICLE WITH REGARDS TO THE SUSPENSION POTENTIALLY COLLAPSING ETC.",
        "vin": "5FRYD4H49FB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2015",
        "dateOfIncident": "11/11/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790086,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 11TH 2015, IT WAS A SUNNY MORNING IN NORTHERN VIRGINIA AND I WAS IN MY 2015 MDX DRIVING TO WORK. AFTER I PASSED A TOLL BOOTH, I HEARD A HUGE \"GUNSHOT\" LIKE EXPLOSION FROM THE ROOF AND REALIZED THE MOONROOF GLASS GOT SHATTERED. VERY SCARY! IT WAS VETERAN'S DAY, SUNNY AND NO TRAFFIC. I'M PRETTY SURE NO ONE HIT ME OR I HIT ANYTHING ELSE. AND I DID NOT SEE ANY ROCKS FALLING/BOUNCING AROUND ME CAR NOR ANY CARS WERE CLOSE TO MINE. I IMMEDIATELY TOOK PICTURES AFTER I PARKED CAR IN MY OFFICE BUILDING. THE GLASS IS ACTUALLY PUSHED/CURVED OUT, MEANING IT IS A SIGN OF EXPLOSION FROM INSIDE DUE TO THE POOR QUALITY OF ACURA'S THIN MOONROOF GLASS. TOTAL COST OF REPLACEMENT IS $830. I HAVE ALREADY FILED A CLAIM TO ACURA CUSTOMER RELATIONSHIP, CLAIMING THEY ARE RESPONSIBLE TO COVER THIS. THEY ARE SUPPOSED TO GET BACK TO ME BY NOV 19TH. MY CAR IS LESS THAN ONE YEAR OLD, ACURA REJECTED TO COVER THIS UNDER WARRANTY INITIALLY, SO I HAD TO FILE THIS CLAIM AND FIGHT FOR THIS HORRIBLE EXPERIENCE. IF THEY END UP REJECTING TO REIMBURSE ME, I WILL DEFINITELY AVOID ANY CARS MADE FROM HONDA GOING FORWARD AND SHARE THIS EXPERIENCE WITH ANYONE I KNOW. TERRIBLE CAR QUALITY AND I HOPE THE CUSTOMER SERVICE WILL NOT DISAPPOINT ME. I REALLY HOPE ANYONE ELSE WHO EXPERIENCE SIMILAR ACCIDENTS CAN POST A COMPLAIN HERE OR GO SOMETHING FURTHER SO THAT OUR VOICES WILL BE HEARD AND THEY CAN EVENTUALLY TURN THIS TO A MANUFACTURE DEFECT ISSUE AND START A RECALL.",
        "vin": "5FRYD4H40FB"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786230,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS WITH THE AIR CONDITIONER ACTIVATED, THERE WAS AN ABNORMAL NOISE COMING FROM THE AIR CONDITIONER. THE VEHICLE WAS TAKEN TO A DEALER MULTIPLE TIMES WHO DIAGNOSED THAT THE CLUTCH COMPRESSOR BOLT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED ON NUMEROUS OCCASIONS. HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "5FRYD4H2XFB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2015",
        "dateOfIncident": "10/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786197,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN HOUSTON, GOING NORTH ON KIRBY DRIVE, WHICH IS A BUSY CITY STREET, AT APPROXIMATELY 4:30 PM ON MONDAY, OCT. 26, 2015.  SHORTLY BEFORE I REACHED THE INTERSECTION OF KIRBY DR. AND SUNSET BLVD, I APPROACHED A STANDARD SIZED STEEL SHEET/PLATE IN THE ROAD.  THE BRAKE ALERT FLASHED ON MY DASHBOARD.  I IGNORED THE ALERT AND CONTINUED TO DRIVE, BECAUSE MY CAR WAS NOT IN DANGER OF HITTING ANYTHING.  AS I GOT CLOSER TO THE STEEL PLATE, THE VEHICLE'S COLLISION MITIGATION BRAKING SYSTEM APPLIED THE BRAKES ON ITS OWN, I ASSUME BECAUSE IT PERCEIVED THE STEEL PLATE TO BE A COLLISION THREAT.  I HAD NO CONTROL OVER MY SUV, AND THERE WAS NOTHING I COULD DO TO RESUME NORMAL ACCELERATION. THE COLLISION MITIGATION BRAKING SYSTEM ONLY DISENGAGED ONCE THE SUV WAS DIRECTLY ON TOP OF THE STEEL PLATE.  MY CHILDREN AND I NARROWLY AVOIDED A REAR-END COLLISION.      AT THE TIME, BECAUSE THE CITY STREET WAS SO BUSY, I WAS ONLY TRAVELING 20-25 MPH, AS WERE THE OTHER CARS AROUND ME.  I FEAR WHAT WOULD HAVE HAPPENED AT HIGHER SPEEDS.  MANY HOUSTON ROADS, INCLUDING OUR BUSY HIGHWAYS, HAVE STEEL PLATES COVERING ROAD REPAIR PROJECTS.  I AM AFRAID THE BRAKES WILL ENGAGE SPONTANEOUSLY ON THE HIGHWAY.      WHEN I CALLED MY DEALERSHIP SHORTLY AFTER THE INCIDENT OCCURRED, I WAS INFORMED THAT UNLESS THERE IS AN ACTIVE SIGNAL ON MY CAR SHOWING THE NEED FOR SOME KIND OF SERVICE, THE DEALERSHIP WON'T BE ABLE TO FIX OR IDENTIFY THE PROBLEM.  SUPPOSEDLY, MY VEHICLE WAS SUBJECT TO THE MAY 20, 2015 FORWARD COLLISION AVOIDANCE RECALL INVOLVING THE 2015 ACURA MDX COLLISION MITIGATION BRAKING SYSTEM (NHTSA CAMPAIGN #15V301000).  THE DEALERSHIP SAID THAT IT ADDRESSED THE RECALL ISSUE AS A PART OF MY AUGUST 2015 CHECKUP, AND THAT AS A RESULT, MY VEHICLE MET ALL STANDARDS.  I NOTE THAT MY COMPLAINT IS NOT THE ONLY ONE PERTAINING TO THIS ISSUE (SEE NHTSA ID #10763775).  THE RECALL FIX MAY NOT HAVE WORKED.",
        "vin": "5FRYD3H83FB"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "10/09/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781097,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE SPORADIC PROBLEMS WITH ENGINE OR TRANSMISSION AND THE DEALER HAS NOT BEEN ABLE TO IDENTIFY THE PROBLEM.  IT HAPPENS AT ANY TIME SLOW OR FAST SPEED: UPHILL OR DOWNHILL THE CAR WILL NOT CHANGE GEARS AND STARTS TO PULL AS IF THE TRANSMISSION IS GOING TO FALL OUT.  WE HAVE REPORTED THIS TO ACURA CUSTOMER SERVICE AND RESULTS WERE GUARDED.  I AM AFRAID FOR MY AND MY FAMILY'S SAFETY BECAUSE THE PROBLEM CONTINUES AND IT HAPPENS ANYTIME AND ANYWHERE.  IT HAPPENED TODAY AND WE CALLED THE DEALER TO COME AND PICK UP THE CAR.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779876,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVE A RECALL NOTICE FOR MY ACURA AND IT'S BEEN PAST 60 DAYS AND THEY HAVE NOT DONE ANYTHING ABOUT IT/ WHEN I CALLED THE LAST TIME THEY SAID THEY DONT HAVE THE PARTS YET AND WILL CALL ME IF THEY GOT IT/ NEVER HEARD FROM THEM",
        "vin": "5FRYD3H28FB"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "06/08/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763775,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE RECALL OF COLLISON MIGRATION BRAKING SYSTEM (CMBS).  WITH THE NEW RECALL SOFTWARE. THE MDX STOPS OR APPLY THE BRAKING ON THE FREEWAY.  THIS IS A CONTINUES TO THIS DAY.  THE DEALERSHIP HAD THE VEHICLE FOR ABOUT ONE WEEK.  THEY SAID THAT IT COULD NOT FIND A PROBLEM.  THE DEALERSHIP PUT OVER 250 MILES ON THE VEHICLE.  I STILL HAVE THE PROBLEM OF THE BRAKING SYSTEM APPLING THE BRAKES GOING FROM CONCREATE TO ASPHALT WITH SPEEDS OVER 50 MILES PER HOUR.  I HAVE TO REACT TO EACH BRAKING QUICKLY.  IT ALSO HAPPENS IF THEIR  IS A SMALL BUMP IN THE ROAD LIKE A VERY SMALL SPEED BUMP. SOMETIMES OVER THE SAME AREA I WOULD GET THE BRAKING ALERT FLASHING ON THE HEADS UP DISPLAY.  SOMETIMES THE BRAKING LIGHT HAPPENS WITH SEAT BELT JERKING BACK AND A CHANGE OF SPEED.  ONLY ONCE SINCE I GOT MY VEHICLE BACK  FROM THE DEALERSHIP DID IT DO A FULL BRAKING.  AND THERE WAS NO OTHER CARS IN FRONT OF ME JUST THE ROAD.  I AM LUCKY TO HAVE NO ONE BEHIND ME WHEN THIS HAPPENS.",
        "vin": "5FRYD3H83FB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759256,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. THE CONTACT STATED THAT THE KEYLESS ENTRY SYSTEM FAILED. THE CONTACT WAS UNABLE TO UNLOCK THE DOORS IF THE CELL PHONE AND KEYLESS FOB WERE IN THE SAME LOCATION. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES. THE TECHNICIAN EXPLAINED THAT SOME CELL PHONES MIGHT INTERFERE WITH THE KEYLESS SYSTEM. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THIS WAS A KNOWN PROBLEM WITH THE KEYLESS SYSTEM. HOWEVER, THEY WERE NOT ABLE TO DETERMINE WHAT THE PROPER REMEDY WOULD BE FOR THE FAILURE. THE FAILURE MILEAGE WAS 5,000.   UPDATED 11/09/15*LJ    THE CONSUMER STATED THE FRONT DOORS WOULD NOT OPEN. ONLY REAR DOORS OPENED, WITH THE TAILGATE HAVING LITTLE MINOR ISSUES. UPDATED 1/25/2015   *JS    *CN",
        "vin": "5FRYD3H46FB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747690,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "1.TAIL GATE ISSUE:  AFTER PURCHASING THE BRAND NEW ACURA MDX, NEXT MORNING I SAW TAIL GATE WAS OPEN BY ITSELF. I ASSUMED I MIGHT HAVE UNKNOWINGLY PUSHED THE WRONG BUTTON.   FEW WEEKS LATER, MY WIFE SAW THE TAIL GATE OPEN IN HER GARAGE. WE AGAIN THOUGHT SOMETHING ON OUR END.  FEW WEEKS LATER, MY WIFE'S CO WORKER SENDS HER TEXT SHOWING THE TAIL GATE BEING OPEN , WHILE MY WIFE WAS NOT PRESENT IN THE BUILDING.   IN ONE OCCASION WHEN I WAS AT TARGET, I CAME OUT SAW MY TAILGATE OPEN.    AT LEAST 8 OCCURRENCES HAD TAKEN PLACE IN LAST 8 MONTHS. AND ACURA HAS BEEN UNABLE TO LOCATE THE ISSUE.     2.BODY ISSUE  FEW MONTHS LATER WE NOTICED THE VEHICLE'S EXTERIOR STARTED TO SEPARATE FROM ITS BODY.  WE TOOK THE CAR TO THE ACURA MCCHURCHILL , FORTWORTH. THEY SAID THERE WAS AN ISSUE WITH HOW MANUFACURERS APPLIED THE GLUE. AND PROMISED THE ROOT PROBLEM IS RECOGNIZED AND FIXED.   AFTER 2 WEEKS, THE INTERIOR WAS SEPARATING OUT FROM THE BODY.   WE HAVE OUR CHILD IN OUR CAR, AT THIS POINT WE DID NOT FEEL SAFE TO DRIVE THIS VEHICLE.  WE TOOK THE CAR TO ACURA MCCHURCHILL , FORTHWORTH, THEY ACKNOWLEDGED THE ISSUE.   WE REQUESTED THEM TO EXCHANGE OUR CAR TO ANY OTHER USED CAR, SAME YEAR MAKE/MODEL/MILEAGE.THE  REPRESENTATIVE SAID THEY HAVE 2016 MODEL, WE CAN LEAVE OUR CAR AND BUY NEW CAR. BY THAT TIME THEY HAD CLEARLY SEEN OUR FEAR OF DRIVING THE OLD CAR. THEY TOOK ADVANTAGE OF THE SITUATION AND PROVIDED OPTION-EITHER BUY A NEW CAR OR TAKE THE UNSAFE CAR.  THE STATEMENT THEIR SALES REPRESENTATIVE MADE WAS \"SOMEONE HAS TO TAKE THE LOSS, WE CANT TAKE IT ALL\"   KBB VALUE WAS $40,000.00. THEY GAVE US $34000.00 AS THE TRADE VALUE.THEY KEPT SAYING \"YOU ARE GETTING 2016 CAR\" BUT THE PRICE DIFFERENCE BETWEEN 2015 AND 2016 IS ONLY 150 DOLLARS. AND WE DID NOT NEED A NEW CAR. WE JUST NEEDED A SAFE CAR.  WE DIDN'T HAVE ANY OTHER CHOICE EXCEPT BUYING NEW CAR AND BE SAFE ON THE ROAD.",
        "vin": "5FRYD3H24FB"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "07/23/2015",
        "dateOfIncident": "07/09/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735974,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE WAS EQUIPPED WITH A LANE ASSIST CAMERA, A FEATURE THAT ALERTED THE DRIVER WITH \"LANE DEPARTURE AND LANE ASSIST KEEPING WARNINGS\" WHENEVER THE DRIVER VEERED FROM THE LANE. THE CONTACT STATED THAT THE FEATURE FAILED WHILE DRIVING 60 MPH, WITH THE AIR CONDITIONING SET AT 69 DEGREES. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THERE WAS NO REMEDY FOR THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT WAS ADVISED TO TURN THE AIR CONDITIONER ON WHILE DRIVING. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS LEFT AT THE DEALER'S AND HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED AGAIN, BUT HAD NOT RETURNED THE CALL. THE FAILURE MILEAGE WAS 1,400.",
        "vin": "5FRYD4H88FB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2015",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OWNER'S GUIDE OF THE VEHICLE SAYS: \"TO LOCK: PRESS THE DOOR LOCK BUTTON ON ANY FRONT (OR REAR) DOOR HANDLE WHEN THE VEHICLE IS OFF. IF THE REMOTE TRANSMITTER IS INSIDE THE VEHICLE, THE DOORS WILL NOT LOCK.\" BUT ON 5/20/15, AFTER MY SISTER PLACED HER 6 MONTH OLD BABY IN THE CHILD SAFETY SEAT IN THE BACK OF THE PARKED ACURA AND WAS READY TO DRIVE OFF, ALL DOORS WERE LOCKED WITH BABY AND THE REMOTE TRANSMITTER INSIDE THE VEHICLE. 911 WAS CALLED AND FIREFIGHTERS BROKE THE FRONT PASSENGER WINDOW TO SAVE THE BABY FROM OVERHEATING. I REPORTED THE INCIDENT TO ACURA WHO SAID IT WAS A NORMAL BEHAVIOR, EVEN THOUGH ITS OWNER'S GUIDE SAYS THE OPPOSITE. ACURA PEOPLE SAID THEY HAD A VIDEO SHOWING THE DOORS WOULD LOCK WITH THE REMOTE TRANSMITTER INSIDE VEHICLE, HOWEVER THAT WAS NOT PUBLIC INFORMATION. THAT MAKES ME WONDER - IF THE REMOTE TRANSMITTER CAN BE LOCKED INSIDE A PARKED VEHICLE, WHY DO THEY SAY \"IF THE REMOTE TRANSMITTER IS INSIDE THE VEHICLE, THE DOORS WILL NOT LOCK.\" IN THE OWNER'S GUIDE? I WOULD THINK THAT EITHER THEY PUT A WRONG STATEMENT IN THE OWNER GUIDE OR THEY DON'T WANT TO ADMIT THE DEFECTIVE LOCKING SYSTEM. ...UPDATED 07/30/15 *BF    UPDATED 10/23/2017*CN",
        "vin": "5FRYD4H47FB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/30/2015",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722449,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2015 ACURA MDX THAT IS THREE MONTHS OLD AND IT HAS 4000 MILES ON IT. I WAS DRIVING THIS CAR EARLY IN THE MORNING WHEN I PRESSED THE BUTTON TO OPEN THE MOONROOF, IT VIOLENTLY EXPLODED CAUSING GLASS TO SHOWER UPON ME. I HAVE SUFFERED CUTS ON MY HAND AND ON MY HEAD AS A RESULT OF THIS. I HAVE CONTACTED TWO DIFFERENT  HOUSTON ACURA DEALERS ONLY TO FIND OUT THAT THEY ARE NOT WILLING TO FIX THE REPAIR AS ACURA WILL NOT APPROVE THE REPAIR COST. ONE DEALER EVEN ADMITTED THAT ACURA IS AWARE OF THE ISSUE. I WISH THAT ACURA WOULD STAND BEHIND THEIR PRODUCT AND RESOLVE THE ISSUE PROMPTLY. IT COULD HAVE RESULTED IN A SERIOUS ACCIDENT OR WOULD HAVE INJURED MY CHILDREN AS WELL IF THEY WERE PRESENT IN THE CAR.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/13/2015",
        "dateOfIncident": "03/08/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694095,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPLODING SUNROOF - WHILE DRIVING  SOUTH ON 91 IN MA WE EXPERIENCED AN EXTREMELY LOUD BOOM IN THE VEHICLE.  NOTHING HIT US NOR DID WE HIT ANYTHING - IT WAS SPONTANEOUS.  THE SUNROOF EXPLODED COMPLETELY SHATTERING INTO SMALL PIECES.  THE VEHICLE IS NEW AND I WONDER IF OTHERS ACURA'S ARE REPORTING SIMILAR PROBLEM - DEFECTIVE GLASS?  *TR",
        "vin": "5FRYD4H48FB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "12/19/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10678942,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ENTERING A T-INTERSECTION WITH A STOP SIGN AT THE END OF OUR STREET THE BRAKES OF A 2015 ACURA MDX SH AWD WITH ONLY 2000 MILES WOULD NOT ENGAGE.  WE WERE TRAVELING AT 50MPH AND DECREASED OUR SPEED TO 30MPH AS WE WERE COASTING, BUT COULD NOT GET THE VEHICLE TO STOP.  THE BRAKES WERE PUMPED TWICE AS WE DECELERATED (SO REST ASSURED THE GAS PEDAL WAS NOT BEING PRESSED BY MISTAKE), BUT TO NO AVAIL AND WITH NO WHERE TO GO AND NOT ENOUGH TIME TO DO MUCH MORE WE COLLIDED WITH A SEMI TRUCK.  IT WAS A HORRIFIC ACCIDENT THAT TOTALED OUR CAR AS THE SECOND TRAILER TIRES RAN OVER OUR HOOD AS HE WAS DRIVING AT 60MPH.  LUCKILY DUE TO HIS HIGH SPEED OUR VEHICLE WAS THROWN AND WE LANDED UPRIGHT AND ALL AIRBAGS DEPLOYED WHICH IS THE ONLY REASON WE ARE ALL ALIVE.  IT WAS A COLD DECEMBER MORNING WITH BELOW ZERO TEMPERATURES.  I UNDERSTAND THERE ARE OTHER ACCOUNTS WHERE BRAKE PEDALS ARE NOT WORKING IN THE COLD OR WHERE DRIVERS ARE PUMPING BRAKES 4-5 TIMES TO GET THEM TO ENGAGE, OR DRIVERS ARE TURNING THEIR CAR OFF.  WE SADLY DID NOT HAVE THAT KIND OF REACTION TIME.  THIS COULD HAVE RESULTED IN 4 DEATHS AND I WOULD LIKE TO SEE ACURA LOOK INTO THEIR PLETHORA OF BRAKE PROBLEMS FURTHER AS THIS IS A BRAND NEW VEHICLE COMING OFF OF A BRAKE REDESIGN DUE TO THE EARLIER MODEL RECALL.  *TR",
        "vin": "5FRYD4H48FB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654607,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW 2015 MDX HAD SIGNIFICANT GAPS (APPROX 1/2 INCH) BETWEEN THE DASH WHERE IT MEETS THE BASE OF THE A-PILLARS AND THE A-PILLAR/AIRBAG COVERS WERE OUT OF ALIGNMENT ALONG FRONT EDGE OF WINDSHIELD.  WHEN I ASKED THE SERVICE WRITER ABOUT IT HE DISCOURAGED ME FROM HAVING THE PROBLEM ADDRESSED OR CORRECTED BECAUSE THEY WOULD HAVE TO REMOVE THE DASH TO RESOLVE THE PROBLEM AND IT MIGHT CAUSE OTHER PROBLEMS AND RATTLING LIKE I WAS ALSO EXPERIENCING WITH THE PASSENGER DOOR.  AFTER SEVERAL VISITS REGARDING SEVERAL OTHER PROBLEMS I SPOKE TO SERVICE MANAGER WHO SAID I SHOULD HAVE THE PROBLEM ADDRESSED.  IT SEEMED TO ME THAT THE A-PILLAR COVERS WERE UNSECURED AT THE BASE AND ASIDE FROM THE AESTHETIC ISSUE, IN THE EVENT OF A SERIOUS ACCIDENT THE AIR BAGS MAY NOT DEPLOY PROPERLY OR THE ENTIRE COVER MAY BE PROPELLED INTO THE OCCUPANTS CAUSING SERIOUS INJURY OR DEATH.  I DO NOT KNOW HOW THESE GAPS WERE MISSED BY ACURA QUALITY CONTROL.  I HAVE NOTICED SEVERAL VEHICLES WITH VARYING DEGREES OF IMPROPER ALIGNMENT OF THESE COVERS ALTHOUGH NONE AS SERIOUS AS MINE. I HAVE ONLY INSPECTED A FEW BUT THIS MIGHT BE A PROBLEM WITH A LARGE NUMBER OF VEHICLES BASED ON THE POOR QUALITY CONTROL EXHIBITED IN MY MDXS AND NUMEROUS OTHER ISSUES WITH THE MDX SINCE 2014.  I THINK THIS ISSUE AND ACURA'S QUALITY CONTROL PROCESS SHOULD BE INVESTIGATED ASAP TO DETERMINE WHETHER THIS PROBLEM POSES A RISK OF INJURY OR DEATH TO THE OCCUPANTS OF THE MDX.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654617,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2015 MDX HAS AN IMPROPERLY INSTALLED ROOF PANEL OR IMPROPERLY PLACED MOUNTING POINTS THAT ARE PART OF THE ROOF PANEL.  I FOUND THE PROBLEM BECAUSE OF A GAPS BETWEEN THE FRONT AND REAR ROOF MOLDINGS, THE WINDSHIELD AND FRONT MOLDING AND THE REAR MOLDING WAS UNSECURED, FLAPPING AND HANGING OVER TOWARDS THE TAILGATE DOOR. I WAS INITIALLY TOLD THAT IT WAS JUST A BROKEN CLIP BUT AFTER ORDERING NEW CLIPS AND NEW MOLDINGS SEVERAL TIMES THEY DETERMINED THAT THE MOUNTING DOWELS ARE IN THE WRONG PLACE ON ONE SIDE OF THE VEHICLE AND THEY SUGGEST I LET THEM CUT, WELD AND REPAINT THE ROOF OF MY BRAND NEW MDX. IT HAS TAKEN ACURA ALMOST 4 MONTHS TO REACH THIS DECISION. MY CAR HAS BEEN THE SHOP OVER THREE WEEKS IN COMBINED DAYS. MY CONCERN ASIDE FROM HAVING MY NEW VEHICLE REPAINTED IS THAT IF THEIR AUTOMATED ASSEMBLY PROCESS CAUSED THIS DEFECT WHAT OTHER DEFECTS MIGHT HAVE BEEN CAUSED AT THE SAME TIME AND HAVE NOT BEEN IDENTIFIED. HOW DID THIS VEHICLE PASS ACURA'S QUALITY CONTROL? WHAT COULD BE THE CONSEQUENCE OF THESE POTENTIAL DEFECTS. ACURA HAS DONE NOTHING TO EXPLAIN OR DETERMINE IF THERE COULD BE OTHER ISSUES THAT MIGHT EFFECT THE SAFETY OR LONGEVITY OF THE VEHICLE.  THEY DID NOT EVEN ENGINEER THE SOLUTION THEMSELVES, THEY HAD A LOCAL BODY SHOP DETERMINE HOW TO RELOCATE THE INCORRECTLY INSTALLED PARTS.. I HAVE FILED A FORMAL COMPLAINT WITH ACURA CUSTOMER RELATIONS AND THEY HAVE REFUSED TO PROVIDE A WRITTEN RESPONSE OR A DETAILED WRITTEN EXPLANATION OF THE PROPOSED WORK TO BE DONE.  THE CUSTOMER RELATIONS DEPARTMENT SHOULD BE CALLED ACURA DEFENSE DEPARTMENT.  I HAD HOPED THAT THE NUMEROUS COMPLAINTS FILED ON THIS SITE AND ELSEWHERE REGARDING THE 2014 MDX ASSEMBLY PROBLEMS WOULD BE RESOLVED IN THE 2015 MODEL.  NO SUCH LUCK. BUYER BEWARE UNLESS YOU ARE READY TO HAVE YOUR BRAND NEW MDX REPAINTED!  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/26/2014",
        "dateOfIncident": "10/20/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650097,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST USE MOVING VISOR TO DRIVER- SIDE WINDOW, VISOR BROKE LOOSE DROPPING TO BLOCK ROAD VIEW WHILE DANGLING FROM POWER CORD. STARTLED DRIVER WHILE BLOCKED VIEW CAUSED LOSS OF CONTROL TO MEDIAN WHILE TRAFFIC AVOIDED ACCIDENT BY SWERVING TO SHOULDER. PASSENGER SIDE VISOR SIMILARLY FAILED ON FIRST USE TWO DAYS LATER.    THIS DEFECT IS GOING TO KILL SOMEONE IF NOT RECALLED AND CORRECTED.  *TR",
        "vin": "5FRYD4H41FB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648780,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACURA MDX 2015  CAN BE TURNED OFF WHILE IN DRIVE AND THE CAR ROLLS BACKWARDS AS IF IN THE NEUTRAL POSITION. PULL INTO A PARKING SPACE AND FORGET TO PUT THE CAR IN PARK, BUT PUSH THE ENGINE START BUTTON TO TURN OFF THE CAR. THE CAR WILL ROLL BACKWARDS.  THE CAR DOES NOT LOCK INTO PLACE. THIS IS A SERIOUS SAFETY CONCERN IF A PERSON WAS BEHIND THE CAR THEY WOULD GET RUN OVER.  THE ACURA CORPORATE OFFICE TOOK THE INFORMATION AND TOLD ME TO CALL THE DEALER.  THE DEALER SAID THAT THIS IS A KNOWN FEATURE OF THE NEW CAR.  *TR",
        "vin": "5FRYD4H47FB"
    }
]