[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459251,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact stated that while driving approximately 25 MPH, the passenger’s side air bag off warning light illuminated. The vehicle was not taken to be diagnosed; however, the dealer was contacted and informed of the failure. The contact stated that the failure was related to NHTSA Campaign Number: 21V198000 (Air Bags). The VIN was included however, the vehicle was not repaired due to parts not being available. The manufacturer had not been informed of the failure. The approximate failure mileage was 160,000.",
        "vin": "WAUEFGFF9F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458614,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact received notification of NHTSA Campaign Number:  21V198000 (Air Bags) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated that the Audi presence system fault warning chime and light was illuminated. The contact stated that the passenger’s side air bag warning light would illuminate whether or not there was a passenger seated in the seat. The approximate failure mileage was 68,000. Parts distribution disconnect.",
        "vin": "WAUACGFF5F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456248,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A5. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was unavailable. The local dealer was contacted and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated that the air bag warning light had remained illuminated and the error message “passenger air bag off” was displayed. The failure mileage was unavailable. Parts distribution disconnect.",
        "vin": "WAUEFGFF8F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455597,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact received a notification for NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was unavailable. The local dealer and Audi Stratham (58 Portsmouth Ave, Stratham, NH 03885) were contacted and confirmed that parts were not yet available. The manufacturer was made aware of the issue. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "wauefgff2f1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454812,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The turbo went out prematurely",
        "vin": "WAUACGFF9F1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2022",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453154,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine low oil light keeps coming on, the oil has been changed already, I’ve had the car for more than 7 months I haven’t even driven it over 5000 miles yet. Audi needs to fix this. The power train is also the same, some days it works okay and some days it doesn’t. The cars struggles sometimes to even reach speeds up to 50 mph.I’ve taken this vehicle to the Audi dealship as well as to a foreign certified mechanic shop. They can’t figure out the problem.  The engine light should not be coming on randomly when I have fully serviced the vehicle. Audi please fix these problems.",
        "vin": "WAUACGFF9F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452855,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact stated that while driving at an undisclosed speed, the passenger occupant detection system (PODS) warning light was illuminated. The dealer was made aware of the failure but canceled the scheduled appointments for diagnostic testing on numerous occasions. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 67,000. Parts distribution disconnect.",
        "vin": "wauefgff7f1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452473,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact stated while driving 60 MPH with her son sitting in the front passenger’s side seat, the passenger’s side air bag warning light illuminated intermittently. The contact continued to drive the vehicle. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) and the vehicle was taken to the dealer for the recall repair; however, the recall repair was not completed as the contact left with the vehicle to pick up her son from school. The contact stated that the dealer refused to honor the manufacturer's vehicle rental assistance offer. The contact stated that the failure had been reoccurring while driving. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 73,000. Parts distribution disconnect.",
        "vin": "WAUACGFF1F1"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449331,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "There has been previous recall for the passenger seat occupation sensor in 2019, asking for a connector to be replaced.  Approximately 3 months after the connector was replaced in late 2019, the airbag warning light in the dashboard turned on. That was approximately in March or April of 2020. The car was only lightly used during 2020 and the latest recall had not been issued. In early 2021, a letter with recall information arrived and stated that I shall not use the car with the passenger seat occupied if the warning light was on. I contacted Audi Service in May 2021 and was told that no parts were available to repair - About a month ago I received another letter repeating the warning and stating that parts were available. I tried to arrange an appointment but was again told, no parts were available and the earliest appointment would be available in May.  As of now, the airbag warning light is on, the airbag indicator says “Airbag has been disabled” and the diagnostic readout reports “Sensor resistance too high\"",
        "vin": "WAUEFGFF6F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448780,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was not yet available. The contact stated that the airbag warning light was illuminated. The dealer was made aware of the failure but informed the contact that parts were not yet available. The manufacturer was made aware of the failure. The vehicle had previously been serviced four years ago for the recurring failure, and the dealer had replaced the passenger occupant detection system (PODS) sensor mat. The failure mileage was approximately 135,000. Parts distribution disconnect.",
        "vin": "wauwflff9f1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448858,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The Auxiliary PTC Electric Cabin Heater fails and causes an overheat/fire condition.  We own a 2015 Audi A3 TDI Premium Plus sedan.  This vehicle has a diesel engine.  Audi fitted A3 models that have a diesel engine with an auxiliary electric cabin air heater.  This heater helps to warm the cabin and provide defrost capabilities on days when the temperature is below 7 degrees C.    This heater in our vehicle failed due to melting at the wiring harness connection lugs.  This melting caused an overheating condition to occur.  On cold days we would notice a terrible burning plastic, rubber smell coming from the air vents inside the cabin.  Once the car was warmed up and the electric heater was disabled by the cars ECU (computer) the smell gradually went away.  The process was repeated the next day, but the smell was worse.  We took the vehicle to Zimbrick European Audi in Madison, WI.  They found the electrical issue with the Auxiliary Electric Cabin Air heater.    In researching this issue we found there are MANY user reports of the same failure on Volkswagon Audi Group vehicles.  Audi issued a safety recall for the SAME problem on Audi A4, A5 and Q5 vehicles under Audi Safety Recall Code  : 80C5 with the NHTSA document number being: RCRIT-17V622-6265.pdf  This very same problem currently affects my Audi A3 TDI.  I have found numerous other people reporting the same issue with VW Golf TDI models, VW Passat TDI models and Jetta TDI models.  Examples are located here:  https://forums.tdiclub.com/index.php?threads/burning-smell-from-heat.513304/ https://www.youtube.com/watch?v=_6tEwBzZIxs  The problem is most likely the same materials defects that occurred with the Audi A4, A5 and Q5 models.  The third party supplier of the Auxiliary Electric Cabin Air Heaters used TIN for some of the components. These substandard components lead to product failure and ultimately thermal overload, melting plastic/rubber and potentially a fire.",
        "vin": "WAUCJGFF4F1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "12/07/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448322,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact stated that she was able to remove the key from the ignition switch even though the gear selector was not in the PARK position. The vehicle was taken to the dealer, and the dealer installed a microswitch. The vehicle was repaired. The manufacturer was made aware of the failure but informed the contact that there was no recall for the failure because it was not a safety hazard. The failure mileage was 49,154.",
        "vin": "wau6clff3f1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "04/07/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446671,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The warning lights that the Airbag is not functioning intermittently turns on and off and the car beeps incessantly. It is very distracting and has diverted my attention several times on the highway.  This Recall has been pending since March 2021. I have been trying to schedule an appointment with the dealer to get it fixed and the response I get is there are no parts, call back next month. At this point I am concerned that Audi does not have the necessary parts and is simply wasting their customers time asking them to schedule appointments with the dealer.  It will be great if the NHTSA can investigate this and update owners with what to expect here. I am concerned that I am driving this car without passenger airbags functioning for close to a year now!",
        "vin": "WAUEFGFF2F1"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/26/2021",
        "dateOfIncident": "11/09/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444968,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this vehicle in Germany back in September 2020. It’s a US spec Audi that has the passenger air bag floor sensor recall that I can’t seem to get fixed by the German Audi dealership. How can I get this recall fixed in case I sell the car or want to ship it back stateside. They won’t ship a  car with a potential safety recall outstanding. My phone number is [XXX] and I used my stateside address because the system will not accept my German address. Please contact me via phone number listed above or by email.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "WAUEFGFF0F1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441118,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "During cold ambient temperature when the engine is cold the vehicle activates an axillary cabin heater which fills the cabin with smoke and burning odor due to the heating element burning the housing and wiring inside the dash. This is a serious danger risking vehicle fire and health hazard for the operator and occupants of the vehicle. It appears multiple other Audi vehicles have a similar/same heating element that have the same issue. The 2015 A4 and Q5 appear to have a recall for this issue.",
        "vin": "WAUAJGFF4F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440047,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "It has been nearly 9 months since this recall was issued.  Audi cannot provide a remedy and cannot tell me when they can provide a remedy.  I cannot transport a passenger in the front seat safely, and I cannot sell the car because Audi has issued a 'stop sell' order.  Audi will not repurchase the car.",
        "vin": "wauccgff8f1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439372,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I experienced the exact scenario listed in NHTSA Recall Number21V198.  Took the vehicle to my local Audi Dealer.  Paid for the necessary safety repairs.  Submitted for reimbursement with Audi USA reached out to them multiple times and they have refused to reimburse me for the parts and labor.  Attached are the recall and emails between me and Audi USA.  Thank you for any support you can provide.",
        "vin": "WAUEFGFFXF1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435246,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The manufacturer has yet to find a remedy for hmmmmm cars recall.",
        "vin": "WAUCCGFF6F1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433383,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "GENERAL TIRE",
                "productModel": "G-MAX AS-05",
                "productYear": "9999",
                "size": "225/40/R18",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3 equipped with General Tires, Tire Line: G-Max AS-05, Tire Size: 225/40/R18, DOT Number: (Not Available). The contact stated that while his daughter was driving 70 MPH, the front driver’s side tire experienced a blowout. The contact's daughter informed him that she could see the tire tread blowing off the vehicle as she pulled to the side of the road. A state patrol officer was able to assist his daughter in changing the tire. Upon inspection of the tire, the contact stated that the tread had ripped off from the sidewall causing the failure. The tire manufacturer was notified of the failure but offered no assistance. The tire failure mileage was 15,000. The vehicle failure mileage was 39,000.",
        "vin": "waucjgff4f1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432014,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact stated that while refueling the vehicle, the contact noticed that the fuel door was sticking. The vehicle was taken to the local dealer and diagnosed with a faulty fuel actuator which needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure however, no further assistance was provided. The failure mileage was approximately 63,000.",
        "vin": "WAUACGFF5F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430727,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was unavailable. The contact called Audi Fort Lauderdale (1200 N Federal Hwy, Fort Lauderdale, FL 33304, (954) 545-4650) and Audi North Miami(1995 NE 142nd St, North Miami, FL 33181, (305) 952-5900), and it was confirmed that the part was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts are not available.",
        "vin": "WAU6CLFF6F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430288,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was unavailable. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated that the alarm repeatedly activated causing the battery to drain. The vehicle was repaired prior to the recall however, the failure persisted. The approximate failure mileage was 45,000. VIN tool confirms parts not available.",
        "vin": "WAUCCGFF8F1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430297,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact stated that she noticed there was fuel leaking on the ground while the vehicle was parked. The vehicle was taken to the dealer and the adapt system solenoid and charcoal canister was repaired. However, the failure recurred. The manufacturer was made aware of the failure but informed the contact that the VIN was not included in NHTSA Campaign Number: 16V647000 (Fuel System, Gasoline, Engine and Engine Cooling). The failure mileage was approximately 67,800.",
        "vin": "waukfgff2f1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426624,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact stated that the passenger occupant detection system (PODS) had failed to operate with a passenger seated in the front passenger’s seat. The contact then received notification of NHTSA campaign number: 21V198000 (Air Bags) however, the part to do the recall repair was not yet available. The dealer was contacted, and the contact was informed that an interim repair could be performed on the vehicle however, due to previous poor service, the contact decided not to have the recall repaired at that dealer. The contact then took the vehicle to Audi Gilbert (3235 S Gilbert Rd, Gilbert, AZ 85297) where they informed him that they would have to scan the vehicle prior to having the interim repair performed. The contact notified manufacturer and the manufacturer spoke with the dealer. The contact was called back by the manufacturer and was informed that since his vehicle was no longer under warranty he had to pay for the vehicle to be scanned, as well as, for the interim repair to be performed on the vehicle. The contact refused the service. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The failure mileage was approximately 28,000. Vin tool confirms parts not available.",
        "vin": "waucjgff2f1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425626,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "After taking my '15 A3 to the dealer to have the Passenger Occupant Detection (POD) serviced, the issues started. For example, the passenger seatbelt sometimes chimes when no one is in the passenger seat, to the airbag shutting off when someone is seated in the passenger seat. As a result, I've reached out to my local Audi dealer to schedule an appointment to fix the issue. However, the service representative informed me that the recall is currently on hold due to parts not being readily available from Audi of North America to fix the issue. The dealer added my information to a waiting list and told me to wait for a phone call or an email when the PODS recall parts are available. Three months later, and I am still waiting.",
        "vin": "WAUCCGFF9F1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "03/27/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423917,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A3. The contact received a recall notification for NHTSA Campaign Number: 21V198000 (Air Bags) however, the dealer informed the contact that the part for the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue and confirmed that the remedy was not yet available. The contact stated that the air bag and the seat belt warning lights were illuminated. The approximate failure mileage was 48,500. Vin tool confirms parts not available.",
        "vin": "WAUACGFF1F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/17/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421342,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "My airbag light randomly goes off while driving or parked. Someone can be in or not in the seat. Shows they’re not buckled in while they are. It sounds with a ding. Documents at dealership where they told me it was my own issue. I was saving to do their repair recommendations.",
        "vin": "Wauefgffxf1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "06/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419442,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Manufacturer Recall Number69BY NHTSA Recall Number21V198",
        "vin": "WAU6CLFF7F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418081,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Audi A3. The contact discovered that the VIN was included in NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was not yet available. The manufacturer had been notified about the recall however, the contact was informed that the parts were not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the repair. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "WAUACGFF4F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416662,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING THE SAME ISSUE WITH MY 2015 AUDI THAT SO MANY OTHERS I READ ARE HAVING, MY PASSENGER SEAT AIR BAG SENSOR KEEPS TURNING ON AND OFF WHEN THE SEAT IS OCCUPIED. I\u0092M NOW CONCERNED AFTER READING ALL THESE REPORTS THAT I\u0092M GOING TO GET HOSED SINCE AUDI ISN\u0092T DOING THE PROPER THING AND FIXING WHAT\u0092S ACTUALLY WRONG WITH THIS CAR. WHO\u0092S RESPONSIBLE WHEN THE PASSENGER IN MY CAR DIES BECAUSE THE AIR BAG SYSTEM WAS OFF DUE TO A MANUFACTURER\u0092S DEFECT THAT WAS IGNORED?",
        "vin": "WAUCCGFF6F1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414669,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI RECALL #69Z4, NHTSA RECALL #19V474  THE CAR WAS UNDER A PREVIOUS RECALL FOR THE SAME PROBLEM, WHICH WAS 'FIXED' BY DEALER SOMETIME IN 2019. CURRENTLY THE CAR SHOWS AIRBAG IS DEACTIVATED, THE UNBUCKLED SEATBELT WARNING LIGHTS AND SOUNDS FLASHES EVEN WHEN THE SEAT IS UNOCCUPIED. SPOKE THE AUDI OF ONTARIO,CA ON SEVERAL OCCASIONS. THEY REFUSE TO FIX THE VEHICLE. SERVICE MANAGER WILL NOT RETURN PHONE CALLS. THIS IS THE SECOND TIME THIS COMPONENT HAD TO BE REPLACED, AND THE DEALER IS REFUSING TO REPAIR IT.   THE PASSENGER AIRBAG OFF LIGHT STAYS ON, WHEN THE SEAT IS UNOCCUPIED, THIS HAPPENS AS SOON AS THE VEHICLE IS STARTED. THE UNFASTENED SEATBELT LIGHT, AND AIRBAG LIGHT REMAIN ON WHILE DRIVING. UNFASTENED SEATBELT SOUNDS CONTINUE FOR 2-3 MINUTES AFTER THE CAR IS STARTED, THEN GOES AWAY.",
        "vin": "WAUEFGFFXF1"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407754,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON IN OCTOBER 2020 CAR WAS SLOW TO TAKE OFF FOR SEVERAL WEEKS AND SEEMED TO TAKE TIME TO SHIFT GEARS. TOOK TO AUDI MECHANIC AND HAD TO REPLACE WATER PUMP -W/THERMOSTAT HOUSING & INTAKE MANIFOLD. NOW I'M APRIL 2021 CAR IS BACK IN SHOP BECAUSE IT WOULDN'T SHIFT OUT OF 1ST GEAR SUDDENLY WHEN I WAS DRIVING WITH MY DAUGHTER IN THE CAR, I PULLED OVER IN A PARKING LOT TO TURN CAR OFF AND THEN GOT AN ERROR MESSAGE STATING TRANSMISSION MALFUNCTION CANNOT REVERSE AND HAD TO HAVE THE CAR TOWED TO MECHANIC AGAIN. I'M TOLD IT NEEDS MECHATRONIC UNIT REPLACED, REPLACE TIMING COVER DUE TO OIL LEAK, EVAP LEAK AND WIPER FLUID IS LEAKING.",
        "vin": "WAUACGFF4F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402524,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PODS FAILURE.  PASSENGER OCCUPANCY DEVICE.    WHEN NOT WORKING, PASSENGER AIRBAG IS TURNED OFF WHILE PASSENGER IN SEAT.   IN MY CASE THE PART WAS REPLACED AT 10,208 MILES AND FAILED AGAIN AT 13,924 MILES.   AUDI REPLACED THE SENSOR THE FIRST TIME AFTER A LOT OF DEBATE, BUT REFUSE THE SECOND TIME.   THERE WAS A RECALL ON THE HARNESS THAT PLUGS INTO THE SENSOR, BUT NOT THE SENSOR ITSELF.  CRITICAL AIRBAG SAFETY SYSTEM SHOULD NOT FAIL AT THIS MILEAGE.   THERE ARE NUMEROUS FAILURES HIGHLIGHTED IN MANY AUDI FORUMS.   THIS IS A KNOWN PROBLEM FOR AUDI, AND THE NUMEROUS OWNERS EXPERIENCING THIS FAILURE.",
        "vin": "WAU5CLFF4F1"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/24/2021",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389668,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER HAVING RECALL 69Z4 COMPLETED (HARNESS AND CONNECTOR) COMPLETED STARTED GETTING WARNINGS THE PASSENGER AIRBAG NOT WORKING AND WHEN SOMEONE WAS NOT IN THE PASSENGER SEAT GETTING A SEATBELT WARNING.  ALSO ERROR ON DISPLAY ABOUT PRE-SENSE ERROR.  WENT TO DEALER AND POINT OUT THIS STARTED RIGHT AFTER THE RECALL AND THEY SAID DIFFERENT ISSUE AND HAS IMPACTED A LOT OF OTHERS.  NOW THEY SAY THE PODS (PASSENGER OCCUPANCY DETECTION SYSTEM) NEEDS TO BE REPLACED QUOTING ME APPROXIMATELY $1200 TO FIX.  DUE TO THE FAULT THE PASSENGER SIDE AIR BAG WILL NOT OPERATE.  IN ADDITION TO MY DEALER TELLING ME IT IS A COMMON PROBLEM, WHEN LOOKING AT THE FORUMS IT SEEMS LIKE A PROBLEM ACROSS MANY AUDI MODELS, NOT JUST THE A3, S3.",
        "vin": "WAUACGFF1F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388565,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AIR BAG WARNING LIGHT STAYS ON AT ALL TIMES.  IF THEIR IS NO PASSENGER THE SEAT BELT WARNING SIGNAL GOES OFF.  THE SEAT BELT MUST BE ENGAGED EVEN THOUGH THERE IS NO PASSENGER PRESENT IN ORDER TO GET THE SIGNAL TO STOP DINGING.",
        "vin": "WAUCCGFF3F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387867,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. THE CONTACT STATED THAT AT START-UP, THE AIR BAG WARNING LIGHT ILLUMINATED. THE CONTACT WAS CONCERNED FOR HER SAFETY THAT THE AIR BAG COULD DEPLOY INADVERTENTLY. THE VEHICLE WAS TAKEN TO AUDI VIRGINIA BEACH (2865 VIRGINIA BEACH BLVD, VIRGINIA BEACH, VA 23452) WHERE IT WAS DIAGNOSED THAT THE PASSENGER'S SEAT SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED DUE TO THE COST. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 19V474000 (AIR BAGS) WHERE THE CABLE TIES IN THE PASSENGER'S SEAT AND PODS HARNESS WERE REPLACED. THE CONTACT STATED THAT THE SEAT SENSOR SHOULD HAVE BEEN REPLACED BECAUSE THE PARTS WERE ALL CONNECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE SENSOR WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 34,000.",
        "vin": "WAUBFGFF5F1"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "03/19/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378618,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AIRBAG SYSTEMS, INC.",
                "productMake": "AIRBAG",
                "productModel": "SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "IN 2019, I WAS NOTIFIED OF A RECALL CONSISTING OF THE PODS(PASSENGER OCCUPANT DETECTION SYSTEM) SYSTEM STATING THAT THE WIRING AND CONNECTOR NEEDED TO BE CHANGED. I TOOK THE VEHICLE IN TO THE DEALERSHIP TO HAVE THE RECALL SERVICE REPAIRS DONE. AFTER COMPLETION OF THE RECALL REPAIRS, I HAVE NOW BEGAN TO HAVE ISSUES WITH MY AIRBAG SENSOR WHICH IS PART OF THE PODS SYSTEM. AROUND MARCH 2020, I BEGAN HAVING ISSUES WITH MY AIRBAG TURNING ON AND OFF WHILE A PASSENGER IS SITTING IN MY PASSENGER SEAT WITH THE SEATBELT ON. I WOULD HAVE TO INSTRUCT MY PASSENGER TO DISENGAGE THE SEATBELT AND RE-ENGAGE IT IN ORDER FOR THE AIRBAG TO COME BACK ON AND RECOGNIZE THAT THERE IS A PERSON OVER THE MINIMAL WEIGHT REQUIREMENT OCCUPYING THE SEAT. THIS ISSUE HAVE CONTINUED TO OCCUR ON AND OFF THROUGHOUT THE YEAR. ON NOV. 6TH, I WAS IN AN ACCIDENT(REAR-ENDED) WITH NO MAJOR INJURIES. THAT ACCIDENT WAS LUCKILY NOT VERY SEVERE AND I AM VERY FORTUNATE THAT I DIDN'T HIT THE CAR THAT WAS IN FRONT OF ME AND NEEDED MY AIRBAG TO DEPLOY AND I WOULDN'T DUE TO A FAULTY AIRBAG SENSOR THAT WAS FINE UNTIL THE RECALL CAMPAIGN IN 2019. SO ON FRIDAY, NOV 13TH, I TOOK MY CAR IN FOR DIAGNOSTIC TESTING AT THE DEALERSHIP AND WHEN THE SERVICE DEPARTMENT CALLED, I WAS TOLD THAT IT WAS IN FACT MY SENSOR INSIDE MY FRONT PASSENGER SEAT THAT IS MALFUNCTIONING. THIS DID NOT OCCUR UNTIL THE WIRING AND CONNECTOR WAS CHANGED IN DEC 2019. I HAVE CONTACTED THE CORPORATE OFFICE OF THE AUTO MAKER AND THEY ARE REFUSING TO PAY ANY PART OF THE COST TO HAVE THE SENSOR REPLACED AND I AM BEING QUOTED A REPAIR PRICE OF $1200 AND THAT'S JUST FOR THE PART ALONE. THIS IS A SAFETY ISSUE AND I FEEL THAT SINCE THE COMPANY ISSUED A RECALL CAMPAIGN FOR THE REPLACEMENT OF THE WIRING AND CONNECTOR, THEY SHOULD DO THE SAME FOR THE AIRBAG SENSOR BEFORE A FATAL ACCIDENT OCCURS TO A PASSENGER OF THE SAME TYPE OF  VEHICLE WITH THE SAME ISSUE. THERE ARE CURRENTLY SEVERAL COMPLAINTS ABOUT THE EXACT SAME ISSUE POSTED ON THIS SITE AND SEVERAL OTHERS.",
        "vin": "WAUCCGFF9F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "10/29/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373990,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 2018 PAID OUT OF POCKET FOR PASSENGER PODS DUE TO FAULTY SENSOR FOR PASSENGER AIR BAG. 10/2019 RECALL FOR WIRING WAS DONE. OCTOBER 29 2020, PODS NEED REPLACED AGAIN! OUT OF WARRANTY! THIS IS A HUGE SAFETY CONCERN AND AFTER VIEWING MULTIPLE OTHER COMPLAINTS OF THE SAME ISSUE,  A RECALL MUST BE DONE!  AUDI NEEDS TO TAKE RESPONSIBILITY AND ADDRESS THEIR FAULTY ISSUE WHICH SHOULD HE COVERED UNDER RECALL. GOD FORBID SOMEONE BECOME SERIOUSLY INJURED OR LOSE THEIR LIFE DUE TO AUDIS LACK OF RESPONSE. I AM NOW BEING TOLD THAT I LUST PAY OUT OF POCKET ONCE AGAIN TO REPAIR!",
        "vin": "WAUACGFF2F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366863,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RECEIVED PODS RECALL FIX CODED 69Z4 IN JANUARY 2020. THE FIX DID NOT SOLVE THE ANNOYING AND LIFE THREATENING MALFUNCTIONION THAT LEADS TO AUDI PRESENSE FAILURE ALERT AND DEACTIVATION OF THE PASSENGER AIRBAG SYSTEM WHEN A PASSENGER IS SEATED. IT WOULD ALSO TRIGGER THE ERROR WHEN NO PASSENGER WAS SEATED, REQUIRING TO FASTEN THE SEATBELT TO AN EMPTY SEAT TO GET RID OF THE SEATBELT BEEPS. CAR WAS TAKEN IN TO AUDI DEALERSHIP OCTOBER AND AFTER AN INSPECTION, THE ISSUE WAS FOUND TO BE THE SENSOR ITSELF THIS TIME. THE DIAGNOSIS REPORT DILIGENTLY RULED OUT ANY PROBLEM WITH THE CONNECTOR AND WIRING WHOSE FAULT WOULD MEAN A POTENTIAL REPAIR AND THE INSPECTION WOULD BE AT NO COST TO OWNER. HOWEVER, LIKE EVERYONE ELSE'S COMPLAINTS OWNER WAS PRESENTED WITH A 1,500 DOLLAR QUOTE FOR REPLACING THE SENSOR + $250 FEE FOR USING THEIR VAGCOM (\"INSPECTION\"). THE ERROR CODE WAS B12251B (MAT RESISTANCE TOO HIGH). AUDI'S INTERNAL DOCUMENTS ACCESSED THROUGH NHTSA REPORT THAT   \"IF FAULT, 'B12251B: SEAT OCCUPIED RECOGNITION SENSOR MAT RESISTANCE TOO HIGH' IS STORED IN THE AIRBAG CONTROL MODULE, DO NOT DIAGNOSE OR REPLACE ANY COMPONENTS FOR THIS FAULT BEFORE PERFORMING THIS REPAIR. THE 69Z4 TOPIC IS NOT THE ONLY CAUSE OF THIS FAULT. ANY DIAGNOSIS RELATED TO THIS FAULT WILL NOT BE COVERED UNDER THIS CAMPAIGN.\" AUDI OPENLY ADMITS THAT THE SCOPE OF THE 69Z4 RECALL AND THE SENSOR ISSUE ARE LINKED TOGETHER BY VIRTUE OF HAVING SIMILAR BEHAVIORS FOR THE CAR SYSTEMS AS WELL AS FAULT CODES. HOWEVER AUDI PERFORMS THE CHEAPER BANDAID OUT OF POCKET AND EXPECTS THE OWNER TO PAY FOR THE FAULTY PART WHICH SHOULD HAVE BEEN PART OF THE RECALL IN THE FIRST PLACE. THIS MANY COMPLAINTS ABOUT THE SAME BEHAVIOUR AND SAME PART (THAT IS TRADITIONALLY NOT YOUR USUAL WEAR&AND&TEAR PART LIKE A BATTERY) WARRANT AN INVESTIGATION OF THE MALPRACTICES OF AUDI IN DEALING WITH THIS RECALL AND ITS CUSTOMERS.",
        "vin": "WAUWFLFF7F1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361543,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR ON A CITY STREET, THE SEAT BELT WARNING LIGHT CAME ON, A WARNING CAME ON INDICATING THAT THE PASSENGER AIRBAG WAS DISCONNECTED, FOLLOWED BY AN AUDIBLE WARNING.  THERE WAS AN ADULT PASSENGER IN THE PASSENGER SEAT WHO WAS PROPERLY BELTED IN.  RECALL \"FIX\" 69Z4 HAS BEEN APPLIED TO THE VEHICLE.",
        "vin": "WAUACGFF6F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360884,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH AN SOMETHING IN THE PASSENGER SEAT A WARNING MESSAGE SAYS THAT BECAUSE OF A MALFUNCTION, THE AIRBAGS ARE TURNED OFF. A FEW SECONDS TO A MINUTE OR TWO LATER ANOTHER MESSAGE SAYS THE AIRBAGS ARE ON. THIS SEQUENCE CAN APPEAR MANY TIMES IN AN HOUR OF DRIVING OR NOT APPEAR AT ALL FOR SEVERAL DAYS. THIS APPEARS TO BE THE EXACT SAME ISSUE AS REPORTED AND RECALLED FOR CERTAIN 2018 AUDI S5 AND A5 VEHICLES ALONG WITH SOME 2017-2018 A4S. I'VE NOTICED THIS HAPPENING WHEN THE CAR IS IN MOTION. I THOUGHT THAT I HAD THE ORIGINAL AIRBAG ISSUE FIXED WHEN IT WAS TAKEN TO BE SERVICES FOR THE RECALL OF FAULTY WIRING UNDERNEATH THE PASSENGER SEAT, BUT AUDI IN CARY NORTH CAROLINA SAID THAT THIS IS A SEPARATE ISSUE AND NOT COVERED UNDER THE FORMER RECAL.",
        "vin": "WAUEFGFF5F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355277,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI A3 CONTINUALLY HAS A PRESENCE SYSTEM FAULT WHEN THE CAR STARTS WHICH INDICATES THAT THE SYSTEM IS NOT FUNCTIONING PROPERLY.  AS A RESULT IT TURNS OFF THE PASSENGER AIRBAG EVEN WITH THE SEAT OCCUPIED WHICH IS A SAFETY HAZARD.  AUDI HAS INDICATED THAT THIS IS DUE TO A FAULTY SENSOR.  I HAVE BROUGHT THIS ISSUE TO AUDI.S ATTENTION FOR OVER FOUR YEARS WITH NO RESOLUTION.  THIS ISSUE HAS CONTINUED DESPITE A PRIOR RECALL SERVICE ON ANOTHER CONNECTOR WITH THE PODS SYSTEM HOWEVER IMMEDIATELY AFTER THAT FIX THE ISSSUE CONTINUED AND AUDI INDICATES IT ACTUALLY LIKES WITH A FAULTY SENSOR. THIS ISSUE OCCURS RANDOMLY WHEN THE VEHICLE IS STARTED OR WHILE ALREADY DRIVING,  THE ERROR MAKES A LOUD NOISE AND PUT AN ALERT ON THE MAIN DASHBOARD WHICH IS UNNERVING AND DISTRACTING WHILE DRIVING.  I PREVIOUSLY PROVIDED AUDI PICTURES OF THE ALERT MESSAGES MULTIPLE TIMES OVER SEVERAL YEARS WITH NO RESOLUTION.",
        "vin": "WAUEFGFF4F1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354746,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 AUDI A3 ,18000 MILES, O2 SENSOR BANKJ 1(AFTER THE ENGINE) WAS CHANGE BANK 2 CLOSE TO THE EXHAUST NOT CHANGE BUT KEEP GOING BACK THE CHECK ENGINE LIGHT, NEED HELP.",
        "vin": "WAUACGFF8F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350652,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. THE CONTACT STATED THAT THE PASSENGER'S SIDE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED THAT THE FAILURE WAS A FALSE WARNING FROM THE AIR BAG SYSTEM THAT DEACTIVATED THE PASSENGER'S SIDE AIR BAG. THE VEHICLE WAS TAKEN TO RUSNAK/PASADENA AUDI (267 W COLORADO BLVD, PASADENA, CA 91105, (626) 714-3159). THE CONTACT HAD NOT YET AUTHORIZED THE REPAIRS FOR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT HAD NOT YET RESPONDED TO THE VEHICLE OWNER. THE FAILURE MILEAGE WAS 88,000.",
        "vin": "WAUACGFF0F1"
    },
    {
        "components": "STEERING,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344257,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAT FEELS UNSTABLE WHEN I DRIVE OVER 70 MILES ON THE FREEWAY.. ALSO SEATBELTS LOCK ROOM HARD",
        "vin": "WAUACGFF5F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341350,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPT 2019 RECALL FOR AIRBAG CONNECTOR AND WIRING.  REPAIRED IN OCT.  SAFETY BAG WARNING LIGHT CAME ON AGAIN FOR THE SAME SEAT, THEY SAY NOW IT IS SENSOR NOT THE RECALL  ITEM.  THERE ARE 75 OTHER COMPLAINTS ABOUT THIS. SEEMS LIKE RECALL SHOULD HAVE REPLACED SENSOR AS WELL. NOW IT COSTS $1300 TO FIX SENSOR WHICH SHOULD HAVE BEEN DONE AT THE TIME OR AT LEAST OFFERED TO REPLACE WHEN TEHEY HAD THE RECALL SEAT TORN APART TO SAVE $1K IN LABOR.",
        "vin": "WAUACGFF0F1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331322,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG DOES NOT TURN ON. WARNING LIGHT IS DISPLAYED AND ERROR SAFETY MESSAGE IS ON SCREEN WHEN CARE IS TURNED ON AND OPERATING. ADDITIONALLY SEATBELT ALARM CONTINUES TO CHIME WHILE SEATBELT IS USED.",
        "vin": "WAUACGFF2F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329785,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 AUDI A3 HAS ONLY 11,200 MILES ON IT. THE PASSENGER BAG SAFETY LIGHT GOES ON AND OFF INTERMITTENTLY, AND HAS DONE FOR SOME TIME. THE PROBLEM OCCURS MOSTLY WHEN SOMEONE IS SITTING IN THE SEAT, BUT OCCASIONALLY IT WILL OCCUR WHEN THE PASSENGER SEAT IS UNOCCUPIED. THE YELLOW DASH LIGHT COMES ON NEAR THE PASSENGER AND THE AIRBAG LIGHT ON THE INSTRUMENT PANEL ILLUMINATES. THE INFORMATION PANEL ON THE DASH WILL SIMULTANEOUSLY REPORT \"SAFETY SYSTEM: SYSTEM FAULT! SEE OWNER'S MANUAL\" AND \"PASSENGER AIRBAG OFF\" AND \"AUDI PRE SENSE: SYSTEM FAULT!\".      THIS FAULT OCCURRED APPROXIMATELY 8-10 TIMES DURING A 1,000 MILE TRIP MY WIFE AND I TOOK DURING MEMORIAL DAY WEEKEND IN 2020. I HAD MY WIFE TRY ADJUSTING THE ANGLE OF THE SEAT, RAISING THE FRONT PORTION HIGHER TO TRY TO APPLY MORE BODY WEIGHT TO THE SEAT. MY THINKING WAS THAT IT WAS A SENSOR ISSUE. THE SYSTEM IS DESIGNED TO SHUT OFF IF A PASSENGER DOES NOT WEIGH ENOUGH FOR THE AIRBAG TO SAFELY DEPLOY. THE SYSTEM FAULT ACTS LIKE IT DETECTS SOME WEIGHT THERE, BUT NOT ENOUGH TO ENGAGE THE AIRBAG SAFELY. MY BEST GUESS IS THAT THE WEIGHT SENSOR IS NOT REGISTERING THE WEIGHT CORRECTLY OR MAINTAINING A CONSISTENT READING THAT WOULD KEEP THE AIRBAG ENGAGED OVER TIME. THE PICTURE ATTACHED TO THIS REPORT WERE TAKEN ON MAY 25, 2020 DURING OUR TRIP, BUT THIS HAPPENS ON A REGULAR BASIS.     AFTER GETTING ONLINE TO GOOGLE FOR ANSWERS, I CAN SEE THAT MANY OTHERS ARE DESCRIBING THE SAME PROBLEM I AM EXPERIENCING. I SEE THAT THE 2015 MODEL MAY HAVE BEEN LEFT OUT OF A RECALL TO FIX THIS ISSUE AND I WOULD LIKE TO ADD MY INPUT TO ALL OTHERS THAT THIS IS A SIGNIFICANT SAFETY ISSUE AND SHOULD BE RECONSIDERED FOR MODEL YEAR 2015 AUDI A3 SEDANS (AND POSSIBLY OTHER AUDI MODELS).  *TR",
        "vin": "WAUCJGFF8F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2020",
        "dateOfIncident": "05/31/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327187,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST 4 DAYS I HAVE HAD SOMEONE GET INTO MY PASSENGER SEAT AND RANDOMLY WHILE I'M DRIVING AND THE CAR IS IN MOTION THE AIRBAG SIGNAL STATES ' PASSENGER AIRBAG OFF' IT FLASHES TO NOTIFY ME IT HAS TURNED OF. I COMPLETED RESEARCH AND FOUND THEIR IS A RECALL ON AUDI VEHICLES FOR THIS COMPLAINT BUT ONLY 2016 AND A FEW OTHER YEARS. I BELIEVE THIS RECALL NEEDS TO BE EXTENDED TO 2015 AS WELL.  *TR",
        "vin": "WAUACGFF6F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325137,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. THE CONTACT STATED THAT THE PASSENGER'S SIDE AIR BAG FAILED TO OPERATE AS DESIGNED. THE CONTACT TOOK THE VEHICLE TO AUDI WESTMONT (276 E OGDEN AVE, WESTMONT, IL 60559) WHERE THE VEHICLE WAS DIAGNOSED WITH AN UNKNOWN AIR BAG FAILURE. THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE HOWEVER, NO ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 139,000.",
        "vin": "WAUEFGFFXF1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "05/11/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324218,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI PASSENGER OCCUPANT SYSTEM CONSISTENTLY FAULTS EFFECTIVELY DISABLING THE PASSENGER AIRBAG. THIS ISSUE OCCURS MOSTLY WHILE A PASSENGER IS IN THE SEAT, BUT FROM TIME TO TIME WILL OCCUR WHEN NO PASSENGER IS PRESENT. IT OCCURS WHILE STATIONARY AND IN MOTION DURING NORMAL DAY TO DAY DRIVING. I HAVE HAD THE PODS RECALL PERFORMED ON THE VEHICLE BACK IN SEPTEMBER 2019, WHICH HAS MADE THE ISSUE WORSE.  *TR",
        "vin": "WAUKFHFFXF1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321938,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI RECALL CAMPAIGN 69Z4 WAS SUPPOSED TO FIX THE PASSENGER OCCUPANT DETECTION SYSTEM MALFUNCTION BY REPLACING A CONNECTOR AND HARNESS. THIS HAS NOT FIXED THE ISSUES. MANY AUDI CUSTOMERS SAYING THE SEAT BELT ALARM AND WARNING LIGHT STILL COME ON. MINE WILL NOT SHUT OFF UNTIL I PLUG THE SEAT BELT BACK IN, BUT THEN MY AIRBAGS TURN ON AND OFF RANDOMLY EVEN IF THERE IS AN OCCUPANT IN THE PASSENGER SEAT. THIS WAS THE CHEAP FIX. AUDI ACKNOWLEDGES THE ISSUE WITH THE ACTUAL PODS SENSOR BUT MAKES CUSTOMERS PAY $1,200 FOR THE SAFETY FIX. THIS SHOULD HAVE BEEN PART OF THE RECALL. AUDI BLAMES MINE ON THE DAMAGE TO THE REAR OF THE CAR, BUT THE PHOTOS PRE-DATE THE DAMAGE TO THE REAR BUMPER.",
        "vin": "WAUKFGFF5F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "04/03/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320398,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI HAS A RECALL TO FIX THE WIRING IN THE PODS SYSTEM, ACKNOWLEDGING THAT THE COMPONENTS TO DETECT AND PROTECT A PASSENGER IN THE SEAT EXISTS.  THE RECALL DOES NOT FIX THE SENSOR ITSELF WHICH HAS BEEN IDENTIFIED AS AN EXISTING FAILURE ISSUE. KNOWING THIS IS A SAFETY ISSUE AUDI HAS YET TO RECALL THE SENSOR AS PART OF THE SYSTEM TO DETECT A PASSENGER IN THE SEAT. THIS IS AS BAD IF NOT WORSE THEN THE AIRBAG RECALL THAT EXISTS TODAY.  THEIR EXPLANATION IS THAT THE SENSOR IS NOT PART OF THE RECALL BECAUSE ITS A DIFFERENT COMPONENT THAN THE WIRING HARNESS, EVEN THOUGH THE HARNESS PLUGS INTO THE SENSOR AND THE CONNECTION WAS PART OF THE PREVIOUS RECALL. INSTEAD THEY WANT TO CHARGE BETWEEN 1200 AND 1300 DOLLARS FOR EACH REPLACED SENSOR.  THIS ISSUE WILL CAUSE THE PASSENGER AIRBAG TO FAIL TO ACTIVATE BECAUSE THE SENSOR DOES NOT REGISTER CORRECTLY WHETHER THERE IS A PASSENGER OR NOT. ADDITIONALLY THERE COULD BE INJURY TO THE DRIVER ON DEPLOYMENT OF THE PASSENGER AIRBAG INADVERTENTLY DUE TO SENSOR FAILURE TO CORRECTLY IDENTIFY OCCUPANT.  THIS IS NOT A WEAR AND TEAR ITEM AND SHOULD NOT BE MANAGED AS SUCH AS A FAILING USE PART. IT SHOULD BE RECALLED AS A SAFETY ITEM.",
        "vin": "WAUACGFF4F1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/22/2020",
        "dateOfIncident": "09/25/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318915,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR KEEPS HAVING A SAFETY SYSTEM FAULT. THERE ARE TWO ERRORS:  1. THE \"PAASENGER AIRBAG OFF\" INDICATOR STAYS ON EVEN WHEN A PASSENGER IS IN THE FRONT PASSENGER SEAT  2. BUCKLE SEATBELT SIGN IS ON WHEN THERE IS NO PASSENGER    I TOOK MY CAR FOR A RECALL BUT IT DID NOT FIX THE ISSUE OF THE AIRBAG BEING OFF! THIS HAS BEEN HAPPENING FOR QUITE SOME TIME.",
        "vin": "WAUEFGFF2F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310473,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RECENT CAR INSPECTION DUE TO RECALL FOR PASSENGER OCCUPANT DETECTION I WAS INFORMED THAT WATER PUMP WAS LEAKING AND IT NEEDS TO BE REPLACED. VEHICLE HAS ONLY 55 000 MILES ON IT. OTHER AUDI MODELS APPEAR TO HAVE THE SAME ISSUE AND THEY HAVE BEEN RECALLED, HOWEVER NO RECALLS HAVE BEEN ISSUED FOR AUDI A3 2015. AS A MANUFACTURER AUDI MUST TAKE THE RESPONSIBILITY FOR FAULTY PARTS AND IT SHOULD REPLACE THEM ON THEIR OWN EXPENSE.",
        "vin": "WAUACGFF9F1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308302,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY 2 MIN. HEADLIGHTS TURN OFF BY IT SELF FOR 2-3 SECONDS.. THEN TURN BACK ON..  PEOPLE ON FRONT OF YOU THINK THAT YOU HIGH BEAM THEM...  BUT THE DANGER IS WHEN YOU DRIVE LIKE ON BRIDGE OR HIGHWAY WHERE NO STREET LIGHTS.. ROAD MAKING TURN.. AND YOUR HEADLIGHTS TURN OFF FOR COUPLE OF SECONDS..   AND THIS ON/OFF HEADLIGHTS THING GOING ON STOP.. DOESN'T MATTER IF VEHICLE IN MOTION.. PARKED OR EVEN ENGINE NOT RUNNING...",
        "vin": "WAUACGFF8F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306575,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WATER PUMP/THERMOSTAT HOUSING IS LEAKING COOLANT OUT OF THE ENGINE.   THIS OCCURS ON NEARLY ALL MQB CHASSIS VW/AUDI'S WITH THE EA888 GEN 3 2.0 TFSI ENGINE.  IT IS A WIDELY KNOWN ISSUE.",
        "vin": "WAUEFGFF4F1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/24/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301550,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS RECENTLY A PODS RECALL FOR THE WIRING HARNESS GOING TO THE OCCUPANT DETECTION SENSOR THE RECALL DID NOT FIX THE ISSUES FOR MANY PEOPLE. CAR WILL RANDOMLY THINK SOMEONE IS SETTING IN THE PASSENGER SEAT AND ACTIVATE AIRBAG AND CAUSE THE SEATBELT LIGHT TO CHIME CONSTANTLY WHILE DRIVING CAUSING THE AIR BAG TO TURN ON AND OFF. THE SENSOR IMBEDDED IN THE BOTTOM OF THE SEAT IS FAULTY.",
        "vin": "WAUEFGFF0F1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/08/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298286,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VENT MOTORS FOR DEFROST FLAPS STOP WORKING CAUSING SCREEN TO FOG WITH VERY THICK MIST.  CAN HAPPEN RANDOMLY EVEN WHILE BLOWER IS ON THE SCREEN POSITION AT FULL BLAST",
        "vin": "WAUEFGFF2F1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298287,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER PUMP / THERMOSTAT HOUSING FAILURE CAUSING COOLAT TO LEAK. ALL OF MY COOLANT WAS DRAINED BEFORE LOW COOLANT LIGHT CAME ON.",
        "vin": "WAUEFGFF2F1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277221,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A SMALL CRACK ON THE SUNROOF GUIDE RAIL BEZEL IN THE FRONT CORNER OF SUN ROOF ON THE DRIVERS SIDE ON THE BLACK TRIM PART ABOUT A WEEK AGO. TODAY I NOTICED THE CRACK TO BE ABOUT 2\" LONG AND THE BLACK TRIM SEPARATED ALLOWING WATER TO GO UNDERNEATH THE ROOF OF THE CAR. I ALSO NOTICED TODAY THE PASSENGER SIDE STARTING TO CRACK AS WELL. NEVER SAW THIS BEFORE ON THE CAR UNTIL ABOUT A WEEK AGO. CAR HAS NEVER BEEN IN AN ACCIDENT. THE CAR HAS 18,000 MILES ON IT AND IS GARAGE KEPT, NEVER DRIVEN IN TEMPERATURES UNDER 30 DEGREES F.",
        "vin": "WAUHJGFF8F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269492,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2015 AUDI A3.AUDI RECENTLY HAD A RECALL (#69Z4) TO ADDRESS AN ISSUE WITH THEIR PODS SENSOR SYSTEM. AUDI CLAIMED THE FIX AS A REVISED WIRING CONNECTION AND CABLE ROUTING. MY A3 EXPERIENCED THE EXACT SYMPTOMS AND ISSUES THE RECALL COVERED. I TOOK IT IN FOR REPAIR HOWEVER IMMEDIATELY AFTER PICKING UP THE CAR THE ISSUE STILL PERSISTS. DEALER SAYS IT IS ACTUALLY AN ISSUE WITH THE PODS SENSOR ITSELF BUT THAT THEY WILL NOT REPAIR THIS UNDER WARRANTY. I CALLED AUDI USA WHO CLAIMS THE SAME. IT APPEARS THEIR FIX IS NOT ROBUST ENOUGH TO FIX THE ACTUAL PROBLEM BUT THEY WILL NOT CORRECT IT FURTHER. AS IT STANDS NOW MY CAR STILL WILL NOT ALLOW THE AIRBAG TO WORK PROPERLY WHILE A PASSENGER IS THERE OR NOT. AIRBAG WARNING GOES OFF CONSTANTLY AND \"AIR BAG OFF\" LIGHT IS ILLUMINATED NEARLY ALL THE TIME BUT WILL INTERMITTENTLY GO ON AND OFF AT RANDOM TIMES. HOW EVER, AFTER GOING BACK INTO THE AUDI DEALERSHIP, THE REPRESENTATIVE INFORMED ME THAT I NEEDED TO REPLACE THE PRESSURE SENSOR UNDER THE FRONT PASSENGER SEAT. PART NUMBER : 8V0898522S AND N0152612 WOULD NEED TO BE PURCHASED TO FIX THE AIR BAG LIGHT ISSUE. THE PRICE OF THE PART BEING $1000 THAT IS NOT INCLUDING LABOR. IN THE STATEMENT ON THE RECALL IT SAYS THAT THIS ISSUE WILL BE RESOLVED. THE REPRESENTATIVE AT AUDI USA INSISTED THAT I SHOULD GO TO AN AUTHORIZED AUDI DEALERSHIP TO GET THE WORK DONE SO THIS WHEN IT IS COMPLETED, I AM TO SEND HER A COPY OF THE INVOICE AND WORK ORDER TO BE REVIEWED BY HER SUPERVISOR FOR POSSIBLE REIMBURSEMENT. SHE ALSO STATED THAT I WAS NOT THE ONLY PERSON EXPERIENCING THIS ISSUE. I HOWEVER REFUSE TO SPEND $1000+ TO FIX THE MAIN PROBLEM WITH THIS RECALL. THIS SHOULD BE INCLUDED IN THE RECALL, NOT JUST REROUTING THE WIRES AND REPLACING THE CONNECTOR TO THE SENSOR BUT ACTUALLY REPLACING THE SENSOR IT SELF AND NOT TRYING TO PUT A BAND-AID ON THE ISSUE. THIS IS A MAJOR SAFETY ISSUE. THANK YOU",
        "vin": "WAUACGFF9F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269196,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI RECENTLY HAD A RECALL (#69Z4) TO ADDRESS AN ISSUE WITH THEIR PODS SENSOR SYSTEM.  AUDI CLAIMED THE FIX AS A REVISED WIRING CONNECTION AND CABLE ROUTING.  MY A3 EXPERIENCED THE EXACT SYMPTOMS AND ISSUES THE RECALL COVERED.  I TOOK IT IN FOR REPAIR HOWEVER IMMEDIACY AFTER PICKING UP THE CAR THE ISSUE STILL PERSISTS.  DEALER SAYS IT IS ACTUALLY AN ISSUE WITH THE PODS SENSOR ITSELF BUT THAT THEY WILL NOT REPAIR THIS UNDER WARRANTY.  I CALLED AUDI USA WHO CLAIMS THE SAME.  IT APPEARS THEIR FIX IS NOT ROBUST ENOUGH TO FIX THE ACTUAL PROBLEM BUT THEY WILL NOT CORRECT IT FURTHER.   AS IT STANDS NOW MY CAR STILL WILL NOT ALLOW THE AIRBAG TO WORK PROPERLY WHILE A PASSENGER IS THERE OR NOT.  AIRBAG WARNING GOES OFF CONSTANTLY AND \"AIR BAG OFF\" LIGHT IS ILLUMINATED NEARLY ALL THE TIME BUT WILL INTERMITTENTLY GO ON AND OFF AT RANDOM TIMES.",
        "vin": "WAUKFGFF9F1"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257580,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENGINE STOPPED WORKING WHILE IN MOVING DOWN THE ROAD.  THE CAR WOULD NOT ACCELERATE ABOVE 10 MILES PER HOUR.  CHECK ENGINE LIGHT CAME ON WITHOUT WARNING AS THE CAR STOPPED FUNCTIONING.  PASSENGER AIR BAG WAS DISENGAGED AND INDICATED IT WOULD NOT DEPLOY EVEN THOUGH A PASSENGER WAS SITTING IN THE SEAT.  SEVERE INJURY COULD HAVE OCCURRED IF THE CAR HAD BEEN REAR ENDED WHEN THE CAR STOPPED WORKING.  CAR HAD BEEN IN FOR MAINTENANCE  AT ALL PREDESIGNATED MANUFACTURER'S SUGGESTED MILEAGE POINTS WITHOUT INDICATION OF ANY ISSUES.  *JS",
        "vin": "WAU3FLFF5F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254726,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V474000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AUDI BELLEVUE (1533 120TH AVE NE, BELLEVUE, WA 98005, (425) 249-7388) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUEFGFFXF1"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253010,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HER HUSBAND WHO OWNS A 2015 AUDI A3. THE VEHICLE WAS PURCHASED IN MARCH OF 2019. WHILE THE CONTACT'S HUSBAND WAS ATTEMPTING TO PARK THE VEHICLE, HE DEPRESSED THE BRAKE PEDAL AND ATTEMPTED TO REVERSE THE VEHICLE CLOSER TO THE CURB. WHEN THE DRIVER SHIFTED INTO DRIVE AND RELEASED THE BRAKE PEDAL, THE VEHICLE INDEPENDENTLY ACCELERATED AND THE STEERING WHEEL SEIZED. IT TOOK THE DRIVER EXCESSIVE STRENGTH TO TURN THE STEERING WHEEL. THE VEHICLE CONTINUED TO ACCELERATE ON ITS OWN AND CAME TO A STOP WHEN IT CRASHED INTO THE NEIGHBOR'S PARKED AND UNOCCUPIED VEHICLE. A POLICE REPORT WAS NOT FILED. THE CONTACT STATED THAT THE DRIVER WAS IN SHOCK. THE DAY BEFORE THE CRASH, THE RADIO STATIONS INDEPENDENTLY MIXED UP ON THEIR OWN AND THERE WAS A LOT OF STATIC. AN UNKNOWN DEALER WAS CALLED AND NOTIFIED OF THE FAILURE. THE CONTACT PLANNED TO TAKE THE VEHICLE TO A DEALER THE FOLLOWING DAY. AN APPOINTMENT WAS SCHEDULED WITH THE MANUFACTURER TO HAVE SOMEONE INSPECT THE VEHICLE. THERE WERE NO INJURIES. THE VEHICLE WAS NOT TOWED AND WAS ABLE TO BE DRIVEN. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 36,000.",
        "vin": "WAUACGFF5F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246614,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. WHILE OPERATING THE VEHICLE, THE AIR BAG INDICATOR ILLUMINATED, WHICH MEANT THE AIR BAG WAS DEACTIVATED. THE CONTACT STATED THAT THE FRONT PASSENGER SEAT WAS OCCUPIED AT THE TIME OF THE FAILURE. AUDI OF MEADOW LANDS(425 ROUTE 3, EAST SECAUCUS, NJ 07094) WAS NOTIFIED OF THE FAILURE AND STATED THAT THE PART FOR NHTSA CAMPAIGN NUMBER: 19V474000(AIR BAGS) WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUACGFFXF1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241190,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIR BAG IS OFF AND IT'S BEEN MORE THAN 2 MONTHS THAT REMEDY IS NOT YET AVAILABLE. IT'S A BIG SAFETY ISSUE",
        "vin": "WAUCCGFF9F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240252,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER RECALL NUMBER69Z4  NHTSA RECALL NUMBER19V474    RECALL STATUSRECALL INCOMPLETE, REMEDY NOT YET AVAILABLE.    VEHICLE HAS SINCE FAILED VIRGINIA STATE INSPECTION AND IS NEEDED ON A DAILY BASIS TO GET TO AND FROM WORK.",
        "vin": "WAUCCHFF3F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232643,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI RECALLED THE PASSENGER OCCUPANT DETECTION SYSTEM (PODS) BUT HAS NOT RELEASED A REMEDY YET. MY CAR'S SYSTEM IS DEFECTIVE LEADING TO THE PASSENGER AIRBAG BEING PERMANENTLY TURNED OFF MAKING IT VERY UNSAFE FOR PASSENGERS. THE LOCAL DEALER REFUSED TO FIX IT WITHOUT A REMEDY BEING AVAILABLE. AUDI NEEDS TO GET THIS PODS RECALL COMPLETE BEFORE SOMEONE DIES.",
        "vin": "WAUCCGFF1F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230719,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "\"PODS RECALL\" WE TOOK OUR CAR IN FOR INSPECTION AND WE WERE TOLD THAT THE ELECTRICAL SYSTEM TO THE AIR BAG NEEDS TO BE BEEFED UP BECAUSE WITHOUT THE RIGHT WIRING CONNECTION IT WILL CAUSE SERIOUS PROBLEM IF ACCIDENT OCCURS. THIS HASN'T HIT THE RECALL LIST YET BUT IT'S COMING. IF THE MANUFACTURER KNOWS THAT IT'S GOING TO BE AN ISSUE WHY CANT THEY JUST GO AHEAD AND FIX THE RECALL BEFORE HAND. THEY ARE WANTING US TO PAY $1100 DOLLARS TO FIX AN ISSUE THAT IS SOON TO BE AN UP AND COMING RECALL, BASED ON WHAT I HAVE BEEN READING FROM THE MANUFACTURER ITSELF. WHAT DOES IT TAKE FOR THIS RECALL TO GO INTO THE WORKS, MANY DEATHS OR EVEN A LAWSUIT BECAUSE THEY DIDN'T WANT TO FIX PROBLEM BEFORE HAND. I KNOW MANY OF THESE MONEY COMPANIES ARE TRYING TO SAVE A DOLLAR BUT IS IT WORTH THE COST OF A LOVED ONE JUST TO SAVE A BUCK. WE ARE ALL TRYING TO SAVE A BUCK I GET IT, BUT THIS IS THE COMPANIES REPUTATION ON THE LINE. YOU MAKE A PRODUCT YOU SHOULD WANT PEOPLE TO FEEL AND BE SAFE. IF CONSUMERS KNOW YOU PUT OUT A GOOD PRODUCT AND YOUR CONTINUOUSLY ARE TRYING TO IMPROVE YOUR PRODUCT PEOPLE WILL STAND BY YOU. IT SHOULDNT GET TO THE POINT OF PEOPLE LOSING A LIFE OR GETTING SERIOUSLY INJURED TO FIX A ISSUE YOU COULD AVOID.",
        "vin": "WAUACGFF1F1"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218667,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION CAR HAS 2,300 MILES LEFT TO THE 10K OIL SERVICE CHECK CHANGE AND SHOWING LOW OIL.  THIS IS NOT NORMAL AUDI IS TRYING TO SAY TO JUST TOP OFF THE OIL, YET EXCESSIVE OIL CONSUMPTION WILL CAUSE THE CAR TO NEED ENGINE REPLACEMENT EARLIER THAN IT SHOULD AT ABOUT 70-80-100K MILES AT BEST.  THERE ARE MANY COMPLAINTS AND A CLASS ACTION THAT INVOLVED THIS ISSUE BUT THEY REFUSE TO DO MORE THAN CHANGE OIL AND CHECK FOR LEAKS WHEN THEY KNOW IT IS DUE TO DEFECTIVE PARTS AND I AM UNDER A CERTIFIED WARRANTY UNTIL OCTOBER 2019",
        "vin": "WAUWFLFF9F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/12/2019",
        "dateOfIncident": "11/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207059,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONTI PRO CONTACT TIRES 225/40R/18 92HXL WHILE DRIVING 65 MPH THE FRONT DRIVER SIDE THREAD SEPERATED CAUSING THE TIRE TO BLOW OUT. LOSING CONTROL AND ALMOST CRASHING THE VEHICLE. I WAS LEFT STRAINED UNTIL TOW TRUCK ARRIVED AT THE SCENCE.",
        "vin": "WAU7FLFF9F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190852,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR FLASHED AND THEN REMAINED ILLUMINATED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V824000 (AIR BAGS). THE VEHICLE WAS TAKEN TO AUDI CALABASAS (24650 CALABASAS RD, CALABASAS, CA 91302, (818) 574-3211) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "WAUEFGFF6F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171413,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. WHILE A PASSENGER WAS SEATED IN THE FRONT PASSENGER SEAT, THE AIR BAG WARNING INDICATOR ILLUMINATED, SIGNALING THAT THE AIR BAG WAS DEACTIVATED. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED. AUDI OKLAHOMA CITY (LOCATED AT 13000 BROADWAY EXT, OKLAHOMA CITY, OK 73114, (405) 748-8001) WAS CONTACTED AND A DIAGNOSTIC APPOINTMENT WAS SCHEDULED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "WAU5CLFF4F1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170278,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "NO RECALLS CONNECTED TO VIN, DESPITE RECALLS SHOWING ACCORDING TO NHTSA.ORG WEBSITE FOR \"2015 AUDI A3\" AND VISIBLE COMPLAINTS FOR ISSUE. ISSUE IS LOW  PRESSURE FUEL PUMP FAILURE AND FUEL TANK. PER DEALER SERVICE DOCUMENTATION/ RECEIPT  \"FAULTY LOW PRESSURE FUEL\" PUMP. CAR AT 29000 MILES WOULD HAVE A NO START OR START AND IMMEDIATELY SHUT OFF, AT TIMES RUN BUT ENGINE POWER CUTTING OUT WHILE RUNNING NORMALLY BELOW 50 MPH, SPUTTERING. CHECK ENGINE LIGHT ON. DEALER FIRST REPLACED HIGH PRESSURE FUEL PUMP, WHICH DID NOT RESOLVE ISSUE. THE REPLACEMENT OF LOW PRESSURE FUEL PUMP DID FIX THE ISSUE. NOW VEHICLE AT 33000 MILES AND IS UNABLE TO TAKE FUEL FROM ANY GAS STATION PUMP. PER NHSTA.ORG WEBSITE, FOR \"2015 AUDI A3\" THERE IS A RECALL FOR THE FUEL TANK. REMEDY TO FIX ISSUE PER CERTIFIED MECHANIC IS FUEL TANK REPLACEMENT. PER NHSTA.ORG WEBSITE AGAIN, FOUR RECALLS SHOWING FOR \"2015 AUDI A3\" OF THESE FOUR 1) SUCTION PUMP MAY ALLOW FUEL INTO THE EVAP SYSTEM AND 2) IMPROPER PLATING MAY CAUSE FUEL PUMP TO FAIL ARE MORE THAN LIKELY WHAT IS AFFECTING MY VEHICLE BUT NOT CONNECTED TO MY SPECIFIC VIN. CURRENT MILEAGE OF CAR IS 33540. ALL PHYSICAL DOCUMENTATION / RECEIPTS AVAILABLE.",
        "vin": "WAUEFGFF0F1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165008,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANMISSION ISSUES. 51,000 MILES AND TRANSMISSION IS STUCK IN 1ST GEAR. DRIVING NORMALLY ONE MINUTE AND IT DOWN SHIFTS AUTOMATICALLY TO 2ND GEAR. WAS DRIVING NORMAL ON A LOCAL HIGHWAY AND WAS CRUISING UNTIL IT SUDDENLY STARTED DOWNSHIFTING AND TRANSMISSION LIGHT COMES ON. ALL SERVICES HAVE BEEN COMPLETED PER AUDI.",
        "vin": "WAUBFGFF5F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163725,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER OCCUPANT DETECTION SYSTEM FAILURE, RESULTING IN ILLUMINATED AIR BAG MALFUNCTION INDICATOR LAMP.  EXCESSIVE RESISTANCE IN THE OCCUPANT SENSOR MAT OF THE FRONT PASSENGER SEAT, INDICATING AN INTERNALLY FAILING SENSOR AND RESULTING IN THE VEHICLE AIR BAG SYSTEM BECOMING DISABLED.  AUDI HAS ISSUED RECALLS FOR OTHER VEHICLE MODELS IN THIS YEAR FOR THIS EXACT DEFECT, AND THE RESOLUTION IN THOSE INSTANCES IS TO INSTALL AN UPDATED PART WITH A PROTECTIVE COVER THAT WILL PREVENT PREMATURE FAILURE OF THE NEW SENSOR.  AUDI HAS NOT EXPANDED THE RECALL TO INCLUDE THE AUDI A3 AS OF THE DATE OF THIS WRITING.  THIS PARTICULAR VEHICLE IS A 2015 AUDI A3 PREMIUM PLUS FWD SEDAN WITH SPORT SEATS AND 1.8L GASOLINE ENGINE.  AUDI DOES NOT APPEAR TO OFFER A REPLACEMENT PART AT THIS TIME, POSSIBLY AN INDICATION THAT THE PART HAS BEEN DESIGNATED OBSOLETE IF THE VW AUDI GROUP IS CURRENTLY INVESTIGATING THE ISSUE AND UPDATING THE PART.  UNFORTUNATELY, THIS LEAVES CONSUMERS WITHOUT A REPAIR OPTION WHILE OPERATING A VEHICLE WITHOUT A FUNCTIONING SAFETY RESTRAINT SYSTEM.  DIAGNOSTIC TROUBLE CODE: 9577755 / B1225 1B ; IDENTICAL TROUBLE CODE ASSOCIATED WITH THE ACTIVE RECALL(S) THAT AS OF YET ARE NOT EXTENDED TO THE A3 VEHICLES.",
        "vin": "WAUCCGFF2F1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163600,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LEAKING, THERMOSTAT AND WATER PUMP DEFECTIVE. CAR HAS UNDER 26000 MILES. MULTIPLE ONLINE FORMS REPORTING SAME ISSUE. VEHICLE WAS STATIONARY WHEN VEHICLE ALERTED LOW COOLANT. WINTER CLIMATE.",
        "vin": "WAUBFGFFXF1"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161367,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING. THE VEHICLE WAS RESTARTED, BUT THE FAILURE RECURRED AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AUDI NORTH PARK  (210-960-6000, LOCATED AT 15670 I-35, SELMA, TX 78154) WHERE THE TECHNICIAN DIAGNOSED AND REPLACED THE FUEL PUMP. THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 42,000.",
        "vin": "WAUEFGFF1F1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "09/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132942,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "\"UNDER INFLATED LEFT FRONT TIRE\" MESSAGE CAME ON. TOOK IT TO AUDI SERVICE CENTER IN GAINESVILLE, FL. AFTER CHECKING THE TIRES, THE ENGINE WOULD NOT START. AFTER SEVERAL ATTEMPTS IT STARTED BUT KEPT STALLING. THEY ORDERED A N290 VALVE AND REPLACED IT, STILL HAVE SAME PROBLEM AND NO WARNING MESSAGES. THEY CONTACTED AUDI HEADQUARTERS YESTERDAY, BUT HAVE NOT RESOLVED THE PROBLEM. WAITING TO HEAR FROM THEM.",
        "vin": "WAUKFGFF3F1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "09/17/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130439,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PITCH NOISE YOU CAN HEAR FROM THE FUEL PUMP.  CAR STALLED ON ME.  MY VIN IS NOT APART OF THE CURRENT NHTSA CAMPAIGN NUMBER: 15V229000.  WOULD LIKE TO GET MY FUEL PUMP REPLACED BEFORE IT STALLS OR WON'T START AGAIN ON ME.",
        "vin": "WAUEFGFF6F1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130450,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKING OR CLUNKING NOISES FROM THE FRONT END SUSPENSION.  ASKED MY DEALER ABOUT IT AND THEY SAID THEY COULDN'T DUPLICATE IT.  THE MOMENT I GOT BACK INTO IT REOCCURRED WHEN I WENT OVER A BUMP. I'VE NOTICED MAY COMPLAINS/AUDI TSBS POSTED ABOUT THE REAR END AND THE FRONT END.  LUBRICATION REQUIRED OR REMOUNTING/REPLACING THE SHOCK MOUNTS.",
        "vin": "WAUEFGFF6F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128355,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG SENSOR NOT PROPERLY FUNCTIONING CAUSING THE AIR BAG TO NOT TURN ON WHEN PASSENGER IS IN SEAT",
        "vin": "WAUACGFF2F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128352,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG SENSOR NOT PROPERLY FUNCTIONING WITH PASSENGERS IN SEAT. AIR BAG WOULD NOT ACTIVATE DUE TO SENSOR NOT FUNCTIONING PROPERLY. THIS WAS REPORTED TO AUDIUSA AND THE DEALERSHIP HOWEVER I WAS TOLD THIS WAS NOT COVERED AND I WOULD HAVE TO PAY OUT OF POCKET. I WAS GO EN A DISCOUNT, HOWEVER THIS IS A HUGE SAFETY CONCERN!",
        "vin": "WAUACGFF2F1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113153,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE RADIATOR WAS BEING REPLACED DUE TO CRACKS AND LEAKING AT 57,000 MILES, MY MECHANIC NOTICED THE WATER PUMP ASSEMBLY WAS MELTING.  THE TOP OF THE ASSEMBLY WAS MELTING AWAY AND COULD CAUSE A FIRE HAZARD.  I CONTACTED THE DEALER (MISSION VIEJO AUDI) WHO STATED THERE WAS NO RECALL ON THE VEHICLE AND SINCE IT WAS OUT OF WARRANTY, I WAS RESPONSIBLE FOR THE ISSUE.  I SHOWED THE SERVICE TECHNICIAN THE PHOTOS, AND HE INDICATED THEY COULD LOOK AT IT BUT IT WOULD COST ME A DIAGNOSTIC FEE OF $160.  IT IS EVIDENT THE WATER PUMP NEEDS TO BE REPLACED SO NOT SURE WHAT NEEDS TO BE DIAGNOSED.  SINCE THERE WERE NO REPORTED ISSUES, HE SAID I WOULD ULTIMATELY BE HELD RESPONSIBLE FOR REPAIRS AND REPLACEMENT.  I LATER TALKED TO AUDI CORPORATE AND WAS BASICALLY TOLD THE SAME THING AND I WOULD HAVE TO GET IT FIXED.  THEY DID INDICATE THERE MAY BE SOME 'MINIMAL GOOD WILL' FEE ADJUSTMENT BASED ON THE DIAGNOSIS FROM THE DEALER.  THEY TOLD ME THERE HAVE BEEN NO REPORTED PROBLEMS OF THIS NATURE.  A CLAIM WAS FILED WITH THEM.  SINCE THE DIAGNOSIS FEE AND COST OF REPLACEMENT FROM THE DEALER IS SIGNIFICANTLY MORE THAN MY MECHANIC CHARGES, I MAY HAVE TO HAVE HIM DO THE WORK AS THIS APPEARS TO BE A SAFETY HAZARD TO ME.  THE DEALER WAS NOT INTERESTED IN ADDRESSING ANY POTENTIAL SAFETY PROBLEMS.  I AM CONTACTING YOU TO SEE IF THERE HAVE BEEN ANY COMPLAINTS OF THIS NATURE RECEIVED AND TO DOCUMENT WHAT I AM EXPERIENCING  IN CASE OTHER SIMILAR ISSUES ARISE IN THE FUTURE.  PHOTOS ARE ATTACHED FOR REFERENCE AND ANY ASSISTANCE IS APPRECIATED.  THANK YOU",
        "vin": "WAUACGFF7F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093931,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT DETECTION MAP IS FAULTING OUT AND I AM CONCERNED THAT THE AIRBAG WILL NOT DEPLOY IF AN ACCIDENT OCCURS. APPARENTLY IT IS MY FAULT AND I HAVE TO PAY TO FIX IT.",
        "vin": "WAUACGFF9F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "03/05/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083567,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST COMPRESSION AT ONLY 43,670 MILES TO FOURTH CYLINDER.  ENGINE WAS REBUILT BY AUDI DEALER.  FOUND PIECES OF OIL CONTROL RING FROM A PISTON IN OIL PAN, AIR LEAKING THROUGH INTAKE, SEATING SURFACE FOR INTAKE VALVE NUMBER 2 ON CYLINDER 4 WAS BURNT AND UNABLE TO SEAT PROPERLY DUE TO SPRING ON THAT VALVE BEING WEAKER THAN OTHERS.",
        "vin": "WAUBFGFFXF1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080097,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINENTAL TIRES THAT CAME INSTALLED ON MY 2015 AUDI A3 AND APPEAR TO EITHER HAVE BEEN DEFECTIVE OR POORLY INSTALLED. I STARTED EXPERIENCING LEAKS IN THE REAR RIGHT TIRE OF THE CAR, AND TOOK IT TO A MECHANIC FOR INSPECTION. THE MECHANIC'S REPORT (ATTACHED, ALONG WITH PICTURES OF THE TIRE) STATES: \"DAMAGE TO BEAD OF TIRE WHERE IT SEATS (SIC) ... THESE CONDITIONS ARE CAUSED BY IMPROPER USE OF TOOLS, INCORRECT TECHNIQUES USED WHEN MOUNTING/DEMOUNTING TIRES AND/OR LACK OF BEAD LUBRICATION\".   I HAVE BEEN DRIVING MY TWO YOUNG CHILDREN IN THIS CAR WITH THIS DEFECTIVE TIRE FOR ABOUT 16,000 MILES AND 3 YEARS, AND DON'T EVEN WANT TO THINK ABOUT WHAT COULD HAVE HAPPENED HAD THE TIRE HAD FAILED AT 65MPH.   PLEASE NOTE THAT YOUR WEBSITE FAILS WHEN TRYING TO UPLOAD PICS. HAPPY TO DO SO AT A LATER DATE.",
        "vin": "WAUCCGFF2F1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080095,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM DAY 1 OF OWNERSHIP OF THE CAR, THERE IS AN OCCASIONAL DELAY FROM RELEASING THE BRAKES UNTIL THE CAR MOVES FORWARD WHEN IN GEAR ON A FLAT ROAD, UP TO 2 SECONDS. ON HILLY ROADS, THE CAR WILL ROLL IN THE DIRECTION OF THE HILL UNTIL THE GEARS ACTUALLY ENGAGE. THIS IS VERY DANGEROUS WHEN TRYING TO GET INTO MOVING TRAFFIC (E.G. GETTING INTO A FEEDER ROAD FROM A COMPLETE STOP) OR WHEN DRIVING IN CITIES LIKE SAN FRANCISCO.   I HAVE TAKEN THE CAR TO AUDI MULTIPLE TIMES WITH THIS CONCERN, HAVE DRIVEN LOANER A3 THAT DID NOT EXPERIENCE THIS ISSUE, BUT THEY NEVER ADDRESSED THIS MAJOR ISSUE.",
        "vin": "WAUCCGFF2F1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064278,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR GAS 60,000 MILES ON IT AND THE HIGH PRESSURE FUEL PUMP ON THE VEHICLE FAILED!!! AS WELL AS I CANNOT PUT GAS IN MY CAR. AUDI HAS NOTE OF BOTH PROBLEMS AFFECTING NUMEROUS VEHICLES AND CHOOSES TO NOT DO ANYTHING CONCERNING IT. THIS IS ABSURD!!! THESE VEHICLES ARE UNSAFE ESPECIALLY SINCE THE ISSUE IS A FUEL ISSUE AND THESE CARS SHOULD NOT BE ON THE ROAD LIKE THIS!! DO SOMETHING!!!",
        "vin": "WAUBFGFF9F1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "01/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063298,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL 15V229000 DATED 04/17/15 DOES NOT SHOW UP IN AUDI SYSTEM, HOWEVER, VOLKSWAGEN GROUP OF AMERICA, INC. HAS LISTED IT FOR MY AUDI A3.  I AM EXPERIENCING THIS DEFECT AS OF JANUARY 9, 2018 WITH VIN #[XXX].  I NEVER RECEIVED A RECALL NOTICE.  ON OCCASION, THE CAR WILL NOT START, OR STARTS FOR A MINUTE AND SHUTS OFF WITH AN INABILITY TO RESTART.  AFTER SITTING FOR AN HOUR OR SO IT WILL START.  I BELIEVE THERE MAY BE A DEFECT WITH THE FUEL PUMP AS DESCRIBED IN RECALL 15V229000.  HOW DO I GET AUDI TO ACCEPT THE RECALL?  I HAVE ALREADY BEEN STRANDED ONCE AND NEEDED A TOW TO AUDI DEALER WHO STATED FUEL PUMP WAS THE ISSUE, BUT VEHICLE HAS NO RECALLS.  I BELIEVE THIS TO BE IN ERROR AND WOULD LIKE IT RESOLVED.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUACGFF8F1"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035797,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I APPLY THE BRAKE OR PUT THE CAR IN PARK, MY VEHICLE ROLLS BACK EVEN THOUGH MY FOOT REMAINS ON THE BREAK.  CONVERTIBLE TOP LEAKS",
        "vin": "WAU6CLFF6F1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2017",
        "dateOfIncident": "10/07/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033197,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. WHILE DRIVING VARIOUS SPEEDS, THERE WAS A STRONG FUEL ODOR IN THE VEHICLE. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER (AUDI NORTH MIAMI, 1995 NE 142ND ST, NORTH MIAMI, FL 33181) WHERE IT WAS DIAGNOSED THAT THE HIGH PRESSURE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED AT 800-411-9988 AND STATED THAT THE VIN WAS NOT INCLUDED IN THE RECALL, AND ASKED THE CONTACT TO SPEAK TO THE GENERAL MANAGER. A CASE NUMBER WAS NOT PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 52,123.",
        "vin": "WAUEFGFF4F1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/19/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995871,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "1 CRACKED RIM AND 1 BENT RIM.  THE CRACKED RIM CAUSED AIR TO LEAK FROM THE TIRE, SO I GOT I BECAME AWARE OF IT AFTER TAKING IT INTO A TIRE SHOP TO INVESTIGATE THE ISSUE.  8 MONTHS LATER I TAKE THE CAR BACK IN DUE TO A VIBRATION BETWEEN 35-40MPH AND I WAS SHOWN THAT THE RIM WAS BENT.  I DON'T REMEMBER EVER HITTING ANYTHING HARD ENOUGH TO THINK THAT I COULD HAVE CRACKED OR BENT A RIM.  I QUESTION THE STRUCTURAL INTEGRITY OF THEIR 19\" RIMS.",
        "vin": "WAUEFGFF0F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993707,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE/ EPC- BOTH LIGHTS HAVE SIGNALED A DOZEN TIMES. THE FIRST FEW TIMES THE DEALERSHIP CALLED THEM \"MISFIRES\". EVENTUALLY THE CAR \"SYMPTOMS\" STARTED TO PROGRESS:    WHEN CAR IS IDLING, CAR STARTS TO ACT LIKE IT IS ABOUT TO STALL.     THEN IT PROGRESSED TO HARD/JERKY SHIFTS INTO 1ST OR 2ND GEAR. NOW EVEN AT HIGHER SPEEDS IT STARTS ACTING UP- GIVING THE FEELING THAT THE CAR MAY STALL. THIS IS A DAILY ISSUE.    TWICE NOW CAR HAS FAILED TO ACCELERATE WHILE ENTERING HIGHWAY. THE WORST SITUATION OCCURRED WHEN CAR WAS BUCKING AND REFUSING TO GO INTO 2ND GEAR. I HAD TO PULL OVER, ON THE ON-RAMP, TURN OFF CAR AND RESTART.     DASH LIGHTS FADE LIGHT/DARK CONSTANTLY. ORIGINALLY I THOUGHT IT WAS AN AUTOMATIC FEATURE, GOING FROM DAY TO NIGHT TIME LIGHTS. LIKE EVERYTHING ELSE IT HAS INCREASED W/ FREQUENCY & CANNOT BE CONNECTED TO CHANGE DAY/NIGHT LIGHT SETTING CHANGE.    KEY FOB DIED WHILE I WAS DRIVING ON HIGHWAY, CAR STALLED ON HIGHWAY. I RESTARTED CAR USING EMERGENCY PROCEDURE (ALIGNING KEY FOB NEXT TO KEY SYMBOL ON DRIVE SHAFT)- THIS IS MEANT TO KEEP CAR RUNNING EVEN W/ DEAD KEY BATTERY. CAR SHUT OFF MULTIPLE TIMES WAITING FOR TOW TRUCK- WHO THEN LOADED MY CAR WHILE RUNNING BECAUSE IT STALLED ON HIM TOO. DID I MENTION THE 4 DAYS PRIOR MY CAR HAD BEEN AT THE DEALERSHIP - SO EITHER WARNING SIGN DIDN'T CORRECTLY NOTIFY OR THEY JUST IGNORED IT.     FIXED  IGNITION COIL, SPARK PLUGS     CURRENT DEALERSHIP DIAGNOSTIC: FAULT TO BAD INJECTOR     SOMEHOW NONE OF THE RECALLS THAT APPLY TO 2015 A3S APPLY TO MY VEHICLE. EVEN THOUGH MOST OF THE DECRIPTIONS APPLY TO CAR ISSUES.",
        "vin": "WAUEFGFFOF1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993165,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. WHILE DRIVING, THE AIR BAG AND SEAT BELT WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (NIELLO AUDI LOCATED AT 2350 AUBURN BLVD SACRAMENTO, CA 95821, (916) 480-2800) APPROXIMATELY THREE MONTHS AGO, BUT THE DIAGNOSTIC RESULTS AND REPAIRS WERE UNKNOWN. THE CONTACT STATED THAT THE FAILURE RECURRED SEVERAL TIMES AFTER THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 28,000.",
        "vin": "WAUEFGFF1F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985349,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 AUDI A3. CONSUMER WRITES IN REGARDS TO VEHICLE ENGINE COMPARTMENT FIRE. *LD    THE CONSUMER STATED THE ENGINE COMPARTMENT CAUGHT FIRE. THE VEHICLE SAT IN AN OPEN AIR SITE WITHOUT A HOOD OR WINDOWS, EXPOSED TO THE WINTER ELEMENTS. 13 DAYS LATER IT WAS INSPECTED BY THE MANUFACTURER, WHO DETERMINED THE FAILURE TO BE DUE TO RODENT NESTING ACTIVITY.  *JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2017",
        "dateOfIncident": "03/06/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959465,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON A STRAIGHTAWAY, I TURNED ON THE HEATER IN MY CAR AND WITHIN MINUTES I WAS FEELING EXTREMELY NAUSEOUS AND FELT LIKE I WAS LOSING CONTROL AND FOCUS. I TRIED TO FIGURE OUT WHAT WAS CAUSING THIS REACTION AND WHY I COULD SMELL A LIGHT FUME IN THE CAR AS THERE WERE NO OTHER VEHICLES IN FRONT OF ME. I TURNED AROUND TO MY CHILDREN IN THE BACKSEAT TO ASK THEM IF THEY FELT OKAY, AND I SAW THAT THEY WERE NEARLY ASLEEP. I OPENED THE WINDOWS AND TURNED OFF THE HEATER SINCE I REALIZED THE CAR WAS FINE BEFORE I TURNED THE HEATER ON. I ALSO REALIZED IT WAS PROBABLY CARBON MONOXIDE POISONING THAT WAS CAUSING OUR SYMPTOMS. ALTHOUGH MY CHILDREN AND I ARE OKAY AS A RESULT OF MY QUICK ACTIONS, I COULD HAVE PASSED OUT AND CRASHED VERY BADLY, HURTING MY FAMILY AND OTHER INNOCENT PEOPLE.",
        "vin": "WAUACGFF7F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2017",
        "dateOfIncident": "02/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954092,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN MOTION ON HIGHWAY TRAVELING AT 65 MPH. ENGINE CEASED WITHOUT WARNING. ABSOLUTELY NO POWER OR ENGINE NOISE WHEN ACCELERATING. VEHICLE WENT FROM 65 TO 0 MPH IN SECONDS. NO STEERING CONTROL AS WELL!! COULD HAVE BEEN KILLED. HEAD OF SERVICE AT AUDI DEALERSHIP SAYS THAT IT HAPPENS ALL THE TIME & AUDI IS DOING ABSOLUTELY NOTHING. SAID DO NOT TAKE CAR BACK...THEY'RE PLAYING \"RUSSIAN ROULETTE\" WITH YOUR LIFE AND WON'T DO ANYTHING UNTIL SOMEONE GETS KILLED.....UPDATED 06/21/17 *BF    *CN",
        "vin": "WAUFMAFC5FN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/03/2017",
        "dateOfIncident": "05/31/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949301,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "POOR PAINT. HEADLIGHTS AND PAINT CHIP AND HAVE SMALL DEFECTS CAUSED EASILY FROM NORMAL TRAVEL.",
        "vin": "WAUBFGFFXF1"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/23/2016",
        "dateOfIncident": "12/16/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937190,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. WHILE DRIVING APPROXIMATELY 55 MPH, THE PANORAMIC SUN ROOF EXPLODED WITHOUT WARNING. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED  THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 50,000.   UPDATED 02/14/17*LJ",
        "vin": "WAUACGFF9F1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2016",
        "dateOfIncident": "11/11/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925550,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI CAR HASNT BEEN RUNNING WELL. I WENT TO MY DEALERSHIP AND NO SENSE OF URGENCY REGARDING THIS MATTER, WAS TOLD THEY WILL CALL ME WHEN THEY HAVE IT BUT \"I SHOULD BE FINE\". I LEFT MY CAR AT THE DEALERSHIP FOR AN OIL CHANGE 11.11.16 BUT DOESNT FIX THE RECALL \"SAFTEY RECALL 20Y5 SUCTION PUMP\" . THIS RECALL NOT GETTING FIXED IS PUTTING MY SAFETY AT RISK.",
        "vin": "WAUACGFFXF1"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "07/19/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886016,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND SUDDENLY HEARD A LOUD EXPLOSION ON THE TOP OF ME, THEN I SAW A MY SUNROOF CRACKED. I STOPPED TO CHECK ON IT AND I CONTINUED DRIVING FOR ABOUT A MILE UNTIL PART OF THE SUNROOF BLEW OFF AND HIT OTHER CARS. NOTHING HIT THE GLASS FOR IT TO BRAKE, IT SIMPLY EXPLODED FROM THE INSIDE OUT (PRESSURE-LIKE EXPLOSION). DEALER SAYS IT HAS NO RECALL AT THE MOMENT FOR MY VEHICLE BUT WHILE DOING MY RESEARCH, I FOUND OUT THAT AUDI CAR OWNERS HAVE HAD THE EXACT SAME PROBLEM IN THE PAST WITH NO RESOLUTION YET. CHASSIS MIGHT CAUSE EXTRA TENSION ON SUNROOF CREATING IT TO EXPLODE, OR INSIDE PRESSURE IS TOO STRONG FOR THE GLASS TO RESIST. SUNROOF AND WINDOWS WERE UP (CLOSED) AT THE TIME OF THE INCIDENT.",
        "vin": "WAUACGFF7F1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884441,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OTHERS HAVE PREVIOUSLY MENTIONED, THE LOW BEAMS / REGULAR HEADLIGHTS ON THE A3 ARE SET TOO LOW AND SO MUCH OF THE ROAD AHEAD REMAINS BLACK.  THIS IS A HAZARD AS YOU ARE NOT AWARE OF OBSTACLES AND TURNS IN THE ROAD UNTIL TOO LATE.",
        "vin": "WAUBFGFF9F1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/04/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872484,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTING SUDDENLY DROPS OFF INTO DARK AREA ABOUT 25 FEET IN FRONT.  THE DEALERSHIP ADJUSTED THE HEADLIGHTS UPWARD TO THE LIMIT THEY CLAIM THEY CAN. HOWEVER, IT REMAINS VERY DARK BEYOND THE HEADLIGHT REACH, WHEN ON UNLIT RURAL ROADS.  A PERSON OR ANIMAL IN THAT ZONE WOULD NOT BE SEEN IN TIME TO AVOID.",
        "vin": "WAUYFTFF0F1"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2016",
        "dateOfIncident": "01/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820852,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A BRAND NEW AUDI A3 2.0T 2015 JULY 2014. RECENTLY, WHILE DRIVING TO A SLUSHY SNOW, THE SYSTEM CAME UP WITH MULTIPLE ERROR. ON 1/12/2016, I WAS DRIVING THROUGH THE SLUSHY SNOW AND 3 ISSUES CAME UP. STABILIZATION CONTROL, TPMS ERROR, AND ABS ERROR, THE STABILIZATION CONTROL IS THE MAIN ISSUE. I WAS SERVING LEFT AND RIGHT WITH LIGHT TAP ON THE GAS WITH THE CAR. LUCKILY, I WAS IN THE LOCAL ROAD AND NOT IN THE HIGH WAY WHEN ISSUES OCCURRED. I TOOK IT TO THE DEALERSHIP SAME DAY, THE FOLLOWING DAY, I WAS NOTIFIED THAT IT WAS \"FIXED\". I GOT INTO THE DEALERSHIP AND TURNED ON THE CAR, ALL THE LIGHTS CAME BACK ON. ISSUE WAS DUE TO A \"FUSE\" SHORTING. NOW I'M WAITING FOR A \"CLUTCH PUMP\" ALL THE WAY FROM GERMANY, EXPECTED 5-15 DAYS.",
        "vin": "WAUBFGFF6F1"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "01/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818824,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 5 MONTHS - ENGINE ALMOST OVERHEATED. CAR TOWED TO DEALER WHERE THEY FOUND THE FAN AND COMPUTER MODULE FAILED AND HAD TO BE REPLACED.  AT 7 MONTHS (CURRENT ISSUE) - WARNING LIGHT CAME ON AND ADVISED THAT BRAKES FAILED. DEALER FOUND THAT THE MASTER BRAKE CYLINDER FAILED. INTERNAL CAMERA SHOWED SEALS FAILED AND WERE LEAKING. THIS CAR IS TOO NEW FOR SUCH A MAJOR PART TO FAIL THIS WAY.",
        "vin": "WAUACGFF2F1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/22/2015",
        "dateOfIncident": "11/22/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS ARE TOO LOW. THERE IS A DROP-OFF SO THERE APPEARS A DARK AREA ABOUT 10 FEET IN FRONT AND TO THE LEFT OF THE DRIVER SIDE WHEN DRIVING. IT'S ALMOST LIKE THE RIGHT BEAM IS CROSSING THE LEFT. THE DEALERSHIP STATED THAT IT HAD TO DO WITH EUROPEAN CODE AND THAT NOTHING COULD BE DONE. I HAVE DRIVEN MANY CARS IN MY LIFE WHERE THIS IS NOT AN ISSUE. THIS IS A SERIOUS SAFETY ISSUE IN MY OPINION - IT'S DIFFICULT TO SEE THE ROAD.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/15/2015",
        "dateOfIncident": "11/11/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790434,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON THE 2015 AUDI A3 INADEQATELY LIGHTS THE ROAD AHEAD ESPECIALLY    ON THE DRIVERS SIDE.  IT IS VERY DIFFICULT TO SEE THE ROAD AHEAD TO THE POINT THAT IT    HAS BECOME A SAFERY PROBLEM TO MYSELF AND ANYONE USING THIS VEHICLE.  THIS     PROBLEM WAS BROUGHT TO THE DEALERS ATTENTION AND WAS TOLD THAT THIS IS HOW THE     HEADLIGHTS WERE DESIGNED AND WE MUST LIVE WITH IT.  THEY LET US DRIVE AN AUDI A4    HOME IN THE DARK AND HAD NO PROBLEM WITH THE HEADLIGHTS AND SEEING THE ROAD    IN SHORT, THERE IS A REAL SAFETY PROBLEM HERE THAT NEEDS TO BE CORRECTED ON THE     2015 AUDI A3 !!!!",
        "vin": "WAUCCGFF7F1"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744914,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A WHITE/CHALK OUTLINE OF THE PASSENGER AIRBAG, MY VEHICLE ONLY HAS 500 MILES ON IT, NOT SURE IF THE THERE IS A AIR BAG OR INFLATOR ISSUE OR A MATERIAL DEFECT. DEALERSHIP IS SAYING THIS IS NORMAL. I HAVE PICTURES  HTTP://I.IMGUR.COM/SOPAGNM.JPG  HTTP://I.IMGUR.COM/LIBXEWO.JPG",
        "vin": "WAUFFGFF3F1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732381,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "3 ISSUES: 1. AFTER INITIAL START-UP, THE CAR JUMPS GEARS AND JOLTS FORWARD FOR THE FIRST 3-5 MINUTES OF OPERATION, ESPECIALLY AT LOWER SPEEDS. THIS HAS BEEN CONSISTENT SINCE THE CAR WAS PURCHASED BRAND NEW IN JANUARY 2015.  2. ALSO, AT HIGHER SPEEDS (65-85MPH), THE CAR SHAKES NOTICEABLY - THE WHEELS/TIRES HAVE BEEN ROTATED AND REALIGNED MULTIPLE TIMES BUT MECHANICS HAVE SAID IT IS AN INTERNAL TRANSMISSION ISSUE. 3. LASTLY, THE TPMS WILL COME ON EVERY MONTH AND NEED RESETTING DESPITE TIRE PRESSURE BEING INTACT.",
        "vin": "WAU6CLFF0F1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "02/16/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704753,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING MY AUDI A3 ON 2/8/2015 I HAVE HAD FOUR FLAT TIRES. DATES OF TIRE FAILURE: 2/16/15, 2/18/15, 3/5/15 AND 4/3.  MY TIRES ARE OEM AND ARE CONTIPROCONTACT 225/40 18 92H.     ALL FOUR TIRE FAILURES HAVE HAPPENED AT LOW SPEED (5-20 MPH) GOING OVER POTHOLES. HOWEVER, I HAVE DRIVEN ON THESE SAME BOSTON ROADS FOR 12 YEARS AND NEVER HAD TIRE DAMAGE FROM A POTHOLE BEFORE. CURRENTLY MY TOTAL MILEAGE IS JUST UNDER 1200. AS I PURCHASED A TIRE WARRANTY, THE WARRANTY COMPANY HAS REPLACED THE TIRES WITH NEW TIRES. THEY CLAIM IT IS JUST BAD ROADS. (SAID ANOTHER CUSTOMER HAD 7 FLATS IN A FEW WEEKS) HOWEVER, ONLINE IT SEEMS THAT THERE ARE MANY COMPLAINTS FOR CONTINENTAL TIRES HAVING SIDEWALL ISSUES (BUBBLING) WITH NO OR MINIMAL ROAD HAZARD AND AT LOW SPEEDS. A DEALERSHIP SERVICE EMPLOYEE SAID THEY HAVE BEEN OVERWHELMED WITH TIRE ISSUES, MOSTLY IN NEWLY SOLD AUDIS. THE DEALERSHIP IS NOT TRACKING ANY DATA ON WHICH TIRES ARE HAVING ISSUES. THEY ARE NOT OFFERING ANY SOLUTIONS. AUDI NATIONAL DID NOTHING.     I AM SCARED TO DRIVE MY CAR. AM A SINGLE WOMAN WHO HAS TO TRAVEL AT ALL HOURS OF THE DAY/NIGHT AND GO ALL OVER THE STATE, INCLUDING THROUGH SOME ROUGH CITY NEIGHBORHOODS OR SECLUDED AREAS. IT HAS BECOME A PROFESSIONAL LIABILITY TO BE SO UNRELIABLE AS I SPEND ALL MY TIME WAITING FOR ROAD SERVICE, TAKING MY CAR TO THE DEALERSHIP, ETC.   *TR",
        "vin": "WAUEFGFF3F1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695495,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. THE CONTACT STATED THAT WHILE ATTEMPTING TO PARK, THE VEHICLE ACCELERATED INDEPENDENTLY AND BECAME DIFFICULT TO BRAKE. ON ANOTHER OCCASION, THE CONTACT THE VEHICLE HESITATE AND FELT AS IF IT WOULD STALL. ALSO, THE CONTACT STATED THAT THE RADIO TURNED ON INDEPENDENTLY AND THAT THE VEHICLE STARTED WITHOUT THE KEY BEING INSERTED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE HIGH IDLE RPM OF THE VEHICLE COULD BE CAUSING THE FAILURE. HOWEVER, THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 5.",
        "vin": "WAUACGFF7F1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/20/2015",
        "dateOfIncident": "02/16/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689613,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A3. THE CONTACT STATED THAT THE TPMS WARNING LAMP INDICATOR FAILED TO ILLUMINATE WHEN THE TIRES WERE LOW. WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT'S VEHICLE STRUCK A POTHOLE IN THE ROAD. THE FRONT DRIVER SIDE TIRE DEFLATED. THE CONTACT MENTIONED THAT THE FAILURE RECURRED MONTHS LATER. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO REPLACED THE FRONT DRIVER SIDE TIRE TWICE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 450.",
        "vin": "WAUEFGFF3F1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "11/12/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669607,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR LOST POWER WHILE MOVING IN HIGHWAY TRAFFIC. TOTALLY LOSS OF POWER. UNABLE TO RESTART.   *TR",
        "vin": "WAUEFGFF3F1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "12/31/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669609,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TOTAL LOSS OF POWER WHILE CAR WAS IN MOTION. UNABLE TO RESTART.  *TR",
        "vin": "WAUEFGFF3F1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667656,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS HIGH IDLE RPM (900+), AND THEREFORE BEGINS TO ACCELERATE AS SOON AS BRAKE IS RELEASED. THIS MAKES PARKING OR MOVING FORWARD A SMALL DISTANCE DIFFICULT AND SOMETIMES CAUSES THE DRIVER TO  JAM ON BRAKE WITH THE SUDDEN MOVEMENT. IF DRIVER IS NOT CONSTANTLY AWARE OF SUDDEN MOVEMENT CAR WILL HIT THINGS IN FRONT OF IT. WE HAVE BEEN TOLD BY DEALER AND AUDI USA THAT THIS CONDITION CANNOT BE CORRECTED.  *TR",
        "vin": "WAUBFGFF2F1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "12/11/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664004,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BEHIND A NEWER AUDI SEDAN (POSSIBLE A3 2.0T) AT NIGHT, AND WAS BLINDED BY THE BRIGHTNESS FROM THE BRAKE LIGHTS.  THE LIGHTS WERE TOO BRIGHT FOR ME TO SAFELY KEEP MY EYES ON THE ROAD.  I WAS DRIVING A 2001 LEXUS LX470, SO I DON'T KNOW IF THE HEIGHT OF MY VEHICLE MADE A DIFFERENCE ON THE ANGLE OF THE LIGHT.  I HAD TO GET IN FRONT OF THE VEHICLE TO AVOID A POSSIBLE ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/16/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655336,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE SUFFERED LOSS OF POWER  AND AS A RESULT  TOO MUCH OF HESITATION , IT BEHAVED AS IF IT IS ABOUT TO STOP ON HIGHWAY.IT IS A NEW CAR AND THOUGHT IT COULD BE BAD GAS , CHANGED GAS STATION  MADE SURE GAS IS NOT AN ISSUE AND HESITATION/LOSS OF POWER CONTINUES. I WAS ABOUT TO SCHEDULE AN APPOINTMENT FOR SERVICE  BUT DEALER CALLED ME SAYING MY  CAR'S VIN NUMBER HAS BEEN LISTED FOR AN IMP UPDATE IN ORDER TO PREVENT FAILURE OF CERTAIN COMPONENTS  AND PEOPLE IN GERMANY ARE LOOKING FORWARD TO GET THIS FIXED ASAP I.E ; 18 SEPT 2015 . I SCHEDULED AN APPOINTMENT  ON 24 SEPT 2015  IT IS NOT JUST UPDATE BUT THE ENTIRE TURBO IS REPLACED , MONTH LATER CAR IS HAVING SIMILAR SYMPTOMS ,NO POWER/HESITATION , INTERMITTENTLY STUTTERING OR MISFIRING. AUDI MECHANICS KEPT CAR FOR A DAY (13 NOV 2014)AND REPLIED THEY COULDN'T FIND THE ISSUE AND RETURNED THE CAR BACK TO ME . I ASSURED THEM THE VEHICLE HAD PREMIUM GAS ONLY AND NOTHING ELSE.     I WILL KEEP YOU INFORMED OF THE STATUS.  *TR",
        "vin": "WAUBFGFF2F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/13/2014",
        "dateOfIncident": "08/10/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644326,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A BRAND NEW 2.0 AUDI A3 FROM THE DEALER THIS MAY.    I GOT A LOW OIL WARNING WITH ONLY 2700 MILES ON THE CAR, AND THE OIL IS DARK AND DIRTY COMPARE TO THE LONER CAR I GOT.     IT HAS BEEN THREE TIMES I BROUGHT MY CAR BACK TO THE SERVICE DEPARTMENT IN THE DEALER, BUT THEY NEVER SOLVED THE PROBLEM. FIRST TIME, THEY TOPED UP THE OIL. AFTER TWO WEEKS, THE OIL WAS LOW AGAIN, SO I BROUGHT IT BACK. THIS TIME, THEY CHANGED A NEW OIL TANK CAP FOR ME, BUT TWO WEEKS LATER, THE OIL WAS LOW. I DROVE IT BACK TO THE SERVICE, THIS TIME ACTUALLY THE AUDI COMPANY TOLD ME THAT IS BECAUSE MY CAR IS STILL IN BREAK-IN PERIOD AND JUST TOPPED UP THE OIL AGAIN. BUT AS AN ENGINEER, I KNOW IT CANNOT BE 2 QT PER 1000 MILES.  *TR",
        "vin": "WAUBFGFF5F1"
    }
]