[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "12/25/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447143,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine failed while I was driving. The car did not show any warning lamps, messages or other symptoms, it just jumped and died. I had the car towed to my mechanic. The mechanic thought it was the starter, but then realized the chain had broken and it hit other parts of the engine, including the pistons catastrophically. The engine is not reparable. My safety was a risk as the car died on a busy road. Audi has asked that I bring the car, at my expense for them to inspect, without offering anything. I have a letter from them indicating that they will not help.",
        "vin": "WAUFFAFLXFN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446554,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunroof just exploded",
        "vin": "Wauffafl5fn"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "11/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440802,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Excessive oil consumption",
        "vin": "wa1vfafl8fa"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11424153,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The battery failed/malfunctioned and was leaking hydrogen sulfide gas into my car slowly for a long period of time. A month or two after I initially financed this used Audi A4 at Volkswagon in Dothan, AL, I started experiencing the side effects of low dose exposure to hydrogen sulfide gas. From that point until today my symptoms have been getting worse and worse. My asthma symptoms progressed. I caught walking pneumonia several times. My hair has been falling out in clumps and my kindneys are having serious issues. My pee started smelling very strange. Consistently, over the past year and a half, I have nearly passed out at the wheel of my car over and over. For a very long time, the gas was odorless and really couldn't be detected by smell. Five days ago I went to start my car and it wouldn't crank. I jumped it off and for the next five days following that the smell of rotten eggs got worse and worse....I'm lying in the bed right now bc my lungs feel like they're going to explode. I've felt this, along with my heart feeling like it was going to explode put of my chest, as well as my entire stomach/intestines feeling as if someone were stabbing me with knives. My doctors could not figure out why all of my hair was falling out or why I started to develop peripheral neuropathy. They even ran tests on me for Multiple Schlerosis. Found nothing. They did electrical pulse tests and cat scans and my dermatologist had no explanation for my hair just falling off my head in handfuls. I have a third of the hair on my head that I used to have. My skin and eyes consistently kept getting irritated by the gas as well....splotchy red exema like patches appeared all over me. I had a miscarriage because of this as well. I couldn't afford to get the car looked at, so it hasn't been taken anywhere. I received no warning of the problem until two days ago when my lights in my car and the air conditioner stopped working. The year of my life had been a living hell.",
        "vin": "WAUAFAFL6FN"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405766,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A4. THE CONTACT STATED WHILE DRIVING 35 MPH, THE FRONT GRILL OF THE VEHICLE DETACHED AND SEPARATED FROM THE VEHICLE. THE CONTACT ALSO STATED THAT THE HEADLIGHTS WERE INOPERABLE, AND THERE WAS NO OIL IN THE ENGINE. THE CONTACT STATED THAT SEVERAL UNKNOWN WARNING LIGHTS WERE ILLUMINATED. THE CONTACT WAS RELATING THE ISSUE TO A WIRING ISSUE. THE VEHICLE WAS TAKEN TO KEY FORD OF YORK (422 US-1, YORK, ME 03909) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE HEADLIGHTS NEEDED TO BE REPLACED. ADDITIONALLY, THE ENGINE OIL NEEDED TO BE TOPPED OFF. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE WITH THE HEADLIGHTS RECURRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 42,000.",
        "vin": "WAUBFAFL6FN"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403401,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE LIGHT KEEPS BLOWING WHILE DRIVING CHANGED SEVERAL TIMES AND IT KEEPS HAPPENING.",
        "vin": "WAUEFAFL4FN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11374934,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A4. THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH, SHE ATTEMPTED TO AVOID HITTING ANOTHER VEHICLE THAT HAD DARTED IN FRONT OF HER VEHICLE. DESPITE HER BEST EFFORTS, THE CONTACT CLIPPED THE RIGHT PASSENGER SIDE OF THE OTHER VEHICLE WHICH CAUSED SEVERE DAMAGE TO THE FRONT END OF HER VEHICLE. THE AIR BAGS DID NOT DEPLOY UPON IMPACT. THE CONTACT'S DAUGHTER HIT HEAD ON THE BACK OF THE DRIVER SEAT AND JAMMED HER THUMB; NO OTHER INJURIES WERE REPORTED AND NO MEDICAL ATTENTION WAS NEEDED. A POLICE REPORT WAS FILED AT THE SCENE. THE VEHICLE WAS TOWED TO AN INDEPENDENT TOW YARD AND HAD YET TO BE INSPECTED BY INSURANCE. THE MANUFACTURER NOR THE DEALER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED.THE FAILURE MILEAGE WAS APPROXIMATELY 46,000.",
        "vin": "WAUFFAFL8FN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300976,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE WITH POORLY ENGINEERED WATER PUMP. MY WATER PUMP WENT OUT DUE TO A SMALL PLASTIC SEAL MALFUNCTIONING AND ALLOWING COOLANT TO EXPEL FROM SYSTEM. I AM FORTUNATE I LEARNED OF THE ISSUE UPON STARTING MY CAR AND COULD IMMEDIATELY TAKE CARE OF IT, ALTHOUGH LEAVING WORK AT 9PM, LONG AFTER EVERYONE HAS LEFT AND WITH NO AUTOMOTIVE SHOPS OPEN MADE IT DIFFICULT TO TAKE CARE OF.  UPON TALKING WITH AN INDEPENDENT AUDI/VW SPECIALIST AND DOING MY OWN RESEARCH I CAME TO FIND THIS WAS AN INCREDIBLY COMMON PROBLEM. MY CAR HAD ONLY 35K MILES ON IT AND WAS 1 MONTH OUT OF WARRANTY WHEN THIS OCCURRED. THE AUDI/VW SHOP SAYS THEY REPLACE 4-5 OF THESE PUMPS PER WEEK! IT CLEARLY IS A MAJOR ISSUE, ESPECIALLY SINCE A CAR CANNOT FUNCTION AND IS DANGEROUS TO OPERATE WITHOUT THE COOLING SYSTEM.  I WAS VERY UPSET THAT THE AUDI BRAND WOULD ALLOW A KNOWN PROBLEM TO CONTINUE, AS IT DOES NOT SEEM LIKE A 'LUCK OF THE DRAW' PART MALFUNCTION.",
        "vin": "WAUBFAFL8FN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "08/02/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289275,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR BURNS TOO MUCH OIL, NEED TO ADD 1 QUART EVERY 700-1000 MILES. THERE IS NO LEAK BUT THE OIL BURNS AND YOU CAN SEE THE EXHAUST PIPES ARE BLACK. IT SEEMS THIS WAS A PROBLEM IN 2011 4 CYLINDER AUDIS AND IT WAS ADDRESSED BY AUDI.",
        "vin": "WAUFFAFL4FN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245805,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UNINTENDED ACCELERATION WHILE TRAVELING AMID TRAFFIC ON BUSY HIGHWAY    SEE ATTACHED DESCRIPTION",
        "vin": "WAUAFAFL9FN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240978,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE ROLLS FORWARD WHILE FACING A DOWNHILL, AFTER SHIFTING INTO REVERSE.",
        "vin": "WAUBFAFL4FN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204614,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 AUDI A4. CONSUMER WRITES IN REGARDS TO ELECTRIC COOLANT PUMP SAFETY RECALL. *LD    THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASAONABLE AMOUNT OF TIME COMPLETING THE RECALL REPAIR. *JS",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190884,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THE STEERING STARTED GETTING HARD TO TURN. I TOOK TO AUDI DEALER THEY SAID IT WAS FINE. I SAID NOT I KNOW MY CAR. ON THE HIGHWAY 2 WEEKS LATER ENTERING A CURVE AT HIGH MPH THE CAR WOULDN'T TURN. I TAPPED BRAKES SEVERAL TIMES AND FINALLY WITH 2 HANDS I COULD TURN AROUND CURVE. VERY SCARY AND BARELY MADE TURN. I PROCEEDED TO HOME BUT AT A TURN I STARTED THE TURN AND THE STEERING AGAIN STIFFENED SO HARD IT SENT ME TOWARDS THE CROSSWALK AND LUCKILY THE BRAKES STOPPED ME INCHES FROM HITTING A BOY ON HIS BIKE. I KEPT HITTING BRAKES AND FINALLY THE WHEEL RELEASED THE TENSION. I DROVE HOME AND LEFT IT UNTIL I GOT AN APPOINTMENT AT AUDI DEALER. I CAREFULLY DROVE IT DOWN TO DEALER AND HALF THE DRIVE IT WAS FINE AND HALF THE DRIVE THE CAR I BELIEVE ELECTRONICALLY TIGHTENED DOWN THE WHEEL SO IT WAS EXTREMELY DIFFICULT TO TURN. THE CAR IS AT DEALER BUT THEY STILL HAVEN'T FIGURED OUT ISSUE. I LOOKED ONLINE FOR THAT SAME MODEL AND YEAR AND HAVE FOUND SEVERAL ISSUES EXACTLY DESCRIBED LIKE MINE. IT OCCURS IN MOTION WHEN DRIVING AND TURNING. I FIND THIS EXTREMELY DANGEROUS AND AM WORRIED TO DRIVE UNTIL ISSUE FOUND. I BELIEVE IT IS A COMPUTER OR ELECTRICAL TYPE ISSUE BASED UPON MY EXPERIENCE WHERE IT ISN'T HAPPENING ALL THE TIME BUT I AM NOT A MECHANIC. I FIND THIS ISSUE REALLY TROUBLING. I COULD HAVE EASILY BEEN SERIOUSLY INJURED OR KILLED AND I AM STILL SHAKING FROM HOW CLOSE I CAME TO RUNNING OVER A LITTLE BOY ON HIS BICYCLE. WITH OTHER PEOPLE SAYING THE SAME ISSUE AND DESCRIBING IT SIMILARLY I THINK THIS IS A PROBLEM WITH THIS VEHICLE MODEL.",
        "vin": "WAUFFAFL2FN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176209,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI SAFETY RECALL 19N4-ELECTRIC (AFTER RUN) COOLANT PUMP.   I HAVE BEEN WAITING NOW ABOUT 6 MONTHS FOR A NEW PUMP TO BE AVAILABLE FROM AUDI TO REPLACE THE DEFECTIVE COOLING PUMP, THAT IS TO COOL THE TURBOCHARGER AFTER THE ENGINE IS TURNED OFF. I WAS TOLD, IN WRITING AND OVER THE PHONE BY AUDI, THAT THIS REPLACEMENT WOULD BE DONE BY THE END OF 2018. TODAY WHEN I CALLED AUDI THEY WILL ONLY SAY IT IS TO BE COMPLETED BY THE END OF 2019. NOT HAVING THE AFTER RUN PUMP PROPERLY COOLING THE TURBOCHARGER CAN CAUSE DAMAGE TO THE TURBOCHARGER AND THAT CAN BE VERY COSTLY TO REPAIR. ALSO, IF I WANT TO SELL OR TRADE IN THIS CAR NOW, WITH OUT THE REPLACEMENT PUMP, THE VALUE OF THE CAR IS WORTH LESS AND I WILL LOOSE MONEY DUE TO THIS ISSUE. WHAT CAN BE DONE TO GET THIS PUMP REPLACED AS AUDI SAID THEY WOULD ORIGINALLY?",
        "vin": "WAUFFAFL8FN"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173409,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BUCKLE ON FRONT PASSENGER SEAT WOULD NOT LATCH.  DEALER SAID IT WAS DEFECTIVE AND I HAD TO PAY $250.80 TO REPLACE.  BUCKLE WAS REPLACED DEC. 17, 2018",
        "vin": "WAUFFAFL9FN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172007,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SHAFT IS FAULTY.  WHEN DRIVING THIS CAR, ESPECIALLY AT HIGH SPEEDS, THE STEERING IS EXTREMELY UNPREDICTABLE.  AT LOWER SPEEDS, THE STEERING IS NOTCHY, YOU CAN'T SEEM TO FIND \"CENTER\" AND CONSTANTLY HAVE TO ADJUST THE STEERING WHEEL TO REMAIN STRAIGHT ON THE ROAD.  THIS HAPPENS WHILE MOVING, ON CITY STREETS AND HIGHWAYS.",
        "vin": "WAUBFAFL9FN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140463,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE (19N4) AND AS A FIRST STEP I'M ADVISED TO HAVE AN AUDI DEALER DISCONNECT THE COOLANT PUMP IMMEDIATELY TO AVOID A FIRE.  I LIVE 5 HOURS FROM THE NEAREST AUDI DEALERSHIP BUT HAVE A LOCAL SHOP THAT WORKS ON GERMAN MADE CARS INCLUDING THE AUDI.  HOWEVER, AUDI REFUSES TO PROVIDE INSTRUCTIONS TO THE LOCAL SHOP TO DISCONNECT THE COOLANT PUMP AND AVOID A FIRE.  HOWEVER, WHEN I CALL MY DEALER THEY CAN'T GET ME IN ON THE DAY I'LL BE IN THE AREA.  SO, I'M TOLD IT'S IMPORTANT BUT GIVEN NO REMEDY TO AVOID A FIRE.  BASICALLY, AUDI SENT OUT THE RECALL NOTICE TO COVER THEIR BUTTS AND REALLY HAVE NO INTEREST TO RESOLVE THE PROBLEM.  WITH THE FUEL ECONOMY FIASCO AND THEIR LACK OF CONCERN OVER SAFETY RECALLS - MAYBE THEY SHOULD BE BARRED FROM EVEN SELLING CARS IN THE U.S.A",
        "vin": "WAUBFAFL3FN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "10/11/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140093,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS INVOLVED IN AN ACCIDENT ON OCTOBER 11, 2018 IN BALTIMORE CITY.  ANOTHER CAR MADE AN ILLEGAL LEFT TURN IN FRONT OF ME WHEN I HAD THE GREEN LIGHT AND MY CAR HIT THE PASSENGER SIDE OF THE OTHER CAR. I WAS GOING AT LEAST 30 MILES/HR AND HAD NO OPPORTUNITY TO BRAKE OR SWERVE.  MY CAR WAS DISABLED, THERE WAS ENGINE OIL LEAKING AND THE CAR HAD TO BE TOWED.  NONE OF THE AIRBAGS DEPLOYED DURING THIS ACCIDENT.  I HAVE REPORTED THIS TO AUDI USA AND RECEIVED A COMPLAINT # 181561250  THE CAR IS NOW AT GERBER COLLISION & GLASS IN JESSUP, MARYLAND.",
        "vin": "WAUFFAFL1FN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132969,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A4. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING) AND STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (UNKNOWN DEALER INFORMATION) WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131738,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE YET TO RECEIVE A REMEDY TO FIX MY VEHICLE WHICH I AM TOLD CAN CATCH FIRE. THE RECALL IS 19N4, CAN YOU PLEASE FOLLOW UP ON THIS AND LET ME KNOW IF THERE IS A REMEDY.",
        "vin": "WAUDFAFL8FN"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "08/19/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128767,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THE CAR FROM LEASING IT IN MAY 2018.THEY DID A INSPECTION AT AUDI AND ABOUT 3 WEEKS LATER THE ENGINE GOT STUCK AND CAR SMOKED FROM HOOD.THESE A4 HAVE EXCESSIVE OIL CONSUMPTION WHICH CAN DAMAGE ENGINE.BUT AUDI SELLS VEHICLES WITH FAULTY ENGINES AND SAYS ITS NORMAL......BUT NO IT IS NOT.THEY SELL UNSUSPECTING CONSUMERS VEHICLES WITH FAULTY ENGINES....I GOT STRANDED ON HIGHWAY IN HEAVILY SMOKING VEHICLE...WHAT IS NOW USELESS.I WAS TERRIFIED",
        "vin": "WAUAFAFL1FA"
    },
    {
        "components": "AIR BAGS,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11122003,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL OR  NHTSA CAMPAIGN ID 14V66700   I WAS IN AN ACCIDENT JULY 13 2018. MY CAR'S AIRBAGS DID NOT DEPLOY, 3 OTHER CARS INVOLVED IN THE ACCIDENT AIRBAGS DID DEPLOY. FIREMAN AT THE SCENE TOLD ME \"THERE IS A RECALL ON YOUR CAR, DID YOU KNOW?\"  MY MARKET VALUATION REPORT AS MY CAR WAS TOTALED, STATES THERE IS A RECALL ON THIS CAR. IT STATES DUE TO AN IMPROPER ALGORITHM IN THE AIRBAG CONTROL MODULE, IF A CRASH NECESSITATES DEPLOYMENT OF THE SIDE AIRBAGS, A SECOND IMPACT TO THE FRONT OF THE VEHICLE MAY NOT COMMAND THE FRONT AIR BAGS TO ALSO DEPLOY AND AS A CONSEQUENCE FURTHER STATES, IF THE FRONT AIR BAGS DO NOT DEPLOY IN THE EVENT OF A SECONDARY IMPACT TO THE FRONT OF THE VEHICLE, THERE IS AN INCREASED RISK OF OCCUPANT INJURY.  TRAFFIC WAS STOPPED ON THE HIGHWAY AND YOU COULD CLEARLY SEE BRAKE LIGHTS AND THE SLOWING OF TRAFFIC FOR QUITE A  DISTANCE. I TRAVEL THIS AREA REGULARLY AND AM AWARE OF THE CONSTRUCTION THAT CAUSES TRAFFICE TO SLOW.  THE TRUCK AHEAD OF ME STOPPED,  I WAS AT A COMPLETE STOP, THE CAR BEHIND ME STOPPED THEN A  A CAR HIT ME FROM BEHIND, MY CAR WAS PUSHED  INTO ANOTHER VEHICLE A CAR LENGTH AHEAD OF ME. MY AIRBAGS DID NOT DEPLOY,  MY HEAD HIT THE STEERING WHEEL.  MY CAR WAS ALSO PUSHED SIDEWAYS INTO THE CONCRETE DIVIDER. WHEN I READ THE RECALL, IT IS EXACTLY WHAT HAPPENED IN MY CAR. MY CAR WAS MANUFACTURED OCTOBER 28, 2014. WHY DID THEY NOT DEPLOY? PLEASE ADVISE AS THIS WAS A SERIOUS SITUATION AND I AM DEALING WITH A BRAIN INJURY. THERE WAS A FATALITY AS WELL. *TT *DT  *TR",
        "vin": "WAUHFAFL9FN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2018",
        "dateOfIncident": "06/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109684,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL FOR MY 2015 AUDI A4 BUT THERE IS NO REMEDY CURRENTLY AVAILABLE TO FIX IT. I AM DOING A PCS TO ROTA, SPAIN AUGUST 28, 2018 AND HAVE PLANNED ON SHIPPING MY CAR AS WELL. WITH A CURRENT RECALL ON MY VEHICLE, I AM UNSURE THE NEXT STEPS.",
        "vin": "WAUAFAFL5FA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "07/02/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105181,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RECALL 19N4  AUDI RECOMMENDS PARKING CAR OUTDOORS DUE TO FIRE HAZARD.  OUR CONDO'S PARKING IS INSIDE THE BUILDING THAT HOUSES BOTH RESIDENTS AND HOTEL QUESTS, WITH NO OUTSIDE PARKING AVAILABLE.  THEY DO NOT HAVE A REPAIR THAT WOULD ALLEVIATE THE SAFETY ISSUE.  THEY CLAIM \"AT THIS TIMEIT IS NOT POSSIBLE\" FOR THEM TO TRADE THE VEHICLE BACK IN FOR US TO PURCHASE A NEW OR USED AUDI THAT WE COULD PARK IN A STRUCTURE SAFELY. I MADE IT VERY CLEAR THAT I AM NOT ASKING FOR ANY COMPENSATION OF ANY KIND (OR SPECIAL DEAL GIVEN THE CIRCUMSTANCES).  SHE REPEATED \"AT THIS TIME IS NOT POSSIBLE\".  PER AUDI OF AMERICAN REP. LATONYA @ 248.754.3274.",
        "vin": "WAUFFAFL6FN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104252,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL NHTSA: 18V229     SOUNDS CRITICAL AND UNSAFE.  AUDI EVEN STATES IN LETTER DO NOT PARK IN GARAGE DUE TO LIABILITY.  WILL NOT PAYOFF MY CAR IN ORDER TO OBTAIN A NEW ONE.  TRIED TWO DEALERSHIPS AND ALL THEY CARE ABOUT IS MAKING A BUCK.   SHOULD AT LEAST PROVIDE A RENTAL TILL REPAIRS ARE MADE OR PAY OFF MY CAR FOR TRADE IN WITH AUDI FINANCIAL.",
        "vin": "WAUBFAFL1FN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102573,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED A LOCAL DEALER (AUDI SALT LAKE CITY, 999 SOUTH STATE STREET, SALT LAKE CITY, UT 84111) AND WAS REFERRED TO THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND DID NOT ASSIST. THE CONTACT WAS DISPLEASED ABOUT STORING THE VEHICLE OUTSIDE AS THERE WAS A RISK OF A VEHICLE FIRE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUBFAFL9FN"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084330,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE",
        "vin": "WAUEFAFL6FN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080866,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A4. WHILE THE VEHICLE WAS STATIONARY IN THE REVERSE POSITION, IT ROLLED FORWARD. AUDI OF NORTH SCOTTSDALE IN SCOTTSDALE, ARIZONA WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 13,500. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080918,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IS LOCKING UP/BECOMES HARD TO TURN WHILE DRIVING. THIS ALMOST CAUSE ME TO CRASH AS I COULD NOT TURN EASILY IN AN INTERSECTION. I RECENTLY HAD THE CAR SERVICED (IN THE LAST MONTH) REGARDING A HEATER RECALL. ABOUT 3 WEEKS LATER THIS PROBLEM STARTED TO OCCUR OUT OF THE BLUE. NO WARNING LIGHTS HAVE COME ON.",
        "vin": "WAUFFAFL1FN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/30/2017",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057690,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED AT TIMES WHEN THE VEHICLE IN PUT INTO REVERSE GEAR THE VEHICLE INTERMITTANLY FAILS TO MOVE",
        "vin": "WAUFFAFLXFN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "04/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005362,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI A4. APPROXIMATELY ONE WEEK AFTER THE VEHICLE HAD BEEN SERVICED FOR NHTSA CAMPAIGN NUMBER: 17V002000 (ENGINE AND ENGINE COOLING), A FAILURE OCCURRED. WHILE THE CONTACT WAS PARKING THE VEHICLE AT 1 MPH, THE BACKUP SENSOR FAILED AND THE BACKUP WARNING SYSTEM FAILED TO ALERT THE CONTACT OF ANY OBJECTS BEHIND THE VEHICLE. THE VEHICLE WAS TAKEN TO AUDI OF HUNTINGTON (363 E JERICHO TURNPIKE, HUNTINGTON STATION, NY 11746) WHERE IT WAS DIAGNOSED THAT THE SENSOR WIRE HAD BEEN CUT. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE TWO WIRES WERE NOT CONNECTED AND THAT THE WIRES SEEMED \"FRAGILE\". THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THEY BELIEVED THE DEALER'S STATEMENT ABOUT THE WIRE BEING CUT. THE APPROXIMATE FAILURE MILEAGE WAS 24,000.     UPDATED 10/17/17*LJ  *TR",
        "vin": "WAUFFAFL8FN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "09/21/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908783,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "S TIMES NOW, THE VEHICLE INTERMITTANLY FAILS TO MOVE WHEN PLACED IN GEAR, REVERSE OR DRIVE. ADDITIONALLY, WHILE UNDERWAY, TRANSMISSION \"BUCKS\" AND IN SOME INSTANCES, ACCELERATES RAPIDLY WITH MIMINAL ACCLERATION AT ACCELRATOR PEDAL.  I HAVE A VIDEO OF THE LATEST INCIDENT BUT AM UNABLE TO UPLOAD IT TO YOUR SITE.",
        "vin": "WAUBFAFL3FN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2015",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679670,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2015 AUDI A4. THE CONTACT STATED THAT WHILE AT A STOP LIGHT, THE VEHICLE ROLLED BACKWARDS WHEN THE VEHICLE WAS IN DRIVE. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 1,000.",
        "vin": "WAUEFAFL1FN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "11/23/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10662269,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 65MPH ON THE FREEWAY WHEN ANOTHER CAR SWERVED AND CRASHED INTO THE PASSENGER SIDE OF MY CAR, THEN SENDING ME INTO THE CEMENT DIVIDING WALL ON THE DRIVER'S SIDE AT 65MPH.  BOTH SIDES OF MY CAR, AND THE FRONT OF MY CAR WERE BADLY DAMAGED.  IT WAS A VERY VIOLENT CRASH BUT NOT ONE OF MY AIR BAGS WENT OFF.  MY INSURANCE COMPANY HAS TOTALED MY CAR.  I HAVE LEARNED THAT THERE WAS A RECALL FOR THE AIRBAGS NOT DEPLOYING IN A CRASH BUT I NEVER RECEIVED A NOTICE REGARDING THE RECALL.  *TR",
        "vin": "WAUAFAFL9FN"
    }
]