[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455024,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Over the last year or so, the halogen headlights have gradually become so dim that visibility at night is severely impaired. Dealer has tested all electrical components and the bulbs have been replaced, with no improvement in visibility. Dealer recommendation is to replace both headlight assemblies at a quoted cost over $2500. I have found other owners complaining of the same degradation of visibility with non-HID equipped models so I don't believe this to be an isolated case.",
        "vin": "5J8TB3H33FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453313,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Front headlights have gradually gotten dimmer to the point where they are almost unsafe.",
        "vin": "5J8TB4H31FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451735,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights have gotten progressively worse over time to the point I cannot see. The light does not extend more than a feet feet and very dimly. Oncoming traffic is flashing brights at me as if i have no lights on. It is extremely dangerous and I have nearly had accidents.",
        "vin": "5J8TB3H35FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450348,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlight low beams are very dim and the service manager at Acura said this is a known problem with 2015 RDX. The metal lining that projects the bulb light deteriorates and the lights go dim. The replacement cost is about $2500. Acura has agreed to pay all but $750. I think this is a safety defect worthy of a recall. Please assist me as soon as possible. It’s a major safety issue that Acura us aware of (as evidenced by their willing to cover 2/3 of the cost. I want them to cover 100% of the cost!",
        "vin": "5J8TB3H37FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449267,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Acura RDX. The contact stated that while driving at night at an undisclosed speed, the low-beam headlights failed to illuminate as needed. The contact had to use the high-beam headlight for safe driving. The dealer and Acura of Peabody (233 Andover St, Peabody, MA 01960) were made aware of the failure, and informed the contact that the headlight assemblies needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure and a case was opened. The manufacturer informed the contact that he would need to pay out of pocket for the headlight replacement. The approximate failure mileage was 45,000.",
        "vin": "5j8tb4h30fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448888,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlight delaminated causing passenger side low beam to be so dim it doesn’t look like it’s illuminating. Pulled bulb to replace to identify it illuminates just as bright as driver side. Opened a case with Acura to which they referred me to go to the dealership and if they agreed they would consider it covered. 10 min into the diagnosis the tech agreed with me. Acura then denied my case indicating this is not under warranty and no recall. $160 for a diagnosis later the issue still remains. The worst client relations I’ve ever experienced. Honda should be appalled they treat there customers this way.",
        "vin": "5j8tb4h33fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/18/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447819,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RDX 2015 57, 500 miles. This is my 5th Acura . Since OCt 2021 difficult driving at night due to low beams not deflecting enough light-now cannot drive vehicle when it gets dark-UNSAFE    took the car to acura dealership and service advisor stated the panel where bulb deflects and receives lights from is shattered. \"This is a common defect\". He stated  I would need to replace the whole headlight assembly  low beam panel-not only the bulbs.  $2006.74 plus labor of $398.00    headlights on my vehicle dont project adequate light to see while driving at night.  In my research of other vehicles of the same make, model, and year, shows that there are numerous customer complaints and issues with the functioning of the headlight assembly for the 2015 Acura RDX.  The failed headlights are a big safety issue that  Acura has adequately addressed.",
        "vin": "5J8TB3H30FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447503,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights are extremely dim, dangerously so. I have tried troubleshooting and the voltage at the headlamp connector is 3 volts. The fusebox and headlamp relay are 14 volts. Searching for an answer online, I find there are a myriad of other owners with the same dim headlamp problem. Dealerships seem unable to fix to the issue.",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "01/04/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446995,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The low beam reflector surface is failing and the quality of the lighting on the road at night at standard low beam is a danger to me and to pedestrians. This almost resulted in serious injury to someone was when I was driving in the early evening last week and did not see a pedestrian walking along the side of the road until the very last second and swerved to avoid them. They were not wearing bright clothing, but I realized that it was also the fault of my headlights after a friend had driven my car and had questioned the quality of my headlights. The gradual deterioration in quality over time was something that I had come to accept, but now realize is very dangerous to me and pedestrians.   I visited my local Honda dealership to ask about this and they indicated that they have had many customers ask about the quality of the lighting on these vehicles. In addition, a quick search on the internet identified a number of forums where this problem is starting to be reported more frequently and could be a danger to many people other than myself and the pedestrians on the roads around us, see for example community.cartalk.com/acura-rdx-2015-dim--headlights/180589/23",
        "vin": "5J8TB3H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/10/2022",
        "dateOfIncident": "01/09/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446878,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Low beam headlights shine very dimly. Can not see at night without using high beams Problem has not yet been reported to dealer. Vehicle has not yet been inspected by dealer, police or insurance representative No warning lights activated to warn about problem",
        "vin": "5J8TB4H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446682,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlights have gotten so dim it is unsafe to drive at night.  No change in brightness even after replacing the halogen bulbs with brighter than OEM version.  The problem is apparently deterioration inside the headlight assembly/housing causing the light to not reflect out forward properly.",
        "vin": "5J8TB3H32FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446195,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The current mileage on my odometer is 69,125. Over the past few weeks (last few hundred miles), I have noticed that my low beam headlights have become very dim and are continually getting dimmer. Having read MANY other complaints about this problem with this particular year model, I took my car to our local Acura dealership to be diagnosed. The findings were that the internal reflector has deteriorated and is not projecting light properly. It seems like the 2014 Acura RDX has a recall in place for this same issue but the 2015 does not.  Without adequate lighting, it is nearly impossible to drive at night. I can hardly see 20 feet in front of me--a huge safety issue. My inability to see what's around me while driving in the dark is a huge liability to other motorists around me. This has forced me to only drive in daylight. If I have to drive at night, I'm forced to use my high beams which poses safety issues for others on the road.  The issue has been confirmed by my local Acura dealership. I received a repair quote of $2,196.00.  There are no warning lights or anything alarming me that there's an issue with the light output.  I sincerely hope that you all will investigate this issue and require a recall of all 2015 Acura RDX models.",
        "vin": "5J8TB3H37FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "12/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446242,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Low beam headlight projectors reflective backing has deteriorated causing loss of reflected light end result very dim low beam headlights. Obviously everyone in my vehicle or on the roadway around me is at risk of injury or death due to poor forward lighting. Problem has been confirmed by a 30 year Master ASE certified technician. Manufacturer has not inspected the vehicle but has notified me that headlamps are not a safety related component. No warning lights or messages related to this concern. This problem IS a safety concern of the highest order and the manufacturer should be held responsible for repair cost. Acura’s response to my concern has been laughable. They appear to believe they cannot be held responsible for they safety of the vehicles they produce or the injury or loss of life they may inflict. Please help resolve this issue.",
        "vin": "5J8TB3H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445961,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Front headlights (low beams) are very dim even after replacing the bulb. This was noticed on a long drive back home during the night. While passing opposing traffic it was almost impossible to keep visibility of the lane markers and road.",
        "vin": "5j8tb4h39fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/02/2022",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445895,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "we bought this Acura RDX in 2015 and noticed the headlights are dim; as we drive more often in nights recently, it becomes obvious that this kind dim headlights are very dangerous  for driving in nights, particularly on high way. I was looking for repairing but was told this was all without faulty from the original equipment. I searched online and realized this was a safety problems many drivers have complained and contacted Acura dealers; unfortunately, Acura seems not like to look into this common defect. Please see the attached link of these complains. https://www.carproblemzoo.com/acura/rdx/2014/headlights-problems.php   I am reaching out to you to ask for your investigation and hopeful you could force Acura to make a recall for replacement to repair. this is a serious safety issue on Acura which we liked a lot, but we are afraid driving in dark due to this big issue. it is not safe and could lead to severe injuries to many who drive it. thanks so much.   [XXX] New York  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5j8tb4h33fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "10/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445647,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "When my car got to the 80000 mile mark, my headlights became progressively dimmer. I have cleaned the lens, and replaced the bulbs 3 times in the last 3 months, and now they are so bad that I don't dare drive the car at night.  I googled the problem and found a whole litany of Acura RDX owners who have experienced the same problem at the same time. see: https://www.carproblemzoo.com/acura/rdx/headlights-problems.php  I have contacted Acura who acknowledge that they have replaced some of the 2015 RDX headlight issues, but only if the car was built in 2014. The 2014 RDX did experience a recall for the same, exact reason. However, when I checked my VIN, they say that it doesn't qualify for the recall.  This is crazy. My car cannot be driven at night, and the estimated repair for a problem due to their shoddy design/workmanship is approx $1250 per headlight! Unacceptable.  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5J8TB4H39FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445417,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Acura RDX. The contact stated that while driving at night, the low-beam headlights were dim. The contact had to utilize the high-beam headlights while driving. The contact called the local dealer but, the vehicle was not diagnosed or repaired. The vehicle was taken to an independent mechanic who informed the contact that the reflectors inside the headlight housings were defective and that the headlight assemblies needed to be replaced. The contact stated he was concerned about driving the vehicle. The contact researched the failure and located several forums with similar complaints. The manufacturer was not notified of the failure. The failure mileage was approximately 75,000.",
        "vin": "5J8TB4H37FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2021",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444354,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Low beam headlights are so dim I can’t safely drive at night.I have replaced bulbs with higher quality and brightness,but still very dim.Its like driving with parking light S on!Called the Acura dealership Crown Acura in Greensboro,N.C. and they said the reflector deteriorates on 2013-2015 models.Cost to replace both headlight fixtures 1500.00 my question is why Acura does not have a recall .This is a very dangerous situation.I searched my problem on the internet and found I am one of many with the same issue.Seams like after 70 to 80k miles they go pretty fast.The only way I can see to Drive is with high beam on.Thank You,Rick Bonkemeyer",
        "vin": "5j8tb3h34fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Headlight low beam do not project can’t see at night I have 2 Acura RDX one is 2015 and 2013 both have the same issue I can only drive with high beams low beams is like driving with them off I drive down 206 to Fort Dix lots of deer   I can’t drive with the high beam all the time it will effect the other driver.",
        "vin": "5J8TB4H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441948,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Acura RDX. The contact stated that while driving at night, the low-beam headlamps failed to illuminate. The contact replaced the bulbs. The vehicle was taken to the local dealer and diagnosed. The contact was informed that the headlamps needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure and referred the contact to NHTSA for assistance. The failure mileage was approximately 45,000.",
        "vin": "5J8TB3H31FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/25/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441656,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights on my vehicle don’t project adequate light to see while driving at night. I’ve reported this issue to the dealership on multiple occasions and the only solution they’ve suggested is replacing the entire headlight assembly. In my research of other vehicles of the same make, model, and year, shows that there are numerous customer complaints and issues with the functioning of the headlight assembly for the 2015 Acura RDX. My car has 82,000 miles and is six years old. The failed headlights are a big safety issue that I don’t feel Acura has adequately addressed.",
        "vin": "5J8TB4H38FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441026,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Acura RDX. The contact stated that while driving at night, the headlights were very dim making it difficult to see the roadway. The contact mentioned that the hi-beam headlights needed to be activated to clearly see the roadway. The vehicle was taken to the dealer where it was diagnosed that each headlight housing needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 82,300.",
        "vin": "5j8tb4h33fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/17/2021",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440750,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Acura RDX. The contact stated that while driving at various speeds, the low beam headlights were very dim, causing a visibility issue while driving at night. The vehicle was taken to the dealer to be diagnosed. The contact was informed that the headlights needed to be adjusted. The vehicle was repaired however, the failure persisted. The manufacturer was not notified of the failure. The approximate failure mileage was 73,000.",
        "vin": "5j8tb4h32fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440585,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "At night, I noticed the low beams were very dim. Not sure of the issue I replaced with brand new bulbs, then later with brand new led bulbs. Both did not make an improvement on lighting at night. It is very difficult to see at night, crash likely is greatly increased. High beams are needed to see properly at night.   10/29/21- Told the dealer I replaced new bulbs and headlights were still dim. They quoted ~$2k to replace both headlight assemblies. Verbally they stated the projector coating wears out after a couple of years and wont reflect the light properly. Dealer customer rep stated the part did NOT undergo a revision so the new part will likely wear out in 2-3 years.",
        "vin": "5J8TB3H30FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438164,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The projector low beam lighting is NOT providing enough light output to be safely driven at night.   I did a search online and it seems this is a well-known issue among RDX owners. It looks like there were enough complaint for the 2014 RDX, but no safety recall done on the 2015 models.  It is extremely dangerous to drive this vehicle at night and I hope a recall is enforce before someone gets killed due to this safety issue.   Thank you.",
        "vin": "5J8TB3H3XFL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437792,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Acura RDX. The contact stated while driving at night the driver’s side and passenger’s side headlights lo-beam was too dim while driving. The contact took the vehicle to a local dealer who inspected the vehicle and attempted to replace the headlight bulbs to fix issue however, the failure persisted. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 51,000.",
        "vin": "5j8tb3h31fl"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437387,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Paint started to peel off at upper side of rear roof (under the upper side of the gate).  I have reported this issue el the dealership and as of today they haven’t yet responded.  Vehicle sleeps in the garage every day and.only has about 72,000 miles.  Same issue happened with my 2012 Honda Odyssey (same white diamond color).  Honda fixed the van under extended warranty.  So I hope Acura (Honda) does the same for my RDX.  I understand same is happening on the MDX of similar years.",
        "vin": "5J8TB3H5XFL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "12/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437180,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The visibility of my headlights are so bad that I am unable to drive my car at night. At first, I thought that I was imagining it and maybe my eye sight was going bad, but my husband noticed it too. This has been going on for about 8 months or so. I didn't notice it  much at first because I was not driving as much with the pandemic. The only way that I can drive my car at night is if I keep my headlights on bright the entire time which causes two safety hazards: 1. If I don't keep the headlights on high beam, I can barely see the road in front of me. 2. If I continue to shine my high beams on an oncoming car, with today's environment, I may suffer repercussions from the other driver. I did a little research and found out that quite a few owners of the 2015 RDX are experiencing the same problem once their mileage reaches 90K. I contacted the Acura Dealership and they told me that they know about the problem and the only way to fix it is to replace the entire headlight assembly at a cost to the customer of $2200. Not only don't I have this kind of money, it is not fair to me or any other customer.  I purchased this car brand new and Acura needs to stand behind there product. I reached out to Acura Clients Relations over a week ago and they never returned my message. Whatever you can do to look into this problem would be greatly appreciated.",
        "vin": "5J8TB3H30FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436765,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "After owning my car for a few years, the front headlights began to dim.  I've replaced them multiple times even with LED lights and now they are dim all the time.  For example, the LED lights were installed in June and immediately there was no improvement.  The car cannot be driven at night at all.  It is extremely dangerous.  I was told by the dealership that the 2015 base model is known to have these issues but there is nothing that can be done.  How is it possible that headlights don't work on a car (to the point it can't be driven at night) but there is nothing that can be done.",
        "vin": "5J8TB4H34FL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433673,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Paint peeling inside tailgate frame and rear roof",
        "vin": "5j8tb4h50fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/19/2021",
        "dateOfIncident": "07/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433499,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights are not bright enough to safely drive in the dark. The light is working and on and they are too dim to see safely at night.",
        "vin": "5J8TB4H39FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/11/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432622,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "low beam headlights in 2015 Acura RDX, 70,000 miles, have become dim because reflective coating in headlight assembly has failed and the light emitted from the lightbulbs is not reflected forward.  The amount of light is reduced to the level that night driving is almost impossible. Must use highbeam lights instead of low beams to see road and road markings, and this is not possible in most situations with oncoming traffic.  Dealer and Acura refuse warranty service to replace headlight assembly even though this is a necessary safety component.",
        "vin": "5j8tb4h39fl"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430189,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The headlights on my 2015 RDX have become dimmer the past two years. At this point it is not safe to drive my vehilcle at night due to the lack of visibility.",
        "vin": "5J8TB4H39FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/20/2021",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429862,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Low beam headlights have diminished to the point where it is absolutely unsafe to drive while dark.  This is a widespread problem which has resulted in many complaints with the NHTSA and other online reporting agencies.  Acura has not acknowledged the issue for this make or model while other models have been recalled in the past.",
        "vin": "5J8TB4H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423500,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED 2015 ACURA RDX AT AN ACURA DEALERSHIP JUNE 2020 WITH LESS THAN 48K MILES.  I BOUGHT IT IN AS IS CONDITION.  I THOUGHT SINCE IT WAS FROM A DEALERSHIP, I THOUGHT EVERYTHING THAT NEEDED REPAIR WOULD HAVE BEEN FIXED.  IT WAS DURING THE DAY WHEN I BOUGHT AND DIDN'T HAVE TO DRIVE AT NIGHT SEVERAL DAYS.  WHEN I DROVE IT AT NIGHT I  COULD BARELY SEE THE STREET, THE PASSENGER SIDE, I THOUGHT WAS NOT LIT AT ALL.  THE LOW BEAM VISIBILITY WAS HORRRIBLE.  I FELT I WAS IN A VERY DANGEROUS SITUATION AND HAD TO DRIVE WITH HIGH BEAM ON.  I TOOK IT TO A SHOP A FEW DAYS LATER AND WAS TOLD THE WHOLE HEADLIGHT UNIT HAD TO BE REPLACED.  I DIDN'T BELIEVE THEM THINKING THAT THEY ONLY WANT TO MAKE MONEY FROM ME.  SEVERAL DAYS LATER, I TOOK IT TO ANOTHER SHOP AND HAD BOTH LOW BEAM LIGHT BULBS REPLACED.  AFTER THE WORK WAS DONE THE SHOP MANAGER TOLD ME THE PASSENGER LOW BEAM HEADLIGHT WAS NOT BURNED OUT AND IT WAS NOT THE BULB THAT WAS MY OROBLEM.  I NEEDED TO REPLACE MY HEADLIGHT HOUSING ASSEMBLIES THE COST OF WHICH IS $800 A PIECE FOR JUST THE PARTS ALONE.",
        "vin": "5J8TB3H36FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414388,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE SO DIM NIGHT DRIVING IS IMPOSSIBLE.  NEW BULBS AND LENS CLEANING HAD NO EFFECT.  THERE ARE HUNDREDS IF NOT THOUSANDS OF COMPLAINTS ONLINE ABOUT THE PROJECTOR HEADLAMPS GROWING DANGEROUSLY DIM ON ACURA'S IN THIS MODEL YEAR RANGE. THE CAR IS NOT SAFE TO DRIVE AT NIGHT AND POSES AN IMMINENT THREAT TO PUBLIC SAFETY.",
        "vin": "5J8TB4H31FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/21/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414443,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING AROUND 100,000 MILES I NOTICED THE LOW BEAMS WERE TOO DIM. I REPLACED THE BULBS TWICE WHICH HAD NO EFFECT.  I DIDN'T HAVE THE MONEY FOR NEW HEADLIGHT ASSEMBLIES SO I TRIED TO LIMIT MY DRIVING TO DAYTIME, OTHERWISE I HAD TO USE MY HIGH BEAMS TO SEE SAFELY.  NOW MY VEHICLE  HAS 135,000 MILES AND THE LIGHTS GOT WORSE TO THE POINT THAT IT WAS A SIGNIFICANT DANGER TO DRIVE AT NIGHT AND I NARROWLY AVOIDED AN ACCIDENT.  I SEARCHED ONLINE TO SEE IF ANYONE ELSE WAS HAVING THIS ISSUE AND THE INTERNET IS FULL OF ACURA OWNERS WITH COMPLAINTS ABOUT THIS VERY THING.  ACURA KNOWS ABOUT THIS AND ACTUALLY RECALLED THE 2014 RDX BECAUSE OF IT, BUT NOT THE 2015.  I APPEALED TO ACURA TO ASK THEM TO PAY FOR THE REPLACEMENT OF THE HEADLIGHT ASSEMBLY AND THEY SAID NO, CITING 1) TOO MANY MILES ON THE CAR (HEADLIGHTS ARE NOT A PART THAT SHOULD BE SUSCEPTIBLE TO WEAR AND TEAR .....I HAD A TOYOTA WITH 300,000 MILES THAT NEVER NEEDED A HEADLIGHT ASSEMBLY REPLACED.  THIS ANSWER HOLDS NO MERIT 2) I DIDN'T HAVE MY CAR SERVICED BY ACURA DEALERSHIP.  I HAVE MAINTAINED MY VEHICLE TO PERFECTION THROUGH MY OWN MECHANIC AND WOULD NEVER PAY THE RIDICULOUS EXORBITANT FEES THE DEALERS CHARGE. JUST BECAUSE I DIDN'T HAVE MY CAR SERVICED WITH THE DEALER DOESN'T  MEAN I DIDN'T TAKE CARE OF MY CAR. 3)  THEY DON'T RECOGNIZE THIS AS A SAFETY CONCERN.  I'M INCREDIBLY DISAPPOINTED AT ACURAS RESPONSE TO THIS.  THIS IS MY FIRST ACURA AND WILL CERTAINLY BE MY LAST.  THEY HAVE A KNOWN SAFETY ISSUE AND THEY TURN A BLIND EYE TO IT.  WOULD THEY ONLY TAKE ACTION WHEN SOMEONE IS KILLED IN AN ACCIDENT?  ACURA NEEDS TO BE RESPONSIBLE AND RECALL THIS MAKE AND MODEL.  AND THEN THEY NEED TO GO BACK TO SCHOOL TO LEARN HOW TO MAKE HEADLIGHT ASSEMBLIES BECAUSE OTHER CAR MANUFACTURERS SEEM TO HAVE FIGURED IT OUT.  MAYBE THEY SHOULD CONSULT WITH TOYOTA",
        "vin": "5J8TB4H38FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413456,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE USED AT 107,000 MILES. THE LOW BEAM HEADLIGHTS ARE DIMMER THAN THE DAYTIME RUNNING LIGHTS AND TURN SIGNAL LIGHTS. THE VEHICLE IS NOT SAFE TO DRIVE IN THE DARK. THE FIRST TIME I DROVE IT BEFORE SUN UP I PULLED OVER AN WALKED TO THE FRONT TO SEE IF THEY WERE ON. THE ILLUMINATION IS INADEQUATE WHEN THE CAR IS STOPPED OR IN MOTION. APPARENTLY THE REFLECTOR MATERIAL HAS DETERIORATED IN THE HEADLIGHT HOUSING SO REPLACING THE BULBS WON'T RESOLVE  THE ISSUE. THESE HEADLIGHT ASSEMBLIES SHOULD BE RECALLED.",
        "vin": "5J8TB4H35FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/10/2021",
        "dateOfIncident": "04/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407416,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE REFER TO PREVIOUS ACURA HEADLIGHT RECALLS, 14V323000 & 15V301000. I HAVE THE EXACT SAME PROBLEM WITH MY 2015 ACURA RDX. NIGHT TIME DRIVING IS DANGEROUS. SINCE HEADLIGHT LOW BEAM OUTPUT IS SO LOW, HAVE TO DRIVE AROUND WITH HIGH BEAMS ON. I HAVE READ A LOT OF THE SAME COMPLAINTS ON ACURA FORUMS. ACURA DEALER OFFERS TO REPLACE THEM BUT THEY CAN'T. HEADLIGHTS ARE ON NATIONAL BACKORDER. THAT TELLS ME IT IS A MUCH BIGGER PROBLEM THEN THEY WILL ADMIT. PLEASE INVESTIGATE THIS SAFETY ISSUE.",
        "vin": "5J8TB3H33FL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405722,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DISCOVERING MULTIPLE LOCATIONS WHERE PAINT IS PEELING. IDENTICAL LOCATIONS TO THE ACURA MDX WHITE PEARL PAINT. REAR ROOF NEAR REAR DOOR, REAR DOOR BELOW GLASS, LEFT REAR PANEL, FRONT PANEL NEAR HOOD, REAR BUMPER AND FRONT WINDOW PASSENGER SIDE WINDOW FRAME.",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405408,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIMILAR TO THE 2015 MDX, THE RDX WHITE PAINT IS ALSO PEELING IDENTICAL TO THOSE AREAS OF THE LISTED ON THE PAINT WARRANTY EXTENSION OF MDX.",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403727,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAMS ON VEHICLE OFFER NO VISIBILITY WHILE DRIVING AT NIGHT.  I WAS HAVING A HARD TIME WHILE DRIVING AT NIGHT.  I HAD TO USE THE HIGH BEAMS WHILE CITY DRIVING.",
        "vin": "5J8TB3H3XFL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402579,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MOTION OR PARKED, THE VEHICLE'S HEADLIGHTS ON LOW BEAM ARE NOT BRIGHT ENOUGH TO DRIVE SAFELY.   AT HIGH SPEEDS ESPECIALLY.   THE HEADLIGHTS ARE DIM ENOUGH THAT NOTHING IS VISIBLE AT ALL PAST 15 FEET IN FRONT OF THE CAR.   ABSOLUTELY SHOCKED THAT ACURA IS ALLOWING THIS SAFETY HAZARD TO REMAIN ON THEIR REPUTATION.  THE LIGHT THAT DOES SHOW IS YELLOWISH AND NOT BRIGHT AT ALL.  OTHER CARS HAVE STOPPED ME THREE TIMES TO ASK IF I ACTUALLY HAD LIGHTS TURNED ON.  I AM AT 115,000 MILES NOW, AND BEGAN NOTICING IT AT 90K.  IF PUBLIC NOTICES ARE NEEDED TO WAKE ACURA UP TO THEIR RESPONSIBILITY TO RECALL TO FIX THIS PROBLEM, I WILL BE HAPPY TO SPREAD THE NEWS FURTHER.  AGAIN, SHOCKED.",
        "vin": "5J8TB3H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT STATED THAT THE HEADLIGHTS FAILED TO OPERATE CORRECTLY AND BECAME VERY DIM REDUCING VISIBILITY OF THE ROADWAY WHILE DRIVING. NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO FLOW ACURA (4952 NEW CENTRE DR, WILMINGTON, NC 28403, (910) 218-7070) WHERE THE TECHNICIAN INSPECTED THE HEADLIGHTS AND CLEANED THE HEADLAMP BULBS. THE VISIBILITY WAS MINIMALLY IMPROVED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "5J8TB3H32FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398679,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLAMPS DETERIORATE IN THE HOUSING CAUSING THE LIGHT OUTPUT TO DANGEROUSLY DROP FOR NIGHTTIME DRIVING. HARD TO GET PICTURES",
        "vin": "5J8TB4H31FL"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396649,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHT ARE EXTREMELY DIM OFFERING NO NIGHT TIME VISIBILITY WITHOUT USING THE HIGH BEAM HEADLIGHTS.  THE DEALER HAS REPLACED THE BULBS AND ADJUSTED THE LIGHTING AND THERE IS NO IMPROVEMENT.  THE CAR HAS 80,000 MILES AND UPON FURTHER RESEARCH THIS IS A VERY COMMON PROBLEM WITH THESE 2015 RDX VEHICLES.  THE CAR IS NOT SAFE TO DRIVE AT NIGHT. MY ACURA SERVICE DEPARTMENT ACTUALLY TOLD ME THAT THESE CARS ARE KNOWN FOR HAVING POOR VISIBILITY.  THE ISSUE IS ONLY WHEN USING THE LOW BEAM HEADLIGHTS.  THIS IS A SAFETY HAZARD AND NEEDS TO E REPAIRED BY ACURA.",
        "vin": "5J8TB4H31FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT STATED THAT THE HEADLAMP HOUSING HAD DETERIORATED RESULTING IN POOR VISIBILITY WHILE DRIVING. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER KEY ACURA OF GAINESVILLE (3435 N MAIN ST, GAINESVILLE, FL 32609, (855) 856-9562) WHERE IT WAS DIAGNOSED WITH NEEDING THE HEADLAMP HOUSING TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 101,000.",
        "vin": "5J8TB3H32FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396188,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHT LOW BEAMS ARE NOT BRIGHT ENOUGH.  NIGHT TIME DRIVING ON THE ROAD WITHOUT STREET LIGHTS, THE VISIBILITY CAN ONLY REACH ABOUT ONE VEHICLE AHEAD.  FOR INSTANCE, WE WERE DRIVING 60MILES/HOUR ON I-94 WITHOUT ANY STREET LIGHTS NOR LANE MARK REFLECTORS, WE WERE UNABLE TO SEE 50FT IN FRONT OF US. THIS CREATES A VERY DANGEROUS SITUATION.  PHOTO WERE UNABLE TO PROVIDE SINCE WE WERE JUST TRYING TO STAY ALIVE DRIVING IN THE DARK.",
        "vin": "5J8TB4H30FL"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396087,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 RDX HEADLIGHTS ARE SO DIM THAT DRIVING IT AT NIGHT IS A MAJOR SAFETY HAZARD.  I HAVE REPLACE MY BULBS 3 TIMES AND EVEN UPGRADED THEM TO LED'S AND THE PROBLEM DTILL EXIST.  I TOOK IT TO MY LOCAL ACURA DEALERSHIP AND THEY REPLACED THE BULBS AND SUGGESTED I NEEDED A NEW HOUSING.  THEY INSTALLED THE NEW HOUSING AND IT STILL ISN'T ANY BETTER.  I'VE SPENT OVER $1000 TRYING TO REMEDY THE ISSUE.  THE DEALERSHIP WANTS $2200 TO REPLACE THE HEADLAMP ASSEMBLIES.  WHEN I PURCHASED THIS VEHICLE I THOUGHT I WAS PURCHASING A LUXURY VEHICLE AND NOT SOMETHING THAT SUCH A MAJOR ISSUE IN WORKMANSHIP WOULD GO UNNOTICED AND UNSPOKEN FOR BY THE COMPANY.  I WORRY ABOUT THE SAFETY OF ME AND MY SON DUE TO THE POOR VISIBILITY THAT I AM LOOKING TO TRADE THIS CAR AS IT IS UNSAFE TO OPERATE AFTER DARK.",
        "vin": "5J8TB4H37FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394602,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE PUT THREE SETS OF HEADLIGHTS OVER THE LAST 3 YEARS IN MY VEHICLE TO NO AVAIL. IT IS SO DARK WHEN I DRIVE NOW I CAN ONLY DRIVE WHILE USING HIGH BEAMS. I AM TOLD BY THE DEALER THE REFLECTOR HAS MALFUNCTIONED AND I MUST REPLACE THE HEADLIGHTS REFLECTORS. THE DEALER EVEN REPLACED MY HEADLIGHTS 9 MONTHS AGO AND NEVER MENTIONED THE ISSUES.",
        "vin": "5J8TB3H35FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "11/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394742,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ARE ON AND THE PLASTIC LENS COVER IS CLEAR (NOT FOGGED OVER), HOWEVER THE HEADLIGHTS DO NOT LIGHT UP THE ROAD AT NIGHT. SIMILAR TO OTHER POSTS, PASSENGERS HAVE ASKED IF MY HEADLIGHTS ARE ON WHEN IN FACT THEY WERE ON. THE TURN SIGNALS LIGHT UP THE ROAD MORE THAN THE HEADLIGHTS.  THE HIGH BEAMS WORK FINE.",
        "vin": "5J8TB3H35FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390617,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS WERE VERY DIM WHILE DRIVING AT NIGHT OR IN LOW LIGHT CONDITIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND WAS DIAGNOSED THAT THE HEADLIGHT ASSEMBLIES NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE CONTACT MENTIONED THAT SHE HAD REPLACED THE LIGHT BULBS SEVERAL TIMES WHICH FAILED TO FIX THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.  THE VIN WAS NOT AVAILABLE  *BF",
        "vin": "5J8TB4H30FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389712,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM PROJECTOR LIGHT IS SO LOW THAT IT BECOMES A SAFETY HAZARD WHILE DRIVING AT NIGHT. ITS DUE TO LOW QUALITY REFLECTOR AT THE BACK OF PROJECTOR. DEALER QUOTED $2200 TO REPLACE BOTH HEADLAMPS. ITS AN ACURA FAULT TO PASS THE QUALITY CHECK ON SUCH KIND OF DEFECTIVE MATERIALS AND COST CUSTOMER LIFE. THE ALREADY RECALLED 2014 RDX AND ILX BUT NO NEWS FOR 2015 RDX. SUCH A SHAME.",
        "vin": "5J8TB3H3XFL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387537,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REFLECTIVE COATING ON THE HEADLIGHT HOUSING HAS DISINTEGRATED RESULTING IN VIRTUALLY NO LOW-BEAM HEADLIGHT ILLUMINATION ON THE ROADWAY, THIS DEFECT HAS BEEN GRADUAL BUT THE END RESULT IS AN EXTREMELY UNSAFE DRIVING CONDITION. TO DRIVE WITH THIS CONDITION REQUIRES THE HIGH-BEAM TO BE USED, WHICH IS IMPRACTICAL IN MOST DRIVING SITUATIONS. WE HAVE SPENT OVER $1600 TO HAVE NEW LAMP HOUSINGS INSTALLED; ACURA/HONDA REFUSES TO ADMIT THE PROBLEM IS A SAFETY ISSUE, BUT THERE ARE MANY MANY COMPLAINTS LOGGED IN ON-LINE CAR CHAT SITES. THIS CAR SHOULD HAVE BEEN RECALLED AND THIS VERY SERIOUS SAFETY ISSUE RECTIFIED.  I HAVE THE FAILED HOUSING S IF THEY WANT TO BE EXAMINED.",
        "vin": "5J8TB4H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/01/2021",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385983,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH DRIVER AND PASSENGER LOW BEAM HEADLIGHTS ILLUMINATION HAS DECREASED SIGNIFICANTLY TO THE POINT IT IS UNSAFE TO DRIVE AT NIGHT. IT DOES NOT PROVIDE PROPER LIGHTING TO ILLUMINATE ROAD, ROAD SIGNS OR OTHER VEHICLES. THE ILLUMINATION DOES NOT CHANGE IF VEHICLE IS STATIONARY OR WHILE DRIVING. VEH. HAS 125K MILES AND IT APPEARS ITS IS A COMMON PROBLEM WITH ACURAS OF THIS YEAR AND MODEL. BULB CHANGE DOES NOTHING.",
        "vin": "5J8TB3H32FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS ON THIS CAR ARE DANGEROUSLY DIM. I REPLACED THE HALOGEN BULBS TWICE AND EVEN DID A THIRD REPLACEMENT USING LED BULBS. NOTHING HELPS. I SEE MANY, MANY SIMILAR COMPLAINTS HERE. THIS WILL CAUSE AN ACCIDENT IF SOMETHING ISN'T DONE. IT'S CLEARLY A PROBLEM WITH THE VEHICLE. ACURA HAS ALREADY RECALLED SIMILAR MODELS. THE NEED TO DO A RECALL ON THE 2015 RDX TOO!",
        "vin": "5J8TB3H37FL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383885,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/4/2020 DURING THE LAST SERVICE ON MY 2015 ACURA RDX, THE MECHANIC NOTICED BADLY RUSTED FRONT DRIVE AXLE SHAFTS AND WARNED ME OF THE POSSIBILITY OF THEIR BREAKING ON THE ROAD.  I JUST NOTICED THAT HONDA IS IN THE PROCESS OF ISSUING A RECALL FOR THE EXACT SAME PROBLEM.  HOWEVER, 2015 RDX IS NOT A PART OF THAT RECALL.  20V769 AND 20V770 ARE THE RECALL NUMBERS FOR THE RELATED ISSUE.  I BELIEVE THAT HONDA SHOULD ALSO RECALL 2015 RDX SINCE THE THEIR DRIVE SHAFT AXLES ARE ALSO RUSTING.",
        "vin": "5J8TB4H51FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382725,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT STATED WHILE DRIVING AT NIGHT, THE HEADLIGHTS FAILED TO PROVIDE PROPER ILLUMINATION FOR SAFE DRIVING. THE CONTACT STATED THAT WHEN THE FAILURE FIRST OCCURRED, THE VEHICLE WAS TAKEN TO ACURA OF FREMONT (5700 CUSHING PKWY, FREMONT, CA 94538, WHERE THE HEADLIGHTS BULBS WERE REPLACED HOWEVER, THE FAILURE RECURRED. THE CONTACT STATED THAT SHE ALMOST RAN OFF OF THE ROAD SEVERAL TIMES DUE TO THE DIMNESS OF THE HEADLIGHTS. THE CONTACT CALLED ACURA OF MODESTO (4325 MCHENRY AVE, MODESTO, CA 95356), AND INFORMED THEM OF THE FAILURE. THE DEALER INFORMED THE CONTACT THAT THERE WAS NOTHING THEY COULD DO ABOUT THE FAILURE. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT PART OF A RECALL AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS APPROXIMATED 96,217.",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377909,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS ARE VERY DIM ON MY ACURA RDX.  IT'S VERY HARD TO SEE THE ROAD AT NIGHT AND AS SUCH IT IS UNSAFE FOR DRIVING AT NIGHT.  I HAVE HAD THE BULBS REPLACED TWICE AND THE LENSES PROFESSIONALLY BUFFED.  THE ACURA DEALERSHIP SAID THAT THEY CANNOT REPAIR AND WOULD NEED TO REPLACE BOTH HEADLIGHT ASSEMBLIES AT A RIDICULOUS COST.  NO PROBLEMS WITH HIGH BEAMS, ONLY LOW BEAM.",
        "vin": "5J8TB3H34FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377396,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE NOT SUFFICIENTLY BRIGHT TO LIGHT UP THE ROAD OR ROAD SIGNS. THE DEALER IS FAMILIAR WITH THE PROBLEM BUT DOESN'T HAVE A SOLUTION TO OFFER.  THE LIGHT COVERS ARE CLEAR WITH NO FOGGING.",
        "vin": "5J8TB4H35FL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376407,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED INTERMITTENT STARTING HESITATION, TOOK TO ACURA DEALER, DEALER DIAGNOSED LOW PRESSURE FROM FUEL PUMP (40 PSI VS. 55 PSI SPEC). HAD TO REPLACE FUEL PUMP, AND PAID FULL COST OUT OF POCKET. APPEARS ACURA FUEL PUMP ISSUE IS FOR YEARS PRIOR TO 2019, AND RECALL SHOULD BE EXPANDED IN SCOPE, AS MY ACURA RDX IS A 2015 AND ALSO HAD A FAULTY FUEL PUMP. I AM THE ORIGINAL VEHICLE OWNER AND MAINTAIN MY VEHICLE QUITE WELL.",
        "vin": "5J8TB3H58FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375563,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": ": THIS IS MY FOURTH ACURA VEHICLE. (98 INTEGRA/2010 RDX/2010 TSX) AND NOW A CPO 2015 RDX. THE VEHICLE IN THE DAYLIGHT, IS EXCELLENT. HOWEVER, THE AMOUNT OF LIGHT THAT THE HEAD LIGHTS ILLUMINATES IS EXTREMELY POOR, ALMOST DANGEROUS. THE DEALER IS VERY GOOD AND THEY HAVE STATED THEY KNOW ITS AN ISSUE, AS THE FOIL IS NOT REFLECTIVE ENOUGH. THE LENS' ARE CRYSTAL CLEAR, SO THAT IS NOT THE ISSUE. I AM CONCERNED FOR MY DAUGHTER, WHO IS A NEW DRIVER, AND TRIED TO DRIVE THE VEHICLE AT NIGHT AND CAME BACK TERRIFIED THAT SHE WAS UNABLE TO SEE WELL AT VS. OUR 2017 OUTBACK. THERE SHOULD BE A RECALL ON THIS AS IT CLEARLY A SAFETY ISSUE.",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366447,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS ARE TOO DIM TO SAFELY DRIVE ON THE ROAD AT NIGHT DUE TO A MANUFACTURING DEFECT (EITHER POOR MATERIALS OR POOR WORKMANSHIP).  THERE IS ZERO VISIBILITY AT NIGHT.  THIS IS A KNOWN ISSUE WITH A RECALL FOR THE SAME YEAR VEHICLE OF THE RLX, THE RDX HAS NOT BEEN RECALLED FOR UNKNOWN REASONS ALTHOUGH IT HAS THE SAME SAFETY ISSUE.",
        "vin": "5J8TB3H30FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361193,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY 2019 I REALIZED THE LOW BEAM LIGHTS WERE LIT BUT DID NOT EMIT ENOUGH LIGHT TO SEE AT NIGHT. THE HOUSING COVER IS CLEAR. I THOUGHT I HAD AN EYE PROBLEM FOR AT LEAST A YEAR PRIOR BUT MY EYE DOCTOR WAS SAYING I HAD 20/20 VISION WITH MY GLASSES..  TWO ACURA DEALERSHIPS, AN AUTO REPAIR SHOP, AND AN AUTO PARTS STORE COULD NOT DETERMINE THE PROBLEM.  ACURA CLIENT RELATIONS SAID THE DAMAGE WAS UV RAYS. THEY ALL SAY BOTH HEADLIGHT ASSEMBLIES HAVE TO BE REPLACED AND CANNOT BE FIXED.  THE DEALERSHIP WHERE I BOUGHT IT REPLACED THE BULBS WITH NO IMPROVEMENT. THERE IS NO CLOUDINESS OR LIQUID IN THE ASSEMBLY. I HAVE NOT BEEN ABLE TO SAFELY DRIVE THE CAR AFTER DUSK IN OVER A YEAR.THE STATES ATTRNY OFFICE COULD NOT RESOLVE.",
        "vin": "5J8TB3H38FL"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359808,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LLOW BEAM HEADLIGHTS HAVE DIMMED OVER TIME (CAR WAS JUST OVER 4 YEARS OLD) TO THE EXTENT THAT IT IS NO LONGER SAFE TO OPERATE VEHICLE AT NIGHT WITHOUT USING HIGH BEAM LIGHTS.  REPLACING BULBS DOES NOT CORRECT THE PROBLEM.  DEALER AND DSM REP AGREE THERE IS A PROBLEM BUT WILL ONLY REPAIR FOR OVER $1,000.  THERE WAS A RECALL FOR SIMILAR ISSUE ON DIFFERENT MODEL.  MANY COMPLAINTS ONLINE FOR THIS ISSUE.",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "07/26/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354937,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING ON THE INTERSTATE AND THEN SLOWING DOWN, A CHECK VSA SYSTEM, CHECK HILL START ASSIST SYSTEM, AND CHECK POWER STEERING LIGHT COMES ON THE DASH.  SOMETIMES AFTER A RESTART THE LIGHT DOESN'T COME ON. SOMETIMES IT TAKES MULTIPLE DRIVES AND RESTARTS TO CLEAR THE LIGHT.",
        "vin": "5J8TB3H30FL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349893,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLS OUT (LIMP MODE) WHEN ACCELERATING PAST 60 MPH. IT WILL NOT GO ABOVE 3000 RPMS. ONCE THAT HAPPENS, IT IS DIFFICULT TO ACCELERATE AT ALL, EVEN AT VERY LOW SPEEDS. I CAN PRESS THE PEDAL TO THE FLOOR AND NOTHING HAPPENS. THE VEHICLE SHAKES CONSIDERABLY WHEN IDLE.",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11337663,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT STATED THAT WHILE DRIVING IN THE MIDDLE LANE ON THE HIGHWAY, THE VEHICLE WAS REAR-ENDED WHICH CAUSED THE VEHICLE TO CRASH INTO A CONCERT DIVIDER. THE VEHICLE ENDED UP IN THE LEFT LANE, WHERE IT WAS HIT HEAD-ON BY A BUS. THE AIR BAGS DID NOT DEPLOY. THE CONTACT STATED THAT AN UNKNOWN LIGHT ILLUMINATED. THE DRIVER AND THE FRONT PASSENGER SUSTAINED NECK, BACK AND LEG PAINS THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED AND THERE NO DECISION ON THE STATUS OF THE VEHICLE. THE DEALER AND THE MANUFACTURE WERE NOT CALLED. THE FAILURE MILEAGE WAS APPROXIMATELY 78,000.",
        "vin": "5J8TB4H55FL"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323227,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT OUTPUT OF 2015 ACURA RDX IS VERY LOW DUE TO BAD FOIL IN PROJECTOR HEADLIGHTS.  I HAVE SWTICHED BULBS BUT THAT DID NOT MAKE MUCH DIFFERENT.  THIS IS A SAFETY HAZARD TO DRIVE AT NIGHT WITH POOR VISIBILITY.  I TALKED TO ACURA DEALER AND THEY REFUSED TO REPLACE IT SINCE THERE IS NOT RECALL FOR THIS PARTICULAR ISSUE.",
        "vin": "5J8TB4H38FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308912,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS HAVE GOTTEN STEADILY DIMMER OVER THE LAST YEAR.  MY LIGHTS ARE SO DIM, PEOPLE ASK ME IF THEY ARE ON. ON ROADS WITH STREET LIGHTS, I CAN'T TELL THE LIGHTS ARE ON AND ON UNLIT COUNTRY ROADS, I CAN BARELY SEE THEY ARE WORKING.  I SPENT OVER $100 REPLACING THE BULBS WITH NO IMPROVEMENT.  IN MY RESEARCH, IT APPEARS THAT THERE IS AN ISSUE WITH A REFLECTIVE AREA INSIDE THE HEADLIGHT ASSEMBLY THAT AFFECTS THE BRIGHTNESS OF THE BULBS.  I BELIEVE THIS HAS BEEN RECALLED ON A ANOTHER ACURA MODEL ABOUT THE SAME AGE.  I ALSO UNDERSTAND THAT THE ONLY SOLUTION IS TO REPLACE THE ENTIRE HEADLIGHT ASSEMBLY WHICH COST OVER $1,000 EACH.  THE GLASS COVER OVER THE FRONT OF THE HEADLIGHT IS NOT FOGGED OR YELLOWED WITH AGE LIKE SOME CARS GET.  I DON'T HAVE ANY PICTURES OR DOCUMENTS THAT WOULD HELP.  THIS IS SOMETHING YOU HAVE TO EXPERIENCE IN ORDER TO UNDERSTAND BUT I WILL GLADLY TRY TO PROVIDE ANYTHING THAT MIGHT HELP.",
        "vin": "5J8TB3H37FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308648,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY HEADLAMPS ARE COMPLETELY INSUFFICIENT FOR NIGHT DRIVING, EXTREMELY DIM.  REPLACEMENT BULBS HAVE LITTLE TO NO EFFECT IN IMPROVING THIS.  ACURA OFFERS NO SOLUTION.",
        "vin": "5J8TB4H31FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301781,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LOW BEAMS ARE VERY DIM. THE ORIGINAL HALOGEN H11 BULBS WERE YELLOW SO I REPLACED WITH SYLVANIA SILVERSTAR ZXE'S. ALTHOUGH LIGHT NOW IS WHITE NOT MUCH OF A DIFFERENCE IN FRONT OF VEHICLE. HAD A MECHANIC INSPECT LIGHTS AND WAS TOLD SOME KIND OF FOREIGN SUBSTANCE IS ON THE BACK OF PROJECTOR LENS AND WHAT APPEARS TO BE FINGER PRINTS ON THE FRONT. POSSIBLY POOR QUALITY WHEN ASSEMBLED. TOOK VEHICLE TO ACURA WAS TOLD THE SAME THING BUT CAR IS OUT OF WARRANTY WITH NO EXTENDED COVERAGE THEY WOULD REPLACE BOTH HEADLIGHT ASSEMBLIES FOR $1900. IT APPEARS OTHER PEOPLE ARE HAVING SAME ISSUE. WITH RECALLS ON ILX AND RLX FOR SAME LOW BEAM DIM LIGHT ISSUE. NOT SAFE TO DRIVE CURRENTLY WITH LOW BEAM ONLY. HAD FOG LIGHTS INSTALLED USE ALL THE TIME TO BE ABLE TO SEE.",
        "vin": "5J8TB4H35FL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282231,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WOULD NOT START ONE MORNING. I COULD NOT GET IT OUT OF \"ACCESSORY MODE\" AND THAT MODE DRAINED THE BATTERY COMPLETELY.  I ALSO SMELLED FUEL WHEN I TRIED TO HAVE IT JUMP STARTED AND IT RAN FOR 10 SECONDS THEN DIED. I HAD IT TOWED TO AN ACURA DEALER TO HAVE IT FIXED AND THEY CALLED TO TELL ME THAT THE PLASTIC FUEL LINE ON THE UNDERSIDE OF THE CAR HAD \"MICROCRACKS\" ALONG ITS ENTIRETY AND WAS LEAKING FUEL OUT OF THESE CRACKS.  THEY SAID THAT THE FUEL LINE WAS NOT DAMAGED IN A DISCRETE LOCATION (I.E. FROM A ROCK OR OBJECT THAT HIT IT BUT THE ENTIRE PLASTIC  LINE SPANNING THE FRONT OF THE CAR TO THE REAR OF THE CAR HAD CRACKS ALL OVER IT).  I ASKED FOR THE FUEL LINE FOR EVIDENCE AND THEY CLAIMED THEY THREW IT OUT.",
        "vin": "5J8TB4H3XFL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277636,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE NOT BRIGHT ENOUGH TO PASS STATE SAFETY INSPECTION AND IT'S ALMOST IMPOSSIBLE TO DRIVE AT NIGHT DUE TO LIMITED VISIBILITY.  AFTER REPLACING THE LIGHTBULBS WITH NO CHANGE AND THEN CLOSELY INSPECTING THE HEADLIGHT ASSEMBLY, BOTH THE SAFETY INSPECTOR TECHNICIAN AND ACURA SERVICE CENTER SAID IT APPEARS TO BE A DEFECT IN THE MATERIAL WHICH HAS CAUSED DAMAGE INSIDE PART OF THE HOUSING.  THE ONLY OPTION TO FIX THE ISSUE IS TO REPLACE THE ASSEMBLY WHICH COSTS OVER $1300 JUST FOR ONE SIDE.  I CONTACTED ACURA CLIENT SERVICES ABOUT MY 2015 RDX SAFETY ISSUE AND RECEIVED NO HELP EVEN THOUGH THERE HAVE BEEN MULTIPLE VEHICLE RECALLS FOR WHAT APPEARS TO BE THE SAME PROBLEM.  (2014-2015 ACURA ILX RECALL 14V323000 AND 2014-2015 ACURA RLX RECALL15V301000 ) THERE ARE ALSO MANY COMPLAINTS AND POSTS BY OTHER ACURA RDX OWNERS IN ACURAZINE AND OTHER VEHICLE FORUMS ABOUT WEAK HEADLIGHTS AND THE DANGER THEY CREATE WHEN DRIVING.  THIS SHOULD BE INSPECTED IMMEDIATELY.",
        "vin": "5J8TB4H31FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270204,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 RDX IS JUST OVER 5 YEARS OLD AND THE HEADLIGHTS ARE SO FOGGED OVER THAT IT IS TOO DANGEROUS TO DRIVE AT NIGHT AND I NEED TO REPLACE THEM.  I TOOK THE CAR INTO THE DEALERSHIP TO HAVE THEM LOOK AT THE ISSUE AND WAS QUOTED OVER $800 EACH TO REPLACE THEM. (OVER $1600 TOTAL)  THE DEALER TRIED SOME CLEANER/POLISH ON THEM BUT THAT DIDN'T HELP.  I'VE ALSO SPENT MULTIPLE HOURS USING A HEADLIGHT RESTORATION KIT TO TRY TO IMPROVE THIS ISSUE TO NO AVAIL.    I'VE WRITTEN ACURA AND THEY SAID THEY WON'T COVER THIS SINCE IT'S OUT OF WARRANTY AND IT'S DUE TO \"EXTERIOR INFLUENCES\".  MAYBE THIS TYPE OF FOGGING CAN OCCUR BUT IT SHOULDN'T HAPPEN OVER THIS SHORT OF A TIME FRAME.  I DON'T KNOW EXACTLY WHEN THIS OCCURRED BUT FIRST NOTICED THE PROBLEM ABOUT 8 WEEKS AGO.    I HAVE TO REPLACE THE HEADLIGHTS SINCE IT'S TOO DANGEROUS TO DRIVE AT NIGHT OR IN OTHER LIMITED VISIBILITY CONDITIONS. *JS",
        "vin": "5J8TB4H37FL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2019",
        "dateOfIncident": "06/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228439,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AND MY MOONROOF SUDDENLY SHATTERED.  I HAD TAKEN A LEFT HAND TURN ONTO THE HIGHWAY AND SHORTLY AFTER I REACHED THE 55 MPH SPEED LIMIT I HEARD A LOUD NOISE AND DIDN'T KNOW WHAT HAPPENED AT FIRST, THEN I HEARD MORE CRACKLING FROM ABOVE AND FIGURED IT WAS THE MOONROOF.  LUCKILY I HAD THE SHADE CLOSED AND THERE WERE NO OTHER VEHICLES AROUND ME AT THE TIME.  SINCE THERE WERE NO OTHER VEHICLES AROUND AND I WASN'T DRIVING UNDER AN OVERPASS, IT SEEMS TO ME THIS HAPPENED SPONTANEOUSLY VS SOMETHING LIKE A ROCK HITTING THE MOONROOF.",
        "vin": "5J8TB4H36FL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195045,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REFLECTIVE MATERIAL IN THE HEADLIGHTS HAS DETERIORATED TO THE POINT THAT NIGHT TIME DRIVING IS HAZARDOUS. I HAVE REPLACED THE REGULAR BULB AND IT DID NOT RESOLVE THE ISSUE, I THEN REPLACED THE REG BULB WITH AN LED LIGHT AND IT DID NOT RESOLVE THE ISSUE. WITHOUT A GOOD REFLECTOR SURFACE, THE LIGHT WILL NOT SAFELY FUNCTION. REPLACEMENT COSTS ARE WELL OVER $1,200 AND I SHOULD NOT HAVE TO PAY FOR THIS POOR CHOICE IN REFLECTIVE MATERIAL IN THE 2015 RDX HEADLIGHTS. THE RXL 2014 MODEL WAS RECALLED FOR THE SAME ISSUE. I BELIEVE THAT THE SAME PROBLEM IS WHAT I AM EXPERIENCING. I CAN NO LONGER SAFELY DRIVE AT NIGHT UNLESS I TURN ON THE BRIGHT LIGHTS WHICH WILL BLIND THE ONCOMING TRAFFIC AND ALSO IS NOT SAFE. I SHOULD NOT HAVE TO PAY FOR A DEFECTIVE HEADLIGHT ON THIS VEHICLE.",
        "vin": "5J8TB3H30FL"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174469,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. WHILE DRIVING 40 MPH, THE SUN ROOF EXPLODED. THERE WERE NO INJURIES. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 77,023.",
        "vin": "5J8TB3H52FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166467,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. HONDA OF PRESCOTT (3291 WILLOW CREEK RD, PRESCOTT, AZ 86301, (928) 778-5500) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154703,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT NOTICED AN ABNORMAL CLUNKING NOISE IN THE REAR SUSPENSION. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO WALSER ACURA OF WICHITA (10850 E 13TH ST N, WICHITA, KANSAS 67206, 316-341-2288) WHERE IT WAS DIAGNOSED THAT THE REAR SHOCKS NEEDED TO BE REPLACED. THE CONTACT STATED THAT ANOTHER TECHNICIAN STATED THAT THE REAR AND UPPER DAMPERS NEEDED TO BE INSTALLED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "5J8TB3H59FL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/27/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132391,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETHING IS DRAINING THE BATTERY, KEEP HAVING TO JUMPSTART IT AND STALLS SOMETIMES WHEN DRIVING. BATTERY PASS AS GOOD. I DID RESEARCH ON IT AND A LOT OF COMPLAINTS ABOUT IT.",
        "vin": "5FRYD3H42FB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124140,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WEBSTER, WILL NOT ACCEPT MY VIN NUMBER!?",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088609,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. WHILE DRIVING APPROXIMATELY 25 MPH, THE CONTACT INADVERTENTLY LOST CONTROL OF THE VEHICLE AND COLLIDED WITH A TREE. THE CONTACT DID NOT KNOW HOW CONTROL WAS LOST, BUT BELIEVED IT WAS DUE TO A MECHANICAL FAILURE WITH THE VEHICLE. THE DRIVER'S SIDE AIR BAG DEPLOYED. THERE WERE NO INJURIES SUSTAINED. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO THE DEALER (OPEN ROAD ACURA, 1425 ROUTE 23, WAYNE, NEW JERSEY 07470) WHERE IT WAS AWAITING DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "5J8TB4H34FL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024543,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PUT MY CAR IN PARK IN DRIVEWAY WITH THE ENGINE RUNNING, STEPPED OUT OF MY VEHICLE AND IT STARTED MOVING FORWARD, HITTING THE GARAGE.  THE CAR HIT THE GARAGE AND  I TRIED TO PUSH IT BACKWARDS, IT MOVED BACKWARD AFTER HITTING THE GARAGE AND STARTED ROLLING AWAY FROM THE GARAGE.  MY BABY WAS IN THE CAR, SO I GOT IN THE OPEN DOOR OF THE CAR AND ATTEMPTED TO MOVE THE GEAR SHIFT OUT OF P TOWARDS D, THINKING THIS WOULD HELP STOP THE CAR AS I STEPPED ON THE BRAKE PAD.  DURING THIS ENTIRE PERIOD, THE CAR WAS MAKING A GRINDING SOUND, WHICH I ASSUME WAS THE BRAKES.  THE CAR FINALLY STOPPED ROLLING AND CAME TO A STOP AS I STEPPED ON THE BRAKE A SECOND TIME.    THE DRIVEWAY IS ON A DOWNWARD SLOPE SO THE CAR WAS GAINING MOMENTUM AS IT BOUNCED OFF THE GARAGE. THERE MINOR DAMAGE DONE TO CAR BUT THE GARAGE DOOR WILL NEED TO BE REPLACED SINCE IT IS BADLY DAMAGED.",
        "vin": "5J8TB3H3XFL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "12/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934450,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I WROTE TO ACURA ASKING FOR IMMEDIATE REPLACEMENT DUE TO POSSIBLE DEATH OR SEVERE INJURY. I RECEIVED A VOICEMAIL MESSAGE. I CALLED BACK AND NEVER HEARD BACK AGAIN. I AM BEING IGNORED. WE SOMETIMES USE THIS CAR TO CARRY A BABY. THERE IS NO ONE DAY THIS HAPPENED ALTHOUGH YOUR WEBSITE REQUIRES SUCH AN ENTRY TO HAVE MAY COMPLAINT ACCEPTED!!!",
        "vin": "5J8TB4H58FL"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "11/26/2016",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10928053,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. THE AIRBAG DEPLOYED WHILE MY RIGHT HAND WAS ON THE 2 O'CLOCK POSITION. I WAS GOING ABOUT 30 MPH ON A CITY STREET, AND HIT A CAR THAT STOPPED SUDDENLY IN FRONT OF ME. IT WAS LIKE A BOMB BLAST ONTO MY WRIST, FORCEFULLY BLASTING OUT ACID AND AIR OR WHATEVER'S IN THAT AIRBAG. I HAVE A TRAUMA INJURY AND CHEMICAL BURNS ON MY WRIST. THERE ARE CHEMICAL BURN HOLES ALL OVER THE DASHBOARD AS WELL. AT FIRST I THOUGHT MY BEADED BRACELET HAD PUNCTURED MY WRIST. ONE BURN LOOKED LIKE A CIGARETTE BURN, AND WITHIN 2 HOURS THE BURN HOLE SKIN TURNED PITCH BLACK. OTHER BLISTERS FORMED AS THE HOURS WENT BY. THE NEXT MORNING (THANKSGIVING) I WENT TO URGENT CARE AND THEY REFERRED ME TO THE EMERGENCY ROOM. THEY SAID IT WAS CHEMICAL BURN INJURIES, WHICH I AM NOW TREATING. IT IS EXTREMELY PAINFUL. I DID FILE AN INSURANCE CLAIM AND THERE IS A POLICE REPORT, BUT THE ACCIDENT WAS ONLY 3 DAYS AGO. I DECLINED MEDICAL ATTENTION AT THE TIME OF THE ACCIDENT, AS I THOUGHT IT WAS ONLY A SIMPLE BRUISE, AND AT THAT TIME DIDN'T REALIZE THAT THE AIRBAG VENT WAS BY MY WRIST, AND THAT I HAD CHEMICAL INJURIES.",
        "vin": "5J8TB4H0300"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924657,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING OR BRAKING, THE CAR LURCHES FORWARD.  IT OCCURS WHEN EVEN PRESSURE IS APPLIED AND IS MOST NOTICEABLE WHEN APPLYING BRAKES AND VEHICLE IS AT 1000 RPMS AND AROUND 20MPH.  OFTEN THE DRIVER MUST PRESS HARD ON THE BRAKES IN ORDER TO COME TO COMPLETE STOP AND AVOID HITTING VEHICLE IN FRONT. THIS IS A RECURRING ISSUE. BRAKES WERE REPLACED AT 14,000 MILES IN 7/2016 BY DEALERSHIP AND OWNER FEELS BRAKES MAY HAVE PREMATURELY WORN DUE TO THE BRAKING ISSUE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "09/27/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910050,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS UNAVAILABLE. UPDATED 01/06/2017*CT  THE CONSUMER AFTER SIX MONTHS, THE AIR BAG WAS FINALLY REPLACED. UPDATED 03/01/17.*JB",
        "vin": "5J8TB3H33FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904912,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 10/21/16*LJ  THE CONSUMER STATED THE AIR BAG WAS REPLACED. UPDATED 10/25/16.*JB",
        "vin": "5J8TB4H58FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899744,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL FEB 2016  PART STILL NOT AVAILABLE AFTER 6 MONTHS",
        "vin": "5J8TB4H32FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897903,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  CALLED THE DEALER WHERE WE PURCHASED OUR VEHICLE: SUNNYSIDE ACURA IN NASHUA, NH SEVERAL TIMES OVER SEVERAL MONTHS TO HAVE AIRBAG REPLACED/REPAIRED BUT WAS TOLD THAT PARTS WERE NOT AVAILABLE NOR DID THEY DIDN'T KNOW WHEN THE PARTS WOULD BE AVAILABLE.",
        "vin": "5J8TB4H52FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "03/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897995,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TOLD THE RECALL SITUATION WOULD BE RESOLVED NO LATER THAN JUNE BACK IN THE MARCH/APRIL TIME FRAME. IT  IS ALMOST SEPT AND I STILL AM WAITING.",
        "vin": "5J8TB4H5XFL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898045,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 10/06/16*LJ  *TR",
        "vin": "5J8TB3H36FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895135,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H30FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891642,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE FOR MONTHS SO THE CONTACT WAS UNABLE TO DETERMINE WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACTS VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB3H34FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2016",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889131,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  ACURA NOTIFIED US THAT OUR ACURA RDX WAS BEING RECALLED FOR AIR BAG REPLACEMENT IN MARCH 2016--SEE ATTACHED PDF OF RECALL LETTER.  WE CONTACTED MARIN ACURA, THE DEALER WHICH SOLD US THE CAR, ON THE SAME DAY WE RECEIVED THE LETTER TO MAKE A SERVICE APPOINTMENT FOR THE RECALL/AIRBAG REPLACEMENT.  THEY NOTIFIED US THAT THE PARTS WOULD NOT BE AVAILABLE UNTIL \"EARLY SUMMER\".  WE HAVE FOLLOWED UP FREQUENTLY BUT HAVE BEEN CONSISTENTLY TOLD PARTS ARE STILL NOT AVAILABLE WITH NO ESTIMATE OF AVAILABILITY.  MARIN ACURA IS GENERALLY RESPONSIVE, FUNNELING ALL CALLS TO ONE SERVICE REPRESENTATIVE WHO IS GENERALLY UNAVAILABLE AND DOES NOT RETURN CALLS. THE RECALL REPAIR HAS NOT BEEN MADE OVER 4 MONTHS LATER, AND NO ASSURANCE OF FUTURE AVAILABILITY OF REPLACEMENT HAS BEEN MADE.  WE ARE CONCERNED ABOUT REPORTS OF INJURY OR DEATH RISK, BUT ACURA/MARIN ACURA HAVE TAKEN NO STEPS TO RESOLVE THIS MATTER AND WE ARE LEFT IN LIMBO.",
        "vin": "5J8TB4H36FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884145,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J8TB3H3XFL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J8TB4H53FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "02/28/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875121,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 ACURA RDX.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR DRIVER AIRBAG INFLATOR RECALL NOTICE.  *SMD",
        "vin": "5J8TB3H51FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874638,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H59FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861852,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 ACURA RDX.  CONSUMER WRITES IN REGARDS TO PARTS NOT AVAILABLE TO REPAIR RECALL NOTICE.  *SMD",
        "vin": "5J8TB4H5XFL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/26/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861807,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 ACURA RDX.  CONSUMER WRITES IN REGARDS TO DEALERSHIPS FAILURE TO REMEDY RECALL DEFECT.  *SMD",
        "vin": "5J8TB4H34FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860787,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 ACURA RDX.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR AIRBAG INFLATOR RECALL NOTICE.  *SMD",
        "vin": "5J8TB4H33FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/18/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860181,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE FAILURE MILEAGE WAS 14,000.",
        "vin": "5J8TB3H31FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853495,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    I SPOKE TO THE DEALERSHIP WHO RECOMMENDED THAT I STAY IN THE VEHICLE AS THERE IS REALLY NOTHING TO WORRY ABOUT. THAT THEY ARE JUST BEING CAREFUL HOWEVER THERE IS NO REAL NEED TO STOP DRIVING MY VEHICLE. THEY STATED IF I STILL FEEL UNCOMFORTABLE, THEY WILL ONLY OFFER ALTERNATE TRANSPORTATION BUT NOTHING CLOSE TO THE LEVEL OF AN ACURA. IF I WANT A LUXURY CAR THAT IS COMPARABLE I WILL HAVE TO PAY THE DIFFERENCE MYSELF. I DO HOWEVER HAVE TO CONTINUE TO PAY MY LEASE FOR A CAR THAT I CANNOT DRIVE. ACURA IS PUTTING THE COMPLETE BURDEN ON THEIR CUSTOMERS AND WILL NOT BUDGE, OR PROVIDE ANY ADDITIONAL HELP TO REMEDY THIS UNFORTUNATE SITUATION. I HOPE THAT THERE IS SOMETHING THAT CAN BE DONE IN A SITUATION THAT LEAVES ME WONDERING WHERE THERE IS JUSTICE FOR THE CONSUMER. I HAVE TO PAY FOR THEIR MISTAKE? PLEASE HELP AS I HONESTLY FEEL COMPLETELY CHEATED",
        "vin": "5J8TB3H38FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853436,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I POSTED ON 3-23-16 ABOUT THE RECALL LETTER I RECEIVED AND SAID I WOULD GET BACK ON HERE AFTER I SPEAK WITH MY ACURA DEALER IN MEMPHIS.  I HAVE CONTACTED THEM TWICE.  BOTH TIMES I WAS TOLD SOMEONE WOULD CALL ME BACK.  I HAVEN'T RECEIVED A CALL.  I WILL CALL THE ACURA COMPANY NOW AND SEE WHAT HAPPENS.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852951,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT WAS DISPLEASED WITH HOW ACURA WAS HANDLING THE TAKATA RECALL. THE CONTACT DID NOT FEEL SAFE IN THE VEHICLE. THE VEHICLE WAS TAKEN TO DEALER. THE CONTACT INQUIRED ABOUT TRADING IN THE VEHICLE OR GETTING IT REPURCHASED, BUT SHE WAS NOT OFFERED A COMPARABLE PRICE OR COMPARABLE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J8TB3H35FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851732,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-  PURCHASED A 2015 RDX IN OCTOBER. I ASKED IF THE AIRBAG WAS A TAKATA AND WAS TOLD THAT IT WAS NOT. TODAY, I GOT A SAFETY RECALL TELLING ME THAT I CANNOT DRIVE THE CAR, IT COULD KILL ME. I HAVE ALSO BEEN TOLD THAT THE CAR WILL HAVE TO SIT FOR AT LEAST 4 MONTHS UNTIL THEY CAN GET THE PART TO REPLACE IT, HOWEVER I WILL STILL HAVE TO PAY MY ALMOST 600.00 CAR PAYMENT.",
        "vin": "5J8TB4H53FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/25/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851645,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IT TOOK TAKATA SEVERAL MONTHS BEFORE THEY CONTACTED ACURA ABOUT THE DEFECT.   ALL THE OTHER CAR MANUFACTURERS WERE COBTACTED MONTHS AND MONTHS AGO - WE JUST GOT NOTIFIED 2 DAYS AGO.  THIS IS WRONG - WE SHOULD HAVE BEEN TOLD MONTHS GO.",
        "vin": "5J8TB4H53FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/23/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851237,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  RECEIVED RECALL LETTER 3-22-16.  PART IS NOT AVAILABLE UNTIL SUMMER 2016.  I HAVE READ ABOUT THESE DEFECTIVE AIRBAGS FOR QUITE SOME TIME NOW AND HAVE CHECKED OFTEN TO MAKE SURE MINE WAS NOT ON THE LIST.  WHY AM I JUST NOW RECEIVING A NOTICE?  WHY AREN'T THE PARTS AVAILABLE?  WHY DO I HAVE TO WAIT MONTHS WORRYING ABOUT BEING MANGLED AND/OR KILLED BY THE EQUIPMENT THAT IS SUPPOSED TO HELP KEEP ME AND MY FAMILY/PASSENGERS SAFE?  I HAVEN'T CONTACTED THE DEALER YET, BUT I ALREADY FEEL LIKE THE DEALER HAS FAILED AND IS UNABLE TO REMEDY THE DEFECT IN MY VEHICLE WITHIN A REASONABLE AMOUNT OF TIME.  I WILL CALL THEM TO SEE WHAT THEIR \"PROVISION OF, OR REIMBURSEMENT FOR, TEMPORARY ALTERNATIVE TRANSPORTATION, AS NECESSARY\" MEANS AND GET BACK ON HERE WITH THEIR ANSWER.",
        "vin": "5J8TB3H59FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850928,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVED A RECALL NOTICE TODAY (3/21/2016). THE NOTICE STATES THAT REPAIR KITS WILL BE AVAILABLE IN THE SUMMER OF 2016 --THAT'S AT LEAST A FULL 3 MONTHS FROM NOW. IT IS IRRESPONSIBLE FOR ACURA/HONDA TO EXPECT THAT I SHOULD PUT MY LIFE IN DANGER EVERY TIME I GET IN MY CAR FOR THE NEXT 3 MONTHS DUE TO A DEFECTIVE ISSUE THAT IS ENTIRELY THEIR FAULT. I'M ALSO CONCERNED THAT I WAS NOT NOTIFIED MUCH SOONER OF MY AIRBAG --THIS HAS BEEN IN THE NEWS FOR AT LEAST A YEAR. THIS IS TOTALLY UNACCEPTABLE AND I WOULD LIKE MY AIRBAG REPLACED ASAP. ACURA SHOULD PAY FOR A RENTAL OR ALTERNATIVE VEHICLE FOR THE MONTHS I/MY FAMILY WILL BE MADE TO ENDURE HAVING A SERIOUS DEFECT IN THE CAR WE USE EVERY DAY.",
        "vin": "5J8TB3H54FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850877,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J8TB4H5XFL"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/01/2016",
        "dateOfIncident": "12/17/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817324,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 RDX SUNROOF LEAKS RAIN WATER WHILE STATIONARY. THE CAR IS SITTING IN THE DRIVEWAY OF MY HOUSE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2015",
        "dateOfIncident": "10/12/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810598,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 ACURA RDX. THE CONTACT STATED THAT WHILE DRIVING AT 20 MPH, THE STEERING WHEEL SEIZED. THE POWER STEERING WARNING LIGHT ILLUMINATED. THE FAILURE RECURRED TWICE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,000.",
        "vin": "5J8TB3H55FL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/17/2015",
        "dateOfIncident": "11/16/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794357,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING DOWN US RTE 95 YESTERDAY, GOING OVER THE BRIDGE INTO PORTSMOUTH, NH AT ~65 MPH, MY SUNROOF SUDDENLY EXPLODED, COVERING ME AND THE INTERIOR OF MY CAR WITH BROKEN GLASS.  FORTUNATELY, I WAS ABLE TO PULL OVER TO AN EXIT JUST OVER THE BRIDGE AND CALL FOR ASSISTANCE. I THINK I AVOIDED AN ACCIDENT BY VIRTUE OF THERE NOT BEING A LOT OF CARS NEAR ME WHEN THIS HAPPENED. IT WAS A SUNNY DAY, ~50 DEGREES AND MY CAR THERMOSTAT WAS AT 67 DEGREES SO TEMPERATURE DIFFERENTIAL WAS NOT A  FACTOR.  BOTH THE STATE POLICE OFFICER AND THE TOW TRUCK DRIVER OPINED THAT THE WINDOW BLEW OUT FROM WITHIN. THE OFFICER ALSO CHECKED THE BRIDGE FOR POSSIBLE FALLING DEBRIS THAT MIGHT HAVE HIT THE CAR AND FOUND NO EVIDENCE OF THAT.",
        "vin": "5J8TB4H35FL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2015",
        "dateOfIncident": "10/16/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783184,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON INTERSTATE AT ABOUT 74 MPH THE MOON ROOF SHATTERED WITHOUT WARNING. THE INSIDE VISOR WAS OPEN AND THE GLASS MOON ROOF WAS CLOSED AT THE TIME. GLASS FRAGMENTS  DROPPED  ON TOP OF DRIVER AND PASSENGER.",
        "vin": "5J8TB3H38FL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/06/2015",
        "dateOfIncident": "06/04/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732126,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 (NA) ACURA RDX. THE CONTACT STATED THAT WHILE DRIVING UP A HILL, IT WAS DISCOVERED THAT THE WHEELS WERE NOT ON THE ROAD. IT WAS UNCERTAIN WHICH WHEELS WERE IN THE AIR. THE CONTACT ALSO STATED WHEN MAKING A LEFT OR RIGHT, THE REAR WHEELS MOVED WHEN DRIVING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT DEALER WHERE IT WAS DIAGNOSED THAT THE SUSPENSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100.   UPDATED 7/29/15*CN  THE CONSUMER WOULD LIKE THE COMPLAINT REMOVED FROM THE DATABASE. UPDATED 08/06/15*JB",
        "vin": "5J8TB3H57GL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "03/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693320,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "PRIMACY MXV4 TL",
                "productYear": "9999",
                "size": "225/55 R17 97H",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE REPEATED AND ONGOING PROBLEMS WITH BRAND NEW MICHELIN TIRES LOSING  TRACTION, ESPECIALLY ON WET ROADS. THIS HAPPENS EVERY TIME I HAVE TO PULL OUT ONTO A HIGHWAY. IT ALSO HAPPENS LESS FREQUENTLY ON DRY ROADS.      I HAVE SPOKEN WITH THE NEW CAR DEALERSHIP WHERE I BOUGHT THE VEHICLE AND WITH MICHELIN TIRE CUSTOMER SERVICE PEOPLE. THE TIRES ARE THE MICHELIN PRIMACY MXM4 P235/60R/18 ALL-SEASONTIRES.  MICHELIN TOLD ME THAT \"SLIPPAGE\", (WHICH I CALL TRACTION,) IS NOT COVERED BY THEIR WARRANTY. IT IS EXTREMELY DISTURBING TO ME TO SEE A TIRE COMPANY, ESPECIALLY MICHELIN, TO SAY THAT THE TRACTIONS CAPABILITIES OF ONE OF THEIR NEW TIRES IS NOT SOMETHING THEY WILL STAND BEHIND.  *TR",
        "vin": "5J8TB3H59FL"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/22/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660623,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 ACURA RDX THE ACCELERATION IS VERY TOUCHY IN THAT SLIGHT ACCELERATOR PRESSURE GENERATES AN UNEXPECTED INCREASE IN SPEED.  THE VEHICLE ALSO TENDS TO HESITATE WHEN ACCELERATING WHILE THE TRANSMISSION IS SIMULTANEOUSLY SHIFTING GEARS.  *MW  ALSO, WHEN BRAKING AND APPLYING SLIGHT YET CONSTANT PRESSURE TO THE BRAKE, THE  BRAKES OFTEN GRABBED MORE ABRUPTLY. WHEN COASTING/SLOWING DOWN, THE TRANSMISSION HAD A NOTICEABLE DECELERATION WHEN THE VEHICLE WAS DOWN SHIFTING. THE FEEL WAS SIMILAR TO DOWN SHIFTING OF A MANUAL  TRANSMISSION. IT WAS MORE NOTICEABLE AT 20-30 MPH. THE ISSUES OCCURRED WHEN DRIVING IN HEAVY/CONGESTED TRAFFIC. *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/19/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667256,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RDX",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ALL-WHEEL DRIVE VEHICLE THAT CAME WITH ALL SEASON TIRES, WAS NOT DESIGNED TO KEEP THE WIPERS FROM ICING UP DURING INCLEMENT WEATHER. THE OUTSIDE TEMPERATURE DROPPED TO  26 DEGREES, AND THE DEFROST SYSTEM COULD NOT KEEP ICE FROM FORMING ON THE WIPER BLADES, CAUSING A SERIOUS SAFETY ISSUE.  ACURA HAS OTHER VEHICLES THAT HAVE A SAFETY SYSTEM TO KEEP ICE OFF THE WIPER BLADES, SO IT IS OBVIOUS THEIR ENGINEERS ARE AWARE OF THE PROBABILITY OF ICE ON WIPER BLADES.  *TR",
        "vin": "5J8TB4H37FL"
    }
]