[
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231555,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WAY HOME TODAY 7/12/2019 CAR STALLED OUT. I HAD VERY LITTLE BRAKES, STEERING WAS HARD TO TURN AND CAR SLOWED DOWN QUICK. IT STARTED BACK UP BUT THEN THE PASSENGER SIDE WINDOW STARTED GOING DOWN ON ITS OWN, AND THE A/C STOPPED WORKING, AND THE DRIVERS SIDE WINDOW WILL NOT GO UP, AND IT KEEPS GETTING A WARNING GOING ON THEN OFF THEN ON SAYS SOMETHING ABOUT BRAKE LAMP CONTROL MALFUNCTION. WHEN I GOT IT HOME I LEFT IN DRIVEWAY FOR A WHILE WHEN I TRIED TO START IT BACK UP I STARTED GETTING TRANSMISSION FAILURE WARNING AND SOMETHING ABOUT THE ENGINE. THEN LATER THE CAR DID START UP WITHOUT THE WARNINGS BUT STILL HAS THE ORIGINAL PROBLEMS.",
        "vin": "WBA3B5G5XFN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "04/12/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206167,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "ALL SEASON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SIDEWALLS ARE WEAK AND BLOW OUT. HAD 5 TIRES REPLACED; STILL HAVE ONE WITH BUBBLE IN SIDEWALK. BRIDGESTONE REP SAYS FROM HITTING POTHOLES.  I HAVE ANOTHER SET OF TIRES(MICHELIN) THAT I DRIVE ON THE SAME ROADS WITH NO ISSUES. BRIDGESTONE DRIVEGUARD",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/30/2017",
        "dateOfIncident": "12/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11057684,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-95 AT PACE WITH TRAFFIC, NO SPEEDING AND THE CAR IN FRONT OF ME ABRUPTLY HIT THE BREAKS. I WAS 3 TO 4 CAR LENGTHS AWAY.  I HIT THE BRAKES BUT WAS NOT CONCERNED BECAUSE I HAD PLENTY OF DISTANCE AND THE CAR IS EQUIPPED WITH ABS BRAKES. AS I HIT THE BRAKES, IT SEEMED LIKE THE CAR WAS NOT SLOWING DOWN EVEN AS I PRESSED HARDER AND THE ABS BRAKES NEVER KICKED IN. I WAS IN THE MIDDLE LANE AND WAS UNABLE TO SWERVE WITHOUT CAUSING A MAJOR ACCIDENT. MY ONLY OPTION WAS TO HIT THE CAR DIRECTLY IN FRONT OF ME. THE CAR I HIT SUSTAINED A SCRAPED REAR BUMPER NO OTHER DAMAGE.",
        "vin": "WBA3B5C56FF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "06/24/2016",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985420,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 BMW 328XI. WHILE THE VEHICLE WAS PARKED, IT CAUGHT ON FIRE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. A FIRE REPORT WAS NOT FILED. THE CONTACT WAS UNAWARE OF HOW THE FIRE STARTED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 17,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "10/23/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10926833,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK CLOSURE MECHANISM HAS A SENSOR THAT CAN BE ACTIVATED BY PASSING A FOOT UNDER THE BUMPER AREA WHILE TRUNK IS OPENED WHILE STATIONARY.  SENSOR CANNOT BE DEACTIVATED AND CAN BE ACCIDENTALLY ACTIVATED BY FOOT-ANIMAL CAUSING THE TRUNK TO CLOSE CAUSING INJURY TO PERSON IN AREA.    WIFE BEING TREATED BY A NEUROLOGIST FOR CONCUSSION, AND POTENTIAL NECK INJURIES.   DEALER IN EGG HARBOR NEW JERSEY STATES SENSOR CANNOT BE DEACTIVATED.    SYSTEM IS A SAFETY HAZARD.",
        "vin": "WBA3X5C50FD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888833,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE GONE THROUGH 3 WINDSHIELDS IN 2 MONTHS ,2 THROUGH MY INSURANCE AND THE 3RD THROUGH BMW ,EARLY MORNING AND LATE AFTERNOON THE WINDSHIELD IS COVERED WITH TINY SPARKLES, THIS WAS NOTICED BY ME THE NEXT DAY ON ALL 3 ,SO IT HAS NOTHING TO DO WITH ROAD DEBRI, ON LINE THERE ARE MANY PEOPLE COMPLAINING ABOUT THIS AND NO ONE KNOWS WHAT TO DO ,IT IS A SAFETY ISSUE WITH THE SUN HITTING IT.",
        "vin": "WBA3B5G57FN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/04/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872906,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN ROOF GLASS SHATTERED WHILE DRIVING ON SMOOTH HIGHWAY AT ABOUT 65MPH. NO EVIDENCE OF IMPACT (PER BMW DEALER) AND NO IMPACT BY OBJECT DETECTED BY DRIVER. NO OVER PASSES OR ROAD SIGNS WERE NEAR THE CAR AT THE TIME. OUTSIDE TEMPERATURE IN MID 80S AND SUNNY. AIR CONDITIONING ON IN CAR. LARGE HOLE IN MIDDLE OF SUNROOF AND MOST OF THE GLASS ENDED UP ON THE HIGHWAY BEHIND THE VEHICLE. SOME GLASS WAS IN THE SUNSHADE AND CAME THROUGH THE VENTILATION SLOTS.  BMW AGREED TO REPLACE UNDER WARRANTY.",
        "vin": "WBA3B3G53FN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/29/2015",
        "dateOfIncident": "10/04/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786956,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND THE SUNROOF ON MY CAR JUST EXPLODED. UNFORTUNATELY I DID NOT HAVE THE COVER CLOSED SO WHEN IT EXPLODED IT FELL AND HIT ME IN THE HEAD. IT FELL IN A LARGE CHUNK ONTO ME THEN SHATTERED. I WAS NOT GOING UNDER ANYTHING AND WAS DRIVING ON A STRAIGHTAWAY AT ABOUT 70MPH.",
        "vin": "WBA3G7C50FK"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "07/26/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747673,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST AS I WAS DRIVING OFF THE EXIT RAMP FROM THE INTERSTATE HIGHWAY, I LOST ALL POWER, INCLUDING STEERING WHEEL, BRAKES AND THROTTLE.  FORTUNATELY THE CAR SLOWED TO A STOP BEFORE IT ENTERED THE ROAD, ALTHOUGH THE SHERIFF'S DEPUTY WHO SOON SHOWED UP WAS CONCERNED THAT THE CAR WAS IN A DANGEROUS LOCATION. AFTER THE CAR STOPPED, I DISCOVERED THAT THERE WAS NO POWER TO ANY PART OF THE CAR, INCLUDING HAZARD LIGHTS, WINDOWS OR DOOR LOCKS, OR EVEN THE LATCH TO OPEN THE HOOD.  AFTER THE CAR WAS TOWED TO THE BMW DEALERSHIP, I WAS TOLD THAT THE PART THAT FAILED WAS CALLED THE FEM, FRONT ELECTRONIC MODULE.  I AM REPORTING THIS PROBLEM BECAUSE IT IS POTENTIALLY VERY DANGEROUS.  IF IT HAD HAPPENED WHILE STILL ON THE HIGHWAY, OR EVEN WORSE, AT NIGHT, IT COULD HAVE BEEN DISASTEROUS. I AM CONCERNED THAT THERE IS NO FAILSAFE FOR THE FAILURE OF A PART LIKE THIS, AND THAT BAD QUALITY CONTROL ON AN ELECTRONIC PART CAN SO EASILY CAUSE A SERIOUS ACCIDENT.",
        "vin": "WBA3B3C54FJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722107,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND EPISODE WITH THIS 2015 BMW 328XI AFTER THE BRAKES FAILED IN THE FIRST REPORTED EPISODE WITH SPORT MODE.  ON TUESDAY APRIL 21 IN THE AFTERNOON MY WIFE WAS DRIVING ON WINTERS AVE. IN PARAMUS NJ IN ECO MODE, HAVING DECIDED TO NEVER TOUCH THE DEFECTIVE SPORT MODE BUTTON AGAIN.  SHE WAS DRIVING NORMALLY, THEN OUT OF THE BLUE WHILE PRESSING ON THE GAS PEDAL, THE CAR SUDDENLY DOESN'T WANT TO GO AND CARS BEHIND STARTED BEEPING AND THEN THE CAR STARTS SWERVING AND LIGHTS UP THE ORANGE SYMBOL OF SWERVING ON DASHBOARD. SHE WENT INTO A PARKING LOT WHILE STILL SWERVING AND CALLED ME. SHE PARKED AND TRIED TO SHUT CAR OFF TO LET IT RESET. SHE RESTARTED IT AND IT CONTINUED TO HAVE THE SAME PROBLEM IN THE PARKING LOT. SO WE CALLED AAA WHO TOWED THE CAR HOME AND WE CALLED BMW DEALER. NEXT AM WEDNESDAY APRIL 22 BMW DEALER SENT TOW AND TOOK MY WIFE AND THE CAR TO THE DEALERSHIP GARAGE.  THE CAR HAS BEEN THERE FOR A MONTH AND IS STILL THERE.  THEY NEED TO CANCEL AND LET US OUT OF THE LEASE OF THIS VEHICLE AND REFUND OUR DOWN PAYMENT.  *TR",
        "vin": "WBA3B3C5XFJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2015",
        "dateOfIncident": "02/27/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722105,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, FEBRUARY 27TH, 2015, MY WIFE AND MY TWO DAUGHTERS, AGES 19 AND 21 WERE TRAVELING BACK UP THE GARDEN STATE PARKWAY.  THEY WERE DRIVING IN MY WIFES NEW 2015 BMW 328XI AND THE CAR WAS IN \"SPORTS MODE.\" MY WIFE WHO IS A VERY EXPERIENCED DRIVER, AND NEVER HAD ANY PROBLEMS, WAS DRIVING.  AT ABOUT 4:30 PM, AFTER EXITING THE PARKWAY THEY GOT TO A NEARBY INTERSECTION AND PLANNED ON TURNING LEFT TO GO TO THE LOCAL MARKET. HOWEVER, WHEN THEY APPROACHED THE INTERSECTION, MY WIFE WAS NOT ABLE TO STOP HER CAR. SHE PRESSED ON THE BREAKS BUT THEY WERE NOT RESPONDING PROPERLY AND THE CAR STARTED JERKING BACK AND FORTH AND SKIDDING TOWARDS THE CENTER OF THE INTERSECTION, WHERE OTHER CARS WERE DRIVING BY AT HIGH SPEEDS. MY WIFE CONTINUED TO PRESS AS HARD AS SHE CAN ON THE BREAK BUT THE CAR DID NOT COME TO A FULL STOP UNTIL IT WAS IN THE CENTER OF THE INTERSECTION. LUCKILY, NO CAR WAS COMING BY AT THE EXACT MOMENT OF THE INCIDENT, BUT IF THERE HAD BEEN ANOTHER CAR, THE BREAK FAILURE, IN THE CONTEXT OF THE DEFECTIVE SPORT MODE,  PROBABLY WOULD HAVE CAUSED AN ACCIDENT. THEY ALSO PULLED ON THE PARKING BRAKE, ATTEMPTED TO SWITCH TO PARK AND TO TURN THE ENGINE OFF IN ORDER TO STOP.  FINALLY, TOTALLY TRAUMATIZED AND STILL HAVING POST TRAUMATIC STRESS AND FEAR TO GET BACK BEHIND THE WHEEL, INSTEAD OF TURNING LEFT, MY WIFE AND DAUGHTERS DECIDED TO TURN RIGHT AND VERY VERY SLOWLY DRIVE HOME 2 BLOCKS AWAY, TOTALLY TRAUMATIZED BY WHAT HAD JUST HAPPENED.",
        "vin": "WBA3B3C5XFJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "04/13/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705648,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A LOANER DEALER CAR WITH AN AUTOMATIC TRANSMISSION.    I WAS EXITING A STATE HIGHWAY, TURNING RIGHT ONTO THE EXIT RAMP TO SLOW AT A TRAFFIC SIGNAL, AND APPLIED THE BRAKE PEDAL WITH MY RIGHT FOOT.  I SLOWED FROM 45 MPH TO ABOUT 10 MPH, WITH MY RIGHT FOOT ON THE BRAKE PEDAL.  THE ENGINE REVVED AND RACED UP TO ABOUT 6500 RPM AS I HELD MY RIGHT FOOT ON THE BRAKE PEDAL.  WITH MUCH BRAKING FORCE, I DID GET THE CAR TO SLOW AND STOP.  I THEN PRESSED THE PARK BUTTON AND HIT THE STOP BUTTON TO KILL THE ENGINE.  AFTER A FEW MOMENTS, I THEN RE-STARTED THE CAR AND PULLED OVER TO THE CURB.  I DID RETURN THE LOANER CAR TO THE DEALERSHIP.   TO BE ABSOLUTELY CLEAR, I HAVE BEEN DRIVING FOR 30+ YRS, AND I WAS NOT RACING, SPEEDING, DRUNK, NOR DRIVING WITH BOTH FEET.  SOMETHING MADE THE ENGINE RACE VERY HIGH, AND I WAS LUCKY NOT TO PLOW INTO THE CARS IN FRONT OF ME.  I HOPE THIS CAN BE INVESTIGATED AND RESOLVED SO NO ONE GETS HURT.  THANK YOU  *TR",
        "vin": "WBA3C3C56FP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/07/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654431,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "328XI",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A BRAND NEW VEHICLE LEASE BMW 2015 328XI , FOR MY WIFE - WE JUST PICKED IT UP ON 10/31/14, THE BRAKES FAILED TO RESPOND!!!!!!! MY WIFE WAS DRIVING WITH MY DAUGHTER AND THE CAR WOULD NOT STOP WITH HER FIRMLY PRESSING ON THE BRAKES APPROACHING A BUSY INTERSECTION!!!! SHE FINALLY GOT IT TO STOP AFTER SHIFTING IT INTO PARK.  EXTREMELY DANGEROUS!!! THEY SHOULD REPLACE THIS NEW VEHICLE FOR US IMMEDIATELY WITH ANOTHER  ONE OF EQUAL OR HIGHER VALUE  THAT WE CAN HOPEFULLY TRUST ASSEMBLED PROPERLY IN GERMANY.  THIS BMW DEALER NEVER TOLD US HE WAS GETTING US ONE FROM SOUTH AFRICA.  NOW, BMW OF CAN'T FIGURE OUT WHAT THE PROBLEM IS!!  THE VEHICLE MUST HAVE RELIABLE BRAKES. ALL THE DEALER HAS TO SAY SO FAR IS HE CAN'T FIND THE PROBLEM AND IS CALLING THE MAIN OFFICE TO HAVE SOMEONE TAKE A LOOK.  WE DON'T WANT TO BECOME A STATISTIC BECAUSE THEY ARE TOO INCOMPETENT TO FIND THE PROBLEM.  PLEASE RECALL IT AND PROTECT US SO WE CAN GET ANOTHER CAR!!!!   I EXPECT BMW AND THE NHTSA TO ADDRESS THIS URGENT VERY SERIOUS MATTER IMMEDIATELY.  THANK YOU.  IT WILL NOT BE ACCEPTABLE FOR THEM TO RETURN THIS DEATH TRAP VEHICLE TO US AFTER SOME GUY AT THE DEALERSHIP OR VISITING THE DEALER FROM THE MAIN OFFICE SAYS HE CAN'T FIND ANYTHING IN SUCH A HIGHLY COMPLEX VEHICLE.   IF THE ISSUE IS NOT COMPLETELY FOUND AND REMEDIED THE VEHICLE WILL HAVE TO BE REPLACED. WE ONLY HAD IT FOR A WEEK AND ONLY GOT TO DRIVE IT IN THE AREA A FEW TIMES UNTIL THIS.  IT'S BEEN BACK AT BMW DEALER SINCE SATURDAY 11/8/14.  THEY PICKED IT UP ON A FLATBED TRUCK.  THE NHTSA SHOULD RECALL IT FOR BRAKE FAILURE!!!!!!!!!!!  AFTER LOOKING UP BMW BRAKE FAILURE I NOW SEE REPORTS FROM YOU ON THE RECALL OF 2012-2014 BMW'S FOR BRAKE FAILURE!!!!!!  THE PROBLEM SEEMS TO BE CONTINUING IN 2015 AND THEY ARE NOT ADMITTING IT!!!! *TR",
        "vin": "WBA3B5G5XFN"
    }
]