[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459401,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV burns approximately 1qt oil per every 250-500 miles driven.  Oil is accumulating on engine, causing burn and acrid odor.  If I do not add a quart every ~2 weeks, engine will overheat.  Have replaced the PCV part twice to no avail.  Initially, mechanic recommended replacement of piston rings.  Audi must recognize problem as they are no longer selling rings; owner must have complete pistons replaced.  This is an expensive fix.  This complaint appears common across Audi Q5 owners of this model year.  Previous model years were recalled for same issues; clearly the issue was not addressed in later model year either.",
        "vin": "wa1lfafpxfa"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445425,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request?  Timing belt broke while traveling at 75 mph on the highway, and at 71,000 miles odometer     How was your safety or the safety of others put at risk? Car was shaking and acting crazy on the interstate     Has the problem been reproduced or confirmed by a dealer or independent service center? Issue was confirmed and Audi Quoted me $8000 to repair because of bent valve heads     Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? Inspected by Audi of Louisville      Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear?  No they came on AFTER the car started shaking violently on the interstate  I am still waiting on a second quote of getting this engine repaired from another certified repair center. I will attached what I paid for the diagnostics report. Per the manual on this car, you should CHANGE your timing belt at 100,000 K miles- Not have to replace your engine because it breaks prematurely at 70,000 miles. This is terrible for this quality of car and price!!  I am furious!!",
        "vin": "WA1LFAFPXFA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "05/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418513,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Was driving on state highway and all of a sudden the warning light came on that the steering wheel has malfunctioned. I could not rotate the steering wheel easily, but fortunately was able to pull over without any accident. This could have been a fatal failure had it happened on a highway or a slope.",
        "vin": "WA1LFAFPXFA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416344,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON CITY STREETS AND STEERING BECAME VERY DIFFICULT.  TURNING CORNERS AT SLOW SPEED WAS VERY TOUGH AND JERKY.  CONTROL OF THE CAR WAS VERY DIFFICULT THE SLOWER THE SPEED.  HIGHWAY WASN'T TOO BAD BUT YOU IT STILL TOOK MORE EFFORT THAN WAS NORMALLY EXPECTED/EXPERIENCED. FIRESTONE SERVICE NOTED A OPENING IN THE UPPER STEERING SHAFT.  THEY SPRAY LUBRICATED THE SHAFT AND IT APPEARS TO BE BACK TO NORMAL, BUT SINCE THERE THE SHAFT IS OPEN TO WEATHERING THIS IS NOT A PERMANENT FIX.",
        "vin": "WA1CFAFP6FA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414711,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A MONTH AGO AFTER A DRIVE WHERE THE ENGINE GOT UP TO OPERATING TEMPERATURE I RECEIVED A WARNING ON THE DASHBOARD SAYING SHUTOFF ENGINE AND CHECK COOLANT LEVEL IT IS LOW. THIS PROBLEM CONTINUES TO HAPPEN, SPONTANEOUSLY, WHILE I'M DRIVING. ALSO, THE PROBLEM CONTINUES TO OCCUR DESPITE COOLANT LEVELS BEING WITHIN NORMAL PARAMETERS.",
        "vin": "WA1LFAFP7FA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394437,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE, A WARNING MESSAGE REGARDING THE POWER STEERING WAS DISPLAYED THAT ALSO INSTRUCTED NOT TO DRIVE THE VEHICLE. THE STEERING WHEEL WAS VERY DIFFICULT TO TURN IN EITHER DIRECTION. DURING THE FAILURE, THE OUTSIDE TEMPERATURE WAS VERY COLD. THE VEHICLE WAS TOWED TO THE LOCAL DEALER AUDI OF BOISE LOCATED AT 8400 W. FRANKLIN RD #1, BOISE, ID 83709 WHO DIAGNOSED THAT THE STEERING RACK WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "WA1CFAFP3FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378172,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CONSUMPTION - CHECK ENGINE ADD OIL LIGHTS COME ON EVERY 200 TO 300 MILES ADD A QUART OF OIL THEN AGAIN AFTER 200+ MILES ADD ANOTHER QUART. AUDI WILL NOT ACKNOWLEDGE THERE IS A PROBLEM AND RECALL. I HAVE 108K MILES 90% HIGHWAY.  5 YEAR 80K WARRANTY IT STARTED AFTER 80K MILES. I HAVE SPENT $3K THE PAST SIX MONTHS WITHOUT REPLACING THE ENGINE.",
        "vin": "WA1LFAFP1FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363664,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ADD OIL LIGHT ON MY VEHICLE STARTED TO COME ON AS I WAS DRIVING. INITIALLY IT WAS REQUIRING OIL ADDED IN BETWEEN SERVICE APPOINTMENTS. I MENTIONED IT AT TIME OF SERVICE AND I WAS TOLD THIS WAS NORMAL AT THE DEALERSHIP WHERE I HAD ALL OF THE SERVICE ON THIS VEHICLE DONE. WHEN IT STARTED READING LOW OIL AT JUST UNDER EVERY 1000 MILES I CONTACTED DEALER AGAIN WHO HAD ME BRING IT IN AND THEY PERFORMED A SCOPE OF THE SYSTEM. I WAS TOLD THAT IT WAS NOT USING TOO MUCH OIL AND ACCORDING TO AUDI IT WAS WITHIN NORMAL USAGE OF OIL. I WAS VERY SKEPTICAL AND BROUGHT IT TO A DIFFERENT AUDI DEALERSHIP FOR THE NEXT SCHEDULED SERVICE. THEY TOLD ME THERE WAS TOO MUCH OIL IN THE EXHAUST AND IT WAS INDEED USING TOO MUCH. AT HIS POINT I AM NEEDING TO ADD A QUART OF OIL AT JUST UNDER EVERY 500 MILES. I DID GET A THIRD OPINION FROM A FOREIGN MOTOR SPECIALIST WHO WORKS ON AUDI'S BUT IS NOT AFFILIATED. HE TOLD ME THE CAR IS USING WAY TOO MUCH OIL AND THAT THE AUDI Q5 VEHICLES ARE KNOWN FOR THIS. I HAVE HAD ALL RECOMMENDED SERVICE COMPLETED AT AN  AUDI DEALER, MOST WAS DONE WHERE THE VEHICLE WAS PURCHASED. I HAVE ONLY USED PREMIUM GASOLINE, WHICH IS WHAT AUDI RECOMMENDS. I AM VERY FRUSTRATED WITH THE CONFLICTING REPORTS AND BELIEVE THIS IS A KNOWN PROBLEM THAT AUDI CONTINUES TO IGNORE. THIS IS AN ONGOING INCIDENT WHICH FIRST HAPPENED AT ABOUT 60,000 MILES. THE DATE BELOW REFLECTS THE LAST TIME THE ADD OIL LIGHT CAME ON.",
        "vin": "WA1LFAFP9FA"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353935,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 AUDI Q5 HAS 36,000 MILES ON IT, IS GARAGE KEPT AND TAKEN WELL CARE OF. IT JUST NOW HAD BOTH REAR BEARINGS GO OUT AT THE SAME TIME. IT MADE A HORRIBLE NOISE WHILE ON SMOOTH HIGHWAY, AND I HAD IT TOWED TO A MECHANIC WHO DEEMED IT UNSAFE TO DRIVE. THERE IS A RECALL ON THE FRONT BEARINGS BUT AUDI REFUSES TO TAKE RESPONSIBILITY FOR THE ISSUE. UNSAFE AND COULD KILL PEOPLE.",
        "vin": "WA1LFAFP6FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342409,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN DEALING WITH AN OIL CONSUMPTION ISSUE ON MY 2015 AUDI Q5 FOR A GOOD PART OF THIS YEAR.  I SERVICE MY VEHICLE REGULARLY AND OIL CONSUMPTION HAD NEVER BEEN AN ISSUE UNTIL THE ENGINE LIGHT CAME ON IN MARCH.  I LIVE IN FL DURING THE WINTER MONTHS SO I TOOK THE VEHICLE TO AUDI OF MELBOURNE ON MARCH 12, 2020, ODOMETER READING 75,755.  AT THAT TIME, THEY COMPLETED PART 1 OF AN OIL CONSUMPTION TEST AND INFORMED ME TO RETURN THE VEHICLE IF THE ENGINE LIGHT CAME ON OR I DROVE 1,000 MILES.  BECAUSE OF THE CORONAVIRUS, I RETURNED TO KY AND THE SECOND PART OF THE TEST WAS COMPLETED BY AUDI OF LEXINGTON ON MARCH 31, 2020, ODOMETER READING 76,920. I WAS INFORMED THAT THE VEHICLE PASSED THE OIL CONSUMPTION TEST (NO REPORT PROVIDED) BASED ON THE PARAMETERS ESTABLISHED BY AUDI USA.      I CONTINUED TO MONITOR THE OIL LEVEL, ADDING WHEN NEARING THE MINIMUM LEVEL.  REALIZING THAT OIL CONSUMPTION WAS WORSENING, I CONTACTED AUDI OF LEXINGTON AND SCHEDULED A SECOND OIL CONSUMPTION TEST.  PART 1 OF THAT TEST OCCURRED ON JUNE 23, 2020, ODOMETER READING 77,793.  I WAS TOLD TO DRIVE THE VEHICLE UNTIL THE ENGINE LIGHT CAME ON OR I HAD DRIVEN 700 MILES.  AUDI OF LEXINGTON COMPLETED PART 2 OF THE TEST ON JULY 21, 2020, ODOMETER READING 78,534, AND AGAIN THE VEHICLE PASSED WITHIN AUDI USA PARAMETERS.  I BELIEVE THE OIL CONSUMPTION WAS .49 QUARTS.    I PURCHASED THE CERTIFIED PRE-OWNED VEHICLE FROM AUDI OF LEXINGTON ON APRIL 18, 2015.  THE CPO WARRANTY IS SET TO EXPIRE ON AUGUST 23, 2020 AND I FEAR THE ENGINE WILL FAIL SOMETIME BEFORE OR AFTER THAT DATE.   I KNOW THERE IS A SERIOUS OIL BURN ISSUE THAT I HAD NEVER EXPERIENCED ON ANY OTHER VEHICLE OWNED DURING MY LIFETIME AND WHILE ACCEPTABLE TO AUDI USA, IT IS NOT ACCEPTABLE TO ME.  WHILE THE OWNER'S MANUAL MENTIONS MINOR OIL CONSUMPTION,  QUART PER 600 MILES, I WAS NOT DISCLOSED THAT ISSUE PRIOR TO PURCHASING THE VEHICLE.",
        "vin": "WA1CFAFP2FA"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342210,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 AUDI Q5. CONSUMER WRITES IN REGARDS TO DEFECTIVE STEERING GEAR. *LD    THE CONSUMER STATED THE STEERING GEAR BECAME DISLODGED. *JS *JS",
        "vin": "WA1DGAFP3FA"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340378,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT STATED THAT THERE WAS AN ABNORMALLY LOUD SOUND COMING FROM THE VEHICLE WHILE DRIVING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE DRIVER AND PASSENGER SIDE WHEEL BEARINGS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000.",
        "vin": "WA1DGAFP4FA"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330142,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE RANDOMLY DISENGAGES THE CRUISE CONTROL FOR NO APPARENT REASON, I.E. DRY CLEAR ROAD CONDITION, NO FAULT LIGHT OR ISSUES WITH ABS/TRACTION CONTROL, NO FAULT CODES, ETC.  *TR",
        "vin": "WA1CMAFPXFA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311900,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT STATED THAT THE CHECK ENGINE LIGHT ILLUMINATED AND THE VEHICLE WAS TAKEN TO AUDI SOUTH BURLINGTON (1325 SHELBURNE RD, SOUTH BURLINGTON, VT 05403). THE CONTACT WAS INFORMED THAT PARTS WERE NOT AVAILABLE TO REPAIR THE VEHICLE UNDER NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING). THE CHECK ENGINE WARNING LIGHT WAS CLEARED BY THE DEALER. A MONTH LATER, THE CHECK ENGINE WARNING LIGHT REAPPEARED AND THE VEHICLE WAS TAKEN TO CLASSIC AUDI SERVICE CENTER (655 N MACQUESTEN PKWY, MT VERNON, NY 10552). THE WARNING LIGHT WAS NO LONGER DISPLAYED WHEN THE VEHICLE REACHED THE DEALER. THE VEHICLE WAS NOT REPAIRED. WHILE DRIVING AT 45 MPH, THE CONTACT'S SON WAS PULLED OVER AND HEARD AN ABNORMAL NOISE COMING FROM THE ENGINE. THE VEHICLE WAS TURNED OFF AND RESTARTED BUT STALLED WITHOUT WARNING. THE VEHICLE WAS DRIVEN TO A GAS STATION AND THEN TOWED TO AUDI RUTLAND (176 US-7, RUTLAND, VT 05701) TO BE DIAGNOSED. THE VEHICLE WAS DIAGNOSED WITH ENGINE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 62,000. *JS",
        "vin": "WA1LFAFP3FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311528,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION ON A DARK COUNTRY ROAD IN VT, MY 2015 AUDI Q5 CAR WITH JUST 61,000 MILES ON IT STARTED TO MAKE A LOUD NOISE AND BECAME UNDRIVABLE. THE DRIVER SAT ON THE ROAD AND WAITED FOR ROADSIDE ASSISTANCE AND A TOW TRUCK TO TAKE THE CAR TO THE NEAREST AUDI DEALER, WHICH WAS 40 MILES AWAY. SEVERAL DAYS LATER, AUDI DRAINED THE OIL IN THE ENGINE AND FOUND METAL SHAVINGS. NO ENGINE LIGHT WENT ON AT THE TIME OF BREAKDOWN, BUT IT HAD GONE ON TWO TIMES BEFORE THE EVENT AS DID THE COOLANT LIGHT. WHEN THIS HAPPENED, WE TOOK THE CAR TO AUDI, WHERE THEY WIPED THE DASHBOARD CODE AND SENT US ON OUR WAY.  AFTER LEARNING OF THE FATAL ENGINE FAILURE, I REACHED OUT TO AUDI TO REQUEST THEY STANDBY THEIR ENGINE EVEN THOUGH THE CAR WAS OUT OF WARRANTY. AUDI RESPONDED WITH THE FOLLOWING:  AUDI CLAIMS TO HAVE A POLICY THAT REQUIRES ITS OWNERS ONLY VISIT SERVICE AT THE AUDI SERVICE CENTER; I HAVE YET TO SEE THIS IN WRITING. AUDI ALSO MAINTAINS THE MANN OIL FILTER IS NOT COMPATIBLE WITH THEIR CARS, YET IT IS WHAT THEY USE IN THEIR SERVICE CENTERS. AUDI HAS USED THESE FACTORS TO DENY A CLAIM REQUESTING THAT THEY OFFSET THE COST OF A NEW ENGINE. ENGINES DO NOT DIE AT 61,000 MILES. HAD MY SON BEEN ON A HIGHWAY DRIVING AT A FASTER SPEED, HE COULD HAVE BEEN KILLED, BUT YET STILL, AUDI EXECUTIVES CONTINUE TO CHOOSE TO IGNORE THE ISSUES THAT PLAGUE THE AUDI Q5.",
        "vin": "WA1LFAFP3FA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270178,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PRESSURE FUEL PUMP HAS BEEN LEAKING GASOLINE INTO MY ENGINE OIL. IT HAS CAUSED ISSUES WHEN STARTING MY CAR. THIS HAS BEEN GOING ON FOR A WHILE .",
        "vin": "WA1LFAFP1FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270179,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PCV VALVE NEEDED TO BE REPLACED BECAUSE IT WAS CAUSING EXTREMELY HIGH PRESSURE WITHIN MY OIL TANK.",
        "vin": "WA1LFAFP1FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242208,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. AFTERTHE VEHICLE UNDERWENT AN OIL CHANGE, THE OIL CHANGE WARNING INDICATOR ILLUMINATED. THE CONTACT MENTIONED THAT THE OIL NEEDED TO BE REFILLED EVERY 1,000 MILES. THE VEHICLE WAS TAKEN TO FATHERS & SONS AUDI WEST SPRINGFIELD (434 MEMORIAL AVE, WEST SPRINGFIELD, MA 01089, (413) 384-5229) WHERE THE OIL CONSUMPTION TEST SHOWED HOW MUCH OIL WAS BURNED AND THAT THE PISTONS WERE DAMAGED. THE DEALER STATED THAT THE PISTON AND SOLENOID NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 89,456.",
        "vin": "WA1CFAFP5FA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220786,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OPENING THE TRUNK AND FINDING OUT THE BATTERY COMPARTMENT  FILLED UP WITH WATER 12 TO 14 INCHES HIGH  WITH THE BATTERY SUBMERSED COMPLETELY PLUS THE ELECTRIC COMPONENTS ATTACHED TO THE RIGHT AND LEFT SIDE OF THE TRUNK AND FURTHER THE WHOLE TRUNK CARPETS ARE ALL WET AND FILLED WITH NASTY --DUE-GOT SO CONFUSED ON THE EMINANT DANGER AND SAFETY OF THE VEHICLE IN QUESTION--DECIDE D TO ADVISE --AUDI--TO TAKE URGENT ATTENTION TO DETECT SUCH ALARMING WATER  LEAKAGES BY CALLING OUR DEALER IN --LYNBROOK, NEW YORK TO REPLACE ALL NESCESSARY   DAMAGED ITEMS/ELECTRICAL COMPONENTS TO ORIGINAL MANUFACTURER SETTING.  HAVE TAKEN PHOTOGRAPS OF THE STAGNENT WATER SITTING INTO THE BATTERY COMPARTMENT AND ELSEWHERE.DESTROYED CARPET IN AND AROUND THE DIFFERENT TRUNK AREAS AND FINALLY THE NUTS AND BOLTS THAT GOT CORRUTED--IN MANY PLACES.  SETTING SOON",
        "vin": "WA1LFAFP3FA"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220182,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN AUDI TDI THAT THE DIESEL EMISSIONS RECALL WAS COMPLETED. I BROUGHT TO THE ATTENTION OF MY SERVICE ADVISOR - DEALER, THAT WHEN THE OUTSIDE AIR TEMP IS WARM/HOT AND THE VEHICLE IS WARMED UP, THERE APPEARS LAG IN THE ACCELERATION THEN SUDDENLY THERE IS A QUICK BURST OF SPEED WHERE THE VEHICLE CATCHES UP TO THE FOOT ACCELERATOR POSITION. LIFTING THE FOOT OFF THE ACCELERATOR AIDS IN SLOWING DOWN BUT I AM CONCERNED THAT IF ANOTHER FAMILY MEMBER GETS IN THE CAR THERE MIGHT BE A DIFFERENT UNDERSTANDING OF WHAT THE VEHICLE IS DOING. THE DEALER SERVICE ADVISOR DID NOT NOTE THIS CONDITION ON THE LIST OF COMPLAINTS - THINGS TO FIX AT LAST SERVICE. HE DID STATE THAT ALL THE VW-PORSHE-AUDI DIESEL VEHICLES ARE DEALING WITH SIMILAR ISSUES AND THAT I JUST NEEDED TO ADJUST MY DRIVING, THERE IS NO CURRENT RESOLUTION FOR THE CONDITION. I FEEL THAT THERE SHOULD BE A BETTER ANSWER FROM VW-PORSHE-AUDI TO RESOLVE THIS CONCERN WITH THE HIGHLY SKILLED ENGINEERS THEY EMPLOY!",
        "vin": "WA1CMAFP4FA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "09/08/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196226,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V298000 (FUEL SYSTEM GASOLINE). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AUDI OF COLORADO SPRINGS (550 AUTOMOTIVE DR, COLORADO SPRINGS, CO 80905, (719) 722-3005) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WA1LFAFP1FA"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194776,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING DONE THE EPA & CARB APPROVED EMISSIONS MODIFICATIONS 2014-2016 3.0L TDI (GENERATION 2 PC) EMISSION RECAL 23V4,  THE CAR DEVELOPED A LURCH OR HESITATION BETWEEN 30 AND 40 MPH.  THE SERVICE ADVISOR AT THE DEALER SAID THERE'S NOTHING CAN BE DONE.  THIS IS A SAFETY CONCERN BECAUSE I'M AFRAID THE CAR WILL EVENTUALLY STOP IN THE MIDDLE OF THE ROAD, LOSE CONTROL OR CAUSE A CRASH.",
        "vin": "WA1CMAFP9FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190263,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DEALER PERFORMED RECALL THE FOLLOWING:  80C5   2017-10-25   A-RECALL - AUXILIARY HEATER    SINCE THEN AUDI HAS NOT PROVIDED THE NEW PART. IT HAS BEEN 6 MONTHS. I WAS TOLD THE REPLACEMENT OIL COOLANT PUMP WAS EXPECTED BY THE END OF 2018.",
        "vin": "NUMBERWA1LF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184036,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY CAR EARLY IN THE MORNING TO CHURCH AND, ON THE WAY HOME, STOPPED AT A SUPERMARKET.  IT WAS VERY COLD, MINUS 15 DEGREES AT THE TIME IN BOZEMAN, MONTANA. WHEN I CAME BACK TO THE CAR TO START TO GO HOME, THERE WAS A VERY LOUD ALARM AND A WARNING - STEERING DEFECTIVE - UNSAFE TO DRIVE.  I TURNED THE CAR OFF AND TRIED TO RESTART IT AND THE SAME LOUD ALARM AND WARNING OCCURRED.  I WAITED 5 MINUTES AND TRIED AGAIN AND GOT THE SAME RESULT.  I GOT THE CAR TOWED TO MY NEARBY AUDI DEALER TO BE FIXED.  THEN I DID SOME RESEARCH AND SAW THAT THIS STEERING ISSUE IS A REAL PROBLEM WITH AUDI Q5 AND SQ5, BUT ONLY THE SQ5 HAS HAD A RECALL.    APPARENTLY THERE IS A LOT OF CONTROVERSY ABOUT THIS PROBLEM, SOMETIMES REQUIRING A STEERING RACK REPLACEMENT AND OTHER TIMES SOFTWARE.  IN ANY EVENT, AUDI KNOWS ABUT THIS DANGEROUS PROBLEM.  WHAT IF I WAS ON THE HIGHWAY WITH MY BABY GRANDSON IN THE CAR?  I DISCOVERED A LOT OF VERY NEGATIVE INFO ON THE AUDI WORLD FORUMS DATING BACK AS FAR AS EARLY 2016 CONCERNING THE 2015 SQ5.  SAME SEEMS TO BE THE PROBLEM WITH THE Q5.    APPARENTLY ON TRANSPORT CANADA'S WEBSITE THE SQ5 STEERING HAS BEEN RECALLED, BUT NOT THE Q5.  IN LIGHT OF THE EMISSIONS SCANDAL IN WHICH THE CAR COMPANY (VOLKSWAGEN) DELIBERATELY DECEIVED ON EMISSIONS, I AM THINKING THAT THEY ARE A RATHER UNTRUSTWORTHY COMPANY FROM WHICH TO BUY A CAR.  I WILL GET RID OF MINE FOR SAFETY'S SAKE AS SOON AS I CAN!  THE CAR IS STILL AT THE DEALER FOR REPAIR, AND I HAVE NOT HEARD FROM THEM SINCE EARLY THIS MORNING.  I TRIED TO REACH THE SERVICE AREA FOR AN UPDATE, BUT AS YET HAVE NOT HEARD BACK.  I HAVE 4 MONTHS LEFT ON MY WARRANTY. AND THE CAR HAS LESS THAN 12,000 MILES ON THE ODOMETER. THIS IS SCARY.",
        "vin": "WA1LFAFP9FA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184171,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UPDATE ON NHTSA TRACKING NUMBER 11184036  I RECEIVED A CALL FROM THE AUDI SERVICE AREA WHERE MY CAR WAS TOWED YESTERDAY FOR A FIX TO THE STEERING PROBLEM (ALARM TELLING ME NOT TO DRIVE DUE TO UNSAFE STEERING AND A LOCKED STEERING WHEEL) AUDI REFUSES TO REPLACE ANY STEERING RELATED PARTS UNLESS THE PROBLEM HAPPENS A SECOND TIME.  SINCE THIS SEEMS TO BE A VERY COLD WEATHER PROBLEM, I WILL HAVE TO WAIT UNTIL NEXT WINTER SINCE THE EXTREME COLD IS PROBABLY OVER FOR THIS YEAR AS WE ENTER SPRING.  JUST HOPE IT DOESN'T HAPPEN WHILE DRIVING ON A HIGHWAY.",
        "vin": "WA1LFAFP9FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "12/06/2018",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174695,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. ON SEVERAL OCCASIONS, WHILE DRIVING, THERE WAS AN ABNORMAL BURNING ODOR COMING FROM THE FRONT OF THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. CROWN AUDI OF CLEARWATER (18940 US-19, CLEARWATER, FL 33764, (888) 727-0742) WAS CONTACTED AND INFORMED OF THE FAILURE. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 39,999.",
        "vin": "WA1LFAFP2FA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174518,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS AN UNUSUALLY COLD DAY (-14 DEGREES) IN MICHIGAN.  I HAD BEEN DRIVING THE CAR EARLIER THAT DAY WITHOUT INCIDENT.  I PARKED THE CAR IN THE GARAGE AND APPROXIMATELY 1 HOUR LATER I WENT TO USE IT AND I WAS PRESENTED WITH LOUD WARNING BEEPS AND THE FOLLOWING MESSAGE: \"STEERING DEFECTIVE! DO NOT DRIVE VEHICLE!\" IT WAS OBVIOUS THAT THE (ELECTRIC) POWER ASSIST WAS NOT FUNCTIONING.  I TRIED EVERY HOUR AND AFTER ABOUT 4 HOURS THE ERROR WAS GONE AND THE POWER STEERING SEEMED TO BE WORKING CORRECTLY.  IT HAS BEEN FINE SINCE.  I CALLED THE DEALER ABOUT THE ISSUE BUT DID NOT BRING IT TO THEM FOR A \"DIAGNOSIS\".    I NOTICED A RECALL (15V-452) FOR THE 2015 SQ5 FOR THIS EXACT PROBLEM AND WONDERED WHY AN SQ5 WOULD BE DIFFERENT FROM MY 2015 Q5 (WITH A 3.0L V6 ENGINE).  THERE ARE QUITE A FEW PEOPLE ON THE INTERNET COMPLAINING ABOUT THE SAME ISSUE DURING VERY COLD DAYS AND I'M TRYING TO UNDERSTAND THE ROOT CAUSE. THE RECALL IS NOTHING MORE THAN A SOFTWARE UPDATE. (MAYBE TO EXPAND THE ACCEPTABLE THRESHOLD VALUES?)   I AM CONCERNED THAT THE RECALL WAS NOT SCOPED PROPERLY AND IS ACTUALLY AFFECTING OTHER AUDIS.  I AM A FORMER VW/AUDI MECHANIC WITH OVER 30 YEARS OF MECHANICAL EXPERIENCE.",
        "vin": "WA1WGAFP7FA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "12/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157325,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY FRONT PANEL SUNROOF EXPLODED. THERE IS NO OTHER WAY TO DESCRIBE WHAT HAPPENED. THERE WAS A LOUD POP. LOUD ENOUGH TO MAKE MY EARS RING AND THEN THE GLASS WAS EVERYWHERE. I NOTICED A RECALL FOR THIS EXACT ISSUE ON THE 2012 AUDI Q5. I AM DRIVING A 2015 AUDI Q5. THERE IS NO RECALL LISTED SPECIFICALLY FOR THIS ISSUE ON THE 2015 MODEL. A SEPARATE SUNROOF RECALL FOR DRAINAGE IS LISTED, BUT NOT ONE FOR SHATTERING SUNROOFS. MY LOCAL AUDI DEALERSHIP DIDN'T SEEM TO CONCERNED WHEN I SPOKE WITH THEM...",
        "vin": "WA1LFAFPXFA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "05/18/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157158,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STILL WAITING FOR MANUFACTURE'S RECALL FOR AUXILIARY WATER PUMP THAT WAS IDENTIFIED  7 MONTHS AGO.",
        "vin": "WA1LFAFP6FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145350,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AUDI RICHMOND (12592 BROADSTREET RD, RICHMOND, VA 23233, (804) 273-8700) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1LFAFP0FA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "08/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124576,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING DEFECTIVE. DO NOT DRIVE VEHICLE. THIS MESSAGE CAME UP AS SOON AS I STARTED THE CAR FROM A PARKING LOT. TOWED IT TO AUDI DEALER. THEY FOUND THAT ITS AN AUDI ISSUE. DEFECTIVE STEERING RACK. REPLACED IT. $2500",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122065,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS VERY UNSAFE TO DRIVE AT NIGHT.  THE LOW BEAM HEADLIGHTS ONLY PROJECT AND ILLUMINATE A VERY SHORT DISTANCE IN FRONT OF THE VEHICLE.  IT WOULD BE NEARLY IMPOSSIBLE TO AVOID A PEDESTRIAN, ANIMAL, OR DEBRIS IN THE ROADWAY BECAUSE OF THIS SHORTCOMING.",
        "vin": "WA1CFAFP2FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122084,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THELEN AUDI VOLKSWAGEN MAZDA (1112 NORTH EUCLID AVENUE, BAY CITY, MICHIGAN 48706, (989) 684-2980) WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LFAFP8FA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121672,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART WAS NOT AVAILABLE TO SCHEDULE THE RECALL REPAIR APPOINTMENT WITHIN A REASONABLE TIME FRAME. THE MANUFACTURER SENT THE INTERIM NOTICE MONTHS AGO, BUT HAD NOT SENT THE SECOND NOTICE, VERIFYING THAT THE PARTS WERE AVAILABLE. THE MANUFACTURER INFORMED THE CONTACT NOT TO PARK THE VEHICLE IN THE GARAGE WHILE WAITING FOR THE REPAIR PART. THE MANUFACTURER DID NOT HAVE A TIMEFRAME FOR WHEN THE PART WOULD BE SUPPLIED TO THE DEALER (AUDI OF SMITHTOWN, 578 MIDDLE COUNTRY RD, ST JAMES, NY 11780, (631) 979-6400). THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LFAFP8FA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118132,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AN UNKNOWN DEALER WAS MADE AWARE OF THE RECALL AND STATED THAT THE PART WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LFAFP0FA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105071,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PEACOCK AUTO MALL (5001 US-278 A, HARDEEVILLE, SC) WAS CONTACTED AND CONFIRMED THAT THE PARTS WOULD NOT BE AVAILABLE FOR THE RECALL REMEDY UNTIL FALL OF 2018. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND PROVIDED AN ESTIMATED DATE OF LATE 2018. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LFAFP6FA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101823,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 18V229000 (ENGINE AND ENGINE COOLING) AND 17V622000 (ELECTRICAL SYSTEM). THE CONTACT CALLED KANSAS CITY AUDI AT 816-941-9500 (LOCATED AT 10330 MADISON AVE, KANSAS CITY, MO 64114) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE FOR NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING) AND PARTS DISTRIBUTION DISCONNECT FOR NHTSA CAMPAIGN NUMBER: 17V622000 (ELECTRICAL SYSTEM).",
        "vin": "WA1LFAFP4FA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101733,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED RECALL NOTICE, NHTSA # 18V229 FOR MY VEHICLE.  REGARDING A COOLANT PUMP THAT COULD POSSIBLY EXPERIENCE A SHORT CIRCUIT AND OVERHEAT.  IT WAS RECOMMENDED THAT THE VEHICLE BE PARKED OUTSIDE AS A PRECAUTIONIN CASE THERE WERE TO BE A FIRE BECAUSE OF THIS PROBLEM.  THERE IS NOT YET ANY PARTS AVAILABLE TO FIX THIS.  I AM VERY CONCERNED ABOUT DRIVING AROUND WITH THIS POTENTIAL PROBLEM.  AND EVEN IF I PARK MY CAR OUTSIDE OF MY HOUSE, I LIVE IN THE WOODS SO A CAR FIRE WOULD LIKELY CAUSE A LOT OF DAMAGE ANYWAY.  I FIND THIS TO BE UNACCEPTABLE AND I WOULD LIKE TO KNOW IF SOMETHING ELSE CAN BE REPLACED INSTEAD TO REMEDY THE PROBLEM, OR WHEN THE PARTS WILL BE AVAILABLE.",
        "vin": "WA1LFAFP5FA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097223,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 18V229000 (ENGINE AND ENGINE COOLING) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE DEALER (AUDI TYSONS CORNER, 8598 LEESBURG PIKE, VIENNA, VA 22182) WAS CONTACTED AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER HAD NOT BEEN CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1LFAFP7FA"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/24/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056281,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IM SEEING A LOT OF RECALLS ON 2015 AUDI Q5 AND IM AFRAID OF GOING OUT WITH THE CAR. I SPOKE WITH AUDI GUYS AND EXPLAINED ABOUT THE SITUATION BUT THEY ARE TALKING RUDE.  WHAT EVER THE RECALL THEY MENTIONED AND THEY MENTIONED IN THE DOCUMENT SAYING THAT THE CAR CAN RESULT TO FIRE AND THIS IS DANGEROUS TO THE CUSTOMERS.",
        "vin": "WA1CFAFP3FA"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052413,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SMELLS WHEN TURNING THE HEATER ON. CAR STILL DOES NOT HAVE A FIX FOR THE EMISSION. EVEN IF THE EMISSION IS FIXED I STILL NEED TO INCREASE GAS/AD-BLUE.",
        "vin": "WA1CMAFP5FA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2017",
        "dateOfIncident": "09/23/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025203,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I DO NOT HAVE ANY PROBLEM WITH MY CAR. BUT I HAVE ANOTHER IMPORTANT THING TO REMIND WHO IS RESPONSIBLE FOR INFORMING ANY RECALLS.  MY CAR HAD FEW RECALLS PREVIOUSLY AND EACH TIME I GOT A NOTIFICATION.   BUT FOR THE LATEST OPEN RECALL THAT MY CAR HAS, NO ONE INFORMED ME. THE RECALLING HAS BEGAN SINCE MAY 2017 AND NO ONE INFORMED THIS RECALL FOR NEARLY 4 MONTHS UNTIL I CALLED THE DEALERSHIP 2 WEEKS AGO FOR SCHEDULING MY SERVICE DATE. AND THE DEALERSHIP REPRESENTATIVE TOLD ME THAT IMY CAR HAS A RECALL. AND THIS RECALL IS MORE RISKY AND DANGEROUS AND WHAT IF SOMETHING HAPPENED. AND WHO WILL TAKE THE RESPONSIBILTY OF LOOSING MY AND MY FAMILY'S LIVES?   AND EVEN THIS IS SOMETHING IMPORTANT RECALL THEY SCHEDULED ME FOR OCTOBER 6TH FOR TAKING CARE OF THE RECALL AND SERVICE.  THIS IS SO DISSAPOINTED AND WHY NOBODY INFORM THESE RECALLS. WHO WILL TAKE THE RESPONSIBILITY. I CALLED AUDI AND THEY SAID THEY ARE NOT SENDING ANY REMINDERS BUT NHTSA SEND NOTICES. PLEASE I NEED A CONSIDERABLE REPLY FOR THIS AND PLEASE NEVER LET THIS HAPPEN AGAIN.",
        "vin": "WA1LFAFP3FA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "08/19/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018887,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT ANY WARNING, AFTER DRIVING BRAND NEW CAR FOR ONLY 15000 MILES, THE BRAKES HAD A CATASTROPHIC FAILURE (RIGHT REAR WHEEL). LUCKILY I WAS IN A SERVICE ROAD OTHERWISE THIS WOULD HAVE BEEN CATASTROPHIC.  I GOT THE CAR SERVICED 2 MONTHS AGO AND EVERYTHING WAS FINE (JUST SOME RUSTING ON THE BRAKES) SO THE AUDI AUTHORIZED DEALERSHIP LET ME DRIVE SAYING WE SHOULD LOOK AT IT NEXT YEAR.   THE CAR IS RIGHT NOW AT THAT SAME DEALERSHIP AND I ALSO WORRY THEY WOULD TAMPER WITH IT OR HAVE SOME OTHER ISSUE IN IT.",
        "vin": "WA1LFAFP8FA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "07/12/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004865,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V298000 (FUEL SYSTEM, GASOLINE) AND TOOK THE VEHICLE TO THE DEALER (JACK DANIELS AUDI OF UPPER SADDLE RIVER LOCATED AT 243 ROUTE 17 SOUTH, UPPER SADDLE RIVER, NJ 07458) FOR THE RECALL REMEDY. THE CONTACT STATED THAT THE FUEL FILTER FLANGE WAS INSPECTED BY THE TECHNICIAN WHO FOUND NO CRACKS, BUT APPLIED PROTECTIVE FILM. THE CONTACT WAS CONCERNED THAT THE FILM WOULD NOT BE DURABLE OR A PERMANENT REPAIR. THE CONTACT REQUESTED THAT THE TECHNICIAN REPLACE THE FUEL FILTER FLANGE AT HER EXPENSE; HOWEVER, THE MANUFACTURER WOULD NOT RELEASE THE NECESSARY FUEL FILTER. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND FAILED TO PROVIDE ANY TECHNICAL INFORMATION TO THE DURABILITY OF THE PROTECTIVE FILM. THE CALL WAS THEN ESCALATED TO A TEAM LEADER WHO WAS UNABLE TO ANSWER IF ADDITIONAL MAINTENANCE OR INSPECTION WAS REQUIRED MOVING FORWARD AFTER THE RECALL REMEDY. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WA1LFAFPXFA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/11/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10985802,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 4 YEAR OLD DAUGHTER GOT A 3RD DEGREE BURN ACROSS HER THIGH BY GETTING A GROCERY BAG OUT OF 2015 AUDI Q5 -- WHILE HELPING HER MOM.   VEHICLE WAS STATIONARY AND IN PARK.  OCCURRED IN OUR GARAGE AT OUR HOME.  THE EXHAUST STICKS OUT TOO FAR BY AN INCH OR SO.  UNSAFE DESIGN FOR THE PUBLIC.  RECALL IT!",
        "vin": "WA1LFAFP6FA"
    },
    {
        "components": "AIR BAGS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/28/2017",
        "dateOfIncident": "02/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981352,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 AUDI Q5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V001000 (VISIBILITY, AIR BAGS). THE DEALER STATED THAT THE PARTS WERE NOT AVAILABLE. A REPAIR APPOINTMENT WAS SCHEDULED, BUT THERE WAS NO TIMEFRAME FOR THE REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WA1DGAFP7FA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881437,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2015 AUDI Q5 THAT WAS PART OF THE VW RECALL, HOWEVER IT WAS NOT INCLUDED IN THE PACKAGE THAT HAS BEEN NEGOTIATED BY THE EPA. I WOULD LIKE TO UNDERSTAND WHAT IS BEING DONE TO PROTECT ME AND MY RIGHTS? I FEEL LIKE BECAUSE I PURCHASED THE 3 LITER ENGINE, THE ONLY TDI OFFERED BY AUDI IN AN SUV FORMAT, THAT I AM BEING PUNISHED. I AM STUCK WITH THIS CAR AND AM BEING PUNISHED FOR 8 MONTHS NOW THAT I CANNOT SELL IT OR GET RID OF IT. I TRUSTED VOLKSWAGON AND OUR EPA WANT TO KNOW WHERE I STAND IN THIS RECALL? DO I NEED TO HIRE A LAWYER AT THIS POINT? ENOUGH IS ENOUGH.",
        "vin": "WA1VMAFP8FA"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "12/06/2015",
        "dateOfIncident": "12/03/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10808654,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE MIRROR BLOCKED MY VIEW WHILE TAKING A LEFT TURN WHICH CAUSED AN ACCIDENT.",
        "vin": "WA1LFAFP3EA"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "09/11/2015",
        "dateOfIncident": "09/06/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763123,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A LONG GRAVEL DRIVEWAY GOING 15-20MPH AND I WENT AROUND A SLIGHT LEFT CURVE. AFTER THE LEFT CURVE THE ROAD BECOMES STRAIT. MY CAR STEERING WHEEL LOCKED, I COULD NOT MOVE THE STEERING WHEEL TO THE LEFT AND I COULD NOT GET OUT OF THE CURVE. THE CAR CONTINUED TO HEAD RIGHT NO MATTER HOW HARD I PULLED ON THE STEERING WHEEL TO GO LEFT. IT WOULD NOT BUDGE. THE CAR CONTINUED GOING RIGHT, OFF THE DRIVEWAY AND INTO SEVERAL TREES. THE WHEEL WAS STILL LOCKED AT THIS POINT. I HAD TO TURN THE CAR OFF, AND ON TO GET THE WHEEL TO RELEASE SO I COULD BACK  OUT OF THE TREE, AND ONTO THE DRIVEWAY.",
        "vin": "WA1LFAFP7FA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2015",
        "dateOfIncident": "07/17/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10736188,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WINDSHIELD CRACKED FROM THE INSIDE FROM THE PRESSURE OF MY PASSENGERS FOOT.  THE PASSENGER IS A 130LB FEMALE WITH NO EXTRAORDINARY PHYSICAL CAPABILITY. THE CRACK SPREAD QUICKLY AND PLACED ALL THE OCCUPANTS IN DANGER.  THERE WAS ZERO IMPACT ON THE OUTSIDE OF THE GLASS.  THE CRACK COULD NOT BE FELT FROM THE OUTSIDE OF THE GLASS, ONLY FROM THE INSIDE.  THIS WAS THE SECOND TIME THIS HAS OCCURRED.  THE FIRST TIME THE DEALER STATED THAT IT MUST HAVE BEEN A COINCIDENCE THAT THE WINDSHIELD CRACKED AT THE SPOT AT WHICH MY PASSENGERS TOE WAS AND AT THE VERY SAME TIME UPON PUSHING TO SCOOT BACK IN THE SEAT.  CONSIDERING I HAVE WITNESSED THIS EXACT SAFETY HAZARD TWICE WITHIN A YEAR RAISES MY CONCERN AND THE REASON I AM NOW REPORTING IT.",
        "vin": "WA1DGAFP0FA"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "11/23/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660936,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q5",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 10:45 AM MY HUSBAND (THE DRIVER) AND I (THE PASSENGER) WERE DRIVING WEST ON CO HWY 86 JUST LEAVING FRANKTOWN, CO AND HAD CROSSED OVER THE CHERRY CREEK BRIDGE WHEN THE PANORAMIC SUNROOF IN OUR 99 DAY OLD 2015 AUDI Q5 EXPLODED OUTWARDS. THE OUTSIDE TEMP WAS APPROX. 35 DEGREES, LIGHT WINDS, WINDOWS UP, SUNROOF CLOSED / SUN SHADE OPENED HALF WAY, AND VENT FOR OUTSIDE AIR WAS ON; NO CARS AHEAD OR BEHIND US; NO LARGE CHUNKS OF DEBRIS ON THE ROAD. WE INITIALLY THOUGHT WE HAD BEEN SHOT AT AND DUCKED WHILE LOOKING AROUND FOR PEOPLE AND A SAFE PLACE TO STOP. AFTER INITIAL CHECK TO ENSURE NEITHER OF US WAS BLEEDING WE STARTED LOOKING FOR ANYTHING NEAR OR IN THE VEHICLE THAT WOULD HAVE CAUSED AN EXPLOSION; IT WAS THEN THAT WE NOTICED THERE WAS A SMALL AMOUNT OF GLASS (IN RELATION TO THE SIZE OF THE SUNROOF PANEL) INSIDE THE VEHICLE. GLASS HAD RAINED DOWN INSIDE THE CAR COVERING BOTH RIDERS, THE FRONT CONSOLE AND DASH; ALL OVER THE BACK SEATS/FLOOR (THE SUNSHADE WAS HALFWAY OPEN). WE IMMEDIATELY CALLED AUDI ROADSIDE ASSISTANCE THAT HELPED GUIDE US TO A MORE CENTRAL LOCATION FOR THE TOW TRUCK TO FIND US IN CASTLE ROCK, CO (APPROX 5 MILES). WHILE WAITING FOR THE TOW WE CALLED OUR INSURANCE COMPANY AND TOOK PHOTOS OF THE EXPLODED ROOFLINE AND SCRATCHES/GAUGES ON BACK OF THE CAR THE GLASS HAD LEFT. WE THEN FOLLOWED THE TOW TO A GAS STATION WHERE THE VEHICLE WAS WRAPPED  IN PLASTIC WRAP DUE TO THE SNOW STORM IN COLORADO SPRINGS, ALL THE WAY TO PHIL LONG AUDI. UPON ARRIVING HOME, WE DISCOVERED THAT SMALL SHARDS OF GLASS HAD FALLEN INSIDE OUR CLOTHING LEAVING MINOR SCRATCHES. THIS WAS A KNOWN ISSUE FOR VAG SINCE 2009-10 (NEW BEETLE ROOFS) AND AUDI RECALLED 13K CARS IN 2012 WITH THE SAME DESCRIPTION AS ABOVE BUT IT CITED \"IN COLD WEATHER\". JUST 3 WEEKS PRIOR THE CAR WAS DRIVEN TO AND FROM WORK, AT 7K FT, IN -10 DEGREE WEATHER WITH NO ADVERSE EFFECTS.  *TR",
        "vin": "WA1DGAFP8FA"
    }
]