[
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387251,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DECEMBER 29TH 2020, MY WIFE WAS TURNING LEFT WHILE PULLING INTO A PARKING SPACE IN A SHOPPING MALL WHEN THE CAR SUDDENLY SURGED FORWARD EVEN THOUGH SHE HAD HER FOOT ON THE BRAKE. SHE PLOWED INTO THE CAR PARKED IN THE SPACE ON THE RIGHT AND PUSHED THAT CAR INTO THE CAR TO ITS RIGHT. THE AIR BAGS ON THE  STEERING WHEEL, LEFT AND RIGHT SIDE AND DRIVER'S KNEE BAG ALL DEPLOYED. STATE FARM HAS JUST DECLARED THE CAR A TOTAL LOSS.",
        "vin": "WBA5B3C56FD"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349996,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW HAS A KNOWN ISSUE WITH MY MAKE AND MODEL WITH THE STEERING KNUCKLE (SWIVEL BEARING) AND WHEEL BEARINGS MAKING CONTACT. THIS HAS HAPPENED NOW TO BOTH MY DRIVER AND PASSENGER SIDE AND IT IS VERY SCARY. ONCE THEY MAKE CONTACT, THEY STAY IN CONTACT UNTIL FIXED BY THE DEALER. IT SIGNIFICANTLY AFFECTS THE ABILITY TO HANDLE THE VEHICLE AND MAKES THE CAR SHUTTER, AFFECTS THE ABILITY TO ACCELERATE AND BRAKE, AND AFFECTS OVERALL DRIVING IN GENERAL. THEY SAY IT IS NOT A SAFETY ISSUE,  BUT IT FEELS ANYTHING BUT SAFE WHEN YOU DO NOT FEEL IN CONTROL OF YOUR VEHICLE. ALL YOU CAN HEAR WHILE DRIVING IS THE METAL-ON-METAL CONTACT OF THE TWO BEARINGS. I PAID BMW $800 TO FIX MY PASSENGER SIDE AND NOW I WILL HAVE TO PAY THAT AGAIN TO FIX THE DRIVERS SIDE. THIS SHOULDN'T BE MY RESPONSIBILITY TO PAY FOR MY SAFETY IN THIS CAR. I DON'T HAVE $800 TO FIX THIS, BUT IF I DON'T I FEEL LIKE I WILL GET SERIOUSLY INJURED AND SOMETHING WILL BREAK ON MY CAR. THERE IS NO WAY YOU CAN KEEP DRIVING THE CAR LIKE THIS AND IT NOT \"AFFECT THE INTEGRITY OF THE VEHICLE\" AS BMW SAYS.",
        "vin": "WBA5B1C56FG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "04/03/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321886,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY, I NOTICED MY LEFT-REAR SUSPENSION HAS BEEN FAULTY AND THIS ISSUE SEEMS TO BE HAPPENING TO A LOT OF OTHER PEOPLE. THE TIRE WOULD GO ALL THE WAY INTO THE BODY OF THE CAR AND WHICH MAKES IT IMPOSSIBLE TO DRIVE SINCE IT'S RUBBING AGAINST THE CAR.  THIS ONLY HAPPENS WHEN THE VEHICLE IS PARKED, FROM WHAT I'VE NOTICED. I'M AFRAID THAT IT WILL HAPPEN WHILE I AM ON THE HIGHWAY WHICH IN RETURN CAN CAUSE ACCIDENT",
        "vin": "WBA5M2C57FG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282069,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR DIFFERENTIAL BUSHING STRESS CRACKING. DEALER REP STATED THAT THIS IS COMMON ON BMW 5, 6 AND 7 SERIES CARS DUE TO WEIGHT OF CARS. FAILURE COULD MAKE CAR UNSTABLE AND AFFECT HANDLING AND CONTROL. NOTED BY DEALER DURING SERVICING.",
        "vin": "WBA5B1C53FG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210462,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 BMW 535I XDRIVE WITH LESS THAN 50K MILES HAD THE DOOR LOCK ACTUATOR STOP WORKING. IF YOU TRIED TO OPEN THE DOOR (ONCE THE CAR WAS IN PARK, OR TURNED OFF) AND THE LOCK BUTTON WOULD COME UP AND GO BACK DOWN BUT WOULD NOT UNLOCK. THE ONLY WAY TO GET THE DOOR TO UNLOCK WAS TO PUSH THE UNLOCK BUTTON ON THE CENTER CONSOLE. I HAVE READ ONLINE THAT THIS HAS BEEN AN ISSUE ON MULTIPLE VERSIONS OF BMW'S AND OVER QUITE A FEW YEARS AND HAS NEVER BEEN CORRECTED. THIS COULD BE A DEADLY ISSUE. IF SOMEONE WAS IN THE PASSENGER SEAT AND THE DRIVER WAS INCAPACITATED AND THE PASSENGER DID KNOW WHERE THE DOOR LOCK BUTTON WAS ON THAT CAR. THEY WOULD BE STUCK. I AM NOW AT A LITTLE OVER 55K MILES AND NOT THE ACTUATOR ON THE DRIVERS SIDE IS NOW GOING OUT. I HAVE SEEN ON MULTIPLE BMW FORUMS PEOPLE CONTINUOUSLY TALKING ABOUT THIS ISSUE. SOMETHING NEEDS TO BE DONE ABOUT THIS.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175100,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "535I",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 50MPH WITH ACTIVE CRUISE ACTIVATED. VEHICLE IN FRONT WAS SLOWING DOWN. I APPLIED BRAKES TO SLOW DOWN AND ALL OF A SUDDEN THE BRAKES FREEZE AND LOCK UP. I HAD TO OVERPOWER THE BRAKES AND TRAVELLED A FEW HUNDRED YARDS TO FIND A SAFE PLACE TO PULL OVER. CAR TOWED TO DEALER. THEY REPLACED THE STABILITY CONTROL MODULE AND THE DAMAGED BRAKES AND SAID THE VEHICLE IS SAFE TO DRIVE. I FOLLOWED UP WITH BMW HEADQUARTERS LOOKING FOR ANSWERS AS TO HOW A VEHICLE CAN HAVE BRAKE LOCK UP AS A FAIL SAFE CONDITION OF THE STABILITY CONTROL SYSTEM. NO SATISFACTORY ANSWERS.THEY TOLD ME THEY DID NOT RECEIVE THE DEFECTIVE UNIT FOR ANALYSIS OF SUCH A SERIOUS SAFETY ISSUE. I BELIEVE THIS FAILURE MODE IS LIKELY HAPPENING TO ANOTHER BMW VEHICLES AND BMW REFUSES TO PROVIDE INFO.",
        "vin": "WBA5B3C5XFD"
    }
]