[
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/04/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451125,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Squealing noise when using steering wheel. Even if the car is heated up for over 20 minutes. Steering wheel slow to turn or hard to turn. Happens everyday now.  Took to a dealership and they are advising that will cost almost 3K to resolve issue. Will have to send invoice once I pick up vehicle",
        "vin": "5GAKVBKD8FJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "01/29/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbag light is on and car has not ben accident.",
        "vin": "5GAKVBKD2FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunday at 11 ish am eastern time I started the vehicle to get grocery items. The mileage was approximately 68680. The tire pressure warning light and air bag light came on along with the alerts to service air bag, side view collision, tire pressure, parking assist was shut off. The radio began to randomly shut off and reboot and the lower controls (heated seats, gate lift etc.) would not work, also the turn signal noise would go in and out. Tachometer and speedometer were slightly impacted.  Monday I stopped at the dealer after making sure the battery connection was good- there has been no fluctuation of power according to the gauge or even how the items are alerting and the fact my door panel buttons to lock and unlock were not working. They were unable to detect an error with their handheld device even though all those alerts were going across the screen.  Appt set for 10/20 at noon to go on the big computer (and probably cost my car payment just to see what is wrong) Today (I only have one car and was not offered a loaner even though we agreed it was a safety issue) the traction control light came on and off, the speedometer and tachometer were greatly impacted, the rear camera stated it needed servicing, my liftgate will not work even using the rear handle and sounds like there may be impact in the drivetrain happening as the gear select icon stayed on R for over 500 feet driving forward.  There was no hard start, cold day or jump given- also compass is not working either.  The radio will randomly say communication system is not working/connecting which appears to impact my OnStar.  I have seen other issues for this year online and very concerned what electrical item it is going to impact next.  I have children (K and college) and it is bad enough I HAVE to use my car to get to work. This will happen in park or going down the road at 55/60 and every speed between.",
        "vin": "5gakvbkd0fj"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431675,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The steering wheel develops play because the components of the tie rod loosen and it is difficult to maintain control of the vehicle at high and low speeds. Besides that, steering is very stiff. Cracks and screeches are heard coming from the steering rack when you turn the wheel, can even be felt from the steering wheel. My vehicle has only 26k miles on it, but I've heard some others start at 5k",
        "vin": "5GAKRBKD4FJ"
    },
    {
        "components": "STEERING,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT WARNING LIGHT STAYS CONTINUOUSLY LIT IN BOTH MIRRORS; POWER STEERING IS COMPLETELY OUT. VEHICLE IS ALMOST UNDELIVERABLE AT THIS POINT. VERY HARD TO TURN. HAVE HAD FLUIDS, BASIC MAINTENANCE CHECKED. TOLD IT COULD BE THE ELECTRONIC POWER STEERING SENSOR OR THE THE POWER STEERING PUMP",
        "vin": "5GAKRBKD6FJ"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11403787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SON WAS DRIVING CAR AND THE STEERING LOCKED. VEARED OFF ROAD AFTER TURNING ONTO STREET, WENT OVER CURB ONTO SIDEWALK AND HIT LIGHT POLE AND CONCRETE BENCH, STOPPING INCHES FROM A BUILDING. CAR WAS TOTALED",
        "vin": "5GAKRAKD3FJ"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LOW SPEEDS THE STEERING WHEEL WILL NOT TURN. TAKES GREATER EFFORT THAN MY STRENGTH CAN HANDLE. ALSO SMELL A LIGHT BURNING SMELL WITH IT. FEELING EVERY BUMP WITH THIS ISSUE TOO SO MAY BE IN THE SUSPENSION BUT CANNOT DIAGNOSE YET.",
        "vin": "5GAKVCKD0FJ"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/12/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396015,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD TRUCK SINCE NEW.  WE HAVE CONSISTENT SUSPENSION PROBLEMS INCLUDING STRUTS AND BUSHINGS.  THE PARTS WERE DESIGNED FOR CAR AND NOT HEAVY SUV.  THIS COULD RESULT IN ACCIDENT IF NOT REPAIRED AS INVOLVES STEERING AND DIRECTION.    WE HAVE ALSO HAD THE BRAKE BOOSTER REPLACED 5 TIMES TO DATE.  IT STARTS SQUEAKING.  GM HAS SAID IT WILL NOT EFFECT THE BRAKE BUT THEY CANNOT LUBRICATE OR REPAIR UNLESS REPLACED.  THIS ALSO EFFECTS OTHER GM TRUCKS ON SAME LAMBDA PLATFORM INCLUDING ACADIA AND TRAVERSE.",
        "vin": "5GAKRCKD8FJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. THE CONTACT STATED WHILE HER HUSBAND WAS DRIVING 15 MPH, THEY HEARD AN ABNORMAL NOISE AND THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE DRIVER CONTINUED TO DRIVING THE VEHICLE TO HIS DESTINATION. THE VEHICLE WAS TAKEN TO LOCAL DEALER LEE PETERSON BUICK GMC OF YAKIMA LOCATED AT 410 S 1ST ST, YAKIMA, WA 98901, (509) 731-3946, WHERE IT WAS DIAGNOSED WITH NEEDING THE POWER STEERING ASSEMBLY AND PUMP TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 62,000.",
        "vin": "5GAKVCKD3FJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING JUST STOPPED WORKING.   MY 2015 BUICK ENCLAVE JUST TURNED  30,000 MILES.  IMAGINE MY SHOCK WHEN I WAS TOLD IT WOULD COST  $1,530.83 TO REPAIR.  WARRANTY APPEARS TO BE 3 YEARS -30,000 MILES.    I'VE NOTICED A LOT OF COMPLAINTS ON LINE REGARDING AIR CONDITIONING PROBLEMS IN   THIS MAKE AND MODEL AND WONDERED IF A RECALL HAD TAKEN PLACE.    I'VE BEEN A GENERAL MOTORS GAL THROUGH MOST OF MY LIFE.   MY FATHER STARTED AT A 'REPO  MAN WITH GMAC AND RETIRED AS  SALES MANAGER 1970.  I WAS SECRETARY TO BRANCH  MANAGER @ MOTORS INSURANCE COMPANY IN MY YOUNGER DAYS.    A LOT OF TRUST AND   LOYALTY TO GM OVER THE YEARS,   WHEN I BECAME A WIDOW AND NEEDED TO BUY A CAR ON  MY OWN, I WAS EXCITED TO GO HIGHER-END AND PURCHASE MY BUICK ENCLAVE, THINKING IT WOULD LAST FOR YEARS.  THEN IN JUNE 2018 TRANSMISSION OR DRIVE TRAIN FAILED BUT IT WAS UNDER WARRANTY. THEN IN JULY 2020 DURING A ROUTINE OIL CHANGE I HAD TO PAY $222.14  ADDITIONAL WORK.   WAS TOLD BY LOCAL MECHANIC THAT NONE OF THIS WAS NEEDED.  BOTTOM LINE, I SPENT $50,000 TO PURCHASE THIS VEHICLE AND NOW I CERTAINLY DO NOT  FEEL SECURE DRIVING THIS CAR.   LIVING ALONE REQUIRES RELIABLE TRANSPORTATION!    HOPE YOU WILL FIND A SOLUTION TO HELP ME WITH THIS HUGE AC EXPENSE.   APPARENTLY THE DIAGNOSTIC TEST PRELIMINARILY COST $200.00 ALONE.   WHICH IS CRAZY.  THANK YOU IN ADVANCE FOR YOUR KIND CONSIDERATION.  DEALER IS I.G.BURTON, 17861 COASTAL HWY, LEWES, DELAWARE 19958",
        "vin": "5GAKVBKD7FJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 BUICK ENCLAVE. CONSUMER WRITES IN REGARDS TO STEERING GEAR REPLACEMENT. *LD    THE CONSUMER STATED THE STEERING WHEEL FAILED TO TURN WHILE DRIVING. THE CONSUMER REQUESTED THE MANUFACTURER BE RESPONSIBLE FOR REPAIRS. *JS",
        "vin": "5GAKVBKD8FJ"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR MOUNT BROKE POTENTIALLY CAUSING SERIOUS DAMAGE TO THE ENGINE OR MORE. UNKNOWN WHEN IT BROKE, WAS NOTICED IN ROUTINE CHECK. REAR AC AND FRONT AC HAVE BOTH QUIT WORKING PROPERLY TWICE IN 2 YEARS: 1ST IN 2018 AND AGAIN JULY 2020. REAR OF VEHICLE ABOVE WHEEL WELL KEEPS SEPARATING FROM VEHICLE FOR UNKNOWN REASONS.",
        "vin": "5GAKRCKD9FJ"
    },
    {
        "components": "VISIBILITY",
        "crash": true,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 5 MPH WHEN THE CONTACT WAS ATTEMPTING TO PULL INTO A PARKING SPACE WHEN THEY HIT ANOTHER VEHICLE NEAR THE DRIVER'S SIDE. THE CONTACT WAS NOT ABLE TO SEE THE OTHER VEHICLE. NO AIR BAGS DEPLOYED. THE VEHICLE WAS NOT TOWED. A POLICE REPORT WAS FILED. NO INJURIES OR MEDICAL ATTENTION WAS NEEDED. THE VEHICLE WAS TAKEN TO A BODY SHOP FOR REPAIRS. THE CONTACT STATED THAT THEN WHILE IDLE WHEN A TRUCK CAME FROM THE SIDE OF THE VEHICLE CRASHING INTO THE DRIVER SIDE OF THE VEHICLE WHEN THIS OCCURRED THE CONTACT WAS NOT ABLE TO SEE ANYTHING IN THE SIDE VIEW MIRROR. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT TOWED. THERE WERE NO INJURIES. THE VEHICLE WAS RETURNED TO THE BODY SHOP FOR THE DRIVER'S SIDE DOOR TO BE REPLACED. THE CONTACT CONTACTED THE DEALERSHIP (FINDLAY CHEVY BUICK GMC ADDRESS: 2565 LAUGHLIN VIEW DR, BULLHEAD CITY, AZ 86429; PHONE: (928) 754-3400) WHO ONLY ATTEMPTED TO TRADE THE VEHICLE IN. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 65,000. *BF    CONSUMER SAYS THAT THEY WERE UNABLE TO SEE OUT OF THE DRIVER'S SIDE MIRROR DURING BOTH ACCIDENTS. CONSUMER SAYS THAT ISSUE MAY BE DUE TO THE SEAT BEING TO LOW FOR A SHORTER PERSON TO SEE OUT OF THE MIRROR. CONSUMER HAS ATTEMPTED TO CONTACT THE MANUFACTURER BUT HAS BEEN UNSUCCESSFUL. *DL",
        "vin": "5GAKRBKD6FJ"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2015 ENCLAVE THE VEHICLE JERKS AND THE ENGINE LIGHT COMES ON. THEN STARTS RATTLING AND STEERING WHEEL LOCKS AND MY SPEED REDUCES TO 40, 25 THEN 10-5 MILES PER HOUR, THE WARNINGS READ ENGINE POWER REDUCED, TRACTION CONTROL OFF, SERVICE STABILLITRAK. I PULL MY CAR ON THE SIDE OF THE STREET, WAIT A FEW MINUTES AND SOMETIMES TURN ON MY CAR AND RATTLES AGAIN. NEED TO WAIT A FEW MORE MINUTES AND THE STARTS, THE ENGINE LIGHT STAYS ON FOR A FEW MINUTES, MAYBE COUPLE HOURS OR FOR A DAY AND THEN CLEARS UP. I TOOK IT TO MY MECHANIC AND NO CODES CAME UP. MY MECHANIC SUGGESTED TO DO A FULL SERVICE ON MY CAR WHICH I DID AND STILL HAPPENING.  THIS HAS HAPPENED SEVERAL TIMES, WHILE I'M ON HIGHWAY OR CITY STREETS. . VERY, VERY DANGEROUS. THE VIDEO AND PICTURES PROVIDED ARE FROM MARCH/02/20, BUT I HAVE THIS PROBLEM SINCE FALL LAST YEAR( IS WHEN I FIRST TOOK IT TO MY MECHANIC AND  PERFORMED A FULL SERVICE, PICTURE PROVIDED) AND LAST TIME HAPPENED TO ME WAS JUNE/15/2020.  *TR",
        "vin": "5GAKVBKD6FJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS OFF LOSE POWER GOING 70 MILES A HOUR ON HIGHYAY WE FILED A COMPLAINT BACK JANUARY 2019  PROBLEM STILL HAPPENS  JUST LAST WEEK IT HAPPENED AGAIN WERE GONNA GET HURT SOONER OR LATER IF NOT FIXED THANK YOU [XXX]     REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6) *CC",
        "vin": "5GAKRBKD2FJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TAILGATE WILL NOT STAY OPEN. CAR IS OF COURSE STATIONARY AND WHEN YOU OPEN TAILGATE IT WILL NOT EVER STAY OPEN AND FORCIBLY SHUTS NO MATTER WHO OR WHAT IS IN THE WAY. SEVERAL PEOPLE HAVE SUFFERED BRUISES AND BUMPS.",
        "vin": "5GAKRAKD2FJ"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301125,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. THE CONTACT STATED THAT WHILE STOPPED AT A TRAFFIC LIGHT THE ENGINE SHUT OFF AND THE VEHICLE WOULD NOT MOVE FORWARD. THE ENGINE RPMS REVVED UP WITH SEVERAL WARNING LIGHTS ILLUMINATED. THE VEHICLE RESTARTED AFTER AN HOUR WITH NO FURTHER ISSUES. THE FAILURE RECURRED SIX TIMES. THE DEALER (JERRY'S AUTOMOTIVE INC, 501 E 25TH ST, BALTIMORE, MD 21218 AND ANDERSON BUICK GMC 10125 YORK RD, COCKEYSVILLE, MD 21030 (443) 578-4924, WERE CONTACT BY PHONE AND STATED THE ISSUE WAS CAUSE BY THE BRAKE BOOSTER AND MASTER CYLINDER MALFUNCTION. THE VEHICLE WAS NOT REPAIRED. THE CONTACT WAS INFORMED BY THE MANUFACTURER THAT THE WARRANTY HAD EXPIRED. THE FAILURE MILEAGE WAS 48,000.",
        "vin": "5GAKRBKD9FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG AND SIDE DECTION LIGHTS BLINK DON'T WORK AND HEADLIGHT DON'T WORK AND CAR STOPS RUNNING WIPERS ONLY WORK ON HIGH WATER POURS ON MY FOOT WHEN IT RAINS HAS TO IN TO SHOP AGAIN TOMMROW GAYLORD MICH",
        "vin": "5GAKRBKD3FJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/31/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE SUDDENLY DECELERATED. ON TWO SEPARATE OCCASIONS, WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE SUDDENLY DECELERATED WITHOUT WARNING TO APPROXIMATELY 10 MPH. IN ADDITION, AN UNKNOWN WARNING INDICATOR ILLUMINATED. AFTER DRIVING THE VEHICLE FOR A WHILE, IT REGAINED SPEED AND WAS ABLE TO BE DRIVEN NORMALLY. THE CONTACT TOOK THE VEHICLE TO CONLEY BUICK GMC (LOCATED AT 800 CORTEZ RD W, BRADENTON, FL 34207, 941-755-8531), BUT THEY WERE UNABLE TO LOCATE A DIAGNOSTIC CODE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.*DT  CONSUMER STATED PROBLEM STILL PERSISTS.*JB",
        "vin": "5GAKRBKD2FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291930,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOSES SPEED FROM 70 DOWN TO 10 ON EXPRESSWAY THIS IS A LIFE THREADING PROBLEM ALMOST GOT REAR ENDED ON EWAY NO WHERE TO PULL OFF AN DARK OUT BEEN TO DEALER IN NOVI MICHIGAN 2 TIMES CAR DID SAME THING ON WAY TO FLORIDA NO READ OUT CODES SHOW ON TRACKING I THINK GM SHOULD FIX THIS PROBLEM FREE OF CHARGE BEFORE SOME 1 GETS KILLED.*DT*JB",
        "vin": "5GAKRBKD2FJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. WHILE THE VEHICLE WAS IN NEUTRAL, IT SUDDENLY ACCELERATED AT A HIGH SPEED. THE CONTACT STATED THAT THE ACCELERATOR PEDAL BECAME STUCK IN POSITION. THE CONTACT ATTEMPTED TO APPLY THE BRAKES; HOWEVER, THE VEHICLE FAILED TO STOP. THE CONTACT APPLIED THE EMERGENCY BRAKE AND THE PASSENGER TURNED OFF THE IGNITION. THE CONTACT DROVE THE VEHICLE HOME. WHILE DRIVING TO LUTHER BROOKDALE CHEVROLET (LOCATED AT 6701 BROOKLYN BLVD, BROOKLYN CENTER, MN 55429, 612-326-3850), THE FAILURE RECURRED. THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE VIN AND FAILURE MILEAGE WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "12/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT DIFFERENT LEVELS IN BREAK PEDAL TRAVEL. AT TIMES MY CAR STOPS NORMALLY WHEN THE BRAKE PEDAL IS FIRST PRESSED (ABOUT 2 INCHES).  OTHER TIMES THE BRAKE PEDAL TRAVEL IS MUCH GREATER (ABOUT  4 INCHES OR MORE), AND THE PEDAL HAS   A SPONGY FEEL. I HAVE TAKEN THE CAR BACK TO BUICK NUMEROUS TIMES, AND THEY STATE THEY CAN NOT FIND ANY PROBLEM. THIS IS A VERY SERIOUS PROBLEM, ESPECIALLY AT HIGHWAY SPEEDS, WHERE I AM NEVER SURE I WILL BE ABLE TO STOP THE CAR IN TIME TO AVOID AN ACCIDENT.",
        "vin": "5GAKVCKD9FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING AT A STOP AND THE VEHICLE IN THE PARK POSITION, THE LOCKS LOCKED, UNLOCKED, AND RELOCATED. AFTER INITIALLY FEELING THIS COULD BE A ONE TIME OCCURRENCE, IT HAPPENED ONCE AGAIN AND EXTENDED. THE SECOND OCCURRENCE HAPPENED ABOUT 7-9 TIMES BETWEEN LOCK AND UNLOCK. DURING THE SECOND OCCURRENCE, I NOTICED THE GEAR SHIFT DISPLAY WAS FLASHING IN AND OUT OF PARK. MY CONCERN IS THIS MAY BE MORE OF A DISCONNECT IN THE GEAR SYSTEM THAT MAY MALFUNCTION WHEN DRIVING.    WHILE THIS HAPPENED PARKED, WE HAD BEEN DRIVING AND CAME TO THE PARK POSITION WHILE SITTING IN A DRIVE THRU.",
        "vin": "5GAKRBKDXFJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11241030,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER ENDED UP GETTING THE SEAT BELT TWISTED AROUND HER WAIST WHEN SHE WAS TRYING TO GET OUT. THE SEATBELT WAS LOCKED TIGHTLY AROUND HER WAIST AND SHE COULD NOT GET OUT. I TRIED TURNING OFF THE CAR, UNLOCKING THE CAR, AND PULLING THE SEAT RELEASE BUT THE SEATBELT WOULD NOT UNLOCK. WE CALLED THE LOCAL FIRE DEPARTMENT AND THE SEATBELT HAD TO BE CUT OFF.",
        "vin": "5GAKRBKD0FJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER PURCHASING MY 2015 BUICK ENCLAVE THE POWER STEERING PUMP HAD TO BE REPLACED. ABOUT 15K MILES LATER, THE POWER STEERING HOSE NEEDS TO BE REPLACED. I HAVE RESEARCHING INTO THIS AND IT LOOKS LIKE THIS SYSTEM HAS BEEN FAULTY FOR NUMEROUS VEHICLES OF THIS MODEL. THE PERSON AT THE DEALERSHIP TOLD ME THIS CAN CAUSE A FIRE IF LEFT UNTREATED. THIS IS A MAJOR SAFETY CONCERN AND SHOULD BE LOOKED INTO.",
        "vin": "5GAKRBKD8FJ"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON EXPRESSWAY CAR DROPS TO LIMP MODE  I HAVE RETURNED TO SEVERAL DEALERS NO CODES CAN BE FOUND. NOTIFIED GM OFFICE ABOUT PROBLEM. ONLY SOLUTION IS TO GIVE ME A 2000 DOLLAR CERTIFICATE TO BUY A NEW GM PRODUCT. SAFETY PROBLEM WHEN YOU HAVE A 70 YEAR OLD DRIVING 70 MPH IN HIGH SPEED LANE AND IT DROPS TO LIMP MODE.CONTACTED GM CENTRAL OFFICE  CASE [XXX] TALKED TO DANIELLE AT 855-880-1400 EXTENSION 5914268.. I ALSO HAVE SEVERAL PHOTO'S OF THE DASH BOARD WARNINGS ABOUT TRACTION CONTROL AND STABLIZER  I  DON'T KNOW HOW TO SEND DOCUMENTS ON THE COMPUTER . IT HAS HAPPEN MORE THA 10 TIMES, I STOPPED WASTING MY TIME FOR SOMETHING THEY CAN.T FIND. I BELIEVE IT'S A PROBLEM WITH COMPUTER, BUT THEY TELL ME THE COMPUTER WOULD LET THEM KNOW IF ITS NOT WORKING CORRECTLY.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "5GAKRBKD9FJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217092,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT CABLE COMPLETELY SHARED OFF WHERE IT ATTACHES TO FLOOR. CAME APART WHEN TRYING TO USE",
        "vin": "5GAKRCKD6FJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER 'SERVICE AIRBAG' LIGHT HAS BEEN COMING ON.  A DEALER HAS LOOKED AT IT TWICE NOW WITHOUT A SUCCESSFUL REPAIR.  THE MOST RECENT WAS ON 5/24.  SUPPOSEDLY A POOR CONNECTION AT A SEAT CONNECTOR WAS FOUND, CODE B0021, AND WIRES WERE CUT AND SPLICED TOGETHER.  2 DAYS LATER THE LIGHT CAME BACK ON JUST LIKE LAST TIME.  OUR CONCERN IS THAT IF WE WERE TO BE IN AN ACCIDENT WOULD THE AIRBAG DEPLOY?",
        "vin": "5GAKVBKDXFJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DOOR TO MY VEHICLE WILL NOT STAY CLOSED SO I HAVE TO TURN OFF THE AUTO DOOR OPENER.  I HAVE TO OPEN IT BY HAND AND NOT BY THE ELECTRIC KEY OPENER.  I WAS ON A TRIP TO FLORIDA AND GOING 70 MILES PER HOUR AND THE BACK CAME OPEN.  I TOOK IT TO COLONIAL AUTO WHERE I PURCHASED IT AND HE TOLD ME THAT IT WOULD BE BETWEEN 150.00 - 175.00 TO FIX IT BECAUSE HE SAID THAT HE THOUGHT THE LACK MAY BE OUT OF LINE THAT HE HAD SEVERAL OTHER PEOPLE WITH THE SAME PROBLEM.  IF THIS PROBLEM IS REPORTED TO BUICK THAN THEY NEED TO RECALL THEM TO BE CHECKED OR FIXED.  I DON'T THINK I WILL EVER BUY ANOTHER BUICK AND WILL NOT BUY ANOTHER AUTO FROM THIS DEALER. I WENT OUT TO GET IN MY CAR FROM WORK AND THE BACK WAS OPENED.  WHAT A JOKE THIS CAR HAS BECOME.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2019",
        "dateOfIncident": "05/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207038,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 11, 2011 I WENT TO WORK AND TURNED MY CAR OFF ONLY THE CAR DID NOT STOP IT CONTINUED TO RUN WITHOUT THE KEY IN THE SWITCH.  I WAITED ALMOST AN HOUR AND TRIED IT AGAIN AND IT TURNED OFF.  WHEN I LEFT WORK IT CRANKED RIGHT UP BUT WHEN I GOT HOME, IT WOULD NOT TURN OFF.  I CALLED ONSTAR AND THEY TOLD ME BEFORE I HAD IT TOWED, I NEEDED TO DISCONNECT THE BATTERY. I CALLED A MECHANIC TO COME TO MY HOUSE AND HE DISCONNECTED ALTERNATOR AND BATTERY AND IT CONTINUED TO RUN.  HE THEN HAD TO DISCONNECT THE CABLE ON THE POWER BOX UNDER THE HOOD BEFORE IT WOULD SHUT OFF.  I CALLED TRIPLE A TO HAVE IT TOWED TO ABERNATHY CHERVELOT AND BUICK IN LINCOLNTON, NORTH CAROLINA.",
        "vin": "5GAKRAKD1FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SIDE DETECTION SYSTEM .  SIDE AND REAR ALERTS DO NOT WORK.  NOTICE COMES UP ON DASHBOARD EVERY TIME I START THE CAR.  HAPPENED 200 MILES AFTER WARRANTY IS OVER AT 50,000 MILES.",
        "vin": "5GAKVBKD6FJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203234,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT AROUND 36000 MILES MY POWER STEERING PUMP HAD TO BE REPLACED BECAUSE FLUID WAS VISIBLE BENEATH THE CAR AND THE SOURCE WAS DETERMINED TO BE THE HIGH PRESSURE HOSES AND PUMP. AT NEARLY 83,480 MILES WHEN THE COMBO SWITCH HAD TO BE REPLACED IT WAS NOTICED THERE WAS A SIGNIFICANT RACK AND PINION LEAK. I BELIEVE THE EARLIER ISSUE IS SOMEHOW CONNECTED TO EARLY FAILURE OF THE RACK AND PINION. REGARDLESS, THE TECH SAID THERE WAS A 2016 WITH 52,000 MILES ON IT THAT NEEDED TO HAVE THE RACK AND PINION REPLACED. HE ADMITTED THAT THERE IS LIKELY A FAULT IN THE PART CAUSING THEM TO DETERIORATE BEFORE THEY SHOULD.",
        "vin": "5GAKVCKD7FJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL??    MY SERVICE AIR BAG LIGHT CAME ON, BUT NO RECALL IS ISSUED FOR MY VIN. THE VEHICLE WAS PARKED OVERNIGHT THEN THE NEXT MORNING WHEN I STARTED IT THE AIR BAG LIGHT IS ON. NO ACCIDENTS. I HAD THE SENSORS CHECK AND A SCAN DONE ON HE CAR WITH NO INDICATIONS.",
        "vin": "1GAKRCKD7FJ"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187324,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A SENSOR CAME ON FOR STAIBLITRAKS AND NO ALL WHEEL DRIVE MODE WAS DISABLED AND ABS CAME ON. CAR STARTED TO JERK OR LUNGE FORWARD NUMEROUS TIMES, UNTIL CAR GOT UP TO SPEED. AFTER I SHUT THE CAR OFF AND MY WIFE & SON WHO WAS IN A BOWLING TOURNEMENT, WE CAME OUT AND STARTED THE CAR AND I NOTICED THAT WHEN I PUT THE BRAKES ON AT FIRST THERE WASN'T ANY TILL I STARTED MOVING.",
        "vin": "5GAKVCKD9FJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183498,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY HAS BEEN REPLACED TWICE IN 20 MONTHS DUE TO FAILURE OF CHARGING SYSTEM TO RECHARGE BATTERY.  TURN SIGNALS DO NOT WORK PROPERLY OR AT ALL. DEALER SAYS BATTERY IS \"DEFECTIVE\".  LOW ENGINE RPM TO INCREASE FUEL MILEAGE AND AUTOMATIC ILLUMINATION OF DRIVING LIGHTS END UP TO BATTERY BEING IN A CONSTANT DISCHARGE STATE LEADING TO FAILURE.  SIGNAL LIGHTS WILL SLOW DOWN OR STOP ALTOGETHER WHILE SITTING AT A STOP LIGHT.  THE VEHICLE HAS LEFT ME STRANDED SEVERAL TIME BECAUSE IT WILL NOT RESTART - THERE IS NO WARNING THAT FAILURE IS IMMINENT. POOR DESIGN IN ONE SAFETY FEATURE LEADS TO A FAILURE OF ANOTHER SAFETY FEATURE AND EVENTUALLY TO FAILURE OF THE VEHICLE ALTOGETHER.  THERE IS NO VOLT METER AND NO WARNING LIGHTS ARE EVER ILLUMINATED.",
        "vin": "KL4CJBSB8FB"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A GRINDING NOISE WHEN TURNING WHEELS FROM FAR LEFT AND FROM FAR RIGHT. GENERALLY HEARD AS YOU BEGIN TO BACK UP FROM A PARKING SPACE AND GOING FORWARD AND TURNING THE STEERING WHEEL IN EITHER DIRECTION. VEHICLE HAS ABOUT 73,000 MILES AND NEW FACTORY RECOMMENDED TIRES AT 68,000 MILES.  RECENTLY HAD LEAKING POWER STEERING PUMP REPLACED  BY GM BUICK GARAGE. GM MECHANIC CAN'T DETERMINED SOURCE OF GRINDING SOUND.",
        "vin": "5GAKVCKD0FJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162463,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. THE CONTACT STATED THAT THE HEADLIGHTS ILLUMINATED ON THEIR OWN. THE CONTACT PLACED THE HEADLIGHTS ON AUTO SET AND THE LIGHTS WOULD GO OUT. BOTH HEADLIGHTS WOULD OCCASIONALLY ILLUMINATE ONE AFTER THE OTHER. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 16,216. THE VIN WAS INVALID.",
        "vin": "5GAKEBKD0FJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "07/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11160873,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TUESDAY, 7/18/2017.  I WAS COMING OVER A SMALL DECLINE ON LOCAL ROAD IN EAST BRUNSWICK, NJ.  I APPLIED THE BRAKES AND CAME UPON THE TRAFFICS LIGHT AND TRAFFICS AHEAD AND THE VEHICLE SHOT FOREWORD. APPLYING THE BREAKS HAD NO EFFECT. IN FACT THE CAR APPEARED TO ACCELERATE. I DID NOT HAVE ENOUGH TIME TO AVOID HITTING THE VEHICLE IN FRONT  OF ME WHICH CAUSED THAT VECHILE TO HIT ANOTHER.  MY VEHICLE ACCELERATED VS BRAKING WHEN APPLYING THE BRAKES.  APPLYING THE BRAKE HAD NO OR LITTLE EFFECT IN SLOWING THE VEHICLE. IS THERE, OR HAS THERE BEEN, REPORTS OF SIMILAR PROBLEMS WITH ACCELERATION PROBLEMS WITH THE BUICK ENCLAVE, 2015 MODEL ?.",
        "vin": "5GAKVBKD1FJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "08/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149526,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR IN AUGUST 2015. LESS THAN A WEEK AFTER BUYING IT, I HAD ISSUES WITH WHEELS AS IT WIGGLES AND IS NOT STABLE REGARDLESS OF THE TYPE OF ROAD I AM IN. THE DEALERSHIP NEEDED TO REALIGN THE WHEELS. AND IT'S BEEN HAPPENING ALL THE TIME THAT THEY NEEDED TO REALIGN THE WHEELS ALMOST EVERY TIME I HAVE AN OIL CHANGE DONE. ON TOP OF IT, THE WHEELS ALSO LOSES AIR PRESSURE TOO OFTEN. IT IS ALSO VERY DIFFICULT TO ACCELERATE FROM STOP AS CAR SEEMS WANTING TO GO TO A DIFFERENT DIRECTION. IT HAS BEEN HAPPENING FOR THE PAST 3 YEARS AND I WAS NOT AWARE OF THIS SITE. IT IS STILL HAPPENING",
        "vin": "5GAKRBKD4FJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144437,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE WILL NOT KEEP PRESSURE AT ALL. GOODYEAR FORTERA HL",
        "vin": "5GAKRAKD1FJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130605,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS ALL FOUR VEHICLE BRAKES LOCKED UP WHILE THE VEHICLE WAS IN MOTION.  THE FIRST TIME WAS IN A NEIGHBORHOOD AND THE VEHICLE WAS COMING TO A STOP AT A STOP SIGN WHEN THE REAR BRAKES LOCKED AND WOULD NOT RELEASE.  THE VEHICLE WAS SHUT DOWN FOR AN EXTENDED PERIOD AND THEN WAS ABLE TO BE MOVED A SHORT PERIOD.  THE BRAKES UNLOCKED AFTER SITTING OVERNIGHT.  THE LOCAL DEALERSHIP SERVICED THE VEHICLE AND SAID THE BRAKE SYSTEM WAS OUT OF CALIBRATION.  TWO DAYS LATER ALL FOUR BRAKES LOCKED WHILE DRIVING DOWN A INDUSTRIAL AREA STREET.  THE VEHICLE WAS ABLE TO BE FORCIBLY MOVED OFF THE ROADWAY WHERE IT SAT FROM TWO HOURS AWAITING A TOW.  AN ABS SYSTEM MALFUNCTION WAS BLAMED FOR THIS FAILURE AND RESULTED IN A VERY COSTLY REPAIR, NOT COVERED BY THE MANUFACTURER.",
        "vin": "5GAKRBKD9FJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "09/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123011,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATED STEERING WHEEL GETS SO HOT WHEN INITIALLY TURNED ON THAT IT'S IMPOSSIBLE TO HOLD ONTO IT.  I'VE TAKEN IT IN TO GET CHECKED AND WAS TOLD THAT BUICK WAS AWARE OF THE PROBLEM AND THAT I WAS TO TURN THE HEATER OFF FOR 10 MINUTES AND RESTART. THE STEERING WHEEL DOES EVENTUALLY COOL OFF ON IT'S OWN, BUT IT TAKES A GOOD COUPLE OF MINUTES AND MEANWHILE, YOU NEED TO WEAR A THICK GLOVE OR DO AS THEY SUGGEST AND TURN IT OFF. DOESN'T SEEM TO MATTER IF THE CAR IS BEING DRIVEN OR STATIONARY.",
        "vin": "GAKVBKD9FJI"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121760,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "19\" CHROME CLAD ALUMINUM WHEELS CONSTANT LEAK AIR. TIRES MUST BE INFLATED EVERY 3 TO FOUR DAYS. NOT SAFE FOR WIFE OR DAUGHTER TO HAVE TO GET TIRES INFLATED WHEN ON VACATION OR AWAY FROM HOME. PURCHASED AN AIR COMPRESSOR FOR HOME USE DUE TO THE INCONVENIENCE OF INLATING TIRES SO OFTEN.",
        "vin": "5GAKVBKD4FJ"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THURSDAY, 7/26/2018, I HAD PARKED MY CAR IN A RESTAURANT PARKING LOT. I APPEAR TO HAVE PULLED THE VEHICLE UP ONTO A CONCRETE SPACE DIVIDER. WHEN I TRIED LEAVING THE RESTAURANT, I COULDN'T BACK OFF OF THE SPACE DIVIDER, THE CAR WOULDN'T MOVE BACKWARD, SO I TRIED PULLING FOREWORD. WHEN THE CAR CAME FREE FROM THE DIVIDER, IT SHOT FOREWORD. APPLYING THE BREAKS HAD NO EFFECT. IN FACT THE CAR APPEARED TO ACCELERATE. I WAS HEADED DIRECTLY TOWARD A CONCRETE BUILDING, SO TO AVOID HITTING THE BUILDING HEAD ON, I HAD JUST ENOUGH TIME TO TURN THE STEERING WHEEL SLIGHTLY CAUSING THE VEHICLE TO SIDE SWIPE THE BUILDING BUT IT CRASHED INTO TWO PARKED VEHICLES. IT CAUSED EXTENSIVE DAMAGE TO MY VEHICLE AND ONE OF THE PARKED VEHICLES AND ONLY SLIGHT DAMAGE TO THE THIRD.  IT APPEARED THAT THE VEHICLE ACCELERATED BEYOND THE EFFORT I APPLIED TO THE GAS PEDAL, IT RAN AWAY  AND THE APPLICATION OF THE BRAKES HAD NO OR LITTLE EFFECT IN SLOWING THE VEHICLE.  IS THERE, OR HAS THERE BEEN, REPORTS OF SIMILAR PROBLEMS WITH ACCELERATION PROBLEMS WITH THE BUICK ENCLAVE, 2015 MODEL ?",
        "vin": "5GAKRCKD4FJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2018",
        "dateOfIncident": "04/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE SEPTEMBER  2015 FROM CARMAX IN CHARLOTTESVILLE, VA. SINCE THAT PURCHASE, I HAVE KEPT UP ALL THE ROUTINE MANTAINANCE ON A SCHEDULE FROM OIL CHANGES, ALL FLUIDS, TIRE ROTATIONS. APRIL 21, 2016, MY FIRST RATHER LARGE EXPENSE, \"ENGINE CHECK'. I AM HEARING A NOISE IN THE FRONT END. WARRANTY PAID A PORTION OF THIS ISSUE AND I PAID THE BALANCE. THE SERVICE DEPARTMENT INSTALLED N STRUT, N NUT, INSULATORS AND BEARINGS. AND THE DRIVER SEAT TRIM CRACKED AND BROKE. (1ST TIME); NEXT ISSUE IS A TOTAL WARRANTY ISSUE THAT INCLUDED REPLACING THE TORQUE CONVERTER. I ADVISED THEM THE ENGINE WAS SKIPPING AND THE CAR WOULD SLOW DOWN. THEY INSTALLED A CONVERTER GASKETS, HOSE AND 12 QTS OF FLUID. 1/27/18. I ADVISED THEM AGAIN OF A LEAK FROM WHAT I THOUGHT WAS THE ENGINE.AT THAT TIME, THEY ADVISED IT WAS A VAPOR LEAK FROM THE EXHUST PIPE.  ALSO..THE DRIVER SEAT OUTER PANEL BROKE AGAIN, THEY REPLACED.AND NOW, 4/28/18, THEY ARE TELLING ME THE DRIVE SHAFT HAS TO BE REPLACED AT A COST TO ME OF OVER $2500 +. NOW. YES, I AM CONCERNED.  THIS SHOULD NOT BE HAPPENING TO A RELATIVELY NEWER VEHICLE..ONE WOULD NOT THINK. MY ENCLAVE HAS 104K MILES ON HER CURRENTLY. THIS VEHICLE WAS PURCHASED FOR MY WEEKEND VISITS WITH MY DAUGHER AND GRANDCHILDREN. TO REPLACE MY 2000 FORD EXPLORER. AND NOW, I AM FEELING SAFER IN MY FORD EXPLORER. I HAVE NEVER HAD TO HAVE ANY KIND OF WORK DONE ON THAT VEHICLE, EXCEPT FOR ROUTINE MAINTAINANCE. AND SHE IS STILL RUNNING AS GREAT AS EVER. WHAT CAN GM DO FOR ME AND MY 2012 BUICK ENCLAVE. I AM LOSING MY FAITH IN THIS VEHICLE. PLEASE HELP. THANK YOU FOR YOUR TIME. I HOPE I DON'T END UP HAVING TO PAY FOR THIS ISSUE.",
        "vin": "5GAKVDED7CJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083132,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES: EXPERIENCING TREAD CRACKING, LOSS OF TIRE PRESSURE.   I AM CONSTANTLY STOPPING TO ADD AIR TO TIRES, LOSS OF PRESSURE IS INTERMITTENT. CAR IS IN MOTION ON CITY STREETS, HIGHWAYS AND FREEWAYS. LOSS OF TIRE PRESSURE IS A GREAT SAFETY CONCERN TO ME AND MY FAMILY ESPECIALLY WHEN THE TIRE PRESSURE LIGHT GOES ON SUDDENLY AND OFTEN.",
        "vin": "5GAKRBKD2FJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS DRIVING OUR VEHICLE ON I-20 IN GEORGIA ON TUES 8/15.  IT WAS AROUND 2:00PM, 90-95 DEGREES, NO CARS WITHIN A 1/2 MILE IN FRONT OR BEHIND.   IT SOUNDED LIKE A SMALL EXPLOSION.  SUNROOF SHATTERED OUTWARD.  THE SHADE WAS PULLED SO GLASS DID NOT COME INTO THE PASSENGER SECTION. A FINE GLASS DUST CAME THROUGH THE SHADE.  BUICK IS CLAIMING IT WAS HIT BY AN UNKNOWN IMPACT.  THAT IS COMPLETELY UNTRUE.  THERE WAS NO VEHICLE, PERSON OR EQUIPMENT ANYWHERE NEAR.   IT WAS VERY DISCONCERTING AND THE STARTLE/DISTRACTION COULD HAVE CAUSED A SERIOUS ACCIDENT.  PLEASE HELP GET CAR MANUFACTURERS TO CHANGE THE TYPE OF GLASS OR INSTALLATION SO THIS DOES NOT HAPPEN AGAIN.  IN THE MEANWHILE, IT SHOULD BE THE MANUFACTURERS RESPONSIBILITY TO PAY FOR REPAIRS.",
        "vin": "5GAKRCKD8FJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FORWARD COLLISION ALERT DOES NOT FUNCTION DESPITE BUICK DEALER'S INSPECTION AND ASSURANCE \"IT'S WORKING PROPERLY.\"    TRAVELING OVER 3,500 MILES RECENTLY, HAD TWO INCIDENTS WHERE TRAFFIC CAME TO A DEAD STOP OR WE WERE CUT OFF AND THE FRONT END COLLISION ALERT SHOULD HAVE EMITTED A WARNING -- WE WERE TRAVELING OVER 25 MPH -- AND IT DID NOTHING.  TOOK TO THE GM/BUICK DEALER IN FT. LAUDERDALE, FL FOR INSPECTION/SERVICE AND WAS TOLD THERE WAS NOTHING WRONG WITH THE CAR, IT HAD \"OLD TECHNOLOGY\".  AGAIN, ON HE DRIVE FROM FLORIDA TO MICHIGAN, THE ALERT NEVER GAVE ANY WARNINGS WHEN TRAFFIC CAME TO A SUDDEN STOP OR WE WERE CUT OFF ON THE ROADWAY.  GM/BUICK SOLD US A SAFETY FEATURE THAT SIMPLY DOES NOT WORK AND THEIR RESPONSE IS TO \"BUY A NEWER BUICK WITH NEWER TECHNOLOGY.\"  BAD BUSINESS, BAD FOR CONSUMER SAFETY, AND FALSE AND MISLEADING REPRESENTATION THAT WE HAVE A SAFETY FEATURE THAT DOES NOT APPEAR TO WORK.",
        "vin": "5GAKVCKD5FJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/11/2017",
        "dateOfIncident": "04/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971955,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIR BAG WARNING CAME ON.  CAR 2.5YRS OLD 50000 MILES.  $850 CHARGE BY DEALER....  2015 BUICK ENCLAVE.   DEALER STATES AIRBAG MAY FAIL TO DEPLOY.",
        "vin": "5GAKVCKD7FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908358,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS STALLED SEVERAL TIMES IN THE MIDDLE OF THE ROAD WHILE DRIVING.  IT SEEMS TO BE SIMILAR TO THE ISSUE THAT IS IN THE RECALL OF THE 2014 MODEL, BUT THERE ARE NO RECALLS FOR THE 2015.  SINCE THERE ARE NO RECALLS, THE DEALER IS NOT LOOKING FOR THIS ISSUE ON MY CAR.",
        "vin": "5GAKVBKD2FJ"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/03/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862860,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 BUICK ENCLAVE.  CONSUMER WRITES IN REGARDS TO VEHICLE FRONT END COLLISION ALERT SYSTEM IS DEFECTIVE AND DOES NOT FUNCTION IN ACCORDANCE WITH OPERATIONAL CRITERIA AS SET FORTH IN THE OWNER'S MANUAL. *SMD  THE CONSUMER STATED HE AS WELL AS THE SALES AND SERVICE PERSONNEL REPEATEDLY ATTEMPTED TO TEST THE WARNING SYSTEM. HOWEVER, ALL INITIAL TESTING WAS UNSUCCESSFUL AS THERE WERE NO YELLOW OR RED LIGHT WINDSHIELD WARNING SIGNALS RESPONSE UNDER MULTIPLE TESTING CONDITIONS. IT WASN'T UNTIL THE SECOND TIME, THE PERSONNEL TESTED THE WARNING SYSTEM THAT THERE WAS ANY INDICATION THAT THE RED FLASHING ALERT SYSTEM ON THE WINDSHIELD WAS EVEN PARTIALLY OPERATIONAL. FURTHER, THERE WAS NO INDICATION THAT THE YELLOW FLASHING SIGNAL ON THE WINDSHIELD, WHICH WAS SUPPOSED TO ACTIVATE WHEN THE DRIVER IS FOLLOWING TOO CLOSELY WAS OPERATIONAL AT ANY TIME DURING THE TESTING. ALSO, AT THE TIME OF TESTING, THE RED LIGHT ALERT SIGNAL ON THE WINDSHIELD DID NOT ACTIVATE UNTIL THE VEHICLE AHEAD WAS APPROACHED AT A SPEED OF 25 MPH IN EXCESS OF THE LEADING VEHICLE SPEED AND ONLY WHEN THE APPROACHING VEHICLE WAS WITHIN 10 FEET OF THE REAR OF THE LEADING VEHICLE. *JB  A GENERAL MOTORS FIELD ENGINEER COMPLETED A RIDE ALONG WITH THE CONSUMER TO DEMONSTRATE PROPER FUNCTION OF THE FORWARD COLLISION ALERT SYSTEM, AND IT WAS DETERMINED THE SYSTEM WAS OPERATING AS INTENDED. UPDATED 05/31/16.*JB",
        "vin": "5GAKVBKD0FJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "04/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861672,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. WHILE THE VEHICLE WAS IDLING IN THE DRIVEWAY, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE VEHICLE ACCELERATED. THE VEHICLE DROVE THROUGH A NEIGHBOR'S DRIVEWAY AND YARD. THE CONTACT MANAGED TO PLACE THE GEAR IN NEUTRAL AND THEN IN PARK. THE ENGINE CONTINUED TO REV WHILE IN PARK. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE CONTACT NOTIFIED A LOCAL DEALER WHERE IT WAS DIAGNOSED THAT NOTHING WAS WRONG WITH THE VEHICLE AND THERE WERE NO RECALLS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT HAD NOT RESPONDED. THE FAILURE MILEAGE WAS 8,000...UPDATED 06/01/16 *BF  ....UPDATED 06/15/16 *BF  *TR",
        "vin": "5GAKRCKD1FJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "01/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS SUNROOF BREAKAGE WHILE VEHICLE WAS IN MOTION ON A FAIRLY STRAIGHT AND SMOOTH CITY STREET",
        "vin": "5GAKRCKD3FJ"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820509,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT VEHICLE SEPTEMBER 7, 2015. VEHICLE FROM VERY START HAD VIBRATION, WIND TUNNEL SOUND, AND SHIMMY IN STEERING AT HIGHWAY SPEEDS. DRIVE VEHICLE FOR LONG PERIOD OF TIME YOU GET A HEADACHE.  AFTER MANY ATTEMPTS DEALER COULD NOT FIX THIS. DEALERS ATTEMPTS TO REPAIR DROVE THREE OTHER ENCLAVES WHICH HAD SAME PROBLEM AND GMC ACADIA WITH SAME PROBLEM. TOLD THIS IS NORMAL FOR VEHICLE. I TRIED TO RETURN VEHICLE FOR MY TRADE IN. THEY SAID NO. GM DISTRICT REP. ALSO SAID VEHICLE IS NORMAL. I AM STUCK WITH THIS VEHICLE. GM KNOWS THEY HAVE PROBLEMS BUT DOES NOTHING.[XXX] *BF    'INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *BF",
        "vin": "5GAKVBKD1FJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2015",
        "dateOfIncident": "10/27/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817100,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK ENCLAVE. THE CONTACT STATED THAT THERE WAS AN ABNORMAL ODOR OF FUMES EMITTING INTO THE INTERIOR OF THE VEHICLE WHEN THE VENT CONTROLS HAD BEEN USED FROM A/C TO HEAT. THE CONTACT NOTICED THAT UPON THE WEATHER CHANGE WHEN THE HEAT WAS ACTIVATED, THE ODOR WAS GETTING PROGRESSIVELY WORSE. THE VEHICLE WAS TAKEN TO TWO DEALERS, WHO WERE NOT ABLE TO REPLICATE THE FAILURE. THE VEHICLE WAS TAKEN TO A THIRD DEALER WHO WAS ABLE TO PROVIDE A DIAGNOSIS AND THEY CHANGED AN AIR FILTER BUT THE FAILURE CONTINUED WITH A RANDOM UNKNOWN STRONG ODOR, WHICH WAS AFFECTING THE CONTACTS EYES AND NOSE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "5GAKRBKDXFJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "08/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LANE DEPARTURE WARNING DOES NOT DOES NOT ACTIVATE UNTIL THE VEHICLE IS 12\" OR SO INTO THE ON-COMING TRAFFIC LANE.  THIS DELAY COULD BE TO LATE TO WARN THE DRIVER OF AN IMPENDING COLLISION.    THIS HAPPENS ONLY WHEN THE LEFT SIDE (DRIVER'S SIDE) CROSSES INTO THE OTHER LANE.  THE PASSENGER SIDE WORKS PERFECTLY.  THIS HAPPENS ON ALL STREETS, HIGHWAYS, EXPRESS WAYS AT 35MPH OR HIGHER.  GM HAS NO WAY TO RE-CALIBRATE THE SYSTEM SENSITIVITY.",
        "vin": "5GAKVCKDXFJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/14/2015",
        "dateOfIncident": "09/12/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10763443,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "ENCLAVE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SCARIEST THING AND I HAVE NEVER EXPERIENCED A SEAT BELT LOCKING TO THE POINT OF A CHILD NEARLY FAINTING BECAUSE IT WAS CHOCKING HIM AROUND THE BELLY AREA. THE MORE I TRIED TO GIVE IT LEVERAGE TO RELEASE THE LOCK THE MORE IT ROLLED IN AND WOULDN'T UNLOCK. THERE ARE NO EMERGENCY RELEASE BUTTONS. GOD FORBID THERE WAS AN ACCIDENT  THERE WOULD BE NO WAY TO GET SOMEONE OUT. SCARIEST MOMENT OF MY LIFE. COPS HAD TO CUT THE SEAT BELT. I DO NOT WANT TO PUT MY KIDS IN THIS CAR AGAIN. I FEEL WITH THE WINDSHIELD AND TIRE PROBLEM ON TOP OF IT IS A VERY UNSAFE CAR TO CARRY MY PRECIOUS PRICELESS CARGO (MY KIDS AND THEIR FRIENDS)VERY DISAPPOINTED",
        "vin": "5GAKVBKD2FJ"
    }
]