[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "01/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400008,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED EXPERIENCING EXCESSIVE OIL BURN AT AROUND. SINCE THEN, I HAVE CHECKED MY OIL BIWEEKLY TO TOP OFF AND KEEP AT PROPER LEVELS ALONG WITH CONSISTENT OIL CHANGES AS THE OIL GETS DIRTY QUICKLY. DEALERSHIPS BEFORE HAVE TOLD ME THAT ITS \"NORMAL\" FOR THESE ENGINES. I DISCOVERED A BAD OIL LEAK. VACUUM PUMP ISSUES. MULTIPLE CAMSHAFT SEALS WORN AWAY, THAT WERE HARD AS ROCK FROM EXCESSIVE HEAT INCLUDING PISTON SEALS THAT HAD BEEN AFFECTED. THOUGHT THIS POSSIBLY HAD FIXED THE EXCESSIVE OIL BURN. A FEW WEEKS LATER I RECEIVED THE OIL LEVEL LOW NOTIFICATION ON THE CAR COMPUTER. I CHECK AND ITS VERY LOW. THE OIL BURN IS CONTINUING WITH NO CLEAR SIGNS OF AN OIL LEAK WITH DIRTY OIL. THERE IS POSSIBLY MORE PROBLEMS WITHIN THE ENGINE THAT AREN'T SEEN. I HAVE CHECKED PREVIOUS COMPLAINTS. I NOTICE THAT THIS ENGINE HAS MANY OF THE SAME PROBLEMS WITH THE TURBO PACKAGE ON GM VEHICLES.  IT HAS A ROUGH IDLE AND ENGINE HESITATION.   THESE CHARACTERISTICS SEEM TO INCLUDE INCONSISTENT ENGINE PERFORMANCE SOUND AND ARE FELT THROUGH THE PEDALS, THE DRIVER'S SEAT AND STEERING WHEEL, THERE IS A PUTTER AND HESITATES WHILE ACCELERATING.",
        "vin": "2G4GN5EX9F9"
    },
    {
        "components": "SUSPENSION,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394581,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SYSTEM KEEPS COMING ON THE DEALER SAYS IT'S MY FAULT AND THEY CAN'T DO NOTHING ABOUT IT I HAVE A KID AND IT'S NOT SAFE MY AIRBAG CAN DEPLOY ANYTIME.",
        "vin": "2G4GN5EX0F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375902,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE HAS GONE OUT TWICE WITHIN 54K MILES. SERVICE TECH SAID THIS IS A KNOW ISSUE WITH THE 2015 BUICK REGAL ENGINE. I JUST HAD IT REPLACED THE 2ND TIME IN FEB OF 2020. FIRST TIME IT WENT OUT THERE WAS ONLY 12K MILES ON IT. NOW ITS NOV. OF 2020 AND THE CAR IS HAVING THE SAME EXACT ISSUES AS IT WAS WHEN BOTH ENGINES WENT OUT. I CANNOT BELIEVE THIS IS HAPPENING A THIRD TIME. THIS IS NOT FAIR AS A CONSUMER TO PURCHASE A NEW CAR WITH BARELY ANY MILEAGE AND THE ENGINE KEEPS GOING ON. I WAS ON THE FREEWAY THE LAST TIME. WORST POSSIBLE TIMING EVER. THIS IS LIKE A NEVER ENDING REALLY EXPENSIVE ISSUE",
        "vin": "2G4GT5GX4F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372813,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE EXITING AN  INTERSTATE ON A SHARP CURVE FAILED TO RESPOND. NO WARNING LIGHTS APPEARED. WHEN APPLYING BRAKE STEERING BEGAN TO RESPOND. CONTACTED DEALER SERVICE DEPARTMENT CHARLIE OBAUGH STAUNTON VIRGINIA. VEHICLE IS NOT ON RECALL LIST. PROBLEM APPEARS TO BE SIMILAR TO 2016 STEERING RECALL. DEALERSHIP DID NOT OFFER REMEDY FOR PROBLEM. THIS IS DEFINITELY A SAFETY ISSUE LOSING STEERING WHILE IN MOTION.   WHAT OPTIONS DO WE HAVE",
        "vin": "2G4GK5EX2F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341888,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED EXPERIENCING EXCESSIVE OIL BURN AT AROUND 85,000 MILES. SINCE THEN, I HAVE CHECKED MY OIL BIWEEKLY TO TOP OFF AND KEEP AT PROPER LEVELS ALONG WITH CONSISTENT OIL CHANGES AS THE OIL GETS DIRTY QUICKLY. DEALERSHIPS BEFORE HAVE TOLD ME THAT ITS \"NORMAL\" FOR THESE ENGINES. AT 109,610 MILES, I DISCOVERED A BAD OIL LEAK. I TOOK THE VEHICLE INTO AN INDEPENDENT MECHANIC TO DIAGNOSE AND FIX THE PROBLEM. HE DETERMINED THAT THE VACUUM PUMP HAD BROKEN OFF INTO THE ENGINE WHICH CAUSED A SEAL PROBLEM FOR THE TOP OF THE ENGINE. AS HE OPENED UP THE TOP OF THE ENGINE TO REMOVE THE BROKEN PIECES, HE NOTICED MULTIPLE CAMSHAFT SEALS THAT HAD WORN AWAY, THAT WERE HARD AS ROCK FROM EXCESSIVE HEAT INCLUDING PISTON SEALS THAT HAD BEEN AFFECTED, HE REPAIRED  THEM ALL AFTER ORDERING THE REPLACEMENT PARTS FROM BUICK. THINKING THIS POSSIBLY HAD FIXED THE EXCESSIVE OIL BURN, I STOPPED CHECKING THE OIL LEVELS. A MONTH AND 1,000 MILES LATER, I RECEIVED THE OIL LEVEL LOW NOTIFICATION ON THE CAR COMPUTER. I CHECK AND ITS VERY LOW. THE OIL BURN IS CONTINUING WITH NO CLEAR SIGNS OF AN OIL LEAK WITH DIRTY OIL. THERE IS POSSIBLY MORE PROBLEMS WITHIN THE ENGINE THAT AREN'T SEEN. CHECKING PREVIOUS COMPLAINTS. I NOTICE THAT THIS ENGINE HAS MANY OF THE SAME PROBLEMS WITH THE TURBO PACKAGE ON GM VEHICLES.",
        "vin": "2G4GN5EX0F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338637,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK REGAL. THE CONTACT STATED THAT THE DRIVER'S SIDE HEADLIGHT WAS FILLED WITH MOISTURE. THE CONTACT WAS CONCERNED THAT MOISTURE IN THE HEADLIGHT HOUSING MAY CAUSE THE HEADLIGHT TO BECOME INOPERABLE WHILE DRIVING AT NIGHT AND POSSIBLY CAUSE AN ACCIDENT. THE DIAGNOSIS WAS CONFIRMED BY AN INDEPENDENT MECHANIC. KARP BUICK (400 SUNRISE HWY, ROCKVILLE CENTRE, NY 11570, 515-665-1739) WAS CONTACTED AND INFORMED OF THE FAILURE BUT PROVIDED NO REPAIR ASSISTANCE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 34,500.",
        "vin": "2G4GN5EX6F9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY BRAKE VACUUM PUMP. LEAKING OIL AND VEHICLES BRAKE PEDAL WAS STIFF AND LUCKILY DID NOT LEAD TO AN ACCIDENT AS I HAD TO USE ALL MY WEIGHT TO PUSH THE PEDAL DOWN TO STOP THE CAR. I TOOK THE CAR TO A BUICK DEALERSHIP AND THEY SAID THE VACUUM PUMP DISINTEGRATED WHILE DISASSEMBLING TO PUT NEW VACUUM PUMP IN. THIS LEAD TO PARTS OF THE VACUUM PUMP ENTERING THE ENGINE. THERE IS NOW METAL IN THE OIL AND ENGINE IS NOT RUNNING RIGHT WITH REDUCED POWER. DEALERSHIP SAID IT IS NOT THEIR FAULT THAT GM MADE A VACUUM PUMP THAT IS NOTORIOUS FOR FALLING APART INTO THE ENGINE. IF THE DEALERSHIP IS AWARE OF A CHEAP PART THAT OFTEN DISINTEGRATES INTO THE ENGINE HOW HAS THIS NOT BEEN RECALLED? I SEE MANY CASES ONLINE WHERE THIS HAS HAPPENED. DEALERSHIP I TOOK IT TO IS VANDEVERE BUICK IN AKRON OHIO. JERRY MESSENGER IS THE MANAGER THAT CAN VERIFY MY COMPLAINT.  *TR",
        "vin": "2G4GN5EX7F9"
    },
    {
        "components": "EXTERIOR LIGHTING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316371,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE HEADLIGHT IS RETAINING WATER/LIQUID. WHEN I BOUGHT THE CAR IN 2015, I WAS TOLD THAT MY TIRES WERE NEW; THEN 2 YEARS AGO, I WAS TOLD THAT I NEEDED TO REPLACE TWO OF THEM. NOW ONE OF THE TWO ORIGINAL PIRELLI TIRES HAS PITS AND CLEARS CHUNKS MISSING FROM THE TIRE BASE, AS WELL AS MANY CRACKS THROUGHOUT THE ENTIRE TIRE! LASTLY, THE CAR HAS A HABIT OF LOCKING THE DOORS ON ITS OWN AND KEEPING THEM LOCKED, THEREBY MAKING IT IMPOSSIBLE TO GET IN. THE MOST RECENT TIME, I CALLED ONSTAR...AND DIDN'T EVEN SPEAK TO ANYONE, BUT THEY MIRACULOUSLY OPENED AND THE REMOTE WORKED FINE...AGAIN! VEHICLE HAS UNDER 49000 MILES ON IT! VEHICLE HAS ALWAYS BEEN SERVICED BY ARNOLD CHEVY / BUICK AND NO ONE ELSE! OH, AND JUST A COMPLAINT FROM WHEN I PURCHASED THE VEHICLE: I WAS NEVER TOLD THE CAR NEEDED PREMIUM GAS FOR BEST TURBO PERFORMANCE; I WAS TOLD THAT AFTER OWNING THE VEHICLE 3 YEARS, AFTER THE WARRANTY EXPIRED AND I COMPLAINED OF THE ENGINE LAGGING.",
        "vin": "2G4GN5EX7F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306869,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE HEADLIGHT ASSEMBLY HOLDS WATER AND MOISTURE AND LIGHT CAN NOT COME OUT VERY WELL IT'S A KNOWN ISSUE AND SHOULD HAVE A RECALL ON IT",
        "vin": "2G4GN5EX6F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIRBAG WAS DISPLAYED ON THE DASHBOARD WHEN I STARTED MY VEHICLE. TOOK IT IN TO A BUICK DEALERSHIP AND IT WAS THE AIRBAG MODULE. MY CONCERN IS THAT IT WENT OUT AT ALL IN A VEHICLE THAT HAD LESS THAN 100,000 MILES ON IT AND IF IT WOULD HAPPEN AGAIN.",
        "vin": "2G4GN5EX7F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "08/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269883,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK REGAL. WHEN THE VEHICLE REACHED A COMPLETE STOP, THE VEHICLE STALLED AND THE ENGINE POWER REDUCED WARNING INDICATOR ILLUMINATED. THE CONTACT HAD TO TURN OFF AND RESTART THE VEHICLE FOR IT TO RESUME NORMAL OPERATION. THE VEHICLE WAS TAKEN TO ANCHOR BUICK GMC (1 AUTOMOTIVE BLVD, ELKTON, MD 21921, (443) 406-4623) WHERE IT WAS DIAGNOSED THAT THE VACUUM PUMP, CAMSHAFT, AND CAMSHAFT SENSOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED MULTIPLE TIMES. AS A RESULT, THE CONTACT HAD TO PURCHASE A LOANER VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND OFFERED $100 TOWARDS THE REPAIR COSTS. THE FAILURE MILEAGE WAS APPROXIMATELY 97,341.",
        "vin": "2G4GK5EX6F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11231421,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK REGAL. WHILE THE CONTACT WAS INSIDE THE VEHICLE, THE DRIVER'S SIDE DOOR LOCK WAS PRESSED, WHICH ACTIVATED THE ANTI-THEFT SYSTEM. THE DOORS WOULD NOT UNLOCK FROM THE INSIDE AND THE OCCUPANTS BECAME TRAPPED INSIDE THE VEHICLE FOR APPROXIMATELY 15 MINUTES BEFORE THE CONTACT WAS ABLE TO OPEN THE DOORS. AN UNKNOWN DEALER AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS UNKNOWN.   *JS",
        "vin": "2G4GL5EX0F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD THE DRIVER'S HEADLIGHT REPLACED UNDER WARRANTY DUE TO IT HOLDING WATER. ONCE WE GOT THE CAR BACK AND DROVE IT AT NIGHT, IT WAS APPARENT THAT THE LIGHT PATTERN WAS NOT THE SAME. SEE PHOTO.  WE WERE NOT ABLE TO SEE THE ROAD ON THE LEFT SIDE SINCE THE BEAM WAS ESSENTIALLY POINTED DOWN SO I TOOK THE VEHICLE BACK AND THEY SAID THAT THE HEADLIGHT WAS A NEW DESIGN AND THAT'S HOW IT LOOKS BUT THEY CLAIMED TO HAVE ADJUSTED IT AGAIN. THAT WEEK WE DROVE TO ORLANDO AT NIGHT AND ALMOST EVERY CAR IN THE OPPOSITE DIRECTION WOULD EITHER FLASH THEIR LIGHTS AT US OR HONK THEIR HORN. I DID A STATIC TEST AND THE LEDT LIGHT WAS ILLUMINATING OVERHEAD ROAD SIGNS AT A DISTANCE OF 50FT SO WE WERE BLINDING ONCOMING DRIVERS.  I CONTACTED BUICK CORPORATE AND THEY TOLD ME TO TAKE THE VEHICLE BACK TO THE DEALER A 4TH TIME, ONCE AGAIN I WAS TOLD THIS IS THE NEW DESIGN BUT WE WILL ADJUST IT.  AS IT STANDS RIGHT NOW, MY LEFT AND RIGHT HEADLIGHTS ARE THROWING 2 COMPLETELY DIFFERENT LIGHT PATTERNS, I STILL CAN'T SEE THE LEFT SIDE OF THE ROAD AND THE HIGH BEAMS ON THE LEFT SIDE DON'T SEEM TO ILLUMINATE ANYTHING AT ALL.  I'M A LICENSED ENGINEER AND ACCIDENT RE-CONSTRUCTIONIST THAT HAS SUBJECTED OTHER VEHICLES TO DOT AND SAE HEADLIGHT TESTS AND THESE LIGHTS WILL NOT PASS.  IT ALSO CAUSES UNDUE STRESS ON THE THE DRIVER SINCE THE LIGHTING PATTERN IS NO LONGER CONSISTENT ACROSS THE FRONT OF THE CAR. I WOULD LIKE SOME HELP IN GETTING GM TO ACKNOWLEDGE THIS ISSUE AND CORRECT IT SINCE THEY ARE TELLING ME THAT ONCE MY WARRANTY EXPIRES IN MAY, THEY ARE NO LONGER RESPONSIBLE",
        "vin": "2G4GT5GX7F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "02/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS HID HEADLIGHT ASSEMBLIES THAT HAVE CONSTANT ISSUES WITH CONDENSATION/WATER ENTERING THE HOUSING AND CAUSING THE BALLAST AND BULB TO FAIL. THIS IS DUE TO A FAULTY SEAL BETWEEN THE OUTER AND INNER SHELL ASSEMBLY. THIS IS A HUGE SAFETY ISSUE, AS THE VEHICLE MAY LOOSE ALL HEADLIGHTS AND CAUSE THE DRIVER TO CRASH. THE ASSEMBLIES ARE VERY COSTLY TO REPLACE AND THE ISSUE IS VERY VERY COMMON ON ALL 2011 THOUGH 2017 REGAL AND GS MODELS WITH HID. THIS IS DANGEROUS AND SHOULD BE FIXED BY THE MANUFACTURER. NEW ASSEMBLIES WILL RESULT IN THE SAME SAFETY ISSUE IN A SHORT AMOUNT OF TIME. THIS COULD BE A DESIGN FLAW OR A MANUFACTURING FLAW... REGARDLESS, IT IS VERY DANGEROUS!",
        "vin": "2G4GT5GX2F9"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151706,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT BELT WILL NOT FASTEN. DEFECTIVE ,SO I'M WITHOUT A SEATBELT",
        "vin": "2G4GK5EX3F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/10/2018 AT 6:45 AM, 63 DEGREES FAHRENHEIT, CERTIFIED/CURRENT LPT WARRANTY/15' REGAL PREM 2/ 60,600 OD 2.0L/TURBO/AUTOMATIC TRANS, CONDITIONS-SPEED-10 MPH-STEERING STRAIGHT, BRAKE AT 100%, ENGINE PERFORMANCE ISSUES MANIFESTED DURING THE END PORTION OF THE TRIP WHILE IN DRIVE, AT IDLE, DROPPING OFF FRIEND AT HIS WORKPLACE PARKING LOT. TRIP CHARACTERISTICS-TOTAL TRIP 35 MIN AT 20 TOTAL MILES-FIRST PART OF THE TRIP AT 45 MPH FOR 15 MIN/THE MIDDLE PART OF THE TRIP AT 70 MPH FOR 12 MIN/END PORTION OF THE TRIP AT 15-25 MPH FOR 6 MIN/IDLE AT 2 MIN-ENGINE PERFORMANCE-SUDDEN ONSET OF  HIGH, ROUGH IDLE OR ENGINE HESITATION? CHARACTERISTICS SEEMED TO INCLUDE INCONSISTENT ENGINE PERFORMANCE SOUND AND FEEL FELT THROUGH THE PEDALS, THE DRIVER'S SEAT AND STEERING WHEEL, BRAKE PEDAL DEPRESSED AT 100%, IMMEDIATELY AFTER MOVING THE AUTOMATIC TRANSMISSION KNOB FROM PARK TO DRIVE, ENGINE TEMP WITHIN NORMAL PARAMETERS, GAS LEVEL 35 MILES TILL E. IN DRIVE, ACCELERATOR AT 15-20%, DROVE 35 MPH FOR 5 MILES TO A SHELL GAS PUMP, SHIFTED TO PARK, BRAKE DEPRESSED AT 100%, DEPRESSED ON/OFF ENGINE BUTTON, ENGAGED THE ELECTRONIC PARKING SYSTEM, MAX FUELED VEHICLE WITH HIGH-GRADE UNLEADED FUEL. VEHICLE SAT, UNSTARTED, FOR 15 MIN AFTER FUELING. DROVE TO THE AUTOZONE ACROSS THE STREET, 1 MILE/20 MP, EXPERIENCED A MIL COMING ON SOLID IN THE IP WHILE PARKING THE VEHICLE. OBTAINED MIL PRINTOUT READ: \"CYLINDER 4 MISFIRE DETECTED\"/\"ASE CERTIFIED MASTER TECHNICIANS HAVE SEEN THIS ISSUE ON YOUR TYPE OF VEHICLE AND THE MOST LIKELY SOLUTION IS: PERFORM ENGINE DE-CARBON PROCEDURE\"/CODE P0304.  AT PRESENT: ON START-SOLID MIL, ROUGH, HIGH IDLE AT 1500 RPMS, AFTER 1-2 MIN-MIL,TCS SOLID, ROUGH IDLE AT 1000 RPMS. DRIVABILITY AT ALL SPEEDS AFFECTED BUT LESS SO AT HIGHER SPEEDS, *SIGNIFICANT LURCH AT 15-35 MPH FEELS LIKE HARD SHIFT/INTERMITTENT. I CHANGED OIL/AIR FILTERS, DRIVEN 2 MILES SINCE PARKING AT RESIDENCE.",
        "vin": "2G4GN5EX1F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ICE BUILD UP IN DOOR JAM, WHEN DRIVING DURING SNOW STORMS THE SNOW MELTS RUNS DOWN THE CHANNELS INTO THE DOOR JAM AND THEN FREEZES UP PREVENTING THE DOOR TO OPEN.",
        "vin": "2G4GN5EX3F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2017",
        "dateOfIncident": "11/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046300,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO TURN OFF CAR AFTER I PARKED KEY WOULDN'T TURN OFF OR COME OUT OF IGNITION",
        "vin": "2G4GK5EX7F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 BUICK REGAL. WHILE STOPPED AT A TRAFFIC LIGHT, THE VEHICLE BEGAN TO PUTTER AND HESITATE WHILE ACCELERATING. THE FAILURE OCCURRED RANDOMLY. THE DEALER DIAGNOSED THAT THE ENGINE FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE CONTACT HEARD A GRINDING NOISE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "2G4GN5EX4F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2016",
        "dateOfIncident": "09/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ON TWO SEPARATE OCCASIONS, MY DASHBOARD / RADIO WENT COMPLETELY OUT...ONLY FOR A FEW BRIEF SECONDS, BUT THAT HAS ME CONCERNED NOW SEEING A COMPLAINT HAS BEEN FILED RE SIMILAR ISSUE,",
        "vin": "2G4GN5EX7F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "07/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING ALL THE DASHBOARD LIGHTS WANT OUT COMPLETELY, THE CAR DIDN'T STOP  RUNNING. I GOT HOME AND TRIED TO GET INTO THE CAR TWO HOURS LATER AND THE DOORS WOULD NOT OPEN WITH THE REMOTE,SO I USE THE KEY TO ENTER THE CAR, CLOSE THE DOOR AND THE ALARM WANT OFF AND THE DOORS LOCKED, I PRESSED DOWN ON THE BREAK AND PUSH IN ON THE START BUTTON, THE PANEL LITE UP SAID THAT THE REMOTE DOSE NOT MATCH THE CAR, I TRIED SEVERAL WAYS TO OPEN THE CAR IT DIDN'T DO ANYTHING I WAS LOCKED IN THE CAR FOR 30 MINUTES, THE SUNROOF  WINDOW WAS OPEN A LITTLE IT WAS 88 DEGREES OUTSIDE I HAD TO KICK THE THE SUNROOF  WINDOW OUT TO GET OUT OF THE CAR.  THE CAR IS NOW AT FERGUSON BRICK IN TULSA AS OF RIGHT NOW THE CAR STARTED, THEY HAVEN'T FOUND ANYTHING WRONG I BELIEVED THERE IS SOMETHING WRONG IF THEY DRIVE THE CAR AND THE LIGHTS DON'T BLACK OUT OR IT START WHEN THEY HAVE THEY ARE GOING TO SEND THAT CAR BACK HOME IN THE SAME CONDITION, THIS IS A VERY SEROUS ISSUE I COULD HAVE DEAD IN THAT CAR WITH NO AIR.",
        "vin": "2G4GN5EXXF9"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10883339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STRUCK ON THE DRIVERS SIDE BY ANOTHER VEHICLE THAT RAN A RED LIGHT WHILE I WAS GOING THROUGH AN INTERSECTION.  SIDE AIRBAGS DEPLOYED BUT EMERGENCY FUEL SHUT OFF DID NOT WORK TO SHUT OFF FUEL SUPPLY OR FUEL  IT GOT STUCK.  THIS RESULTED IN FURTHER DAMAGE AND INJURIES AS THE CAR SPUN OUT OF CONTROL AND DID NOT STOP UNTIL IT HIT A TREE.",
        "vin": "2G4GT5GX2F9"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/20/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870084,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK-UP LIGHTS - VISIBILITY LIGHTED BY BACK-UP LIGHTS  IS TERRIBLE. THE BACK-UP LIGHTS ARE VERY DIM AND DIRECTED UPWARDS INSTEAD OF BACK ONTO THE PAVEMENT AS THEY SHOULD BE. THE STOP LIGHTS ACTUALLY GIVE MORE LIGHT THAN THE BACK-UP LIGHTS. THE FIRST MONTH I HAD THE VEHICLE I HAD SEVERAL NEAR MISSES BECAUSE I COULD NOT SEE THE VEHICLES IN BACK OF ME. I CAN ACTUALLY SEE BETTER SHINING A FLASHLIGHT BEHIND ME THAN I CAN TO SEE WITH THE BACK-UP LIGHTS.    I TOOK THE CAR TO THE DEALERSHIP REQUESTING BRIGHTER BULBS TO BE INSTALLED INSSTEAD OF THE ONES THAT ARE IN THERE, AND THE DEALER SHOP MANAGER  TOLD ME THAT THEY COULD NOT DO IT BECAUSE THE SPACE INSIDE THE BACK-UP LIGHTS WOULD NOT ALLOW ENOUGH VENTILATION. AFTER INSPECTION, SHE AGREED THAT THEY WERE DIM BUT THAT IT LOOKED LIKE IT WAS A \"DESIGN FLAW\". THE HOLE IN THE BODY MADE FOR THE BACK-UP LIGHTS IS TOO SMALL.  GENERAL MOTORS NEED TO CORRECT THIS BEFORE SOMEBODY EITHER GETS RUN OVER OR RAN INTO AND SOMEONE IS SERIOUSLY INJURED.  IF THEY CANNOT CORRECT THE DEFECT THEN THEY NEED TO BE FORCED TO INSTALL SENSORS TO DETECT SOMETHING OR SOMEONE BEHIND YOU.  I COMPLAINED TO GENERAL MOTORS CUSTOMER SERVICE AND THEY THEY SAID THAT THEY SPOKE TO THE DEALERSHIP IN DECATUR, IL WHERE I TOOK IT, AND THAT THEY SAID THE LIGHTS WERE OPERATING AS DESIGNED. REALLY? THEY WERE DESIGNED TO BE TOO DIM?  THEY REFUSED TO FIX THE PROBLEM. THEY ALSO SAID IF I ADDED AN ADDITIONAL BACK-UP LIGHT THAT IT WOULD VOID THE WARRANTY.  THIS IS A CATCH-22 SITUATION THAT IS DESTINED FOR A BAD COLLISION OR WORSE AND SOMEBODY IS INJURED OR KILLED.  SEVERAL TIMES I ALMOST RAN INTO ANOTHER CAR BECAUSE THERE WAS NOT ENOUGH LIGHT TO SEE THEM. THE BRAKE LIGHTS ACTUALLY GAVE MORE LIGHT THEN THE BACK-UP LIGHTS.  EACH SEVERAL TIMES I WAS BACKING UP IN A PARKING AREA AND THERE WAS A CAR RIGHT BEHIND ME. LUCKILY MY WIFE LOOKED OUT THE WINDOW TO HELP ME.",
        "vin": "2G4GV5EK7F9"
    },
    {
        "components": "POWER TRAIN,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "05/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852441,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PIRELLI TIRES FROM GM FACTORY ARE SEPARATING  WHICH I HAVE TRIED FOR OVER 6 MONTHS TO HAVE THEM REPLACED SEE ATTACHED DOCUMENT  STABILITRAK AND TRACTION CONTROL WERE DISSABLED DUE TO TIRE DEFECT IN ADDITION THERE IS A TRANSMISSION LEAK AND LIGHT",
        "vin": "2G4GT5GX4F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2015",
        "dateOfIncident": "09/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED I WAS DRIVING DOWN THE ROAD I HEARD A VERY LARGE POP I LOOKED UNDER THE COVER OF THE SUNROOF AND THERE WAS A LARGE HOLE RIGHT IN THE MIDDLE. GLASS FELL THROUGH WHEN I OPENED UP THE COVER. NOTHING HIT IT THERE WERE NO CRACKS IN IT  EXPLODED FOR NO REASON.",
        "vin": "2G4GP5EX3F9"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "06/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE VEHICLE ON 2/28/2015 FROM RICK HENDRICK BUICK GMC IN DULUTH GA. AROUND THE BEGINNING OF JUNE 2015 MY AIR VENT ON THE DRIVE SIDE WAS COMING OUT OF THE DASHBOARD.  I TOOK MY VEHICLE TO THE DEALER ON 06/10/2015.  THEY SAID THEY HAD TO ORDER A NEW ONE.  I TOOK THE CAR BACK TO THE DEALER ON 6/13/2015 TO GET THE VENT REPLACED.  SINCE THEN THERE HAS BEEN A VERY STRONG ORDOR(SMELL) COMING FROM THE VENTS.  IT SMELLS LIKE A STRONG FINGER NAIL POLISH.  SOMETIMES THE SMELL GETS WAY TO STRONG AND I HAVE TO ROLL THE WINDOWS DOWN.  THE SMELL HAPPENS AT RANDOM TIMES, AT DIFFERENT PLACES, AND IT ONLY LASTS FOR ABOUT 20 SECONDS EACH TIME IT HAPPENS.  SOMETIMES IT HAPPENS MULTIPLE TIMES WHILE DRIVING TO WORK OR LONG DISTANCES.  I TOOK MY CAR TO THE DEALER ON 8/8/2015 AND THEY LOOKED UNDER THE CAR, CABIN FILTER AND FOR LEAKS.  THEY TOOK THE VEHICLE FOR A 10 MINUTE MAX TEST DRIVE AND COULD NOT DUPLICATE THE SMELL.  I CALLED THE GM BUICK EXECUTIVE OFFICE AT 866-636-2273 ON 8/11/2015 AT 5:44PM AND FILED A COMPLAINT ABOUT THE SMELL.  THEY STATED I WOULD GET A CALL FROM THE CUSTOMER SERVICE MANAGER AT THE DEALER WITHIN 2 BUSINESS DAYS.  ON 8/19/2015 AT 5:31PM AND WAS TOLD I HAD TO SPEAK WITH MY CASE WORKER, WAS TRANSFERRED TO A VOICE MAIL, AND LEFT A VOICE MAIL. I STILL TO THIS DATE HAVE NOT RECEIVED A PHONE CALL.  ALSO THE DEFROSTER IS NOT WORKING ON MY CAR.  I HAVE TURNED IT UP TO 78 DEGREES ON FULL BLAST AND HAD TO KEEP IT ON DURING MY ENTIRE TRIP TO WORK JUST TO KEEP THE FROST FROM FORMING ON MY WINDSHIELD AND BLOCKING MY VIEW, WHICH COULD CAUSE ME TO CRASH.  IT HAPPENS ON A REGULAR BASIS EITHER IN THE MORNING OR AT NIGHT.  ALL MY CARS I HAVE OWNED HAVE NEVER HAD THIS ISSUE; WHERE I HAVE TO KEEP THE DEFROSTER RUNNING DURING AN ENTIRE 30 MINUTE DRIVE.",
        "vin": "2G4GN5EX3F9"
    }
]