[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "04/02/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "In regards to my electrical system -  Issue #1 - once I place the car in park the key won't turn all the way back to come out of the ignition switch. Most often I have to take the care out of park and back or jam the car into park for it to turn all the way to get the key out. Issue #2 -  while sitting at a light my car tend to shake as if it's about to cut off. On a couple of times the Service Stabili Trak light, engine light, traction control and two other tire lights all come on and I seem to lose power when I get on the gas. By the time I get it to the shop they don't find the code that sets off these lights.",
        "vin": "2G1FB1E32F9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "10/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445916,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The key will not come out of ignition once car is in park. In the event of an emergency, driver no longer has access to keys, driver is unable to leave car, battery drains (electric issues are already an issue that GMC will not address) and in the event driver is inexperienced at mechanics- this could lead to multifactor injuries.  Issue has been reported in other make/models for YEARS, GMC refuses to address issue.  In order to bypass this issue, owners must take apart steering column, release the Anti-Theft wire that enters the seliniod. Dealerships charge hundreds of dollars, sometimes never addressing the issue, to correct this problem. This key drains the electrical system, which will essentially cause complete failure to the car or a fire- which are happening more and more.  A parasitic battery drain occurs due to this issue, resulting in consumers attaching trickle charging units (recommended by dealers). Instead of correcting the anti-theft wiring issues along with the switch blade key fob, a single key was issued along with the defective key fob and dealerships are asking owners to replace their \"shifting units\" to correct the issue of the key not coming out of the ignition. This is a safety issue that will lead to death; a car fire, a home emergency, a mechanical necessity require immediate need for keys, an internal combustion, a car parked in neutral or a car left running to avoid the hassle of not getting the keys out of the ignition.",
        "vin": "2G1FF1E3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443378,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Chevrolet Camaro. The contact stated while driving 35 MPH, the right turn signal was engaged and made an abnormal ticking sound. The contact also stated that the radio inadvertently made a loud popping electrical sound and the instrument panel screen turned off. There were no warning lights illuminated. The dealer was not notified of the failure. The contact stated that the failure had been reoccurring while driving. The manufacturer was notified of the failure and advised the contact that they would follow up with NHTSA. The vehicle was not diagnosed or repaired. The approximate failure mileage was 59,500.",
        "vin": "2G1FB1E3XF9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2021",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Component unknown, available for inspection. I have not had the vehicle inspected by anyone. No warning lamps, messages prior to situation. This started happening a year after purchasing in 2017.   Problem: After driving the vehicle, arriving at the destination, putting the car in park, turning the ignition off, the key will not turn all the way left so the key can be removed. The key gets stuck at that point. I try wiggling the key, push the key inward and left and right toward the steering column, apply the brake turn the key to the right 2x without actually turning the engine on then take the car out of park then put it back in park. Some times it works with one try but on average I do this about 3-5 times and then the key releases.",
        "vin": "2G1FF1E30F9"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435367,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the SECOND time that my \"Serivce Stabilitrak\"  along with the traction light has gone off and the engine light blinks constantly, within less than a 6 month period.  I paid almost $900, with a dealership coupon, at Grieco Chervolet in Fort Lauderdale, Florida, for the exact same problem, less than 6 months ago; now the same issue occurred today, on my way to work. Uncontrollable shaking and speed. I see LOTS of complaints for this issue on this website, so I am NOT sure how there is NOT a safety recall for this vehicle.  No one seems to take this concern seriously, until deaths are reported, I suppose. Shameful!  This car is going to cause an injury or fatality, if some agency does not look into this concern, that many Chervy Camaro owners, are reporting.",
        "vin": "2G1FK1EJ8F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "03/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "so i had a the flip key i purchased my car in the beginning of 2019 on feb 28 2019 i was out with my fiancé and the key flicked the ignition off the car lost all power all steering and it was winter the car lost control we ended up on top of a 5 foot snow bank witch we hit hard it tore my whole front end off it was like 8000 $ in damage due to this danger and my car now has an accident report witch also caused my insurance to go up i have since gotten the new key made but it doesn’t change the fact i paid a lot of money for this car that now has an accident and repairs done to it that never is the same again … our lives were put at risk and my insurance went through the roof for at fault claim … what can be done about this i’m not impressed i also asked if there was any recalls on my car and was told no i complained about the key and they made me a normal new one i still have the fob that had the flick key in it but they took the key thank god i want to know what steps i can take to deal with this i drove the car home with the front end in the trunk and prices hanging i never contacted the police cause there was no other driver involved my car was mint now it’s been back more then 3 times to the shop and they give it back and the clear coat peels off now they are saying they aren’t touching my car anymore this has caused me a lot of headache i have been dealing with it all through the pandemic and had to pay a deductible of 500$ well i was off work  and it has just added to my stress and depression i want to just give up on the car i was just made aware that this key was a recall and a lawsuit just happened over it and when i looked it says the deadline was april 2021 there just be somthing that can be done this is unacceptable if we were on a highway we would have deffinetly been injured or worse",
        "vin": "2G1FB1E38F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/11/2021",
        "dateOfIncident": "06/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420628,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the highway and my rear bumper cover just ripped off on the driver side my sidemarker light went flying into traffic and my bumper was hanging on because of my license plate it was dragging on the ground by the license plate when it came off my car pulled to the left so bad that I thought my suspension system had given out I pulled over and found my bumper cover destroyed so I Called my insurance company and they said it sounds like a maintenance issue and they will NOT cover it nor is it insurance I pay for full coverage collision and comprehensive now I'm stuck with a bill that is ridiculously high",
        "vin": "2g1fd1e37f9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A STOP LIGHT AT A BUSY INTERSECTION. ONCE TRAFFIC WAS CLEAR, I MADE A RIGHT TURN INTO THE RIGHT LANE. I BEGAN TO PICK UP SPEED COMING OUT OF THE TURN AND THE ENGINE BEGAN TO REV. BEFORE IT COULD REACH 1000 RPM, THE ENGINE SHUT OFF COMPLETELY. I WAS ABLE TO COAST TO PARKING LOT. THE POWER STEERING HAD DISENGAGED AS WELL SO TURNING BECAME VERY HARD. THERE WAS NO NOTICABLE ISSUES AS I HAD DRIVEN EARLIER THAT DAY. GAS TANK WAS HALF FULL.",
        "vin": "2G1FB1E39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2021",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUTS OFF WHILE DRIVING IT'S A SAFETY HAZARD FROM DIFFERENT REVIEWS I HAVE READ IT HAS TO DO WITH THE KEY MODULE. BUT IT SHUTS OFF RANDOMLY WHILE DRIVING",
        "vin": "2G1FB1E37F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE 2015 CAMARO THE MYLINK/RADIO SHUTS DOWN AND WILL NOT PLAY AND THE HEADLIGHTS AND INSIDE LIGHTING GOES DIM AND DASHBOARD GOES DARK UNTIL THE CAR IS CUT OFF AND RESTARTED. DURING THIS THE THE BACKUP CAMERA ALSO DOES NOT WORK.  THIS HAPPENS EVERY TIME THE CAR IS DRIVEN. WE ARE SCARED TO DRIVE THE CAR ON LONG TRIPS. THE MILEAGE IS 17,553.   UNLESS THIS IS TAKEN CARE OF THIS WILL BE OUR LAST GM PURCHASE.",
        "vin": "2G1FF1E33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404510,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RADIO HAS BEEN CUTTING ON AND OFF AND WILL SHUT OFF IF I PRESS THE BREAKS, TURN ON BRIGHT LIGHTS, SHUT THE DOOR, OR ANY JOLTING MOVEMENTS. IT WON'T PLAY THE BLINKER SOUND EITHER IF THE RADIO IS CUT OFF. SOMETIMES IT WILL MAKE A LOUD POP OR SCRATCH NOISE. IT WILL ALSO FLASH ON AND OFF REPEATEDLY AND THAT IS DISTRACTING AT NIGHT. I'VE LOOKED INTO IT AND OTHERS HAVE THESE PROBLEMS.",
        "vin": "2G1FB1E36F9"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11403877,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS HIT FROM BEHIND, SPUN  ON  HIGHWAY AND ULTIMATELY CRASHED HEAD ON INTO THE MEDIAN. FRONT AIRBAGS DID NOT DEPLOY. BOTH DRIVER AND PASSENGER HIT THEIR HEADS ON THE DASH AND STEERING WHEEL.",
        "vin": "2G1FF3D31F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OFTEN, THE KEY GETS STUCK IN THE IGNITION WHEN I PUT THE CAR INTO PARK.  I HAVE TO TURN THE CAR BACK ON, PUT THE CAR INTO PARK AND DRIVE BACK AND FORTH A FEW TIMES, ATTEMPTING TO GET THE KEY OUT. SOMETIMES THE KEY COMES OUT AFTER THE SECOND ATTEMPT OF DRIVING BACK AND FORTH IN THE PARKING SPOT FROM DRIVE TO PARK AND  SOMETIMES IT TAKES MORE ATTEMPTS. I SEE MANY OTHER PEOPLE HAVE THIS CONCERN. I ONLY HAVE 36, 216 MILES ON THIS CAR",
        "vin": "2G1FK1EJ8F9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403250,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAMARO BEGAN SHAKING VIOLENTLY WHEN THE CAR WAS STATIONARY. I THOUGHT THAT MAYBE THE CAR WAS COLD DUE TO ME NOT REALLY DRIVING DURING COVID,SO AFTER LETTING THE VEHICLE WARM UP, I DROVE AWAY. AS I DROVE DOWN MY STREET, THE TRANSMISSION LIGHT, AS WELL AS ALL OF THE TRACTION, ELECTRONIC STABILITY CONTROL LIGHTS CAME ON. WHILE CONTINUING TO DRIVE, THE CAR BEGAN TO MAKE HARD JERKING MOTIONS. I SEE THAT THERE ARE MANY COMPLAINTS FOR THE ELECTRONIC STABILITY CONTROL, ELECTRICAL AND POWER TRAIN COMPLAINTS ON THE NHTSA WEBSITE DEALING WITH THIS SAME CONCERN (AS WELL AS THE KEY GETTING STUCK IN THE IGNITION WHICH IS ALSO A COMPLAINT. I WANT IT DOCUMENTED JUST IN CASE AN ACCIDENT, OR GOD FORBIDS A FATALITY HAPPENS, THEY WILL HAVE BEEN NOTIFIED PRIOR. THIS NEEDS TO BE RECALLED. PLEASE SHARE WITH THE MANUFACTURER AND/OR CHEVROLET",
        "vin": "2G1FK1EJ8F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398943,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED WHILE DRIVING 30 MPH, THE VEHICLE STALLED. THE CONTACT RESTARTED THE VEHICLE AND DROVE BACK HOME. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO M.J. SULLIVAN CHEVROLET BUICK (452 BROAD ST A, NEW LONDON, CT 06320) HOWEVER, THE MECHANIC WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS INFORMED OF THE FAILURE HOWEVER, NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS APPROXIMATELY 21,000.  *BF",
        "vin": "2G1FF1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398179,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IT DOESN'T MATTER WHETHER THE CAR IS MOVING OR NOT MOVING THE RADIO WILL NOT COME ON THE HVAC SYSTEM LIGHTS FLASH AND THE BLINKERS DO NOT MAKE A SOUND BUT THEY JUST LAST TWO. ALSO THE KEY GETS STUCK IN THE IGNITION TURNED OFF AND TRYING TO PULL OUT THE KEY ANOTHER PROBLEM IS THE PASSENGER SEAT WILL NOT MOVE FORWARD OR BACKWARDS SOMETHING IS HAPPENED TO THE THE TRACK SYSTEM OF THE LETTER",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2021",
        "dateOfIncident": "02/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY BECOMES STUCK IN IGNITION AFTER TURNING OFF, PUTTING IN PARK AND CANNOT BE TAKEN OUT",
        "vin": "2G1FD1E3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394689,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE STEREO SYSTEM WOULD EMIT AN ABNORMAL, POPPING SOUND WHICH CAUSED THE AUDIBLE FEATURES TO CEASE OPERATION, INCLUDING THE TURN SIGNALS. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND STATED THAT THEY WERE AWARE OF SIMILAR FAILURES. THE MANUFACTURER OFFERED NO FURTHER ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 93,000.",
        "vin": "2G1FB1E34F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389933,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY GETS STUCK IN THE IGNITION. I HAVE TO TURN THE ENGINE BACK ON AND PUT THE CAR IN DRIVE, AND THEN PARK AND CONTINUE DOING THAT PROCESS REPEATEDLY UNTIL THE IGNITION UNLOCKS AND FREES THE KEY. THIS HAPPENS ALMOST EVERY DAY.",
        "vin": "2G1FK1EJ1F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389331,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION KEY WON'T COME OUT AFTER PUTTING THE VEHICLE IN PARK. IT STOPS AT THE ACC POSITION. ONE TIME AFTER A FEW MINUTES IT RELEASED AND IT TURNED FROM ACC TO OFF AND CAME OUT. I HAVE TRIED EVERYTHING, PUTTING IT IN AND OUT OF PARK, RESTARTING THE ENGINE, TURNING THE KEY ON AND TO ACC AND NOTHING WORKS, THEN IT DOES. THERE ARE THOUSANDS OF THE SAME COMPLAINTS ALL OVER THE INTERNET INCLUDING THIS NHTSA WEBSITE.. GM NEED TO FIX THIS FAULT FOR FREE AND RECALL ALL THEIR FAULTY VEHICLES ASAP.",
        "vin": "2G1FK1EJ6F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "01/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 1 MONTH AGO, KEY STARTED TO GET STUCK IN IGNITION AFTER PARKING AND TURNING OFF ENGINE. BECAME MORE FREQUENT WHERE IT WOULDN'T COME OUT UNTIL I FOUND OUT THAT THE PROBLEM THAT IS CAUSING THE KEY TO GET STUCK, IS IGNITION SWITCH RELATED. SHOWED ME A WAY WHAT TO DO AND GET THE KEYS OUT. NOW WHEN I PUT IT IN PARK, I HAVE TO CLICK THAT BUTTON ON THE SHIFTER A FEW TIMES UNTIL I HEAR A CLICKING NOISE FROM THE DASH BETWEEN STEERING HEEL AND THE SPEDOMETER CLOSE TO IGNITION. I TURN VEHICLE OFF. BUT THAT IS THE ONLY WAY TO REMOVE THE KEYS. YESTERDAY HAD TO REPLACE BATTERY. IT WENT COMPLETELY DEAD W/O ANY WARNING. WENT BACK TO AUTOZONE TO HAVE THE BRAND NEW BATTERY TESTED AND THE RESULT OF THAT WAS AS FOLLOWED. BATTERY AND ALTERNATOR CHECKED OUT FINE WITH GOOD READINGS BUT STARTER IS NOT EVEN READING AT ALL. ABSOLUTELY NOT GIVING ANY REDING AT ALL! BOTTOM LINE: HAVE TO REPLACE THE STARTER. MY VEHICLE IS A 2015 AND I HAVE 46,254 MI ON IT. THE AVERAGE LIFE SPAN OF STARTER RANGE 100K - 150K. ALREADY WENT TO THE DEALERSHIP WHERE THE CAR WAS PURCHASED BUT WAS TOLD IT COULD NOT HAVE ANYTHING TO DO WITH THE IGNITION SWITCH. WRONG !!!   P.S. CAR WAS STATIONARY IN PARKING LOT OR DRIVEWAY IN EVERY SINGLE INCIDENT. THANK GOD! AFTER READING UP ON THIS ONLINE, AFRAID OF VEHICLE TO TURN OFF WITHOUT ANY WARNING WHILE DRIVING AND LOSING ALL CONTROL OF VEHICLE. WAS TOLD THAT STARTER IS WHAT KILLED MY BATTERY OVER NIGHT WITHOUT ANY WARNINGS. AND YES, I DO FLIP THROUGH ALL MY SETTING DAILY WHEN DRIVING CHECKING TIRE PRESSURE, OIL ETC. BATTERY NEVER DISPLAYED AS WEAK NOR ENGINE LIGHT SHOWING.",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2021",
        "dateOfIncident": "12/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY GETS STUCK IN THE IGNITION AT RANDOM, TOOK IT TO THE DEALERSHIP AND THEY COULD NOT RECREATE THE ISSUE, ALSO THE STEERING WHEEL IS SQUEAKY AND THE STEERING WHEEL FLUID IS FULL. THE KEY GETS STUCK AFTER THE VEHICLE IS PARKED AND TURNED OFF.",
        "vin": "2G1FB1E36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S DAUGHTER OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS DRIVING AT VARIOUS SPEED, THE LIGHTS ON INSTRUMENT PANEL WERE FLICKERING INTERMITTENTLY. IN ADDITION, THE HAZARD LIGHTS AND TURN SIGNAL LIGHTS WERE MALFUNCTION INDEPENDNETLY AND WHEN THE CONTACT'S DAUGHTER ATTEMPTED TO OPERATE THE LIGHTS, THE LIGHTS FAILED TO OPERATE AS DESIGNED. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDE THE CONTACT A CASE NUMBER. THE APPROXIMATE FAILURE MILEAGE WAS 72,085.",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374824,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY MY RADIO AND ELECTRICAL SOFTWARE STARTED FLICKERING ON AND OFF INVOLUNTARILY WHILE DRIVING. WHEN I TURN IT OFF IT KEEPS MAKING A STRANGE SOS NOISE.",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373205,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY CONTINUOUSLY GETS STUCK WHEN IN PARK.  HAD TO CALL LOCKSMITHS, MECHANICS AND DONE SEVERAL THINGS WITH NO RESOLUTION.",
        "vin": "2G1FB1E38F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT AFTER TURNING OFF THE VEHICLE, THE KEY FAILED TO RELEASE FROM THE IGNITION SWITCH. THE KEY REMAINED CEASED IN THE IGNITION IN THE AUXILIARY POSITION. THE CONTACT WAIT FOR A FEW MINUTES AND THE CONTACT WAS ABLE TO RELEASE THE KEY FROM THE IGNITION SWITCH. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO BE DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 54,000.",
        "vin": "2G1FB1E38F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY IS STUCK IN IGNITION AFTER CAR TURNED OFF",
        "vin": "2G1FF3D37F9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "04/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED W THE CAR POPPING OUT OF 2ND. DRIVING, THEN SUDDENLY IN NEUTRAL. OBVIOUSLY, NOT SAFE IN TRAFFIC OR IN ATTEMPTING TO ACCELERATE. SOON IT WOULD GRIND WHEN GOING INTO 2ND. I FOUND IT WOULD GO INTO GEAR BETTER IF I 'GUNNED' IT A BIT. BUT, THEN, I'M RISKING GOING TOO FAST UNEXPECTEDLY, AND CAN'T BE GOOD ON THE MOTOR. BEFORE TOO LONG, IT IS BASICALLY IMPOSSIBLE TO GO INTO 2ND, EITHER UP (1-2) OR DOWN (3-2). NOW, I JUST SKIP 2ND. BUT, THIS ISN'T GOOD FOR MOTOR!! ALSO, HAVING TO REV HIGH IN 1ST FOR A SMOOTHER JUMP TO 3RD ISN'T GOOD. SLOWING FOR TURNS, THE MOTOR BOGS DOWN, SOMETIMES STALLS!!! DANGEROUS WITH SOMEONE BEHIND ME! LOOKED UP ISSUE, SEEMS TO BE VERY COMMON PROBLEM. TAKEN TO SHOP 3X, CAN'T REPLICATE OR PINPOINT PROBLEM. I REPLICATE IT EVERY DAY!! DEALER ADVICE IS VERY COSTLY TRANSMISSION WORK! IF THIS IS SO COMMON, ISN'T THIS A DESIGN FLAW?? IT SEEMS TO ME A POTENTIALLY VERY DANGEROUS DESIGN FLAW. SOME RESEARCH SUGGESTS THERE IS A SIMPLE ADJUSTMENT THAT CAN BE DONE, THRU THE GEAR SHIFT COVER?! BUT, DEALER NOR AUTO SHOP INTERESTED IN 'INTERNET EASY FIX'. (NOT ENOUGH CASH IN POCKET??) AT A LOSS, I DON'T WANT COSTLY WORK DONE ON A TRANS, WHEN NOT NEEDED. BUT, IT'S CLEARLY GOING TO NEED THE WORK IF I CAN'T GET HELP SOON. NEED CHEVY TO BE HONEST ABOUT THIS CLEARLY COMMON ISSUE, RECOGNIZE THE PROBLEM RATHER THAN DENY! RECALL FOR THE WORK. AND, STOP PLAYING GAMES. PLEASE LOOK INTO THIS. WE SHOULDN'T HAVE ISSUES STRAIGHT OFF THE LOT AND/ OR ON-GOING SOON AFTER AND FOREVERMORE.",
        "vin": "2G1FA1E30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, HE WOULD HEAR AN ABNORMAL POPPING SOUND EMIT FROM HIS SPEAKERS. ONCE THE NOISE STARTED, THE SPEAKERS WOULD GO SILENT WHICH THEN RENDERED OTHER ELECTRICAL FEATURES SUCH AS THE TURN SIGNALS AND HAZARD LIGHTS TO NOT OPERATE AS NEEDED. IN ORDER TO CORRECT THE FAILURE, THE CONTACT WOULD HAVE TO DISCONNECT THE BATTERY FOR A FEW MINUTES, RE-INSTALL AND RESTART THE VEHICLE. THE CONTACT THEN STATED THAT THE FAILURE WOULD RECUR SOON AFTER THE RESET. THE CONTACT CALLED HENDERSON CHEVROLET BUICK GMC (2746 US-41 NORTH, HENDERSON, KY 42420) WHERE THEY INFORMED HIM THAT THEY WERE UNAWARE OF THE FAILURE AND THAT THERE WERE NO RECALLS ON THE VEHICLE. THE MANUFACTURER WAS THEN NOTIFIED OF THE FAILURE AND THE CONTACT WAS GIVEN A CLAIM NUMBER. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 49,000.",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343865,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT RANDOM, THE KEY DOES NOT COME OUT OF THE IGNITION. IT HAPPENS FOR NO SPECIFIC REASON, THE STEERING WHEEL IS STRAIGHT WHEN I SHUT OF THE CAR, IT IS NOT PARKED ON A HILL. THE KEY JUST WON'T COME OUT. I TOOK IT TO A CHEVY DEALER, BUT THEY COULD NOT GET THE KEY TO NOT COME OUT WHEN THEY HAD THE CAR, WHICH WAS AN 1 1/2 HOURS. I WAS CHARGED $130 EVEN THOUGH THEY DIDN'T FIX ANYTHING. THEY WANTED ME TO LEAVE THE VEHICLE WITH THEM FOR A DAY, CHARGE ME $400, TO SEE IF THEY COULD FIX IT. MY FIX WAS TO WATCH A U TUBE VIDEO OF A MAN TAKING APART THE STEERING COLUMN AND UNHOOKING A PLUG, THEREFOR YOU THEN WOULD BE ABLE TO PULL OUT YOUR KEY. I DID THAT, MY KEY NO LONGER DOES NOT COME OUT. BUT UNSURE IF THAT IS THE BEST THING TO DO, OR IF IT IS EFFECTING SOME OTHER PART OF MY CAR BADLY. APPRECIATE SOME HELP.",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342637,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY GETS STUCK IN THE IGNITION. I HAVE TO RESTART THE CAR, BACK IT UP, PULL IT FORWARD AND TRY TO TURN THE KEY TO STOP SO IT WILL RELEASE. USUALLY HAVE TO DO THIS SEVERAL TIMES BEFORE IT RELEASES. I DID FIND IF I TAKE THE FOB OFF AND ONLY HAVE THE IGNITION KEY ON A KEY RING IT DOESN'T HAPPEN AS OFTEN. IF I FORGET AND LEAVE THE FOB ATTACHED TO THE KEY, I HAVE ISSUES GETTING MY KEY TO RELEASE JUST ABOUT EVERY TIME.  THIS HAS BEEN ONGOING FOR SEVERAL MONTHS.",
        "vin": "2G1FF1E39F9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338718,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 CHEVY CAMERO CONVERTIBLE INTERMITTENTLY SHUTS OFF WHILE DRIVING IN TRAFFIC. ALSO, THE DASH GOES BLANK AND THE GAS PETAL DOES  NOT GET IT TO ACCELERATE. VERY DANGEROUS AND HAPPENED TODAY IN 102 DEGREES BUT ON COLDER DAYS AS WELL. SHOULD HAVE A RECALL WITH MANY ONLINE COMPLAINTS TO THIS ISSUE",
        "vin": "2G1FD3D32F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 17, 2019, I PURCHASED A CERTIFIED PRE-OWNED 2015 CHEVROLET CAMARO FROM CHAPMAN FORD OF HORSHAM. THE CERTIFIED PRE-OWNED CHEVROLET CAMARO THAT I PURCHASED IS DEFECTIVE AND DOES NOT CONFORM TO THE MANUFACTURER AND DEALER EXPRESS AND IMPLIED WARRANTIES. THE VEHICLE IS CURRENTLY LOCATED AT CHAPMAN CHEVROLET IN PHILADELPHIA DUE TO THE VEHICLE SUDDENLY SHUTTING OFF WITHOUT WARNING WHILE  MY HUSBAND WAS DRIVING IN TRAFFIC ON THE HIGHWAY. THE TECHNICIAN WHO DIAGNOSED THE  PROBLEM DETERMINED THAT THE CAUSE WAS DUE TO A LARGE PRE-EXISTING WATER LEAK FROM A HOSE DETACHING FROM THE SUNROOF THAT IS LOCATED IN THE TRUNK CORRODING THE WIRING AND CAUSING ELECTRICAL SYSTEM DAMAGE THAT EXISTED PRIOR TO MY PURCHASE OF THE VEHICLE. WHEN I PURCHASED THE VEHICLE, THE MILEAGE WAS 29,883. THE CURRENT ODOMETER READING OF THE VEHICLE IS LESS THAN 34,000 MILES. THIS IS CLEARLY A DESIGN AND SAFETY DEFECT THAT ENDANGERED MY HUSBAND'S LIFE, AS WELL AS MINE, AND COULD HAVE  RESULTED IN THE CAR CATCHING ON FIRE OR CAUSING A CRASH. THIS DEFECT OF THE CAR HAS SUBSTANTIALLY IMPACTED MY ABILITY TO USE THE VEHICLE AND ITS VALUE. THE DEFECT HAS ALSO RENDERED THE VEHICLE UNSAFE FOR USE. WE HAVE BEEN TOLD THAT ONCE THE VEHICLE IS REPAIRED THE HOSE LOCATED IN THE TRUNK CAN DETACH AGAIN WITHOUT US KNOWING AND WATER WOULD BE ABLE TO LEAK INTO THE ELECTRICAL SYSTEM. HERE IS A LINK TO THE DIAGNOSIS VIDEO:    HTTPS://CHAPMANFORDHORSHAM.UNOTIFI.COM/PIC_WATCHVIDEO.PHP?VID=B76E24CC-5E35-4E45-9C4C-646F092D7729&DID=6C330823-C29E-6895-19EA-5A538F785D5A",
        "vin": "2G1FF1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "05/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 2LS CHEVY CAMARO- RADIO SYSTEM FLICKERS ON AND OFF, WHILE THE CAR IS PARKED OR IN MOTION. WHEN IT SHUTS OFF THE SPEAKERS POP, AND NO AUDIO (EVEN DOOR CHIMES AND TURN SIGNALS) CAN BE HEARD AT ALL. THIS IS A KNOWN ISSUE (GOOGLE IT) AND CHEVY REFUSES TO ISSUE A RECALL. THIS IS A SAFETY HAZARD AND IS VERY DISTRACTING WHEN DRIVING. I'M SOME CASES, THE ENTIRE CLIMATE CONTROL DOES NOT WORK EITHER!",
        "vin": "2G1FB1E3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329685,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY IGNITION PROBLEM MY KEY ALWAYS GOT STUCK EVERYTIME I TURNED OFF VEHICLE.  *TR",
        "vin": "2G1FH1EJ2F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "06/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO KEEPS CUTTING IN AND OUT.  *TR",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329677,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "NEWLY LICENSED SON WAS DRIVING DOWN BUSY 4 LANE ROAD WHEN CAR SHUT OFF. HE WAS ABLE TO MAKE IT TO THE SIDE OF THE ROAD SAFELY EVEN THOUGH STEERING BECAME VERY HARD AND NO ACCELERATION, CAR STARTED RIGHT BACK UP, HOWEVER WE WORRY ABOUT NEXT TIME.   WE JUST PURCHASED THE CAR AT THE A LOCAL CHEVROLET DEALERSHIP. THEY GAVE US ONE KEY FOB, WE HAD TO PURCHASE A 2ND KEY. THEY WOULD ONLY MAKE A KEY AND FOB SEPARATELY. THERE IS A PROBLEM, WE BELIEVE WITH THE IGNITION SWITCH. HAVE CHECKED, IT APPEARS TO BE AN ISSUE BUT THERE IS NO RECALL. OTHER CHEVROLET VEHICLES WITH THE SAME ISSUE HAVE RECALLS, BUT THIS ONE DOES NOT?? *TR",
        "vin": "2G1FD1E34F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/01/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329354,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2015 CHEVROLET CAMARO.  THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS THE RADIO, LIGHTS, HORN, WINDOWS, DEFROSTER AND SIGNALS WOULD GO OFF AND ON.  THE CONTACT ALSO STATED THAT THE VEHICLE STALLED WITHOUT WARNING. THERE WAS ALSO, AN ABNORMAL ODOR OF BURNING WIRES DETECTED. THE CONTACT STATED THAT SHE BELIEVED THE FAILURE WAS ELECTRICAL RELATED. THE LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED, A CASE WAS OPENED BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "2G1FA1E34F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RADIO HAS BEEN TURNING OFF AND ON .THEN AFTER 2 MONTHS OF DOING THAT MY RADIO COMPLETELY SHUT OFF. WHEN EVER I PUT MY SIGNALS I'M NOT ABLE TO HEAR THEM. WHICH I BELIEVE IT'S A RISK BECAUSE I'M NOT AWARE IF I HAVE THEM ON OR NOT.  I HAVE HEARD THAT I'M NOT THE ONLY ONE WITH THIS PROBLEM. THE DEALERSHIP WON'T TAKE RESPONSIBILITY FOR THIS.  *TR",
        "vin": "2G1FB1E32F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329252,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO TURNING ON AND OFF AND MAKING A LOUD POPPING SOUND EVEN VOLUME IS TURNED TO LOWEST SETTING. EVERY TURN SIGNAL, BRAKE, BUMP, DOOR LOCK OR EVEN OPENING OR CLOSING WINDOW IT AFFECTS THE RADIO AND DASH BOARD LIGHTS THEN STARTS BLINKING AND POPPING SOUND. SOMETIMES RADIO IS OFF COMPLETELY FOR HOURS THEN LIGHTS ON THE DASHBOARD JUST KEEP BLINKING. TURN SIGNAL WORKS BUT YOU CANT HEAR ANYTHING. IT'S HARD TO DRIVE AT NIGHT COZ SOMETIMES THE DASHBOARD IS COMPLETELY DARK BARELY YOU CAN SEE YOUR SPEEDOMETER. BROUGHT TO GILROY CHEVY/GM DEALERSHIP AND HAD THEM DO DIAGNOSTICS SPENT ALMOST $300 AND THEY FOUND NOTHING AND FIXED NOTHING.  *TR",
        "vin": "2G1FB1E32F9"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR, SPEED ABOUT 45 THEN IT SLOWED DOWN TO ABOUT 20 AND THEN A SIGN CAME ON SAYING ENGINE POWER REDUCED. I WAS GOING 5 MINUTES UP THE ROAD TO A GAS STATION.  *TR",
        "vin": "2G1FB1E30F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/30/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO START MY CAR ONE DAY, AND USE THE AIR CONDITIONING (A/C). THE A/C WAS BLOWING WARM AIR, SO I TRIED MY HEATER TO SEE IF IT WORKED OKAY, AND THE HEATER WAS ALSO BLOWING WARM AIR AND WOULD NOT GET HOT. NO MATTER WHICH SETTING I TURNED MY VEHICLE ON, THE A/C WAS BLOWING WARM AIR AND THE HEATER WAS BLOWING WARM AIR.     I TOOK THE VEHICLE INTO A CHEVY DEALERSHIP, AND THEY SAID MY TEMP DOOR BROKE INTO THE ACTUATOR. THIS REPAIR ENTAILS RIPPING APART THE ENTIRE DASH, INCLUDING STEERING WHEEL, AIR BAGS, ECT. AND REMOVING THE WINDSHIELD! THE TOTAL FOR THIS COST ME $1,600 FOR A $30 PART!    DOING RESEARCH, IT APPEARS THAT OTHERS HAVE HAD THE SAME EXACT PROBLEM WITH THEIR FIFTH GEN CAMARO'S; THE TEMP DOOR BREAKS OFF AT THE CORNER WHICH MAKES IT SO THE DOOR IS NOT OPENING AND CLOSING.     I CALLED GM CUSTOMER ASSISTANCE AND THEY WERE UNABLE TO DO ANYTHING FOR ME. THEY SAID THEY WOULD OPEN UP AN INVESTIGATION TO SEE IF IT NEEDED TO BE A RECALL.     HOWEVER, FROM ALL THE PEOPLE THAT HAVE HAD THIS SAME EXACT PROBLEM, IT SHOULD BE A RECALL!  *TR",
        "vin": "2G1FJ1EW1F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES WHEN I TURNOFF THE CAR, THE KEYS DOESN'T COME OUT, I HAVE TO SEAT IN THE CAR FOR ABOUT 5MINS FOR THE IGNITION TO RELEASE KEYS, SOMETIMES IT TAKES MORE THAN 5MINS SO I HAVE TO LEAVE THE CAR OPEN AND GO BACK TO CHECK IF KEYS ARE RELEASE. WHAT HAPPENS IS THE KEY POSITION DOESN'T ALLOW ME TURN THE KEY ALL THE WAY TO THE POINT WHERE THE STEERING LOCK CLICKS AND ALLOW KEYS OUT, IT ONLY STAYS IN THE POSITION OF WHEN YOU TURN OFF YOUR AUTOMATIC TRANSMISSION CAR WHEN IT'S NOT ON PARK.",
        "vin": "2G1FD1E31F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "04/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324421,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE RKE (REMOTE KEYLESS ENTRY) TRANSMITTER ASSEMBLY FAILED. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, HIS KNEE ACCIDENTALLY BUMPED THE IGNITION KEY, MOVING THE KEY OUT OF THE RUN POSITION AND TURNING THE VEHICLE OFF. THE VEHICLE WAS TAKEN TO SNELL MOTORS LOCATED AT 1900 MADISON AVE, MANKATO, MN 56001, AND WAS DIAGNOSED. THE CONTACT WAS INFORMED THAT THE BODY CONTROL MODULE AND KEYS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE MANUFACTURER THEN INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 19E064000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS APPROXIMATELY 33,000.",
        "vin": "2G1FG1EW7F9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR NON-AGGRESSIVELY ON FLAT, CITY STREET GOING IN A STRAIGHT LINE - DIFFICULTY SHIFTING INTO 2ND GEAR / 2ND GEAR IS \"SPAT\" OUT WHEN GETTING BACK ON THE THROTTLE AFTER GIVING A POSITIVE RESPONSE TO SHIFT - REMAINS AN ISSUE OVER THE 3MO I'VE OWNED THE VEHICLE.",
        "vin": "2G1FJ1EW8F9"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2020",
        "dateOfIncident": "03/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320053,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IS MAKING A NOISE WHEN IT MAKE TURNS AND IS STIFF WHEN TURNING.  THE KEY WILL NOT COME OUT OF THE IGNITION WHEN I PUT THE CAR IN PARK.  I HAVE TO PUT IT INTO GEAR SEVERAL TIMES AND BACK INTO PARK BEFORE IT WILL COME OUT.",
        "vin": "2G1FF1E38F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/01/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME WHEN I TURN ON THE CAR (THE CAR IS NOT IN MOTION AND IS PARKED) THE RPM ACCELERATES ITSELF AND GOES BACK, STABILIZING ITSELF.",
        "vin": "2G1FB1E34F9"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "03/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER CORE FAILURE, LEAKING CAUSING WINDOWS TO NOT DEFROST RATHER BE COVERED IN A LAY OF GREY FILM",
        "vin": "2G1FG1EW9F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING THE VEHICLE THE TURN SIGNAL AUDIO WAS NO LONGER PRESENT WHEN ACTIVATING THE TURN SIGNAL IN EITHER DIRECTION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FAILURE WAS DUE TO A DEFECTIVE RADIO. THE RADIO WAS REPLACED AND THE FAILURE WAS REMEDIED. THE LOCAL DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 43,000.",
        "vin": "2G1FB1E38F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A CAMARO 2015 LS V6. I WAS DRIVING ON A HIGHWAY AT ABOUT 35MPH, I ACCELERATED AND THEN MY CAR COMPLETELY SHUT OFF. WHEN I LOOKED AT MY KEY IN THE IGNITION I SAW THAT IT HAD TURNED INTO THE OFF POSITION WHILE IN DRIVE. I KNOW GM HAS HAD MULTIPLE RECALLS DUE TO THEIR IGNITION SWITCH FOR THE FLIP-KEY FOB (RECALL IS N192223230), BUT I AM NOW HAVING THE SAME ISSUE. MY KEY IS NOT ATTACHED TO THE FOB, BUT I SHOW THE SAME SYMPTOMS. THIS IS NOW CAUSING AN INTERMITTENT CONNECTION AND THE CAR MAY STALL WHILE DRIVING DUE TO THIS ISSUE. I BELIEVE THIS IS ALSO PART OF THE IGNITION SWITCH FAILURE RECALL AND SHOULD BE INVESTIGATED.",
        "vin": "2G1FB1E36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 CAMARO - SAFETY SYSTEMS ATTACHED TO RADIO MODULE.  RADIO MODULE KEEPS GOING OUT, WHEN RADIO MODULE GOES OUT, ALL AUDIBLE WARNINGS ARE NO LONGER PRESENT, INCLUDING TURN SIGNALS, SEAT BELT NOTIFICATION FOR PASSENGERS/DRIVER.  THIS IS A KNOWN ISSUE ON SEVERAL DIFFERENT CAMARO FORUMS, AND HAS BEEN REPORTED TO CHEVY, NO ACTION HAS BEEN TAKEN TO RESOLVE THIS ISSUE.  THIS IS A SAFETY ISSUE FOR THE DRIVER AS WELL AS PASSENGERS.  ITS THE DRIVERS RESPONSIBILITY TO ENSURE SEATBELTS ARE ON, AND THE AUDIBLE NOTIFICATIONS HELP TO ENSURE THE SAFETY OF ALL PASSENGERS, IN THE EVENT THERE IS AN ERROR/MALFUNCTION IN THE ENGINE/SEAT BELT ERROR/AIRBAG ERRORS.",
        "vin": "2G1FB1E37F9"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "01/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES WHEN I ACCELERATE THE CAR HESITATES AND DOESN'T WANT TO GO.  THIS HAPPENS OFF AND ON.  ALSO, MY KEY IS GETTING HARDER TO GET OUT OF THE IGNITION.  IT'S GETTING WORSE EVERYDAY.  I'M AFRAID I WON'T BE ABLE TO GET MY KEY OUT.",
        "vin": "2G1FF1E37F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "12/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308600,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK IN IGNITION. AFTER SEVERAL ATTEMPTS OF RESTARTING MY CAR IT WILL FINALLY RELEASE. IT'S GETTING FAR WORSE AND I'M AFRAID IT WON'T COME OUT ONE OF THESE TIMES.LIGHTS FLICKER ON AND OFF THE DASH EVEN WITHOUT KEY IN IGNITION. LOUD POP THROUGH SPEAKERS AND THEN HEAT/AIR WON'T WORK. RADIO KICKS ON AND OFF. TURN SIGNAL PLAYS THROUGH SPEAKER. RADIO SCREEN WILL GO COMPLETELY BLACK AT TIMES. I ONLY HAVE 45,000 MILES ON THIS VEHICLE AND HAVE HAD THESE ONGOING ISSUES. WHEN I TOOK THE VEHICLE TO THE DEALERSHIP THEY COULDN'T FIND AN ISSUE, BUT NOW IT IS HAPPENING MORE FREQUENTLY. ATTACHED PICTURE IS SHOWING MY RADIO AND AIR LIGHTING UP WITHOUT THE KEY IN THE IGNITION. I'M AFRAID MY BATTERY IS GOING TO GO DEAD.",
        "vin": "2G1FB1E34F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO/INFO SCREEN COMES IN AND OUT OF SERVICE.  USUALLY ACCOMPANIED BY THE SOUND OF STATIC THRU THE RADIO SPEAKER.  IT ALSO AFFECT THE HEATING AND COOLING UNIT OF THE VEHICLE.  THE \"SHORT\" HAPPENS WHEN THE BRAKE PEDAL, CLUTCH, OR TURN SIGNALS ARE ACTIVATED.  THE EVENT CAN ALSO OCCUR RANDOMLY.  THE VEHICLE CAN BE STATIONARY, OR IN MOTION.  IT DOESN'T MATTER IF IT IS CITY OR HIGHWAY DRIVING.  IT ACTS LIKE A SHORT AND IS DEFINITELY NOT A FUSE PROBLEM.  MORE LIKELY SOMETHING IN A RELAY OR PROGRAMMING.  IT HAPPENS RANDOMLY, BUT THE ACTIVATION OF THE BRAKES, CLUTCH, OR TURN SIGNALS CAN SPARK THE PROBLEM.  THE INFO SCREEN IS AN INTEGRAL UNIT OF THE VEHICLE AND IT IS TIED INTO SO MANY OTHER FUNCTIONS OF THE CAR.  THERE ARE NUMEROUS RECORDS OF THE PROBLEM ON YOUTUBE AND ON CHAT LINES IN THE COMPUTER.  A POTENTIAL \"FIX\" SHOWN ON YOUTUBE DID NOT CORRECT THE PROBLEM ON MY VEHICLE.",
        "vin": "2G1FA1E34F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY GETS STUCK IN THE IGNITION PREVENTING ME FROM TURNING THE CAR OFF.  THIS OCCURS INTERMITTENTLY, BUT WHEN IT HAPPENS,  I HAVE TO RESTART MULTIPLE TIMES.  SOMETIMES PUTTING THE CAR IN REVERSE, STRAIGHTENING THE STEERING WHEEL AND PUTTING THE CAR IN DRIVE WORKS,  BUT NOT ALWAYS. THIS HAS BEEN OCCURRING FOR THE LAST MONTH...",
        "vin": "2G1FD3D37F9"
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ALMOST 5 YEARS AFTER DRIVING THE VEHICLE OFF THE LOT AND THE WARRI HAS EXPIRED MY AIRBAG LIGHT CAN'T BE REPAIRED BY THE NEARBY DEALERSHIP FOR < $400.  NO REALLY AS OF YET.  WHILE DRIVING A MONTH OFF THE LOT MY VEHICLE WAS T-BONED ON THE PASSENGER SIDE BY A HIT & RUN DRIVER. EVERY SINCE MY STEERING WHEEL VIBRATES.",
        "vin": "2G1FF3D36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "11/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO KEEPS GOING OUT RANDOMLY THUS ALSO AFFECTING MY TURN SIGNALS, HAZARDS, AND AC/HEATING.  MY AC AND OTHER LIGHTS WILL START BLINKING AND THE RADIO WILL NOT TURN BACK ON UNLESS I PARK AND TURN THE CAR COMPLETELY OFF.  THIS HAS HAPPENED WITH MANY OTHER CAMAROS, THIS IS A HAZARD AND MUST BE FIXED.",
        "vin": "2G1FB1E32F9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEREO HAS A \"SHORT\" AS DETERMINED BY MY LOCAL DEALER. THE LOCAL DEALER ALSO INFORMED ME THAT THIS IS A \"WELL KNOWN ISSUE\" FOR THIS GENERATION OF CAMAROS. THE ISSUE CAUSES THE STEREO AND ALL CONNECTED SYSTEMS TO SHORT, TURN OFF, THEN TURN BACK ON. DURING EACH CYCLE OF THIS PROCESS A LOUD POP COMES FROM THE STEREO SPEAKERS THAT IS SIMILAR TO A BALLOON POPPING IN CLOSE PROXIMITY TO AN INDIVIDUAL. CURRENTLY THIS WILL WITHER HAPPEN ONCE AFTER STARTUP WITH THE RADIO NOT TURNING BACK ON FOR THE DURATION OF THE TRIP, OR WILL HAPPEN REPEATEDLY DURING THE DURATION OF THE DRIVE.     IN THE SITUATION WHERE THE RADIO SHORTS AND STAYS OFF FOR THE REMAINDER OF THE DRIVE, NONE OF THE AUDIO WARNINGS FOR THE CAR WILL WORK WHILE STEREO IS SHORTED OUT. THIS INCLUDES BUT IS NOT LIMITED TO SEAT BELT WARNINGS, LOW FUEL WARNINGS, DOOR AJAR WARNINGS, REVERSE GEAR NOTIFICATION (MANUAL TRANSMISSION), ENGINE OVERHEAT WARNING, POWER STEERING WARNING, TRANSMISSION OVERHEAT WARNING, PARKING LAMP NOTIFICATION, HEADLAMP NOTIFICATION, PARKING BREAK WARNING, ABS WARNING, BLINKER CHIME.     THE POPPING SOUND MADE BY THE RADIO WHILE IT IS SHORTING CAN BE VERY DISTRACTING WHILE DRIVING AND THERE IS NO WAY TO TURN IT OFF. IT CAN ALSO BE UNEXPECTED AND STARTLING AND MAY CAUSE REACTIONS FROM THE DRIVER.     WHILE THE RADIO IS SHORTED OUT THE AUDIO CHIME FOR THE BLINKER DOES NOT WORK. THERE HAVE BEEN SEVERAL INSTANCES WHERE THE BLINKER'S AUDIO CHIME WAS NOT OPERATIVE FOR THE ENTIRE TIME THE VEHICLE WAS RUNNING.     IN THE MANUAL TRANSMISSION VEHICLE THE REVERSE GEAR AUDIO NOTIFICATION DOES NOT OPERATE WHEN THE RADIO IS SHORTED. THIS CAN CAUSE A DRIVER TO UNEXPECTEDLY PLACE THE VEHICLE IN REVERSE WHEN ATTEMPTING TO QUICKLY SHIFT TO 1ST GEAR. IN NORMAL OPERATION THE VEHICLE EMITS A NOTIFICATION SOUND WHEN THE VEHICLE IS PLACED INTO REVERSE ALONG WITH A R DISPLAYED ON THE GAUGE CLUSTER.",
        "vin": "2G1FA1E33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/28/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STEREO AND SOUND SYSTEM STOP WORKING COMPLETELY THIS IS RIDICULOUS THAT CHEVY REFUSES TO MAKE A RECALL WHEN THERE ARE SO MANY CASES ONLINE WITH PEOPLE HAVING THE SAME PROBLEM OF THEIRS STEREO CUTTING IN AND OUT. THIS IS THEFT. 700$ TO FIX A PROBLEM THAT ALMOST EVERY YEAR CAMARO HAS 2010-2015. RIDICULOUS.",
        "vin": "2G1FB1E32F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO, TURN SIGNALS, DISPLAY, HAZARD LIGHT GO OUT INTERMITTENTLY ( MULTIPLE TIMES PER DAY ) . LOUD ELECTRICAL POPS. REPRESENT A SAFETY ISSUE. VEHICLE CAN BE MOVING OR STATIONARY",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEYS GET STUCK IN THE IGNITION INTERMITTENTLY AND CAN'T BE REMOVED WHEN ENGINE IS OFF.  I HAVE TO RESTART OR TURN TO ON POSITION AND MOVE SHIFTER TO R N OR D AND THEN TURN OFF  THEN SHIFT TO PARK TO REMOVE!  TURNING THE WHEEL DOES NOT ALLEVIATE THIS.  I ALSO SEE SEVERAL OTHER SIMILAR COMPLAINTS.",
        "vin": "2G1FD1E39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S RADIO AND CLIMATE CONTROL FLASHES ON AND OFF AND SOMETIMES DO NOT COME ON AT ALL. TURN SIGNALS DO NOT MAKE SOUNDS WHEN IN USE. IF I USE MY BRAKES, CLUTCH, TURN SIGNAL, OR POWER WINDOWS, RADIO AND CLIMATE CONTROL GO OFF AND ON RAPIDLY. BLUETOOTH DOESN'T WORK. REGARDLESS IF THE CAR IS IN MOTION OR NOT, THIS IS A CONTINUOUS PROBLEM SINCE I PURCHASED THE VEHICLE.",
        "vin": "2G1FA1E3XF9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279473,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATER IN MY CAR STOPPED WORKING.  IT ONLY BLOWS COLD AIR, CAN  NOT GET IT TO WARM UP.  ALSO, MY AC IS FULLY CHARGED, IT WORKS BUT JUST DOESN'T GET COLD.  MY HUSBAND CHECKED MY HEATER AND IT LOOKS LIKE IT'S IN THE KNOBS.  CHECKED FUSES AND THERMOSTAT ALL GOOD.",
        "vin": "2G1FF1E37F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2015 CAMEO THE KEY WON'T COME OUT THE IGNITION WHEN THIS FIRST HAPPENED TO ME I CALLED GM JUST TO BE RUDELY TALKED TO THE SECOND TIME IT HAPPENED MY RADIO WENT OUT AND IT STOP MY HEAT AND AIR FROM WORKING WHEN I FIRST GOT THIS CAR I PURCHASED IT BRAND NEW JUST TO FIND OUT IT WAS RUSTY UNDER THE BOTTOM BUT THEY FIXED THAT AND I'VE BEEN HAVING PROBLEMS EVERY SINCE NOTHING WORKS IN MY CAR THE SEATS WON'T GO UP IN DOWN UNTIL THEY GET READY I'VE TRIED TO CONTACT GM BUT THEY WON'T RETURN MY EMAILS THIS ELECTRICAL PROBLEM IS DRIVING ME CRAZY AND I'M PAYING TO MUCH FOR THIS CAR TO MISS UP LIKE THIS I HAVE LESS THAN 70 THOUSAND MILES ON IT AND I STILL HAVE SOME KIND OF WARRANTY ON IT.",
        "vin": "2G1FF1E35F9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277940,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I TURN MY ENGINE OFF AND PARK 9/10 THE KEY GETS STUCK IN THE IGNITION. I HAVE TO SOMETIMES START MY CAR UP 2-3 TIMES AGAIN IN ORDER TO GET IT OUT.",
        "vin": "2G1FB1E31F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE VEHICLE STALLED WITHOUT WARNING NUMEROUS TIMES. THE CONTACT CALLED HERB EASLEY MOTORS (1125 CENTRAL E FWY, WICHITA, TX 76306, (940) 723-6631) AND WAS INFORMED THAT THERE WAS NO RECALL FOR THE FAILURE. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": "2G1FD1E35F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2019",
        "dateOfIncident": "10/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO COMES ON AND OFF RANDOMLY AND WHEN IT DOES THE TURN SIGNALS DON'T MAKE A SOUND.",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR NAVIGATION SCREEN WENT COMPLETELY BLACK NOTHING CAN BE SEEN ON THE SCREEN NOR HEARD THROUGH THE SPEAKERS. I TRIED REPLACING FUSES AND EVEN UNPLUGGING THE BATTERY TO RESET THE ENTIRE CAR BUT NOTHING IS WORKING TO GET MYLINK SCREEN BACK ON AND WORKING.",
        "vin": "2G1FF1E34F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255658,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST OF POWER STEERING WHEN MAKING RIGHT OR LEFT TURNS.",
        "vin": "2G1FK1EJ2F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246161,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO KEEPS GOING ON AND OFF BY IT SELF.",
        "vin": "2G1FA1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2015 CHEVY CAMARO THAT MY KEY GETS STUCK IN THE IGNITION. I HAVE HAD ISSUES OVER THE LAST TWO MONTHS WHERE THE KEY GETS STUCK IN THE IGNITION AND IT CANNOT BE REMOVED OR MY CAR HAS TO BE STARTED AND MOVED SEVERAL TIMES TO GET THE KEY OUT. I WAS TOLD MY CAR WOULD NEED A NEW SHIFTER BECAUSE OF ELECTRICAL ISSUES AND I HAD A 3 YEAR 36K WARRANTY WHEN I PURCHASED IT ( I WAS TOLD) BUT GM WOULD NOT REIMBURSE ME FOR THIS ALMOST $500 EXPENSE. I HAVE OWNED THE CAR FOR ALMOST 2 AND A HALF YEARS AND IT HAD UNDER 36K MILES WHEN THIS HAPPENED.  IF I LEFT THE KEYS IN THE CAR AND SOMEONE SAW THAT, MY CAR COULD BE STOLEN AND WHO KNOWS IF THE PERSON ENDED UP DRIVING CRAZY AND ENDED UP KILLING THEMSELVES OR SOMEONE ELSE. WOULD I BE HELD RESPONSIBLE FOR THIS BEING I HAD NO CHOICE BUT TO LEAVE THE KEYS IN IT? THERE SHOULD BE A RECALL FOR THIS ISSUE DUE TO SAFETY. I TOOK THE MONEY I HAD AND FIXED THE CAR BECAUSE IT WAS NOT SAFE TO KEEP USING THE CAR LIKE THAT. GM SHOULD BE HELD ACCOUNTABLE AND RECALL THESE CARS AND FIX THIS PROBLEM BEFORE SOMETHING BAD REALLY HAPPENS. THEY SHOULD NOT WAIT UNTIL SOMETHING DOES HAPPEN. GM CALLED ME TODAY AND SAID THEY WILL NOT REIMBURSE ME FOR THE EXPENSE. THEY NEED TO BE HELD ACCOUNTABLE FOR THIS PROBLEM. I AM NOT THE ONLY ONE WITH THIS ISSUE. GM RECALLED THE KEY FOB BECAUSE PEOPLE WERE HITTING IT WITH THEIR KNEE WHEN DRIVING SO THEY NEED TO FIX THIS PROBLEM TOO. THIS IS JUST AS BAD BECAUSE OF THE CHANCE SOMEONE CAN STEAL THE CAR WITH THE KEY STUCK IN THE IGNITION.",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "06/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. UPON STARTING THE VEHICLE, THE CHEVROLET MY LINK HOME SCREEN FAILED TO FUNCTION PROPERLY. WHEN THE FAILURE INITIALLY OCCURRED, THE SCREEN WOULD OPERATE INTERMITTENTLY WHILE THE VEHICLE WAS IN DRIVE. EVENTUALLY, THE SCREEN CEASED TO OPERATE COMPLETELY WITHOUT WARNING. THE CONTACT SPOKE WITH EDWARDS CHEVROLET DOWNTOWN (1400 3RD AVE N, BIRMINGHAM, AL 35203, 205-716-3330) AND WAS INFORMED THAT A DIAGNOSTIC WAS NEEDED TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000.",
        "vin": "2G1FD1E33F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244020,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKAYA RECALL-FOR THE LAST 2 1/2 YEARS I'VE BEEN HAVING ISSUES ON & OFF WITH MY STABILITRAK SYSTEM CAUSING MY ENGINE LIGHT TO COME ON AND CAR TO JERK WHILE THE CAR IS CHANGING GEARS. IT JERKED SO HARD THE LAST TIME IT ALMOST CAUSED ME TO HIT SOMEONE IN THE BACK. THIS ISSUES HAPPENS FOR A DAY OR 2 THEN STOPS FOR MONTHS & COMES UP AGAIN. I'VE BROUGHT IT TO GMC TWICE AND THEY COULD NOT FIGURE IT OUT BECAUSE IT STOPS BY THE TIME I BRING IT TO THEM & NO CODE SHOWS UP. THIS ISSUES STARTS WHILE IN MOTIONS & CONTINUES WHILE DRIVING REGARDLESS IF I'M ON A STREET, HIGHWAY PR TURNING. THIS ISSUES IS DEFINITELY A SAFETY HAZARD AND CAN CAUSE A BAD ACCIDENT TO HAPPEN.",
        "vin": "2G1FB1E30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WON'T RELEASE AFTER TURNING CAR OFF SO CAR IS STILL ON AND KILLS BATTERY",
        "vin": "2G1FD1E33F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/27/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235241,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION KEY WON'T TURN TO THE OFF POSITION SOMETIMES UNLESS YOU WIGGLE THE SHIFTER AND THE BUTTON ON THE SHIFTER. THE CAR WILL TURN OFF BUT YOU CAN'T REMOVE THE KEY FROM THE IGNITION UNTIL IT IS IN THE OFF POSITION.",
        "vin": "2G1FF1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235251,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKING AND POWERING THE VEHICLE OFF, THE KEY REMAINS STUCK IN THE IGNITION. I HAVE TO REPEATED POWER THE CAR ON AND OFF, RE-PLACING IT IN PARK FOR THE KEY TO FINALLY BE RELEASED... ALSO, THE RADIO OFTEN POWERS OFF AND ON, CAUSING MY DASHBOARD TO GO DARK. WHEN THIS HAPPENS, I ALSO CANNOT HEAR THE TURN SIGNAL INDICATOR WHEN MAKING A TURN. THESE ISSUES HAVE BEEN HAPPENING FOR SOME TIME NOW...FROM WHAT I HAVE READ IN THE COMPLAINTS, THIS IS AN ISSUE WITH MANY CAMARO OWNERS. WHY IS THERE NO RECALL FOR THIS?",
        "vin": "2G1FB1E31F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "06/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE KEY WOULD NOT RELEASE FROM THE IGNITION WHEN THE VEHICLE WAS PARKED AND TURNED OFF. THE CONTACT HAD TO TURN OFF AND RESTART THE ENGINE TWICE TO REMOVE THE KEY FROM THE IGNITION. THE CONTACT CALLED HONDRU CHEVROLET (2005 S MARKET ST, ELIZABETHTOWN, PA 17022, (717) 361-7776) AND WAS INFORMED THAT THEY COULD NOT ASSIST. THE CONTACT THEN CALLED REGISTER CHEVROLET (10 E MAIN ST, THOMPSONTOWN, PA 17094, (717) 788-4591) AND WAS ADVISED TO USE THE BACK UP KEY. THE CONTACT STATED THAT THE BACK UP KEY ALSO FAILED. THE VEHICLE WAS DIAGNOSED AND REPAIRED AND BUT PROBLEM HAS RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 24,600.*BF*JB",
        "vin": "2G1FD1E32F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232143,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TURN MY VEHICLE OFF THE KEYS WILL NOT COME OUT OF THE IGNITION",
        "vin": "2G1FD1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE, IT SHUT ITSELF COMPLETELY OFF. THE VEHICLE QUIT DRIVING AND I WAS UNABLE TO ACCELERATE BUT WAS ABLE TO PULL OVER. THE DASH DISPLAY WENT COMPLETELY BLANK AND IT WAS AS THOUGH THE POWER HAD BEEN COMPLETELY SHUT OFF. AT TIMES THE KEY HAS BEEN DIFFICULT TO REMOVE AFTER PARKING THE VEHICLE, BUT THIS SEEMED TO BE A DIFFERENT ISSUE. AFTER THE CAR SHUT DOWN, I PULLED OVER AND PUT THE GEAR IN PARK. I THEN REMOVED THE KEY, REINSERTED THE KEY, RESTARTED THE CAR AND IT WORKED FINE. IT WAS VERY UNSAFE FOR THE CAR TO RANDOMLY JUST QUIT DRIVING/WORKING. LUCKILY I WAS IN A RESIDENTIAL AREA WITH LITTLE TRAFFIC.",
        "vin": "2G1FF1E36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHEVROLET 1SS CAMARO 2015 KEY GETS STUCK IN THE IGNITION WHEN PUT IN PARK. THIS STARTED THE FIRST YEAR OWNED IT BUT DEALERSHIP WAS VERY HELPFUL THEY SHOWED ME THAT THE AUTOMATIC SHIFTER HAS TO PUSH FORWARD TO FEEL A CLICK. THAT WORKED UNTIL NOW. THE CAR WILL NOT RELEASE MY KEY QUITE FREQUENTLY NOW AND IT TAKES TURNING CAR ON AND OFF A FEW TIMES BEFORE IT RELEASES KEY. THIS CAN TAKE SOME TIME AND BE EMBARRASSING. OWN A NICE CAR AND HAVE THAT PROBLEM REALLY MAKES YOU LOOK BAD AND CAN CAUSE ME TO HAVE TO LEAVE KEY IN CAR SOMETIMES. THIS HAPPENS WHEN CAR IS PUT IN PARK NO MATTER WHERE I AM.",
        "vin": "2G1FH1EJ1F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229031,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KEY FOB HAS THE REPLACEMENT WHERE THE KEY WAS REMOVED FROM THE FOB AND ADDED SEPARATELY. I PURCHASED MY CAR IN DECEMBER OF 2018 AND IT HAD ONLY A FEW TIMES WHERE THE KEY WOULD GET STUCK IN THE IGNITION, AFTER RESTARTING OR MOVING THE GEAR SHIFT IT WOULD EVENTUALLY COME OUT. NOW MY KEY IS GETTING STUCK IN THE IGNITION EVERY TIME I STOP MY CAR.",
        "vin": "2G1FF3D32F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS 60TH MILES A/C STOP WORKING , EVAPORATOR  HAS A LEAK , APPARENTLY ITS VERY COMMON .",
        "vin": "2G1FG1EW1F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2015 CAMARO WITH ABOUT 31,000 MILES ON IT. I HAVE OWNED IT SINCE IT WAS NEW AND ALL MAINTENANCE HAS BEEN PERFORMED. MY SON IS THE PRIMARY DRIVER. LAST WEEK THE CAR'S ENGINE SHUT OFF FOR NO APPARENT REASON WHILE MY SON WAS DRIVING IN RUSH HOUR HIGHWAY TRAFFIC AROUND 5:00 PM. LAST NIGHT TUESDAY JUNE 25, 2019 THE SAME THING HAPPENED. IN BOTH CASES IT WAS A PRETTY SCARY EVENT AND MY SON HAD TO PUT THE CAR IN NEUTRAL AND DRIFT TO THE SIDE OF THE ROAD. ONCE STOPPED THE CAR STARTED RIGHT UP WITH NO APPARENT ISSUES. THE KEY WAS STILL IN THE ON POSITION SO HE HAD TO TURN OFF THE CAR AND THEN BACK ON AND TO START. .     WE HAVE THE NEWER KEY SYSTEM SO HE IS NOT BUMPING THE KEY WITH HIS KNEE AND TURNING OFF THE CAR. THIS ISSUE SEEMS TO BE RELATED TO THE FUEL SYSTEM SENSOR OR SOME OTHER ELECTRICAL COMPONENT FAILURE THAT JUST KILLS THE ENGINE WITHOUT WARNING. THERE ARE NO 'SERVICE ENGINE LIGHTS' ON.  THE VEHICLE WAS GOING ABOUT 50 MPH ON A STRAIGHT HIGHWAY. THE OUTSIDE TEMPERATURE WAS IN THE 80'S.     THERE ARE MANY POSTINGS ON THE INTERNET ABOUT THIS ISSUE SO I KNOW I AM NOT THE ONLY ONE HAVING THIS PROBLEM. NONE OF THE INTERNET POSTINGS HAD ANY REAL SOLUTIONS OFFERED.",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222460,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING IN THE REAR PASSENGER AREA. THE FAILURE OCCURRED EVERY TIME IT RAINED OR WHEN THE VEHICLE WAS WASHED. THE VEHICLE WAS DRIVEN TO HENDERSON CHEVROLET (240 N GIBSON RD, HENDERSON, NV 89014, (702) 208-9999), BUT THEY REFUSED TO REPAIR THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED AND WAS NO LONGER UNDER WARRANTY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "2G1FD3D30F9"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "1. MY STEERING WHEEL IS MAKING A HORRIBLE SQUEAKY NOISE EVERY TIME YOU MOVE IT THE STEERING WHEEL ESPECIALLY WHEN YOUR DRIVING OR TURNING BUT THE NOISE IS CONSTANT.  2. THE KEY IS GETTING STUCK IN THE IGNITION 2 OUT 3 TIMES I TURN OFF VEHICLE I CANNOT REMOVE KEY UNLESS I TURN ON AND OFF VEHICLE SEVERAL TIMES.",
        "vin": "2G1FD1E36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218541,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS EXITING THE FREEWAY AND CAME TO A STOP SIGN. THE FREEWAY EXIT HAS ABOUT A 30 DEGREE SLOPE OF INCLINE. I ACCELERATED AND THEN THE VEHICLE LOST POWER, I PULLED OVER AND PARKED TO INSPECT THE VEHICLE. EVERYTHING LOOKED FINE. I THEN TURNED THE CAR ON, PUT THE VEHICLE IN DRIVE AND DROVE ABOUT 10MPH. I THEN SLIGHTLY TURNED THE KEY IN THE OFF POSITION AND THE VEHICLE SHUT OFF. I CAN REPLICATE THIS ISSUE AND TURNNG THE KEY WHILE IN DRIVE DOES NOT REQUIRE MUCH FORCE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH VEHICLE PLACED IN PARK IGNITION WILL NOT RELEASE KEY. VEHICLE SHIFTER HAS TO BE RETURNED TO DRIVE AND THEN BACK TO PARK TO RELEASE KEY. THIS PROCEDURE MAY NEED TO BE REPEATED SEVERAL TIME TO RELEASE KEY.",
        "vin": "2G1FK1EJ1F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210509,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.... 2015 CHEVY CAMARO.....WHILE DRIVING MY VEHICLE DEMS LIKE IT FLOATS LEFT AND RIGHT ON THE HIGHWAY....IVE CHECKED TIRE INFACTION AND EVERYTHING IS CORRECT...IVE SPOKE WITH CERTAIN DEALERS AND MECHANIC.....AND HEY SAY ALIGNMENT...SUSPENSION...OR STEERING COMPONENTS...I TAKE VERY GOOD CARE OF Y CARS...AND THIS CAR ONLY HAS 30,000 MILES ON IT...SO CANT SEE WHY IT WOULD BE ANYTHING WITH SUSPENSION OR STEERING...BUT NO ONE WILL GIVE ME WA STRAIGHT ANSWER WITHOUT CHARGING ME $200 TO LOOK AT IT FIRST.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208307,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH THE IGNITION.  NOT ABLE TO TAKE THE KEY OUT.  THIS IS THE SAME PROBLEM THE 2010-2014 CAMEROS HAD THE RECALL.  THE CAR IS OUT IN PARK AND TURNED OFF. BUT THE IGNITION WILL NOT RELEASE THE KEY.",
        "vin": "2G1FF1E31F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO TURN OFF BY ITSELF. YOU TURN THE CAR ON AND IT CUTS OFF RANDOMLY. YOU HAVE TO REMOVE THE GROUND IT COMES BACK ON AND THEN CUTS OFF.",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KEY GETS STUCK IN THE IGNITION, RADIO DOES NOT WORK, DASH TURNS LIGHTS ON AND OFF, AIR COMPRESSOR NOT WORKING, NO COLD AIR IN MY CAR. I BOUGHT THIS CAR FROM AUTO LAKES MALL BRAND NEW AND IT'S BEEN A NIGHTMARE.",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203725,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE KEY BECAME STUCK IN THE IGNITION AND TOOK A LONG TIME TO RELEASE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "2G1FD1E3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THERE WAS AN INTERNAL ELECTRICAL MALFUNCTION THAT AFFECTED STARTING THE VEHICLE. ALSO, WHEN THE TURN SIGNALS WERE ACTIVATED, AN ABNORMAL NOISE WAS HEARD. JOE V CLAYTON CHEVROLET (327 N BRINDLEE MOUNTAIN PKWY, ARAB, AL 35016, (855) 872-7563) AND THE MANUFACTURER WERE NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 17,928.",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SOMETHING WRONG WITH THE ELECTRICAL OF THE RADIO AND A/C UNITS ON THESE MODELS. WHEN DRIVING, THE RADIO AND A/C AUTOMATICALLY SHUT OFF AND MAKES THIS LOUD POPPING SOUND THROUGH THE SPEAKERS WHETHER THE RADIO IS TURNED ON OR NOT. IT ALMOST SOUNDS LIKE SOMETHING HITTING THE CAR AND IT IS EXTREMELY DANGEROUS AND DISTRACTING TO THE DRIVER. I THOUGHT IT WAS JUST MY VEHICLE THAT THIS WAS HAPPENING TOO BUT WHEN I LOOKED ON YOU TUBE I FOUND OTHER CAMARO OWNERS WITH THE SAME MODEL HAVING THE SAME ISSUE. I CONTACTED GENERAL MOTORS BUT THEY SAID  WANTED TO ME TO PAY TO DIAGNOSE THE ISSUE WHICH MADE NO SENSE BECAUSE THEY SHOULD DO SO OUT OF CONCERN FOR THE SAFETY OF THE DRIVER AND OTHERS ON THE ROAD. AFTER TELLING ME THAT WAS MY ONLY OPTION THE CUSTOMER SERVICE AGENT TOLD ME THAT THEY DON'T EVEN DECIDE RECALLS ON THEIR VEHICLES AND THAT THEY HAVE TO BE ISSUED BY THE NHTSA",
        "vin": "2GIFA1E34F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE KEY WOULD GET STUCK IN THE IGNITION SWITCH. THE CONTACT HAD TO SHIFT INTO NEUTRAL AND RESTART THE VEHICLE TO REMOVE THE KEY. THERE WERE NO WARNING INDICATORS ILLUMINATED.  THE CONTACT SCHEDULED AN APPOINTMENT WITH JIMMY VASSER CHEVROLET (583 SOSCOL AVE, NAPA, CA 94559, (707) 255-7600) TO HAVE THE VEHICLE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 38,000.",
        "vin": "2G1FB1E34F9"
    },
    {
        "components": "STRUCTURE,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HEADED SOUTH MAKING A LEFT TURN ONTO 167TH OFF OF CICERO ( BUSY STREET) AND AN ONCOMING VEHICLE STRUCK ME ON THE PASSENGER SIDE FRONT QUARTER PANEL, THEN PUSHING MY CAR OVER THE MEDIAN AND INTO ANOTHER VEHICLE AND AFTERWARDS INTO A CURB. NONE OF MY AIRBAGS DEPLOYED AFTER BASICALLY FOUR  IMPACTS.",
        "vin": "2G1FB1E30F9"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS SERVICE BY SAME DEALER.COMPLAINED FOR YEAR.TIRE SENOR OFF WHILE IN WARRANTY.GOT NEW TIRES,DOING AGAIN.EVEN TOLD ME ICE ON ROAD IN 99 DEGREE WEATHER,STEERING WHEEL CREEDED TURN SLOW SPEED.NO ONE FOND PROBLEM.I REQUESTED LOOK AT NOW OUT WARRANTY.PAID 130.00 TOLD ME GEAR NEED CHANGE.67000.00 SHOW ROOM LOOKING CAR.COST 1500.00.I KNOW 2014 WAS RECALLED THIS PROBLEM.HELP I AM A SENIOR NEED KNOW IS IT THE BUSHING DRY AMD DIRTY OR GEAR .DEALER GUESSING.SOUND GOING OR SITTING STILL",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION KEY GETS STUCK AND WILL NOT TURN TO UNLOCK POSITION WHEN THE CAR IS PUT IN PARK. I  HAVE TO RESTART THE ENGINE AND TRY TO GET THE KEY OUT. I HAVE TO DO THIS 2-4 TIMES WHEN IT OCCURS. I DON'T DRIVE THE CAR DAILY. I SAW ON YOUTUBE THAT SOMEONE FIXED THE PROBLEM BY DISONNECTING THE WIRE TO THE SENSOR IN THE STEERING COLUMN.   HTTPS://YOUTU.BE/-ASISYQIU6O",
        "vin": "2G1FK3DJ7F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK IN IGNITION SWITCH WHEN TRYING TO TURN OFF CAR.",
        "vin": "2G1FD1E36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2019",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164366,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STUCK IN IGNITION AFTER PARKING AND TURNING OFF",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/30/2018",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HISSING SOUND IN CENTER CONSOLE / PASSENGER SIDE. MULTIPLE FORUMS SUGGEST HEATER CORE ISSUES WITH SAME DESCRIPTION. THE MAIN ISSUE THE PART IS 75$ BUT TUCKED AWAY SO TIGHTLY THE COST IS A AROUND 2000$ TO REPAIR. THIS COULD CAUSE THE CAR TO OVER HEAT QUICKLY AND DO IRREVERSIBLE DAMAGE.",
        "vin": "2G1FD1E30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2018",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163109,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY REMAINS STUCK IN IGNITION UPON PUTTING CAR IN PARK. MUST RESTART THE VEHICLE & SHIFT VEHICLE INTO DRIVE & REVERSE SEVERAL TIMES THEN BACK INTO PARK BEFORE IT WILL RELEASE",
        "vin": "2G1FD3D3XF9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK FREQUENTLY WHEN PARKED.",
        "vin": "2G1FD1E38F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "12/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE KEY WAS UNABLE TO TURN IN THE IGNITION TO START THE VEHICLE. THE DEALER (FERMAN CHEVROLET OF TAMPA, 9751 E ADAMO DR, TAMPA, FL 33619, (813) 623-2411) DIAGNOSED THAT THE SHIFTER NEEDED TO BE REPLACED. THE PART WAS ORDERED, BUT THE DEALER WAS WAITING ON GUIDELINES FROM THE MANUFACTURER. THE DEALER AND THE MANUFACTURER INDICATED THAT THE VEHICLE WAS NOT INCLUDED IN ANY ELECTRICAL SYSTEM RECALLS. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "2G1FD3D36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160719,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD BY THE DEALERSHIP THAT THE HEAT ACTUATOR HAS BROKEN AND NEEDS TO BE REPLACED. THEY STATED THAT IT WILL COST ME 200.00+ DOLLARS TO FIX.THEY TOLD ME THAT IT WILL COST THAT AMOUNT DUE TO THEM HAVING TO TAKE OUT THE WINDSHIELD AND THE DASHBOARD TO FIX IT. I TOLD THEM THAT I BOUGHT THAT CAR 2 YEARS AGO WITH 82 MILES ON THE DASH AND THAT I BOUGHT IT BECAUSE I HAVE A 1995 CAMARO THAT I HAVE NEVER HAD ANY PROBLEMS OUT OF AND THAT IT WAS WHY I CHOSE ANOTHER CAMARO.",
        "vin": "2G1FC1E33F9"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT HEAT IN THE WINTER, STARTED THIS WINTER. I ONLY HAD THE CAR 2 YEARS.",
        "vin": "2G1FC1E33F9"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160589,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS: KNOWN RECALL. NEED TO BE REPLACED BEFORE ANYTHING HAPPEN.  HEATER IS NOT WORKING AT ALL. BLOWING OUT COLD AIR.",
        "vin": "2G1FC1E33F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STICKS AND WILL NOT COME OUT OF IGNITION, MULTIPLE COMPLAINTS ARE NOTED TO BE ONLINE REGARDING THIS SAME PROBLEM. THIS HAPPENS WHEN YOU PARK YOUR CAR AND PUT IT IN PARK, AND GO TO REMOVE THE KEY AND IT DOES NOT COME OUT.  THIS HAPPENS OFTEN.  I WILL PUT  A DATE BELOW, BUT IT HAS HAPPENED MANY TIMES NOT JUST ONCE.",
        "vin": "2G1FB1E31F9"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAMARO'S ACCELERATOR STOPPED FUNCTIONING AT HIGHWAY SPEEDS IN HEAVY TRAFFIC. I HAD TO COAST TO A STOP WHILE DODGING TRAFFIC. THE ENGINE RAN, AT IDLE. I PUT IT IN PARK. I STILL COULD NOT ACCELERATE. I COULD FLOOR IT. NOTHING BUT IDLE. I TURNED OFF THE POWER AND CUT IT BACK ON AND I WAS ABLE TO ENGAGED THE ACCELERATOR TO GET OFF THE FREEWAY AND HAVE IT TOWED TO A DEALER. THIS IS ALMOST THE SAME SYMPTOMS AS THE FUNCTIONAL HACK AS DEMONSTRATED IN THE WIRED MAGAZINE \"JEEP HACK\" VIDEO. AFTER TROUBLESHOOTING IT 9 DAYS, THE DEALER GAVE ME THE FOLLOWING INFO. U100    DATA BUS: ENGINE CONTROL MODULE (ECM) A - NO COMMUNICATION  U101    DATA BUS: TRANSMISSION CONTROL MODULE (TCM) - NO COMMUNICATION  U121    DATA BUS: ANTI-LOCK BRAKE SYSTEM (ABS) CONTROL MODULE - NO COMMUNICATION  U176    DATA BUS: SUPPLEMENTARY RESTRAINT SYSTEM (SRS) SENSOR G - NO COMMUNICATION    I BELIEVE THIS TO BE EITHER A VERY SERIOUS DEFECT, OR A MALICIOUS HACKING ATTEMPT. I LOST CONTROL OF THE VEHICLE AT HIGHWAY SPEEDS. I CAN'T DRIVE THIS VEHICLE WITHOUT THE FEAR OF IT HAPPENING AGAIN. WITHOUT WARNING. GM'S OFFICIAL ANSWER IS THAT THEY WILL GIVE ME AN OIL CHANGE COUPON. I DO NOT FIND THIS SATISFACTORY. I FIND IT A HUGE DANGER TO MY LIFE AND THOSE AROUND ME. I AM INSULTED THAT GM FINDS IT FUNNY. RESEARCH I HAVE DONE SHOWS THAT THEY HAVE COVERED UP STUFF LIKE THIS BEFORE. I THINK THE PUBLIC NEEDS TO KNOW. I ASKED GM FOR CONTACT INFO ON THEIR FEDERAL OVERSEER FOR THE IGNITION ISSUE. THEY REFUSED. I DON'T THINK THEY HAVE LEARNED THEIR LESSON.",
        "vin": "2G1FD1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "08/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ONCE THE CAR IS SHIFTED INTO PARK AND I TURN THE VEHICLE OFF THE KEY WILL NOT RELEASE FROM THE IGNITION. I HAVE TO TURN THE CAR ON AND OFF SEVERAL TIMES BEFORE THE KEY WILL RELEASE. SOMETIMES, I EVEN HAVE TO MOVE THE VEHICLE COMPLETELY AND TURN IT OFF AGAIN BEFORE THE KEY WILL RELEASE.",
        "vin": "2G1FD1E3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/12/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. WHEN THE CONTACT PLACED THE VEHICLE IN PARK AND TURNED OFF THE IGNITION, THE KEY BECAME STUCK IN THE IGNITION. THE CONTACT HAD TO SHIFT THE GEARS A FEW TIMES TO REMOVE THE KEY. THE VEHICLE WAS TAKEN TO TOM GILL CHEVROLET (7830 COMMERCE DR, FLORENCE, KY 41042), BUT THEY WERE UNABLE TO DIAGNOSE OR REPAIR THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 44,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING OFF THE VEHICLE WITH AUTOMATIC SHIFTER IN PARK THE IGNITION KEY GETS STUCK IN THE IGNITIION SWITCH. I THEN HAVE TO KEEP RESTARTING AND SHUTTING OFF THE VEHICLE AND MOVE THE SHIFTER IN AND OUT OF PARK MULTIPLE TIMES TO GET THE KEY TO RELEASE. THERE APPEARS TO BE A SENSOR ISSUE WITH THE AUTOMATIC SHIFTING MECHNISM AND THE IGNITION SWITCH. THIS HAS HAPPENED ON BOTH MY 2014 V-6 AND 2015 V-8 CAMAROS. NUMEROUS COMPLAINTS ARE ALL OVER THE INTERNET ABOUT THIS PROBLEM AND CHEVROLET SHOULD ISSUE A RECALL.",
        "vin": "2G1FK1EJ7F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STUCK IN THE IGNITION SWITCH.  KEY CAN'T BE REMOVED FROM THE IGNITION SWITCH.",
        "vin": "2G1FD3D36F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKED AND TURNING OFF MY CAR  MY  IGNITION GETS STUCK WHERE I CANNOT REMOVE MY KEY",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT HEADLIGHT IS DIM, NOT COMPLETELY OUT.. I TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT 3 PEOPLE CAME IN FOR THE SAME PROBLEM. SAYS THE BALANCE AND THE LIGHT BULB HAS TO BE REPLACED. I NOTICE THE LIGHT WAS DIM WHEN DRIVING.",
        "vin": "2G1FF1E35F9"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115483,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING WHEEL MAKES A SQUEAKY NOISE WHENEVER I MAKE A TURN. IT STARTED OUT ONLY MAKING THE SOUND SPORADICALLY. IT IS NOW MAKING THE NOISE LOUDER AND EVERY TIME I MAKE A TURN WHILE DRIVING AND EVEN WHEN I TURN THE WHEEL WHILE PARKED (I TESTED THIS TO SEE IF IT WOULD MAKE THE SOUND ALL THE TIME). THIS HAS BEEN HAPPENING SINCE APRIL 2018. AS OF THE PAST TWO DAYS, MY KEY NOW GETS STUCK IN THE IGNITION WHEN I CUT THE CAR OFF. THE KEY WILL NOT TURN ALL THE WAY SO THAT I CAN TAKE IT OUT.",
        "vin": "2G1FD1E31F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115142,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CAMARO IS NOT RELEASING THE KEY WHEN I SHUT THE CAR OFF I HAVE TO KEEP CRANKING THE CAR BACK UP AND PUTTING IT INTO BACK INTO DRIVE AT LEAST 5 TIMES BEFORE IT WILL RELEASE THE KEY THIS IS GETTING TO GET OLD HAVING TO DO THIS OVER AND OVER.AND I AM AFRAID THAT IT WILL EVENTUALLY WARE OUT THE KEY AS WELL AS THE IGNITION CAN SOMETHING BE DONE BEFORE THIS HAPPENS.IT IS BEGINNING TO HAPPEN EVERY TIME I DRIVE MY CAR (WHICH IS DAILY) MY CAMARO HAS JUST A LITTLE OVER 20,000 MILES ON IT AND IT WAS BOUGHT BRAND NEW!!!!",
        "vin": "2G1FD1E30F9"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "07/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112607,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 25 MPH, A LOUD NOISE WAS HEARD EMERGING FROM THE REAR OF THE VEHICLE. THE VEHICLE WAS DRIVEN TO THE CONTACT'S RESIDENCE. ONCE THE VEHICLE WAS PARKED, THE CONTACT NOTICED A BLUE COLORED FLUID COVERING THE REAR DIFFERENTIAL. THE VEHICLE WAS TAKEN TO THE DEALER (GHENT CHEVROLET, 2715 35TH AVENUE, GREELEY, COLORADO 80634) WHERE IT WAS DIAGNOSED THAT THE REAR DIFFERENTIAL FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED. THE CONTACT ALSO STATED THAT THE VEHICLE WAS REPAIRED IN FEBRUARY OF 2018 AT DELLENBACH MOTORS (3111 S COLLEGE AVENUE, FORT COLLINS, CO 80525) REGARDING THE REAR CV SHOCKS THAT GO INTO THE REAR DIFFERENTIAL. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 76,000.  *DT  UPDATED 11/30/18*JB",
        "vin": "2G1FJ1EW1F9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/09/2018",
        "dateOfIncident": "07/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110274,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. WHILE PULLING INTO THE DRIVEWAY AT 10 MPH, THE VEHICLE INADVERTENTLY ACCELERATED WITHOUT WARNING. THE CONTACT DEPRESSED THE BRAKE PEDAL, BUT THE VEHICLE FAILED TO STOP. THE CONTACT TURNED THE STEERING WHEEL TO THE LEFT AND THE VEHICLE CRASHED INTO A TREE. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE DEALER WAS NOT CONTACTED FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 27,870.",
        "vin": "2G1FB1E30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104166,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING OFF CAR AND ATTEMPTING TO REMOVE KEY, KEY REMAINS LODGED IN IGNITION AND WILL NOT COME OUT. IN ORDER FOR KEY TO BE RELEASED, CAR MUST BE PLACED BACK INTO DRIVE THEN BACK INTO PARK. SOMETIMES IT WORKS THE FIRST TIME BUT SOMETIMES THE SAME SEQUENCE NEEDS TO BE DONE MULTIPLE TIMES.",
        "vin": "2G1FD1E3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103525,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY NOT RELEASING AFTER ENGINE IS TURNED OFF. CAR IN PARK WILL NOT TURN TO RELEASE KEY FROM SWITCH.",
        "vin": "2G1FB1E30F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A CITY STREET APPROACHING AND INTERSECTION WITH A GREEN LIGHT AND MADE A MOVING RIGHT HAD TURN ONTO THE PERPENDICULAR STREET. AS I PROCEEDED THROUGH THE TURN AND STARTED TO ALLOW MY STEERING WHEE RETURN TO CENTER IN WHICH THE STEERING WHEEL IS MOVING IN A COUNTERCLOCKWISE DIRECTION, THE \"PADDLE SHIFTER\" LOCATED ON THE RIGHT SIDE OF THE STEERING WHEEL CAUGHT IN THE CAVITY / VOID IN THE KEY FOB / REMOTE ENTRY FOB AND PREVENTED THE STEERING WHEEL FROM RETURNING TO CENTER. I HAD A CAR ON MY REAR WHILE MAKING THE TURN SO I COULDN'T JUST STOP, THE CAR WAS NOW HEADED TO THE RIGHT CURB AND A CONCRETE RAILROAD BRIDGE WALL. I PULLED ON THE WHEEL TO THE LEFT TO TRY TO CENTER THE WHEEL AND STRAIGHTEN THE CAR BUT THE WHEEL WASN'T MOVING TO THE LEFT. I GAVE A VERY HARD PULL TO THE LEFT AND HEARD MY KEYS GO FLYING ACROSS THE CAR AND THE WHEEL WAS NOW FREE AND I REGAINED CONTROL OF THE CAR. AFTER I HAD CONTROL OF THE CAR AGAIN I NOTICED THAT THE KEY HAD BROKEN FROM THE EXCESSIVE FORCE I APPLIED TO FREE THE STEERING WHEEL. THIS ALL HAPPENED IN A FEW SECONDS IN MOVING MORNING RUSH HOUR TRAFFIC. AS SOON AS I WAS ABLE I PULLED OVER TO ACCESS WHAT HAPPENED. I CONCLUDED THAT NOTING WAS WRONG WITH THE STEERING LINKAGE OR POWER STEERING SYSTEM, BUT RATHER THE REMOTE ACCESS KEY FOB HAD CAUGHT ON THE PADDLE SHIFTER AND LOCKED UP THE STEERING WHEEL FROM RETURNING TO CENTER WHILE MAKING THE RIGHT TURN. TYPICALLY MY TEENAGE SON DRIVES THIS CAR. I DISCUSSED THIS WHIT HIM AND HE HAD ALSO HAD THE SAME ISSUE WITH THE PADDLE SHIFTER GETTING CAUGHT INT HE REMOTE ACCESS KEY FOB, BUT NOT IN MOVING MORNING RUSH HOUR TRAFFIC. I REPORTED THIS TO GM CASE # 8-4304277679, BUT THEY TOLD ME THEY WERE NOT GOING TO INVESTIGATE IT AND WERE NOT FAMILIAR WITH THIS OR A A SIMILAR PROBLEM. THIS IS A SERIOUS SAFETY CONCERN AND SOMETHING NEEDS TO BE DONE. PLEASE ADVISE. SEE PICS. *DT",
        "vin": "2G1FB1E35F9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2016 KEYS KEPT GETTING STUCK WHILE IN PARK.  THE KEY WILL NOT COME OUT FOR THE IGNITION.  I MUST START THE CAR AND MOVE THE SHIFTIER OUT OF PARK AND BACK INTO THE PART POSITION SEVERAL TIMES.  SAME INFORMATION FROM THE PREVIOUS COMPLIANT THEN THE IGNITION NEEDED TO BE REPLACE.    NOW 06/14/2018:   THE SAME ISSUES; KEYS KEPT GETTING STUCK WHILE IN PARK.  THE KEY WILL NOT COME OUT FOR THE IGNITION.  I MUST START THE CAR AND MOVE THE SHIFTIER OUT OF PARK AND BACK INTO THE PART POSITION SEVERAL TIMES. AND NOW ITS CURRENTLY IN THE SHOP AND THE SHIFTER ASSEMBLY NEEDED TO BE REPLACE. I PURCHASE MY CAR CHRISTMAS 2014 AND IT'S ONLY A 3YR VEHICLE WITH 29,592 MILES ON IT. I JUST DON'T UNDERSTAND ALL THESE PROBLEMS FOR ONLY 3YR OLD VEHICLE.",
        "vin": "2G1FB1E39F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080958,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PLACING CAR IN PARK, KEY WILL NOT RELEASE FROM THE STEERING COLUMN. I MUST START THE CAR AND MOVE THE SHIFTIER OUT OF PARK AND BACK INTO THE PART POSITION SEVERAL TIMES.",
        "vin": "2G1FB1E31F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU PARK THE CAR TURN IT OFF AND TRY TO REMOVE THE KEY AND YOU CAN'T IT LOCK IN THE IGNITION",
        "vin": "2G1FB1E3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2018",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072737,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES CHECK ENGINE LIGHT REMAINS ON RELATED TO THE AUTO STOP FEATURE. THE CAR SOMETIMES LOSES ALL POWER WHEN STOPPED AT A LIGHT. I REPLACED THE BATTERY AND BATTERY CABLES AND THE ISSUE HAS CONTINUED.",
        "vin": "1G11B5SL7FF"
    },
    {
        "components": "EXTERIOR LIGHTING,SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2018",
        "dateOfIncident": "05/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, MY CAMARO HAS BEEN MAKING A LOT OF NOISES ON THE LEFT FRONT OF THE PUMPER, I CALLED THE DEALER I BOUGHT MY CAR FROM, AND THEY WANT ME TO PAY $125 AN HR FOR INSPECTION WHICH THEY HAD TOLD ME EVERYTHING WOULD BE FREE AS LONG AS I KEEP TAKING MY CAR WITH THEM WHICH EVERYTHING WAS A LIE I WAS SUPPOSED TO GET MY OIL CHANGES FOR FREE, NEVER HAPPENED AFTER 2 ND TIME TAKING MY CAR I HAD TO PAY, SO I CALLED FOR AN OIL CHANGE APPOINTMENT AND ALSO MENTIONED TO THEM THAT MY SEAT BELT WAS NOT WORKING, THAT I HAD TO GET IT FIXED ASAP BECAUSE I COULD NOT DRIVE IT LIKE THAT IT CAN BE VERY DANGEROUS, SO I GOT MY APPOINTMENT SET UP, NEXT THING I SHOW UP ON MY SCHEDULED DATE, ANDY THEY TOLD ME I CAN'T GET MY SEAT BELT FIXED  WITHOUT PAYING, WELL??? ISN'T THERE A WARRANTY THAT COVERS 6 YEARS ON WHATEVER HAPPENS TO THE VEHICLE? I GUESS THAT'S NOT THERE POLICY 'ED DENAS, I'VE BEEN ASKING OTHER DEALERS, AND THEY ALL TOLD ME CAMAROS HAVE A 6 YEAR WARRANTY NO MATTER WHAT, WHY IS THIS SPECIFIC DEALER NOT STICKING TO THERE WORD? THEY HAVEN'T BEEN THE BEST SINCE THE BEGINNING, I CAN'T KEEP PAYING FOR INSPECTIONS WHEN THEY SAID EVERYTHING IS COVERED FOR UP TO 6 YEARS!.",
        "vin": "2G1FF1E36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WOULD GET STUCK IN THE IGNITION UPON PUTTING VEHICLE INTO PARK. THERE WAS AN INTERIOR FAILURE IN THE FLOOR SHIFTER CONTROL ASSEMBLY. THE CAR WOULD BE IN STATIONARY WHEN I WOULD ARRIVE AT WORK, HOME, OR SHOPPING AND THE KEY WOULD NOT TURN.",
        "vin": "2G1FD1E36F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS SHIFTED INTO PARK AND THE KEY IS CYCLED BACK TO THE OFF POSITION, THE KEY WILL NOT RELEASE FROM THE IGNITION SWITCH ON THE STEERING COLUMN. I CONTACTED MY DEALER AND THEY INDICATED THAT THE 2015 CAMARO DID NOT HAVE ANY SUCH ISSUES REPORTED AND NO RECALL WAS INDICATED. I BELIEVE THE ISSUE TO BE RELATED TO A FAULTY SENSOR OR SWITCH CONNECTION AT THE TRANSMISSION, RESULTING IN THE VEHICLE COMPUTER OR IGNITION SWITCH NOT REGISTERING THAT THE VEHICLE IS ACTUALLY IN PARK. I TURNED THE KEY TO THE ON POSITION (WITHOUT STARTING THE CAR) AND CYCLED THE GEAR SHIFT BACK AND FORTH A COUPLE OF TIMES AND SWITCHED THE KEY BACK TO THE OFF POSITION AND THE KEY WAS RELEASED. THIS IS HAPPENING EVERY DAY! FRUSTRATING TO SAY THE LEAST. IF I CAN'T GET THE KEY OUT, I CAN'T LOCK THE VEHICLE WHICH WOULD POTENTIALLY RESULT IN MY PROPERTY OR THE VEHICLE ITSELF BEING STOLEN. THIS PROBLEM APPLIES WHILE PARKED ON A DRY LEVEL SURFACE AND A SLOPED DRY SURFACE.",
        "vin": "2G1FK1EJ9F9"
    },
    {
        "components": "WHEELS,ELECTRONIC STABILITY CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054852,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PRESSURE TIRE LIGHTS COME ON EVEN WHEN MY TIRES ARE INFLATED .. THEY MARKED THAT THE TIRE WHERE LOW AT 22 AND I PUMPED AIR UNTILL THEY WHERE 40 WITHOUT KNOWING BECAUSE THE TIRE LIGHTS INDICATED THEY WHERE LOW.. WHEN I'M COMING TO A STOP THE WHEEL SHAKES.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RATTLING NOISE COMING FROM EXHAUST.. HAS BEEN AN ISSUE SINCE THE VEHICLE WAS AT 2000 MILES . I HAVE HAD THIS REPAIRED ABOUT 5 TIMES.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "11/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052564,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SITTING IN MORNING TRAFFIC AT A STOP LIGHT, ONCE THE CHANGED I WAS DIVING 25 MPH DUE TO THE VOLUME OF TRAFFIC IN FRONT OF ME.  THE INNER PART OF MY REAR PASSENGER RIM EXPLODED AND WENT THROUGH THE BACK TIRE AND WAS PROTRUDING OUT THE BACK END OF THE TIRE. CHEVY DEALERSHIP TRIED TO SAY I RAN OVER SOMETHING BUT THE TRAJECTORY OF THE IMPACTED RIM WOULD HAVE MADE THAT TYPE OF IMPACT IMPOSSIBLE.  NOT TO MENTION THERE WAS NO DEBRIS IN ROAD AND I WAS IN A LONG LINE OF MORNING TRAFFIC AT A STOP LIGHT.  I CONTACTED GM OWNER CENTER TO OPEN AN INVESTIGATION AND WAS TOLD A SENIOR ADVISOR WOULD CONTACT ME IN 48HRS.  THAT WAS 4 DAYS AGO DESPITE ME CALLING AND LEAVING 3 MESSAGES REQUESTING A RETURN CALL.",
        "vin": "2G1FF1E32F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "04/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043835,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT THE KEY BECAME STUCK IN THE IGNITION AND THE VEHICLE FAILED TO START WITHOUT WARNING. THE CONTACT CALLED A LOCAL DEALER (GORDON CHEVROLET, 1166 BLANDING BLVD, ORANGE PARK, FL 32095) AND WAS INFORMED THAT THERE WAS A $99.00 DIAGNOSTIC FEE. THE CONTACT DECLINED TO PAY THE FEE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND OPENED CASE NUMBER: 8-3494064784. THE CONTACT WAS ADVISED TO CALL A LOCAL DEALER. THE FAILURE MILEAGE WAS 64,739.",
        "vin": "2G1FK3DJXF9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2017",
        "dateOfIncident": "02/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR COMPLETELY DIED (TURNED OFF) ON ME WHILE I WAS IN DRIVE TWO TIMES.   THE THROTTLE BOOSTER HAS HAD PROBLEMS BC A WARNING COMES UP ON THE SCREEN THAT SAYS ENGINE POWER LOW AND IN THE OWNERS MANUAL IT SAYS WHEN THAT COMES UP ON YOUR SCREEN OR YOUR SERVICE MY THINGY THEN PLEASE TAKE IT IN TO YOUR DEALERSHIP TO GET FIXED SO OBVIOUSLY SHERRY KNOWS THAT THERE'S A PROBLEM WITH IT BUT RATHER THAN FIX IT DO YOU RATHER US DEAL WITH IT A WARNING COMES UP ON THE SCREEN THAT SAYS ENGINE POWER LOW AND IN THE OWNERS MANUAL IT SAYS WHEN THAT COMES UP ON YOUR SCREEN OR YOUR SERVICE MY THINGY THEN PLEASE TAKE IT IN TO YOUR DEALERSHIP TO GET FIXED SO OBVIOUSLY SHERRY KNOWS THAT THERE'S A PROBLEM WITH IT BUT RATHER THAN FIX IT DO YOU RATHER US DEAL WITH IT.    WHEN I FIRST GOT THIS CAR THE AIR CONDITIONER DIDN'T  WORK ALL THE TIME.    NOW MY NAVIGATION SEEMS TO BE KIND OF NOT WORKING PROPERLY BECAUSE IT WON'T STAY FROZEN ON THE SCREEN FOR A WHILE OR IT TELLS ME THAT IS TRYING TO INITIATE NAVIGATION FOR ABOUT 30 MINUTES.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015567,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY GETS STUCK IN THE IGNITION AND CANNOT BE REMOVED WHEN THE CAR IS PLACED IN PARK. IT IS AN INTERMITTENT EVENT BUT HAPPENS ABOUT 60-70% OF THE TIME.",
        "vin": "2G1FD3D30F9"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "08/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014509,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CHEVROLET CAMARO CONVERTIBLE HAS SUDDENLY DEVELOPED A PROBLEM REMOVING THE IGNITION KEY AFTER TURNING IT OFF. THE PROBLEM STARTED OFF INTERMITTENTLY THEN GOT WORSE. TOOK IT TO THE DEALER AND THE SERVICE MANAGER CAME OUT TO LOOK AT IT. HE IMMEDIATELY MOVED THE SHIFT LEVER AND THE KEY CAME OUT. HE DID IT LIKE HE HAS DONE IT MANY TIMES BEFORE. I ASKED IF IT WAS A KNOWN PROBLEM AND HE TOLD ME NO. AFTER DOING RESEARCH, I DISCOVERED IT IS A PROBLEM WIDELY KNOWN BY DEALERS BUT NEVER ADMITTED! FORTUNATELY MY CAR IS STILL UNDER FULL FACTORY WARRANTY BUT I BELIEVE THERE ARE MANY, MANY OTHER PEOPLE THAT HAVE HAD TO UNNECESSARILY PAY FOR A REPAIR THAT WAS THE RESULT OF POOR DESIGN. I ALSO LEARNED THAT IT ONLY IS A PROBLEM WITH AUTOMATIC TRANSMISSIONS AND MANUAL TRANSMISSIONS DO NOT HAVE THIS PROBLEM. THE PROBLEM IS WITH THE LINKAGE BETWEEN THE GEARSHIFT AND THE IGNITION KEY RELEASE. WHEN I GO TO PARK THE CAR I NEVER KNOW IF IT WILL GIVE MY KEY BACK OR NOT! I HAVE AN APPOINTMENT TO GET IT FIXED, BUT THIS IS AN OBVIOUS AND WELL KNOWN PROBLEM!",
        "vin": "2G1FF3D32F9"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/26/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11010825,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDETERMINED SPEED, THE DRIVER LOST CONTROL OF THE VEHICLE AND CRASHED DOWN AN EMBANKMENT. DURING THE CRASH, THE FRONT END OF THE VEHICLE SUSTAINED SIGNIFICANT DAMAGE AND THE DRIVER SIDE AIR BAG DID NOT DEPLOY. HOWEVER, THE PASSENGER SIDE AIR BAG DID DEPLOY FOR THE OCCUPANT. THE DRIVER SUSTAINED FATAL INJURIES. THE VEHICLE WAS DESTROYED. A POLICE REPORT WAS TAKEN AT THE SCENE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 32,000.",
        "vin": "2G1FJ1EW8F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2017",
        "dateOfIncident": "05/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2015 CHEVY CAMARO WITH JUST ABOUT 40,000 MILES THAT NOW WHEN I PARK THE VEHICLE THE KEY GETS STUCK IN THE IGNITION. IT TAKES SEVERAL ATTEMPTS TO GET THE KEY UNSTUCK BY CONSTANTLY SHIFTING THE GEAR. I HAVE READ SEVERAL COMPLAINTS ABOUT THIS ISSUE FROM OTHER OWNERS. I CHATTED WITH SOMEONE AT GM AND THEY ARE NOT COVERING THIS DEFECT AT THIS TIME. I KNOW THEY HAVE COVERED THIS SAME ISSUE A FEW YEARS AGO. IF IT IS STILL HAPPENING THEN WHY ARE THEY NOT STILL FIXING THIS PROBLEM?  *TR",
        "vin": "2G1FF3D33F9"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10978888,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY INVOLVED A CAR WRECK WERE MY VEHICLE WAS TOTAL OUT BUT MY AIR BAG DID NOT COME OUT THROUGH THE STEERING WHEEL AND I WAS SURVEY HURT I SASTAINED HEAD INJURIES AND A BROKEN LEG AND ANKLE I WAS TRYING TO REACH OUT TO SOME ONE TO SEE IF THIS COMPANY COULD HELP",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969268,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY GETS STUCK IN THE IGNITION EVERY TIME I PARK, IT'S CAUSING ME TO BE LATE EVERYWHERE I GO. THE OTHER NIGHT, MY KEY STAYED STUCK IN THE IGNITION UNTIL THE MORNING. THIS COULD CAUSE MY BATTERY TO DIE AND OTHER ISSUES.",
        "vin": "2G1FD3D33F9"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "02/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10968959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "GM CHEVROLET CAMARO AIRBAGS DIDNOT DEPLOY AT ALL. CAMARO TOTAL LOSS, A SUBJECT OF MULTIPLE COLLISIONS 1 LEFT FRONT STRUCK BY ANOTHER DRIVER, RIGHT FRONT RESULT FROM INITIAL, AND CENTER COLLISION (MOST EXTENSIVE IMPACT AND DAMAGE.",
        "vin": "2G1FG1EWXF9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2017",
        "dateOfIncident": "02/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956581,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS, STUMBLES, AND DIES WHEN TRYING TO ACCELERATE AFTER DECELERATING. IT HAPPENS AT LOW AND HIGH SPEEDS. HAVE HAD THE CAR DIE AT HIGHWAY SPEEDS WHEN TRYING TO ACCELERATE AFTER BRAKING TO SLOW DOWN. PROBLEM IS INTERMITTENT AT THIS POINT BUT HAS GOTTEN WORSE. HAVE TO SHIFT TO NEUTRAL AND RESTART WHILE MOVING. CAR WILL RESTART BUT PROBLEM CONTINUES.   SOMETIMES I CAN CATCH IT BEFORE IT COMPLETELY DIES BY PUMPING THE GAS PEDAL 2-3 TIMES. BUT IF NOT QUICK ENOUGH, WILL DIE WHEN I HIT GAS PEDAL. THIS IS A REAL SAFETY ISSUE WHEN AT HIGHWAY SPEEDS AS LOSS OF ENGINE POWER COULD CAUSE PROBLEMS WITH BRAKING AND STEERING IF CAR CANNOT RESTART.",
        "vin": "2G1FF1E35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2017",
        "dateOfIncident": "02/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949526,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 3RD, 2017, I WAS DRIVING AT 8PM ON A STREET AT 30 MPH.  AT THAT TIME MY CAMARO LOST ALL POWER, INCLUDING ENGINE, HEAD-LIGHTS, AND STEERING.  THIS IS THE SECOND TIME THIS HAS HAPPENED SINCE I'VE OWNED THE CAR (JUNE 2015).  THE FIRST TIME I SUSPECTED THAT MY KNEE HAD PLAYED A ROLE BY ACCIDENTALLY HITTING THE IGNITION AREA.  YESTERDAY, (FEB 3RD) I KNOW FOR A FACT THAT THIS TIME MY KNEE PLAYED A ROLE.  I UNDERSTAND THAT GM RECALLED 500K CHEVY CAMARO'S THAT WERE 2010-2014 MODELS FOR AN IGNITION-SWITCH DEFECT.  THE REASON THAT I AM WRITING THIS COMPLIANT IS THAT THE EXACT SAME THING OCCURRED AND THIS IS A 2015 MODEL.",
        "vin": "2G1FD1E37F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935934,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A NEW 2015 V6 CHEVY CAMERO.1/30/2016 THE RADIATOR HAS BEEN REPLACED/THE LEEK AGAIN HOSE VALVES REG LEAK ALSO.THE CLUTCH ,FLY WHEEL,BARRING,CLUTCH WORE OUT NOT NORMAL.CAR WILL DRIVE INTO SECOND GEAR AND CAR WILL ACCELERATE ON OWN.BURNING SMELL IN AIR VENTS AND CAR MAKE LOUD NOISE WHEN WARMING UP.GM REFUSED TO BUY BACK OR GIVE DOWN PAYMENT FOR ANOTHER AUTO.WELL FILL UNSAFE AND NOT HAPPY.GM REFUSE TO DO ANYTHING TO HELP.CAR HAS UNDER 12 THOUSAND MILES.WE DONT FEEL SAFE AND NOT HAPPY.NO WORKING NUMBER TO CALL CORP IN DETROIT.I TOLD GM WE ALSO SEE THESE CARS START FIRE INSIDE ON INTERNET.WE DONT WANT TO BE IN THIS CAR.WE ARE STUCK IN SOMETHING UNSAFE AND THEY DO NOTHING TO HELP.BECAUSE ITS NOT THEM IN THIS POSITION.WE HAVE WARRANTY AND EXTENDED ONE TO.THEY REFUSE TO PAY FOR CLUTCH BUT DEALER DID ABSORB COST FOR REPAIR.WE DONT TRUST THIS CAR AND WE ARE NOT HAPPY.PLEASE HELP WHEN READING THIS COMPLAINT TO GET US OUT OF THIS UNSAFE CAR. THESE PROBLEMS ARE ONE AFTER ANOTHER.",
        "vin": "2G1FA1E33F9"
    },
    {
        "components": "POWER TRAIN,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "07/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892520,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IVE HAD ISSUES WITH THE MOTOR DEALER HAS HAD TO CHANGE PISTONS AND VALES . WHICH ISN'T VERY UNSAFE UNTIL YOUR DRIVING ON THE HIGHWAY THEN YOU LOSE ALL POWER ..THEN YOU HAVE TO DODGE TRAFFIC..OR ELSE..  IVE HAD ISSUES WITH THE TIRE SENSOR THAT KEEPS GOING OUT, DEALER CHANGED IT ONCE AND WITHIN A MONTH IT STARTED ACTING WEIRD AGAIN. KEEPS TELLING ME TO ADD AIR TO THE TIRES WHEN I TOOK IT IN TO THE DEALER THEY SAID IT WAS FINE . UNTIL I GET A BLOW OUT AND WRECK.  IVE HAD ISSUES WITH SOME LIGHTS THAT FLICKER WHILE IM DRIVING . THE DEALER SAYS \"THAT THERE IS NOTHING WRONG WITH THE LIGHTS\" .  GM IS BUYING BACK THIS LEMON THEY SOLD ME , HOWEVER THEY WOULD LIKE ME TO KEEP DRIVING THIS CAR WITH TWO COMPLETELY BALD TIRES AROUND WHILE THEY DECIDE EXACTLY HOW MUCH THEY WANT ME TO PAY THEM FOR DEALING WITH THIS OBVIOUS LEMON THAT THEY SOLD ME. THAT'S THE THANKS I GET FOR CHOOSING TO BUY AN AMERICAN MADE VEHICLE.   I WILL NOT EVEN DRIVE THIS ONE YEAR OLD CAR BECAUSE IT IS SO UNSAFE, PLEASE LOOK INTO OR AT LEAST MAKE SOME OF THIS INFORMATION AVAILABLE SO THAT OTHER HONEST HARD WORKING PEOPLE DON'T GET CAUGHT IN THIS HORRIBLE SITUATION..",
        "vin": "2G1FA1E39F9"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "05/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885089,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE CAR 4/2015 NEW - 5/6 I WAS DRIVING MY CAR WHEN IT STARTED TO SHAKE AND VIBRATE. I PULLED OVER  AND IT STOPPED . I BROUGHT IT STRAIGHT TO THE DEAL AND IT HAD A  DIAGNOSTIC  CODE FOR ENGINE MISFIRE - NO PROBLEM WITH CAR SINCE THAT DAY 5/6.  ON 5/9 I WAS DRIVING HOME FROM SCHOOL AND I PULLED ONTO MY HOME STREET AND THE CAR LIGHT CAME ON TRANSMISSION OVERHEAT - THE CAR COMPLETLEY SHUT DOWN AND I COULD NOT START IT AGAIN.  I TOWED IT TO THE DEALER. - I WAS TOLD THE TRANSMISION WAS STUCK IN BETWEEN 1ST AND 2ND GEAR AND THE  TRANSMISSION WAS COMPLETEY FRIED - BURNED - MELTED - NOT 1 REPORT ON THE DIAGNOSTIC NOT 1 WARNING UNTIL IT JUST STOPPED DEAD IN THE ROAD.  IF I HAD BEEN DRIVING ON THE HIGHWAY I WOULD HAVE BEEN KILLED FOR THE CAR JUST SHUTTING DOWN - AND NEVER STARTED AGAIN - TIRES ARE PITTED AND BALD - EVERY 2 WEEKS I REC'D NOTICE TO PUT AIR IN BACK TIRES FROM THE DAY OF PURCHASE THE AIR IN BACK TIRES ALWAYS NEEEDED AIR.  DEALERSHIP AND GM HAVE DEEMED THE WARRANTY VOIDED AND WILL NOT REPLACE THE TRANSMISSION OR WORN TIRES ON A 1 YR OLD CAR -  HOW CAN A TRANSMISSION BURN OUT IN 3 DAYS??  IT  HAD JUST HAD A DIAGNOSTICS DONE AT THE DEALERSHIP ON 5/6 WHEN THE ENGINE MALFUNCTIONED- I WAS TOLD IT WAS A MISFIRE!!!  AND THEN 3 DAYS LATER  ON 5/9 THE TRANSMISSION WAS BURNED OUT ???- MECHANIC SAID IT WAS STUCK IN BETWEEN 1ST AND 2ND GEARS???  HOW CAN THAT HAPPEN IF I ONLY DRIVE IN AUTOMATIC?? HOW COME THERE WAS NO WARNINGS ABOUT THE SLIP IN GEARS AS WELL?? OR A WARNING ABOUT THE OVERHEATING OF THE TRANSMISSION BEFORE IT MELTED?",
        "vin": "2G1FH3DJ2F9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR MAKES A LOAD POPPING NOISE WHEN STARTED BUT ONLY ONCE RIGHT AFTER IT STARTS. THE CAR WILL RUN LIKE IT IS IN GEAR OR MISSING AND WANT TO MOVE FORWARD, EVEN WITH THE CLUTCH PRESS DOWN AND IN GEAR. IT IS VERY HARD TO GET IN GEAR WITH THE CLUTCH PRESSED OR WILL NOT GO IN TO GEAR, 1ST OR 2ND SO DRIVING CAN BE VERY DANGEROUS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874545,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DOES NOT START OR CRANK AFTER MULTIPLE ATTEMPTS, 5 REPAIR ATTEMPTS REPLACING MODULES, TRANSPONDERS, AND REPAIRS TWO SHORTS HAVE NOT FIXED THE ISSUE.  THE CAR DOES NOT CRANK OR MAKE ANY SOUND INDICATING IT'S STARTING.  THE CAR GIVES CODES AS TO WHAT THE PROBLEM IS AND EACH TIME IT'S A DIFFERENT CODE AND REPAIR FOR THE SAME NON START ISSUE.",
        "vin": "2G1FB1E37F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "04/13/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874302,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER CORE HAS GONE BAD. HAS A SWEET SMELL COMING COME VENTS WHEN HEAT IS ON BUT DOES NOT HAPPEN WHEN A/C IS TURNED ON",
        "vin": "2G1FD3D35F9"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GANS",
                "productMake": "PIRELLI",
                "productModel": "PIRELLI",
                "productYear": "1998",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO EQUIPPED WITH PIRELLI P0 PROFEO R (NA) TIRES, SIZE: 305/30R19 (NA). WHEN THE VEHICLE WAS PURCHASED, ALL FOUR TIRES EXHIBITED SMALL CRACKS AND THE TIRE SPECIFICATIONS WERE NOT MET BY THE MANUFACTURER. THE TIRES WERE NOT REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE TIRE AND VEHICLE FAILURE MILEAGE WAS 124.",
        "vin": "2G1FZ1EE5F9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "11/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 CHEVY CAMARO RS / 2LT COMMEMORATIVE EDITION:  THE TRANSMISSION CONFIGURATION ON THIS VEHICLE IS HAZARDOUS. FIRST GEAR IS LOCATED ADJACENT TO THE REVERSE GEAR ON THE UPPER LEFT. VERY LITTLE BUFFER BETWEEN FIRST AND REVERSE AND IS EFFORTLESS TO MOVE THE TRANSMISSION INTO REVERSE WHEN YOU WANT TO CHOOSE FIRST GEAR. WHEN ACCELERATING FROM A STOPPED POSITION IT IS VERY COMMON TO MOVE THE SHIFTER INTO REVERSE INSTEAD OF FIRST GEAR. I'VE HAD SEVERAL CLOSE CALLS WITH THE VEHICLE MOVING BACKWARD INSTEAD OF FORWARD. THIS POOR CONFIGURATION IS HAZARDOUS AND CAN BE POTENTIALLY FATAL. I STRONGLY ADVISE THE NHTSA TO OPEN AN INVESTIGATION INTO THIS MATTER.  PLEASE VIEW THREAD BELOW FOR MORE DETAILS: HTTP://WWW.CAMARO5.COM/FORUMS/SHOWTHREAD.PHP?P=9015025&POSTED=1#POST9015025",
        "vin": "2G1FE1E35F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/18/2016",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10850391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2015 CAMARO ON THE HIGHWAY GOING THE SPEED LIMIT (65MPH)BOTH SIDE AIRBAGS DEPLOYED FOR NO REASON. THERE WAS NO SUDDENLY BRAKING OR CRASH THEY JUST DEPLOYED.",
        "vin": "2G1FB1E33F9"
    },
    {
        "components": "SUSPENSION,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/10/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT ABOUT 20 MPH AROUND A TRAFFIC CIRCLE IN A RESIDENTIAL AREA, WHEN, AFTER TURNING RIGHT, THEN LEFT, THEN RIGHT AROUND THE TRAFFIC CIRCLE, THE BACK END SLID OUT AND THE RIGHT REAR WHEEL SLAMMED SIDEWAYS AGAINST A CURB.  THE WHEEL WAS INSTANTLY CRACKED, THE WHEEL AND SPINDLE BENT.  \"SERVICE STABILITRACK\" INSTANTLY CAME ON THE DRIVER INFORMATION CENTER, AND ALL THREE STABILITY INDICATOR LIGHTS CAME ON. THE P-ZERO NERO TIRES ON THIS CAR ARE NOT SUITABLE FOR WET ROADS IN THE CITY. THE AMBIENT TEMPERATURE WAS ABOUT 50 DEGREES. THE CAMARO AND THESE TIRES MAKE IT UNSAFE, AND THE CAR SHOULD COME EQUIPPED DEFAULT WITH ALL-SEASON TIRES, NOT RACING Z-RATED SUMMER ONLY TIRES.  REPAIR COST IS $1,500 AND THIS IS NOT COVERED UNDER WARRANTY.  I AM VERY UNHAPPY WITH THE PERFORMANCE OF THIS \"PERFORMANCE\" CAR.",
        "vin": "2G1FD1E34F9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "02/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A VERY COLD WINTER DAY ( TEMPERATURES IN THE TEENS), I TOOK A TEST RIDE ON THIS 2015 CAMARO FROM A LOCAL BUICK DEALER. ALTHOUGH THIS CAMARO WAS ONLY A 6 CYLINDER, IT WAS EQUIPPED WITH PIRELLI ZERO NERO HIGH PERFORMANCE SUMMER TIRES. AS I PULLED AWAY FROM THE DEALERSHIP AND GOT UP TO 50 MPH, I THOUGHT THE CAR WAS COMING APART DUE TO THE EXTREME TIRE NOISE. I WASN'T AWARE THAT THE CAMARO HAD SUMMER TIRES AND I FEEL THAT I WAS PUT IN A DANGEROUS SITUATION BY DRIVING THIS CAR. AS PER AN EXCERPT OF THE OWNER'S MANUAL \"IF THE TIRES HAVE BEEN SUBJECTED TO 20 DEGREES OR LESS, LET THEM WARM UP IN A HEATED SPACE TO AT LEAST 40 DEGREES FOR 24 HOURS OR MORE BEFORE BEING INSTALLED OR DRIVING A VEHICLE ON WHICH THEY ARE INSTALLED\". ALSO, GM BULLETIN #13-03-10-0001A CLEARLY STATES THE CAR IS NOT TO BE DRIVEN IN TEMPERATURES BELOW 45 DEGREES!!! IN LIGHT OF HOW MANY PEOPLE WERE INJURED OR KILLED IN FORD EXPLORERS WITH A TIRE SITUATION, I'M SURPRISED THAT THERE IS NO OBVIOUS WARNING POSTED ON VEHICLES WITH SUMMER TIRES THAT IT IS DANGEROUS TO DRIVE WITH THOSE TIRES IN COLD CLIMATES. EVEN PIRELLI HAS NOTATIONS ABOUT THE SAFETY ISSUES WITH THESE TIRES.",
        "vin": "2G1FF3D39F9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837190,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. WHILE DRIVING 50 MPH, THE VEHICLE ACCELERATED WITHOUT WARNING. THE CONTACT REMOVED HIS FOOT FROM THE ACCELERATOR PEDAL, BUT THE PEDAL REMAINED STUCK TO THE FLOOR. THE FAILURE RECURRED TWICE. A TECHNICIAN COULD NOT FIND THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 5,000.",
        "vin": "2G1FD1E30F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2016",
        "dateOfIncident": "09/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A SERIOUS SAFETY ISSUE WITH THIS VEHICLE. MY WIFE OFTEN RIDES WITH ME IN THE PASSENGER SEAT.  SHE WEIGHS APPROXIMATELY 130 POUNDS AND THE PASSENGER AIRBAG FAILS TO TURN ON ABOUT 50% OF THE TIME. IN ORDER TO ACTIVATE THE AIRBAG SYSTEM, WE HAVE TO STOP THE VEHICLE, THEN SHE HAS TO EXIT AND RE-ENTER THE SEAT. THIS USUALLY TURNS THE AIRBAG ON. THIS IS AT BEST, INCONVENIENT, BUT AT WORST IN SOME SITUATIONS IT IS HAZARDOUS!    THE LOCAL DEALER CONTACTED GM/TAC IN DETROIT AND THEIR RESPONSE WAS AS FOLLOWS: \"YOUR VEHICLE IS OPERATING AS DESIGNED. THIS IS NORMAL OPERATION OF THE VEHICLE PER TAC THAT ANYONE 120 POUNDS AND UNDER WILL NOT TRIGGER THE AIRBAG LIGHT TO COME ON. THIS IS THE FINAL GM RESOLUTION AT THIS TIME\"    THE 120-130 POUND AIRBAG THRESHOLD SEEMS UNUSUALLY HIGH TO ME. IS THIS A NORMAL DESIGN FEATURE FOR ALL OF THESE CARS? WHY IS THIS WAY? IF I HAD KNOWN THAT WHEN CONSIDERING THE VEHICLE I WOULD NOT HAVE PURCHASED IT.     THIS IS AN ONGOING PROBLEM. IT STARTED IN SEP. 2015 AND CONTINUES TO THIS DAY (JAN. 10, 2016)",
        "vin": "2G1FD3D35F9"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/04/2016",
        "dateOfIncident": "09/08/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817624,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFOTAMENT SYSTEM FREEZES, TURNS ON AND OFF RANDOMLY  PARK WILL NOT HOLD AND THE VEHICLES WILL ROLL INTO PARK; IT FAILS TO HOLD AND VEHICLE ROLLS WHEN BRAKE PEDAL IS RELEASED  WHEN BRAKING OR ACCELERATING, A NOISE IN REAR OF VEHICLE, LIKE CLUNKING OR A POPPING SOUND, CAN BE HEARD",
        "vin": "2G1FF1E36F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/19/2015",
        "dateOfIncident": "12/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED HAVING PROBLEMS WITH THE GAS,PUMP AND NOW THE ENGINE,  IT'S BECAME A DIFECTIVE CAR FOR ME AND I DON'T WANT IT.",
        "vin": "261FD1E36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "09/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781105,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE MADE A JERKING MOTION, THE STEERING WHEEL SEIZED, AND THE ENGINE STALLED. THE CONTACT ALSO STATED THAT THE ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO A DEALER FOR DIAGNOSTIC TESTING. THE MECHANIC STATED THAT THE ENGINE CONTROL MODULE BURNED OUT, AND NEEDED TO BE REPLACED. THE ENGINE CONTROL MODULE WAS REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,000.",
        "vin": "2G1FB1E30F9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/04/2015",
        "dateOfIncident": "11/30/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746181,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET CAMARO. WHILE ON AN INCLINE WITH THE BRAKE PEDAL DEPRESSED, THE MESSAGE 'HILL START ASSIST IS ON\" WAS DISPLAYED ACROSS THE MESSAGE BOARD. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE DEALER WAS UNABLE TO DIAGNOSE OR REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 3,000.   UPDATED 09/25/15*LJ",
        "vin": "2G1FJ1EW6F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAMARO LS 2015 - JUNE 26, 2015  CAR MILAGE AT TIME OF FIRST INCIDENT 115 MILES    STALLED X 3    #1 JULY 2, 2015 WHILE DRIVING 20 MILES PER HOUR (ENGINE SHUT DOWN, PUT CAR IN NEUTRAL AND STOPPED, CAR RESTARTED).  #2 JULY 3, 2015 WHILE DRIVING 45 MILES PER HOUR IN MODERATE TRAFFIC (ENGINE SHUT DOWN, PUT IN NEUTRAL WHILE DRIVING, CAR RESTARTED).  #3 JULY 3, 2015 WHILE DRIVING HOME, ANOTHER ENGINE SHUT DOWN IN MODERATE TO HEAVY TRAFFIC AT 45 MILES PER HOUR, PUT IN NEUTRAL WHILE DRIVING, CAR RESTATED).    EACH OF THE ABOVE SHUT DOWN EVENTS SHOWED NO RPM WITH SUDDEN SLOWING OF VEHICLE IN TRAFFIC. I AVOIDED THE BRAKES FOR FEAR OF INCREASING RISK OF REAR END COLLUSION.  IF SUCH AN EVENT OCCURRED ON A FREEWAY ON MODERATE TO HEAVY TRAFFIC, AT A SPEED OF 65 MILES PER HOUR WOULD CREATE A SERIOUSLY UNSAFE SITUATION.    THE CAR IS UNSAFE AND I HAD THE DEALERSHIP PICK UP THE CAR FROM MY HOME 7-6-15.",
        "vin": "2G1FB1E30F9"
    },
    {
        "components": "STEERING,SUSPENSION,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/11/2015",
        "dateOfIncident": "02/16/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED ON 2/14/15-2 DAYS AFTER PURCHASED CAR SEAT BEGAN SQUEAKING & DRIVER SEAT CUSHION FRAME REPLACED. 2 WEEKS LATER THE CAR WAS HAVING STEERING ISSUES & POPPING NOISE WHILE DRIVING. THE CAR WAS SERVICE ON 3/10/15 & REPLACED PROPELLER SHAFT FLANGE NUT, CLEAN & APPLY THREAD ADJUSTED REAR CAMBER ON RR AND REAR TOE ADJUSTED RF CAMBER & ADJUSTED FRONT TOE. ON 3/16/15, CAR WAS SERVICED DUE TO CRACKING NOISE FROM UNDERNEATH & THE DIFFERENTIAL CARRIER DRAIN OR PLUG REPLACEMENT WAS MADE; IN ADDITION ADDED FRICTION MODIFIER TO REAR DIFFERENTIAL TO REDUCE NOISE, ON THIS REPAIR ATTEMPT I WAS ALSO GIVEN A NEW 2015 CAMARO WHICH ALSO HAD SQUEAKING NOISE COMING FROM THE PASSENGER WHICH I INFORMED MAC HAIK OF AND THEY STATED THEY NEEDED TO CHECK ALL VEHICLES TO SEE IF THIS WAS AN ISSUE. ON 3/27/15, CAR MADE KNOCKING NOISE ON STOPPING & TAKE OFF THE CAR WAS DRIVING WITH GM TECH BRIAN WHO HEARD THE SAME NOISE COMING FROM THE FRONT OF CAR. PER REPAIR ORDER IT STATED THAT THE NOISE WAS NOT ABLE TO BE DUPLICATED, HOWEVER WAS ADVISED BY TECHS THAT ALL SUSPENSION WAS TAKEN DOWN & PLACED BACK TOGETHER,  SWOOSHING NOISE THAT I HEAR WHEN BACKING UP BOTH WERE NOT ABLE TO BE DUPLICATED PER MAC HAIK. ON 5/5/15, THE RADIATOR HOSE CAME LOOSE PER THE REPAIR ORDER CLAMPS WERE NOT PLACED ON PROPERLY. I HAVE ALL RECORDS OF SPEAKING WITH GM REPS AS WELL AS MAC HAIK REPS AND TO NO AVAIL WAS I ABLE TO GET HELP. I HAVE AN ATTORNEY AS OF TODAY AND GM WAS GIVING ONE FINAL ATTEMPT TO MAKE THE CAR RIGHT ON 5/21/15 FOR ALL ISSUES WITH THE CAR: SWOOSHING NOISE, CLUNCKING NOISE WHILE DRIVING, WOBBLING NOISE WHEN DRIVING AT 50MPH OR MORE, CLICKING NOISE WHEN PUTTING CAR IN GEAR, CAR SMELLS OF OVERHEAT, ON LEFT TURN HEARD A LOUD SPRING POPPING NOISE FROM CAR. THE CAR WAS GIVING BACK TO ME ON 5/22/15, AND PER THE TECH THERE WAS NOT REPAIRED, SIMPLY JUST LOOKED AT.",
        "vin": "2G1FB1E36F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/30/2015",
        "dateOfIncident": "02/05/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722386,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS NO INCIDENT. MY COMPLAINT IS, THIS VEHICLE HAS VERY LITTLE METAL. I PUT A MAGNET UP TO EVERY PANEL AND IT DIDN'T STICK ANYWHERE.I'M PAYING $30,000. FOR PLASTIC!!! THE WHOLE CAR INSIDE AND OUT!! THEY EXPECT A FEW LITTLE AIR BAGS TO PROTECT ME IN A CRASH? I'M DEAD.",
        "vin": "2G1FB1E34F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED A 2015 CHEVY CAMARO CONVERTIBLE AS A RENTAL CAR. THIS CAR WAS FRESH OFF THE DELIVERY TRUCK WITH ONLY 6 MILES ON THE ODOMETER. BETWEEN THE AIRPORT AND OUR FINAL DESTINATION THAT EVENING, WE RACKED UP APPROXIMATELY 55 MILES. IN THAT TIME, THE CAR (ENGINE) STALLED/LOST POWER/CUT OUT 3 TIMES AS OF WRITING THIS COMPLAINT. THERE WAS NO LOSS OF BRAKES OR STEERING. THE CAR WAS PROVIDED WITH A TRADITIONAL KEY AND NOT THE GM SWITCHBLADE, AND THE DRIVER WAS NOT SITTING CLOSE ENOUGH TO BUMP THE KEY INTO THE OFF POSITION. THIS IS OBVIOUSLY NOT NORMAL, AND I AM NOT THE ONLY ONE THAT HAS EXPERIENCED THIS PROBLEM. WHOEVER IS AT FAULT, GM OR THE RENTAL COMPANY FOR IMPROPER INSPECTION BEFORE PUTTING THE CAR IN THE RENTAL FLEET, NEEDS TO RESOLVE THIS ISSUE AS IT IS DANGEROUS AND POTENTIALLY DEADLY.   *TR",
        "vin": "2G1FK3DJXF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "12/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMOBILE INEXPLICABLY LOST POWER, TWICE,  (ENGINE STOPPED, NO POWER STEERING OR BRAKES) WHILE DRIVING ON ROUTE 4 FROM LAKELAND TO THE ORLANDO INTERNATIONAL AIRPORT. AN INQUIRY OF THE RECALL DATABASE REVEALS THAT THESE VEHICLES WERE SUBJECT TO A RECALL TO ADDRESS THIS SPECIFIC EVENT. THIS VEHICLE WAS NOT PROPERLY SERVICED FOR THIS RECALL BY HERTZ RENT A CAR AND SHOULD HAVE NEVER BEEN IN THEIR RENTAL FLEET PUTTING MY LIFE AT RISK. RES # G3801958844. RR65215040.   *JS",
        "vin": ""
    }
]