[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "11/11/2017",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046591,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RT",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 9/2015, AS OF 11/16/17 HAVE 15,101 MILES.  I AM REPLACING MY SECOND REAR SHOCK. THE ORIGINAL SHOCK BROKE AFTER 11 MONTHS, THE REPLACEMENT SHOCK BROKE WITHIN THE LAST 30 DAYS. HAVING TO HAVE A THIRD REAR SHOCK REPLACEMENT. THE WEIGHT LIMIT WAS NEVER EXCEEDED, THERE ARE NO SIGNS OF ABUSE OR NEGLECT. THE SPYDER HAS HAD ALL OF ITS REGULAR MAINTENANCE PERFORMED ON SCHEDULE AND BY A LICENSED BRP/CAN AM REPAIR CENTER.  ALL THREE TIMES THIS HAS HAPPENED HAS BEEN AFTER LONG-DISTANCE TOURING TRIPS, EACH THAT LASTED 6-8 DAYS AND COVERED BETWEEN 1600-2400 MILES; BASICALLY FROM FLORIDA UP TO NC, VA, AND NORTHERN GA, SPECIFICALLY.  WHAT CAUSED ME TO NOTICE THERE WAS A PROBLEM WERE A) THE STABILITY CONTROL LIGHT CAME ON WHEN TURNING THE VEHICLE, B) ROUGH RIDING CONDITIONS ON SMOOTH INTERSTATE SURFACES, AND C) EXTREME \"BOUNCING\" GOING ACROSS ROAD LEVELS.",
        "vin": "2BXNBDD24FV"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2017",
        "dateOfIncident": "10/16/2017",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034577,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RT",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CAN-AM SPYDER RT. WHILE DRIVING VARIOUS SPEEDS, THE BOLT ON THE FRONT SPROCKET BECAME DETACHED FROM THE VEHICLE. THE CONTACT HEARD A LOUD NOISE COMING FROM THE VEHICLE DUE TO THE SPROCKET BECOMING WORN DOWN BY THE SHAFT. IN ADDITION, THE BELT THAT WAS SUPPOSED TO BE CENTERED BY THE SPROCKET BECAME MISALIGNED. GAINESVILLE MOTORSPORTS IN GAINESVILLE, GEORGIA WAS UNABLE TO DETERMINE WHY THE BOLT BECAME REMOVED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 13,500.",
        "vin": "2BXNBDD23FV"
    }
]