[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2021",
        "dateOfIncident": "10/19/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442174,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle burst into flames while driving 70 mph on highway.",
        "vin": "1gys4nkj2fr"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "09/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 Cadillac Escalade had 65,186 miles on it.  Was driving home with family and the engine started knocking.  The code that was reported was P0300.  Constant engine misfire.  The replaced it under factory warranty.  1 year later, the same thing happen.  Was driving with the family and engine started misfiring.  Had it in the shop a couple of weeks before for preventive maintenance.  Nothing was called out with the vehicle.  Now GM is trying to charge me $9700 to replace the engine that was suppose to be new.  Very disappointing that I am a long time consumer with 2 Cadillac's and treated like I did something wrong be Service Manager.  This engine is faulty and needs to be recalled!",
        "vin": "1GYS3BKJ8FR"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421586,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought the vehicle on May 27, 2021. I filled the tank with 87 octane on 3 separate occasions between May 27 and June 4, 2021.The engine (6.2L V8 L86 EcoTec) shut off during a trip on May 31, 2021. I was pulling into a restaurant and there were no indicators of any issues. While pulling up into the drive thru, the engine lost power. No Check Engine Light appeared at all. On a second trip (June 6, 2021), the engine again lost power while coming off of a highway exit. This time, I experienced loss of acceleration and then the vehicle shut off as I pulled into a parking lot. Both times I had to put the vehicle into park, shut off and then start back up. Again, no Check Engine Light. I drove the car to an auto parts store to buy a fuel additive. It was driving roughly at this point, but as I pulled into the parking lot, again a loss of power from the engine. It never started back up. Each time the vehicle shut off, I was driving it, not parked or stopped. There were also no indicators of any malfunction.",
        "vin": "1GYS4SKJ0FR"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/22/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Front shocks had to be replaced on our Cadillac 2015 Escalade. Right Front shock was leaking oil at 81K miles, repair 26 March, Red Noland Cadillac, CO. Informed service associate at the time, and then worked with the Service Manager after that. The Service Manager  informed me of the GM service number I could call 1-800-333-4233 for customer service/good will request. At that number, Julia with GM stated the call needed to be done PRIOR to the repair, supervisor assist was requested but not made available. I've owned several GM products, and appreciated the quality and responsiveness to service issues. I hope GM can do better, and restore my faith in GM quality.  During BBB process, GM avoided the issue(s) of their maintenance process and the shock absorber being outside of normal failure rates.  Shocks failing/leaking oil at this age are well outside 'normal' expectations and points to a recall issue.",
        "vin": "1GYS4NKJ3FR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403682,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS NOT SHIFTING PROPERLY.  JUMPS BETWEEN LOWER GEARS.  FOLLOWED THE FIX GM RECOMMENDED WHICH CHANGED THE TRANSMISSION OIL TO ONE OF A DIFFERENT TYPE AND VISCOSITY.  WORKED FOR AWHILE BUT SHIFTING ISSUES HAVE COME BACK.  A BIT DISCONCERTING WHEN IT DOES IT. STARTLES AND DISTRACTS THE DRIVER AND CAN CAUSE POTENTIAL OVER-COMPENSATION AND BRAKING. NOTICED MORE AS WINTER IS TRANSITIONING TO SPRING.",
        "vin": "1GYS4SKJ7FR"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397686,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY 2015 ESCALADE ESV IN THE SHOP FOR A SOFTWARE UPGRADE AND WAS INFORMED THAT BOTH MY RADIATOR AND FRONT STRUTS WERE LEAKING.  MY TRUCK HAS 40,677 MILES ON IT.  THE DEALER QUOTED  ME 1,532 FOR THE RADIATOR AND 1,822 FOR THE FRONT STRUTS.",
        "vin": "1GYS4SKJ9FR"
    },
    {
        "components": "POWER TRAIN,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390718,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE AND SHIFTING FROM 1-2 THE VEHICLE JERKS VERY HARD. I HAVE TAKEN IT TO THE DEALERSHIP 3 TIMES AND THE DID ALL REQUIRED UPDATES NEEDED. ON THE 3RD VISIT THE DEALERSHIP SAID THIS IS A KNOWN ISSUE AND THERE IS NO REPAIRING IT. THEY SAID GM UPDATED THE TRANSMISSION IN 2019 AND HAVE NOT HAD ISSUES SINCE. WHY WOULD THEY NOT PROVIDE THE UPDATED TRANSMISSION TO ALL PRIOR VEHICLES IF IT REMEDIES THE ISSUE? WHILE DRIVING MY CAR SHIFTS SO HARD SOME TIMES IT THROWS ME FORWARD. THIS OCCURS WHEN ACCELERATING FROM A STOP LIGHT ON THE ROAD OR STOP AND GO TRAFFIC ON THE HIGHWAY.     AS FOR THE REVERSE ISSUE, THE CAR WILL ABRUPTLY ENGAGE THE BRAKING SYSTEM MAKING IT SEEM AS OF YOU HIT SOMEONE OR SOMEONE HIT YOU WHILE IN REVERSE. THIS OCCURS MAINLY WHEN REVERSING INTO A PARKING STALL.  IT IS HIGHLY DANGEROUS AND CAN CAUSE WHIPLASH TO SOMEONE WHO IS NOT AWARE IT CAN OCCUR.",
        "vin": "1GYS4UKJ6FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382906,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIATOR HAD TO BE CHANGED BECAUSE OF LEAKS IN IT. IT SEEMS TO BE COMMON PROBLEM AND SHOULD BE RECALLED TO COVER EXPENSES ON IT. HAPPENS WITH REGULAR USE.",
        "vin": "1GYS4MKJ0FR"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376023,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE SEAT BELT LOCKED UP AND A BURNING SMELL EMITTED FROM THE DRIVERS SIDE SEAT BELT POST. NO ACCIDENT OCCURED AND NO WARNING AS TO WHY IT HAPPENED. CHEVROLET DEALER SAID NOTHING APPARENTLY CAUSED IT. IT JUST LOCKED UP. VEHICLE WAS STATIONARY",
        "vin": "1GYS4CKJ5FR"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "10/26/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11375347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A TWO LANE HIGHWAY AND I SUDDENLY LOST CONTROL OF THE STEERING WHEEL. THE STEERING WHEEL BECAME VERY HARD TO MANEUVER CAUSING ME TO VEER OUT OF MY LANE  CAUSING A CRASH. THE AIRBAGS ALSO DID NOT DEPLOY FULLY CAUSING ME TO HAVE A DISLOCATED SHOULDER AND BROKEN RIBS. THE CAR ALSO CAUGHT ON FIRE DURING IMPACT AND I HAD TO BE PULLED FROM THE VEHICLE. THE RECALL REGARDING THE STEERING WHEEL LOCKING UP ON ME IS MOST LIKELY THE REASON I LOST CONTROL OF THE VEHICLE.",
        "vin": "1GYS4NKJ2FR"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "02/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 6,
        "odiNumber": 11373186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE. THE CONTACT STATED WHILE EXITING A PARKING SPOT, WHEN THE VEHICLE SEIZED. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TOT DRIVABLE. THE VEHICLE WAS TOWED ORR CADILLAC LOCATED AT 8750 BUSINESS PARK DR, SHREVEPORT, LA 71105,  (318) 798-7250, WHERE IT WAS DIAGNOSED WITH NEEDING STARTER AND BATTERY TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT 1 MONTH LATER SHE EXPERIENCE THE FAILURE FOR A SECOND OCCASION. THE VEHICLE WAS TOWED LOCAL DEALER ORR CADILLAC GMC LOCATED AT 400 TX-63 SPUR, LONGVIEW, TX 75601,(903) 757-6600, WHERE IT WAS DIAGNOSED WITH NEEDING UNKNOWN WIRING TO BE REPLACED. THE VEHICLE WAS REPAIRED AT THE MOMENT. THE CONTACT STATED ON 7/1/2017 WHILE DRIVING 25 MPH, WHEN THE VEHICLE WAS SEIZED AND THE STEERING WHEEL ALSO SEIZED CAUSING HER TO LOSS CONTROL AND COLLIDE INTO TREE. BOTH FRONTAL AIRBAGS DID DEPLOY. THE CONTACT STATED SHE AND HER 5 CHILDREN'S SUSTAINED MINOR INJURIES (BRUISES) BUT DID NOT SEEK ANY MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO INDEPENDENT MECHANIC AND THEN TOWED TO LOCAL DEALER WAGNER CADILLAC LOCATED AT 4100 S BROADWAY AVE, TYLER, TX 75701,  (903) 705-0787, WHERE IT WAS DIAGNOSED WITH NEEDING TRANSMISSION, ENGINE, BRAKES, AIR BAGS, DASHBOARD, WINDSHIELD, ALL 4 TIRES AND RIMS  TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT STATED SHE HAD EXPERIENCE THE FAILURE AROUND 14 TIMES IN TOTAL. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 46,000.",
        "vin": "1GYS3JKJ1FR"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE. THE CONTACT STATED THE VEHICLE WAS EQUIPPED WITH THE AUTOMATIC BRAKING SYSTEM. RECENTLY, WHILE DRIVING AT AN UNDISCLOSED SPEED, THE AUTOMATIC BRAKING SYSTEM SUDDENLY ACTIVATED WITHOUT WARNING, STOPPING THE VEHICLE IN THE MIDDLE OF TRAFFIC ALMOST CAUSING A CRASH. THE FAILURE RECURRED TEN TIMES OVER THE PAST SIX MONTHS. THE CONTACT HAD NOT SPOKEN TO A DEALER OR THE MANUFACTURER REGARDING THE FAILURES. THE FAILURE MILEAGE WAS 96,000.",
        "vin": "1GYS4TKJ6FR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343905,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DELAMINATION OF CUE SCREEN RESULTING IN THE FOLLOWING SAFETY ISSUES:  1. BACK UP CAMERA SYSTEM INOPERABLE  2. BLUETOOTH CONNECTIVITY NOT ABLE TO BE ACCESSED  3. GPS UNABLE TO BE ACCESSED FORCING USER TO USE CELL PHONE CREATING A SAFETY HAZARD  4. RADIO AND ALL COMPONENTS OF IT ARE INOPERABLE   5. KEY FUNCTIONS OF CUE DISPLAY ARE INOPERABLE AND NON-RESPONSIVE",
        "vin": "1GYS3SKJ4FR"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337396,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE STOPS RUNNING WHEN I AM PLACING IT IN REVERSE OR MAKING SLOW TURNS.  THE CAR TURNS OFF AND THE DRIVER ASSIST SCREEN TURNS OFF (CAMERAS DO NOT WORK) AND THEN MY CAR SAYS 'SERVICE: DRIVER ASSIST'.  I HAVE BEEN DRIVING AT A LOW RATE OF SPEED ON THE STREET AND MY CAR STOPS RUNNING AND THE STEERING WHEEL BECOMES VERY TIGHT AND HARD TO TURN.  WHEN I AM BACKING INTO A PARKING SPACE, MY STEERING WHEEL IS HARD TO TURN AND THE CAR SHUTS OFF AND THE SCREEN THAT SHOWS MY CAMERAS GOES OUT AND THEN THE CAR COMES BACK ON.  IT IS VERY SCARY.  I AM VERY AFRAID THAT THE CAR WILL STOP RUNNING WHILE IN MOTION AGAIN AND CAUSE AN ACCIDENT.  I HAVE CONTACTED ONSTAR ABOUT THIS AND REQUESTED ROADSIDE ASSISTANCE, IT WAS THE WEEKEND AND THEY WOULD NOT SEND THEM.  THE CAR TURNING OFF HAS OCCURRED MORE THAN 7 TIMES IN THE PAST MONTH.  IT STARTED IN APRIL 2020.",
        "vin": "1GYS4TKJ8FR"
    },
    {
        "components": "STEERING,POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "1) AIR BAG LIGHT COMES ON IN VEHICLE.  2) R-134 LEAKS   3) BODY AND OR REAR REVERSE LIGHT FIXTURE HAS CONDENSATION AND WATER GETS IN AREA IN FRONT OF SUNROOF.  4) REAR BACK DOOR NO UNLOCK ALL THE TIME.   5) POWERTRAIN WORK PERFORMED AT DEALER AND EXPERIENCING SLIPPING.  6) STEERING COLUMN NOISE/CLUNK",
        "vin": "1GYS4JKJ7FR"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/19/2020",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317411,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 CADILLAC ESCALADE. CONSUMER WRITES IN REGARDS TO DEFECTIVE BRAKES. *LD    CONSUMER STATES THAT VEHICLE HAS HAD MANY PROBLEMS. CONSUMER TOOK VEHICLE TO NAPLETON (ROCKFORD, IL) BECAUSE CHECK ENGINE LIGHT CAME ON AND VEHICLE WAS RUMBLING AND SHUDDERING. A NEW HARNESS WAS INSTALLED INSIDE THE TRANSMISSON. IN 09/2019 CONSUMER RECEIVED A SAFETY RECALL FOR THE BRAKES OF VEHICLE AND THEY SUBMITTED A REIMBURSEMENT REQUEST TO MANUFACTURER. *DL",
        "vin": "1GYS4NKJ5FR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300785,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CADILLAC ESCALADE HAS SPENT MORE THAN 2 MONTHS IN THE CADDILAC DEALERSHIP TO TRY AND RESOLVE ISSUES SURROUNDING THE TRANSMISSION.  THIS CAR OVER TIME HAS SHOWN SIGNS OF SHUDDERING, MIS-SHIFTING, JOLTING AND DIVING.  MOST RECENTLY THE CAR SHIFTS FROM 2ND TO 1ST BELOW 20MPH CAUSING THE REAR WHEELS TO SPIN AND MAKING THE CAR UNSAFELY JOLT FORWARD.     NOTHING SEEMS TO RESOLVE THIS ISSUE AND THE CAR IS UNSAFE FOR ME AND MY FAMILY.  I HAVE TRIED TO WORK WITH THE DEALERSHIP OVER THE LAST 1.5 (4 VISITS) YEARS AND EVERY TIME THERE IS A NEW FLUID OR A NEW REPROGRAM THAT GM MAKES THEM TRY.    MOST RECENTLY I OPENED A CASE WITH GM: 9-576-707-5930 BECAUSE THE DEALERSHIP HAS NO OTHER OPTIONS ON FIXING THE CAR.",
        "vin": "1GYS4TKJ0FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290043,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS SLIPPING .. CORPUS CHRISTI TEXAS",
        "vin": "1GYS4PKJ0FR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION/ DRIVE TRAIN HAS DISTINCT CLUNKING NOISE WHEN EITHER ACCELERATING AND OR DECELERATING.  THERE IS A DISTINCT DELAY SURGE WHEN ACCELERATING FROM STOP AND OR SLOWING DOWN AT SLOW SPEEDS AND OR FROM SLOPED STREETS.  THE CLUNKING AND JERKING IS NOT SAFE AND CONDUCIVE TO NORMAL DRIVING AND OPERATING.PARAMETERS.  THE DELAYED SURGING AND JERKING CREATES AN ABNORMAL ACCELERATION BOTH IN THE VEHICLE AND FOR SURROUNDING TRAFFIC WHEN STARTING FROM A RED LIGHT OR STOP SIGN.  GM DEALERS/ REPAIR FACILITY TECHS ARE AWARE OF THIS SAFTETY/DESIGN DEFECT YET GM HAS YET TO ADMIT/ AND OR ACKNOWLEDGE AND OR PROVIDE A FIX FOR THIS SAFETY PROBLEM.  THIS VEHICLE HAS BEEN IN FOR REPAIR OF THIS PROBLEM MANY NUMEROUS TIMES BUT GM DOES NOT OR WILL NOT FIX THIS SAFETY DEFECT WITHOUT FIRST ACKNOWLEDGING THIS. PROBLEM!   THIS HAS BEEN AN ONGOING PROBLEM SINCE THE VEHICLE WAS NEAR BRAND NEW.  ORIGINAL TRANSMISSION WAS REPLACED AND VEHICLE HAS BEEN IN FOR THIS PROBLEM STILL, AND TO THIS CURRENT MILEAGE, OVER 65.000 MILES THIS SAFETY PROBLEM IS WORSENING!",
        "vin": "1GYS3MKJ2FR"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "09/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2015 CADILLAC ESCALADE ON 9/6/2019 FROM MCGOVERN HYUNDAI IN BROCKTON, MASSACHUSETTS. THE VEHICLE WAS BEING SOLD AND ON DISPLAY AND WAS TRANSPORTED FROM THE MCGOVERN BUICK GMC DEALERSHIP IN MANSFIELD, MASSACHUSETTS. THE VEHICLE IDENTIFICATION NUMBER OR VIN NUMBER IS [XXX]. SINCE I BOUGHT THE VEHICLE, I HAVE HAD TO RETURN IT TO THE DEALERSHIP A TOTAL OF 3 TIMES WITHIN 7 DAYS, 8 TIMES WITHIN 30 DAYS AND 10 TIMES WITHIN 45 DAYS. THE MOST RECENT WAS ON 11/4/2019 OF WHICH THE DEALERSHIP IGNORED MY CONTINUOUS APPEALS TO FIX THE ENGINE NOISE(S) AND ASKED THAT I CONTACT MASTRIA IN RAYNHAM MASSACHUSETTS AND DEAL WITH THEM BECAUSE THE CAR WAS THERE FOR REPAIR AND HAVE THEM DEAL WITH MY CONCERNS. MY VEHICLE HAS BEEN OUT OF SERVICE FOR REPAIRS FOR A TOTAL OF 14 DAYS. INITIALLY, WHEN I REQUESTED MC GOVERN HYUNDAI  THAT IT BE REPAIRED, I WAS TOLD BY THE SERVICE DEPARTMENT THAT THE PART AND/OR PARTS WERE IN BACK ORDER AND THAT THE UAW WAS ON STRIKE. I HAVE HAD TO DRIVE FROM FALL RIVER TO BROCKTON FOR ALL OF THESE ISSUES. KEEPING IN MIND THAT MCGOVERN DEALERSHIP IN MANSFIELD IS A BUICK GMC DEALER, I HAD INITIALLY BEEN IN CONTACT WITH THE SALESPERSON, TOM, AND ON 9/10/2019, 9/11/2019 AND 9/12/2019, I DROVE TO THE HYUNDAI DEALERSHIP AFTER WORK FOR HIM TO WITNESS THE ISSUES INCLUDING THE ISSUE WITH THE ENGINE GETTING PROGRESSIVELY WORSE.I NOTIFIED THE HYUNDAI SERVICE DEPARTMENT ABOUT THE ISSUES THAT I WAS HAVING AND THAT THE APPLIQUE ON THE DRIVER?S PASSENGER SIDE WAS LOOSE OR BROKEN. SHE STATED THAT THE UAW WAS ON STRIKE AND THAT SHE WOULD TAKE CARE OF IT. TO DATE APPLIQUE HAS NOT BEEN FIXED. I HAVE CONTACTED THEM NUMEROUS TIMES AND THEY TELL ME TO CONTACT MASTRIA GMC IN RAYNHAM MA.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GYS4RKJ9FR"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276946,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE. WHEN THE VEHICLE WAS PLACED IN REVERSE, THE BACK UP CAMERA WENT BLANK AND FAILED TO DISPLAY AN OBJECT. THE FAILURE OCCURED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO FAULKNER CADILLAC (6726 CARLISLE PIKE, MECHANICSBURG, PA 17050, (717) 691-2000) FOUR TIMES WHERE THE CAMERA AND NEW WIRES WERE REPLACED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "1GYS4BKJ2FR"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267240,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THIS CAR A MONTH AGO AND ALREADY BEGAN WITH PROBLEMS. IT HAS 50K MILES. THERE IS A STRANGE CLUCK COMING FROM THE TRANSMISSION ARE WHILE DRIVING AND GETS WORSE WHEN GEARS DOWN.    ALSO THE RECYCLE AIR SYSTEM DOES NOT WORK. BAD SMELLS COME FROM THE OUTSIDE.",
        "vin": "1GYS4RKJ9FR"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256296,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 KIND OF LIKE ASKING LATE 8 SPEED TRANSMISSION PROBLEMS SHUDDERING SHAKING  NEED A NEW TRANSMISSION  TOOK IT TO THE DEALERSHIP 12 TIMES  THEY DID SEVERAL TRANSMISSION FLUSHES DID NOT FIX THE PROBLEM",
        "vin": "1GYS4TKJ7FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A COMPLETE STOP I TURNED LEFT  INTO A STORE PARKING LOT. DRIVING FOWARD TO FIND A PARKING SPOT AND THE TRUCK SHUT OFF WITHOUT WARNING AND ROLLED TO A STOP NO WARNING LIGHTS WERE ON AND THE PUSH START LIGHT WAS STILL LIT UP GREEN I PUT IT INTO PARK AND PUSHED THE START ENGINE BUTTON AND IT STARTED RIGHT AWAY .",
        "vin": "1GYS4TKJ3FR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR, AT TIMES, FAILS TO ENGAGE INTO DRIVE, WHEN AT A STOP. ALSO, WHILE DRIVING, CAR, AT TIMES, WILL NOT ADVANCE TO THE NEXT GEAR UPON ACCELERATION.  ALSO, WHILE DRIVING AT CONSTANT SPEED, CAR SHUDDERS AND CANNOT MAINTAIN THE PROPER GEAR.",
        "vin": "1GYS4TKJ1FR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE EQUIPPED A FRONT CAMERA (23171580) TO PROVIDE  LANE DEPARTURE WARNING,  COLLISION WARNING, AUTO BRAKE FUNCTION, BUT AFTER A FRONT WINDOW GLASS CHANGE, ALL THESE FUNCTIONS ARE NOT AVAILABLE, AND AFTER RESEARCH, WE FOUND GM REQUIRE A 30 MINUTES RE-CALIBRATE WINDOW, AFTER THAT I HAVE TO REPLACE A NEW CAMERA.    IN GM SERVICE INSTRUCTION DOCUMENT SB-10057012-2409.PDF, IT SAID: IF AFTER 30 MINUTES THE ORIGINAL CAMERA WILL NOT CALIBRATE, REPLACE THE FRONT VIEW CAMERA.  GM PROVIDE A FREE REPLACEMENT TO VEHICLES UNDER THE BUMPER-TO-BUMPER COVERAGE, THEY KNEW THIS PROBLEM CLEARLY.    THESE FUNCTIONS ARE IMPORTANT TO THE SAFETY OF THIS VEHICLE, AND NOW IT'S A THREATEN FOR SOME FUNCTIONS ARE NOT AVAILABLE. I WANT GM RECALL THESE CAMERAS OF REPLACE IT FOR FREE TO CUSTOMER NEEDED.",
        "vin": "1GYS4TKJ5FR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR AT 56000 MILES WOULD NOT SHUT OFF.  REASON WAS THE CHASSIS CONTROL,MODULE WAS IMPROPERLY DESIGNED AND WAS LEFT EXPOSED ALLOWING SNOW TO CORRODE THE MODULE.  CADILLAC REFUSED TO PAY FOR THE REPAIR THAT INCLUDED $650 IN DIAGNOSTIC TIME",
        "vin": "1GYS4TKJ6FR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING INTO OUR STREET THE VEHICLE SHUT OFF. IT RESTARTED BUT STILL CONCERNED.",
        "vin": "1GYS4TKJ9FR"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195210,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "S10 DOT/I: LETTER FROM CONGRESSMAN CLINE ON BEHALF OF CONSTITUENT REGARDING THE DIFFICULTY SHE IS EXPERIENCING WITH HER 2015 CADILLAC ESCALADE (ATTN: KJERSTEN CROKE). *LD    THE CONSUMER STATED THE VEHICLE'S RADIATOR LEAKED DUE TO EXCESSIVE RECYCLING OF THE THERMOSTAT. COOLANT WAS LEAKING FROM THE RADIATOR TUBES. THIS FAILURE WAS REPAIRED PER THE TECHNICAL BULLETIN 9I1513E. THE VEHICLE WOULD VIBRATE. REPAIRS WERE ATTEMPTED, BUT THE VIBRATIONS RECURRED. THE TRIM ON THE DRIVERS SIDE WAS LOOSE. THE INTERIOR AND EXTERIOR LIGHTS WOULD REMAIN ON AFTER THE VEHICLE WAS POWERED OFF CAUSING THE BATTERY TO DIE. THE DEALERSHIP WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE.  *JS",
        "vin": ""
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194586,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE. WHILE DRIVING 60 MPH AND SWITCHING LANES, THE SIDE DETECTION OFF WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO QUANTRELL CADILLAC (1490 E NEW CIRCLE RD, LEXINGTON, KY 40509, (859) 559-0868) WHERE IT WAS DIAGNSOED THAT THE DRIVER'S SIDE COLLISION AVOIDANCE MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURE WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 69,362.",
        "vin": "1GYS4UKJ8FR"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD THIS VEHICLE SINCE 3-28-2019 AND I'M ALREADY HAVING SHIFTING PROBLEMS WITH THE VEHICLE. AFTER DOING SOME RESEARCH, I'VE DISCOVERED THAT THIS IS A COMMON ISSUE WITH CADILLAC. MY ESCALADE HAS 45,000 MILES ON IT, SO THIS SHOULDN'T BE A PROBLEM. I'M WORRIED ABOUT THIS HESITATION PROBLEM DURING DRIVING, WHICH MAY LED TO A POTENTIAL ACCIDENT OR WORSE.",
        "vin": "1GYS4PKJ0FR"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/27/2019",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191982,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE. THE CONTACT STATED THAT THE DRIVER AND PASSENGER SIDEVIEW MIRRORS WERE TOO SMALL AND OBSTRUCTED HIS VIEW WHILE DRIVING. THE VEHICLE WAS TAKEN TO CROWN CADILLAC (584 US-22, WATCHUNG, NJ 07069, (908) 922-4457) WHO STATED THAT LARGER MIRRORS COULD BE PURCHASED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 95,000.",
        "vin": "1GYS4CKJ2FR"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT STRUTS FROZE UP WHEN THEY DID IT PULLED TO THE LEFT ON TO ONCOMING TRAFFIC, MY WIFE WAS DRIVING. MY VEHICLE HAS 57100 MILES ON IT AND WHEN LOOKING INTO THE PROBLEM I FOUND I'M NOT THE ONLY ONE. GM KNOWS THERE IS A PROBLEM WITH THE SUSPENSION AND IS DOING NOTHING TO CORRECT THE PROBLEM. I AM VERY DISAPPOINTED IN THE REALLY EXPENSIVE VEHICLE. CAN YOU PLEASE LOOK INTO IT THANKS",
        "vin": "1GYS4CKJ9FR"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/23/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A CERTIFIED PRE-OWNED 2015 CADILLAC ESCALADE FROM A DEALER IN SAN DIEGO. I HAVE PUT APPROX 5K MILES ON THE VEHICLE IN THE 6 MONTHS THAT I'VE OWNED IT. IT HAS BEEN BACK AT THE DEALER FOR SERVICE FOUR TIMES (APPROX 30 DAYS TOTAL THE DEALER HAS HAD THE CAR) FOR THE SAME ISSUE, WHICH IS A SHUDDERING, HARD-SHIFT AND VIBRATION ISSUE WITH THE TRANSMISSION. THERE HAVE BEEN NO REPAIRS THAT HAVE REMEDIED THE ISSUE. THE DEALER CONTINUES TO FOLLOW A PROTOCOL PROCEDURE EACH TIME, NONE OF WHICH HAVE WORKED. I HAVE CONTACTED GENERAL MOTORS AND WILL ALSO BE PROCEEDING WITH A LEMON LAW CLAIM.",
        "vin": "1GYS3MKJXFR"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "10/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170223,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS VEHICLE IN 2017. AROUND LATE OCTOBER 2018, AT ABOUT 60,000 MILES I NOTICED THE RIDE BECAME VERY BOUNCY. I AM BEING TOLD BY THE DEALERSHIP THAT 3 SHOCKS AND STRUTS ARE BAD AND HAVE TO BE REPLACED ON A VEHICLE THAT IS 3 YEARS OLD. I COULD MAYBE UNDERSTAND IF 1 WAS BAD, BUT 3 GOING BAD THIS QUICKLY DOES NOT ADD UP. I'VE NEVER HEARD OF A VEHICLE HAVE 3 BAD SHOCKS AND STRUTS THIS QUICKLY AND CAN ONLY SURMISE THERE IS A DEFECT WITH THE PRODUCT.",
        "vin": "1GYS3BKJ3FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "09/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON I-40 IN OKLAHOMA AT NIGHT AND THE VEHICLE IN MOTION I HEARD A SHATTERING SOUND ON MY 2015 CADILLAC ESCALADE I PULLED TO THE SHOULDER ACTIVATING MY HAZARD LIGHT TO INSPECT MY VEHICLE I WENT AROUND MY VEHICLE TWO TIMES AND DID NOT NOTICE ANYTHING WRONG. AS I WAS GETTING BACK INTO MY VEHICLE I USED MY STEP TO GET IN AND NOTICED NOTICED THAT MY SUNROOF HAD SHATTERED. THERE WERE NO VEHICLES TRAVELING NEAR ME IN THE EASTBOND LANE WHEN THIS OCCURRED.",
        "vin": "1GYS4MKJ5FR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156718,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST RECEIVED THE POWER STEERING SOFTWARE UPDATE FOR THE LOSS OF POWER STEERING LAST WEEK. ABOUT FIVE OR SIX TIMES NOW THE STEERING HAS BEEN VERY HARD AND ALMOST IMPOSSIBLE TO TURN THE STEERING WHEEL. IT NEVER DONE THIS BEFORE THE SOFTWARE UPDATE",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "12/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HERE'S A YOUTUBE LINK FOR THE PREVIOUS COMPLAINT THAT I FILED..... IT IS FOR THE REAR HATCH LOCKING MECHANISM WITH AN OPEN FLAME. I PREVIOUSLY REPORTED THE REAR HATCH LOCKING MECHANISM FAILURE BACK IN APRIL MAY AND THE REAR HATCH WAS NOT LOCKING AND IT WAS NOT ACTUALLY CLOSING ALL THE WAY. MY GRANDDAUGHTER ALMOST FELL OUT OF THE BACK OF THE VEHICLE WHY WAS DRIVING DOWN THE ROAD. I DID ASK GM TO NOTE THE REAR HATCH LOCKING MECHANISM FAILURE ISSUE    .    HTTPS://YOUTU.BE/XCEHKNDDGHU    HTTPS://WWW.NHTSA.GOV/RECALLS?NHTSAID=11156479",
        "vin": "1GYS4MKJ8FR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "12/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THIRD TIME  I HAVE NOTICED A SOLID ROCK HARD BRAKE PEDAL FEEL AND THE VEHICLE DID NOT APPEAR TO SLOW WHEN I WAS TRYING TO APPLY THE BRAKES.",
        "vin": "1GYS4MKJ8FR"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN EXHAUST FUME RELATED COMPLAINT THAT IS ALSO RELATED TO AN ELECTRICAL COMPONENT FAILURE OF THE REAR HATCH LOCKING MECHANISM. WHEN THE REAR HATCH LOCKING MECHANISM IS NOT FULLY ENGAGED THE LIFTGATE IS NOT COMPLETELY CLOSED ALLOWING GAS FUMES TO ENTER THE VEHICLE AND IT HAS A REALLY BAD EXHAUST FUMES SMELL..... THE GAS IS ENTERING THE VEHICLE CO CARBON MONOXIDE HYDROCARBONS AND METHANE GAS CH4",
        "vin": "1GYS4MKJ8FR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "12/02/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD AN OPEN FLAME IN REAR HATCH LOCKING MECHANISM. I HAVE A VIDEO TOO.",
        "vin": "1GYS4MKJ8FR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152313,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VIBRATES EXCESSIVELY WHEN DRIVING. AT FIRST I THOUGHT IT WAS DUE TO ROAD CONDITIONS BUT THEN REALIZED THE VIBRATION RESIGNATES FROM MY VEHICLE DRIVETRAIN. TOOK IT TO DEALERSHIP AND THEY INFORMED ME IT'S MY TORQUE CONVERTER. APPARENTLY THERE ARE MANY COMPLAINTS WITH THIS ISSUE WITH 6 SPEED TRANSMISSION OPERATED VEHICLES FROM GM. STILL WAITING ON RECAL FROM GM TO BE PUBLISHED.",
        "vin": "1GYS4MKJ9FR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152363,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL LETTER OCTOBER 2018 STATING THE VEHICLE MAY EXPERIENCE A TEMPORARY LOSS OF ELECTRIC POWER STEERING.  I HAD  WORK DONE ON SEPTEMBER 24, 2018 AT CASTLE BUICK FOR THAT PROBLEM.  I SHOULD BE REIMBURSED FOR THE COST OF REPAIR THAT WAS COVERED BY MY OWN EXTENDED WARRANTY.  IT COST ME $1,037.18 PLUS $170.00 DEDUCTIBLE, WHICH TOTALS $1,207.18.  I THEN RECEIVED A LETTER DATED NOVEMBER 12, 2018 FROM CADILLAC CUSTOMER ASSISTANCE STATING THAT THE REPAIR THAT WAS PERFORMED AT GM WAS NOT THE REPAIR COVERED BY THE RECALL.  THE PROBLEM WAS FOR THE STEERING.  THE STEERING WHEEL WAS SNAPPING BACK WHEN I TRIED TO TURN WHICH WAS CAUSING MY WRIST TO BECOME SORE.  IT WAS A STEERING PROBLEM IN THE BEGINNING, AND I HAD NO CONTROL OVER THE AUTOMOBILE.  GM PUT A WHOLE NEW MOTOR ASSEMBLY IN THE CAR INSTEAD OF RECTIFYING THE PROBLEM OF THE SOFTWARE.",
        "vin": "1GYS4GKJ2FR"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST GAS ENTERS CABIN WHENEVER STATIONARY.  EVEN AT BRIEF TRAFFIC SIGNALS, FUMES QUICKLY ENTER VEHICLE.  CAR IS LESS THAN 4 YEARS OLD.",
        "vin": "1GYS4UKJ5FR"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142719,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED INTO THE GARAGE AND PUSHED THE BUTTON TO TURN THE ENGINE OFF.  THE VEHICLE WAS STILL IN DRIVE.  ALL DOORS LOCKED WHEN THEY WERE CLOSED.  I COULD NOT OPEN THE DOOR WITH THE BUTTON ON THE DOOR HANDLE EVEN THOUGH THE FOB WAS ON ME. I WENT TO THE BACK TO OPEN THE REAR HATCH.  I COULD NOT. THE VEHICLE STATED TO ROLL BACKWARDS - THERE IS NO INCLINE IN THE GARAGE - IT IS FLAT.  I USED THE FOB TO UNLOCK THE DOOR AND I WAS ABLE TO GET INTO THE CAR AND PUT IT IN PARK.  I HAVE VIDEO FROM MY OUTDOOR CAMERA.",
        "vin": "1GYS4NKJ1FR"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE. WHILE DRIVING 10 MPH AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FELT AS IF IT SHIFTED AND THE STEERING SEIZED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS SERVICED PER NHTSA CAMPAIGN NUMBER: 18V586000 (STEERING) AT OPEN ROAD CADILLAC (334 COLUMBIA TURNPIKE, FLORHAM PARK, NJ 07932, 973-538-5650); HOWEVER, THE FAILURES RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 88,500.",
        "vin": "1GYS4PKJXFR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133046,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "'CADILLAC CUE' CADILLAC CUE DOESN'T WORK. THERE IS A DEFECT IN THE LOWER MIDDLE PART OF THE SCREEN THAT DOESN'T WORK AT ALL. THIS IS A FACTORY MALFUNCTION. HAVE BEEN USED WITH CARE, CADILLAC CHARGES $2,000 TO GET IT FIX. MANY PEOPLE HAVE COMPLAINT ANOUT THIS PROBLEM FOR YEARS ON THEIR SCREENS, NOTHING HAS BEEN DONE.",
        "vin": "1GYS3CKJ9FR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/07/2018",
        "dateOfIncident": "11/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100439,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A KNOCKING / POPPING SOUND COMING FROM THE STEERING COLUMN ON TURNS AND LOW SPEED DRIVING. HAPPENS CONSTANTLY NOW AND WE'RE JUST OUT OF 50K WARRANTY BY 2000MI.",
        "vin": "1GYS3HKJXFR"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075968,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CADILLAC ESCALADE HAS BEEN IN THE SHOP FOR 50+ DAYS SINCE PURCHASING IN 2015 FOR DEFECTIVE BRAKES, TRANSMISSION, TRIM, TECHNOLOGY, CHASSIS, ELECTRICAL, AND HVAC. I HAVE CONTACTED GM AND THEY DON'T WANT TO REPURCHASE THE VEHICLE. THE VEHICLE IS CONSTANTLY IN THE SHOP FOR PROBLEMS AND IT IS NOT A VEHICLE THAT SHOULD BE OPERATED ON PUBLIC ROADWAYS. NUMEROUS PARTS OF MY TRANSMISSION HAVE BEEN REPLACED/REPROGRAMMED/REBUILT BEFORE DUE TO DEFECTS IN DESIGN AND BUILD QUALITY. THE TRANSMISSION CONSISTENTLY VIBRATES, JERKS AND SHUTTERS WHEN DRIVING, POPS AND CREAKS WHEN STOPPED AND CLUNKS WHEN LAUNCHING FROM STOP OR ROLLING STOP.  THE TRANSMISSION CAUSES THE CAR TO TAKE OFF IN 4TH GEAR RATHER THAN IN 1ST GEAR WHICH MEANS THE CAR FEELS AS IF THERE IS NO POWER TO PROPEL THE VEHICLE. THE TRANSMISSION SLIPS AND FEELS AS IF IT IS BROKEN. I HAVE TAKEN IT TO THE DEALER AT LEAST 14 TIMES AND GM NOW DOES NOT WANT TO REPLACE THE TRANSMISSION EVEN THOUGH THE DEALER HAS VERIFIED THE CONCERN AND DOCUMENTED IT. I FEEL THAT GM IS NOT DOING ENOUGH TO ENSURE SAFE VEHICLES ARE ON THE ROAD. THIS TRANSMISSION ISSUE IS GOING TO CAUSE AN ACCIDENT ONE DAY. I HAVE ALREADY PUT GM ON NOTICE ALL THE WAY UP TO THE EXECUTIVE LEVEL AND THEY DON'T WANT TO DO ANYTHING ABOUT IT. I FEEL THAT NHTSA SHOULD INVESTIGATE THE ISSUES THAT PLAGUE 2015 FULL SIZE GM SUV OWNERS. THERE ARE A LOT OF US OUT THERE ACCORDING TO MY RESEARCH.",
        "vin": "1GYS4TKJ6FR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CONDENSER AN MY WHOLE AIR CONDITIONING SYSTEM WENT OUT. I HAD TO GET IT COMPLETELY REDONE.",
        "vin": "1GYS3SKJ9FR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CUE SYSTEM GETS STUCK AN SOMETIMES IT CHANGES BUY ITSELF. IT WILL NOT LET YOU CHANGE THE  IT WILL FREEZE FOR A LONG PERIOD OF TIME.",
        "vin": "1GYS3SKJ9FR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCE SEVERAL TIMES WHEN I WENT BACK TO GET IN MY VEHICLE AN IT WOULDN'T START. I HAVE AN APPOINTMENT TO TAKE IT TO THE DEALERSHIP NEXT WEEK. IU AM SO UPSET WITH GMC.",
        "vin": "1GYS3SKJ9FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "05/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010423,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING STOPPED WORKING IN MAY 2017.  CALLED THE DEALERSHIP AND THEY TOLD ME THAT THERE WAS A HIGH NUMBER OF CARS COMING BACK WITH THE SAME PROBLEM- ASKED ME TO COME IN SO THEY COULD ASSESS.  CAME IN- 20 MINUTES LATER- THEY INFORMED ME THAT MY ISSUE WAS THE SAME.  CONDENSER WAS OUT.  PART WAS BACK ORDERED. I'VE NOW WAITED FOR 8 WEEKS AND THE PART IS STILL BACK ORDERED AND GM IS REFUSING TO GIVE US AN ETA WHEN ITS AVAILABLE.  DRIVING WITH NO AC DURING THE SUMMER IN HIGH TEMPS AND ON THE FREEWAYS HAS NOW AGGRAVATED MY DAUGHTERS ALLERGIES AND SHE IS NOW ON MEDICATION.  CAN'T SEEM TO GET ANY ANSWER FROM GM AND ITS NOT JUST ME.",
        "vin": "1GYS4BKJ3FR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE ESV. WHILE DRIVING IN THE RAIN, THE AIR CONDITIONER CONDENSER FRACTURED AND THE AIR CONDITIONER FAILED TO WORK. THE FAILURE CAUSED THE WINDOWS TO FOG UP AND IMPAIRED THE DRIVER'S VISIBILITY. THE VEHICLE WAS TAKEN TO THE DEALER (CADILLAC OF MAHWAH, NJ) WHO STATED THAT THE PART WAS UNAVAILABLE. THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT IT WAS A KNOWN ISSUE. THE MANUFACTURER PROVIDED THE CONTACT A RENTAL VEHICLE FOR THREE DAYS. THE VEHICLE WAS REPAIRED AFTER SEVEN WEEKS WHEN THE PART WAS LOCATED. THE CAUSE OF THE FAILURE AND REPAIR PART WERE NOT PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 7,500.",
        "vin": "1GYS4SKJ4FR"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001822,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES START VIBRATING WHEN HIT SPEEDS RANGING FROM 40 TO 60 MILES PER HOUR. DEALER DOESN'T TAKE SERIOUSLY..I AM VERY CONCERNED ABOUT THIS HUGE SAFETY ISSUE.",
        "vin": "1GYS3NKJ9FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DEFECT IN THIS VEHICLE WHERE THE LOWER ANCHORS (LATCH) FOR THE 2ND ROW PASSENGER SEAT ARE ASYMMETRIC - WITH THE INBOARD ANCHOR BEING BOTH LOWER, AND PROTRUDING FARTHER OUT, THAN THE INBOARD LOWER ANCHOR.     THIS VEHICLE HAS 2 CAPTAIN'S CHAIRS IN THE 2ND ROW - BOTH FEATURE LOWER ANCHORS (LATCH).     A PICTURE OF THE 2ND ROW DRIVER'S SEAT IS ALSO ATTACHED TO SHOW THAT THESE LOWER ANCHORS ARE SYMMETRICAL AS THEY SHOULD BE. THE PICTURE OF THE 2ND ROW PASSENGER SEAT SHOWS THESE LOWER ANCHORS TO BE ASYMMETRICAL.     THIS VEHICLE HAS NEVER BEEN INVOLVED IN A CRASH. IN THE PAST THE CLEK FOONF CHILD RESTRAINT WAS ATTACHED USING RIGID LATCH IN THE 2ND ROW PASSENGER SEAT OF THIS VEHICLE.",
        "vin": "1GYS4TKJ1FR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907993,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING OUR 2015 ESCALADE ON I-45 JUST NORTH OF HUNTSVILLE, TX ABOUT 11:30 AM.  DRIVING WITH CRUISE CONTROL ON AT SPEED LIMIT OF 75 MPH.  THERE WAS A PEEP, CAR RAPIDLY DECELERATED TO BELOW 50, AND LOW TIRE PRESSURE LIGHT CAME ON.  IF SOMEONE HAD BEEN CLOSE BEHIND ME,  WE WOULD HAVE BEEN HIT BEFORE I COULD HAVE REACTED.  PULL OFF ON AN EXIT AND CALLED CADILLAC SERVICE ADVISER IN HUNTSVILLE.  NO HELP.  LOOKED AT TIRES AND THEN CONFIRMED TIRE AIR PRESSURE WAS NORMAL ON INSTRUMENT PANEL DISPLAY.  SPENT TIME TRYING TO FIGURE OUT WHAT HAD HAPPENED. CRUISE CONTROL WOULD NOT WORK WHILE DRIVING ON SIDE ROAD, WARNING LIGHT STAYED ON BUT INFO DISPLAY SHOWED ALL TIRES AT 37 LBS.  PULLED OFF ROAD AGAIN, STOPPED CAR, TURNED ENGINE OFF, WAITED A MINUTE, AND TURNED ENGINE BACK ON.  EVERYTHING WAS NORMAL. NO WARNING LIGHT FOR TIRES AND CRUISE CONTROL WORKED. THIS ISSUE IS POTENTIAL KILLER DUE TO RAPID DECELERATION AND DANGER OF REAR END COLLISION.",
        "vin": "1GYS3NKJ6FR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/18/2016",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES COMPLETELY FAILED.  I PULLED INTO TRAIN PARKING SPOT AND THE CARS WOULD NOT STOP. I HAD TO KEEP PUMPING THE BRAKES AND EVENTUALLY IT JUST STOPPED. I TRIED IT GAIN AND THE BRAKES WERE HARD AND COULDN'T PUSH THEM DOWN. I AM SO LUCKY THAT I WAS NOT ON A HIGHWAY GOING FAST WITH MY KIDS IN THE CAR.   ADILLAC SAID I NEEDED THE HYDRO BOOST REPLACED.",
        "vin": "1GYS4SKJ4FR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO BRIGHT HEADLIGHTS, HIGH BEAMS RANDOMLY FLASH ON COMING TRAFFIC BLINDING THEM. VEHICLE AT DEALER BUT DEALER UNABLE TO DETERMINE CAUSE. FACTORY NOTIFIED AND REPORTED THEY ARE ATTEMPTING TO ENGINEER A FIX.  VEHICLE AT CADILLAC DEALER LAS VEGAS. SECOND TIME IN SHOP.",
        "vin": "1GYS4HKJXFR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/29/2016",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891627,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 15000 MILES AND ORIGINAL OWNER WHILE TOWING OUR BRAKES COMPLETELY GAVE OUT.  NO WARNING SIGN, NO LEAKAGE, ONLY 1 SYMPTOM A FEW MONTHS PRIOR WHERE THE BRAKE PEDDLE WAS MUSHY.  DEALERSHIP SAID IT WAS FINE.  EVERYTHING WORKED FINE DRIVING IT THROUGHOUT DAY. STOPPED FOR DINNER JUST BEFORE WE ENTERED MOUNTAIN PASS.  GOT IN SUV TO LEAVE FOR HOME AND HAD NO BRAKES AT ALL.  EMERGENCY BRAKE WON'T EVEN KICK IN TO BE USED FOR EMERGENCIES.  THE VEHICLE GAVE NO WARNING SIGNS, ENGINE OR BRAKE LIGHT WARNINGS.  NO CHANGES IN BRAKE PRESSURE, NO LEAKS UNDER VEHICLE OR ON ENGINE.  IT WAS AN INSTANT GIVE OUT OF BRAKES AND COULD HAVE HAPPENED WHILE DRIVING.  FORTUNATELY THEY DID NOT GIVE OUT WHILE MOVING MORE THAN 3 MPH SO WE ARE STILL ALIVE. DEALERSHIP AND GM BOTH SAID IT WAS NORMAL FOR BRAKES TO GIVE OUT AND NOT HAVE ANY BRAKES WHEN THE BRAKE MASTER CYLINDER GIVES OUT.  THIS IS NOT NORMAL!  THEY REPLACED THE MASTER CYLINDER AND ALL WORKS FINE NOW.  HOWEVER I FEEL THIS IS A MAJOR VEHICLE SAFETY ISSUE IN THAT FOR A VEHICLE TO COMPLETELY LOSE ALL OF IT'S BRAKING ABILITY BUT NOT BE PREWARNED THAT THERE IS A PROBLEM IS EXTREMELY DANGEROUS.  IF WE DIDN'T STOP FOR DINNER THE BRAKES WOULD HAVE GIVEN OUT IN THE MOUNTAIN PASS AND ME AND MY FAMILY WOULD MORE THAN LIKELY BE DEAD AT THE BOTTOM OF A MOUNTAIN CLIFF!  WE ARE EXTREMELY AFRAID TO DRIVE THIS VEHICLE NOW AND GM HAS NO INTEREST IN BUYING IT BACK OR HELPING  US GET OUT OF IT.  THEY JUST  SAID \"JUST WAIT TO SEE IF IT HAPPENS AGAIN\"  WHICH TO ME, MEANS, WAIT UNTIL YOU CAUSE A FATALITY.  THEY ALSO SAID THIS ISN'T HAPPENING TO OTHER GM VEHICLES.",
        "vin": "1GYS4PKJ8FR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "11/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852756,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD VIRTUALLY NO BRAKES TO STOP IT AND 11,215 MILES. GENERAL MOTORS ALREADY HAD SERVICE WARNINGS OUT TO DEALERS DATED 7/17/2015, GM DOCUMENT ID #4242788. THEY SAY THEY REPLACED PADS AND ROTORS. AT 23,589 MILES THE VEHICLE NEEDED BRAKES AGAIN. SERVICE MANAGER TELLS US THAT THIS IS A KNOWN PROBLEM AT GENERAL MOTORS. THEY HAVE EVEN ISSUED A NEW WARNING FOR 2016 MODELS. I CONSIDER THE VEHICLE TO BE UNSAFE TO DRIVE IN THAT THE BRAKES CAN GO OUT WITHOUT ANY WARNING.",
        "vin": "1GYS4NKJ7FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "03/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN A HILL IN TOWN, MY VEHICLE COMPLETELY SHUT DOWN. ONLY COMPONENT STILL WORKING WAS THE RADIO. NO FLASHERS, NO TURN SIGNALS. WAS ABLE TO GLIDE TO THE SIDE OF THE ROAD AND PUT THE CAR IN PARK. I WAS ABLE TO RESTART THE CAR. DASH LOOKED DIFFERENT AFTER RESTART, INFO MISSING. DROVE A FEW MORE BLOCKS, STOPPED AND SHUT CAR DOWN. WHEN I RESTARTED AGAIN THE VEHICLE WAS BACK TO NORMAL.",
        "vin": "1GY4MKJ0FR6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2016",
        "dateOfIncident": "11/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817761,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE NOISE AND VIBRATION ON COLD START. VERY LOUD GRINDING NOISE COMING FROM ENGINE. HAD IT LOOKED AT 2 TIMES. DEALER  SERVICE MANGER JIMMIE STATES ITS NORMAL. THEY ALL MAKE THAT NOISE. I AM 54 YEARS OLD OWNED MORE THAN 15 CARS IN MY LIFE . THIS IS NOT NORMAL. THEY DO NOT WANT TO FIX IT.",
        "vin": "1GYS4HKJXFR"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "11/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CADILLAC ESCALADE HAS BEEN IN THE SHOP FOR 130+ DAYS IN THE FIRST CALENDAR YEAR FOR DEFECTIVE BRAKES, TRANSMISSION, SUSPENSION, ELECTRICAL, AND HVAC.  I HAVE CONTACTED GM AND THEY DON'T WANT TO REPURCHASE THE VEHICLE.  THE VEHICLE IS CONSTANTLY IN THE SHOP FOR PROBLEMS AND IT IS NOT A VEHICLE THAT SHOULD BE OPERATED ON PUBLIC ROADWAYS.  THE TRANSMISSION HAS BEEN REPLACED ONCE BEFORE DUE TO DEFECTS IN DESIGN AND BUILD QUALITY.  THE TRANSMISSION HOW CAUSES THE CAR TO TAKE OFF IN 4TH GEAR RATHER THAN IN 1ST GEAR WHICH MEANS THE CAR FEELS AS IF THERE IS NO POWER TO PROPEL THE VEHICLE.  THE TRANSMISSION SLIPS AND FEELS AS IF IT IS BROKEN.  I HAVE TAKEN IT TO THE DEALER AT LEAST 5 TIMES AND GM NOW DOES NOT WANT TO REPLACE THE TRANSMISSION EVEN THOUGH THE DEALER HAS VERIFIED THE CONCERN AND DOCUMENTED IT.  I FEEL THAT GM IS NOT DOING ENOUGH TO ENSURE SAFE VEHICLES ARE ON THE ROAD.  THIS TRANSMISSION ISSUE IS GOING TO CAUSE AN ACCIDENT ONE DAY.  I HAVE ALREADY PUT GM ON NOTICE ALL THE WAY UP TO THE EXECUTIVE LEVEL AND THEY DON'T WANT TO DO ANYTHING ABOUT IT.  I FEEL THAT NHTSA SHOULD INVESTIGATE THE ISSUES THAT PLAGUE 2015 FULL SIZE GM SUV OWNERS.  THERE ARE A LOT OF US OUT THERE ACCORDING TO MY RESEARCH.",
        "vin": "1GYS3NKJ8FR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CADILLAC ESCALADE ESV. WHILE THE VEHICLE WAS PARKED WITH THE AIR CONDITIONING ACTIVATED, THE HEAT INDEPENDENTLY TURNED ALL THE WAY UP IN THE REAR OF THE VEHICLE WITHOUT WARNING. THE HEAT CAUSED ONE OF THE OCCUPANTS TO PASS OUT. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THERE WAS AN ELECTRICAL FAILURE AND THAT THE COMPUTER HAD TO BE REPROGRAMMED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 6,000.",
        "vin": "1GYS3JKJ7FR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS EXPLOSION OF SUNROOF WHILE DRIVING  ON HIGHWAY SENDING A SHOWER OF GLASS ALL OVER THE OCCUPANTS OF THE CAR.  DRIVING ON HIGHWAY WITH NO OVERPASS - THIS WAS NOT THE CAUSE OF A ROCK OR SOMETHING HITTING.  SUNROOF SIMPLY SHATTERED FOR NO REASON.",
        "vin": "1GYS4JKJ7FR"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "05/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION FOR NO REASON. I WAS BACKING OUT OF A PARKING SPOT AND I PUT THE CAR IN REVERSE. I WAS NEARING THE EDGE OF THE CURB ON MY RIGHT FRONT WHEEL SO I STEPPED ON THE BRAKE, STOPPED THE CAR, AND SHIFTED INTO DRIVE SO I COULD MOVE THE VEHICLE FORWARD TO AVOID HITTING THE CURB WHILE BACKING OUT . ONCE I SHIFTED INTO DRIVE, THE CAR WENT TO FULL ACCELERATION FOR NO REASON AND HIT A POLE AT FULL ACCELERATION APPROXIMATELY 5 FEET AWAY.",
        "vin": "1GYS4TKJ1FR"
    }
]