[
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "04/01/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459215,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I received an error Service \"Side Detection System\".  Dealer says it needs to replace the Side Blind Zone Alert Modules (part #84648920) due to water intrusion on the module.  They say it can affect the entire dashboard, causing it to fail.  The Chevy Impala forums have many mentions of this issue with this car. There have been reports of smoke coming from these modules.  GM had issued a Special Coverage N172097060 in 2019 but only covers cars 6 years old or less and less than 80,000 miles.  Due to the widespread occurrence of this issue, it should be recalled.",
        "vin": "1G1165S38FU"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458749,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Front Right lower control arm w/o police right front wheel. Tpms system. This will be the second time I’ve had to replace the front lower control arm the tea PMS system does not work ABS traction control are off totally the same year of car make model everything was recalled to have this fixed but it was only with the police cars what makes you think that the ones that weren’t police cars didn’t have the same issue it cost $427.20 to fix. I also understand that my vehicle you’re making model it’s not the only one having this issue of having to replace it over and over as far as electrical something keeps moving or coming on or off in the car it’s worn down to batteries it happens at any time I can walk by the car and making the noise. I have to keep replacing the tires due to this all I know is that when you’re driving it more getting ready to turn it makes a loud crunching grinding noise it can happen at any time it’s getting harder to control the steering wheel. The cost of replacing the tires is ridiculous 2xs in a year or less. Gas let’s not even go there. Traction and stabilization always on along with brake assist and tpms front two tires stopped working. And once again it’s doing it. Not sure of exact date but before 2020",
        "vin": "2G1WB5E36F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/23/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Side detector system",
        "vin": "1G1125S30FU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "side detection system failing and will not shut off",
        "vin": "2G1165S33f9"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455616,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the second time the blind side detection system has failed on both my vehicle and daughter's 2014 Impala. GM is aware of this is a problem and issued a special program, however; it expired last year. This issue can also cause issues with other electrical systems. Spending $1500+ every 2-3 years for an issue that is a manufacturer problem is not acceptabe.",
        "vin": "2G1165S36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455099,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "There was a recall on the SBZA in April of 2019 and we received a recall letter from GM, probably in July of 2019 but the recall was for vehicles with less than 80,000 and we had 83,000, so I never pursued recall thinking that we wouldn't qualify. We had the SBZA-Side Blind Zone Alert system replaces in December of 2019, at a big cost to us of $1000, at local Chevrolet dealer. The new detection system only lasted about 15-16 months or March-April of 2021 before it started acting up again. When I called the Chevrolet dealer up to complain about the problem, they told me that there was only a 1 year warranty on brand new part and it being over 1 year old now, it was out of warranty!! Arrgghh!! We left it at that and it didn't cause too much of a hassle as I turned off detection system, using car radio settings and we only had a message on dash, which we could turn off and live with as we didn't have another $1000, out of our pocket, to get fixed. Then in November of 2021 and onwards, the light on drivers mirror would come on, stay on or blink off and on but doesn't always stay on. Now as of February 26 2022, we are having many of the same issues and things happening, that we had back in 2019, where the car is hard to start, dash doesn't work properly along with many safety warning lights coming on the dash, sounds, speedometer not working, no radio, no turn signals, no HVAC, windows don't function properly, etc, etc. It usually goes away, after 10 minutes or so, then is normal again, then goes berserk again, off and on. This is now happening more often each day and is a huge safety issue, esp with our daughter using the car now, to get back and forth to work. She has panicked each time this happens. We bought car with 72,000 miles on it back in May of 2018 and it currently only has 126,300 miles on it. We love this car otherwise as it's been a real great car but now with this stupid problem again and so soon, we are not sure what to do. Thank you very much.",
        "vin": "1G1125S33FU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The \"service stabilitrak\" light and engine light has returned making the vehicle non-operational once again.  I have spent over $2500 in the past 12 months at an authorized Chervrolet dealership attempting to repair this exclusive, patented General Motors safety system, however, the system continues to malfunction.  I cannot be the only owner of a GM vehicle with this frustrating, expensive issue.  Please assist with a recall and/or inquiry to GM/Chevrolet.  Previous NHTSA tracking number 11444992.",
        "vin": "2g1165s39f9"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "02/22/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454268,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "It appears that my vehicle had a special coverage bulletin titled “N172097060 - Special Coverage Side Blind Zone Alert Module Water Intrusion” This special coverage only covered vehicles for 6 years or 80,000 miles.   This week I started experiencing problems with my vehicles side blind zone alert system.  From everything that I have read it appears to be the same issue that led to the special coverage mentioned above being issued.  However, my vehicle is now outside of the specified coverage limitations.  I believe that it should still be covered as it still remains a safety issue.  Regardless of how many years or miles have passed.   Thank you.",
        "vin": "2G1165S38F9"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "01/15/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Front Right lower control arm w/o police right front wheel. Tpms system. This will be the second time I’ve had to replace the front lower control arm the tea PMS system does not work ABS traction control are off totally the same year of car make model everything was recalled to have this fixed but it was only with the police cars what makes you think that the ones that weren’t police cars didn’t have the same issue it cost $427.20 to fix. I also understand that my vehicle you’re making model it’s not the only one having this issue of having to replace it over and over as far as electrical something keeps moving or coming on or off in the car it’s worn down to batteries it happens at any time he can walk by the car and making the noise. I have to keep replacing the print tires due to this all I know is that when you’re driving it more getting ready to turn it makes a loud crunching grinding noise it can happen at any time it’s getting harder to control the steering wheel",
        "vin": "2G1WB5E36F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "12/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449725,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Chevrolet Impala. The contact stated that while driving at an undisclosed speed, the air bag warning light and the front passenger’s seat belt warning light illuminated with an audible beeping sound. The contact continued to drive the vehicle. The contact stated that the failure had been reoccurring while driving. The contact referenced NHTSA Campaign Number: 15V465000 (Air Bags). The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed or repaired. The failure mileage was approximately 25,000.",
        "vin": "2G1165S32F9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447296,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Automatic transmission shifting problems.  Shifting from starting to any kind of incline resistance, car can not shift through first 2 gears.  Shaking, rumbling, check engine light flashing, engine bogs, car slows down, causing safety concerns. Had car checked at dealer.  Reprogramed transmission.  Did not fix it!",
        "vin": "2G1165S36F9"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/26/2021",
        "dateOfIncident": "12/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The manufacturer patented Stabilitrak system continues to fail on my vehicle.  Initial ODI 114406439.  Dealership charged $1,7832.15 to replace transmission control module (TMC) on 11/5/21.  On 12/22/21 vehicle indicated the exact issue (Service Stabilitrak), took vehicle to same dealership, awaiting response.  The car is not drivable when \"Service Stabilitrak\" is indicated as engine power is substantially reduced.  GM technical service bulletin PIC5992A seems to apply to my issue.  However, Chevrolet and the dealership says it does not apply, but continue to charge for engine light analysis and unnecessary, expensive repairs.  Your assistance would be greatly appreciated. Vehicle is once again inoperable (3/4/22) due to this issue (service stabilitrak). Consumer stated almost $3,000 was spent with no resolution. Consumer stated vehicle fixed with used parts from a junk yard— new parts were not available.",
        "vin": "2g1165s39f9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving at 70MPH on I10 in MS I experienced loss of power steering in heavy traffic. I received a notification on the dashboard of a problem, but it was difficult to maintain control of the vehicle and maneuver to the right lane to exit. The car was difficult to drive but I managed to pull into a large gas station and shut it down and ask for directions to a Chevy dealer. The Power steering returned when I restarted the vehicle and a Chevy dealer was several miles away, but the dealership personnel advised me to continue the trip since I reset the system, but could not tell me if it would reoccur. I drove another 250 miles to get home and did not have another incident. But after checking online forums I notice other such issues and this is quite dangerous at high speed and heavy traffic.",
        "vin": "2G1165S31F9"
    },
    {
        "components": "POWER TRAIN,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The stabilitrak system GM installed on my vehicle repeatedly indicates a \"service\" notification.  Once this occurs, my vehicle loses power and the ability to shift into any driving mode.  This issue began around 60,000, I currently have 77,500+ on my vehicle.  GM issued a technical service bulletin (PIC5992A) for my vehicle, however, denies it's the issue and will only attempt a repair from a computer code, which they continue to fail to replicate.  The occurrence of this issue is especially worrisome on any interstate highway.    ODI 11406439",
        "vin": "2G1165S39F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Around the first of October I was headed home with my family. As we were merging over to exit lanes to get on the ramp to exit the freeway the power steering failure light came on and simultaneously all my power steering was gone. I literally lost control control of my car. I was in the midst of turning when the car swerved and at 70 MPH it was very dangerous situation. My wife and I had just switched driving places several miles back. She panicked and said she couldn't imagine what she would have done if that had happened to her. She also swore to never drive that car again. I don't know how many times this has happened to others but I can say with all honesty this is a very serious problem. There wasn't an accident but I did cause everyone near me on the road to swerve and brake suddenly to avoid colliding with my vehicle. As of today the car hasn't been repaired and I haven't relayed this to the dealership. That being said even if they were for some miraculous divine reason to repair it for free the danger of this occurring again is still there. This feature is dangerous and I pray something is done about it.",
        "vin": "2G1165S31F9"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THIS REPAIRED ONCE BEFORE AND NOW IT IS DOING IT AGAIN. THE STABILITY AND TRACTION LIGHT ARE ON AND ACCESS BRAKE SYSTEM LIGHTS AND TPMS LIGHTS ARE ON. IT MAKES A GRINDING CRUNCHING DRAGGING NOISE WHEN TURN THE WHEEL. SOMETIMES SO BAD ON THE DRAG LIKE ITS RUBBING AGAINST SOMETHING IT ALMOST STOPS THE VEHICLE. AS FAR AS SAFETY RISKS YES THE DRAGGING CRUNCHING SOUND STOPS THE VEHICLE AND IF TURNING IT SORT OF STALLS YOU, NO TRACTION OR STABILITY.THE WARNING LIGHTS REAPPEARED ABOUT A MONTH AGO. PEP BOYS COULDN'T GET THE TPMS SYSTEM TO WORK AFTER REPLACING TIRES BACK IN 2020 IN FEB.",
        "vin": "2G1WB5E36F1"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435198,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PUT MY CAR IN PARK IT ROLLS BACK LIKE IT'S A MANUAL IT DOES IT ALSO WHEN I AM IN REVERSE AND GO TO DRIVE. ALSO WHILE DRIVING MY GEAR SHIFT IF SOMEONE TOUCHES IT OR HITS IT WILL GO FROM DRIVE TO NEUTRAL WORRIED IT WILL GO TO PARK OR SOMETHING DANGEROUS ABOUT TWO YEARS THE VEHICLE ITS DONE THIS THE DEALERSHIP SAID NORMAL AND IT IS NOT.",
        "vin": "2G1WB5E36F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Side detection system has failed. This detection system is vital to the safety of the vehicle. This is because there are blind spots inherent in the cars design that the side detection system corrects. My Impala LTZ is 6 1/2 years old with just under 30,000 miles.",
        "vin": "2G1165S33F9"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2021",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Issue with the Transmission malfunctioning. The dealership service the transmission several times. And know the transmission needs replacement after the warranty has expired.",
        "vin": "2G1115SL7F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "06/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427605,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Blind side collision monitor is not functioning properly due to faulty design which allows moisture to get into cabin where the monitor is installed. Causing the collision feature not to function properly and \"service side collision\" msg to show on the dashboard.  I had this issue before and had it repaired by the dealer on 03/2019. The problem has  since returned. But this time it's caused the functions on the dashboard ( gas, h/c and speed meters, digital monitor screen etc) to stop working where I can't tell if I have gas or my driving speed or anything associated with the dashboard info system, it blacks out. And now the alert light on the door mirrors continuously stay on even when there's no car on the side of my vehicle and even when the car is turned off. I took it back to the dealership and have been told that the collision monitor sensors AGAIN need to be replaced.",
        "vin": "2G1165S31F9"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The connector on the drivers side module  is corroded from water intrusion.  It is an identical condition as described in NHTSA recall N172097060.  The dealer and GM claims this vehicle was not included in the recall, even though it is a 2015 Chevrolet Impala.  They now want me to pay 1,000+ dollars to fix the issue according to the steps in the bulletin?  If i don't get this fixed soon is it could disable my vehicle as explained in the bulletin. I purchase the car in November of 2019 which is 7 months after this bulletin was released, and because GM did not include the VIN number in their system it was never corrected previously. The connector in the images is damaged now because the mechanic broke it at the dealer trying to get it off from the internal corrosion.  I also contacted GM directly and they said that my car was not included in the VIN range and that I could take the issue up with NHTSA at my own prerogative.",
        "vin": "2G1155SL9F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423122,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "My left hand (front bank) catalytic converter near the cylinder head fell off yesterday at the mounting flange. It landed in/on my fan. I went online to find a replacement part and found GM service bulletin PIP5419a & b first issued in 2016.. That bulletin explains a known \"defect\" with the weld. The catalytic converter pipe cracks at the mounting weld.  the TSB was issued for all Impalas from 2014-2016, all VINS all transmissions, all 3.6l RPO LFX engines. It says that GM is working on a solution for this concern. Why isn't there a recall on this defect?  The file I've attached is not from my car but from the TSB. It's very similar to what my cars catalytic converter looks like.",
        "vin": "1G1125S39FU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Chevrolet Impala. The contact stated that the driver’s and passenger’s side air bags deployed inadvertently without a warning light. The vehicle was not diagnosed nor repaired. The manufacturer was informed of the failure. The contact was still awaiting a response. The failure mileage was approximately 106,000.",
        "vin": "2G1WA5E38F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421029,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The blind sensor indicators are defective.  The right side stays on but the the left side worked accordingly. Without warning the indicator on the left also stopped working. GM is well aware of the issue but will only fix the issue if it happens within a warranty timeframe.  The initial issue with mine happened while driving in a winter storm with slushy roads.  The sensors that stays illuminated isn't as much as a safety issue as the one that was lighting up as expected then stopped without warning. This item should be a full recall not a fix it if it breaks scenario. Mine stopped working within my warranty timeframe but because I was a secondary purchaser, I had no way of knowing that waiting until my next oil change would cause me to be stuck with $800 in repairs because GM refused to recall a safety issue item they are well aware of.",
        "vin": "1g1155slxfu"
    },
    {
        "components": "LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/15/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421030,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST RECEIVED A MESSAGE ON THE DRIVER INFORMATION CENTER THAT SAYS \"SIDE DETECTION SYSTEM\" SO I LOOKED IT UP IN THE WARRANTY INFO BOOK AND FOUND ONLY AN INSTRUCTION THAT SAID TO CLEAN THE REAR BUMPERS,  AND NOTHING ELSE. CALLED DEALER AND THEY WANT $135 TO DIAGNOSE AND POSSIBLE REPAIR CHARGE OF $1100. LOOKED INTO COMMON PROBLEMS WITH OTHERS VEHICLE OWNERS AND FOUND SEVERAL WITH IDENTICAL PROBLEMS; ALSO FOUND A GM 'SPECIAL COVERAGE ADJUSTMENT\"\" DATED 4-1-19 COVERING THE COST OF REPAIR BUT ALSO FOUND IT WAS ONLY GOOD FOR  YEARS AND/OR 80,000 MILES. MY VEHICLE HAS 62,000 MILES BUT IS 6 MONTHS BEYOND THE  YEARS.  IS THIS NOT A SAFETY ISSUE? I WOULD THINK SO. SO WHAT CAN I DO ABOUT THIS, AS I UNDERSTAND IT CAN CAUSE SIGNIFICANT OTHER INCIDENTS WITH THE VEHICLE, SUCH AS LOOSING THE INSTRUMENT PANEL INDICATORS AS WELL AS ISSUES INVOLVING VEHICLE HEADLIGHT AND ENGINE SHUT DOWN. WOULD LIKE A RESPONSE AS SOON AS POSSIBLE AS I WOULD LIKE TO GET THIS TAKEN CARE OF ASAP. THANK YOU [XXX] CELL # [XXX] JUNE 15. 2021 P.S. THIS HAS BEEN THE BEST VEHICLE I HAVE EVER OWNED; UP UNTIL NOW.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2G1165S30F9"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415026,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS REPAIRED UNDER SPECIAL COVERAGE N172097060, SIDE BLIND SIDE ALERT MODULE, IN APRIL 2019. TWO YEARS LATER THE SAME PROBLEM HAS RECURRED YET NOW I'M TOLD THE SPECIAL COVERAGE HAS EXPIRED, AS THE IN SERVICE DATE OF MY VEHICLE IS 2 MONTHS PAST THE 6 YEAR LIMIT.  THE REPLACEMENT PART WAS ALSO SUBSTANDARD, PERHAPS EVEN THE ORIGINAL DESIGN, AS IT DID NOT LAST MUCH MORE THAN TWO YEARS. THE FACT THAT IT FAILED JUST TWO MONTHS AFTER THE COVERAGE LIMIT IS A SLAP IN THE FACE TO ME AS A CONSUMER. THE DEALER CHARGED ME OVER 900 DOLLARS TO REPLACE THE SIDE DETECTION SYSTEM, REQUIRED TO  PASS NY STATE INSPECTION.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO PICK MY DAUGHTER UP FROM SCHOOL. CAME BACK AND PARKED MY CAR AS USUAL. WHEN I ATTEMPTED TO RESTART MY CAR THE ENGINE RULED UP AND THE CAR WOULD BARELY MOVE. UPON FURTHER INVESTIGATION,  I OBSERVED THE VEHICLE MOTOR NOTIFICATION LIGHT ON AS WELL AS THE PARKING BRAKE NOTIFICATION WITH A TOOL ( WRENCH) UNDERNEATH. I ATTEMPTED TO DISENGAGE THE BRAKE AND IT SAID THE BRAKES HAVE BEEN RELEASED. HOWEVER, THE BRAKE NOTIFICATION SIGNAL IS STILL FLASHING AND THE VEHICLE SEEMS TO BE DRIVING LIKE THE BRAKES ARE STILL ENGAGED.",
        "vin": "2G1125S31F9"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE DRIVER SIDE BLIND SPOT DETECTION GO BAD ON MY IMPALA, SO IT'S STARTING OUT THAT MY DRIVER SIDE MIRROR BLIND SIDE IMAGE WAS BLINKING, THEN IT STOP AND WAS WORKING OK FOR ABOUT THREE WEEKS AND THEN A MESSAGE APPEARS ON MY DASH TO FIX THE BLIND SPOT DETECTION SYSTEM, WHICH IF FINE, BUT WHEN I GO TO THE INTERNET TO SEE IF I CAN JUST DO AWAY WITH THIS SYSTEM, THE FEEDBACK THAT I'VE FIND OUT WAS VERY UPSETTING, EVERYTHING ON DASH DOESN'T WORK, CAN'T GET INTO THE CAR, CARS DON'T START. THAT'S FINE BUT WHEN I TOOK THE CAR TO GET FIX THE SERVICE MANAGER AND WORKER TELL ME ANYTHING CAN HAPPEN WHEN THIS SYSTEM GOES DOWN. WHAT HAPPENS IF I'M DRIVING THE CAR AT HIGHWAY SPEEDS AND IT JUST STOP RUNNING, I HAVE NO BREAKS OR STEERING. IT'S CAUSES AN ACCIDENT.TO ME THIS IS A VERY SAFETY ISSUE. AND NOW THE PASSENGER SIDE BLIND SIDE IS BLINKING NOW, IT STOP BLINKING AND WORKING FINE FOR AWHILE AND THAN JUST QUITE WORKING.",
        "vin": "2G1125S33F9"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407807,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPLACED MY HUB BEARINGS ON MY BOTH FRONT TIRES TWICE . I CONTINUE TO GET A GRINDING NOISE AND JERKING WHILE I'M TRYING TO ACCELERATE. WHILE REVERSING, TURNING LEFT OR RIGHT THIS HAPPENS. ALSO DOESN'T MATTER THE SPEED. THIS IS VERY DANGEROUS AS IT ALMOST CAUSED ME TO GET INTO SEVERAL ACCIDENTS. I PUT MY MONEY AND TRUST INTO CHEVY. THIS SHOULD BE ABSOLUTELY BE A RECALL.",
        "vin": "2G1WB5E30F1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406439,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THERE WAS WATER INSIDE THE TRUNK OF THE VEHICLE. THE VEHICLE WAS TAKEN TO HALEY CHEVROLET (12400 TENNESSEE PLAZA, MIDLOTHIAN, VA 23112, (804) 818-7660) TO BE DIAGNOSED. THE DIAGNOSTIC RESULT AND REPAIR INFORMATION WAS NOT PROVIDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000. *LN*DT THE CONTACT HAS STATED THAT THE VEHICLE WAS REPAIRED TWICE, AND STILL WATER MANAGES TO LEAK INTO THE TRUNK FROM ANOTHER LOCATION.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING ON MY VEHICLE WENT OUT WHILE DRIVING ON THE EPXRESSWAY WITH NO ADVANCE WARNING. I RECEIVED AN ALERT ON MY DASH TO SERVICE POWER STERRING AND THAT WAS ALL. PER THE DEALERSHIP THIS WAS CAUSED BY A CATASTROPHIC INTERNAL FAILURE OF THE STEERING SYSTEM WHEN A GEAR BECAME BOUND UP BY A BROKEN SUSPENSION LINE AND COULD HAVE CAUSED A SERIOUS ACCIDENT",
        "vin": "2G1165S38F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS TURNED ON AND NOT IN MOTION THE DASH DISPLAYS A SERVICE SIDE DETECTION SYSTEM MESSAGE AND THE BLIND SPOT DETECTORS IN THE SIDE MIRRORS DO NOT LIGHT UP LIKE THEY SHOULD WHEN THE CAR IS FIRST STARTED. WHEN DRIVING, AT ANY SPEED AND ON ANY ROADS OR HIGHWAY, THE BLIND SPOT DETECTORS DO NOT LIGHT. WHEN ASSESSED BY A CHEVY MECHANIC THE SIDE DETECTION SENSORS WERE SWOLLEN AND . CORRODED. THIS SENSOR IS IN AN AREA WHERE IT IS UNPROTECTED FROM THE SNOW AND SALT. IT WILL COST ALMOST $2,000 TO REPLACE TWO SENSORS. IF NOT REPLACED I'M AFRAID THAT MY VEHICLES WILL START CATCHING FIRE OR HAVING OTHER ELECTRICAL PROBLEMS LIKE OTHER 2015 IMPALA OWNERS HAD HAPPEN TO THEM IN THE PAST DUE TO THESE CORRODED SENSORS.",
        "vin": "2G1125S32F9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "03/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403027,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING THE STEERING WHEEL ALL THE WAY TO THE LEFT AND ACCELERATING THE ABS ACTIVATES AND THE ABS LIGHT MOMENTARILY COMES ON. I JACKED UP THE FRONT OF THE CAR TO INVESTIGATE AND FOUND THAT I COULD CREATE THE ERROR BY JIGGLING THE WIRE TO THE ABS SENDING UNIT. GOOGLE THE ERROR AND NOTICE DOZENS OF OTHERS WITH THE SAME ISSUE.",
        "vin": "2G1WB5E35F1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "02/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402509,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS GASKETS ARE FAULTY FROM THE FACTORY AND ALLOW WATER TO FILL THE TRUNK WHEN IT RAINS. WHICH LEADS TO MOLD AND MILDEW SMELL THROUGHOUT THE VEHICLE. GM HAS PRODUCED A GASKET THAT IS \"THICKER\" AND CORRECTS THE PROBLEM BUT REFUSE TO ISSUE A RECALL AND DEALER SAYS ITS NOT COVERED BY WARRANTY. I'VE SPENT HUNDREDS AT DEALERSHIPS TRYING TO FIND FIND CAUSE OF THE WATER.",
        "vin": "2G1155SL6F9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397870,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUSE CONTROL DEACTIVATES AND WON'T REACTIVATE WHILE CRUISING AT HIGHWAY SPEEDS. SEEMS TO WORK AGAIN AFTER SHUTTING OFF AND RESTARTING. THIS HAS HAPPENED SEVERAL TIMES.  LAST TIME IT HAPPENED THE ENGINE ALSO DIED.  COASTED TO THE SIDE OF ROAD, WAITED A MINUTE AND CAR RESTARTED AND SEEMED FINE, BUT HAPPENED A SECOND TIME A FEW MINUTES LATER.  I WAS ON A STATE HIGHWAY WITH LIGHT TRAFFIC SO WAS IN NO IMMEDIATE DANGER, BUT WOULD HATE FOR THIS TO HAPPEN ON A BUSY SIX LANE INTERSTATE.  NO DIAGNOSTIC CODES WERE SET BY THE COMPUTER SYSTEM.",
        "vin": "2G1115SL5F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL MODULE (SIDE DETECTION) HAS FAILED TWICE.  HAVE TO DRIVE TO GET REPAIR WITH NO GAUGES, SIGNALS, OR HEAT.  THIS COULD EASILY BE A SAFETY ISSUE.  THE CAR WAS PARKED, UPON STARTING, GOT SEVERAL ERROR MESSAGES INCLUDING SIDE DETECTION ISSUE, AIR BAG FAILURE, TIRE INFLATION FAILURE.  NO SPEEDOMETER, TACHOMETER, HEAT - BUT THE STEERING WHEEL AND SEAT ELECTRICAL HEAT STILL WORK!",
        "vin": "1G1165S35FU"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394321,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM WARNING LIGHT CAME ON",
        "vin": "1G1165S33FU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391100,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SLIGHT VIBRATION AROUND 20 TO 30 MPH AS GEARS ARE SHIFTING AND IT GOES AWAY...DOES IT REPEATEDLY AT SAME POSITION AND EVERYTHING GOES BACK TO NORMAL...NO CODES OR LIGHTS ON DASH HAPPENS MOSTLY IN MOTION ON INCLINES AND EVEN GROUND AT SAME SPEED GROUPING",
        "vin": "2G1125S32F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390132,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING CONTINUES TO GO OUT WHILE DRIVING. IT WILL BE DRIVING FINE AND THEN ALL OF A SUDDEN YOU HAVE NO CONTROL OVER THE VEHICLE. THIS IS A MAJOR SAFETY CONCERN. YESTERDAY IT HAPPENED WHILE I WAS DRIVING. I CAME TO A STOP TURNED THE CAR OFF AND BACK ON AND IT STILL WASN'T WORKING. I HAD TO GO BACK HOME AND FIND A DIFFERENT WAY TO WORK. IT HAS HAPPENED SO MANY TIMES I CAN NOT SOLELY RELY ON THAT CAR. THERE NEEDS TO BE A RECALL AND A FIX OF THIS PROBLEM.",
        "vin": "2G1125S39F9"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/03/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386278,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM LIGHT ON DASH SAY SERVICE BUT THE SIDE DETECTION LIGHT ONBTHE MIRROR STAYS ON EVEN WHEN THE CAR IS OFF.",
        "vin": "1G1165S3XFU"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384730,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE SIDE DETECTION MODULES IN MY 2015 IMPALA HAVE GONE BAD FOR THE SECOND TIME IN LESS THAN 2 YEARS. THEY WERE REPLACED IN FEBRUARY OF 2019. THIS WAS MOSTLY COVERED THROUGH A SPECIAL \"RECALL\" TO REPAIR AND PREVENT A REOCCURRENCE OF THE FAILURE. NOW, IN DECEMBER ON 2020, I AM EXPERIENCING THE EXACT SAME CONDITION. THEY DID NOT REPAIR THE MODULES TO PREVENT THE SAME CONDITION FROM ARISING AGAIN. THEY GET WET BECAUSE OF A BAD DESIGN AND FAULT OUT, LEADING TO CAR SHUTTING DOWN OR EVEN FIRE FROM HARNESS TO MODULES CONNECTION. GENERAL MOTORS AND/OR THE DEALERSHIP (SUBURBAN CADILLAC, NOW SHAHEEN CADILLAC OF LANSING MI) SIMPLY REPLACED DISFUNCTIONAL PARTS WITH THE EXACT SAME DISFUNCTIONAL PARTS. A CONSUMER SHOULD NOT BE REQUIRED TO CONTINUOUSLY REPAY FOR A POSSIBLY DANGEROUS MALFUNCTION THAT THE COMPANY IS QUITE AWARE OF. I TRULY HOPE THAT THEY ARE NOT ALLOWED TO CONTINUE THIS IN THE FUTURE. THE REFUSAL TO ACCEPT FINANCIAL RESPONSIBILITY FOR REPAIRS DUE TO NEGLIGENT DESIGN AND INADEQUATE FIXES IS EVEN MORE ENRAGING.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "10/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED HER CHILD WAS UNABLE TO UNLATCH THE REAR DRIVER'S SIDE SEAT BELT. THE CONTACT CALLED MADE THE LOCAL DEALER BIG M CHEVROLET LOCATED AT 704 N DIXIE BLVD, RADCLIFF, KY 40160, (270) 505-4830 AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 84,000.",
        "vin": "2G1165S32F9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "08/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR BRAKE CALIPER FELL OFF AFTER 38329 MILES. I WAS DRIVING DOWN A STREET AND APPLIED THE BRAKES. PEDAL WENT TO THE FLOOR. I WAS ABLE TO GET STOPPED BY PUMPING THE BRAKES!!",
        "vin": "2G1WB5E30F1"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349857,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TURN LEFT, THE ABS LIGHT/ TRACTION LIGHT COMES ON AND IT SAYS SERVICE TRACTION CONTROL, SERVICE STABILITRAK, SERVICE BRAKE ASSIST AND IT MAKES A GRINDING NOISE. THE DEALERSHIP REPLACED MY WHEEL BEARINGS AND IT'S STILL THE SAME PROBLEM",
        "vin": "2G1WA5E34F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING, THE VEHICLE REVS TO HIGH RPMS AND A LOSS OF POWER TO THE WHEELS OCCURS. THIS HAPPENS MOST NOTABLY WHEN ACCELERATING TO PASS WHILE CRUISING AT SPEEDS OF 50MPH AND UP. CHECK ENGINE LIGHT APPEARED AND CODE P16CF WAS GIVEN AND TRACKED DIRECTLY TO THE VARIABLE TIMING OIL CONTROL VALVE.",
        "vin": "1G11Z5SL5FU"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THE ELECTRONIC STABILITY, BRAKE ASSIST, AND POWER STEERING ASSIST WARNING LIGHTS ILLUMINATED INTERMITTENTLY. THE CONTACT TOOK THE VEHICLE TO CANNON NISSAN OF OXFORD (479 MS-6, OXFORD, MS 38655, (662) 236-3300) WHO REPAIRED THE WIRING HARNESS. THE CONTACT STATED THAT THE FAILURE PERSISTED. ADDITIONALLY, THE VEHICLE NO LONGER REVVED UP WHEN STARTING. THE CONTACT RETURNED THE VEHICLE TO THE DEALER WHO STATED THAT THE RECEPTORS ALONG WITH OTHER UNKNOWN REPAIRS NEEDED TO BE PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "1G1115SLXFU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT DETECTION SYSTEM WARNING SENSOR (OBJECT SENSOR/ CONTROL MODULE) ON MY VEHICLE HAS GONE OUT. I WAS DRIVING AND ALL OF A SUDDEN MY DASH GOES BLACK. THEN IT CUTS BACK ON GOING HAYWIRE, ALL SORTS OF LIGHTS AND WARNINGS CAME ON. I PULLED OVER TO CHECK THE CAR OUT, TURNING IT OFF TO SEE IF A RESTART WOULD FIX THE ISSUE AND THE CAR WOULD NOT START. SO I HAD TO TOW TO THE DEALER WHICH IN THIS PANDEMIC WAS CLOSED. WHEN THE GUY AT THE DEALER TOLD ME IT WAS BAD HE SAID IT GOES BAD FROM GETTING WET. CARS ARE SUPPOSED TO GET WET NO? AFTER LOOKING ONLINE SOMEONE SAID THAT GM KNOWS ABOUT THIS PROBLEM AND REDESIGNED THE PART TO WORK BETTER, YET THEY WANT ME TO PAY ALMOST $1000 TO FIX A PROBLEM THEY FIXED FOR THE SAME REASON. THIS IS RIDICULOUS.  *TR",
        "vin": "2G1165S3XF9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2020",
        "dateOfIncident": "05/10/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324373,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA.  WHILE DRIVING 20 MPH SMOKE WAS DETECTED FROM UNDERNEATH THE HOOD. UPON EXITING VEHICLE, THE CONTACT NOTICED OIL EMERGING FROM ENGINE. THE LOW OIL PRESSURE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO STATED THE ROCKER ARM CONTROL NEEDED TO BE REPLACED. THE CONTACT CALLED HERRIN-GEAR CHEVROLET (1685 HIGH ST, JACKSON, MS 39202 601) 354-3882) WHOM INFORMED HER THAT THE PARTS WERE ON BACK ORDER. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 104,928.",
        "vin": "1G11Z5SLXFU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW DAYS AGO, I WAS DRIVING ALONG THE HIGHWAY AT APPROX 55MPH AND DECIDED TO CHANGE LANES AND I NEARLY RAN INTO A VEHICLE THAT WAS PASSING ME AT THE TIME.  THIS NEAR MISS OCCURRED BECAUSE MY VEHICLE BLIND SIDE DETECTION SYSTEM WAS INOPERABLE.    MY MECHANIC TOLD ME THAT THE SYSTEM SENSORS AND WIRE HARNESSES NEEDED TO BE REPLACED AND THAT THIS WAS A DESIGN DEFECT IN GM'S SIDE DETECTION SYSTEM IN THAT IT WASN'T ADEQUATELY PROTECTED FROM NORMAL MOISTURE DAMAGE.  SINCE THIS IS SUCH AN INHERENT AND SERIOUS SAFETY HAZARD, THE MANUFACTURER SHOULD BE HELD RESPONSIBLE AND FORCED TO ISSUE A RECALL TO REPAIR THIS DEFECT.    THANK YOU FOR YOUR ATTENTION TO THIS MATTER,  [XXX] VEHICLE OWNER    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2G1165S31F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322444,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG SERVICE LIGHT TURNS ON AND OFF. I RECEIVED A LETTER FROM THE MAKER SAYING THERE WAS A RECALL FOR THE AOS. I TOOK MY CAR INTO A CHEVROLET DEALERSHIP AND THEY CLAIMED THEY FIXED IT. A COUPLE DAYS LATER THE LIGHT STARTED TO APPEAR AGAIN. I TOOK MY CAR BACK TO THE SAME PLACE AND NOW THEIR ARE SAYING MY SENSING DIAGNOSTIC MODULE NEEDS TO BE REPAIRED. I TRULY BELIEVE THIS WAS SOMETHING NOT DONE CORRECTLY BY THE MANUFACTURER AND I SHOULDN'T BE LIABLE FOR IT. IF I HAVE AN ACCIDENT AND THE AIRBAGS DON'T DEPLOY, OR THEY DEPLOY AT ANYTIME CAUSING  ME TO HAVE AN ACCIDENT, I WILL PURSUE LEGAL ACTION.",
        "vin": "2G1165S3XF9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/19/2020",
        "dateOfIncident": "04/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNERS OF 2014-2015 IMPALAS  ARE NOT ABLE TO GET THIS PART CALL THE ROCKER ARM CONTROL VALVE.  THEY NO LONGER MAKE THIS PART TO FIX THE CARS. SO PEOPLE  WHO OWN THOSE MODEL CARS ARE FORCED TO TRADE IN CARS THAT THEIR STILL PAYING  CAR NOTES ON. GMC HAS NOT SPOKE ABOUT THIS MATTER AND LEFT THEIR CUSTOMERS  STUCK OUT WITHOUT  WARNING. WE ARE FORCED TO GO BACK INTO LONG TERM CAR NOTES WHEN HALF OF THE PEOPLE ALMOST FINISHED  PAYING OFF THEIR NOTE. AND OTHERS HAVE PAID OFF THEIR CAR THAT'S 5 YEARS OLD THAT THEY CAN NO LONGER BUY. IT'S VERY SAID .",
        "vin": "2G1115SL9F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SENSORS AND WIRING HARNESD",
        "vin": "2G1125S37F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315807,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAK IN TRUNK DUE TO FAIL TAILLIGHT SEAL THAT CAN CAUSE ELECTRIC ISSUE AND MOLD MILDEW WHICH IS A SAFETY HEALTH ISSUE.     HTTPS://WWW.IMPALAFORUMS.COM/THREADS/2015-LTZ-WATER-IN-TRUNK.1299889/    HTTPS://WWW.CHEVYTALK.ORG/FUSIONBB/SHOWTOPIC.PHP?TID/345533/    HTTPS://WWW.YOUTUBE.COM/WATCH?V=SWMZHHAXN5O",
        "vin": "1G1165S30FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315558,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE BLIND SPOT DETECTION FAILURE, BURNING WIRE SMELL BEFORE FAILURE.  TWO DAYS LATER RIGHT SIDE MIRROR STARTS BLINKING FOR NO REASON AND THEN STOPS, LEFT SIDE DOES NOTHING STILL",
        "vin": "1G1125S38FU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING DOWN THE ROAD I HAD A STEERING WITH CARE LIGHT POP UP. AND I HAD TROUBLE CONTROLLING THE VEHICLE. AFTER TURNING  THE VEHICLE OFF FOR A COUPLE MINUTES THERE IS NOT PROBLEM.  CURRENTLY I AM TERRIFIED OF DRIVING THE VEHICLE IN THE SENSE OF LOOSING CONTROL OR EVEN MY LIFE.",
        "vin": "2G1125S39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315351,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE BLIND ZONE INDICATOR LIGHT IN THE MIRROR IS MALFUNCTIONING. EVEN WHEN THE VEHICLE IS OFF THE THE LIGHT IS FLICKERING ON AND OFF. I HAD THIS EXACT SAME PROBLEM OCCUR WHILE THE VEHICLE WAS UNDER WARRANTY AND WAS REPLACED. I EVEN ASKED IF THERE WAS A WAY TO ASSURE THAT THIS WASN'T GOING TO HAPPEN AGAIN. THE DEALER TOLD ME THAT IT WOULDN'T, BEHOLD IT'S BACK BUT NOW MY VEHICLE IS OUT OF WARRANTY. NOT HAPPY AND CONCERNED THAT THIS ISSUE MAY CAUSE A ELECTRICAL FIRE WHILE IT IS PARKED IN MY GARAGE OR HAVE A ISSUE WHILE DRIVING WITH MY FAMILY.",
        "vin": "2G1155SL5F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN INTERSTATE STEERING ASSIST DISABLED ALARM CAME ON. VEHICLE BASICALLY IMPOSSIBLE TO STEER !! TOOK EXTREME AMOUNT OF EFFORT TO TURN WHEEL AT ALL. WAY BEYOND WHAT A NORMAL NON ELECTRIC STEERING CAR WOULD TAKE WITH POWER STEERING OUT.  VERY DANGEROUS AT HIGHWAY SPEEDS. MANAGED TO GET CAR OFF ROAD WITHOUT KILLING MYSELF OR ANYONE ELSE. TOWED TO DEALERSHIP. STEERING GONE. $3100 TO REPLACE. RIDICULOUS FOR A 4 YEAR OLD CAR.",
        "vin": "2G1125S32F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310955,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT WARNING SYSTEM MODULE SENSOR 23424941 ISSUE  I JUST HAD MY REAR BUMPER REPLACED BY THE AUTO BODY SHOP.  WHEN THEY WENT TO PULL BOTH MODULES OUT AND PLACE THEM INTO THE NEW BUMPER, BOTH OF THEM WOULD NOT FIT DUE TO A CORNER OF THE MODULES EXPANDING FROM CORROSION FROM INSIDE THE MODULE.  THERE ARE MANY COMPLAINTS ABOUT THESE.  I SHOULD NOT HAVE TO PAY FOR  THE REPLACEMENTS FROM GM.",
        "vin": "1G1165S36FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310160,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SIDE DETECTION SENSORS. I OWN A CHEVY CRUSE,CHEVY IMPALA,AND A GMC ACADIA AND ALL 3 OF THESE CARS HAVE THE SAME PROBLEM. WATER,SALT AND DIRT GET INSIDE OF THESE SENSORS AND THEY SHORT OUT. ON THE IMPALA THEY SHORTED OUT AND I COULD NOT START THE CAR THE NEXT DAY. THE BATTERY DIED.WENT TO THE DEALERSHIP AND THEY DISCONNECTED THEM TILL THE PARTS CAME IN. STILL WAITING FOR THE PARTS. I WAS TOLD THAT THIS WILL ONLY HAPPEN AGAIN THERE IS NO PERMANENT FIX. THIS IS A $1400 REPAIR. NOT HAPPY!",
        "vin": "1G1165S37FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2020",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CHEVY IMPALA 2015 WITH 1401K MILES. I AM EXPERIENCING GM BULLETIN N172097060 SIDE BLIND ZONE ALERT MODULE WATER INTRUSION ISSUE. I WAS TOLD BY BOTH THE DEALER (MACMULKIN CHEVROLET IN NASHUA) AND GM THAT MY ISSUE IS NOT COVERED DUE TO THE FACT THAT MY CAR HAS EXCEEDED THE 80K MILES. I TOLD THEM THAT I DID NOT RECEIVE THE NOTICE UNTIL MY CAR WELL EXCEEDED THE 80K MILEAGE. THE PROBLEM IS GETTING EXTREMELY WORSE. IT'S EFFECTING THE WHOLE ELECTRICAL SYSTEM OF THE CAR. THE CAR'S INSTRUMENT PANEL IS FLASHING ALL OF THE SENSOR ALERTS INTERMITTENTLY AND MY CAR WILL NOT START UNTIL I HAVE IT TOWED TO A MECHANIC AND THEY CLEAR THE FAULTS. THIS HAS HAPPENED TWICE.",
        "vin": "2G1125S32F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SIDE AIRBAG WARNING SYSTEM\" INDICATION.  I TOOK THE CAR TO THE DEALER AND WAS TOLD THE OBJECT DETECTION MODULE AND WIRE HARNESS HAD FAILED DUE TO CORROSION AND IT WOULD NOT BE COVERED UNDER WARRANTY.  I RESEARCHED THIS ISSUE AND FOUND THAT THIS IS A COMMON ISSUE FOR GM VEHICLES.  THE MODULES ARE LOCATED IN A POSITION THAT HAS NO PROTECTION FROM THE ELEMENTS.  TO MAKE IT WORSE, THE MODULE ACTUALLY HAS A VENT THAT ALLOWS MOISTURE TO INFILTRATE THE MODULE.  THIS IS A DESIGN FLAW THAT GM IS WELL AWARE OF.  GM ISSUED A LETTER TO OWNERS OF EFFECTED VEHICLES BUT IF YOU DIDN'T GET A LETTER YOU ARE OUT OF LUCK.  THE LETTER IS SPECIFIC ABOUT MOISTURE INFILTRATION OF THE MODULE AND OFFERS AN UPGRADED KIT TO FIX THE ISSUE.  THE DEALERS HAVE NO IDEA THIS LETTER EXISTS BECAUSE IT'S TECHNICALLY NOT A RECALL.  IN A NUTSHELL, GM IS AWARE THIS SAFETY ISSUE EXISTS IN THEIR VEHICLES BUT ARE DOING THEIR BEST TO AVOID DOING THE RIGHT THING AND REPAIR UNDER A RECALL.  TO ADD INSULT TO INJURY, THIS IS THE 3RD MODULE THAT HAS GONE BAD.  EACH REPLACEMENT IS $983.00.  I'M BUYING A TOYOTA!  GM CARS ARE AWFUL AND THEIR CUSTOMER SERVICE IS WORSE!",
        "vin": "2G1165S35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS AGO I GOT A WARNING INDICATING THE VEHICLE DETECTION SENSOR WAS NOT FUNCTIONING AND THEN YESTERDAY WHILE STOPPED AND IN GEAR AT A RED LIGHT ALL THE SCREENS FLICKERED AND GAUGES WHEN ALL OVER THE PLACE WHILE THROWING OVER 30 CODES ACROSS THE SCREEN INCLUDING ANTI-THEFT WHICH LOCKED ME OUT OF EVERYTHING. I TOOK THE VEHICLE IN IMMEDIATELY AND THEY CONFIRMED OVER 30 CODES WERE THROWN. LOOKS LIKE A BAD DESIGN ON THE SENSORS THEMSELVES ALLOWS CORROSION OVER TIME ESPECIALLY IN COLDER CLIMATES LIKE MINE.",
        "vin": "1G1155SL7FU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307614,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM",
        "vin": "2G1165S31F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/05/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307257,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILED WHILE DRIVING. THE RACK HAS TO BE REPLACED. IT'S A $3,000 REPAIR ON A 5 YEAR OLD CAR WITH LESS THAN 60,000 MILES",
        "vin": "2G1125S31F9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307028,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ROCKER ARM OIL CONTROL VALUE WAS REPLACED ONCE AND HAS WENT OUT AGAIN AND THE PIECE WAS SAID TO BE FAULTY BUT GMC CANNOT TELL ANYONE A DATE ON WHEN THEY WILL HAVE THIS PART AVAILABLE.IVE HAD THIS PART REPLACED ONCVE ALREADY AND NOW IM BEING TOLD IT IS NO LONGER AVAILABLE AND MY CAR THAT I HAVEN'T HAD EVEN A YEAR CANT BE FIXED",
        "vin": "1G11Z5SL2FU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT HEADLIGHTS GO OUT EVERY FEW MONTHS I'VE ALREADY HAD TO REPLACE LIGHTS 3 TIMES IN ONE YEAR",
        "vin": "2G1125S39F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THE AIR BAG WARING LIGHT ILLUMINATED WITH AN ABNORMAL SOUND. THE VEHICLE WAS TAKEN TO THE DEALER (RON CRAFT CHEVROLET 4114, I-10, BAYTOWN, TX 77521 (281) 839-2586) BUT WAS UNABLE TO BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED. THE CONTACT MENTIONED NHTSA CAMPAIGN NUMBER: 15V465000(AIRBAGS) AS A POSSIBLE SOLUTION TO THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 141,536. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301230,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER STEERING ASSIST AND A \"SERVICE POWER STEERING\" MESSAGE.  LOSS STARTED UPON START-UP IN MORNING AND CONTINUED THRU 25 MILE COMMUTE TO WORK. EIGHT HOURS LATER CONDITION WAS GONE AND ALL SYSTEMS NORMAL FROM START-UP TO RETURN COMMUTE HOME.  DURING LOSS OF ASSIST CAR WAS EXTREMELY DIFFICULT TO STEER.",
        "vin": "2G1165S32F9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAVING HOME GOING TO THE FUEL STATION TO GET GAS FOR MY CAR.  I PULLED OUT OF THE GAS STATION AND STARTING DRIVING DOWN THE ROAD ABOUT 1 MIN IN TO DRIVE MY SERVICE LIGHT CAME ON STATING TO SERVICE MY POWER STEERING, I COULD NOT HANDLE THE CAR, THE STEERING WAS STIFF TO TURN, I HAD TO PULL OVER SHUT DOWN THE CAR WAITED A FEW MINUTES STARTED THE CAR BACK UP AND THE POWER STEERING RETURNED TO NORMAL.  SENSE THEN, I HAVE HAD A FEW MORE OCCURRENCES WITH THE POWER STEERING.",
        "vin": "2G1165S38F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDIO DOES NOT WORK. INFO INDICATES \"OFF\". UNABLE TO TURN AUDIO ON.RECEIVED REAR-END BUMP. AFTERWARD NO SOUND FOR WARNING EQUIPMENT OR RADIO. THE VEHICLE WAS BEGINNING FORWARD MOVEMENT. VERY MINOR DAMAGE TO REAR BUMPER AND TRUNK  AUDIO OFF AFTER DAMAGE REPAIRED..",
        "vin": "2G1165S30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "06/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM IS NOT WORKING PROPERLY. IS ALSO CAUSING CAR TO TURN OFF AT LIGHTS AND ONE TIME EVEN STARTED TO SMOKE. S OLD IT WAS COVERED UNDER WARRANTY BUT WHEN I TOOK IT TO THE DEALERSHIP THEY SAID IT WASN'T. ONCE I WAS ABLE TO CONFIRM THAT IT WAS UNDER WARRANTY IT WASN'T ANYMORE BECAUSE I HAD EXCEEDED THE MILES. THIS IS A SAFETY HAZARD AND IS COMMON AMONG PEOPLE WHO OWN THIS YEAR AND BRAND!",
        "vin": "2G1165S35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287515,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COLLISION WARNING SYSTEM  ACTIVATES WHILE DRIVING,  ELECTRICAL FAILURES CAUSE COMPONENTS TO NOT WORK AND FLICKER OF TURN SIGNALS IN PASSENGER MIRROR  .",
        "vin": "2G1125S31F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STABILIZER LIGHT COMES ON, THE VEHICLE JERKS AND THE ENGINE RUNS HARD. IT COULD COME ON WHILE DRIVING OR WHEN U TURN ON THE CAR. SOMETIMES THE STABILIZER LIGHT TURNS OFF WHEN SHUTTING OFF THE VEHICLE A FEW TIMES. THE VEHICLE WOULD DRINK A LOT OF GAS WHEN THE STABILIZER IS ON.",
        "vin": "1G1165S36FU"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "10/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE RS-A",
                "productYear": "9999",
                "size": "255/45R20",
                "type": "Tire"
            }
        ],
        "summary": "4 TIRE SIDEWALL DRY ROT LEADING TO A PARTIAL SIDEWALL SEPARATION ON 1 TIRE, APPROXIMATELY 1 INCH IN SIZE. THESE WERE NEW 50,000 MI TIRES ON A NEW CHEVROLET. THEY WERE REPLACED AT 48,000 MI. , THERE WAS PLENTY OF  TREAD AT TIME OF REPLACEMENT.  ALL 4 WERE REPLACED BY DEALER. I HAVE A PICTURE IF NEEDED.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/23/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281927,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD BACK IN FEBRUARY A WEEK AFTER I BOUGHT THE CAR WITH 90,000 MILES ON IT ONE OWNER THE STEERING WHEEL LOCKED IN POSITION AND ON THE DASH IT SAID 'SERVICE POWER STEERING DRIVE WITH CARE' I REALLY DIDNT KNOW WHAT HAPPENED AND AND TOLD MY SON I SHOULD GET IT CHECKED OUT BEFORE I GIVE IT TO HIM BUT HE WANTED IT NOW AND IT NEVER HAPPENED AGAIN UNTIL 11/22/19 WHEN HE CAME OUT OF WALMART AFTER CRANKING IT AND KILLING IT AND MINUTES LATER IT RESUMED TO NORMAL. NOW I GOT TO DO SOMETHING",
        "vin": "1G1165S34FU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281648,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT IN INSTRUMENT CLUSTER GOES ON AND OFF INTERMITTENTLY, WHILE PASSENGER AIR BAG ON/OFF INDICATOR ABOVE WINDSHIELD ALSO GOES ON AND OFF. THIS HAPPENS WHEN THE PASSENGER SEAT IS BOTH OCCUPIED AND UNOCCUPIED AND CAN BE MADE TO GO ON AND OFF BY MOVING PASSENGER SEAT FORWARDS AND BACKWARDS. THIS PROBLEM IS ONGOING. STARTED APPROX. OCT 15, 2019. TODAY IS NOV 21, 2019",
        "vin": "1G1165S32FU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I STARTED MY CAR THIS MORNING, I GOT AN MESSAGE ON THE INSTRUMENT PANEL THAT SAID SERVICE POWER STEERING DRIVE WITH CARE. WHEN I PUT THE CAR IN REVERSE, I COULD BARELY TURN THE STEERING WHEEL. I LOOKED UP THE SERVICE MESSAGE AND SAW THAT THIS CAR DOES NOT USE POWER STEERING FLUID, BUT RATHER AN ELECTRICAL SYSTEM FOR CONTROLLING THE STEERING. AT THAT POINT I HAD TO LEAVE IT AT HOME SO IT CAN BE TAKEN TO THE MECHANIC. THIS HAPPENED WITH 72,180 MILES ON THE VEHICLE.",
        "vin": "2G1165S36F9"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271682,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER, REAR SEATBELT LOCKED AND WILL NOT RELEASE.  DEALERSHIP STATED THE SEATBELT FAILED BUT DID NOT KNOW WHY, BUT IT NEEDED TO BE REPLACED.  WE WERE PLACING GRANDSON INTO SAFETY SEAT AND WENT TO PULL THE SEATBELT (OVER SHOULDER) AND IT WOULD NOT RELEASE.  DRIVER SIDE REAR WORKS PROPERLY AS WELL AS THE LAP BELT IN CENTER.  THE CAR HAS APPROX. 70600 MILES.  THE REAR SEATS ARE RARELY USED.  COST OF REPAIR, (WITHOUT DISMANTLING IT) IS $385.  THIS FAILURE CAUSED NO INJURIES, HOWEVER IF IT FAILS LOCKING UP IS IT POSSIBLE TO FAIL COMPLETELY AND NOT SERVE IT'S SAFETY COMPONENT REQUIREMENT.",
        "vin": "2G1165S30F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271107,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EB I84 LEAVING BAKER CITY OR, 70MPH, COMING UP ON A SERIES OF \"SLOW SPEED\" S CURVES AND THE ELECTRIC POWER STEERING SHUT DOWN.  MESSAGE ON DIC SAYS \"SERVICE POWER STEERING DRIVE WITH CARE\"  WHEEL WOULD HOLD WHATEVER POSITION IT WAS PUT IN AND WOULD NOT RETURN TO CENTER WITHOUT SIGNIFICANT FORCE.  NEARLY PUT THE CALL INTO THE CONCRETE BARRIER.  JUST BARELY KEPT IT ON THE ROAD.  STEERING WOULD NOT MAINTAIN CENTER.  KEPT TRYING TO REST JUST LEFT OR RIGHT OF CENTER FORCING US TO 'WEAVE' BACK AND FORTH AS WE LIMPED THE CAR HOME.",
        "vin": "2G1125S35F9"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270715,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT CAME ON WHILE DRIVING.  I TOLD MY CAR TO THE MECHANIC AND I WAS TOLD MY MASS ENGINE AIRFLOW NEEDED TO BE REPLACED.  TWO DAYS LATER THE CHECK ENGINE LIGHT WAS ON AGAIN.  RETURN TO THE MECHANIC AND WAS TOLD MY O2 SENSORS NEEDED TO BE REPLACED.  REPLACED AS RECOMMENDED. I WAS DRIVING DOWN THE HIGHWAY AND THE LIGHT CAME ON AGAIN ALONG WITH A MESSAGE THAT SAID REDUCE SPEED.  AT THIS POINT, MY CAR SLOWED DOWN BY ITSELF WHILE I WAS GOING 60 MILES PER HOUR.  I COULD NOT ACCELERATE.  LUCKILY THERE WERE NO CARS BEHIND ME. REVIEWING THE CHEVROLET FORUMS AND IMPALA FORUMS, THIS APPEARS TO BE A KNOWN ISSUE AND GM IS NOT DOING ANYTHING ABOUT IT.  READING SOME OF THE STORIES, I CONSIDER MYSELF LUCKY.      AIRBAG THE PASSENGER AIRBAG LIGHT HAS COME ON AND WILL NOT GO OFF.  I TOOK IT TO THE DEALERSHIP, AND THEY TOLD ME THAT IF I AM IN AN ACCIDENT, THE AIRBAG WILL NOT DEPLOY BECAUSE THE CAR ISN'T RECOGNIZING SOMEONE IS IN THE SEAT.  THEY SAID TO ME THAT GM ISSUED A RECALL FOR THIS PROBLEM; HOWEVER, MY CAR WAS NOT INCLUDED.  I SPOKE WITH A GM REPRESENTATIVE WHO CONFIRMED THE RECALL.  THE GM REPRESENTATIVE SAID ALTHOUGH THE CODE IS SHOWN ON THE DIAGNOSTIC PERFORMED AT THE CERTIFIED DEALER MY VIN WAS NOT COVERED; HOWEVER, THEY OFFERED TO COVER HALF OF MY COST.  HE TOLD ME THAT IF GM EXPANDED THE RECALL TO INCLUDE MY VIN THEN I COULD SEND IN MY RECEIPT FOR A REFUND.",
        "vin": "2G1165S33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR SAFETY ISSUE STARTED WITH COLLISION SENSORS COMING ON WHEN NO ONE WAS IN A LANE NEXT TO US.  THEN THE LIGHT WOULD STAY ON IN SIDE THE VEHICLE AFTER CAR WAS SHUT OFF.  PROBLEM STARTED AROUND 35,000.  PROBLEM SELF CORRECTED, HOWEVER AT 36,100 MILES THE SENSOR FOR INDICATING CARS IN THE BLIND SPOTS ON RIGHT SIDE OF CAR COMPLETELY FAILED.  IF YOU HAVE EVER DRIVEN A 2015 IMAPA ONE WILL QUICKLY NOTICE THE LARGE BLIND SPOT AREAS AND THE IMPORTANCE OF THESE SAFETY DEVICES.  STARTED HAVING PROBLEMS WITH KEY FOB, THEFT SYSTEM, RADIO, ETC AT 40,900 MILES.  THIS BECAME A MUST FIX NOW.  A MODULE KIT HAS BEEN ORDERED (02195-C) AND THIS IS SUPPOSE TO FIX THE PROBLEMS.  BAD SENSOR OR SENSORS IN THE BUMPER.  PART IS ON BACK ORDER SO THIS INDICATES TO ME THE PROBLEM MAY BE A BIT MORE WIDE SPREAD IMPACTING CHEVY OWNERS AND THERE SAFETY.  NOW OF CONCERN I READ THIS HAS BEEN A KNOWN PROBLEM WITHIN CHEVY BUT THE VEHICLE PROBLEM WAS NOT ADDRESSED IN NEW MODELS OR FIXED FOR FREE IN A TIMELY MANNER.  HOPEFULLY THIS BECOMES A RECALL ITEM AND ADVERTISED TO CURRENT OWNERS.",
        "vin": "1G1165S35FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "05/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CHEVY IMPALA SERVICE SIDE DETECTION SYSTEM WARNING ALERTED AND ALL OF A SUDDEN THE ENTIRE ELECTRICAL SYSTEM SHUT DOWN AND CAME BACK ON WHILE DRIVING THE VEHICLE ON THE HIGHWAY..  TOOK THE VEHICLE TO THE DEALERSHIP WAS TOLD TO CONTACT GM AND WAS TOLD THAT DUE TO MILEAGE THERE WAS NOTHING THAT COULD DONE.  UPON RESEARCH FOUND OUT THAT MY VEHICLE IS NOT THE ONLY ONE THAT EXPERIENCE THIS ISSUE.",
        "vin": "1G1165S37FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SENSOR WENT OUT, PARK ASSIST SYSTEM OUT, TIRE MONITOR SYSTEM OUT, ALL AT ONCE. HAD SMOKE COMING FROM A SENSOR IN THE BACK OF THE VEHICLE. ELECTRICAL SYSTEM AFFECTED, WHEN DRIVING, ALL DASHBOARD LIGHTS FLASH AT ONCE THEN MAY NOT DO IT AGAIN FOR WEEKS, CAR GOES QUIET WHEN DRIVING FOR A SECOND LIKE ITS SHUT DOWN THAN WORKS AGAIN.",
        "vin": "1G1165S33FU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255473,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "P16D0 CODE",
        "vin": "2G1115SL0F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253745,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING LEFT TURNS OR BACKING UP GRINDING NOISE TOOK IT TO INDEPENDENT SHOP REPLACED WHEEL BEARING STILL CONTINUED REPLACED OTHER WHEEL BEARING AT THAT TIME RACK AND PINION WAS LEAKING HAD THAT REPLACED 2 DIFFERENT TRIPS TO THE SHOP AND AROUND 2000 AFTER ABOUT 6 WEEKS STARTED BACK UP AGAIN. I START TO LOOK INTO IT AND I SEE A LOT OF FOLKS ARE HAVING THE SAME PROBLEMS WITH THIS I BELIEVE IT'S THE ABS WIRE HARNESS IS TO SHORT AND WITH BRAKE OVER TIME. I FEEL IF I FIX THIS WITH A NEW HARNESS IT WILL JUST BREAK AGAIN. MY NEEDS TO FIX THIS PROBLEM AND MAKE A NEW HARNESS. I BOUGHT THE CAR IN OCT 16 WITH ABOUT 40K STARTED TO HAPPEN NOT LONG AFTER VERY INTERMITTENT UNTIL MAY WHEN I COULDN'T GET OUT OF MY NEIGHBORHOOD WITH OUT STABILATRAK AND ABS LIGHTS GOING OFF WHEN I TOOK IT IN LIKE I SAID 6 WEEKS LATER JUST AS BAD AND OUT THE MONEY",
        "vin": "2G1WC5E36F1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE DRIVING, THE VEHICLE VIBRATED WHEN THE BRAKE PEDAL WAS DEPRESSED. THE CONTACT REPLACED THE ROTORS AND THE BRAKE PADS ON THE VEHICLE. ONCE THE CONTACT APPLIED THE EMERGENCY BRAKE, THE VIBRATION RECURRED. THE CONTACT PLACED THE OLD ROTORS BACK ON THE VEHICLE IN AN EFFORT TO ALLEVIATE THE VIBRATION. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 14V541000 (PARKING BRAKE). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 54,000.",
        "vin": "2G1125S32F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR STARTED TO COME ON RANDOMLY.",
        "vin": "2G1165S34F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243313,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC OCCUPANT SENSING SYSTEM (AOS) IS FAILING TO RECOGNIZE THE FRONT PASSENGER. THE SERVICE AIRBAG ALERT GOES OFF AND ON EVERY 3 TO 4  MINUTES. THERE WAS A RECALL ON THE 2015 CHEVY IMPALA FOR THIS SAME ISSUE BUT SOMEHOW MY VEHICLE WAS NOT ASSOCIATED WITH THIS RECALL. I BELIEVE THAT THIS MAY BE IN ERROR. I FEAR FOR MY DAUGHTERS SAFETY ,AND HAVE HAD CONTINUOUS ISSUES WITH VEHICLE INCLUDING MAJOR ELECTRICAL, KEY FOB, BATTERY CHARGING, COMPLETE AC FAILURE WHICH WILL BE A 2400.00 CHARGE IN WHICH I CANT AFFORD ON TOP OF THE AIR BAG ISSUE AND HAVE GOTTEN NO RESOLUTION. I AM A SINGLE MOM AND THIS IS MY FIRST VEHICLE THAT I HAVE FINANCED, THIS IS A TOTAL NIGHTMARE. PLEASE INVESTIGATE AND HOPEFULLY FOLLOW UP WITH THIS ISSUE. THANKS",
        "vin": "1G1125S39FU"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "07/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 25 MPH, THE VEHICLE STALLED WITHOUT WARNING CAUSING ANOTHER VEHICLE TO CRASH INTO THE REAR. THE CONTACT MENTIONED THAT THE POLICE WAS THERE BUT WAS UNAWARE IF A REPORT WAS FILED. THE AIR BAGS DID NOT DEPLOY. THE CONTACT STATED THAT THERE WERE NO INJURIES.  THE VEHICLE WAS NOT DRIVABLE AND WAS TOWED TO A TIRE FACILITY WHERE THE FAILURE WAS UNDETERMINED THE VEHICLE WAS THEN TOWED TO SERRA CHEVROLET BUICK GMC OF NASHVILLE (2340 GALLATIN PIKE N, MADISON, TN 37115 (615) 543-5456) WHERE THE CONTACT FAILED TO REMEMBER THE DIAGNOSIS HOWEVER, DID RECALL THAT THE BATTER WAS REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "08/02/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242612,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CHEVY IMPALA LT SPONTANEOUSLY CAUGHT FIRE WHILE MY HUSBAND, MYSELF AND TWO DOGS WHERE IN MOTION DRIVING UP I-95 N TO MY GRADUATION.  THE ONLY WARNING WE RECEIVED WAS TO SERVICE STABILITRAK WHICH HAS CAME ON AT THAT TIME WHEN THE CAR WAS ALREADY ON FIRE. THERE WAS NOT RECENT WORK DONE ON THE CAR. UNKNOWN WHY THIS OCCURRED",
        "vin": "2G1115SL3F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BLIND SPOT LIGHT STAYS ON, ON THE PASSENGER SIDE OF MY REAR VIEW MIRROR.  ITS BEEN ON FOR 6 DAYS & THE DISPLAY SAYS SERVICE SIDE DETECTION SYSTEM. IT IS ON ALL THE TIME EVEN WHEN THE CAR IS OFF.",
        "vin": "2G1125S32F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234349,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE OPERATING THE VEHICLE, THE SERVICE AIR BAG WARNING INDICATOR DISPLAYED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. GUNN CHEVROLET (1650 I-35 NORTH SELMA, TX) AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 44,000.",
        "vin": "1G1165S33FU"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "06/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THE KEY FOB BUTTONS DETACHED, THE VEHICLE SPONTANEOUSLY STARTED, AND THE TRUNK UNLOCKED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED SONS CHEVROLET (3615 MANCHESTER EXPY, COLUMBUS, GA 31909, (706) 322-8888) TO INFORM THEM OF THE FAILURES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 47,060.",
        "vin": "2G1125S38F9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW IS SMALL AND I DEPEND ON THE BACK UP CAMERA BUT IT IS DARK AND I CANNOT SEE A PERSON BEHIND THE CAR -- THE DEALERSHIP SAYS THAT'S THE WAY IT'S MADE AND GM GOES WITH THEIR DEALERSHIP -- THEY'RE WRONG -- TRIED TO GET IT FIXED SEVERAL TIMES WITH NO LUCK",
        "vin": "1G1115SL2FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SEVERAL MONTHS I WAS HAVING A PROBLEM WITH MY SIDE BLIND ZONE ALERT SYSTEM . DURING DIAGNOSTIC TESTING IT WOULD APPEAR TO BE WORKING. FINALLY THE PROBLEM WAS IDENTIFIED, REPLACED BY THE DEALERSHIP, NO COST TO ME, AND REPLACEMENT IS WARRANTED UP TO 80,000. NOW, A WEEK AFTER HAVING THE BLIND ZONE ALERT SYSTEM REPAIRED ,I STARTED MY CAR, AND NOTED  MY DIC , ON THE INSTRUMENT CLUSTER WENT DARK, THE RADIO WENT DEAD, REAR VIEW CAMERA DID NOT WORK ETC, ETC.  DROVE APPROX. TEN MILES, PARKED VEHICLE. APPROX. A HOUR LATER, STARTED VEHICLE, DIC IS NOW WORKING.  I'M CONCERNED THAT THE ELECTRICAL SYSTEM IS FAULTY.  I CONTACTED THE DEALERSHIP, AND THEY STATED, SINCE IT IS NOW WORKING, THERE IS NO WAY OF TELLING WHAT IS WRONG, AS LONG AS IT IS WORKING AGAIN.  I'M CONCERNED THAT THE ELECTRICAL SYSTEM WILL FAIL AGAIN AND I MAY BE STRANDED SOMEWHERE.  I ONLY HAVE 25,000 MILES ON MY 2015 2LT IMPALA!",
        "vin": "2G1125S30F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I TURN THE STEERING WHEEL TO THE LEFT, THE STABILITRACK AND ABS DASHBOARD LIGHTS COME ON AND THE READ-OUT PANEL SAYS BOTH SYSTEMS NEED SERVICE AND THESE LIGHTS STAY ON AND THE SYSTEMS SHUT-OFF MAKING THE VEHICLE LESS SAFE.  I SHOULD POINT OUT THAT THE LIGHTS COME ON WHEN THE PAVEMENT IS DRIVE AND ITS WARM OUT.  WHY IS THIS HAPPENING TO THE RELATIVELY NEW CAR WITH BARELY 50,000 MILES.  THE CAR IS DESIGNED TO BE DRIVEN WITH THE STABILITRACK AND ABS SYSTEMS WORKING PROPERLY.  I'VE LOOKING INTO THIS ON-LINE AND IT APPEARS MANY PEOPLE WITH IMPALA'S ARE EXPERIENCING THE SAME ISSUE.  PEOPLE HAVE PAID TO HAVE PAID TO HAVE THE WHEEL BEARING ASSEMBLIES REPLACE, BRAKES REPLACE, SENSORS REPLACES, ONLY TO HAVE THE \"SERVICE\" LIGHT COME BACK ON SOON AFTER THE SERVICE HAS BEEN COMPLETED.  FROM MY READING, IT APPEARS GM NEEDS TO ISSUE A RECALL TO FIX THIS ISSUE.  THANK YOU",
        "vin": "2G1WB5E33F1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. SIDE DETECTION SERVICE MESSAGE CENTER LIGHT IS A DAILY MESSAGE. ALSO RADIO BLACK SCREEN. RADIO SHORT,DASH BLACK SCREEN.",
        "vin": "1G1165S35FU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228553,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, SIDE DETECTION ERROR.   ALL GAUGES STARTED JUMPING AROUND AND NOT WORKING.  AFTER SHUT OFF CAR AND TRIED TO RESTART, IT WOULDN'T TURN OVER. CHECKED AND BATTERY WAS OK BUT IGNITION WAS ACTING LIKE NO POWER.   TOW TRUCK TO THE DEALER.  DEALER SAID IT WAS A KNOWN ISSUE AND THEY WOULD REPAIR FOR FREE.  THAT WAS 6 WEEKS AGO AND IT IS STILL SITTING AT DEALER BECAUSE THE PART IS ON BACK ORDER.  CHEVROLET WILL NOT COVER THE COST OF A RENTAL VEHICLE.  I HAVE TALKED TO 4 DIFFERENT PEOPLE (I HAVE KEPT ESCALATING) OVER A 3 WEEK PERIOD - HOWEVER WITH NO RESOLUTION.  AFTER MY LAST REQUEST FOR ESCALATION, THEY SAID I WOULD GET A CALL BACK IN 3-5 DAYS.  THAT WAS 2 WEEKS AGO AND I'VE NEVER RECEIVED A CALL BACK.  DEALERSHIP IS UNABLE TO PROVIDE AN ESTIMATE OF WHEN THE PART WILL BE AVAILABLE.",
        "vin": "1G1125S38FU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223183,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE ROCKER ARM OIL CONTROL VALVE DETERIORATES AND PIECES GET LODGE IN THE CAM COVER PASSAGES. CAUSES VEHICLE TO MISFIRE AND NOT SHIFT PROPERLY. HAPPENS WHILE SITTING IDLE OR MOVING",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228272,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SIDE DETECTION SYSTEM RECALL IS ONLY FOR 5 YEARS AND 80000 MILES. CHEVY KNOWING THIS IS A BAD PART, SHOULD HAVE TO FIX ALL SYSTEMS THAT FAIL DUE TO BAD MODULES.",
        "vin": "1G1165S30FU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "P0442(EVAP SMALL LEAK)  USING EVAP TOOL J-41413-200,PRESSURE TESTED THE EVAP SYSTEM  WHILE PERFORMING SYSTEM SEAL.FOUND THAT THE EVAP PURGE  SOLENOID IS LEAKING.PLUGGED THE EVAP PURGE SOLENOID PORT  AND FOUND EVAP PRESSURE LOSS NOT PRESENT.  REVIEWED TECH 685 AND 201 HISTORY.PARTS WARRANTY  CAUSE:FAILED PURGE SOLENOID FAILURE  INSTALLED NEW EVAP PURGE SOLENOID.RETESTED AND VERIFIED  SYSTEM SEAL.  GM PARTS WARRANTY LO: 4025690 1.2 0329/6579  ORIGINAL RO# 495351 58101 MILES 03/14/2019  I HAD THIS CAR IN FOR THE SAME REPAIR MARCH 14, 2019 AND AGAIN JUNE 26, 2019. WHAT IS WRONG WITH THIS CAR THAT THIS PART GOES OUT SO OFTEN?",
        "vin": "1G1125S33FU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222141,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE DRIVING, THE SPEED FAILED TO EXCEED 50 MPH AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO COURTESY CHEVROLET BUICK GMC (1220 E STONE DR, KINGSPORT, TN 37660, (423) 343-5036) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION FLUID WAS DIRTY AND NEEDED TO BE FLUSHED. THE VEHICLE WAS REPAIRED. THE VEHICLE WAS TAKEN TO JACKSON CHEVROLET BUICK GMC (1975 N MAIN ST, LAFAYETTE, GA 30728,(706) 638-4222) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 79,361.",
        "vin": "2G1WB5E3XF1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2019",
        "dateOfIncident": "06/21/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SIDE DETECTORS MALFUNCTION, SMELL OF WIRE BURNING IN THE CAR, ALL DASHBOARD SYSTEMS STOPPED WORKING WHILE DRIVING ON HIGHWAY.",
        "vin": "2G1165S30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND ZONE ALERT MESSAGE IS DISPLAYED ON THE DRIVER INSTRUMENT CLUSTER (DIC) DUE TO WATER INTRUSION.  CHEVROLET IS REPLACING THE PART(S) UNDER WARRANTY BUT THE PART(S) ARE CURRENTLY NOT AVAILABLE AND HAVE BEEN ON BACK-ORDER FOR SEVERAL WEEKS.  THE FOLLOWING THREE (3) SAFETY FUNCTIONS ARE NOT OPERATING: \"REAR CROSS TRAFFIC ALERT\", \"REAR PARK ASSIST\" AND \"LANCE CHANGE ALERT WITH SIDE BLIND ZONE ALERT\".  ALSO HAVE NOTICED THE \"FORWARD COLLISION WARNING ALERT\" IS NOT FUNCTIONING.  GM CUSTOMER CARE STATES THE PART(S) ARE ON ORDER.  ESTIMATED DELIVERY TIME IS UNKNOWN.",
        "vin": "2G1155SL7F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/07/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221825,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SIDE DETECTION SYSTEM HAS FAILED AND NOT WORKING ON MY 2015 CHEVY IMPALA LT. MY CAR NEARLY CAUGHT ON FIRE TWICE NOW. WHITE SMOKE WAS BILLOWING FROM MY TAILLIGHTS AND BEFORE THAT MY ENTIRE INSTRUMENT CLUSTER WENT DEAD.  AT FIRST IT SAID TO HAVE IT SERVICED. THEN MY FOB WOULD NO LONGER UNLOCK MY DOORS WITHOUT MANUALLY USING IT, THE SAME DAY MY CAR WOULD NOT START. I HAD ALL SORTS OF LIGHTS AND WARNINGS GO OFF. MY WHOLE COMPUTER SYSTEM WENT HAYWIRE THUS NOT BEING ABLE TO START MY CAR. AFTER GETTING MY CAR STARTED, I DID NOT HAVE ANY GAUGES, LIGHTS,NOTHING. IT WAS VERY DANGEROUS DRIVING",
        "vin": "2G1125S31F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING OUT OF THE GAS STATION ON TO A BUSY HIGHWAY WHEN THE STEERING WHEEL BECAME VERY DIFFICULT TO MOVE AND A MESSAGE CAME UP ON MY DASH SAYING \"WARNING: POWER STEERING SYSTEM FAILURE DRIVE WITH CAUTION. I WAS ABLE TO GET THE CAR TO A PARKING LOT AND POWER CYCLE WITH NO EFFECT. AFTER LETTING THE CAR SIT FOR 15 MINUTES I RESTARTED IT AND THE POWER STEERING WAS WORKING NORMALLY. THIS IS THE SECOND TIME IT HAS FAILED.",
        "vin": "2G1125S34F9"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/15/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER FILLING TRUNK AND GETTING THE BACK SEAT CARPET WET. MOLD SMELL UNTIL I DISCOVERED THE TRUNK NEEDS TO BE DRAINED. FOUND LEAKING GASKETS ON TAIL LIGHTS. BUMPER NEEDS TO BE REMOVED. COMMON PROBLEM DEALER WILL NOT FIX UNDER WARRANTY. I ONE OF THE TAIL LIGHTS ALSO FAILED. 38K MILES",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SERVICE AIRBAG LIGHT AS WELL AS CHECK ENGINE LIGHT GO ON AND OFF WITH NO APPARENT REASON. I BELIEVE AN ELECTRICAL ISSUE.",
        "vin": "1G1115SL0FU"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK OF THE CAR LEAKS AROUND THE TWILIGHTS CAUSING THE TWILIGHTS TO SHORT OUT AND WATER TO GET INTO THE TRUNK",
        "vin": "2G1165S32F9"
    },
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209583,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK POWER STEERING LOST POWER ON BRIDGE & COULD BARELY TURN WHEEL  HAD THE VEHICLE TOWED TO DEALER WHEN I WAS INFORMED IT WAS ALSO LEAKING GAS FUMES",
        "vin": "2G1165S3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE VEHICLE DETECTION GETS HOT AND SMOKES. CAUSING ELECTRICAL MALFUCTION.IN MOTION AND STANDING STILL.",
        "vin": "2G1165S3XF9"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207851,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL CHEVY EMBLEM HAS A DENT HALF CIRCLE ON THE AIRBAG SECTION AND THE TRUNK WHERE THE SPARE IS STORED IS GETTING WATER MAKING TRUNK MOLD AND MILDEW.",
        "vin": "2G11Z5SL5F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD LESS THAN 60,000 MILES ON IT WHEN IT FIRST SAID SERVICE SIDE DETECTION, NOW I NO LONGER HAVE BLIND SPOT DETECTION, FRONT CAMERA OR ANY OF THE OTHER SAFETY FEATURES I PAID EXTRA TO HAVE. ITS BECAUSE THE COMPUTER FOR IT IS PLACED NON WEATHER PROTECTED IN THE BUMPER OF THE CAR AND AFTER IT GETS EXPOSED TO OUR WEATHER IT RUINS IT. IT'S A PRICEY FIX THAT WILL JUST KEEP GETTING RUINED. ITS A FAULTY ERROR ON CHEVYS END THIS SHOULD BE RECALLED AND REPLACED. WHEN MINE FIRST WENT OUT I READ ABOUT MANY OTHERS HAVING THE SAME PROBLEM, I JUST KEEP WAITING HOPING THAT CHEVY WILL STEP UP AND DO THE RIGHT THING. THIS IS MY 3RD IMPALA I HAVE OWNED, I ALWAYS SWORE THEY WOULD BE MY ONLY CAR BUT NOW THIS WILL BE MY LAST IMPALA I WILL NEVER OWN ANOTHER ONE. WAY TOO MANY ELECTRICAL PROBLEMS.",
        "vin": "2G1165S35F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207372,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING, POWER STEERING WAS LOST. IT WAS EXTREMELY DIFFICULT TO TURN THE STEERING WHEEL. I COULD HAVE EASILY CRASHED. THE DASH DISPLAY SHOWED A MESSAGE, CONFIRMING THE PROBLEM. MY OBD SCAN TOOL SHOWED THE TWO FOLLOWING DTC CODES LISTED UNDER POWER STEERING: C00800-12 AND C056D-3B.",
        "vin": "2G1125S33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205662,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE BLIND ZONE ALERT IS MALFUNCTIONING.  THE DEALER HAS MENTIONED THAT THIS IS DUE TO WATER GETTING INTO THE ELECTRICAL UNIT/MODULE.",
        "vin": "1G1155SL0FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205324,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBURARY 2ND MY SIDE DETECTION SERVICE ALERT TURNED ON IN MY INFOTAINMENT CENTER AFTER I STARTED THE CAR.. NOW BOTH SIDES DRIVER AND PASSENGER DETECTORS DONT WORK AT ALL.. I FEEL IT'S THE RESULT OF MOISTURE GETTING INTO THE MODULES.",
        "vin": "2G1165S35F9"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SENSORS ON THE BACK BUMPER WENT BAD DUE TO MOISTURE GETTING IN, SCREWED UP ELECTRICAL SYSTEM WHICH IS THE BRAINS OF THE VEHICLE. CHEVY NEEDS TO RECALL THIS CAR, TONS OF OWNERS ARE HAVING THIS EXACT PROBLEM. MY VEHICLE IS CURRENTLY IN THE REPAIR SHOP AND THE SENSORS ARE NOT AVAILABLE DUE TO THE OVERWHELMING NUMBER OF CUSTOMERS THAT ARE HAVING TO PURCHASE THEM. THE REPAIR SHOP CANNOT EVEN BE GIVEN AN EXPECTANT DATE THAT THE SENSORS AND WIRING HEIRNESS WILL BE AVAILABLE. RECALL THESES CARS CHEVY, THEY KNOW THIS IS A MANUFACTURE DEFECT, THIS IS A $1500 FIX THAT THE CUSTOMER IS LEFT TO PAY. WHEN THEY KNOW TONS OF CUSTOMERS WITH THIS VEHICLE ARE HAVING THE VERY EXACT SOME ISSUES. MY VEHICLE WAS IN MOTION WHEN I EXPERIENCED THE ISSUES.",
        "vin": "2G1165S3XF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM HAS FAILED AT JUST OVER 38000 MILES.",
        "vin": "2G1165S31F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RETURNING FROM A RECENT DRIVE BACK FROM NEBRASKA INTO COLORADO THE SUNROOF (THE PORTION THAT VENTS AND SLIDES) EXPLODED. NO OTHER INDICATORS WERE PRESENT. NO BAD WEATHER NO DEBRIS FROM ANOTHER VEHICLE WERE HEARD OR SEEN. THERE WERE SOME HIGH WINDS IN THE AREA BUT THAT WAS ABOUT IT.",
        "vin": "2G1165S37F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/28/2019",
        "dateOfIncident": "04/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE WATER IN SPARE TIRE COMPARTMENT POSSIBLY FROM LEAKING REAR WINDSHIELD AND/OR REAR TAIL LIGHTS. WATER ACCUMULATES IN THIS AREA AFTER ANY TYPE OF RAIN WHILE DRIVING OR STATIONARY.",
        "vin": "1G1165S34FU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM FAULTED OUT. NOW OTHER ISSUES WITH FRONT CAMERA AND OTHER SYSTEMS FAILING.",
        "vin": "2G1125S39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203359,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY THE DASH AND RADIO GO ALL BLACK, GETTING NO POWER. WHEN OPENING OR CLOSING SUNROOF, IT WILL STOP IN THE MIDDLE. IT EITHER STOPS COMPLETELY OR WILL STOP AND GO IN OPPOSITE DIRECTION AS THE BUTTON PUSHED. WHEN STEPPING ON THE BRAKE TO PUSH START, THE BRAKE GETS SUPER HARD AND THE DASH PANEL WILL SAY, 'PRESS BRAKE TO START.' I AM PRESSING THE BRAKE! MOST RECENTLY, 'SIDE DETECTION' IS DISPLAYING ON DASH PANEL AND BLIND SPOT LIGHTS ARE NOT LIGHTING UP ON MIRRORS. I'VE READ A NUMBER OF SIMILAR ISSUES ONLINE WITH THE SAME YEAR. I HAD THIS CAR BACK 7X FOR WATER GETTING IN THE TRUNK. IT LAYS WHERE THE SPARE TIRE IS AND THE CARPET ABOVE IS NEVER WET. EVERY-TIME THE DEALERSHIP SAID IT WAS SOMETHING DIFFERENT. OH AND IT STILL IS GETTING WATER IN THE TRUNK. DEALERSHIP SAID THEY DON'T KNOW WHAT ELSE TO DO! JUST YESTERDAY I WAS STOPED AT A RED LIGHT AND IT SOUNDED AND FELT LIKE THE CAR WAS GOING TO SHUT DOWN. THEN IT GAINED POWER JUST AS FAST. MY CAR ONLY HAS 27,000 MILES AND A LOT OF PROBLEMS.",
        "vin": "1G1165S37FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A WARNING ON THE MESSAGE CENTER ASKING TO \"SERVICE SIDE DETECTION SYSTEM\"  I'M FINDING THAT THE LIGHTS ON THE MIRROR WILL SOMETIMES COME ON QUICKLY FOR ONLY A SECOND OR TWO AND THEN SHUT OFF.  THEY ARE DOING THIS ON RANDOM OCCASIONS AND OBVIOUSLY NOT WORKING PROPERLY.  I FOUND SOME WEBSITES SHOWING WHERE THESE MONITORS ARE AND HAVE FOUND THAT MINE ARE COVERED IN DIRT AND SEEM TO HAVE THE DRIED SALT \"WHITE\" CRUST ON THEM.  MY GUESS, JUST LIKE EVERYONE ELSE IS THAT THEY ARE CORRODED AND NEED REPLACING.  THIS SEEMS TO BE A SERIOUS ISSUE THAT NEEDS LOOKING INTO AS THIS CLEARLY IS A SAFETY CONCERN.",
        "vin": "2G1165S35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202694,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OBJECT SENSOR/ CONTROL MODULE CORRODED PREMATURELY OR WAS NOT PROPERLY DESIGNED. I HAVE A DIC LIGHT ON AND WIRING HARNESS CORRODED AS WELL. PART NUMBER 23133813.",
        "vin": "2G1125S34F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OBJECT SENSOR MODULES THAT CONTROL SAFETY FEATURES LIKE BLIND SPOT ALERTS AND GAP ALERTS HAVE FAILED CREATING MORE PROBLEMS FOR MY VEHICLE. THIS IS A MAJOR SAFETY CONCERN AND SHOULD BE RECALLED BY CHEVY.  MY DEALERSHIP SAID THAT MY EXTENDED WARRANTY WILL NOT COVER THIS ISSUE EVEN THOUGH IT IS ULTIMATELY AN ELECTRICAL PROBLEM AND NOTHING I DID CREATED THIS MAJOR ISSUE.  THIS ISSUE OCCURRED WHILE I WAS DRIVING AND IMMEDIATELY HAD AN EFFECT ON MY DRIVING CONDITION.",
        "vin": "1G1165S33FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION MODULES ARE IN AN AREA, REAR BUMPER, WHERE MOISTURE CAN SATURATE THE SENSOR/MODULE WHICH THEN CAUSES A FAULT. THE DASH DISPLAY THEN BEGINS TO FLASH AND TURN OFF AND ON. GAS PEDAL CAN ALSO BE AFFECTED, WHERE YOU CANT CONTROL ACCELERATION. THIS HAPPENS WHEN VEHICLE IS STATIONARY AND IN MOTION.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE BLIND ZONE MONITORING SYSTEM FAILURE. AT APPROXIMATELY 40,000 MILES PASSENGER SIDE SBZM LIGHT WAS CONSISTENTLY ON THEN SYSTEM FAILED. AT APPROXIMATELY 47,000 MILES DRIVER SIDE LIGHT IS CONSISTENTLY ON. SEEMS TO BE A VERY COMMON ISSUE ON THESE CARS",
        "vin": "2G1125S35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195850,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON 2-LANE ROAD AND THE RIGHT SIDE DETECTION SYSTEM (SDS) INDICATOR LIGHT IN THE SIDE MIRROR CAME ON EVEN WHEN THERE WERE NO CARS OR OBJECTS NEXT TO ME. THE INDICATOR LIGHT WOULD NOT TURN OFF EVEN WHEN THE CAR WAS OFF AND PARKED. NO WARNING MESSAGES CAME UP WHEN THE CAR WAS STARTED.  I TURNED THE SDS AND PARK ASSIST OFF IN SETTINGS, BUT THE LIGHT REMAINED ON. I REMOVED FUSE 62 (REAR CAMERA/PARK ASSIST/SIDE BLIND ZONE ALERT) IN THE ENGINE COMPARTMENT FUSE BLOCK TO GET THE LIGHT OFF. I REINSTALLED THE FUSE AND THE LIGHT REMAINED OFF UNTIL THE NEXT TIME I STARTED THE CAR AND IT TURNED BACK ON AND STAYED ON.  A FEW DAYS LATER I GOT A WARNING MESSAGE TO SERVICE THE SDS WHEN I STARTED MY CAR. THE BLIND ZONE ALERT SYSTEM INDICATOR LIGHTS DID NOT COME ON AND THE SYSTEM DID NOT WORK AT ALL EVEN WHEN VEHICLES WERE IN MY BLIND SPOT ON THE LEFT OR RIGHT SIDE OF MY CAR.  I RECEIVED 3 WARNING MESSAGES WHEN I STARTED MY CAR. THEY SAID TO SERVICE FRONT CAMERA, PARK ASSIST AND SDS. FUSE 62 WAS BLOWN. I REPLACED THE FUSE AND IT IMMEDIATELY BLEW AGAIN. NONE OF THE DRIVER ASSIST SYSTEMS WORKED INCLUDING THE SIDE BLIND ZONE ALERT, LANE DEPARTURE WARNING, FORWARD COLLISION ALERT SYSTEM, PARK ASSIST AND REAR CROSS-TRAFFIC ALERT.  I TOOK MY CAR TO LAKE GENEVA CHEVROLET DEALERSHIP. THEY DIAGNOSED THE PROBLEM, WHICH REQUIRED REMOVING THE REAR BUMPER TO CHECK THE 2 SBZA MODULES MOUNTED ON THE INSIDE CORNERS OF THE BUMPER. THEY DISCOVERED CORROSION IN BOTH MODULES DUE TO WATER INTRUSION, WHICH SHORTED OUT THE ELECTRONICS. THEY SAID IT WAS CAUSED BY WATER ON THE MODULE SEAM GETTING INTO IT BY FREEZE THAW. THEY HAD TO REPLACE BOTH MODULES FOR A TOTAL COST INCLUDING LABOR OF $1172. THEY STATED THAT IT WILL HAPPEN AGAIN SINCE IT IS THE SAME MODULE DESIGN AND DUE TO THE MOUNTING LOCATION. CHEVY HAS KNOW ABOUT THIS SINCE BEFORE 5-2017 WHEN THEY ISSUED TSB# 17-NA-154 ABOUT EXACT PROBLEM.",
        "vin": "2G1165S33F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195606,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED WITH SIDE DETECTION LIGHT NOT GOING OFF. THEN SERVICE FOR SIDE DETECTION CAME ON. WITHIN A WEEK I HAD MULTIPLE ERRORS AND SERVICES SUCH AS REAR CAMERA, FRONT CAMERA, COLLISON PREP, PARK ASSIST. REPLACED FUSES EVEN THOUGH NOTHING WAS WRONG WITH THEM. SAME LIGHTS. AS THE DAYS GO ON... I AM EXPERIENCING TROUBLES WITH CAR STARTING HAVING TO MANUALLY START/INSERT FOB INTO CENTER CONSOLE. HEATING AND ELECTRICAL INSIDE CAR NOT WORKING, STOPPED IN MIDDLE OF DRIVING AND IT WAS FOGGY AND OBVIOUSLY I COULDN'T DEFROST MY WINDOWS. RESTARTED CAR NUMEROUS TIMES AND THEN HEAT POPPED BACK ON. ALSO IN THE MIDDLE OF DRIVING IT STATES KEY FOB NOT DETECTED AND IT'S LITERALLY IN THE CUP HOLDER. I HAVE CHANGED THE BATTERY RECENTLY AT THE DEALER SO IT IS NOT A FAULTY FOB OR BATTERY. MY TRUNK HAS BEEN JUST POPPING OPEN FOR NO REASON AND SEVERAL TIMES WHILE I WAS DRIVING BUT ALSO WHILE STATIONARY. FOR SOME REASON MY POWER STEERING IS NOW ACTING LIKE IT IS OUT OF FLUID AND GRINDING HOWEVER ALL FLUID IS FULL. IT SEEMS TO BE ALL ELECTRICAL AND VERY SCARY AND UNPREDICTABLE.",
        "vin": "2G1165S32F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "03/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SIDE DETECTION WARNING LIGHT CAME ON AND WOULD NOT SHUT OFF, I TURNED MY CAR OFF AND STILL IT WAS ON, UNTIL WHAT SEEMED LIKE THE LIGHTS BURNED OUT IN MY READ VIEW MIRRORS. THE WARNING COMES UP ON MY DASH REPEATEDLY. I JUST RECEIVED A BID TO HAVE IT FIXED, $1200. 00 AND ITS PARTS ARE BACK ORDERED FROM CHEVY. SEEMS PEOPLE EVERYWHERE ARE HAVING THIS PROBLEM ONLINE. I CALLED CHEVY, THEY SAID NO RECALL UNTIL THERE IS A \"SAFETY CONCERN\", NOT COVERED UNLESS YOU ARE UNDER YOU 36K MILES. I AM NOT, SUPER FRUSTRATING TO PAY THAT MUCH TO HAVE A \"CONVENIENCE\" FEATURE FIXED.",
        "vin": "2G1165S3SF9"
    },
    {
        "components": "PARKING BRAKE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "03/08/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE DRIVING 50 MPH, THERE WAS AN ABNORMAL ODOR OF BURNING BRAKE PADS. ON SEVERAL OCCASIONS, THE PARKING BRAKE ENGAGED INDEPENDENTLY AND, SOMETIMES, TOOK AN EXTENDED AMOUNT OF TIME TO DISENGAGE. THE VEHICLE WAS TAKEN TO ATHENS CHEVROLET (LOCATED AT 4110 ATLANTA HWY, ATHENS, GA 30606, (706) 549-3512). THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V541000 (PARKING BRAKE). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 71,000.",
        "vin": "2G1155SL1F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "04/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, SIDE DETECTION SYSTEM WARNING LIGHT APPEARS. 66800 MILES.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193794,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY VEHICLE AND INSTANTLY THE PASSENGER SIDE BLIND SPOT INDICATOR LIGHT CAME ON.  EVEN AFTER I SHUT OFF MY VEHICLE; THE INDICATOR LIGHT STAYED ON.  IT WOULD CHANGE IN BRIGHTNESS OCCASSIONALLY.  I WAS HOPING THAT IT WOULD NOT DRAIN MY BATTERY OVER NIGHT AS I'M NOT A MECHANIC. I CHECKED THE SENSORS ON THE BUMPER FOR CLEANLINESS.",
        "vin": "1G1155SLXFU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193810,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "4-4-2019 DROVE TO WORK. NOTICED AFTER PARKING CAR THAT THE SIDE BLIND SPOT WARNING SYSTEM LIGHT WAS \"ON\": TURNED CAR ON AND THEN OFF, BUT IT STILL STAYS LIT. THIS WILL RESULT IN THE CAR BATTERY BEING DRAINED, ELECTRICAL SYSTEM BEING FRIED, OR THE SENSOR EVENTUALLY BURNING OUT. NOT SURE WHICH",
        "vin": "1G1165S36FU"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT DETECTION HAS FAILED AGAIN. SERVICE SIDE DETECTION ERROR IN DASH DISPLAY THE SYSTEM FAILED UNDER WARRANT IT HAS FAILED AGAIN OUT OF WARRANTY.  THIS IS A SAFETY CONCERN CHEVY NEEDS TO FIX.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187089,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLIND SPOT ALERT QUIT WORKING AT 48000 MILES. DEALER QUOTED $1000 TO REPAIR. MANY IMPALA OWNERS ARE HAVING THIS PROBLEM. APPEARS TO BE A PROBLEM WITH LOCATION AND DESIGN OF THE SENSORS.WATER AND SNOW CAN CONTAMINATE THE SENSORS AND CAUSE THEM TO FAIL. GM NEEDS TO PROVIDE WARRANTY RELIEF BECAUSE OF A POOR DESIGN.",
        "vin": "2G1125S35F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 CHEVROLET IMPALA. CONSUMER WRITES IN REGARDS TO DEFECTIVE BLIND SPOT DETECTION SYSTEM. *LD  *TR  THE CONSUMER STATED HE HAD TO PAY ALMOST HALF THE REPAIRS WHICH IN COST IS OVER $600.  *TR  *JS",
        "vin": "2G1165S38F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186654,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU START TO CAR THE POWER STEERING IS OUT AND IT LOCKS UP THEN YOU DRIVE AND IT'S LIKE DRIVING A MANUAL STEERING CAR",
        "vin": "2G1125S39E9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186094,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THE POWER STEERING WAS FAULTY. WHILE DRIVING OUT OF A PARKING LOT, THE STEERING WHEEL SEIZED AND \"POWER STEERING ASSIST\" WAS DISPLAYED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TOWED TO RICHARD LUCAS CHEVROLET (1077 US-1, AVENEL, NJ 07001, (732) 634-0100) WHERE IT WAS DIAGNOSED THAT A NEW RACK AND STEERING GEAR NEEDED TO BE INSTALLED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 17,052.",
        "vin": "1G1125S30FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIAL WARNING LIGHT WAS \"SERVICE SIDE DETECTION SYSTEM\" BUT THEN RESULTED MASS ELECTRICAL FAILURE.     ALL WARNING LIGHTS ON MY DASHBOARD WERE LIT UP. ALL THE GAUGES ON MY DASHBOARD WERE AT ZERO. THE FOLLOWING VEHICLE MESSAGES WERE TRIGGERED: SERVICE FRONT CAMERA, SERVICE PARK ASSIST, SERVICE SIDE DETECTION SYSTEM, SERVICE AIRBAG, SERVICE TIRE MONITORING SYSTEM.     I SPORADICALLY LOST POWER IN THE INFOTAINMENT SYSTEM AND CLIMATE CONTROL SYSTEMS.     I TOOK THE VEHICLE TO CHEVROLET CERTIFIED SERVICE AND AFTER 3 HOURS THEY INDICATED THEY REPLACED A COUPLE BLOWN FUSES AND THAT ALL SYSTEMS WERE UP AND RUNNING EXCEPT THE \"SIDE DETECTION SYSTEM\". AT THAT POINT, I HAD TO LEAVE AND GO TO WORK. WITHIN THE DAY, I WAS BACK A SQUARE ONE WITH ALL OF THE SAME ISSUES.    AFTER TAKING IT BACK A SECOND TIME, THEY INDICATED THAT THEY NEEDED TO REPLACE THE \"REAR SI MODULE\" IN ORDER TO FIX THE ISSUE. SO, AFTER IT ALL I WAS WITHOUT A CAR FOR 5 TOTAL DAYS AND STUCK WITH A BILL OF $1600.    THIS EXACT ISSUE IS REPORTED SEVERAL TIMES SPECIFICALLY ON THIS SITE. SEEMS TO BE AN ISSUE THAT CHEVROLET NEEDS TO ADDRESS.",
        "vin": "2G1125S39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180422,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT SENSORS CORODE AND FAIL. SAFETY HAZARD AND EXPENSIVE.  AT APPROXSIMATELY 50000 MILES MY BLIND SPOT SENSOR ILLUMINATED AND WOULDNT SHUT OFF.THE DEALER SAID SENSOR CORRODED AND FAILED,THE TECH SAID THIS IS A COMMON PROBLEM.THE PARTS ARE BACK ORDERED DO TO SO MANY FAILURES",
        "vin": "2G1125S36F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE OBJECT DETECTION SYSTEM FAILED 1ST (2/2018). SEE ATTACHMENT FROM ENGINEERING AT MY FORMER EMPLOYER (GMPG). 2ND ISSUE: DASH ILLUMINATION GOES BACK & FORTH FROM NORMAL TO EXTREMELY BRIGHT, DIMMING INOP. 3RD ISSUE SAFETY...WHEN VEHICLE IS STARTED, ERROR MESSAGES FOR AIRBAG, SIDE OBJECT DETECTION, FRONT & REAR CAMERA-HVAC COMPLETELY INOP. RADIO INOP-BEGINS WORKING AFTER  ELECTRIC FACEPLATE LIFTED ON RADIO. HVAC & AIRBAG REMAIN INOP. ASKED DEALERSHIP ABOUT SIDE OBJECT ISSUE- THEY HAVE NO INFO ON THIS. ADDITIONAL PROBLEMS STARTED 2/13/2019. WHEN STARTING WITH RKE, SIDE OBJECT LIGHTS IN MIRROR ILLUMINATED SITTING IN A PARKING LOT. THEY HAVE NOT ILLUMINATED WHILE DRIVING IN OVER A YEAR. NO HEAT OR DEFROST WORKING-BIG SAFETY ISSUE IN WINTER WEATHER.",
        "vin": "2G1125S36F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "02/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY CAR DIAGNOSED AND THE MACHINE SAID MY AIR FLOW SENSOR WAS BAD BUT IN ALL ACTUALITY IT WAS A VACUUM PUMP. MY DAD TOOK THE PUMP OFF AND THERE WAS SO MUCH GRIT IN IT MY MOTOR WASN'T GETTING THE PROPER AIR. THE PROBLEM IS IN ALL MY YEARS OF OWNING VEHICLES I'VE NEVER CHANGED A VACUUM PUMP. THEN THE CYLINDER INSIDE THE PUMP WAS IN ABOUT SIX PIECES AND BROKE.",
        "vin": "2G11X5SL8F9"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR SUDDENLY THE INFORMATION AREA ON THE DASH BOARD SAID \"SERVICE STABIL A TRACK \"  \"SERVICE TRACTION CONTROL\"  AND \"POWER TO ENGINE REDUCED\" THEN THE SERVICE ENGINE LIGHT CAME ON.   WHEN I TOOK IT TO THE DEALERSHIP THE SERVICE REP TOLD ME THAT I WOULD NEED TO REPLACE THE HIGH PRESSURE FUEL PUMP AND THE FUEL FEED PIPE.  HE ASKED IF I WAS USING E85.  I TOLD HIM I WAS AND HE TOLD ME THAT E85 CAUSES THAT DAMAGES IN THE CHEVROLET VEHICLES AND IS WHY HE WON'T USE IT IN HIS OWN VEHICLE.  THE OWNER'S MANUAL ENCOURAGES USEING E85.  GM WILL NOT PAY TO REPAIR THIS EVEN THOUGH I FOLLOWED THEIR OWNER'S MANUAL.",
        "vin": "2G1WB5E34F1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/12/2019",
        "dateOfIncident": "06/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT COMES ON AND GOES OFF?",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "05/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11166037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE THE CONTACT WAS PARALLEL PARKING WITH ONE FOOT ON THE BRAKE PEDAL, HE OPENED THE DRIVER'S DOOR AND PLACED THE OTHER FOOT ON THE OUTSIDE PAVEMENT. THE VEHICLE SUDDENLY SURGED FORWARD AND PULLED THE CONTACT OUT OF THE VEHICLE. THE CONTACT'S FOOT BECAME PINNED BY THE REAR WHEEL OF THE VEHICLE. IT TOOK THE CONTACT HALF AN HOUR TO WIGGLE OUT FROM UNDER THE VEHICLE. THE CONTACT QUICKLY SHUT OFF THE VEHICLE. THE CONTACT WAS BRUISED AND SCRATCHED AND LATER RECEIVED MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE DEALER (NIMNICHT CHEVROLET, 1550 CASSAT AVENUE, JACKSONVILLE, FL 32210, (904) 677-8823) DIAGNOSED THAT THE PURGE SOLENOID WAS STUCK OPEN AND CAUSED THE VEHICLE TO LURCH FORWARD. THE VEHICLE WAS REPAIRED. A WEEK LATER, WHILE DRIVING, THE ENGINE REVVED AND THE CONTACT HAD TO DEPRESS THE BRAKE PEDAL WITH BOTH FEET. THE CONTACT SHIFTED THE VEHICLE INTO NEUTRAL AND THE ENGINE IMMEDIATELY DECREASED FROM 3,000 RPMS. THE CONTACT CALLED THE MANUFACTURER AND WAS PROVIDED A CLAIM NUMBER. THE MANUFACTURER SENT A CLAIMS REPRESENTATIVE TO VISIT THE CONTACT, TAKE PICTURES, AND RECORD THE FAILURE. THE CONTACT WAS WAITING FOR A REPRESENTATIVE FROM THE MANUFACTURER TO CALL HIM BACK. THE FAILURE MILEAGE WAS 29,000. *TT*JB",
        "vin": "2G1165S39F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166048,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS 2015 IMPALA LTZ AND I AM THE FIRST OWNER. ON THE MORNING OF JAN 08,2019, AT 8:00AM, I LEFT MY HOUSE AND DROVE ROUTE 77 NORTH BOUND TO FAIRLAWN. IT IS STILL RUSH HOUR AND MANY CARS WERE ON THE ROAD. AT THE DISTANCE ABOUT 10 MILES AWAY FROM MY HOUSE IN HIGH WAY OF 77, MY STEERING SUDDENLY BECAME VERY STIFF AND IT SEEMS IT WAS LOCKED. I WAS AT THE FAST LANE AT THAT MOMENT AND MY CAR WAS ABOUT 70 MILES/HR. THERE IS A CURVES AHEAD OF ME AND IT IS SO HARD FOR ME TO TURN THE STEERING WHEEL TO FOLLOW THE CURVES. SO I HAVE TO TURN ON THE EMERGENCY LIGHT ON, SLOW DOWN MY CAR AND TRIED TO STEER THE CAR TO THE EMERGENCY SHOULDER. IT WAS SO DANGEROUS BECAUSE I CAN NOT CONTROL THE CAR DIRECTION WELL AND SLOW DOWN THE CAR SPEED VERY FAST WITHOUT BUMPING INTO OTHER CARS.   IT IS IN MOTION CONDITION IN HIGHWAY ROUTE 77 LOSING THE CONTROL FOR STEERING WHEEL.  MY CAR WAS TOWED TO GM DEALER AT APPROX. 10 AM ON JAN 08. TILL NOW IT IS AFTERNOON OF JAN 09, GM DEALER STILL CAN NOT FIND OUT THE PROBLEM AND GET IT FIXED.  THE QUALITY ISSUE MAY CAUSE VERY DANGEROUS SITUATION FOR OTHER DRIVERS AS WELL. I THINK IT IS VERY ESSENTIAL FOR ME TO BRING OUT THIS QUALITY ISSUE FOR 2015 IMPALA LTZ.",
        "vin": "2G1165S36F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165558,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING THE VEHICLE ON THE FREEWAY, THE SIDE DETECTION SYSTEMS (BOTH SIDES) FAILED TO OPERATE AND AN ALERT WAS RAISED ON THE DRIVER INFORMATION CENTER.  UPON INSPECTION BY AN TECHNICIAN, IT WAS DISCOVERED THAT THERE WAS WATER INTRUSION INTO THE SIDE DETECTION SYSTEM AND THE MODULE HARNESS WAS CORRODED.  VEHICLE TECHNICIAN INDICATED THAT A TECHNICAL SERVICE BULLETIN (TSB) WAS ISSUED BY GM BUT NO FORMAL RECALL WAS INITIATED SINCE THE ISSUE DID NOT EFFECT THE OPERATION / SAFETY OF THE VEHICLE.",
        "vin": "1G1165S35FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 CHEVY IMPALA SIDE BLIND ZONE LEFT SIDE ALERT FAILED TO WORK, AND ACCORDING TO MY CHEVROLET SERVICE SHOP IT WAS THE CAUSE OF THE ENGINE NOT STARTING, THE ENGINE KILLING AFTER STARTING REMOTELY, AND THE CAUSE OF MASS COMMUNICATION FAILURE ALERTS WITH AND BETWEEN THE VEHICLE'S OTHER SAFETY AND NON SAFETY ELECTRICAL COMPONENTS. NONE OF THE CARS DASH GAGES WORKED FOR ABOUT 1 MINUTE AFTER THE MASS ALERT HAPPENED.  10 MILES AFTER I HAD THE LEFT SIDE BLIND ZONE ALERT REPLACED, I RECEIVED AN ALERT THAT A BLIND ZONE ALERT NEEDED SERVICE. IT TURNS OUT THE RIGHT SIDE BLIND ZONE ALERT FAILED AFTER HAVING THE LEFT SIDE REPLACED.  MY DAUGHTER HAS THE EXACT SAME VEHICLE AND SHE IS GETTING THE SERVICE BLIND SIDE ALERT ALERT AFTER HAVING BOTH LEFT AND RIGHT SIDE MODULES REPLACES A YEAR AND A HALF AGO.  THE COST TO REPLACE BOTH LEFT AND RIGHT MODULES IS OVER $1400. THE MASS SYSTEM FAILURE ALERTS HAPPENED WHEN THE VEHICLE WAS PARKED AND ENGINE RUNNING.",
        "vin": "2G1165S37F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE DRIVING 55 MPH, THE POWER STEERING INDICATOR ILLUMINATED AND THE STEERING SEIZED. THE VEHICLE WAS TAKEN TO BOYD CHEVROLET CADILLAC BUICK (1875 SPARTANSBURG HWY, HENDERSONVILLE, NC 28792, 828-693-3461), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 82,000. *TT*JB",
        "vin": "2G1165S36F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149898,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKING INTO TRUNK OF VEHICLE FOR QUITE SOME TIME, BUT THOUGHT IT WAS FROM OPENING TRUNK WHEN IT WAS RAINING. RECENTLY HAD TAILIGHT GASKET REPLACED NOT UNDER WARRANTY OR RECALL. WATER STILL LEAKING AND 2IN SPLIT WELD DISCOVERED BEHIND BUMPER WHICH CAUSE TAILLIGHT AND TRUNK TO NOT SIT PROPERLY. VEHICLE BOUGHT NEW AND NO ACCIDENTS. INSTRUCTED TO GO TO A BODY SHOP FOR REPAIR.",
        "vin": "2G11Z5SL8F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP CAUSING WEAK ENGINE AND STABIL TRACK SERVICE LIGHT. DEALER DIAGNOSED.    AS I WAS DRIVING THE VEHICLE SUDDENLY LOST POWER, STABIL TRACK SERVICE AND CHECK ENGINE LIGHTS. MESSAGE WARNING OF DECREASED ENGINE POWER.",
        "vin": "2G1125S33F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/01/2018",
        "dateOfIncident": "08/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144637,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THERE WAS A LEAK IN THE TRUNK WHERE THE SPARE TIRE WAS LOCATED. THE CONTACT CALLED THE WALDORF CHEVROLET CADILLAC DEALER (301-645-7000, 2298 CRAIN HWY, WALDORF, MD 20601) AND WAS TOLD TO SCHEDULE A DIAGNOSTIC TESTING APPOINTMENT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL, AND REFERRED THE CONTACT TO THE NHTSA. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 57,000.",
        "vin": "2G1115SL5F9"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2015 CHEVROLET IMPALA LT, AFTER RETURNING FROM VACATION I DISCOVERED A DAMPNESS IN MY TRUNK. I REMOVED EVERYTHING FROM THE TRUNK AND THE NEXT MORNING I WENT TO THE CAR TO VACUUM IT OUT. I LIFTED THE THE COVER FOR THE SPARE TIRE, AND NOTICE IT WAS SITTING IN AT LEAST 4 TO 6 INCHES IF WATER. I KNEW IT RAINED IN CENTRAL TEXAS FOR 14 CONSECUTIVE DAY AND THAT'S WHERE THE WATER CAME FROM. SO RESEARCHED ONLINE LINE, WENT TO THE DEALERSHIP AND TOLD THEM WHAT HAS HAPPENED, WELL THEY DIDN'T DO ANYTHING. INSTEAD THE WAY ME TO PAY THEM THIS RIDICULOUS AMOUNT OF MONEY TO DIAGNOSE IT. SO I CALL CHEVROLET  TO EXLLAIN WHAT WAS GOINGG ON, THE REPRESENTATIVE WORDS WERE WELL MAAM THERE ISNT A RECALL FOR YOUR YEAR. THIS IS RIDICULOUS AND A HEALTH SAFETY ISSUE AND AS WELL AS AN WIRING ISSUE. PLEASE HELP THE OWNER OF IMPALA'S THAT ARE HAVING THE ISSUES.",
        "vin": "2G1125S37F9"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/28/2018",
        "dateOfIncident": "10/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143483,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DESIGN OF THE HEADLIGHTS IS FAULTY. THE REFLECTORS BEHIND THE BULBS DO NOT PROJECT SUFFICIENT ILLUMINATION OF THE ROAD AHEAD, NOR DOES IT ILLUMINATE THE LEFT AND RIGHT CORNERS.  I ESTIMATE THAT THE VERY DIM LIGHTS ARE GOOD FOR 30-FT AHEAD AT MOST, AND THEY ARE SO DIM THAT THEY ARE ALMOST USELESS WHEN DRIVING IN AM AND PM HOURS.  SWITCHING TO HIGH-BEAMS BARELY MAKES A DIFFERENCE.  IN FACT, I ALWAYS DRIVE WITH THE HIGH BEAMS ON WHEN DRIVING IN THE DARK, AND HAVE NEVER HAD AN ONCOMING VEHICLE FLASH ITS LIGHTS AT ME IN ATTEMPT TO GET ME TO SWIYCH TO THE LOW-BEAMS.  FURTHER, TURNING CORNERS IN THE DARK IS DANGEROUS, AS THERE IS VIRTUALLY NO ILLUMINATION OF THE CORNERS BY THE HEADLIGHTS.  ALL OF THIS IS EXACERBATED SIGNIFICANTLY WHEN THE PAVEMENT IS WET AND WHEN IT'S RAINING.  I SUGGEST THAT YOU TAKE A TEST DRIVE IN ONE OF THESE VEHICLES, IN \" COUNTRY\" ENVIRONMENTS THAT ARE NOT LIT BY STREET LIGHTS.  DO IT AGAIN ON SIMILAR ROADS WHEN IT'S RAINING.  SEARCH GOOGLE \"IMPALA POOR HEADLIGHT DESIGN\" AND YOU WILL FIND THAT THIS HAZARD IS DISCUSSED IN SEVERAL FORUMS AND REVIEWS FOR 2015 THROUGH 2018 IMPALAS.  IT BOGGLES THE MIND TO KNOW THAT GENERAL MOTORS HAS ALLOWED THIS SAFETY ISSUE TO BE PERPETUATED THROUGH 4 IMPALA MODEL YEARS.",
        "vin": "1G1115SL2FU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/20/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UNCOMMANDED ACTIVATION OF PARKING BRAKE.  WHILE PARKED, IGNITION OFF, IGNITION KEY  REMOVED,  VEHICLE UNOCCUPIED, PARKED ON FLAT AND LEVEL SURFACE, PARKING BRAKE  ACTIVATED APPROX TWO MINUTES AFTER ENGINE TURNED OFF.",
        "vin": "2G1115SL8F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133165,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THE POWER STEERING \"DRIVE WITH CARE\" WARNING INDICATOR ILLUMINATED AND THE STEERING WHEEL SEIZED. THERE WERE RECALLS FOR THE 2012 AND 2014 MODEL VEHICLES, BUT NOT FOR THE 2015 IMPALA. THE DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.",
        "vin": "1G1125S34FU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "09/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A COMPLETE LOSS OF POWER STEERING MAKING THE CAR EXTREMELY DIFFICULT / DANGEROUS TO STEER.  THE ENTIRE ELECTRIC POWER STEERING SYSTEM NEEDED TO BE REPLACED ALONG WITH THE SIDE DETECTION MODULES.  A FRIGHTENING EXPERIENCE.",
        "vin": "2G1165S37F9"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN GET MY CAR AND MY PARKING BRAKE IS ENGAGED I HAVE TO RELEASE THE PARKING BRAKE, THE DEALERSHIP REPLACED IT ONCE AND IT STILL HAPPENING (BILL FOX IN ROCHESTER, MI).  THE CAR IS SLOW AT ACCELERATION",
        "vin": "2G1125S31F9"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129666,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING DOWN AN INTERSTATE IN HEAVY TRAFFIC (RUSH HOUR) GETTING READY TO MERGE ONTO ANOTHER INTERSTATE THE VEHICLE LUNGED VIOLENTLY JOLTED AND LOST POWER. AT THAT TIME I WAS DRIVING (CRUISE CONTROL OFF) AT 60MPH, THE DISPLAY LIGHTS ON THE DASHBOARD CAME ON STATED: STABILITY CONTROL, TRACTION CONTROL,CHECK ENGINE CAME LIGHT ON, AND VEHICLE RAPIDLY SLOWING. I WAS ABLE TO MOVE TO THE RIGHT LANE AND ACCESS AND EXIT RAMP. ONCE THAT HAPPENED YOU CAN'T GET VEHICLE TO MOVE WHEN PRESSING ON THE GAS PEDAL. I PUT IT IN PARK, TURNED OFF THE VEHICLE. I WAITED FOR A FEW MINUTES THEN TURNED ON THE CAR. THE CHECK ENGINE LIGHT REMAINED ON. VEHICLE HAS DONE THIS A FEW OTHER TIMES HOWEVER; NO CODES COME BACK WHEN DIAGNOSED AS THE CHECK ENGINE LIGHT TURNS ITSELF OFF.   THIS SEEMS TO BE A MAJOR ISSUE HOWEVER; GM DOESN'T WANT TO ACCEPT RESPONSIBILITY AND FIX THEIR ISSUE TO MAKE THEIR VEHICLES SAFE. I AM TERRIFIED OF DRIVING THE VEHICLE AND CONSIDER MY EXPERIENCE LUCKY IN THE FACT NO ACCIDENT HAPPENED HOWEVER; I AM NOW PAYING TO HAVE MY CAR PARKED IN A LOT WAITING FOR GM.",
        "vin": "2G1WB5E30F1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129670,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVINNHTSA AT WWW.NHTSA.GOV. NHTSA G ISSUES WITH THE ABS AND TRACTION CONTROL LIGHTS KEEP COMING ON AND OFF, AND THE MORE I SURCHARGE ABOUT IT, IT SEENS TO BE THAT A LOT OF OWNERS HAVING THE SAME PROBLEM WITH THEIR CHEVY IMPALAS, WHEN YOU TURN LEFT IS WHEN THE LIGHTS COME  ON THEN SECONDS OR MINUTES AFTER THAT THE GO AWAY AND ITS BEEN DOING FOR A WHILE, SO I CHANGE THE WHEELS HUBS ASSEMBLY, BRAKE PADS AND STILL HAVING THE SAME PROBLEM, SO LM VERY SURPRISED THAT IT HASN'T COUGHED THE ATTENTION SO MANY OWNERS HAVING SAME PROBLEM WITH THEY CHEVY IMPALAS... TANKS",
        "vin": "2G1WC5E37F1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11127951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "GM REIMBURSED ME FOR ONE OF TWO REPAIRS NEEDED TO FIX A PROBLEM THAT CAUSED THE CHECK ENGINE LIGHT TO TURN ON.  THESE TWO REPAIRS WERE PERFORMED THREE MONTHS PRIOR TO GM'S JULY 2018 LETTER ADVISING ME OF ADDITIONAL PROTECTION FOR MY 2015 IMPALA.  I WAS DENIED REIMBURSEMENT FOR THE FIRST FIX IDENTIFIED BY THE CAR'S COMPUTER TO REPLACE THE EVAC CANISTER VENT VALVE SOLENOID COSTING $198.77.  I WAS REIMBURSED FOR THE SECOND FIX TO REPLACE THE PURGE VALVE COSTING $147.55.  IN APRIL 2018, GM HAD NOT IDENTIFIED ANY FIX OTHER THAN THE ONES IDENTIFIED BY MY CAR'S COMPUTER.  THEREFORE, BOTH MY REPAIRS WERE PERFORMED TO FIX THIS PROBLEM AND SHOULD HAVE BEEN REIMBURSED AS FIXES FOR THE INOPERATIVE PURGE SOLENOID ADDITIONAL PROTECTION GM IDENTIFIED IN ITS JULY 2018 LETTER TO ME.",
        "vin": "2G1WB5E36F1"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER GETTING GAS I  SAT IN  THE DRIVER SEAT, I ATTEMPTED TO PUT  THE SEATBELT BUT NOTICED THE LAP BELT  USING MISSING. THE SHOULDER BELT STILL WORKED. I LOOKED AT THE END BRACKET WHICH APPEARS TO BE BROKEN. A JAGGED BOLT APPEARS TO HAVE BROKEN. THE PILLAR RETRACTOR, TONGUE AND BUCKLE APPEAR INTACT. I DO HAVE PICTURES BUT HAVE TO FIGURE OUT HOW TO TRANSFER FROM CELLPHONE TO COMPUTER",
        "vin": "2G11Z5SL7F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123307,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE DRIVING 35 MPH, THE POWER STEERING FAILED AND THE STEERING WHEEL SEIZED. THE CONTACT STATED THAT THE POWER STEERING WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO BOWMAN CHEVROLET (6750 DIXIE HWY, VILLAGE OF CLARKSTON, MI 48346) WHERE THEY STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V450000(STEERING). THE DEALER ALSO STATED THAT THE STEERING GEAR ASSEMBLY NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 73,000.",
        "vin": "2G1125S35F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANT TO SUGGEST WHAT I FEEL IS AN IMPORTANT SAFETY IMPROVEMENT.      I PARK MY CAR EVERY DAY IN A NARROW SPACE IN MY GARAGE AT HOME.  EVERY DAY WHEN I BACK OUT, THE SENSORS BEEP TO WARN ME NOT TO HIT THE GARAGE WALL ON EITHER SIDE.    RECENTLY AS I BACKED OUT OF MY GARAGE, I BACKED INTO A CAR THAT WAS IN AN UNEXPECTED PLACE BEHIND ME.  AS I THOUGHT BACK ON WHY THAT HAPPENED, I COULD NOT REMEMBER THE CAR BEEPING TO WARN ME OF THE OTHER CAR.  I AM SURE THAT IT DID BEEP, BUT BECAUSE I AM SO ACCUSTOMED TO HEARING BEEPS AS I BACK OUT, THE WARNING DIDN'T REGISTER IN MY MIND.    WHAT IF IT HAD BEEN A CHILD INSTEAD OF ANOTHER CAR?    WITH TODAY'S TECHNOLOGY, IT WOULD BE VERY FEASIBLE TO HAVE A CAR LEARN NOT TO BEEP TO WARN A DRIVER OF THE SAME OBSTACLES A THOUSAND TIMES WHEN BACKING OUT OF THE SAME PLACE EVERY DAY, DAY AFTER DAY, BUT TO SAVE THE WARNING BEEPS FOR UNUSUAL OBSTACLES.",
        "vin": ""
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "07/05/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109653,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE DRIVING UNKNOWN SPEEDS, THE BLIND SPOT MONITORING SYSTEM FAILED TO OPERATE AND THE SIDE ACTIVATION SYSTEM WARNING INDICATOR ILLUMINATED. THE CONTACT CALLED SCHONER CHEVROLET (720 W MAPLE ST, HARTVILLE, OH 44632, (330) 267-9263) AND WAS INFORMED THAT THE BLIND SPOT SENSOR NEEDED TO BE REPLACED; HOWEVER, THE PARTS WERE ON BACKORDER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 44,000.",
        "vin": "2G1165S31F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC POWER STEERING FAILED WHIL DRIVING MAKING THIS 21/2 TOM CAR IMPOSSIBLE TO STEER",
        "vin": "2G1165S38F9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "06/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11102747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 CHEVROLET IMPALA. THE CONTACT'S WIFE EXPERIENCED UNINTENDED VEHICLE ACCELERATION WHILE ATTEMPTING TO PARK IN A CHURCH PARKING LOT. AS A RESULT, THE VEHICLE WAS INVOLVED IN A FRONT END COLLISION. THE AIR BAGS DEPLOYED. THE FAILURE OCCURRED WITHOUT WARNING. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A SALVAGE YARD WHERE IT WAS DEEMED A TOTAL LOSS. THE DEALER WAS NOT CONTACTED FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED. THERE WAS ONE INJURY THAT REQUIRED MEDICAL ATTENTION. THE CONTACT'S WIFE EXPERIENCED SEVERE SORENESS AS A RESULT OF THE CRASH. THE FAILURE MILEAGE WAS APPROXIMATELY 45,000. THE VIN WAS NOT AVAILABLE. *TT  VIN NOT VALID UPDATED 9/26/18*JB",
        "vin": "2G1125SLXF9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "04/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE COLLISION DETECTION SENSORS GO OUT AND IT IS A VERY COSTLY REPAIR. ALL MY WARNING SENSORS WENT OUT BEFORE, LUCKILY THIS WAS JUST A FUSE. BUT THE SIDE DETECTION IS STILL. PEOPLE PAY EXTRA MONEY FOR THESE SAFETY FEATURES AND THEY SHOULD WORK! MINE WENT OUT ABOUT 1000 MILES OVER 36000 MILE WARRANTY AND THE EXTENDED WARRANTY I PURCHASED DOESN'T COVER THIS. PASSENGER SIDE DETECTION WENT OUT WHEN DRIVING. ALL OTHER CAR WAS STATIONARY. FROM WHAT I'VE RESEARCHED THESE CAN CAUSE NUMEROUS PROBLEMS IN THE CARS COMPUTER SYSTEM IF NOT FIXED. I CAN FIND THOUSANDS OF COMPLAINTS LABOUR THIS ISSUE ON THE INTERNET. GM SHOULD TAKE RESPONSIBILITY AS THIS IS A SAFETY ISSUE!",
        "vin": "2G1165S38F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/13/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SENSORS FOR THE BLIND SPOT INDICATORS ARE SUSCEPTIBLE TO EROSION AND GUNK-INVASION, CAUSING THE BLIND SPOT INDICATORS TO QUIT WORKING.  PRESENTLY, THE DRIVERS SIDE INDICATOR DOESN'T WORK AT ALL, AND THE PASSENGER SIDE INDICATOR STAYS ON ALL THE TIME, EVEN WHEN THE CAR IS PARKED IN MY GARAGE.  MY CHEVROLET DEALERSHIP TELLS ME TO REPLACE THE BOX CONTAINING THE WIRES FOR THE SENSORS IS $500 PER SIDE, AND BOTH HAVE QUIT WORKING, AND THAT THE REPLACEMENT PART IS THE SAME AS THE ORIGINAL, WHICH MEANS THIS WILL HAPPEN AGAIN.  I AM TOLD THE BOX CONTAINING THE ELECTRONICS FOR THE SENSORS IS NOT SEALED PROPERLY, AND THAT MY DEALERSHIP HAS REPLACED A LARGE NUMBER OF THEM ON THESE VEHICLES.",
        "vin": "2G1125S39F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "02/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088830,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE REVERSING OUT OF A PARKING SPACE, THE REAR CAMERA FAILED TO OPERATE AND THE DRIVER'S SIDE LANE DEPARTURE ALERT FAILED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (DOAN CHEVROLET, 5049 W RIDGE RD, SPENCERPORT, NY 14559) WHERE IT WAS DIAGNOSED THAT THE MODULE HARNESS WAS CORRODED AND THERE WAS WATER INTRUSION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND OFFERED TO ASSIST THE CONTACT WITH HALF OF THE REPAIR COST. THE APPROXIMATE FAILURE MILEAGE WAS 41,990.",
        "vin": "2G1165S30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "01/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084785,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH NO PARTICULAR TRIGGER, MY SENSORS STARTED TO FAIL ONE BY ONE. THEN, MY RADIO TOUCH DISPLAY WENT OUT. NOW, MY CAR WILL RANDOMLY SHUTDOWN WHILE DRIVING, GO INTO THEFT MODE, OR HAVE THE ENTIRE DASH SYSTEM MALFUNCTION, LEAVING ME WITH LITTLE TO NO FUNCTIONALITY OTHER THAN STEERING. A DETAILED THREAD OF THE ISSUE AND OTHERS HAVING THESE ISSUES CAN BE FOUND IN THE FOLLOWING FORUMS.     HTTP://WWW.IMPALAFORUMS.COM/CHEVY-IMPALA-9TH-GEN-DISCUSSION/1585778-BAD-BCM.HTML  HTTP://WWW.IMPALAFORUMS.COM/AUDIO-VIDEO-AND-ELECTRONICS/1798162-MYLINK-TOUCH-DISPLAY-SHUT-OFF-AFTER-HITTING-POT-HOLE.HTML",
        "vin": "2G116S532F9"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073438,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MAKES WINDING NOISE WHEN MAKING RIGHT HAND TURN AND HESITATES TO TAKE OFF WHILE ENTERING TRAFFIC. HAZARD AND CAN CAUSE INJURY OR FATALITY.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072943,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL THE AIR BAG LIGHT IS ON AND THERE IS ALSO A BURNING SMELL COMING FROM THE CAR AND THIS HAPPENS IMMEDIATELY WHEN I START THE CAR UP.",
        "vin": "1G11D5SL0FF"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/10/2017 MY 2015 IMPALA 2LTZ HAD SUDDEN ACCELERATION, FULL THROTTLE. NO BRAKES, NO EMERGENCY BRAKE, THE ONLY WAY I COULD STOP THE CAR WAS TO PUT IT INTO NEUTRAL ( OVER 90 MPH BY THEN). THEN AGAIN ON 1/25/2018 THE SAME THING HAPPENED AGAIN, SUDDEN ACCELERATION, BY THEN I KNEW I HAD TO PUT IT IN NEUTRAL TO STOP. MY WIFE AND I WERE LUCKY I COULD MANEUVER THE CAR AROUND SEVERAL OTHER VEHICLES AND AVOIDED AN ACCIDENT. BOTH TIMES I WAS ON THE FREEWAY AT FREEWAY SPEEDS WITH THE ADAPTIVE CRUISE  CONTROL ENGAGED.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE HIGHWAY (IN MOTION), THERE WAS A VERY LOUD BOOM.  THE SUNROOF EXPLODED! THERE WAS NO KNOWN DEBRIS FROM THE ROADWAY AND THE SHATTERED GLASS WAS NOT IN MY VEHICLE; THE SUNROOF SHATTERED OUTWARD.",
        "vin": "2G1165S3XF9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY 2015 IMPALA AT DEALERSHIP TWICE FOR MY AIRBAG SENSOR  ON PASSENGER SEAT AND HAVE PAID MONEY OUT OF MY POCKET FOR THIS REPAIR.  THIS YEAR AND MODEL CAR HAD A RECALL ON AIRBAGS BUT THE DEALERSHIP SAID EVEN THOUGH IT IS NOT A WEAR AND TEAR ITEM BUT A SAFETY ONE I STILL HAD TO PAY OUT OF MY POCKET.  WITH THIS YEAR HAVING ISSUES WITH AIRBAG AND THIS BEING THE SEAT SENSOR I BELIEVE THIS SAFETY ISSUE SHOULD BE COVERED,  MY TCN NUMBER IS AIN16-53807",
        "vin": "1G1115SL1FU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "12/20/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060920,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FIRE",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052695,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/20/17 MY WIFE WAS DRIVING OUR CAR, TAKING ONE OF OUR DAUGHTERS TO SCHOOL WHEN THE CAR SOUNDED AN ALARM AND MESSAGE OF \"POWER STEERING FAILURE - DRIVE WITH CAUTION\" APPEARED ON THE DASH.  SHE WAS ON A CITY STREET AND MOVING, BUT NEEDED ALL HER STRENGTH AND BODY WEIGHT TO TURN THE WHEEL.  SHE HAD THE CAR TOWED TOT HE DEALER, WHO ADVISED THAT THEIR WAS A TOTAL FAILURE OF THE ELECTRONIC STEERING RACK AND PINION SYSTEM, MAKING THE CAR UNSAFE TO DRIVE.  FURTHER, THE PARTS NEEDED TO REPAIR THE CONDITION ARE APPARENTLY ON NATIONAL BACK ORDER, AND AS OF THIS WRITING GM/CHEVY IS NOT RESPONDING TO MY DEALERSHIP'S REQUEST FOR AN ETA ON THE NEEDED PARTS.  I AM BEING TOLD MY CAR WILL VERY LIKELY BE KEPT THROUGH THE NEW YEAR.  I AM VERY CONCERNED AS THIS IS A MAJOR SAFETY ISSUE FOR MY FAMILY.  FURTHER, IF THESE PARTS ARE ON BACK ORDER, AND GM IS NOT RESPONDING TO THE DEALER WITH AN ETA, THAT TELLS ME THAT THIS IS LIKELY A WIDE SPREAD PROBLEM. I DO NOT WANT MY CAR 'REPAIRED' WITH A FAULTY DESIGN OR PART THAT MAY FAIL AGAIN, CREATING A DANGEROUS SITUATION.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY WITH THE ADAPTIVE CRUISE CONTROL ON AT ABOUT 50 TO 55 MPH WHEN SUDDENLY THE CAR WENT FULL ACCELERATION. I TRIED TO STOP THE CAR BY TURNING OFF THE CRUISE CONTROL, TURN OFF THE IGNITION, USE THE EMERGENCY BRAKE, NONE WORKED. I THEN PUT THE TRANSMISSION AND THEN EVERYTHING WORKED, BY THEN I WAS DOING 90 PLUS MILES PER HOUR PASSING VEHICLES. I CONTACTED GM AND THEY TRIED FIND A PROBLEM BUT DID NOT A PROBLEM.THEY SAID NO CODES APPEARED. THIS SUDDEN ACCELERATION LASTED ONLY A FEW SECONDS BEFORE I PUT THE CAR IN NEUTRAL. WILL A CODE APPEAR IF THE PROBLEM LASTED ONLY A FEW SECONDS. GM CLOSED THE CASE.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIRD ISSUE WITH LOSS OF POWER. THIS TIME, STARTED CAR.  THE CAR WAS FIGHTING FOR AIR FOR A FEW SECONDS, WITH STABILITRAK AND ENGINE LIGHT ON.  I SHUT THE CAR OFF IMMEDIATELY.  RESTARTED AFTER A FEW SECONDS.  THE ENGINE LIGHT REMAINS ON.  SERVICE IS STATING HISTORY SAYS MISFIRE ON 2 CYLINDERS, BUT NO CODE THROWN AND CANNOT DIAGNOSE. WE CAN GUESS AND PAY $350 FOR THE GUESS, OR NOT GUESS AND PAY $125 FOR THE DIAGNOSTICS THAT WERE RAN. (!!!) WHAT IN THE WORLD...",
        "vin": "2G1125S32F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/28/2017",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DAYTIME RUNNING LIGHTS HAVE FAILED SEVERAL TIMES. PASSENGER SIDE WAS REPLACED TWICE UNDER WARRANTY NOW CAR HAS 600 MILES OVER 36K BUMPER TO BUMPER WARRANTY DEALER WILL NOT REPLACE UNDER WARRANTY. LIGHT BROKE FROM BRACKET FROM WATER AT CAR WASH.",
        "vin": "2G1165S39F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013657,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND EXPERIENCE WHERE CAR SHUT OFF COMPLETELY WHILE DRIVING AT A STEADY SPEED. FOOT IS ON GAS, MAINTAINING SPEED, ALL ELECTRONICS SHUT OFF - LIGHTS, GAUGES - EVERYTHING. ALMOST INSTANTLY, CAR RESTARTS ITSELF. CAR HAS REMOTE START, CRUISE CONTROL AND PUSH BUTTON START. DEALERSHIP STATES NO ERROR CODE RECORDED AND CHARGES $125 EACH TIME WE COMPLAIN ABOUT THIS. FIRST TIME WAS AROUND 30K MILES. THIS WAS 59K MILES. ONE OWNER (ME).",
        "vin": "2G1125S32F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013658,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST EXPERIENCE WHERE CAR SHUT OFF COMPLETELY WHILE DRIVING DOWN A HILL DURING A SNOW STORM. FOOT IS ON BRAKE, SLOWING SPEED, ALL ELECTRONICS SHUT OFF - LIGHTS, GAUGES - EVERYTHING. ALMOST INSTANTLY, CAR RESTARTS ITSELF. CAR HAS REMOTE START, CRUISE CONTROL AND PUSH BUTTON START. DEALERSHIP STATES NO ERROR CODE RECORDED AND CHARGES $125 EACH TIME WE COMPLAIN ABOUT THIS. ONE OWNER (ME).",
        "vin": "2G1125S32F9"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/06/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED CA ON CONCRETE DRIVEWAY OF RESIDENTIAL HOME AT APPROX. 9:30PM 8/5/17 LOCKED CAR & WENT TO BED. WAS AWAKENED AT 5:30AM AND TOLD CAR WAS ON FIRE. CAR WAS DESTROYED BEFORE FIRE DEPT. ARRIVED..",
        "vin": "1G11Z5SL7FU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/05/2017",
        "dateOfIncident": "05/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11013039,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I WAS DRIVING DOWN A COUNTY ROAD, I SNEEZED AND HIT MY FACE ON THE STEERING WHEEL AND HIT A TREE AT 40 MPH. MY AIR BAGS DID NOT DEPLOY AT 40MPH IN A FRONTAL CRASH. IT TOTALED THE CAR. BENT THE FRAME AND FRAME AROUND THE MOTOR. MY PASSENGER WAS HURT WORSE THAN ME. WHY DIDN'T MY AIR BAGS DEPLOY?",
        "vin": "1G1115SL2FU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000473,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE THE VEHICLE WAS BEING OPERATED ON THE FREEWAY, THE BRAKES LOST FUNCTIONALITY. AFTER THE FAILURE OCCURRED, THE SERVICE BRAKE ASSIST AND CHECK ENGINE WARNING INDICATORS ILLUMINATED. THE MUNDY CHEVROLET DEALER STATED THAT ALL RECALL REPAIRS HAD ALREADY BEEN PERFORMED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "1G1165S32FU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "05/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990675,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY CAR  BACK AT THE DEALERSHIP WHERE I PURCHASED THIS CAR NEW 21 MONTHS AGO,  3 TIMES NOW, AND THE DEALER CANNOT  FIX THE PROBLEM. THE CAR  ALL OF A SUDDEN WILL NOT START, AND  I AM TOLD THE BATTERY IS FINE AND NO CODES ARE STORED. WHEN TRYING TO START VEHICLE, ELEC. STABILITY CONTROL WARNING BEGANS TO FLASK ON SCREEN, BUT VEHICLE WILL NOT START.",
        "vin": "1G1165S37FU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "04/08/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 CHEVROLET IMPALA. WHILE THE VEHICLE WAS PARKED, FLAMES APPEARED FROM THE HOOD. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE AND STATED THAT IT WAS CAUSED BY AN ELECTRICAL ISSUE. THE VEHICLE WAS DESTROYED AND TOWED TO A TOWING LOT. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 22,000.",
        "vin": "1G1115SL4FU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/11/2017",
        "dateOfIncident": "07/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CONSTANT WATER PUDDLE UNDER THE FLOOR MAT ON THE FRONT PASSENGER SIDE OF THE CAR. IT DRIES AND THEN IT IS THERE AGAIN.IT IS A HUGE PROBLEM TO ME AND I WANT IT FIXED.",
        "vin": "2G1WC5E33F1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "10/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959008,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASED A NEW 2015 IMPALA AT THE END OF MAY 2015. IT IS THE LT2 MODEL. IN OCT. 2015 I WAS TRAVELING ON THE FREEWAY WITH MY CHILDREN. THE CAR HAD A SUDDEN REDUCTION OF POWER, DROPPING FROM 70MPH TO AROUND 30MPH. THE ENGINE LIGHT CAME ON AND I HAD TO MOVE OUT OF TRAFFIC TO AVOID BEING HIT BY OTHER CARS. AT THE DEALERSHIP, I WAS TOLD THE FUEL PUMP WOULD NEED TO BE REPLACED. I FOUND IT ODD IN A BRAND NEW CAR, BUT FIGURED IT WAS A FLUKE. IN OCT. 2016 IT HAPPENED AGAIN! THE VEHICLE QUICKLY DROPPED FROM 60MPH OR SO, DOWN TO 30MPH AND I WAS ALMOST HIT FROM BEHIND BY A SEMI. I PUT ON MY HAZARDS AND EXITED AFTER DRIVING A MILE OR SO IN THE EMERGENCY LANE. THIS TIME, I TOLD THE DEALERSHIP THEY WOULD NEED TO TOW IT BACK. AFTER THEY CHECKED OUT THE CAR, I WAS TOLD THAT IT WAS ONCE AGAIN THE FUEL PUMP. 2 FUEL PUMPS AND TWO NEAR DEATH EXPERIENCES UNDER 20K MILES. I TOLD THE DEALERSHIP THEY NEEDED TO DO SOMETHING.I COULD NOT CONTINUE TO DRIVE THIS CAR IN FEAR. THE REASON WE DECIDED TO LEASE A NEW VEHICLE WAS TO HAVE A SAFE, RELIABLE CAR. WE WERE INFORMED BY THE DEALERSHIP THAT THE SUDDEN REDUCTION OF POWER (RESULTING IN 2 NEAR ACCIDENTS) WAS A \"SAFETY FEATURE\" IN THE PARTICULAR TRIM PKG OF OUR VEHICLE. IT WAS DESIGNED TO PROTECT THE ENGINE IN THE EVENT OF A PROBLEM. IT SEEMS THAT CHEVY IS MORE CONCERNED WITH PROTECTING THEIR VEHICLES THAN THE OCCUPANTS INSIDE. AFTER WRITING A NEGATIVE REVIEW ON THE CHEVY CUSTOMER SURVEY, I WAS CONTACTED BY GM. I EXPLAINED MY COMPLETE DISSATISFACTION WITH THE VEHICLE AND SINCE I NO LONGER FELT SAFE DRIVING MY FAMILY IN THIS UNRELIABLE VEHICLE, I WANTED OUT. THEIR SOLUTION? A FREE YEAR OF XM RADIO. THIS PAST WEEKEND (3/5/17) THE ENGINE LIGHT CAME ON AGAIN. MY HUSBAND USED A DIAGNOSTIC MACHINE TO FIND OUT THAT IT IS THE FUEL PUMP FOR THE 3RD TIME! THE CAR HAS JUST UNDER 29K MILES ON IT & IT WAS BARELY 3K MILES SINCE THE LAST TIME THIS HAPPENED.",
        "vin": "2G1125S36F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "08/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT OUT THE NIGHT OF AUGUST 28TH TO CELEBRATE THE ARRIVAL OF MY FIRST CHILD. AS MY FRIEND AND I WERE RETURNING HOME AROUND 1 AM ON THE 29TH OF AUGUST, I WAS STOPPED FOR DRIVING WITH NO HEADLIGHTS ON. I ASKED THE OFFICER HOW CAN THAT BE CONSIDERING I HAVE AUTOMATIC HEADLIGHTS. HE DIDN'T EVEN UNDERSTAND THERE WERE AUTONOMOUS EQUIPMENT IN VEHICLES TODAY. THE POLICE OFFICER APPLIED FOR A WARRANT FOR MY BLOOD AND DREW IT WITHOUT MY CONSENT. WHEN I GOT TO THE JAIL, I TOLD THEM I DIDN'T WANT TO TALK TO ANYONE OTHER THAN MY ATTORNEY OR JUDGE. THEY TOOK THIS AS SIGN OF HAVING SUICIDAL THOUGHTS. THEY HAD TWO GUARDS ASK ME FOR MY CLOTHES  IN EXCHANGE FOR A BEACH BLANKET WHICH WOULD ONLY COVER THE BOTTOM, UPPER, FRONT, OR BACK SIDE OF MY BODY. ALL THIS BECAUSE I HAD A DEFECTIVE SAFETY DEVICE. THE OFFICER STATED HE NOTICED THE CAR'S HEADLIGHT WERE OFF AFTER I WAS HIT WITH HIGH BEAMS. THE SENSOR TURNS THE LIGHTS OFF WHEN IT'S HIT BY A PHOTON AND SLIPS INTO A DELAY SCENARIO. AND DOESN'T TURN THEM ON UNTIL THE SENSORS BELIEVE IT'S DARK ENOUGH. WHATEVER THAT IS. THE STATE'S (TEXAS) LAW REQUIRED THE LIGHT TO BE ON WHILE DRIVING BETWEEN A CERTAIN TIME FRAME. I'VE REPORTED THIS ISSUE TO THE MANUFACTURER ON TWO OCCASIONS. I'M ASKING THAT YOU INCLUDE STATE REGULATIONS SO THAT THIS KIND OF THING DOESN'T HAPPEN TO ANYONE ELSE. THIS EXPERIENCE HAS REALLY SHAKING MY TRUST WITH FEDERAL GOVERNMENT AGENCIES. IN FOLLOWING THE FEDERAL REGULATIONS TRYING TO ADDRESS SAFETY, IT SEEMS A LAW WAS BROKEN. AM I PROTECTED BY ANY FEDERAL PREEMPTION PROVISIONS? I HAVE A HARD TIME UNDERSTANDING WHY MY BLOOD HAD TO BE TAKEN WHEN IT WAS THE SOFTWARE MAKING THE DECISIONS. ARE THERE ANY SAFEGUARDS? I AM CONCERNED WITH WHO ELSE THIS WILL EFFECT.",
        "vin": "2G1115SL4F9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "10/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK AUTOMATICALLY POPS OPEN WHILE DRIVING DOWN THE HIGHWAY/ROAD, WHILE PARKED, AND WHEN INITIALLY STARTING AND WON'T PROPERLY CLOSE DUE TO THE LATCH RECYCLING CONSTANTLY WHEN IT POPS OPEN.  PURCHASED VEHICLE IN OCT 2015 AND REPORTED TO THE DEALERSHIP WITHING THE FIRST COUPLE DAYS.  IT HAS BEEN IN TO HAVE REPAIRED ON 3 SEPARATE OCCASIONS WITH THE SAME ISSUE REOCCURRING.  EXTREMELY UNSAFE!",
        "vin": "2G1165S30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925380,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 CHEV. IMPALA-SHORTLEY AFTER I PUT THE KEY IN THE IGNITION TO START IT. I PUT IT IN REVERSE OR DRIVE THE CAR HESITATE THEN GERKS IN THE DIRECTION IM GOING. THEREVVVVBBVCDEEB   BFVB B   FV    BB    IS A DELAY IN EVERTHING ON THE DASHBOARD. EX. IF I TRY TO TURN THE RADIO UP RIGHT AFTER STARTING MY CAR THE VOLUME WILL NO TURN UP.",
        "vin": "2G1115SL7F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2016",
        "dateOfIncident": "10/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923817,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POSTS IMPLEMENTED TO KEEP THE FLOOR MATS FROM SLIDING UNDER THE PEDALS ON THE DRIVER SIDE ARE LOOSELY ATTACHED TO THE CARPET ONLY AND EASILY RIP OUT CAUSING THE MATS TO SLIDE BACK UNDER THE PEDALS.    THESE POSTS ARE NOT ATTACHED TO THE FLOOR BOARDS OR FRAME, THEY ARE ONLY ATTACHED TO A 1/4\" PIECE OF FABRIC THAT IS THE FLOOR CARPET. THESE POSTS SHOULD BE ATTACHED TO THE FLOOR BOARD OR FRAME AS THEY ARE A SAFETY FEATURE.",
        "vin": "2G1125S30F9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/27/2016",
        "dateOfIncident": "10/26/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919716,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SEVICE STABILITRAK\" LIGHT CAME ON, THEN 2 HOURS LATER ABS LIGHT CAME ON AND ON EVERY LEFT TURN THERE IS A CRUNCHING SOUND IN THE FRONT TIRE AND ALARMS SOUND, AND MY ENGINE STARTED STALLING AS I WAS TURNING ONTO A BUSY STREET, ALMOST WAS IN A CRASH. WHEN I MADE IT HOME I RESEARCHED IT AND FOUND MANY OTHER IMPALA OWNERS HAVE THE SAME PROBLEM, SAME SCENARIO. THIS CANNOT BE A COINCIDENCE THAT EVERY CHEVY CUSTOMER IS DESCRIBING THIS SAME SITUATION. CHEVROLET NEEDS TO HAVE A RECALL ON THESE IMPALA'S. WE ALL LOVE OUR IMPALA'S BUT YOU CANNOT ALLOW US TO BE OUT THERE ON THE ROAD IN DANGER. WE WANT TO SUPPORT AMERICAN MADE!! PLEASE DO THE RIGHT THING AND FIX THIS PROBLEM.",
        "vin": "2G1WC5E39F1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918842,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THE HORN SYSTEM FAILED. THE CONTACT HAD TO PRESS THE HORN WITH FORCE TO BE ABLE TO SOUND A WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE HORN SYSTEM WAS OPERATING NORMALLY. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 4,000.",
        "vin": "2G1165S38F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "12/31/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BODY RECALL. THE PAINT ON MY 2015 CHEVY IMPALA SEEMS TO BE DEFECTIVE. IT HOLDS AN IMPRINT OF EVERYTHING THAT TOUCHES THE VEHICLE. OR IT MAY BE A FAULTY CLEAR COAT. BUT THE PAINT JOB IS DEFECTIVE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "11/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE VIBRATION WITH FOOT ON BRAKE PEDAL TRANSMISSION IN DRIVE, THE COLDER THE OUTSIDE TEMP. THE WORSE THE VIBRATION GETS. BEEN TO DEALERSHIP 6 TIMES DIFFERENT REPAIRS MADE NOTHING WORKED. I HAVE ALL REPAIR DOCUMENTS. CHEVROLET ACKNOWLEGED THE PROBLEM HOWEVER HAS NO SOLUTION.",
        "vin": "2G1165S36F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "11/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HID HEADLIGHT BEAM OF THE 2015 CHEVROLET IMPALA LT IS VERY POOR. THE BEAM OF LIGHT IN THE LOW SETTING PROVIDES NO ILLUMINATION TO THE SIDES OF THE ROAD, FORWARD ILLUMINATION IS MARGINAL. I CONTEND THAT WHEN THE 2015 IMPALA LIGHTS ARE ON THE HIGH OR \"BRIGHT\" SETTING IT IS COMPRABALE TO THE LOW BEAM SETTING IN MY 2012 IMPALA.   IN MODERATE TO HEAVY WEATHER, RAIN, SLEET, SNOW THE HEADLIGHTS OFFER NO ASSISTANCE, DRIVER IS NAVIGATING BLIND, CAN NOT EVEN SEE THE LINES ON THE ROAD. I LIVE AND DRIVE PRIMARILY IN A RURAL AREA, ALONG WITH THE WEATHER CONDITIONS THERE ARE MANY WILDLIFE HAZARDS. I HAVE EXPERIENCED SEVERAL CLOSE ENCOUNTERS WITH WILDLIFE AND TWO IMPACTS, ONE WITH A DEER CAUSING SUBSTANTIAL DAMAGE TO MY CAR. I SIMPLY CAN NOT SEE ANYTHING UNTIL IT IS DIRECTLY IN FRONT OF THE CAR. IT IS IN MY JUDGEMENT THESE HEADLIGHTS ARE UNSAFE NOT ONLY FOR THE OCCUPANTS OF THE VEHICLE, BUT OTHERS SHARING THE ROADS WITH THE VEHICLE.",
        "vin": "2G1125S37F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/02/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS EMAIL IN REGARDS T MY 2015 CHEVROLET IMPALA. ON MARCH 14TH 2016 I PURCHASED A USED 2015 CHEVROLET IMPALA. WHEN I PURCHASED THE IMPALA IT HAD 12,050 MILES. MARCH 17TH 2016 ONLY THREE DAYS AFTER I PURCHASED THE CAR, I GOT IN THE CAR TO HEAD TO WORK, WHEN I TURNED THE CAR ON THERE WAS AN ERROR STATING POWER STEERING NEEDS SERVICE. THE STEERING WHEEL WOULD NOT TURN AND WAS IN A LOCKED POSITION. I CALLED THE DEALERSHIP AND AT THAT POINT THEY SAID THEY HAD TO SEND A TOW TRUCK TO PICK UP THE VEHICLE. AROUND 11:00AM THAT DAY A TOW TRUCK CAME TO PICK UP THE CAR AND I WENT WITH THE TOW TRUCK TO THE DEALERSHIP TO PICK UP A LOANER VEHICLE.  A FEW HOURS LATER I RECEIVED A CALL FROM THE SERVICE DEPARTMENT STATING MY CAR WAS REPAIRED AND I COULD PICK IT UP. WHEN I PICKED UP THE CAR I WAS TOLD THERE WAS A COMMUNICATION ERROR WITH THE POWER STEERING PROBLEM  THE SYSTEM WAS RESET AND I SHOULD HAVE NO PROBLEMS MOVING FORWARD . PLEASE SEE ATTACHED DOCUMENT DATED MARCH 17TH 2016.  ON MAY 6TH 2016, I WAS BACKING OUT OF GARAGE/ DRIVEWAY AND AS I WENT TO TURN (STILL IN REVERSE POSITION) I SUDDENLY WAS UNABLE TO STEER THE CAR. I IMMEDIATELY CALLED THE DEALERSHIP AND WAS SENT TO A VOICEMAIL DUE TO THE TIME BEING AFTER HOURS.  I THEN PROCEED TO TURN THE CAR ON AND OFF   SEVERAL TIMES AND THE WARNING WENT OFF AND I WAS ABLE TO MOVE THE CAR INTO A SAFE POSITION ON THE ROAD.  PLEASE SEE ATTACHED DOCUMENT DATED MAY 11 2016. ON JUNE 25TH 2016 IT HAPPENED AGAIN AND THIS TIME I WAS DRIVING. I THANK GOD THAT MY BOYFRIEND AND I WERE ON A SIDE STREET AND WE WERE GOING AT A VERY SLOW SPEED. I CALLED THE DEALERSHIP IMMEDIATELY AND WAS TOLD TO BRING THE CAR IN FOR SERVICE.",
        "vin": "2G1125S33F9"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/18/2016",
        "dateOfIncident": "05/10/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED HAVING ISSUES WITH THE CV AXLES POPPING WHEN STARTING AND STOPPING AT 18000 MILES. MOTOR MOUNT WENT BAD SHORTLY AFTER AND STEERING STARTED ACTING REALLY SLUGGISH WHEN TRYING TO TURN. AROUND 25K MILES IT STARTED GETTING WORSE ABOUT TURNING AND THE GAUGES WOULD START RESETTING ON THERE OWN. AFTER A DAY OF THAT HAPPENING THE PASSENGER SIDE DASH CAUGHT ON FIRE.",
        "vin": "2G1WB5E36F1"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "05/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10863295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MOTION ON CITY STREET GOING ABOUT 45 WHEN VEHICLE IN FRONT OF ME WAS IN MOTION TO MAKE A RIGHT TURN AND CAME TO AN ABRUT STOP. I HIT MY BRAKES AND MY CAR DID NOT STOP AND I HAD MY FOOT ON BRAKE PUSHED ALL THE WAY TO FLOOR AND CAR CONTINUED ALMOST LIKE IT SLID INTO THE IMPACT/COLLISION. HIS CAR WAS NOT DAMAGED BUT ATTACHED IS THE DAMAGE TO MY CAR.",
        "vin": "1G1165S35FU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "03/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS EQUIPPED WITH AN AUTO STOP/START THAT SHUTS DOWN THE ENGINE TO REDUCE FUEL CONSUMPTION. AND WHEN YOU PUT YOUR FOOT BACK ON THE GAS PEDAL THE ENGINE IS SUPPOSE TO ENGAGE ITSELF AGAIN SO THAT YOU CAN TAKE OFF. ONCE MY VEHICLES AUTO STOP HAS ENGAGED THE ENGINE IS STAYING OFF FOR SOMETIMES UP TO 2 MINUTES CAUSING THE VEHICLE TO NOT MOVE AND CAUSING A SUDDEN JERKING MOTION.",
        "vin": "1G11X5SFU11"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LT MODEL.  HEADLIGHTS ARE EXTREMELY INADEQUATE SUCH THAT THEY REPRESENT A HAZARD WHEN DRIVING ON UNLIT ROADS.  THEY SEND FORWARD A FOCUSED BEAM WITH NO LIGHT COVERING THE SIDES OR OVERHEAD.  THIS MAKES IT VERY DIFFICULT TO TURN ON TO A SIDE ROAD BECAUSE THERE IS NO ILLUMINATION OF THE ROAD YOU ARE TURNING ONTO UNTIL YOU HAVE ACTUALLY MADE THE TURN.  IT IS ALSO EASY TO MISS EXIT RAMPS.  OVERHEAD SIGNS AND SIGNS AT THE SIDES OF EXITS ARE USUALLY UNREADABLE.    THE LOW BEAMS ACTUALLY HAVE A SHUTTER COVERING THE TOP OF THE BULB (I GUESS THAT'S WHAT MAKES THEM LOW BEAMS) SO OBJECTS MUCH ABOVE THE LEVEL OF THE TOP OF THE CAR ARE NOT ILLUMINATED.  WHEN DRIVING ON HILLY COUNTRY ROADS, THE CUTOFF ON TOP MAKES THE APPROACHING HILL JUST ABOUT INVISIBLE.   WHEN DRIVING IN THE RAIN, IT IS NEARLY IMPOSSIBLE TO SEE LANE MARKINGS, ETC.  THE CAR ALSO DOES NOT OFFER FOG LIGHTS AS AN OPTION SO THERE IS NO SUPPLEMENTAL LIGHTING TO ALLEVIATE THE PROBLEM.  I STRONGLY URGE A RECALL TO EITHER CHANGE THE HEADLIGHT DESIGN OR TO INSTALL SUPPLEMENTARY LIGHTING SUCH AS FOG LIGHTS TO BETTER ILLUMINATE THE PAVEMENT AND THE AREAS TO THE SIDES OF THE ROADWAY.",
        "vin": "1G1125S31FU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "04/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A PRE-CERTIFIED IMPALA, WE WERE TOLD THAT THEY HAD CHANGED THE POWER STEERING PUMP FROM THE PREVIOUS OWNER AND EVERYTHING WAS GOOD. I JUST MADE MY FIRST PAYMENT ON MARCH 26, 2016 AND THAT SAME DAY I WENT OUT AND GOT IN MY CAR TO LEAVE FROM MY DAUGHTERS HOUSE AND I PULLED OUT ABOUT 100 FT AND THE STEERING WHEEL LOCKED UP ON ME, I COULD NOT TURN THE WHEEL AT ALL. I TURNED MY CAR OFF AND CALLED MY HUSBAND, HE CAME OUT AND IT DONE THE SAME THING TO HIM AND THEN IT FINALLY STARTED MOVING AGAIN SO HE TOOK IT TO THE DEALERSHIP. THEY STATED THAT IT WAS GROUND WIRE TO THE POWER STEERING, SO WE SAID OK IT SHOULD BE FINE. TODAY I WENT TO STOP AT A STOP LIGHT ON A CITY STREET AND THE WHEEL PULLED TO THE RIGHT AND I TURNED IT BACK TO THE LEFT AND THE STEERING WHEEL WOULD TURN BUT IT KEPT GOING TO THE RIGHT. THANK GOD I GOT STOPPED, IT FINALLY DECIDED TO STRAIGHTEN OUT AND IT WAS PULLING TO THE RIGHT SO NOW IT IS BACK IN THE SHOP AND I AM AFRAID TO DRIVE THE CAR AGAIN. THIS HAS BEEN A VERY STRESSFUL EXPERIENCE.",
        "vin": "2G1125S31F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853204,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE SUN ENTERS THE INTERIOR, WHILE DRIVING, THE CHROME TRIM , ESPECIALLY THE STEERING WHEEL BOWTIE REFLECTS INTO THE EYES. CAUSING A DANGEROUS SITUATION.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "11/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853233,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT THE EXTERIOR LIGHTS OFFERED NO SIDE VISIBILITY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE HEADLAMPS COMPLIED WITH FEDERAL STANDARDS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.  UPDATED 05/11/16*LJ",
        "vin": "2G11Z5SL4F9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE 2ND COMPLIANT I AM FILING AND IT IS THE 3RD TIME THIS HAS HAPPENED. ON MARCH 12, 2016 I WAS LEAVING MY FRIENDS HOUSE AND GOT ABOUT 2 BLOCKS FROM THEIR HOUSE WHEN MY STEERING WHEEL LOCKED AND A MESSAGE ON THE DASH BOARD READ POWER STEERING SERVICE CAUTION! AND AT THE BOTTOM DISMISS, I ALMOST HIT A PARKED CAR THAT WAS PARKED ON THE STREET. I CALLED GM ROADSIDE ASSISTANCE AND AFTER WAITING ABOUT 15 MINUTES I STARTED THE CAR BACK UP AND THE WHEEL WAS TURNING SO I TOOK IT BACK AND PARKED IT HAD MY FRIENDS HOUSE INSTEAD OF ON THE STREET AND HAD GM SEND A TOW TRUCK THE NEXT MORNING TO HAVE IT TAKEN TO THE LOCAL DEALER FOR SERVICE. THE PAST 2 TIMES THIS HAS HAPPENED THEY COULD NOT OR WOULD NOT GUARANTEE ME THAT IT WOULDN'T HAPPEN WHILE I WAS DRIVING IT AND NOW IT HAS.  SOMETHING NEEDS TO BE DONE WITH THIS ISSUE BEFORE SOMEONE GETS KILLED.",
        "vin": "2G1125S38F9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2016",
        "dateOfIncident": "02/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10826043,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIALLY IT STARTED OUT WITH LOSING ALL LIGHTING CONTROL DURING DRIVING FOR ABOUT 10SEC AFTER WHICH IT COMES BACK ON. THIS WHEN ON ARE ABOUT TWO MONTHS AND ABOUT A WEEK AGO, I STARTED GETTING THE ERROR MESSAGE 'POWER STEERING DRIVE WITH CARE' WHICH ALTERNATES WITH ANOTHER ERROR MESSAGE 'STABILITRAK'. EACH TIME THIS COMES ON DURING DRIVING, THE CAR JERKS A LITTLE WITH THE EMERGENCY PARK LIGHT FOR ABOUT 2SEC AND IF I WERE DRIVING WITH THE CRUISE CONTROL ON, IT AUTOMATICALLY DISABLES IT. THIS IS REGARDLESS OF HOW FAST AM DRIVING.",
        "vin": "1G1115SL8FU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "01/29/2016",
        "dateOfIncident": "01/13/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10823066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A COLLISION WHILE DRIVING MY 2015 CHEVROLET IMPALA POLICE VEHICLE. THE FRONT OF THE VEHICLE STRUCK THE RIGHT SIDE OF A VEHICLE THAT TURNED LEFT IN FRONT OF ME. THE PATROL CAR CAUGHT FIRE DURING THE COLLISION AND WAS ONLY PUT OUT WHEN THE FIRE DEPARTMENT CUT THE BATTERY CABLES. THE APPARENT ISSUE IS THAT AFTER A MAJOR COLLISION THE FUEL PUMP DID NOT TURN OFF WHICH CAUSED FUEL TO BE ADDED TO THE FIRE......UPDATED 02/10/16 *BF  *JS",
        "vin": "2G1WD5E35F1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/18/2016",
        "dateOfIncident": "01/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR WITH 11K ON IT. IT WAS A DEALER USED CAR THAT HAD NEVER BEEN REGISTERED FOR THE ROAD. I HAD A 2009 CADILLAC, SO THIS IS WHAT I COMPARED THIS CAR TOO THEN. THE PASSENGER WIPER BLADE HAS \"SCRATCHED\" THE WINDSHIELD WHERE IT STOPS TO RETURN BACK DOWN. THIS HAS CAUSED A PERMANENT MARK IN THE WINDSHIELD, THE LENGTH OF THE BLADE. THIS BLOCKS YOUR VISION AT THE WORST TIME; WHEN IT IS RAINING OR SNOWING.     NEXT UP ARE THE SAFETY FEATURE CONTROL LOCATIONS WHICH WERE VERY POORLY DESIGNED. THERE ARE 5? DIFFERENT ONES. TWO ARE ON THE LEFT DASH AREA, BUT OBSTRUCTED BY THE STEERING WHEEL. ANOTHER ONE IS ON THE STEERING WHEEL, NEXT TO OTHER CONTROLS AND I'VE TURNED IT OFF BY ACCIDENT. THERE ARE OTHERS, NOT EASILY ACCESSIBLE, BUT YOU HAVE TO OPERATE THE DRIVER INFO CENTER BY SEVERAL CLICKS TO ACCESS THEM. NOT VERY CONSISTENT.     THE HORN IS MORE DIFFICULT TO OPERATE THAN ANY OTHER CAR IN MY LIFE! IN THE PAST, IF YOU PUSH THE LITTLE HORN ICON, IT BLOWS. WITH THIS CAR, YOU MUST PUSH AT THE BOTTOM OF THE WHEEL; I FOUND THIS OUT BY TESTING IT OVER AND OVER. THE HORN WILL NOT WORK IN AN EMERGENCY SITUATION BY MOST PEOPLE.     SPEAKING OF COVERED CONTROLS BY THE STEERING WHEEL, THE START/STOP BUTTON IS OBSCURED UNLESS YOU TURN THE WHEEL OR LEAN SIDEWAYS. IF YOU JUST PULL INTO YOUR DRIVEWAY NORMAL, YOU CAN'T SEE IT. THE EMERGENCY 4-WAY FLASHER BUTTON IS NEXT TO THE START BUTTON, AND IS ALSO OBSCURED BY THE STEERING WHEEL.     ELECTRICAL, MINOR BUT ANNOYING ISSUES INCLUDE THE HVAC SYSTEM AND MUSIC STORAGE. THIS THE THE WORST SYSTEM I HAVE EVER SEEN. IN ALMOST ANY CLIMATE (40'S DOWN TO BELOW ZERO), I HAVE TO TURN THE TEMP FROM 90, DOWN TO 66 TO STAY COMFORTABLE. TO USE AUTO-START, I HAVE TO REMEMBER TO PRESET ALL THE CONTROLS HOW I WANT THEM SET FOR THE NEXT MORNING!   THE AUDIO MAKES UP ITS OWN SONG LISTS. THESE THINGS SHOULD NOT BE ON A 2015 CAR! I COULD GO ON EVEN MORE!",
        "vin": "2G1165S36F9"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/13/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819899,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 70 MPH, THE SUNROOF SUDDENLY EXPLODED. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE FAILURE WAS UNABLE TO BE DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 12,469.",
        "vin": "2G1WB5E39F1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/27/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST 19, 2015 I STARTED MY CAR PUT IT INTO REVERSE AND THE STEERING WHEEL WOULD NOT TURN AND IT DISPLAYED SERVICE POWER STEERING I TURNED OFF THE IGNITION WAITED A FEW MINUTES AND TRIED AGAIN BUT IT STILL WOULD NOT TURN,I CALLED GM ROADSIDE ASSISTANCE AND THEY SENT OUT A TOW TRUCK TO HAVE THEM TAKE IT TO THE LOCAL CHEVY DEALER FOR SERVICE WHEN THE DRIVER GOT HERE HE STARTED THE CAR AND THE WHEEL TURNED BUT HE PUT IT ON A FLAT BED AND TOOK IT TO THE DEALER THEY SAID THE CAUSE WAS A DEFECTIVE B.P.M.V. THEY REPLACED PART # 2410350 ELECTRONIC BRAKE AND TRACTION CONTROL MODULE WITH BRAKE PRESSURE MODULATOR VALVE AND PART # 23208065 F (S) MODULE REPROGRAM ED AND BLEED THE SYSTEM SAID THEY ROAD TESTED IT FOR 40 MILES WITH 6 IGNITION CYCLES BUT THE MILEAGE WHEN IT WENT IN WAS AT 16036 AND WHEN IT CAME OUT WAS AT 16055 AS YOU CAN SEE ON THE DOCUMENT I AM ATTACHING. THEY RETURNED MY CAR TO ME ON AUGUST 28, 2015.  BUT THEY COULD NOT TELL ME IF THIS COULD HAPPEN WHILE I AM DRIVING THE CAR.  ON DECEMBER 19, 2015 I WENT TO START MY CAR AND IT WOULD NOT START SO AGAIN I CALLED GM ROADSIDE ASSISTANCE THEY SENT A TOW TRUCK AND HE TOOK THE CAR TO THE LOCAL DEALER FOR SERVICE THEY THE CAUSE WAS A DEFECTIVE BATTERY 4041510 BATTERY REPLACEMENT 247 W AND REPLACED IT WITH PART# 88865245.  ON DECEMBER 26, 2015 I WAS LEAVING A FRIENDS HOUSE WHEN I STARTED THE CAR PUT IT IN REVERSE AND THE STEERING WHEEL WOULD NOT TURN AND THE DISPLAY READ SERVICE POWER STEERING.  SINCE IT WAS LATE ON SATURDAY NIGHT OUR FRIEND DROVE USE HOME I WENT BACK TODAY STARTED THE CAR AND THE STEERING WHEEL WAS TURNING SO I DROVE IT HOME BUT SINCE THE DEALER IS CLOSED AT THIS TIME I WILL CALL ON MONDAY MORNING TO HAVE IT TAKEN BACK TO BE SERVICED AGAIN THE MILEAGE AT THIS TIME IS 19691.",
        "vin": "2G1125S38F9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "12/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS TRAVELING AT 79 MPH ON HIGHWAY IN CRUISE CONTROL WHEN CAR LOST ALL POWER  (ENGINE, EXTERIOR/INTERIOR LIGHTS, BRAKES, ETC.)   WAS ABLE TO GET CAR TO THE SHOULDER, AND RESTART THE VEHICLE.   LATER DETERMINED THE ISSUE TO BE WITH THE KEY.  A SLIGHT BUMP OF THE KEY, E.G. TAPPING THE ATTACHED KEYRING OR HITTING A BUMP WHILE DRIVING,  CAUSES THE CAR TO TURN OFF .  THIS WAS A RENTAL CAR RENTED FROM BUDGET.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/08/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789094,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE DASH BOARD CLUSTER LIGHTS UP, AND EVERY COMPONENT  ON THE DASHBOARD IS VISIBLE AND A RED BAR IS DISPLAYED ACROSS THE DISPLAY AREA. THIS HAS  HAVE HAPPEN MORE THAN TEN TIMES .I HAVE TAKEN THE CAR IN TO REPAIR AT THE DEALERSHIP , BUT THEY ARE  NOT ABLE TO FIND WHAT IS CAUSING THE PROBLEM. ON TWO DIFFERENT OCCASION  I PICKED UP MY CAR FORM THE DEALER  AND IN LESS THAN 5 MINUTES AND ABOUT 5 MILES THE SAME THING REPEATED ITSELF. ON NOV 9 I WILL BRING IT IN AGAIN FOR THE DEALER TO TRY AND FIX THE PROBLEM. THIS HAVE OCCUR ON CITY STREET, HIGHWAY, AND TURNING ALWAYS IN MOTION. NEVER STATIONARY THIS OCCUR IN SECONDS THAT PREVENT  ME FORM GETTING A PICTURE OF THE OCCURRENCES. I WAS TOLD BY ANOTHER TECH AT THE SAME DEALERSHIP THAT THIS IS HAPPENING TO ANOTHER CUSTOMER ALSO. I HAVE TAKEN MY VEHICLE  INTO THE DEALERSHIP ON OCT 1, 13, 27, AND NOV. 3 THIS NOV 9 WILL BE THE 5TH TIMES I WOULD HAVE TAKEN THE VEHICLE IN TO REPAIR. THE IS ALSO MORE INFORMATION ON THE THEY WANT ME TO BUT ANOTHER CAR FORM THE AND PAID WHAT THEY DEPRECIATION VALUE. MEANING THAT WHAT THE CAR IS WORTH LEST DEPRECIATION WILL BE CARRIED OVER TO THE NEW CAR FOR ME IF GM OKAY THE DEAL. I WILL KNOW BY NOV.10, BUT WILL NOT TAKE THE DEALER .ALSO  IF I TAKE THE DEAL THE DEALER WANT TO PLACE THAT DEFECTED CAR ON THE LOT FOR SALE TO CUSTOMER WHO WOULD NOT KNOW ABOUT THE DEFECT. THE CAR WAS BROUGHT AT MUNDAY CHEVROLET HERE IN HOUSTON TX.",
        "vin": "1G1165S39FU"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "11/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788545,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 CHEVROLET IMPALA. WHILE DRIVING 10 MPH, THE BRAKE PEDAL WAS DEPRESSED, BUT FAILED TO STOP THE VEHICLE. AS A RESULT, THE CONTACT'S VEHICLE CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. NO INJURIES WERE SUSTAINED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE BRAKES FAILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 7,027.   UPDATED 01/12/16*LJ  *TR",
        "vin": "2G1125S37F9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "10/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK LID UNLOCKED AND RAISED WHILE IT WAS PARKED AND I WAS SITTING INSIDE A HOUSE, WITH THE FOB IN THE FRONT POCKET OF MY TROUSERS, WITHOUT ANY INTENTIONAL APPPLICATION OF FORCE ON THE FOB BUTTON.  THIS UNINTENTIONAL ACTION EXPOSED THE CONTENTS OF THE TRUNK TO POSSIBLE THEFT.",
        "vin": "2G1165S35F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/19/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806824,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM CONGRESSMAN PERRY ON BEHALF OF CONSTITUENT RE 2015 CHEVY IMPALA AIRBAG DEFECT.  *SMD  THE CONSUMER STATED THE FRONT PASSENGER SEAT AIR BAG SENSOR WOULD NOT TURN ON UNLESS  A PERSON OF ADEQUATE WEIGHT WAS SITTING IN THE SEAT WITHOUT ANY CUSHION.  THE CONSUMER'S WIFE HAD TO SIT ON A CUSHION, IN ORDER TO SEE OUT OF THE VEHICLE AND TO PROPERLY POSITION HER BODY IN THE FRONT PASSENGER SEAT. THE CONSUMER WOULD LIKE TO HAVE THE PASSENGER SEAT SENSOR DEACTIVATED. *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/18/2015",
        "dateOfIncident": "10/16/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783134,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 1884K MI LEAVING HOME DEPOT PARKING LOT PWR STEERING WENT OUT WITH WARNING ON DASH (POWER STEERING FAILURE DRIVE WITH CAUTION). TOWED TO PORTER CHEVROLET IN NEWARK DE. WHERE THEY REPLACED THE ELECTRIC PWR STEERING RACK. THE CAR WAS IN THE SHOP FOR A WEEK. NOW, AT 3838K MI THE SAME SITUATION HAS OCCURRED AFTER PULLING OUT OF MY DRIVEWAY AND STARTING DOWN THE STREET. THIS 4908 LB. CAR IS ALMOST IMPOSSIBLE TO STEER WHEN THIS HAPPENS.",
        "vin": "1G1165S3XFU"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/15/2015",
        "dateOfIncident": "10/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10782425,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 CHEVROLET IMPALA. THE CONTACT STATED THAT WHILE DRIVING AT UNKNOWN SPEEDS AND ATTEMPTING TO MAKE A COMPLETE STOP, THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE WOULD NOT STOP. THE CONTACT ALSO STATED THAT THE STEERING WHEEL FAILED TO RESPOND CAUSING THE CONTACT TO CRASH INTO A DITCH AND IMPACTED THE DRIVER SIDE OF THE VEHICLE. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT STATED THAT INJURIES WERE SUSTAINED THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DEEMED DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 8,000.",
        "vin": "2G1125S30F9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760803,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LATENT DEFECT IN CHEVROLET 2015 IMPALA IGNITION SYSTEMS THAT GM (GENERAL MOTORS) WILL NOT FIX.      THE KEYLESS ENTRY FOB WAS REDESIGN FROM PART NUMBER GM/L 22733524 TO PART NUMBER GM 13584829, WHICH HAS RESULTED IN ALL THE PUSH BUTTON SWITCHES NOW RAISED ABOVE THE KEYLESS HOUSING.  WITH RAISE SWITCHES ABOVE THE HOUSING, THE TRUNK CAN INADVERTENTLY OPEN WHEN THE FOD IS IN SOMEONES POCKET. THE CAR TRUNK CAN INADVERTENTLY OPEN WHEN THE FODS SWITCH, WHICH IS IN SOMEONES POCKET, IS INADVERTENTLY PRESSED AGAINST SOMETHING WITHOUT THE OWNERS KNOWLEDGE. FOR EXAMPLE: THIS HAS HAPPEN BY JUST SETTING IN A CHAIR WHEN THE FOB PRESSES AGAINST THE CHAIR, OR WHEN LEANING AGAINST SOMETHING LIKE A TABLE OR WALL WITH THE LOWER PART OF THE BODY.      GMS OLD KEYLESS ENTRY FOBS SWITCH WERE RECESSED BELOW THE KEYLESS ENTRY FODS HOUSING AND THE OLD DESIGN DID NOT HAVE THE SAME PROBLEM WITH INADVERTENTLY OPENING THE TRUNK.  I OWN A 2009 CHEVY COBALT  THAT HAS THE OLD KEYLESS ENTRY FOB .    THIS MAJOR LATENT DEFECT WILL EXPOSE ELECTRICAL WIRING, AND PERSONAL ITEMS IN THE TRUNK TO RAIN STORMS WHEN THE TRUNK INADVERTENTLY OPENS WITHOUT KNOWLEDGE OF THE CAR OWNER.  I CONTEND THAT CHEVROLET LIKELY DID NOT TEST THE CAR WITH THE TRUNK OPEN WHEN RAINING.  FURTHERMORE, THE TRUNK CAN INADVERTENTLY OPEN WHILE SHOPPING WITHOUT THE OWNERS KNOWLEDGE RESULTING IN GIFTS, FOOD, AND PERSONAL ITEMS EASILY STOLEN OR DAMAGE BY RODENTS.    I E-MAILED AND CALLED CHEVROLET ABOUT THE LATENT DEFECT. I TALKED TO A JENNIFER AT GM (COMPLAINT NUMBER 8-154-782-3093) PHONE NUMBER 866-790-5700 EXT 5921542 ON 1 SEPTEMBER 2015. JENNIFER TOLD ME THAT GM HAS NO FIX FOR THE PROBLEM AND WOULD ONLY FIX THE LATENT DEFECT IF GM RECEIVED ENOUGH COMPLAINTS. SHE DID NOT SAME HOW MANY COMPLAINTS GM NEEDED  MAYBE 150% OF CAR OWNERS COMPLAINING OR 2,000S OF CAR FIRES!",
        "vin": "2G1165S7F91"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "08/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758712,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PUT THE CAR IN REVERSE THE DRIVER'S SIDE FRONT BRAKE STAYED CLUTCHED AGAINST THE ROOTER. I NOTIFIED THRIFTY CAR RENTAL NUMEROUS TIMES BUT NO ASSISTANT AS YET.",
        "vin": "1G1165S38FU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "08/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749940,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS REVERSING THE CAR THE FRONT DRIVER SIDE BREAKS WAS TIGHTLY GRIP ON TOO THE ROTOR. AS I TAP ON THE GAS THE CAR DID IT MOVE. I HAD TO PUT IT IN DRIVE AND TRY AGAIN.",
        "vin": "1G1165S38FU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2015",
        "dateOfIncident": "07/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745641,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GLOVE COMPARTMENT DOOR REMAINS SLIGHTLY OPEN. HOWEVER WHEN DRIVING THEN BREAKING IT WILL OPENED OCCASIONALLY",
        "vin": "1G1165S38FU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/01/2015",
        "dateOfIncident": "07/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 30, 2015 I PURCHASED A 2015 CHEVY IMPALA FROM RED RIVER CHEVY, BOSSIER CITY, LA 71111, (318) 549-7500. ON JULY 17, 2015 THE ENTIRE MY LINK SYSTEM WHICH INCLUDES, ONSTAR, GPS, CD PLAYER AND SIRIUS XM RADIO QUIT WORKING. ONSTAR COULD NOT LOCATE MY VEHICLE. ON JULY 27, 2015 I TOOK MY CAR IN TO HAVE THE GPS/MY LINK FIXED. THEY HAD TO REPLACE THE WHOLE MODULE. BEFORE THE MY LINK FAILURE I KEPT HEARING A ROARING NOISE ON THE CAR AND SOMETIMES SMELLING A BURNING ODOR. I ASKED A LOCAL MECHANIC WHAT THAT COULD BE AND HE GAVE ME THE OPTION OF BALL BEARINGS, TIRES COULD MAKE THE NOISE AND CHECK THE BRAKES. I LOOKED ON YOUR WEBSITE FOR ANY RECALLS ON THE IMPALA AND THERE IS A RECALL FOR THE EMERGENCY BRAKE PADS STICKING TO THE TIRE THAT COULD RESULT IN A FIRE. I ASKED THE SERVICE DEPARTMENT TO FIX THE BRAKES RECALL. I WAS TOLD THERE IS NO FIX FOR THE BRAKES, BECAUSE THEY HAVEN'T RECEIVED THE SOFTWARE. I ASKED THE OWNER TO REFUND MY MONEY, BECAUSE I WAS AFRAID TO DRIVE THE CAR. HE DIDN'T WANT TO DO THAT AND TOLD ME IT WAS A USED CAR. I COULD TRADE THE CAR FOR ANOTHER VEHICLE AS A USED CAR TRADE IN. THIS DEALERSHIP KNEW THERE WAS A SAFETY RISK WITH THE BRAKES AND NO REPAIR FOR THE POSSIBLE FAILURE AND STILL SOLD ME THIS VEHICLE. THEY FAILED TO  DISCLOSE THIS INFORMATION TO ME. IF MY CAR CAUGHT FIRE GOING DOWN AN INTERSTATE I WOULD NOT KNOW IT UNTIL IT WAS TOO LATE, PLUS I TAKE MY 83 YR OLD MOTHER IN THE CAR; I MAY NOT HAVE TIME TO GET HER OUT. THIS DEALERSHIP DID NOT CARE ABOUT MY SAFETY IN DRIVING THIS CAR. I WAS GIVEN A IMPALA LOANER WHILE THEY REPAIRED THE GPS AND IT ALSO HAS A BURNING ODOR. GENERAL MOTORS DOES NOT NEED TO SELL ANY CARS WITH THIS ISSUE UNTIL A FIX IS GIVEN. I COULD SEE IF I HAD THE CAR BEFORE A RECALL NOTICE, BUT I BOUGHT IT AFTER THE RECALL. THIS IS PURE NEGLIGENCE ON GENERAL MOTORS PART AND RED RIVER CHEVY. I WANT ALL OF MY MONEY BACK.",
        "vin": "1G1125S35FU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "07/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "QUESTION: ARE THESE NEW POLICE CARS WITHOUT LIGHTS SAFE IN HIGH SPEED CHASES? I LIVE IN NYC NY AND SEE THAT WE HAVE THESE NYPD CARS WITHOUT LIGHTS ON THE TOP OF THE CARS THERE. YES, IT IS A REGULAR CHEVY IMPALA POLICE CAR BUT WITHOUT THE LIGHTS ON TOP OF THE POLICE CAR WHICH ARE THERE WHEN CARS ARE IN PURSUIT OR IN CHASES OR SOMETHING. I THINK THE ONLY LIGHTS THAT THE NYPD CAR HAS WOULD BE LIKE IN THE FRONT MOTOR. WOW, THEY ALSO HAVE HIGHWAY PATROL CARS WITH THE NYPD WHICH DO REGULAR DUTIES WITH THE CAR WITHOUT THE LIGHTS ON TOP OF THE CAR THERE. WOW, IS THAT CAR ESPECIALLY THE NYPD HIGHWAY PATROL CAR TO DO CHASES WITHOUT THOSE LAMPS ON TOP. WOW, THAT IS ODD, YES, NYPD HIGHWAY PATROL HAS THOSE CARS WITHOUT LIGHTS ON TOP OF THEM DOING REGULAR PATROLS ON THE HIGHWAYS THERE. SAFE FOR CHASES AND ALL OF THAT?(REPLY BY E MAIL)...UPDATED 10/01/15*BF",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "07/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744482,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2015 CHEVROLET IMPALA LT2 ON JUNE 30, 2015 WITH 25 MILES ON THE ODOMETER FROM RED RIVER CHEVY, BOSSIER CITY, LA. THE GPS AND NAVIGATION AND THE WHOLE INFOTAINMENT SYSTEM STOPPED WORKING. ONSTAR COULD NOT LOCATE MY VEHICLE. IT KEPT SAYING I WAS IN TEXAS WHEN I HAVEN'T BEEN TO TEXAS IN THIS VEHICLE. THE CAR MUST HAVE COME FROM TEXAS. THE CAR WAS PLACED IN THE REPAIR SHOP ON JULY 27 AND IS STILL IN THE SHOP. THEY COULD NOT GET IT TO WORK WHILE I WAS AT THE DEALERSHIP. THE BRAKES ON THE CAR HAVE A BURNING SMELL TO THEM AND HAVE A CREEKING SOUND. WHEN I STOP IT SOUNDS LIKE SOMETHING IS RUBBING THE TIRES. I ASKED ABOUT THE BRAKES, I WAS TOLD IT COULD NOT BE FIXED BECAUSE GM HAS NOT RELEASED THE SOFTWARE TO FIX THE PROBLEM AND THE SOUND THE BRAKES MAKE, HE STATED HE PROBABLY COULDN'T FIX THE SOUND. THE ROAD NOISE IN THIS CAR IS REALLY LOUD NOW. IT WASN'T LOUD LIKE THIS WHEN I PURCHASED THE VEHICLE. MY 83 YR OLD MOTHER MENTIONED THE NOISE AND SHE'S HARD OF HEARING.  A LOCAL MECHANIC TOLD ME BALL BEARINGS WILL MAKE THAT TYPE OF NOISE. I KNOW GM INSTALLED BAD SWITCHES, I HOPE THEY DIDN'T INSTALL BAD BRAKES AND BALL BEARINGS. THEY ARE AWARE OF THE SOUND AND I WAS TOLD ITS JUST LOUISIANA HIGHWAYS. WHAT AM I SUPPOSED TO DO ABOUT THE BRAKE ISSUE? I WOULD LIKE A NEW CAR THAT IS SAFER TO DRIVE. IT HAS NOT BEEN 30 DAYS CAN I GET A REFUND OR ANOTHER VEHICLE?",
        "vin": "1G1125S35FU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "02/26/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691589,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED! I WAS DRIVING MY NEW, 3 WEEK OLD, 2015 CHEVY IMPALA LTZ ON THE HIGHWAY DOING ABOUT 65 MPH, WHEN THERE WAS A LOUD EXPLOSION AND MY RETRACTABLE PANEL OF THE SUNROOF HAD EXPLODED, WITHOUT CAUSE, AND BLEW OUTWARD.  FORTUNATELY THERE WAS NO ONE ELSE IN THE CAR AS THE PASSENGER SEAT AND REAR SEATS WERE COVERED WITH SHARDS OF GLASS.  THE REMAINING GLASS IN THE FRAME WAS ALL BENT OUTWARD WHICH MADE IT APPEAR THAT THERE WAS AN INTERNAL EXPLOSION TO PUSH MOST OF THE GLASS UP AND OUT OF THE CAR.  WHY THE MFG DOESN'T USE SAFETY GLASS, LIKE THE WINDSHIELD, INSTEAD OF TEMPERED GLASS WHICH BREAKS INTO A THOUSAND PIECES IS A MAJOR SAFETY ISSUE.  FORTUNATELY I WAS ABLE TO MAINTAIN CONTROL OF THE CAR.  THERE WAS NOTHING THAT HIT THE SUNROOF GLASS, IT JUST EXPLODED ON ITS OWN.  *TR",
        "vin": "2G1165S30F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/21/2015",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I RECEIVED MY BRAND NEW CAR FROM THE DEALER, BEFORE I EVEN DROVE IT, THERE WAS EXCESS MOISTURE INSIDE OF BOTH HEADLIGHTS. THIS MOISTURE CAN DIMINISH THE HEADLIGHT AND TURN SIGNAL FUNCTION,AND CORRODE THE ELECTRICAL COMPONENTS. THE MOISTURE IS AN ONGOING PROBLEM. WORKING WITH DEALER TO FIX THIS IF POSSIBLE.  *TR",
        "vin": "2G1125S38F9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "12/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669598,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTREMELY DISAPPOINTED AND SHOCKED WHILE DRIVING AT NIGHT FOR THE FIRST TIME ON A COUNTRY ROAD IN THIS VEHICLE.  THE PROJECTOR BEAM HALOGENS UTTERLY FAIL TO ILLUMINATE THE ROADWAY IN A MANNER ANY COMPETENT DRIVER  WOULD CONSIDER TO BE ADEQUATE OR MOST IMPORTANTLY SAFE!        DEALER OF COURSE SAYS THIS IS \"FACTORY\" AND CONSIDERED NORMAL. I HAVE CONCLUDED THAT THIS HEADLIGHT DESIGN   IS ADEQUATE FOR MOST URBAN (SEMI LIGHTED) HIGHWAY BUT NECESSARILY DANGEROUS FOR RURAL DRIVERS. I WILL BE ON THE LOOKOUT FOR A NEWLY DESIGNED HEADLAMP OFFERING FROM GM.       MY FIX IS TO INTENTIONALLY AIM THE (LOW BEAMS) EXTREMELY LOW AND JUST USE THE (HIGH BEAMS) FULL TIME WHICH AT LEAST ALLOWS ALL THE AVAILABLE LIGHT TO BE UTILIZED WITH NO ILL AFFECT TO ONCOMING DRIVERS SINCE THE BEAM IS SO DIM!       OH, ALSO IT SEEMS THERE ARE NO PROVISIONS (ADJUSTABILITY) THAT I CAN SEE FOR SIDE TO SIDE AIMING?  *TR",
        "vin": "2G1125S38F9"
    }
]