[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096965,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "COACHMEN",
                "productModel": "MIRADA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ISSUE IS WITH A 35' COACHMEN MOTORHOME THAT I PURCHASED  IN 2015, ALTHOUGH THE ISSUE SEEMS TO BE INDUSTRY WIDE INVOLVING ANY GASOLINE POWERED CLASS 'A' UNITS. I PERSONALLY AM AWARE OF SEVERAL OTHER MAKES, MODELS OF CLASS A'S WITH THIS FLAW.  WHEN ENCOUNTERING A ROUGH ROAD, DIPS AND VALLEYS, AND PARTICULARLY WHEN CORNERING, THERE IS AN EXCESSIVE SWAY, LIST, L TO RT LEAN OR WHATEVER YOU CALL IT .DEPENDING ON THE SEVERITY OF THE 'LIST'  IT CAN BE SCARY...I HAVE MEASURED AS MUCH AS A 25 DEGREE READING OF LIST WITH AN INCLINOMETER.   THE INDUSTRY IS AWARE OF THIS ISSUE, IT CAN'T BE OVERLOOKED IF THEY DRIVE THEIR OWN PRODUCT!  THERE IS A FIX FOR THIS PROBLEM THAT SHOULD BE ADDRESSED AT THE FACTORY; HOWEVER, THE MANUFACTURERS WOULD RATHER LEAVE IT TO THE PURCHASER.  'ROADMASTER', 'SUMOSPRINGS'  AND OTHER SUSPENSION ENHANCEMENT COMPANIES ARE DOING VERY WELL TAKING CARE OF THIS PROBLEM BUT  AT A COST OF $1K AND UP.  I DO NOT KNOW IF THIS FLAW COULD BE A SAFETY ISSUE BUT IF NOT  IT SURELY MUST COME CLOSE.",
        "vin": "1F66F5DY1F0"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "05/06/2014",
        "fire": false,
        "manufacturer": "Coachmen RV Company, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594731,
        "products": [
            {
                "manufacturer": "Coachmen RV Company, LLC",
                "productMake": "COACHMEN",
                "productModel": "MIRADA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VISIBILITY IS BLOCKED BECAUSE OF A CENTER STRIP IN THE DRIVERS SIDE WINDOW. THE POSITION OF THE MIRROR IS WRONG IT SHOULD BE MOVE AHEAD 6\" SO THE DIVIDER STRIP IN THE WINDOW DOES NOT BLOCK VIEW OF UP COMING TRAFFIC AND IT MAKE IT VERY HARD TO BACK UP YOU MUST SIT WAY FORWARD IN THE SEAT TO BE ABLE TO SEE THE MIRROR CLEARLY. VERY HAZARDOUS. THIS SITUATION CAN BE THE CAUSE OF PULLING OUT TO PAST AND NOT BEING ABLE TO SEE TRAFFIC COMING UP FROM BEHIND YOU. AND AT THE VERY WORST YOU COULD BACK OVER A CHILD THAT IS BEING BLOCKED BY THIS CENTER STRIP. THE PASSENGERS MIRROR IS CLEAR AND FINE. BUT THIS IS A VERY HAZARDOUS SITUATION.  *TR",
        "vin": "1F66F5DY5E0"
    }
]