[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449537,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "COACHMEN",
                "productModel": "FREEDOM EXPRESS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "This RV trailer was being towed on an Interstate Highway when the right side (curbside) rear spring hanger detached from the I-beam. The right rear axle, of this double-axle trailer, shifted forward causing the rear tire to grind into the front one. Fortunately, the right middle and front spring hangers held the axles somewhat in place and the truck&trailer coasted safely onto the shoulder. Although clean metal can be seen in the break, this section of the I-beam and adjacent welds have rusted. These suspension components by Lippert have, in my opinion, prematurely rusted in that it was manufactured and purchased in late-2014, is only 7 years old, and has been towed for only 40,000 miles. Numerous postings to RV Forums have detailed other incidents of premature rusting of Lippert suspensions and detailed steps taken to weld reinforcing plates, angles, and beams to strengthen original components.  Included below: pics of detached right-side rear hanger, left-side rear hanger (for comparison), and frame-mfg label. Not shown is repair estimate from Spring & Axle Co. equaling $1,700 (contains personal info).",
        "vin": "5ZT2FEHB2FA"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/11/2016",
        "dateOfIncident": "11/09/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925509,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "COACHMEN",
                "productModel": "FREEDOM EXPRESS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE FAILURE. THIS IS THE 2ND TIRE FAILURE.",
        "vin": "5ZT2FEVB1EA"
    }
]