[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2022",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455380,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I had the front shaft come out and broke the transfer case and Differential took it to two different dealers both told me I was off reading in it but it happened leaving a stop light on my way to work at 630 am. So they did not fix I had it wasn't cheap the car I think.onlu had 30000 on it..the car sat for 1.5yrs until I had enough money to repair it..filed a complaint with you guys the number was 11230317",
        "vin": "2C3CDXJG0FH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "02/25/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "V6 3.6 L Pentastar engine has serious misfire issues, I purchased a vehicle with 150k miles on it, it had check engine light on, I brought it to a local dealer service center in Dodge Koons/Tysons VA. After $900 diagnostics it was recommended to swap the engine for a brand new one. I agreed, after a month of waiting, I received my car back with the new engine installed total bill was almost $10000. After 6-7 months of driving with the new engine the check engine turned on again, so I wend back to Koons and they said the problem with the oil pressure sensor that is not cover under the engine warranty (another $550 bill). And yesterday on 02/25/2022 after a month from the last repair I had the check engine flashing again while I was driving on a highway, the car was vibrating, steering wheel was not responsive either. When I came home I found out that the flashing check engine light indicates a misfire. That means that the brand new engine has the same problem as the one that I recently replaced. This is definitely a manufacturing defect and it’s 100% not safe that they make engines like this. I will try to get my warranty though and will probably try to sell the vehicle after they fix it (hopefully no bill from Koons this time, but still 50 % unsure about it) , the fact that they produce and install them in cars is unprecedented in such a high volume (I read articles online that many people having this problem with their dodge vehicles), I’m an experienced driver but even for me it was scary to drive in such extreme conditions.",
        "vin": "2C3CDXBG7FH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446208,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Dodge Charger. The contact stated that while driving from a complete stop, the brake pedal was depressed, and he heard abnormal sounds coming from the rear end of the vehicle. There were no warning lights illuminated. The contact stated that the failure had been reoccurring while driving from a complete stop and the vehicle would stop making abnormal sounds after a couple of stops. The dealer was notified of the failure and advised the contact to take the vehicle in for a diagnostic test. The manufacturer was notified of the failure and referred the contact to the dealer for assistance. The vehicle was not diagnosed or repaired. The failure mileage was approximately 40,000.",
        "vin": "2C3CDXCT6FH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440731,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Oct. 2021 drove car from california to montana. No problem!  Nov. 2021 Car started and power steering light came on. I had no power steering and was unable to drive car. Had car towed to dealership and said my steering rack had internal failure and i had to replace rack. Cost me $3975, 2015 Dodge Charger, 34409 miles",
        "vin": "2C3CDXBG5FH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "10/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438588,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "My headlight keep going out on my 2015 dodge charger I had both replaced and now the driver side went out again please help",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "01/07/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430570,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "1/7/16 Unknown vehicle vibration reported to Dodge dealership soon after purchase, and several times thereafter. Multiple test drives/inspections performed at three separate Dodge dealerships. 7668 Miles On Vehicle 5/2/17 Multi-point inspection sheet completed. Dashcam video shows technician did not complete inspection as indicated. Started direct line of communication with FCA to find new dealership for vibration and inspection issue's. 7/26/18 Second dealership verifies a vibration at low speed, BUT co-owner of dealership caught on dashcam driving in extreme excess of the posted speed limit on country roads. 8/10/18 Third dealership VERIFIED CUSTOMER COMPLAINT and scheduled in depth inspection in four weeks later. Wrote DID NOT LIFT on final inspection sheet and blamed exhaust drone for kicking off MDS System.  4/22/2019 Vehicle towed to original dealership for leaking water pump with loose pulley. Multi-point vehicle inspection sheet completed. Performed?  *Inspection sheets have a section under Vehicle Checkup Plus to inspect either u-joints/driveshafts. Depending on dealership. 8/24/2021 Fourth shop, not affiliated with FCA, allowed me to inspect driveshaft/u-joints and the CLUNK noise heard when driving in reverse was the driveshaft because the Driveshaft Center Support Bearing had failed. The car was purchased August of 2015 and now has approximately 63,6xx miles on it. The bearing began to fail at 7,668 miles. If I didn't drive as defensively as I do, the driveshaft would have been in the cabin by 25,000 miles. There are entire forums dedicated to the early failure of this part. **Vehicle feels shaky and unstable",
        "vin": "2C3CDXCT4FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424297,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "At about 30 mph I began hearing a clicking noise coming from the underneath of the car. No sensor/warning lights on, car was placed on a computer and nothing showed wrong. The noise continued to get louder and then there was a vibration from the front end. Upon further investigation it appears the carrier bearing is out but you should e to replace the entire drive shaft, which is 700+ dollars and most places are 8-12 weeks out for delivery. It’s unsafe to drive the car, which is my only means of transportation to and from work, which also pays the payment.",
        "vin": "2C3CDXBG3FH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422876,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving the car at 10 mph then it stops and says place car in park then drive on the dash IN DRIVE basically the car stalls out and it does it randomly now no codes went off no check engine light just randoms stops also had the car in eco mode both times when it has cut off",
        "vin": "2c3cdxej6fh"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422326,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The problem has been identified by independent service center. Issues with drive shaft which is wobbling and making sound when driving on 60MPH and while stopping the vehicle. The independent service center reported that it’s not safe to drive the car.",
        "vin": "2c3cdxhg0fh"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "05/31/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420890,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Dodge Charger. The contact stated while driving 35 mph, he heard a knocking sound with no warning lights illuminated. The contact took the vehicle to an independent mechanic, where it was diagnosed that the front driveshaft needed to be replaced. The manufacturer was made aware of the failure and the contact advised to take the vehicle to the dealer for diagnosis and confirmation that the failure was associated with NHTSA Campaign Numbers: 18V281000 (Power Train) and 17V097000 (Power Train). The dealer confirmed the failure was the same and informed the contact that per the manufacturer, he was responsible for the repair and would be reimbursed if a recall was initiated that included the Vin. The vehicle was not repaired. The approximate failure mileage was 94,000.",
        "vin": "2C3CDXBG9FH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404204,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PAST TWO WEEKS THE POWER STEERING HAS GONE OUT FOR A BRIEF SECOND RESULTING IN TOTAL INOPERABILITY OF THE CAR'S MANEUVERABILITY. LUCKILY, FOR MY SON, THIS HAS TYPICALLY BEEN ON THE HIGHWAY ON A STRAIGHT AWAY. FROM WHAT I CAN GATHER, THERE SEEMS TO BE NO ANSWER TO THIS VIA CHAT BOARDS, OR ANY KNOWLEDGE OF A FIX FROM A DEALER. THIS IS UNACCEPTABLE AND DODGE SHOULD ADDRESS THIS ASAP BEFORE IT RESULTS IN THE ACCIDENT AND POSSIBLE DEATH OF SOMEONE AT A HIGH SPEED TRYING TO MAKE A CORNER. ESPECIALLY GIVEN THE FACT THAT POLICE OFFICERS ARE USING THESE CARS IN EXACTLY THIS WAY. DO BETTER DODGE, THIS IS AN ISSUE!",
        "vin": "2C3CDXBG5FH"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385431,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CONTINUE TO REMAIN ON CHECK FOR DIAGNOSTIC SAYING THAT IT'S A TRANSMISSION PROBLEM TIRES GO OUT TO FAST ONLY HAVE THE CAR FOR A FEW MONTHS.",
        "vin": "2C3CDXBGXFH"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383660,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT STATED THAT THE REAR SEAT BELT FAILED TO UNLOCK. THE VEHICLE WAS TAKEN TO LARRY H. MILLER DODGE RAM AVONDALE (10101 W. PAPAGO FWY, AVONDALE, AZ 85323) AND WAS DIAGNOSED THAT THE SEAT BELT NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE DEALER DECLINED TO COVER THE REPAIR UNDER THE WARRANTY. THE VEHICLE REMAINED AT THE DEALER AND WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 74,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/01/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372566,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LIFTER TAPPING INTO PASSENGER SIDE",
        "vin": "2C3CDXBG6FH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365670,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SECONDARY FUEL PUMP WILL LEAK GAS ONTO THE REAR PASSENGER SIDE WHEEL WELL.  I'VE FOUND OTHERS WITH THE SAME ISSUE WITH DODGE CHARGERS.",
        "vin": "2C3CDXCT2FH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363051,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT STATED WHILE HIS WIFE WAS DRIVING 35 MPH, THE BRAKE PEDAL WAS DEPRESSED TO THE FLOORBOARD TO STOP THE VEHICLE. THE CONTACT STATED THAT THE BRAKE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS DRIVEN TO HER RESIDENCE. THE CONTACT STATED HE NOTICED BRAKE FLUID HAD LEAKED ONTO THE REAR BRAKES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT THE REAR BRAKE LINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363107,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE LINE IS RUBBING ON FRAME AND CAUSE IT TO LEAK  OUT BRAKE FLUID...THE MANUFACTURER HAS A SMALL RUBBER PIECE   INSTALLED ON THE BRAKE LINE TO PREVENT THE BRAKE LINE FROM TOUCHING   THE FRAME..BUT ON THIS VEHICLE ITS LOCATED IN THE WRONG AREA..  THAT CAUSE THIS VEHICLE BRAKE LINE TO TOUCH THE FRAME AND DEFECT THE  BRAKE LINE...WE NOTICE THIS ISSUE WHILE DRIVING AND BRAKE LIGHT INDICATION..",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360604,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR IT AUTOMATICALLY SWITCHED INTO PARKED WHILE THE GEAR SHIFT WAS STILL POSITIONED IN PARK. THE CAR WILL START AND THE AIR AND EVERYTHING ELSE WORKS FINE, THE GEAR SHIFT WILL EVEN MOVE INTO DRIVE. BUT WHEN I PUSH THE GAS IT SAY 'PLACE CAR IN P THEN SHIFT TO DESIRED GEAR' AGAIN THE CAR ISN'T RUNNING HOT OR HAS ANY OTHER PROBLEMS.",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360486,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2 WEEKS AGO MY CAR WAS TAPPING WHEN I STARTED IT AND LAST WEEK IT GOT LOUDER. I TOOK IT TO THE DEALERSHIP YESTERDAY AND TODAY THEY SAID IT WAS THE CAMSHAFT: RIGHT SIDE CAMSHAFTS DAMAGE BY WORN OUT ROCKERS AND TAPPERS. I GET MAINTENANCE ON MY CAR WHEN I AM SUPPOSED TO. I BOUGHT MY CAR NEW. WHEN I SAID HOW I WAS VERY DISAPPOINTED ABOUT THE CAR AND THAT I GET MAINTENANCE DONE WHEN I SUPPOSED TO SO I DON'T SEE HOW THIS IS HAPPENING AND I WAS TOLD IT'S NORMAL IN THOSE CARS.",
        "vin": "2C3CDXHG5FH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351621,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS IN A STAND STILL, IT WAS NOTICED THAT THE DRIVER AND PASSENGER SIDE DOORS PANELS WERE SEPARATED FROM VEHICLE. THE CONTACT ALSO MENTIONED THAT ON A DIFFERENT OCCASION, THE VEHICLE CONSOLE STARTED TO SEPARATED FROM VEHICLE. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (WHITTEN BROTHERS CHRYSLER JEEP DODGE RAM OF MIDLOTHIAN LOCATED AT 10701 MIDLOTHIAN TURNPIKE, RICHMOND, VA 23235) WHERE IT WAS DIAGNOSED THAT A WHOLE NEW CONSOLE AND NEW DRIVER AND PASSENGER DOOR PANELS WERE NEEDED. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CASE BUT WAS RECENTLY CLOSED. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.",
        "vin": "2C3CDXHG1FH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/10/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328243,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR MAKES TICKING SOUND. HAD ROCKER ARM AND CAM SHAFT REPLACED 1 YEAR AGO AND ITS TICKING AGAIN. I GET OIL CHANGES EVERY 3000-5000 MILES.  *TR",
        "vin": "2C3CDXBG3FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327434,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY CAR TO A REPAIR SHOP BECAUSE OF A SOUND THE CAR MADE WHEN DRIVING, HE SAID IT IS THE DRIVELINE BEARING.  THESE ARE NON-REPAIRABLE SO YOU NEED TO HAVE THE ENTIRE DRIVE SHAFT REPLACED.  WHEN CALLING FOR THE PART IT IS BACKORDERED EVERYWHERE BECAUSE IT SEEMS TO BE A CONSISTENT PROBLEM AND THEY ARE A LOT OF PEOPLE HAVING THE SAME PROBLEM.  IF THIS IS A DESIGN PROBLEM AND THEY MUST KNOW BECAUSE IT IS BACKORDERED EVERYWHERE WHY IS THERE NOT A RECALL TO FIX IT.  *TR",
        "vin": "2C3CDXCT7FH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/26/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326006,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO WORK, MY ABS AND ESC LIGHT LIGHTS FLASHED ON THE DASH. ESC WAS IN RED AND ABS WAS IN YELLOW. I PULLED THE CAR OVER, CUT IT OFF, AND GOOGLED WHAT IT MAY BE AND ALL KINDS OF STUFF CAME UP IN REFERENCE TO WHAT IT COULD BE. ONCE I STARTED THE ENGINE AGAIN, IT WAS GONE. LET IT BE KNOWN, I TRAVEL ON THE INTERSTATE TO GO TO WORK, SO THIS WAS A VERY SCARY EXPERIENCE FOR ME. I PUT MY CAR IN DRIVE TOOK OFF ONCE I GOT UP TO 78, I PUT MY CRUISE ON AND THEN ABOUT 10 MINS LATER THE LIGHTS CAME BACK ON AGAIN. THIS TIME, IT SHUT MY CRUISE OFF AND IT'S LIKE SOMEONE PULLED MY STEERING WHEEL FROM ME. I IMMEDIATELY PULLED OVER AGAIN AND CUT THE CAR OFF. I WOULD REALLY HATE TO BE DRIVING 75-79 MPH AND MY STEERING GOES OUT. PHONED DODGE AND WAS TOLD TO BRING IT FOR THE DIAGNOSTIC TEST AND THEY COULD TELL ME WHAT IT WAS. I WENT AHEAD ON AND CONTINUED TO WORK AND IT DID NOT DO IT AGAIN, EVEN COMING HOME. I JUST DID NOT USE THE CRUISE. TIME HAS PASSED AND IT DID NOT COME BACK ON BUT NOW (TWICE) WHEN I USE MY BRAKES, IT FEELS LIKE THEY ARE SLIPPING. NOT TO MENTION AS OF 30 MINS AGO MY LIGHTS HAVE COME BACK ON. I WAS TOLD IT MAY BE A SENSOR BUT IT'S HARD TO TELL WHEN THE LIGHTS ARE NOT ON. THIS CAR IS MY LIFE.. MY MEANS TO TAKE CARE OF MYSELF AND MY FAMILY. I CANNOT FINANCIALLY GIVE HUNDREDS EVERY TIME A LIGHT COME ON AND THEN IT GOES OFF AND NOTHING CAN BE DONE. I WAS TOLD MY BREAKS AND ROTORS WERE FINE, YET I AM STILL GOING TO REPLACE THEM. I JUST NEED THIS TO BE INVESTIGATED FURTHER.. I AM A TRUE MOPAR FAN AND I LOVE MY DODGE, BUT IF I OR MY FAMILY IS IN DANGER DRIVING/RIDING IN THIS CAR, MYSELF AND SOMEONE ELSE NEED TO KNOW ABOUT IT AND SEE IF SOMETHING CAN BE DONE. PLEASE ADVISE..THANK YOU!  *TR",
        "vin": "2C3CDXHG8FH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325326,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S GRANDSON OWNS A 2015 DODGE CHARGER. THE VEHICLE WAS TAKEN TO LITHIA CHRYSLER JEEP DODGE RAM OF CORPUS CHRISTI (4313 S STAPLES ST, CORPUS CHRISTI, TX 78411) TO HAVE THE VEHICLE REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 19V018000 (AIR BAGS). UPON RETURN OF THE VEHICLE, HIS GRANDSON NOTICED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED. SEVERAL WEEKS LATER, THE CONTACT RECEIVED ANOTHER UNKNOWN RECALL NOTICE AND TOOK THE VEHICLE BACK TO THE SAME DEALER. THE MECHANIC WAS MADE AWARE THAT THE AIR BAG WARNING LIGHT ILLUMINATED AFTER THE RECALL REMEDY WAS PROVIDED. THE MECHANIC WAS INFORMED THAT PRIOR TO THE RECALL REPAIR THE AIR BAG WARNING LIGHT WAS NOT ILLUMINATED. THE OWNER WAS PROVIDED AN ESTIMATE OF $300 FOR THE COST OF THE REPAIR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 39,000. *DT*JB*DT",
        "vin": "2C3CDXBGXFH"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2020",
        "dateOfIncident": "04/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320164,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS STARTED DISPLAYING MESSAGES TO HAVE THE POWER STEERING, ELECTRONIC STABILITY CONTROL AND THE ABS BRAKE SYSTEM SERVICED. IT HAS BEGAN TO NOT START AS WELL. IT WILL RANDOMLY FLASH THESE MESSAGES ON THE DASH IN MOTION AND STATIONARY POSITIONS. WHEN IT DOES, THE POWER STEERING ACTUALLY GOES OUT OF THE VEHICLE SWERVES. THE CAR  WAS JUST AT A DEALERSHIP TO GET THE OIL DONE A WEEK AGO AND THEY DID AN ENTIRE INSPECTION ON IT AND SAID IT WAS FINE....IT HAS DONE THIS BEFORE 2 YEARS AGO AND THEN STOPPED ON IT'S OWN. SO THE OIL CHANGE WAS BEFORE THE ISSUES STARTED AGAIN. HAD IT CHECKED OUT AGAIN AND STILL NOTHING THROWING ANY CODES OUT. THIS IS A VERY BIG SAFETY ISSUE AND WE WOULD LOVE SOME ANSWERS AS TO WHY THIS IS HAPPENING!",
        "vin": "2C3CDXCT7FH"
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "01/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318808,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE CAR IN. DECEMBER 2018. ON JANUARY 21, 2019 THE DASHBOARD LIT UP SAYING SERVIVE ELECTRONIC STABILITY CONTROL ALONG WITH THE ABS WARNING LIGHT TOOK CHARGER TO GET FIXED IT WAS FIXED  HAVENT HAD AN ISSUE TILL TODAY MARCH 21, 2020 WHEN IT'S HAPPENING AGAIN 1 YEAR LATER ???? NOT RIGHT AND YES THE CAR WAS ON A STREET AT THE TIME IT STARTING NOT TO BRAKE I AM REALLY UPSET I DONT FEEL SAFE IN THIS CAR BUT LOVE IT...SOMEONE HELP A RECALL SHOULD BE PUT INTO PLACE..THANKS *DT*JB*DT*JB",
        "vin": "2C3CDXBGXFH"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316704,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR TO PERFORMANCE DODGE AT 95 LOOP ROAD, CENTERVILLE, OHIO 45459 ON 8/30/19 TO GET MY RECALLS FIXED.  I PICKED UP MY CAR AFTER THEY TOLD ME REPAIRS WERE COMPLETED.  I HAVE THE RECEIPT FROM THIS CAR DEALERSHIP THAT SAYS THEY PERFORMED THESE RECALLS (RECALL U60 AND RECALL V01).  I'M NOT ABLE TO UPLOAD MY RECEIPT BUT I CAN FAX IT OVER TO YOU IF YOU NEED TO REVIEW.  SO I THOUGHT MY RECALLS HAD BEEN FIXED BUT I KEPT RECEIVING PHONE CALLS AND LETTERS THAT I STILL HAD RECALLS ON MY VEHICLE THAT NEEDED FIXED.  SO I CHECKED MY VIN # ON THIS WEBSITE AND IT STILL SHOWS THAT I HAVE THESE OPEN RECALLS ON MY DODGE CHARGER.  CAN THIS PLEASE BE INVESTIGATED?  CAN'T THE DEALERSHIP GET IN TROUBLE FOR SAYING THEY FIXED THE PROBLEM, IF THEY TRULY DIDN'T?  MY NAME IS [XXX]  AND MY ADDRESS IS [XXX].  MY PHONE # IS [XXX] AND MY HUSBAND [XXX].  I LOOK FORWARD TO HEARING FROM SOMEONE REGARDING THIS ISSUE.  THANK YOU!    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2C3CDXHG7FH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309009,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT STATED THAT THE FUEL PUMP FAILED AND NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE FUEL PUMP AND FUEL PUMP RELAY WAS REPLACED ONCE AT COGGIN COLLISION AT THE AVENUES DEALER, (10845 PHILLIPS HWY, JACKSONVILLE, FL 32256) HOWEVER THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED AND WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "2C3CDXBG7FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "11/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306968,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT STATED THAT THE SERVICE SHIFTER WARNING LIGHT WAS ILLUMINATED. IN ADDITION, THE GEAR SHIFTER FAILED TO ENGAGE INTO DRIVE HOWEVER, WORKED AS DESIGNED AFTER SEVERAL ATTEMPTS. THE VEHICLE WAS TAKEN TO (BENCHMARK CHRYSLER DODGE JEEP RAM BENCHMARK CHRYSLER DODGE JEEP RAM (205) 957-1313) BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 96, 000.THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298969,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING USING MY PADDLE SHIFTERS MOUNTED TO THE STEERING WHEEL AND I PRESSED THE + SHIFTER TO UPSHIFT, BUT INSTEAD OF GOING UP TO THIRD GEAR THE VEHICLE DOWNSHIFTED TO FIRST. UPON SEARCHING THE INTERNET FOR A FIX FOR THIS ISSUE, I HAVE DISCOVERED THAT IT IS VERY COMMON AMONG OTHER CHRYSLER VEHICLES, DATING BACK TO AT LEAST 2015 AND STILL PRESENT IN CURRENT 2019 VEHICLES, YET CHRYSLER HAS NOT ISSUED A SOLUTION. THIS IS OBVIOUSLY A VERY SIGNIFICANT ISSUE AS THIS COULD CAUSE DAMAGE TO THE CARS ENGINE, AND COULD EVEN CAUSE ACCIDENTS OR SPEEDING TICKETS AS THE CAR COULD ACCELERATE SUDDENLY WHEN THE DRIVER IS EXPECTING TO UPSHIFT. I HAVE NOTICED THIS ISSUE SEVERAL TIMES, IT WAS CERTAINLY NOT A ONE-OFF AND IT IS DEFINITELY NOT LIMITED TO MY VEHICLE, AS IT IS CIRCULATING AROUND THE INTERNET AS A COMMON CHRYSLER PROBLEM. I HAVE ALSO EXPERIENCED IT IN CHARGERS AND CHALLENGERS I HAVE DRIVEN (I AM A VALET DRIVER) THERE ARE SEVERAL VIDEOS UP ON THE INTERNET DOCUMENTING THE ISSUE.",
        "vin": "2C3CDXJG6FH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283066,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKING ON DRIVER FOOT.  NOTICED WATER LEAKING FROM ABOVE FOOT WELL.  SO NOW THE DRIVER SIDE FLOORBOARD IS WET.  ALSO NOTICED UNDER THE REAR SEAT DRIVERS SIDE IS ALSO SOAKED.  SO NOW BOTTOM OF DRIVERS SIDE REAR SEAT IS WET.  NO IDEA HOW WATER IS COMING INSIDE.  NO LUCK SEARCHING ON INTERNET FOR ANSWERS.  OTHER PEOPLE HAVING PROBLEM BUT NO ANSWERS ON HOW TO FIX.  VERY FRUSTRATING.",
        "vin": "2C3CDXKT3FH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/29/2019",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282853,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FUSE 26 IN SECONDARY PDC IN TRUCK FOR POWER TO TCM (TRANSMISSION) MODULE BLOWN. VEHICLE WOULD NOT SHUT OFF COMPLETELY DUE TO SHIFTER PHYSICALLY IN PARK, BUT SOFTWARE INDICATING STILL IN DRIVE. COULD NOT OPEN TRUCK WITH EITHER FOB BUTTON OR TRUCK BUTTON ON DASH TO CHECK FUSES OR DISCONNECT BATTERY. NO EXTERIOR KEY HOLE TO OPEN TRUNK MANUALLY. THIS IS A SAFETY ISSUE IF CAR CATCHES FIRE.",
        "vin": "2C3CDXJG2FH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/29/2019",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282948,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH HEADLIGHTS HAVE WENT OUT ON MY CHARGER. FIRST IT WAS DRIVER HEADLIGHT I COULD ONLY DRIVE WITH MY BRIGHT LIGHTS ON. IF I SWITCH THEM TO LOW BEAM THERE WOULD BE NO LIGHT ON THE DRIVER SIDE. AFTER ABOUT A WEEK TRYING TO GET IN THE DEALERSHIP THE ENTIRE LIGHT STOPPED WORKING. I REPLACED THE BULB NOTHING HAPPENED. CONTACTED DEALERSHIP AGAIN THERE WAS WAIT. ANOTHER WEEK WENT BY AND MY PASSENGER HEADLAMP STOPPED WORKING COMPLETELY. I NOW HAVE TO DRIVE WITH MY DAYTIME RUNNING LIGHTS AND MY FOG LIGHTS. BRAND NEW BULBS IN BOTH HEADLIGHTS STILL NO POWER AND NO LIGHTS. NO BRIGHT LIGHTS, NO LOW BEAM LIGHTS. I HAVE SEARCHED FOR THE ANSWER ON THE WEB. I HAVE SEEN THAT THERE WAS AN ISSUE WITH THE 2010-2012 CHARGERS WITH THE ELECTRICAL WIRING BURNING OUT AND CAUSING THIS ISSUE. I'M WONDERING IF THE SAME ISSUES IS HAPPENING WITH MY CHARGER. MY BROTHER HAS A 2015 CHRYSLER 200 AND IS NOW HAVING THE EXACT SAME ISSUE.",
        "vin": "2C3CDXCT5FH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282513,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS NOT RUNNING CORRECTLY HAD IT CHECKED AND CYLINDER 6 WAS MISSING WHICH WAS AN ISSUE IN THE FACTORY. THE VEHICLE WAS UNDER WARRANTY AT THE TIME. TOOK IT IN TO LAMPE DODGE VISALIA CALIFORNIA, WAS TOLD A LOANER OR RENTAL HAD TO BE APPROVED BY CORPORATE. THIS WAS NOVEMBER 8TH OF 2019, I HAVE CALLED AND NO ANSWER THEY REFER ME TO DIFFERENT PEOPLE AND NO ANSWER OR RENTAL CAR. I HAVE BEEN A PREVIOUS DODGE OWNER, AND THIS WILL BE THE LAST VEHICLE I PURCHASE FROM YOU. I HAVE BEEN PATIENT AND THE DEALERSHIP IS NO HELP NEITHER IS CORPORATE. I AM NOT ASKING FOR ANYTHING OTHER THAN WHAT IS RIGHT, THE MOST FRUSTRATING THING IS THE LACK OF FOLLOW THROUGH OR COMMUNICATION FROM DEALER AND CORPORATE. THE CORPORATE PERSON WE SPOKE TO WAS CURBIN AND HE HAD NO INFO AND BLAMED IT ON HIS SUPERVISOR FOR NOT APPROVING IT. I WILL BE TELLING EVERYONE I KNOW ABOUT THIS, AND I AM EXTREMELY DISAPPOINTED WITH YOUR COMPANY AND HOW THEY HAVE TREATED ME. I SPOKE TO CORPORATE TODAY AND ZERO ASSISTANCE. THANKS A LOT",
        "vin": "2C3CDXBG9FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280941,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER IN JANUARY OF 2019 ABOUT A RECALL TO REPLACE THE PAB INFLATOR ON MY 2015 DODGE CHARGER SE. I WENT TO VIVA DODGE WHERE I GOT MY VEHICLE AND THEY SAID THEY WOULD PUT IN THE ORDER FOR THE PART AND GIVE ME A CALL WHEN THEY'RE READY TO FIX IT. IT IS NOW NOVEMBER OF 2019 AND THEY HAVE YET TO CONTACT ME. I TRIED CALLING THEM MULTIPLE TIMES THROUGHOUT THE YEAR AND THEY ASSURED ME THE PARTS WERE BEING ORDERED BUT I HAVE NOT HEARD BACK ABOUT GOING IN FOR REPAIR. IT IS CONCERNING TO ME CONSIDERING FAULTY OF THIS PART COULD LEAD TO SERIOUS INJURIES AND EVEN DEATH IF EVER IN AN ACCIDENT.",
        "vin": "2C3CDXBG0FH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271761,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND YEAR I'VE OWNED MY 2015 CHARGER. I NOTICED THE FIRST YEAR AFTER BUYING THE CAR IN THE SUMMER THAT THE HEAT ONLY BLEW OUT THE PASSENGER SIDE. WHEN I TOOK THE CAR TO THE DEALERSHIP TO GET IT LOOKED AT I WAS TOLD IT WOULD COST $650 TO REPLACE THE DOOR ACTUATOR. APPROX 2 DAYS LATER WHILE I WAS WAITING ON THE PART I TRIED THE HEAT AND IT CAME ON. NEEDLESS TO SAY, I CANCELLED THE REPAIR. NOW, HERE AS THE COLD HAS COME UPON US AGAIN, ONCE AGAIN, NO HEAT ON DRIVERS SIDE. I HAVE READ SEVERAL ISSUES REGARDING DODGE CHARGERS OF THE SAME YEAR EXPERIENCING THE SAME PROBLEMS. THIS ISSUE IS SOMETHING THAT NEEDS TO BE INSPECTED BY THE MAKER TO IDENTIFY THE ISSUE. BEING THAT WHEN IT'S COLD OUT THE DEFROSTER ISN'T CAPABLE OF KEEPING THE WINDSHIELD CLEAR THEREFORE COULD CAUSE VISABILITY ISSUES WHILE DRIVING.",
        "vin": "2C3CDXHG3FH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271742,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLAMPS PERIODICALLY SHUT OFF WHILE DRIVING, WHICH RESULTS IN A POTENTIALLY DANGEROUS SITUATION. I AM TOLD THAT THE ELECTRONIC CONTROL SYSTEM MODULE REGULARLY MALFUNCTIONS ON THESE VEHICLES RESULTING IN A SITUATION WHERE LIGHTING AT THE FRONT OF THE VEHICLE TURNS OFF. THIS CONDITION HAS HAPPENED NOT ONLY WHILE STATIONARY BUT ALSO WHILE MOVING.",
        "vin": "2C3CDXJG5FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270368,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A DODGE CHARGER, I HAVE NOTICED THAT MY DOOR PANELS INSIDE THE CAR HAVE BEEN WARPING, I DIDN'T THINK THAT I HAVE TO PAY 30000 DOLLARS FOR A CAR I THOUGHT WOULD BE AN AWESOME CAR DO THIS. SO I DECIDED TO DO SOME RESEARCH ON THIS PARTICULAR PROBLEM BECAUSE I THOUGHT IT WAS JUST ME, BUT NO I HAVE FOUND OUT THIS HAS BEEN HAPPENING SINCE 2011, I HAVE A TOTAL OF 3 CARS INCLUDING MY BEAUTIFUL DODGE CHARGER. I DON'T THINK IT'S FAR THAT I AND MANY OTHERS HAVE TO PAY AN ADDITIONAL CHARGE OF NEARLY AN EXTRA 2000 DOLLARS FOR GETTING OUR DOOR PANELS REINSTALLED. THIS IS LUDACRIS DON'T GO THINK. I ALSO KNOW THAT THIS IS A NATION WIDE PROBLEM HERE, THEN WHEN YOU CALL TO SEE ABOUT GETTING THEM FIX KNOWING YOU HAVE A WARRANTY OR AN EXTENDED WARRANTY THEY TELL YOU THEY DON'T PAY FOR IT BECAUSE ITS WARE OR TEAR. HOW IS THAT? I KNOW WHEN I GET INTO MY CAR I USUALLY SIT INSIDE THE CAR AND NOT OR A DOOR PANEL. HOW HEAVY OF SOMETHING CAN A DOOR PANEL ACTUALLY BE BEING THAT A DOOR PANEL HAS LITTLE WEIGHT TO HOLD ANYTHING.    MY POINT HERE IS WHY ISN'T THIS A RECALL ON THIS ISSUE IT'S BEEN HAPPENING SINCE 2011 IT'S 2019.   WHY DO THE CUSTOMER HAVE TO PAY AN ADDITIONAL CHARGE FOR SOMETHING THEY HAVE NOT EVEN THERE.",
        "vin": "2C3CDXHG3FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255217,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AC GIVING TROUBLE DRIVER SIDE GIVE COLD AIR AND PASSANGER SIDE GIVE HOT AIR",
        "vin": "2C3CDXHG4FH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241567,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE FAILURE OF WATER PUMP AND RADIATOR...THESE TWO INCIDENTS HAPPENED DURING INTERSTATE TRAVEL CAUSING THE CAR TO OVERHEAT LEAVING ME STRANDED IN UNFAMILIAR TERRITORY. VEHICLE IS NOT DRIVEN ON A DAILY BASES THIS INCIDENT HAPPENED AT 31000 MILES",
        "vin": "2C3CDXCT3FH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230662,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 19V018000 (AIR BAGS) AND STATED THAT THE MANUFACTURER FAILED TO REPAIR THE VEHICLE WITHIN A REASONABLE AMOUNT OF TIME. VICTORY CHRYSLER/JEEP (64 BREENSBURG ST, DELMONT, PA 15626) CONFIRMED THAT PARTS WERE NOT AVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CDXJG9FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230317,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILED A REPORT ABOUT A YEAR AGO NEVER GOT THE VEHICLE FIXED.I WAS JUST READING IN THE WEBSITE FOUND THIS RECALL 17V097000 ABOUT THE FRONT PROPELLER FOR THE DRIVE SHAFT THIS IS WHAT HAPPENED TO MY CHARGER IT BLEW OUT THE FRONT AXLES FRONT DIFF. AND TRANFER CASE DEALER WILL NOT REPAIR AND ALSO CANCELED MY REMAING WARRANTY",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220561,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. WHILE DRIVING OVER A BUMP IN THE ROAD, BOTH TURN SIGNALS ERRONEOUSLY ACTIVATED. ALSO, WHEN THE TURN SIGNALS WERE ACTIVATED AND THE STEERING WHEEL WAS TURNED BACK TO THE STRAIGHT POSITION, THE TURN SIGNALS WOULD REMAIN ACTIVATED AND FAILED TO TURN OFF. FURTHERMORE, THE HIGH BEAM HEADLIGHTS NO LONGER OPERATED. THE FAILURES WERE NOT DIAGNOSED OR REPAIRED. THE LOCAL DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS INFORMED OF THE FAILURES. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2C3CDXCT1FH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217478,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONNECTOR TO THE FUEL PUMP OVERHEATS CAUSING THE PLASTIC HOUSING TO MELT ITS WAY INTO THE FUEL TANK. FUEL LEAKS UNDER THE REAR SEAT AND THE FUMES FILL THE CAR. I PURCHASED A NEW FUEL PUMP ASSEMBLY AND IT CAME WITH A WIRING HARNESS AND CONNECTOR. THERE WAS OVERHEATING MENTIONED WITH THE INSTALLATION INSTRUCTIONS, SO THIS IS NOT A NEW PROBLEM. HOW CAN GAS UNDER THE REAR SEAT NOT BE A MAJOR CONCERN?",
        "vin": "2C3CDXCT9FH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209718,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT STATED THAT THE INSTRUMENT PANEL WAS FAULTY AND THE GAUGES WERE INOPERABLE. THE CONTACT ALSO STATED THAT SHE LOST CONTROL OF THE VEHICLE AND FELT THAT THE SPEED COULD NOT BE CONTROLLED. THE VEHICLE FELT AS IF IT WOULD RUN OFF OF THE ROAD. IN ADDITION, THE CHECK ENGINE, TRACTION CONTROL, AND ABS INDICATORS ILLUMINATED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 34,016.",
        "vin": "2C3CDXBG0FH"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206918,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS AT DEALERSHIP (ACADIANA DODGE). AFTER BEING THERE FOR NEARLY A MONTH VEHICLE STILL HADN'T BEEN PROPERLY SERVICED. PASSED WORDS WITH SERVICE MANAGER AND THEY REFUSED TO COMPLETE SERVICE HAD TO TAKE VEHICLE TO ANOTHER DEALERSHIP AND PAY ANOTHER DEDUCTIBLE. I PURCHASED MY VEHICLE FROM THIS DEALERSHIP THEREFORE I FEEL AS IF THEY SHOULD'VE MADE IT AN PRIORITY TO MAKE SURE MY VEHICLE WAS SAFE TO DRIVE AND THAT I WAS SATISFIED AS AN CUSTOMER. THEY ALSO LISTED SERVICES COMPLETED ON INVOICE THAT HADN'T BEEN RENDERED. U DO NOT TRUST DEALERSHIPS. I FEEL AS IF I WAS DISCRIMINATED ON BECAUSE IF MY GENDER AND RACE AND WAS COMPLETELY TAKEN ADVANTAGE OF. PATHETIC!",
        "vin": "2C3CDXBG6FH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206148,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STREEING MAKING NOSIE WHILE TURNING LEFT OR RIGHT",
        "vin": "2C3CDXHG4FH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203896,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ATTEMPTED TO START CAR AND NOTHING HAPPENED WHEN START WAS PUSHED. LIGHTS AND RADIO WORKED. MESSAGE ON PANEL SAID PRESS ON BRAKE AND PUSH START BUT STILL NOTHING HAPPENED. THE LIGHTS ON THE GEAR SHIFT BEGAN FLASHING RED, THE WIPERS BEGAN OPERATION EVEN THOUGH THEY WERE OFF. THE KEY FOBS WOULD NO LONGER WORK. I HAD TO HAVE THE VEHICLE TOWED TO A DEALER, WHICH STRANDED ME 4 HOURS FROM HOME IN 0 DEGREE WEATHER. THE DEALER COULD NOT GET TO IT FOR 3 DAYS AND WHEN THEY DID- IT STARTED WITH NO PROBLEM AND NO CODE ERRORS CAME UP.   THE DEALERSHIP ACTUALLY TOLD ME THAT THEY THINK IT WAS DUE TO THE EXTREME COLD TEMPERATURES. I GUESS DODGE CAN ONLY BE DRIVEN IN A WARM CLIMATE. NOW IT DID IT AGAIN LAST NIGHT. AT LEAST I WAS ONLY 30 MINS FROM HOME. I WENT BACK THIS MORNING AND IT STARTED RIGHT UP AGAIN BUT THE ENGINE LIGHT IS ON. THIS TIME IT WAS 65 DEGREES. SOMETHING IS TERRIBLY WRONG WITH THIS VEHICLE. IT SEEMS FROM SEARCHING THE INTERNET THAT A LOT OF CHARGERS HAVE THIS ISSUE BUT THERE IS NO RECALL ON MY CAR TO HAVE IT REPAIRED.",
        "vin": "2C3CDXJGXFH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202883,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE LIGHTS DOESN'T STAY ON. THE BULB AND FUSE WAS REPLACED. THIS IS A KNOWN ISSUE WITH CHRYSLER AS TO THEY SETTLED A CLASS ACTION SUITE WITH JEEP IN 2015. THE TIPM IS BAD ON THE CHARGER.",
        "vin": "2C3CDXCT6FH"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "03/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197259,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ALMOST LOST CONTROL OF THE VEHICLE. VEHICLE NO LONGER FEELS STABLE WHILE DRIVING",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195579,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V018000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED BROWN'S JEEP CHRYSLER DODGE RAM (LOCATED AT 483 NY-112, EAST PATCHOGUE, NY 11772, (888) 615-2184) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CDXHGXFH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195723,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR PANELS AT TOP OF DOOR WHERE THE LOCKS ARE IS COMING UNGLUED, AND ALSO ON THE SIDE OF THE GEAR SHIFT. THIS STARTED HAPPENING NOT LONG AFTER MY WARRANTY EXPIRED.IT LOOKS AWFUL.",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184618,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2015 DODGE CHARGER AS A CERTIFIED USED CAR.  I DID NOT HAVE MUCH NEED FOR HILL DRIVING UNTIL MOVING TO NORTHERN CALIFORNIA.  WHILE DRIVING DOWN A GRADE AND BRAKING, I NOTICED A VIBRATION IN THE BRAKE AND SHIMMY IN THE STEERING. THE ISSUE HAS CONTINUED, WHEN DRIVING DOWNHILL AND BRAKING.  UNFORTUNATELY, I WAITED UNTIL AN UNRELATED RECALL TO HAVE THE DEALER CHECK THE BRAKES.  AT 31,098 MILES, THE FRONT ROTORS ARE WARPED AND SHOULD BE REPLACED.  DODGE IS INDICATING THIS IS NOT COVERED BY WARRANTY.  I REVIEWED ON LINE FORUMS AND FOUND SEVERAL OTHERS WITH SIMILAR COMPLAINTS ABOUT NOT ONLY THIS MODEL YEAR, BUT ALSO DATING BACK TO THE 2006 MODEL YEAR.  ALL DESCRIBED SIMILAR ISSUES WITH VERY LOW MILEAGE.",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181567,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V018000 (AIR BAGS). POSNER PARK CHRYSLER DODGE JEEP RAM FIAT (42650 US-27, DAVENPORT, FL 33837, 1-863-588-7539) WAS CONTACTED AS SOON AS THE NOTICE WAS RECEIVED AND AN APPOINTMENT WAS SCHEDULED FOR FEBRUARY 15, 2019. THE VEHICLE WAS DROPPED OFF AT THE DEALER; HOWEVER, WITHIN LESS THAN THREE HOURS, THE DEALER STATED THAT THE PART WAS NOT AVAILABLE AFTER INITIALLY INDICATING THAT IT WAS AVAILABLE. THE CONTACT WAS UNCERTAIN IF THERE WOULD BE A LOANER VEHICLE OPTION. THE MANUFACTURER WAS NOTIFIED OF THE PARTS DELAY AND THE CONTACT WAS WAITING ON THEIR RESPONSE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2C3CDXHG9FH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "12/22/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171962,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHTS DO NOT SHOW ENOUGH LIGHT ON RIGHT AND LEFT SIDES OR STRAIGHT AHEAD WHEN DRIVING ON UNDER LIT ROADS IN MOTION ON BACK COUNTRY ROADS",
        "vin": "2C3CDXBG6FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170514,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. AFTER THE VEHICLE WAS REPAIRED PER AN UNKNOWN RECALL REGARDING THE POWER TRAIN CONTROL MODULE, THE TRANSMISSION SEIZED WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE VEHICLE FAILED TO ACCELERATE AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS UNABLE TO RESTART AND THE VEHICLE WAS TOWED TO ALL STAR DODGE CHRYSLER JEEP RAM (2590 RANGE PARK DR, DENHAM SPRINGS, LA 70726 (225) 665-8266) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 134,237.",
        "vin": "2C3CDXHG3FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163637,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CATASTROPHIC ENGINE FAILURE DUE TO FAULTY LIFTER DESIGN AND POOR QUALITY CAM SHAFT MATERIAL. CAN CAUSE LOSS OF ENGINE POWER AND ABILITY TO CONTROL THE VEHICLE.  ENGINES TYPICALLY FAIL BETWEEN 80,000 AND 160,000 MIES WITH HIGH CERTAINTY.",
        "vin": "2C3CDXCT6FH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161392,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR JUST LOST POWER ALL OF A SUDDEN. THE VEHICLE IS UP TO DATE ON MAINTENANCE. THE MECHANIX EXPLAINED THAT EVERYTHING MECHANICALLY IS GREAT, THE BATTERY, ENGINE, ALTERNATOR, ETC. THERE IS A MALFUNCTIONED MODULE WITHIN THE CAR'S COMPUTER. THE CAR WAS STATIONARY WHEN I DISCOVERED IT HAD NO POWER.",
        "vin": "2C3CDXBG6FH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "08/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151896,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL JERKED WHEN TURNING OR BACKING OUT OF A TIGHT SPOT, INTERMITTENTLY. WE THEN RECEIVED POWER STEERING ERROR WITH THE ICON ON THE DASH. NOW APPROX 3 MONTHS LATER WE LOST POWER STEERING. DEALERS SAY THE ENTIRE FRONT RACK NEEDS TO BE REPLACED BECAUSE OF AN ELECTRONIC PART. THE RACK IS AT LEAST $2500 AND THEN MULTIPLE DEALERS SAY AT LEAST ANOTHER $1500 IN LABOR. I DO NOT UNDERSTAND HOW A CAR ONLY 2 YEARS OLD CAN BE SUBJECT TO THIS TYPE OF REPAIR FOR AN ELECTRONIC COMPONENT FAILURE. WHEN STARTING, WE CAN STEER EASILY BUT AFTER 100 YARDS OR LESS WE GET THE FAILURE ICON AND LOSE POWER STEERING. THIS CLEARLY SEEMS A FAULT AT THE DESIGN/MANUFACTURE LEVEL. I CANNOT FIND THE COST OF THE ELECTRONIC COMPONENT YET, WOULD LIKE SOME HELP WITH THAT AND ALSO WITH CHRYSLER BEING MADE  TO FIX THIS DEFECT.",
        "vin": "2C3CDXBG0FH"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131812,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "13 INCH BRAKES INADEQUATE FOR VEHICLE WEIGHT.",
        "vin": "2C3CDXHGXGH"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/06/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131589,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE INSIDE THE VEHICLE, OCCUPANTS SMELL A VERY STRONG ODOR OF GASOLINE. CHECKED FUEL PUMPS UNDER BACK SEAT AND THERE WAS A PUDDLE OF FUEL ON TOP OF THE DRIVER SIDE FUEL PUMP. UPON FURTHER INSPECTION FOUND THE FUEL TO BE COMING OUT OF THE ELECTRICAL CONNECTOR FOR THE DRIVER SIDE FUEL PUMP. ALL SEALS WERE STILL GOOD. THE CONNECTORS WERE BURNT OUT AND THE PLASTIC WAS MELTED. THIS HAS HAPPENED ON SEVERAL VEHICLES IN OUR FLEET. (APPROX 20). THE SMELL IS CONSISTENT ONCE THE CONNECTOR IS MELTED.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "08/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129419,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ELECTRIC POWER STEERING FAILURE WHILE DRIVING ALONG TELEGRAPH ROAD IN DEARBORN, MICHIGAN.",
        "vin": "2C3CDXFGXFH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "09/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129206,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORMAL CONDITION, WHEN THE GAS STARTING COUNTING DOWN EVERY SECOND STARTING AT 60 MILES AND THEN THE ENGINE SHUT OFF. ABLE TO PUT GAS IN AND STARTING DRIVING AGAIN AND SAME INCIDENT HAPPENED.",
        "vin": "2C3CDXHG3FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/09/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128368,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR TRIM ON BOTH THE DRIVER SIDE AND PASSENGER SIDE ARE 'WARPED' IN WERE THEY'RE NOT ATTACHED ANYMORE. I THINK THIS IS A KNOWN PROBLEM IN ALL DODGE CHARGER AND CHALLENGER VEHICLES. I THINK THIS NEEDS TO BE INVESTIGATED FURTHER BECAUSE IT SEEMS LIKE A MANUFACTURER DEFECT. IT'S ALSO INTERESTING THAT ORDERING THE DOOR PANELS THEY ARE ON BACK ORDER FOR SEVERAL MONTHS.",
        "vin": "2C3CDXHG0FH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/29/2018",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114395,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 38,000 MILES THE RIGHT FRONT DOOR PANEL SEPARATED AND CURLED UP BY THE WINDOW.  THIS HAS GOTTEN WORSE OVER TIME.  THE DEALERSHIP STATED THAT IT'S COMMON AS THEY SEE IT ALL THE TIME WITH CHARGER, IT WILL COST $950 TO FIX AS EVEN THOUGH IT'S COMMON THEY WON'T COVER IT UNDER WARRANTY.",
        "vin": "2C3CDXBG0FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2018",
        "dateOfIncident": "07/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO TAKE MY FATHER TO THE HOSPITAL.  LOOKED UP THE HOSPITAL ON THE NAVIGATION SYSTEM AND THE ADDRESS USED FOR THE HOSPITAL WAS 10 YEARS OUT OF DATE.  THEN TRIED TO USE THE ROAD NAME FOR THE HOSPITAL AND THAT COULD NOT BE FOUND.  IT IS A 2015 CAR, THERE IS NO REASON THAT THE NAVIGATION SYSTEM SHOULD BE OUT OF DATE.  I CONTACTED THE COMPANY THREE TIMES TO REPORT THIS ISSUE. EACH TIME I AS TOLD IT WAS NOT THEIR PROBLEM.",
        "vin": "2C3DCXCT0FH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/03/2018",
        "dateOfIncident": "06/29/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105364,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCURS WHEN VEHICLE IS IN MOTION OR STATIONARY.  ALTHOUGH PROBLEM IS PRIMARILY OBSERVED WHILE IN MOTION.    ACCELERATOR/BRAKE ASSEMBLY MOVES TOWARDS THE SEAT WHILE VEHICLE IS IN MOTION.  THIS CAUSES INCREASED PRESSURE ON THE PEDAL UNKNOWINGLY.  IF DRIVING - THE CAR WILL SUDDENLY AND UNEXPECTEDLY ACCELERATE, IF BRAKING - INCREASED PRESSURE CAUSES UNPREDICTABLE DECREASE IN SPEED.    THE PROBLEM HAS BEEN ADDRESSED BY DEALER TWICE ON THE SAME VEHICLE.  THE FIRST TIME THE SWITCH WAS REPLACED WHICH DID NOT FIX THE ISSUE.  THE SECOND TIME THE ENTIRE ACCELERATOR/BRAKE ASSEMBLY WAS REPLACED WHICH DID FIX THE ISSUE.   AFTER LESS THAN ONE YEAR THE PROBLEM HAS OCCURRED AGAIN.    THE PROBLEM IS THAT EVEN A SMALL INCREASE IN PRESSURE ON THE GAS HAS A DRAMATIC EFFECT ON SPEED AND ACCELERATION.  IT IS ALMOST IMPERCEPTIBLE THAT THE PEDAL IS MOVING TOWARDS THE DRIVER WHILE DRIVING.  THE PEDAL WILL CONTINUE MOVING UNTIL AT FULL FORWARD (CLOSEST TO THE DRIVER) OR SWITCH IS USED.  THE SWITCH LOCATED ON THE SEAT WILL STOP THE MOVEMENT AND STILL OPERATES TO MOVE THE PEDALS BACK TO THEIR DESIRED POSITION.",
        "vin": "2C3CDXCT7FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/30/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098835,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ADJUSTABLE PEDAL MOVE CLOSER TO DRIVE UNEXPECTEDLY WHILE VEHICLE IS IN MOTION. MOST TIMES YOU DONT NOTICE THE PEDALS MOVING UNTIL THE ENGINE REVS UP OR THE BRAKES STOP FASTER THAN EXPECTED.  MOST OF THE TIME MY FOOT IS STATIONARY AND I MOVE THE TIP OF IT FOR THE GAS. IM 6'5\" SO THE PEDALS ARE ADJUSTED ALL THE WAY TO THE FLOOR.  THEY START MOVING ALL THE WAY TOWARD ME WHILE IM DRIVING CAUSER ME TO PUSH FASTER ON THE ACCELERATOR UNTIL I REALIZE WHATS HAPPENING. WITH A HEMI THAT'S A LOT OF POWER TO BE SPINNING UP. PERSONALLY I DONT FEEL THE PEDALS SHOULD BE ADJUSTABLE WHEN TRANSMISSION IS OUT OF PARK. I HAVE YET TO FIND A RESOLUTION TO THIS ISSUE WITH THE DEALER.  I HAVE FOUND SEVERAL ARTICLES ONLINE TALKING ABOUT THIS PROBLEM BUT NO CLEAR SOLUTION.",
        "vin": "2C3CDXCT3FH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/27/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098412,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. WHILE DRIVING APPROXIMATELY 35 MPH, A \"PARK THE VEHICLE\" MESSAGE SUDDENLY DISPLAYED. AFTER PARKING AND TURNING THE ENGINE OFF, SMOKE WAS SEEN COMING FROM THE REAR TRUNK. UPON INSPECTION, IT WAS DISCOVERED THAT A WIRE LEADING TO THE FUSE BOX WAS IN FLAMES. THE CONTACT WAS ABLE TO EXTINGUISH THE FLAMES, BUT THE VEHICLE COULD NOT BE RESTARTED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 107,000.",
        "vin": "2C3CDXBG0FH"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097696,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER SEAT HAS FAILED IN THE LICK POSITION IN THE TRACK ADJUSTMENT.    ONE DAY WHILE DRIVING ON THE HIGHWAY, WE HAD TO COME TO AN ABRUPT HAULT FROM 75 MPH, AND MY PASSENGER SEAT BROKE FROM ITS LOCKED POSITION, SENDING ME FIREARD TOWARDS MY DASH THEN JAMMED IN THAT POSITION, THE PROBLEM I FOUND ON THE SEAT TRACK , WAS THE SLIDER BEARINGS BROKE AND UNLOCKED THE TRACK, AND GOT STUCK WITH THE BROKEN PARTS IN THE TRACK, OF COURSE THIS HAPPENED AFTER THE WARRANTY, SURE WISH THEY WOULD TAKE CARE OF THIS, MAYBE YOU CAN HELP, ON GETTING SEAT TRACKS REPLACED.",
        "vin": "2C3CDXBG3FH"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090291,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. THE SEATBELT, ONCE BUCKLED, WILL NOT UNFASTEN UNLESS YOU REPEATEDLY YANK AT THE BELT ITSELF. THERE WAS REPEATED CLICKING IN THE ENGINE AND I COULD NOT EXCEED OVER 45MPH. WHEN THE HEAT IS TURNED ON IN THE CAR THE COOL A/C BLOWS ON THE DRIVERS SIDE OF THE CAR AND WHEN I TRIED TO ADJUST THE TEMPERATURE ON DRIVER SIDE OF CAR I AM UNABLE TO DO THAT.",
        "vin": "2C3CDXBG2FH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089106,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. WHILE STARTING THE VEHICLE OR WHILE DRIVING AT UNKNOWN SPEEDS, THERE WAS AN ABNORMAL TICKING NOISE AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (SNETHKAMP CHRYSLER DODGE JEEP RAM, 11600 TELEGRAPH RD, REDFORD CHARTER TWP., MI 48239, (888) 455-6146) WHERE IT WAS DIAGNOSED THAT THE CAMSHAFT WAS WORN, THE LIFTER WAS THE CAUSE OF THE TICKING NOISE, AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 105,535.",
        "vin": "2C3CDXAT1CH"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "04/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084548,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED A UCONNECT SYSTEM UPDATE WHILE I WAS STILL PARKED. THE DISCLAIMER SAID NOTHING ABOUT TO NOT UPDATE WHILE DRIVING. I STARTED THE UPDATE AND STARTED DRIVING (MY COMMUTE IS ABOUT 25 MINUTES). IT TOOK ABOUT 10-15 MINUTES TO DOWNLOAD THE UPDATE. ONCE IT DOWNLOADED, THE SYSTEM RESET. AT THIS TIME I WAS IN CRUISE CONTROL ON A FREEWAY THAT WAS ENDING, SO I TURNED OFF MY CRUISE CONTROL AND THEN MY CAR JOLTED FORWARDED AS IF IT WERE IN A VERY LOW GEAR AND ALMOST CAUSED ME TO CRASH. I THEN WAS STUCK IN 1ST GEAR WHILE THE SYSTEM WAS REBOOTING AND COULDN'T AUTOMATICALLY OR MANUALLY SHIFT PAST 1ST GEAR LEAVING ME STUCK ON THE SIDE OF THE ROAD. THEN A SCREEN POPPED UP SAYING THERE WAS 50 MINUTES LEFT ON THE UPDATE. I WAS STUCK ON THE SIDE OF THE ROAD UNTIL THE UPDATE FINISHED. AFTER THAT, MY GEARS WERE SHIFTING NORMALLY. DURING THIS TIME, I CALLED DODGE AND OPENED A CASE LETTING THEM KNOW WHAT HAPPENED.  THE PICTURE I PROVIDED WAS A PICTURE AFTER I WAS ALREADY STOPPED ON THE SIDE OF THE ROAD. *TT   *BF    *CN     UPDATED 10/29/18*JB",
        "vin": "2C3CDXHGXFH"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "04/08/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD CAR ACCD. SEAT BELTS DIDN'T TIED UP AND AIR BAGS DIDN'T COME OUT",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083330,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST WAS A/C ELECTRICAL ISSUES 3 TIMES AND EVEN HAD DASHBOARD PULLED APART ALONG WITH RADIO MAIN CONTROL SCREEN GOING IN AND AS OF 4/4/2018 IM NOW HAVING ABS TRACTION CONTROL WITH STEERING PROBLEMS WHEN STARTING TURNING DRIVING..ALL ISSUES SINCE BUYING MY CAR BRAND NEW IN 2016 (LEMON LAWS? PLEASE HELP) ONLY 44K MILES NOW AND DEALERSHIP SAYS ITS NO LONGER COVERED.",
        "vin": "2C3CDXBG7FH"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083098,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT HEARD A LOUD THUMPING NOISE FROM THE FRONT OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED DURING THE FAILURE. THE VEHICLE WAS TAKEN TO OURISMAN CHRYSLER JEEP DODGE OF ALEXANDRIA (5900 RICHMOND HWY, ALEXANDRIA, VA 22303) WHERE IT WAS DIAGNOSED THAT THE STRUTS AND MOTOR MOUNT FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND REFERRED THE CONTACT TO A CASE MANAGER TO ASSIST WITH HER CLAIM. THE FAILURE MILEAGE WAS 36,124.",
        "vin": "2C3CDXCT6FH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073181,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEB 15, 2018 AT ABOUT 2:00 P.M. MY VEHICLE WAS INVOLVED IN A COLLISION. MY SON WAS DRIVING ON A CITY STREET, AND REAR ENDED ANOTHER VEHICLE GOING ABOUT 25 MPH. THE FRONT BUMPER WAS DAMAGED AND THE FRONT AIR BAG DIDN'T DEPLOY. DUE TO THE EXTENT OF THE DAMAGE I BELIEVE THE AIR BAG SHOULD HAVE DEPLOYED.I AM LOOKING FOR HELP INVESTIGATING THIS.",
        "vin": "2C3CDXBG6FH"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058337,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.....FUEL TANK IS LEAKING WHILE ON THE ROAD AND PARKED. ALSO BREAKS ARE FLOORING",
        "vin": "2C3CDXBG1FH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052186,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RIMS ARE CORRODING FROM UNDER THE CLEAR FINISH.  THIS IS HAPPENING AROUND THE CENTER CAPS.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/26/2017",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048512,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ACCELERATES ON ITS ON, AND WHEN BARELY PRESSING THE GAS WHILE IN MOTION ON CITY STREETS AND HIGHWAYS.",
        "vin": "2C3CDXBG1FH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "11/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046901,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON START UP OF VEHICLE NO POWER STEERING, SERVICE POWER STEERING UNIT LIGHT CAME ON. NO PREVIOUS WARNING, NO NOISES, GOT THE CAR TO DODGE DEALERSHIP, THEY SAY IT IS ELECTRONIC POWER STEERING UNIT AND GEAR FAILURE. VEHICLE HAS 40,100 MI. ON IT. I HAVE AN EXTENDED WARRANTY, WAITING TO SEE IF IT IS GOING TO COVER A $3500.00 REPAIR",
        "vin": "2C3CDXHG6FH"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/08/2017",
        "dateOfIncident": "09/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044418,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 CHARGER IS HAVING POWER STEERING ISSUES. PROBLEM STARTED A FEW MONTHS AGO, WHEN THE CAR WOULD JERK TO EITHER SIDE AND THE ABS LIGHT WOULD COME ON. TOOK IT TO A DODGE DEALERSHIP AND WAS TOLD IT NEEDED A NEW POWER STEERING RACK. CAR WAS A YEAR OLD WHEN PURCHASED, AND A YEAR LATER, IS HAVING THIS MAJOR ISSUE. NOT SURE IF THIS IS A DEFECT, OR IF SOMEONE TRIED TO MODIFY CAR IN SOME WAY, OR IF THE PROBLEM OCCURRED BEFORE IT WAS PURCHASED BY ME AND THAT INFO WAS NOT DISCLOSED TO ME. THE CAR WAS USED AS A PERSONAL VEHICLE BY THE MANAGER OF THE DEALERSHIP, WHERE I PURCHASED THE CAR FROM,  AND WAS ONLY TOLD THAT INFORMATION AFTER I PURCHASED IT. I JUST WANT TO MAKE THIS ISSUE KNOWN, IN CASE OTHERS ARE HAVING THE SAME ISSUE.AGAIN, IN MY OPINION, THIS CAR IS TOO NEW TO HAVE THIS KIND OF ISSUE, SO SOON. ONLY 2 YEARS OLD.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043844,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT A TAKATA NOTICE IN THE MAIL SAYING I'M A REGISTERED OWNER OF ONE OF THEIR VEHICLES WITH THE TAKATA AIRBAG AND MY AIRBAG ALERT IS RED ON MY DASHBOARD BUT THERE'S BEEN NO RECALL. PLEASE INVESTIGATE WHETHER THERE NEEDS TO BE A RECALL.",
        "vin": "2C3CDXHG0FH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/25/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039896,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "2C3CDXBG3FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040248,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN OPEN RECALL ON MY CAR AND I DEMAND THAT THE MANUFACTURER BUY MY CAR BACK. THIS CAR COSTS ABOUT 30,000.00 AND I SHOULD NOT HAVE TO PAY FOR A DEFECTIVE CAR. THERE WAS NO INCIDENT YET...I JUST WOULD LIKE THE COMPANY TO DO THE RIGHT THING.",
        "vin": "2C3CDXFG9FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "10/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039348,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE A/C WENT OUT. GOT IT CHECKED OUT, MECHANIC SAID NO LEAKS OR ANYTHING OUT THE ORDINARY. RECHARGED IT WITH 1234YF. THE A/C WORKS BUT SEEMS TO STILL MAKE A LEAKING SOUND. THERE IS A GAS LIKE SMELL THAT COMES OUT THE VENT. PRETTY SURE A/C UNIT WILL GO OUT AG AIN.",
        "vin": "2C3CDXHG3FH"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2017",
        "dateOfIncident": "10/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033535,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL SPEED SENSOR FAILURE: DISABLES  TRACTION CONTROL, ABS, AND SPEED CONTROL. I JUST HAD A SECOND SPEED SENSOR FAIL IN 25,000 MILES. AS THERE ARE FOUR OF THEM IT IS PROBABLY JUST A MATTER OF TIME ALL WILL FAIL.... A CO WORKER OF MINE ALSO HAS A 2015 CHARGER SE AND SHE HAS HAD A WHEEL SPEED SENSOR FAIL AS WELL.. IN MY CASE BOTH INSTANCES OCCURRED WITHIN FIVE MINUTES OF STARTING THE CAR COLD AND DRIVING..",
        "vin": "2C3CDXBG4FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "09/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030043,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CRUISING IN 'DRIVE' IF THE OPERATOR PUTS THE SHIFTER IN 'NEUTRAL' IN ORDER TO COAST AND THEN THE VEHICLE IS BROUGHT TO A COMPLETE STOP, THE VEHICLE UNEXPECTEDLY BECOMES IMMOBILIZED WHEN PUT BACK INTO 'DRIVE'.  THE DASH THEN NOTIFIES THE DRIVER TO APPLY THE BRAKE AND CYCLE THE SHIFTER BACK INTO 'PARK' AND THEN BACK TO 'DRIVE' IN ORDER TO MOVE THE VEHICLE.  NOW MY CONCERN HERE IS THAT IF A DRIVER WERE TO FIND THEMSELVES IN AN EMERGENCY SITUATION (LIKE ON RAILROAD TRACKS WITH A TRAIN APPROACHING) THEY MAY PANIC AND NOT BE ABLE TO COMPLETE THIS PROCESS FAST ENOUGH IN ORDER TO MOVE THE VEHICLE TO SAFETY.",
        "vin": "2C3CDXGJ0FH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "01/30/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024720,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE VERY BEGINNING OF PURCHASING THIS VEHICLE, THE THROTTLE RESPONSE HAS BEEN AN ISSUE. IF YOU SLOW DOWN TO AN ALMOST STOP, OR STOP WITHOUT WAITING A CERTAIN AMOUNT OF TIME, THERE IS A DELAY IN THE VEHICLES ACCELERATION.  I HAVE ALSO HAD ISSUES UPON TRYING TO ACCELERATE QUICKLY, SUCH AS TRYING TO PASS ON THE FREEWAY, THE RPM'S WILL RUN HIGH BUT THE VEHICLE WILL NOT ACCELERATE, THUS HAVING TO LET UP ON THE GAS PEDAL AND PUSH IT AGAIN.  THIS HAPPENS ALMOST DAILY AND I HAVE HAD IT IN TO THE DEALER MORE THAN ONCE WITH NO RESOLUTION.",
        "vin": "2C3CDXCT7FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024724,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER VEHICLE REACHED 36,000 MILES, THE SUNROOF STOPPED FUNCTIONING PROPERLY. I WOULD HAVE IT IN VENT MODE, AND UPON PUSHING THE CLOSE BUTTON, IT WOULD IN TURN, GO TO FULLY OPEN MODE.  ALSO, WHEN FULLY OPEN, IT WOULD NOT CLOSE ON IT'S OWN AUTOMATICALLY AS IT SHOULD, I WOULD HAVE TO KEEP PUSHING THE BUTTON MULTIPLE TIMES TO GET IT TO THE POSITION WHERE IT WAS CLOSED AND SEALED.  I FOUND A METHOD TO RESET/RESOLVE THE ISSUE, BUT A SHORT TIME LATER, IT HAS DONE IT AGAIN.",
        "vin": "2C3CDXCT7FH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "07/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006228,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY CAR IS IN PARK AND ENGINE IS OFF MY DASHBOARD LIGHTS , SHIFTER LIGHT & BLOWER FOR AC/ HEAT STAY ON.  THEREFORE DRAINING THE BATTERY",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "04/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994375,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS A MARKED POLICE VEHICLE THAT WAS LEFT RUNNING AT THE SCENE OF AN INVESTIGATION.  DASHBOARD CAMERA VIDEO SHOWS THAT APPROXIMATELY 14 MINUTES AFTER IT WAS PARKED THE TRANSMISSION SLIPPED INTO REVERSE AND DROVE OFF, DOWN AN EMBANKMENT AND INTO A TREE.  AN INVESTIGATION WAS CONDUCTED BY FCA AND IN A LETTER BY MR. KON OF SPECIAL INVESTIGATIONS IT WAS NOTED THAT THE \"INSPECTION REVEALED THAT THERE WAS NO EVIDENCE OF A MALFUNCTION....\".  THIS WAS WRITTEN DESPITE THE FACT THE SITUATION WAS REPLICATED BY THE INVESTIGATOR IN THE PRESENCE OF ONE OF OUR CITY MECHANICS.  FURTHERMORE, MR. KON QUOTED THE OWNERS MANUAL AND STATED \"...YOU SHOULD NEVER EXIT A VEHICLE WHILE THE ENGINE IS RUNNING\" WHICH IS NOT AT ALL PRACTICAL FOR A POLICE VEHICLE.",
        "vin": "2C3CDXKT1FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "04/14/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990841,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SLOWING DOWN FROM ABOUT 40MPH TO ABOUT 20MPH TO MAKE RIGHT HAND TURNS, ENGINE SHIFTS VERY ROUGHLY FROM 3RD TO 2ND TO 1ST AND AFTER COMPLETING THE RIGHT TURN REMAINS STUCK IN LOW GEAR AND DOES NOT SHIFT AS ACCELERATOR IS PRESSED.  ALMOST STALLS, BUT AFTER A FEW SECONDS, THE NORMAL SHIFT PATTERN RESUMES.    THIS HAS HAPPENED INTERMITTENTLY A FEW OTHER TIMES, SUCH AS APPROACHING A RED TO GREEN TRAFFIC SIGNAL. WHEN APPROACHING RED LIGHT, I DECELERATE TO STOP BUT DON'T MAKE COMPLETE STOP AS LIGHT CHANGES TO GREEN, CAR DOWNSHIFTS INTO 1ST GEAR BUT WONT UPSHIFT SMOOTHLY INTO 2ND/3RD GEAR WHEN RE-ACCELERATING THE VEHICLE.",
        "vin": "2C3CDXHG6FH"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "05/08/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984301,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL JUST DIE WHILE DRIVING AT ANY SPEED AND RPM'S WILL JUST DROP OFF. SOMETIMES IT WILL COME BACK ON AS IT WERE IN NEUTRAL THEN GO INTO SECOND GEAR WHILE SHIFTER IS STILL IN DRIVE AND CAR JERKS AROUND AND LUNGES FORWARD. THIS HAS HAPPENED TO ME AT 10MPH - 60 MPH. IT HAS BEEN DOING IT FOR A FEW MONTHS.",
        "vin": "2C3CDXFG4FH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10971161,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS FAILED TO DEPLOY DURING SIDE IMPACT CRASH THE OTHER VEHICLES AIR BAGS DID DEPLOY.  ACCIDENT WAS IN A PARKING LOT BUT THERE WAS SIGNIFICANT SPEED, IMPACT AND DAMAGE. IMPACT WAS SUCH THAT IT PUSHED THE CHARGER SIDEWAYS OVER A CURB AND UP ONTO A GRASSY MEDIAN.  DRIVER HIT HEAD ON DOOR AND SUFFERED MILD CONCUSSION AND IS STILL SUFFERING HEADACHES AND BODY PAIN.  OUR CONTACT AT THE REPAIR SHOP EXPRESSED SURPRISE THAT THE AIR BAGS DID NOT DEPLOY AND ALSO THE SRS INDICATOR WAS NOT LIT.",
        "vin": "2C3CDXHG3FH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945066,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 12K TO 14K THE WHEEL MOTION SENSOR FAILED ON MY CAR CAUSING THE TRACTION CONTROL, ABS AND CRUISE CONTROL TO BE DISABLED.... IT WAS FIXED UNDER WARRANTEE.. A CO-WORKER WHO PURCHASED A 15 CHARGER RIGHT AFTER I PURCHASED MINE HAS NOTIFIED ME TODAY SHE HAD A WHEEL SENSOR FAIL AT 14,000.  THIS SEEMS TO BE CHRONIC.. IS THIS BEING LOOKED INTO...?",
        "vin": "2C3CDXBG4FH"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928927,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE AROUND 65-70 MPH ON THE FREEWAY WHEN I WENT TO STEP ON MY BREAK PEDAL THE VEHICLE DID NOT SLOW DOWN WHEN I WENT TO CHANGE LANES DUE TO THIS MY GS PEDAL WOULD NOT GO FASTER AFTER EITHER. A INDICATOR LIGHT APPEARED IN MY CLUSTER BUT I WAS UNABLE TO READ IT DUE TO MY PANIC OF LOOSING MY BREAKS AND GAS PEDAL. LATE THAT NIGHT I TOOK IT TO HUNTINGTON BEACH DODGE AND JEEP SERVICE AND SERVICE ADVISOR BOB SAID THAT THERE WAS A SYSTEM CODE THAT INDICATED LOSS SIGNAL TO BREAKS AND GAS PEDALS. THE REPAIR ORDER INDICATED THAT THE BREAK AND GAS PEDAL WAS NOT CALIBRATED PROPERLY CAUSING THE ISSUE. THIS IS GREAT CONCERN TO BEING THAT IT IS A SAFETY MATTER THAT CAN CAUSE A ACCIDENT OR THAT CAN RESULT IN GREAT BODILY INJURY OR DEATH. I HAD TOW FRIENDS IN THE CAR WITH ME AT THE TIME TOO.  *TR",
        "vin": "2C3CDXBG1FH"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/12/2016",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915524,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SAMIE ISSUE REPORTED ON 8/24/16 FOR TRANSMISSION JERKS AND SLIPS AS IT RUNS THROUGH GEARS WHEN CAR IS COLD.  ONCE WARM, IT DOESN'T DO IT AT ALL.  THE JERKS OR SLIPS ARE NOT SLIGHT EITHER, THEY ARE HARD AND DOESN'T MATTER HOW MUCH ACCELERATION THERE IS OR ISN'T...THE GEAR CHANGES ARE VERY NOTICEABLE AND JERKY!  DOESN'T MATTER IF YOU ARE DRIVING STRAIGHT, TAKING A TURN...ANYTIME YOU ACCELERATE IT SHIFTS VERY HARD!  I BOUGHT IT NEW ON 3/18/16 ALTHOUGH IT IS A 2015 SXT CHARGER...HAD LESS THAN 50 MILES ON IT BUT IS CURRENTLY SITTING AROUND 7000 MILES.  IT HAS DONE IT SINCE I BOUGHT IT FROM THE DEALER.  STILL DOES IT TO THIS DAY.  EVEN AFTER RUNNING FOR A FEW MINUTES VIA CAR STARTER.",
        "vin": "2C3CDXJG1FH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10910241,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. WHILE SITTING IN THE PARKED VEHICLE, THE CONTACT PLACED THE GEAR SHIFTER INTO DRIVE AND THE VEHICLE ACCELERATED ON ITS OWN. AS A RESULT, THE CONTACT'S VEHICLE CRASHED INTO THE PRECEDING VEHICLE. THE AIR BAGS FAILED TO DEPLOYED. A POLICE REPORT WAS FILED. INJURIES WERE SUSTAINED THAT REQUIRED MEDICAL ATTENTION. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 4,700.",
        "vin": "2C3CDXCT8FH"
    },
    {
        "components": "TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2016",
        "dateOfIncident": "08/24/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: 2015 DODGE CHARGER: CONSUMER STATED THE VEHICLE STALLLS, AND BECOMES UNRESPONSIVE WHILE MAKING A TURN. *SS",
        "vin": "2C3CDXCT0FH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898147,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 8 SPEED TRANSMISSION JERKS AND SLIPS DURING THE 1-2, 2-3 AND SOMETIMES IN THE 3-4 SHIFT.   THIS OCCURS UNTIL THE CAR HAS WARMED UP.  AFTER WARMING UP IT SHIFT AS IT SHOULD.  THIS OCCURS EVERY TIME THE CAR IS COLD AND BEING DRIVEN.    THE DEALERSHIP HAS TRIED TO CORRECT THIS MATTER AND HAS FAILED.",
        "vin": "2C3CDXJG1FH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2016",
        "dateOfIncident": "08/06/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894900,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ARRIVING HOME AFTER AN 800 MILE TRIP, (IN THE EVENING AROUND 10:30 PM) WHEN SHIFTING INTO REVERSE TO BACK INTO DRIVEWAY, I EXPERIENCED A COMPLETE ECU CONTROLLER FAILURE AND EVERYTHING WENT BLACK. AND ENGINE DIED. AFTER A FEW SECONDS IT APPEARS THE COMPUTER REBOOTED ITSELF AND THE DASH CAME BACK UP AND THE CAR RESTARTED. IT APPEARS THERE IS A REAL-TIME PROGRAM BUG IN THE CAR AND THE FIRMWARE NEEDS TO BE INVESTIGATED. HAD THIS HAPPENED ON THE ROAD, IT WOULD HAVE CAUSE A SERIOUS CRASH. I WAS THEN ABLE TO BACK INTO THE DRIVEWAY. NO ERROR CODE WAS POSTED! I BELIEVE THAT THE REALTIME SOFTWARE IS EXPERIENCING FRAME OVERRUNS AND WE KNOW THAT CAUSES RUNAWAY CONDITIONS LIKE IN THE TOYOTA CAMRY. I BELIEVE THE NHTSA SHOULD REVIEW EVERY CAR FIRMWARE BEFORE RELEASE TO INSURE SPARE TIME REQUIREMENTS ARE MET AND RUNAWAY CONDITIONS CAN NOT EXIST. (YES, I USED TO DEVELOP REAL TIME SOFTWARE FOR CONTROL SYSTEMS)",
        "vin": "2C3CDXEJ1FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2016",
        "dateOfIncident": "08/07/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893862,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MORNING AT 0710 (SUNDAY 8-07-2016) I WAS ON THE NORTH BOUND ROAD NAMED BRADSHAW (SACRAMENTO CA.), ABOUT 4 MILES SOUTH OF JFHQ (ARMY HEADQUARTERS 9800 GOETHE RD.) I WAS DRIVING AND OUT OF NOWHERE A MASSIVE EXPLOSION DROWNED OUT MY RADIO AND GLASS STARTED RAINING DOWN ON ME AND ALL OVER THE INSIDE OF MY CAR. I PULLED OVER TO THE SIDE OF THE ROAD AND PUT ON MY FLASHERS, THE SOUND WAS SO LOUD IT MADE ME DEAF LIKE I HAD MY BELL RUNG IN IRAQ. I COLLECTED MY SELF BECAUSE I WAS SHOOKEN UP AND REALIZED MY SUNROOF JUST EXPLODED FOR NO REASON. I STEPPED OUT OF MY VEHICLE TO GET THE GLASS OUT OF MY EYES AND OFF MY UNIFORM, THEN I INSPECTED THE ENTIRE CAR LOOKING FOR BULLET HOLES. I WAS ACTUALLY THINKING SOMEONE WAS SHOOTING AT ME BECAUSE OF HOW IT EXPLODED WHEN NO OTHER VEHICLES WERE ON THE ROAD AT THAT TIME. WHEN LOOKING AT THE CAR THE GLASS WAS ALSO ALL OVER MY ROOF AND STUCK IN THE GAP OF MY TRUNK LID AND POOLED AT THE BASE OF MY SPOILER. THE LOCATION OF WHEN THIS HAPPENED THERE ARE NO OVERPASSES OR PEDESTRIAN OVERPASS WALKWAYS. MAJORITY OF THE GLASS BLEW UP AND OUT OF MY CAR CAUSING DAMAGE TO THE PAINT ON MY ROOF AND TRUNK LID.",
        "vin": "2C3CDXEJ9FH"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "01/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10882058,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 DODGE CHARGER. WHILE THE VEHICLE WAS PARKED AND THE ENGINE WAS RUNNING, THE VEHICLE ACCELERATED, KNOCKED THE CONTACT DOWN, AND CRASHED INTO TREES. A POLICE REPORT WAS NOT FILED. THE AIR BAGS DID NOT DEPLOY. THE CONTACT WAS INJURED AND RECEIVED MEDICAL ATTENTION. THE VEHICLE WAS DRIVEN TO A REPAIR SHOP AND REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 10,000. UPDATED 10/06/16*LJ    THE CONSUMER STATED THERE WAS NO WARNING FOR WHEN THE DOOR WAS OPEN WHILE IN DRIVE. *JS",
        "vin": "2C3CDXCT0FH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/12/2016",
        "dateOfIncident": "04/09/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855007,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE FROM DODGE FOR SPARE TIRE JACK THAT COULD BEND BODY SIDE SILL DURING OPERATION. CONTACTED MY LOCAL DODGE DEALER IN REDLANDS FOR APPOINTMENT AND HAVE NEVER HEARD BACK FROM THEM. HOW DO I GET THIS RESOLVED IF THE DEALER WONT GET BACK TO ME?",
        "vin": "FH847489"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "03/13/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702044,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS RUST ON THE STEERING KNUCKLE NEAR THE U BALL JOINT NEAR THE FRONT SUSPENSION COILS NEXT TO THE FRONT TIRES. ALSO THE NAVIGATION AND UCONNECT ARE MESSING UP.  *TR",
        "vin": "2C3CDXCT7FH"
    }
]