[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11445396,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Our FIAT was rear-ended on October 20.  My wife suffered multiple critical injuries.  The  accident occurred in Manatee County Florida.  I have the accident report, a picture of the vehicle, and a reported recall of the vehicle for a seat problem that took place in Australia. There has been no recall in the U.S.  I will upload the relevant documents.   The company reports the front seat’s guide tracks may not comply to safety standards do to a manufacturing fault. If the guide tracks are faulty, the seat could suddenly shift backwards or forwards during a crash, which poses an increased risk of injury.",
        "vin": "3C3CFFER4FT"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443742,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Fiat 500. The contact stated that the interior door handles on the driver’s and passenger’s side front doors fractured making it difficult to open the door from the inside or outside of the vehicle. The local dealer was notified of the failure. The manufacturer was not yet contacted. The VIN was not available. The failure mileage was 55,000.        Consumer stated handles break too often causing allot of inconvenience and expense. Appointment to get both handles on the car fixed again for Jan 3, 2022.",
        "vin": "3C3CFFAR2FT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441646,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Fiat made their 500e vehicles (electric) and sold them off as a tax relief.   Unfortunately, many who have purchased this vehicles are experiencing similar issues.  The car dies and the main battery is dead (not the small battery that you can replace/charge - the big one).  Upon calling Fiat, they said it was covered under warranty - BUT- there is one part that is crucial to the install and the part costs $7,000.   Our car is not worth 7k.  We bought it for 10k four years ago and it has depreciated value.   When we appealed with Fiat - they would not budge.  We filed a claim for loss damages and it goes denied - twice. This is a known problem - many insurance companies and mechanics do not know how to process electric vehicles.",
        "vin": "3C3CFFGE0FT"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438712,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FIAT 500E VEHICLE BRAKING BEHAVIOR IS UNEXPECTEDLY HARD, SUDDEN, OR UNPREDICTABLE UNTIL THE USER USES AN OBD SCAN TOOL WITH APPROPRIATE DIAGNOSTIC SOFTWARE- AND INITIATES BRAKE CONTROLLER SENSOR RE-CALIBRATION. THIS OPTION IS FOUND UNDER THE DIAGNOSTIC MENU UNDER: ABS>RENENERATIVE BRAKE CONTROLLER>ACTIVE DIAGNOSTICS, AND THEN SELECTING THE PROCEDURE TO START (RBC SENSOR CALIBRATION). ONLINE FORUM USERS (PLEASE SEE LINK BELOW) ARE CURRENTLY USING 3RD PARTY SOFTWARE, AT THEIR OWN EXPENSE, TO CORRECT THE BRAKING DEFICIENCY (APPROXIMATELY $49). MY PERSONAL VEHICLE WAS PURCHASED USED AND WAS EXHIBITING SUDDEN AND UNEXPECTED BRAKING ISSUES AT APPROXIMATELY 8,500 MILES; THIS IS IN MY OPINION A VERY LOW NUMBER OF MILES TO BE EXPERIENCING REGENERATE BRAKING AND CONTROL ISSUES. PLEASE REFERENCE THE ONGOING DISCUSSION THREAD AT FIAT 500E ONLINE FORUMS: HTTPS://WWW.FIAT500OWNERS.COM/THREADS/FIX-GRABBY-BRAKES-FOR-70.149282/#POST-1292483",
        "vin": "3c3cffge5ft"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/18/2021",
        "dateOfIncident": "09/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433432,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request: High voltage battery system, the vehicle is available for viewing.  How was your safety or the safety of others put at risk?: Long time garage storage of vehicle and limited owners manual description on procedure to maintain high voltage battery during extended non use of vehicle.  Has the problem been reproduced or confirmed by a dealer or independent service center?: The problem has been reproduced and the vehicle is currently at a Fiat/Chrysler dealership.  Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others?: The component is currently under inspection, the vehicle has been at the Fiat/Chrysler since 8/11/2021, it is now 9/18/2021.  Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear?: Error message display on cluster stating HV battery unable to be charged.  General Description: Fiat 500e parked in closed garage for a year after following Fiat's Vehicle Storage instructions instruction shown pages 321 & 322 of the owners manual for the Fiat's electrical system. Returned after one year found Fiat's electric system a car went in fail mode. The instructions are limited and do not long term issues of fire danger in a enclosed  space like a garage and power outages or brown outs.   Fiat will not honor the vehicles warranty as the milage is a 42,625 and the warranty is only good up to 40,000 miles. The California Lemon Law does not cover this as well as it's as well.  I need help!",
        "vin": "3C3CFFGE2FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431825,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I am a retired master certified automotive technician. Ever since I bought this 2015 Fiat 500e [it is battery electric] in 2017 with NO warning all kinds of trouble/service lights will go on as the car shuts down & stops as if it was thrown into Park, & most of the time it does this it is at highway speeds on crowded L.A. freeways, which has become very close to getting me killed several times I have taken it to local dealers for this problem since shortly after I bought it in 2017, long before the bumper to bumper warranty expired. Most of the time the dealer reads/clears the codes, then parks it in a back lot for days, weeks, & months, then after a while tells me it's done & I can pick it up, but normally within 100 miles the exact same thing happens so I have to take it back to the dealer. Most recently it did not even make it off the dealers lot before it did it. The latest dealer I have been taking it to for this problems, [5 times in a few months] clearly doesn't know the car or what they are doing & is now brazenly lying on repair orders. They have also been claiming it had no problems or trouble codes when I brought it in, after the service writer read & printed out dozens of codes, which they promised to give me a copy of but then refused to give to me. Because this is the exact same problem covered by previous recalls on this car I believe dealers have charged for services & doing recalls that they did not do, because I marked the parts & see NO indication they changed the parts required or did the procedures required to perform the services claimed. This car has had the exact same dangerous problems covered by the recalls since I bought it & I must now pay dealers to service it even though the propulsion system is under warranty. At this point I believe this is brazen dangerous widespread fraud with the factories participation",
        "vin": "3c3cffge8ft"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2021",
        "dateOfIncident": "04/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419033,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2 Recalls R20 and S26",
        "vin": "3C3CFFGE0FT"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2021",
        "dateOfIncident": "05/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418124,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "the problem is: I can not charging, light indicator is red plug , charger indicate (charging) I can not shift gear to D or R , just accept shift to P and N  message warning : 1-service electric vehicle system , (yellow car) indicator lamp 2-service charging system (red plug) 3-service propulsion system",
        "vin": "3C3CFFGE0FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394973,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGAN LOSING CLUTCH, CLUTCH/BRAKE ASSEMBLY HAD THE 2 CONNECTING BOLTS BROKEN IN HALF. HAVE PICTURES. CLUTCH INTERLOCK ARRIVED BAD, BYPASSED IT; NOW THE POWER STEERING, ENGINE LIGHT AND EOS LIGHTS STAY ON.  CAR ENGINE DIED THEN CRANKED UP ON ITS OWN WHILE DRIVING 60MPH STATING HIGH TEMP (PULL OVER, TURN ENGINE OFF) - HAD BEEN IN THE CAR LESS THAN 1 MINUTE, JUST LONG ENOUGH TO GET TO 60 ON THE HIGHWAY. NOW CLUTCH INTERLOCK, AND BRAKE INTERLOCK MUST BE REPLACED.",
        "vin": "3C3CFFAR0FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2020",
        "dateOfIncident": "12/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384181,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE USING CRUISE CONTROL AND RESUMING OR INCREASING THE SPEED TO A HIGHER SPEED, THE TRANSMISSION SLAMS INTO GEAR INSTEAD OF TRANSITIONING.",
        "vin": "3C3CFFBR6FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374373,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS 37,000 MILES WHEN DRIVING ON THE FREEWAY VEHICLE GOT STUCK IN GEAR CAUSING A SAFETY CONCERN, LUCKILY I WAS ABLE TO MAKE IT HOME SAFELY WITH THE VEHICLE STUCK IN GEAR. THERE IS A RECALL ON MY VEHICLE THAT SAYS VEHICLE MAY GET STUCK IN GEAR, I WAS NEVER NOTIFIED OF THE RECALL BY FIAT, TOOK VEHICLE TO FIAT DEALERSHIP AND WAS TOLD IT HAS AN INTERNAL GEAR FAILURE INSIDE THE TRANSMISSION THAT IS NOT ASSOCIATED WITH THE RECALL AND THEY WILL NOT REPAIR IT EVEN THOUGH IN THE RECALL IT STATES VEHICLE CAN BECOME STUCK IN GEAR, FAILURE TO TAKE CARE OF THE RECALL CAN CAUSE TRANSMISSION FAILURE AND THE DEALERSHIP IS AWARE OF THIS HOWEVER THEY WILL NOT REPAIR THE VEHICLE THAT STILL RUNS BUT IS STUCK IN GEAR.",
        "vin": "3C3CFFAR4FT"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "10/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363384,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WORK AT AN INDEPENDENT AUTO REPAIR FACILITY. WE HAVE SEEN SEVERAL HEADLIGHT BULB CONNECTOR FAILURES WHERE THE CONNECTOR MELTS. WHEN THE CONNECTOR MELTS, THE LIGHT STOPS FUNCTIONING. THE REPAIR REQUIRES REPLACEMENT OF THE CONNECTOR AND THE BULB.",
        "vin": "3C3CFFJH1FT"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342338,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE FRONT DRIVER'S SIDE WINDOW DETACHED AND FELL INSIDE OF THE DOOR PANEL. THE VEHICLE WAS TAKEN TO FIAT OF SCOTTSDALE LOCATED AT 16301 N. 78TH ST, SCOTTSDALE, AZ 85260, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE WINDOW REGULATOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 44,000.",
        "vin": "3C3CFFFH0FT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "09/09/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330188,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A TOTAL OF 4 AND A HALF HOURS BACK HOME FROM A TRIP. MOST OF THE TRIP WAS VIA STRAIGHT FREEWAY. I WAS 2 HOURS IN WHEN THE CHECK ENGINE LIGHT STARTED BLINKING. I CALLED MY DAD WHO SAID TO PULL OVER IMMEDIATELY. I LET MY CAR GLIDE THROUGH THE EXIT THAT WAS COMING UP AND I NOTICED SMOKE FLOWING BEHIND MY CAR. I PULLED OVER AND GOT OUT TO SEE SMOKE COMING OUT OF THE HOOD. I OPENED THE HOOD AND DISCUSSED WHAT WAS HAPPENING WITH MY DAD. ALL OF A SUDDEN I HEARD A NOISE THAT SOUNDED LIKE A BLOW TORCH AND FLAMES CAME UP OUT OF THE ENGINE. I RAN ABOUT 50-100 METERS AWAY AND CALLED 911. QUICKLY, THE WHOLE HOOD WAS ON FIRE. THANKFULLY THE FIRE DEPARTMENT MUST HAVE BEEN CLOSE BY BECAUSE THEY WERE ABLE TO PUT OUT THE FIRE BEFORE IT GOT TOO FAR INSIDE THE CAR. THE WINDSHIELD MELTED AND SHATTERED. I FOUND GLASS STUCK ON MY PURSE AND HAT SITTING IN THE PASSENGER SEAT. I HAD TO THROW THEM AWAY AS I COULD NOT GET THE GLASS OFF. THE CAR WAS TAKEN TO A TOW YARD WHERE MY INSURANCE COMPANY INSPECTED IT. THEY COULD NOT FIND THE CAUSE FOR THE DAMAGE. SINCE THE CAR WAS A 2015 MODEL THAT I HAD PURCHASED NEW AND IT WAS 2018, I THOUGHT IT WAS STRANGE THAT THIS WOULD HAPPEN SO I HAD FIAT PICK UP THE VEHICLE AND INSPECT IT. THEY SAID THEY DID NOT FIND THAT THE FIRE WAS ASSOCIATED WITH MANUFACTURING OR ASSEMBLY ERROR. I THEN HAD MY INSURANCE COMPANY TAKE IT AND CLOSE THE CLAIM. STILL FIND IT STRANGE THAT A 3 YEAR OLD CAR SUDDENLY CAUGHT ON FIRE WITH NO WARNING. I'M GLAD I WAS ABLE TO MOVE OFF TO THE SIDE AND THAT I WASN'T IN THE CAR WHEN IT CAUGHT ON FIRE FULLY. THE CAUSE OF THE FIRE THOUGH IS STILL UNKNOWN.  *TR",
        "vin": "3C3CFFAR2FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327395,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO BROWNS FIAT LOCATED AT 483 NEW YORK-112, EAST PATCHOGUE, NY 11772, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE BATTERY WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN THE NHTSA CAMPAIGN NUMBER 16V303000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 39,483.",
        "vin": "3C3CFFGEXFT"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307609,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/5/2020, I LEFT MY HOME TO GO TO WORK. IT WAS A COLD MORNING IN SOUTHERN CALIFORNIA AND WHEN I GOT IN THE CAR AND TURNED IT ON A YELLOW SNOWFLAKE/ROAD APPEARED. IN THE 5 YEARS THAT I HAVE HAD THIS CAR, I HAVE NEVER SEEN THIS IMAGE APPEAR ON THE DASHBORD. I STARTED TO DRIVE THE CAR AND CALLED FIAT CHRYSLER TO INQUIRE ABOUT THE WARNING LIGHT. I SPOKE WITH A REPRESENTATIVE NAMED ASHLEY IN THE CALL CENTER. I TOLD ASHLEYT ABOUT THE WARNING AND SHE PLACED ME ON HOLD TO RESEARCH IT. SHE CAME BACK ON THE LINE AND THE WARNING MEANT I NEEDED TO PUT SNOW TIRES ON MY CAR BECAUSE OF THE WEATHER. I TOLD HER IN SOUTHERN CALIFORNIA WHERE I LIVE WE DON'T NEED SNOW TIRES BECAUSE IT DOES NOT SNOW. SHE THEN TOLD ME MY TIRES WERE COLD ALONG WITH THE OUTSIDE OF THE CAR AND UNDERCARRIAGE THEREFORE THE CAR WAS NOT SAFE TO DRIVE. I TOLD HER THE TIRES WERE LESS THAN A YEAR OLD AND NOTHING WAS WRONG WITH THEM. SHE THEN SAID IT WAS A SAFETY ISSUE. I SAID OK AND END THE CALL. AFTER THINKING FOR A BIT IT WAS UNSETTLING THAT I WAS DRIVING A CAR THAT WAS UNSAFE AS A FIAT REP INFORMED ME OF THIS SO I CALLED BACK TO START A BUY BACK WITH FIAT. I THEN SPOKE TO ANOTHER WHO INFORMED ME ASHLEY WAS NOT A MECHANIC AND SHOULD NOT HAVE TOLD ME THIS. I COULD NOT GET HER TO ACKNOWLEDGE IF THE CAR WAS SAFE TO DRIVE SO I ASKED HER TO HAVE A SUPERVISOR REVIEW THE CALL AND CALL ME BACK. I RECEIVED A CALL FROM MELISSA THE SUPERVISOR WHO ADVISED SHE REVIEWED THE CALL ASHLEY DID IN FACT TELL ME THIS BUT SHOUDL NOT HAVE THEREFORE IT'S A COACHING OPPORTUNITY FOR HER. I ASKED MELISSA TO SEND ME A LETTER CONFIRMING THE SAFETY OF THE CAR AND SHE WOULD NOT. I THEN INFORMED HER I WOULD CONTACT THE CALIFORNIA DEPT. OF CONSUMER AFFAIRS. THE SENSOR EVENTUALLY WENT AWAY ONCE THE CAR WARMED UP.",
        "vin": "3C3CFFGE6FT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298153,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500E. WHILE DRIVING AT 55 MPH, THE VEHICLE LOST MOTIVE POWER WITHOUT WARNING. THE VEHICLE WAS TOWED TO RENTON CHRYSLER DODGE JEEP RAM LOCATED AT 585 RAINIER AVE S, RENTON, WA 98057, (425) 430-1000 TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THERE WAS A LOSS OF POWER IN THE POWER INVERTER WHICH CAUSED THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TOWED BACK TO THE RESIDENCE. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V303000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 23,000.",
        "vin": "3C3CFFGE6FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297395,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I STOPPED IN A DRIVEWAY AND TRIED TO SHIFT INTO REVERSE.  THE CAR HAS A MANUAL 5 SPEED TRANSMISSION.  THE CAR WOULD NOT SHIFT INTO REVERSE.  THE ONLY 2 GEARS AVAILABLE WERE 3RD, NEUTRAL, AND 4TH. INVESTIGATION FOUND THAT ONE OF THE 2 SHIFT CABLES CAME OFF THE SHIFT LEVER ON THE TRANSMISSION.   THIS HAPPENED IN A DRIVEWAY, BUT COULD HAVE HAPPENED IN TRAFFIC, RESULTING IN NOT BEING ABLE TO MOVE THE VEHICLE.",
        "vin": "3C3CFFBR1FT"
    },
    {
        "components": "SEATS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "12/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286827,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FIAT 500. DRIVER SIDE WINDOW FAILED DUE TO BROKEN LIFT PLATE AT 37,561 MILES. NOW THE PASSENGER SIDE FAILS AT 40,001 MILES. DEALER CLAIMS NOT UNDER WARRANTY, NO TSB, 'SILENT WARRANTY' AND SAYS THE WINDOWS TYPICALLY FAIL ON A 4 TO 5 YEAR OLD CAR.",
        "vin": "3C3CFFAR3FT"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277185,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE RAN INTO TWO ISSUES WITH THE CAR. THE FIRST ISSUE WAS LAST YEAR THERE WAS AN ISSUE WITH THE COMPUTER INSIDE NOT WORKING WHICH IN TURN CAUSE ISSUES WITH THE BLUETOOTH, LIGHTING, AND DASHBOARD. THE MECHANIC SAID IT COULD IN TURN RESULT IN OTHER ISSUES AS WELL. WE RECENTLY STARTED THE CAR AND IT STARTED SHAKING, THE DASHBOARD WENT OUT, THE CHECK ENGINE LIGHT CAME ON, AND THEN THE POWER STEERING WENT OUT.",
        "vin": "3C3CFFAR9FT"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268427,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW DAYS AFTER NORMANDIN CHRYSLER DID A RECALL CLUTCH REPAIR, THE PASSENGER SIDE CONTROL ARM CAME LOOSE AT THE WHEEL CAUSING VEHICLE TO BE UNCONTROLLABLE AND RIGHT TIRE TO JAM INTO WHEEL WELL. I HAD JUST TURNED LEFT ONTO A ROAD FROM A DRIVEWAY. I HEARD A GRINDING SOUND AND PULLED THE CAR OVER. CV FLUIDS ON ROAD. AXEL DISCONNECTED AT BOTH ENDS.",
        "vin": "3C3CFFAR1FT"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267472,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FIAT 500 ABARTH. CONSUMER WRITES IN REGARD TO TIRE SAFETY ISSUES. CONSUMER STATES TIRES PRE-DATE MANUFACTURE DATE OF VEHICLE WITH VEHICLE BEING SOLD WITH TIRES IN THIS CONDITION (SEVERE CRACKING, DRY ROT). *AS  *JS",
        "vin": "3C3CFFFH0FT"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254911,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FIAT 500. CONSUMER WRITES IN REGARDS TO CRACKED AND DRY ROTTED TIRES ON VEHICLE. *LD    THE CONSUMER STATED THE DEALERSHIP KNOWINGLY SOLD A VEHICLE WITH POORLY WORN TIRES. *JS",
        "vin": "3C3CFFFH0FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "06/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219851,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SHIFT CABLE FOR THE TRANSMISSION BROKE LEAVING ME UNABLE TO ACCELERATE WHILE IN MOVING TRAFFIC ON A 4 LANE STATE HIGHWAY.  THE PART IS ON BACK ORDER AND I HAVE NOT HAD USE OF MY CAR FOR OVER A WEEK AND POSSIBLY UP TO A MONTH.",
        "vin": "3C3CFFJH3FT"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216938,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. ATER THE CONTACT PURCHASED THE VEHICLE, THERE WAS A CRACK ON THE FRONT WINDSHIELD ON THE DRIVER'S SIDE. FIAT AUTO GALLERY VAN NUYS (5711 VAN NUYS BLVD, VAN NUYS, CA 91401, (818) 593-0959) REPLACED THE WINDOW. THE FAILURE RECURRED FIVE TIMES SINCE THE INITIAL REPAIR. THE FAILURE RECURRED AND THERE AS A CRACK ON THE PASSENGER SIDE. THE MANUFACTURER RECEIVED PICTURES OF THE MOST RECENT WINDSHIELD CRACK, BUT WOULD NOT REPLACE THE WINDSHIELD FOR FREE SINCE THE WARRANTY HAD EXPIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3C3CFFBR9FT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207368,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A 4 LANE PARKWAY, WITH MY CHILDREN, AND THE CAR SUDDENLY WOULDN'T GO INTO ANY GEAR. UPON INSPECTION, THE CLUTCH WILL NEED TO BE REPLACED. THE CAR ONLY HAS 70,000 MILES ON IT AND HAS HAD ROUTINE MAINTENANCE.",
        "vin": "3C3CFFBR4FT"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193125,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RECALL WAS STOPPED AT 74 000 MILES AND NOW I NEED TO BUY A NEW CARE I HAVE AN OIL LEAK ON THE DRIVERS SIDE OF\\ENGINE BY THE CAM SEAL, ACTUATOR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/10/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176112,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I TURN THE HEADLIGHTS ON, THEY GO OFF. WHENEVER I TURN THE HEADLIGHTS OFF, THEY GO ON. BECAUSE OF THIS, THE BREAK LIGHTS DON'T WORK. WHEN DRIVING AT NIGHT I HAVE TO CHOOSE BETWEEN BREAK LIGHTS OR HEADLIGHTS. FIAT WANTS OVER $1000 TO FIX ONE MONTH AFTER WARRANTY.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169887,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK THE MANUAL TRANSMISSION WOULD ONLY GO INTO 3RD AND 4TH GEAR. NO WARNING LIGHT, NO PROBLEM LIGHT, NOTHING. JUST STOPPED AT THE ATOP SIGN AND WILL NOT GO INTO ANY GEAR OTHER THAN 3RD AND 4TH GEAR. THE CAR ONLY HAS 50,650 MILES.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169998,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT STATED THAT THE VEHICLE FAILED TO START INTERMITTENTLY WITHOUT WARNING. EVER SINCE THE VEHICLE WAS TAKEN TO ORANGE COAST ALFA ROMEO AND FIAT (LOCATED AT 2524 HARBOR BLVD, COSTA MESA, CA 92626, (714) 546-4511) TO BE REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN), THE VEHICLE FAILED TO START NUMEROUS TIMES. THE VEHICLE WAS TAKEN BACK TO THE DEALER TO BE DIAGNOSED, BUT A FAILURE CODE COULD NOT BE LOCATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 58,700.",
        "vin": "3C3CFFAR1FT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161123,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO AND OTHER ELECTRONICS WENT BLANK, WE CAME TO LOCAL DEALER TO FIX IT. THEY CHANGED IT AND IT STILL NOT WORKING,VERY WENT BACK THEY CHANGED IT AGAIN, STILL NOT WORKING, MADE 3 RD APPOINTMENT TO FIVE IT, LOOSING A FAITH THAT THEY EVER WILL FIX IT RIGHT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2018",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145096,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ONE OF THE SHIFT CONTROL CABLES CAME DETACHED FROM THE TRANSMISSION. (MANUAL TRANSMISSION) THIS LEFT ME WITH ONLY 3RD AND 4TH GEAR.",
        "vin": "3C3CFFAR8FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/29/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122608,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FIAT 500 POP. CONSUMER WRITES IN REGARDS TO PROBLEMS COMPUTER SYSTEM AND ACCELERATION. *LD    THE CONSUMER STATED THE CD PLAYER WAS INOPERABLE, THE REAR WIPERS STICK, THE GAUGES FLUCTUATE, AND THE FLOOR MATS WERE MISSING FROM THE VEHICLE. *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "04/16/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104455,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF TOTAL DASH DISPLAY AT ANY GIVEN TIME , HAVE TO DISCONNECT BATTERY FOR 5MINS RECONNECT TO REGAIN DASH BACK , THIS STARTED DAY 1 OF PURCHASE WHEN PULLING OFF THE CAR LOT .",
        "vin": "3C3CFFBR7FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/01/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099144,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHILE DRIVING APPROXIMATELY 25 MPH, THE ABILITY TO SWITCH GEARS BECAME VERY DIFFICULT. THE CONTACT STATED THAT THE FAILURE OCCURRED FOR APPROXIMATELY ONE YEAR AND NINE MONTHS, AND HAD WORSENED. ADDITIONALLY, THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN) AND STATED THAT THE MANUFACTURER FAILED TO REPAIR THE VEHICLE WITHIN A REASONABLE AMOUNT OF TIME. THE DEALER (BOB BAKER CHRYSLER JEEP DODGE RAM, 5555 CAR COUNTRY DRIVE, CARLSBAD, CALIFORNIA 92008) CONFIRMED THAT PARTS WERE NOT AVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS AFRAID TO DRIVE THE VEHICLE BECAUSE THE GEARS DID NOT ENGAGE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 60,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFAR5FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2018",
        "dateOfIncident": "04/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096929,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS IN MOTION ON A SURFACE STREET AFTER JUST LEAVING A 4-WAY STOP INTERSECTION.  THE CAR AUTOMATICALLY LEFT DRIVE AND WENT TO PARK.  THE MESSAGE ON THE THE DASH SAID \"BRAKING SYSTEM NEEDS MAINTENANCE.\"  EVERY TIME THE CAR WAS PUT INTO NEUTRAL IT SHIFTED ITSELF TO PARK. ELECTRIC CAR, I THINK IT IS THE ENGINE (POWER INVERTER).",
        "vin": "3C3CFFGEXFT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "11/27/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071966,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHILE DRIVING 60 MPH, THE CONTACT DETECTED AN ABNORMAL BURNING ODOR AND SMOKE COMING FROM UNDER THE HOOD. THE VEHICLE STALLED WITHOUT WARNING AND WAS TOWED TO CLASSIC CHRYSLER DODGE JEEP (111 I-20 EAST FRONTAGE RD, ARLINGTON, TX 76018, 682-226-6400). THE DEALER DIAGNOSED THAT THE CLUTCH BEARING NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND OPENED CASE NUMBER: 32948895. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT UNDER A WARRANTY OR RECALL. THE FAILURE MILEAGE WAS 84,191.",
        "vin": "ZFBCFAAH9FZ"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/04/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051593,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DASH GOES CRAZY TURNING ALL LIGHTS. OVER HEATING AND ESC RIGHT AFTERS IT TURNS OFF WHILE THE CAR IS ON THE GO LESS THEN 50 MILERS PER HOUR. I HAVE ALMOST CRASH TWICE DUE TO THE CAR STOPS COMPLETELY ON THE FREEWAY. DEALERSHIP HAS CHECK THE CAR 4 TIMES AND THEY CAN NOT GET IT TO BE FIX YET IN THE LAST PAST 2 MONTH. 11/30/17 FIAT SAYS IS CHECKING WHAT THEY CAN DO STILL I HAVE NOT RECEIVE AN ANSWER AND CHRYSLER HAS MY CAR FOR ALMOST 3 WEEKS AND STILL NOT DIAGNOSE AGAIN.",
        "vin": "3C3CFFFHXFT"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044553,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CHECK ENGINE AND TRANSMISSION INDICATORS ILLUMINATED WITHOUT WARNING. ON ONE OCCASION, THE VEHICLE STALLED WITHOUT WARNING WHILE DRIVING VARIOUS SPEEDS. THE VEHICLE WAS TAKEN TO FIAT OF MANHATTAN IN MANHATTAN, NEW YORK WHERE UNKNOWN ADJUSTMENTS WERE MADE TO THE VEHICLE, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 26,000.",
        "vin": "3C3CFFAR8FT"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/13/2017",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023341,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND ATTEMPT TO GET HELP AS I HAVEN'T HEARD ANYTHING FROM HERE EITHER THIS IS BEEN HAPPENING SINCE 03/21/2017 AND I HAVEN'T HEARD ANYTHING. MY CLUTCH KEEPS SKIPPING TO NUTRAL WHEN I'M ON THE FREEWAY DRIVING 65MPH , I NEED THIS TO BE RESOLVED, I BEEN HAVING THIS ISSU FOR THE PAST YEAR AND HALF.",
        "vin": "3C3CFFAR9FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000177,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MANY DIFFERENT THINGS HAVE GONE WRONG WITH THIS CAR STARTING AT THE FIRST 900 MILES.  THE CLUSTER THAT SHOWS YOU SPEED AND RPM WENT OUT AT 900 MILES WHILE DRIVING HOME FROM WORK MAKING IT HARD TO DRIVE.  IT TOOK THE DEALERSHIP TWO WEEKS TO FIX THIS PROBLEM. A COUPLE MONTHS AFTER THIS THE CHECK ENGINE LIGHT CAME ON FOR NO REASON, THE DEALERSHIP TOLD ME THAT THERE WAS NOTHING WRONG AND GAVE IT BACK TO ME. TWO WEEKS LATER THE CHECK ENGINE LIGHT CAME ON AGAIN AND THEN THEY SAID THAT THERE WAS A PROBLEM WITH SOMETHING RELATED TO THE CLUSTER.  THEY HAD MY CAR FOR A WEEK THIS TIME WHILE THEY REPAIRED THIS PROBLEM.  SIX MONTHS LATER A GENERIC LIGHT CAME ON THAT SOMETHING WAS WRONG WITH THE CAR, I BROUGHT IT IN AND AGAIN THEY SAID THERE WAS NOTHING WRONG WITH MY CAR. A YEAR AFTER I PURCHASED IT THE DAYTIME RUNNING LIGHTS WENT OUT AND I STARTED GETTING A WARNING TO CHECK THEM, THEY SAID THIS WASN'T COVERED AND WOULD NOT REPLACE THEM. AT ABOUT 65,000 MILES MY HEAD LIGHTS BURNED OUT WHILE I WAS DRIVING AND I HAD TO DRIVE 70 MILES AT NIGHT WITH NO HEADLIGHTS ON THE FREEWAY.  I REPLACED THESE MYSELF FOR $60.  THEN THREE MONTHS LATER MY HEADLIGHTS STOPPED WORKING AGAIN. THE LIGHTS WEREN'T BURNT OUT BUT THEY WERE LOOSE AND I HAD TO JIGGLE THEM TO GET THEM BACK.  AT THE SAME TIME THEY HAD A RECALL ON THE CLUTCH AND IT TOOK THEM A YEAR TO GET THE PARTS AND REPAIR THE RECALL AT 66,751 MILES. NOW AT 74,500 MILES THE CLUTCH HAS COMPLETELY GONE OUT WHILE I WAS DRIVING.  LUCKILY I HAD JUST GOT TO MY DESTINATION AND LEFT IT PARKED IN A PARKING LOT.  THE DEALERSHIP WANTS TO CHARGE ME $3,300 TO FIX THE CLUTCH.  THE CAR IS ONLY WORTH $6600 AND I OWE $13000.  ALSO I HAVE TRIED TO TRADE IT IN AND NO ONE WILL TAKE IT DUE TO ALL THE PROBLEMS THESE CARS HAVE. FIAT SHOULD BE BANNED FROM SELLING THESE CARS UNTIL THEY STOP TURNING OUT CRAPPY CARS.",
        "vin": "3C3CFFAR0FT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "03/21/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994579,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEN RECEIVING A RECALL NOTICE SINCE FEBRUARY OF 2016 AND BEEN CONTACTING MY DEALER FOR MY FIAT TO GET CHECKED EVER SINCE AND THEY KEEP TELLING ME THEIRS NO PARTS AVAILABLE. I HAVE RECENTLY CONTACTED THEM FOR THE PAST 3 MONTHS TO GET MY CLUTCH FIXED AS ITS BEEN JUMPING TO NEUTRAL WHEN I'M ON THE FREEWAY GOING 65-70 MILES PER HOUR AND I DON'T FEEL SAFE. ALL I HAVE RECEIVED FROM THEM IS NO PARTS AVAILABLE AND IF I WOULD LIKE I CAN TRADE MY CAR WITH $5000 DOWN. ONE I DON'T HAVE THAT KIND OF MONEY AND TWO I DON'T FEEL SAFE ON THE VEHICLE. I EVEN CONTACTED MY FINANCE TO GET HELP BUT THEY COULDN'T DO MUCH ABOUT IT. PLEASE HELP!",
        "vin": "3C3CFFAR9FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "05/10/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991412,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500 POP HATCHBACK. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS CONTACTED (TONY DOMIANO FIAT 900 SCRANTON CARBONDALE HWY EYNON, PA 18403, 866-766-1722) AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL AND THAT THEY RECEIVED A CERTAIN AMOUNT OF PARTS AT A TIME. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND STATED THAT THE CONTACT COULD LOCATE ANOTHER DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3C3CFFAR6FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2017",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986106,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS, MY CAR HAS SUDDENLY REVVED UP TO 6000 RPM, START JERKING AND REVVING UP; AND A RANDOM ERROR WILL POP UP ON THE DASH. WHEN THIS HAPPENS, IF YOU LET OFF OF THE BREAK THE CAR WILL AUTOMATICALLY SPEED UP TO 40 MPH WITHOUT PUSHING THE GAS PEDAL DOWN. SOMETIMES IT WILL HAPPEN WHILE DRIVING, AND SOMETIMES IT WILL START AS SOON AS THE CAR IS STARTED. IT DOESN'T MATTER WHAT KIND OF ROAD THE CAR IS ON. SOMETIMES THE CAR JUST JERKS AND DISPLAYS AN ERROR. THE MOST PREDOMINANT ERROR IS \"ESC OFF NO HILL START\". SOMETIMES IT SAYS \"COOLANT TEMP HIGH\". I HAVE TAKEN IT TO THE DEALERSHIP SEVERAL TIMES AND EVERY TIME I DO THEY SAY THEY ARE UNABLE TO \"RETRIEVE AN ACTIVE CODE OFF OF THE COMPUTER OR DUPLICATE THE PROBLEM.\" ONE TIME, THEY REPLACED THE COMPUTER IN THE CAR BECAUSE THEY READ HIGH VOLTAGE COMING OFF OF ONE OF THE CIRCUITS, BUT THE PROBLEM CONTINUED AFTER THAT. MY WIFE RECORDED A VIDEO ONCE WHERE IT COUNTED DOWN FROM 3 TO 1 AND THEN SUDDENLY REVVED UP. SHE ALSO SHOWED DIFFERENT VIDEOS THAT SHE HAD MADE OF IT AT DIFFERENT TIMES TO THE DEALERSHIP AND THEY JUST FLAT OUT SAID THEY DIDN'T KNOW WHAT WAS GOING ON.",
        "vin": "3C3CFFAR4FT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2017",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983644,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE SEE ATTACHED.  THIS LETTER WAS SENT TO THE NTSB.  THEY SENT US A FOLLOW-UP LETTER STATING THAT THE NHTSA WOULD NEED TO HANDLE THIS.  THEY ALSO INDICATED THAT A COPY OF OUR LETTER WAS SENT TO THE EXECUTIVE SECRETARIAT ON 4/27/2017.  THANK YOU",
        "vin": "3C3CFFBR2FT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/05/2017",
        "dateOfIncident": "04/27/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983762,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY CAR TO A DEALERSHIP BECAUSE THE CLUTCH STOPPED WORKING. MY CAR IS STILL UNDER WARRANTY. AFTER MY CAR WAS TAKEN TO A DEALERSHIP, THEY TOLD ME THERE HAS BEEN A RECALL ON MY CAR INVOLVING CLUTCH AND THAT THEY WILL REPLACED IT. THEY ALSO SAID IT WILL BE COVERED UNDER THE WARRANTY. THE NEXT DAY THEY CALLED ME AND TOLD ME THAT THE CAR IS STILL NOT WORKING BECAUSE THE PRESSURE PLATE IS WORN OUT AND NEEDS TO BE REPLACED. HOWEVER, THEY SAID PRESSURE PLATE IS NOT COVERED UNDER THE WARRANTY AND I WILL HAVE TO PAY FOR THIS PART PLUS LABOR. I ASKED CUSTOMER SERVICE REPRESENTATIVE IF IT IS POSSIBLE THAT THE PRESSURE PLATE DAMAGE WAS CAUSED BY THE RECALLED CLUTCH AND HE STATED NO, IT IS NOT POSSIBLE. (I BOUGHT A BRAND NEW CAR 1 YEAR AND 4 MONTH AGO AND ONLY HAS 24,000 MILES). I ASKED FOR A WRITTEN LETTER STATING THAT THE PRESSURE PLATE DAMAGE COULDN'T HAVE BEEN CAUSED BY THE RECALLED CLUTCH AND THEY REFUSED TO PROVIDE ME WITH ANYTHING IN WRITING. AFTER RESEARCHING ABOUT THE RECALL, IT APPEARS TO ME THAT THE 2 RECALLED PARTS ARE DIRECTLY CONNECTED TO A PRESSURE PLATE AND THEREFORE, COULD AFFECTED PRESSURE PLATE. I AM SEEKING HELP IN MAKING FIAT RESPONSIBLE FOR THE DAMAGE CAUSED BY THE RECALL. I HAVE BEEN UNSUCCESSFUL TO GET ANY STRAIGHT ANSWERS FROM THEM. FURTHERMORE, THEY NEVER SENT ME A RECALLED NOTICE AND IF MY CAR HASN'T BROKEN DOWN IN THE MIDDLE OF THE ROAD I WOULD NOT HAVE EVEN KNOWN ABOUT THE RECALL. I WILL ATTACH REPAIR INFORMATION. THE CAR BROKE DOWN WHILE MY HUSBAND WAS DRIVING. HE WAS UNABLE TO PRESS ON THE CLUTCH OR SHIFT GEARS AND HAD TO PHYSICALLY PUSH THE CAR OF THE ROAD.",
        "vin": "3C3CFFAR7FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/20/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979585,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHILE DRIVING, THE GEAR SHIFT BECAME STUCK IN REVERSE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 28,300.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "01/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970325,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPLACED 2 CONTIPROCONTACT 195/45/16 TIRES ON MY FIAT 500. BOTH DEVELOPED BUBBLES IN THE SIDE WALLS.  FIRST ON 1/30/2017 AT 16119 MILES. SECOND ONE  ON 3/22/2017 AT 18818. BOTH WERE THE FRONT WHEELS AND NOTICED CHECKING TIRE PRESSURE . REPLACED BOTH FOR SAFETY REASONS.  THIRD TIRE SEEMS TO BE DEVELOPING A BUBBLE AS WELL. I AM AT 19225 MILES NOW.  WORRIED FIRSTLY ABOUT SAFETY SECONDLY EXPENSES OF REPLACEMENT. ALL TIRES ARE ORIGINAL TO CAR BOUGHT NEW EXACTLY 1 YEAR AGO . THANKFULLY CAUGHT BEFORE ON THE ROAD.",
        "vin": "3C3FFBR3FT6"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/17/2017",
        "dateOfIncident": "03/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966451,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ARM REST SNAPPED APART WHILE DRIVER WAS ADJUSTING SEATING POSITION WITH ELBOW ON THE ARM REST. THERE IS A NOW SHARP METAL BAR PROTRUDING FROM THE PLASTIC INTO THE DRIVER ELBOW AREA. CHRYSLER/FIAT DEALERSHIP SAID THIS DEFECT WAS NOT COVERED UNDER WARRANTY AND WOULD COST $182 TO REPAIR. THIS SEEMS LIKE A MINOR SAFETY ISSUE THAT SHOULD DEFINITELY BE COVERED UNDER THE FIAT WARRANTY.",
        "vin": "3C3CFFAR3FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958404,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT STATED THAT THE INSTRUMENT PANEL FAILED TO ILLUMINATE. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE IT WAS REPAIRED BUT THE PARTS REPLACED WERE UNKNOWN. AFTER THE VEHICLE WAS SERVICED, THERE WAS AN ABNORMAL NOISE AND THE VEHICLE ACCELERATED WITHOUT WARNING. THE CONTACT ATTEMPTING TO STOP THE VEHICLE HOWEVER, THE BRAKES FAILED TO ENGAGE AND THE VEHICLE CONTINUED TO ACCELERATE. THE CONTACT STATED THE VEHICLE HAD A WARNING LIGHT HOWEVER WAS UNSURE WHAT THE WARNING LIGHT INDICATED. THE VEHICLE THEN STALLED AND WAS ABLE TO COME INTO A COMPLETE STOP. THE CONTACT DROVE THE VEHICLE TO THE DEALER BUT THE VEHICLE STALLED SEVERAL TIMES WHILE DRIVING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 8,000.",
        "vin": "3C3CFFBR1FT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2017",
        "dateOfIncident": "11/20/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949653,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FIAT SENT A SAFETY RECALL FOR MANUAL TRANSAXLE CLUTCH PEDAL IN NOVEMBER, AND AGAIN IN LATE JANUARY BUT WE MOVED TO ALASKA LAST SUMMER AND NOW LIVE IN JUNEAU, ALASKA WHICH IS ONLY ACCESSIBLE BY BOAT OR PLANE AND IS 500 MILES FROM THE NEAREST FIAT DEALER--EITHER IN BELLINGHAM, WA, OR IN ANCHORAGE, AK  NHTSA RECALL SITE SAYS THAT RECALL WAS ISSUED MAY 10 2016; HAD WE RECEIVED A RECALL NOTICE IN MAY OR JUNE, WE COULD HAVE HAD THE REPAIRS DONE IN ALBUQUERQUE, AS WE DID NOT LEAVE ALBUQUERQUE UNTIL JULY.  THERE IS A CHRYSLER DEALERSHIP IN JUNEAU, AND I CALLED THEIR REPAIR SHOP NUMBER, BUT DID NOT RECEIVE A CALL BACK.  I DON'T KNOW IF FIAT COULD SEND THE PART AND INSTRUCTIONS TO THEM TO DO THE REPAIR OR NOT AND FCA DID NOT OFFER THAT AS A SOLUTION; THEY WANT ME TO INCUR THE EXPENSE OF FERRY PLUS FUEL ETC. AND I'M NOT SURE THAT SHOULD BE MY RESPONSIBILITY",
        "vin": "3C3CFFAR1FT"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/03/2017",
        "dateOfIncident": "01/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939282,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I BOUGHT THE CAR A YEAR AGO I HAVE BEEN HAVING A PROBLEM WITH THE RADIO SUDDENLY INCREASING VOLUME TO MAXIMUM STARTLING ME.  THIS CAN HAPPEN WHEN I FIRST START THE CAR, WHILE DRIVING ON CITY STREETS OR HIGHWAYS, OR STATIONARY.  IT CAN HAPPEN JUST ONCE AT A RANDOM TIME OR MULTIPLE TIMES.  I HAVE CONTACTED THE DEALER ABOUT THE PROBLEM AND IT IS A KNOWN PROBLEM TO THEM.  THEY STATE THEY NEED A FIX FROM FIAT WHICH HAS NOT HAPPENED YET EVEN AFTER ALL THIS TIME.  THEY TOLD ME TO CONTACT FIAT AMERICA AND THEIR ATTITUDE WAS THAT IS WAS THE DEALER'S PROBLEM.  I JUST WANT THIS FIXED BEFORE I AM INVOLVED IN A SERIOUS ACCIDENT BECAUSE OF THE SUDDEN BLAST OF NOISE AT A BAD TIME.  IT APPEARS THE PROBLEM ONLY OCCURS ON RADIO STATIONS THAT DISPLAY ADDITIONAL INFORMATION BEYOND THE FREQUENCY.  THERE HAS BEEN NO CHANGES TO THE CAR SINCE I BOUGHT IT AND IT ONLY HAS 8700 MILES ON IT.  *TR",
        "vin": "3C3CFFAR0FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2016",
        "dateOfIncident": "11/30/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935632,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE FIRST DAY I BOUGHT THE CAR I HAVE BEEN HAVING DIFFICULTY IN SWITCHING TO THE 4TH GEAR. MOST OF THE TIMES I HAVE TO APPLY CONSIDERABLY MORE PRESSURE THAN OTHER GEARS TO SWITCH TO AND USE THE 4TH GEAR. I AM NOT SURE IF THIS IS RELATED TO THE PREVIOUSLY REPORTED CLUTCH PROBLEMS. I GOT A RECALL LETTER AND IS SCHEDULED TO GET MY CAR SERVICED SOON. I AM HOPING THAT THIS WILL ALSO FIX THE 4TH GEAR PROBLEM. THOUGH THERE IS A CHANCE THAT THIS IS A SEPARATE PROBLEM.  *TR",
        "vin": "3C3CFFAR2FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/23/2016",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927668,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT MADE AN APPOINTMENT WITH THE DEALER; HOWEVER, ONCE HE ARRIVED, THE CONTACT WAS INFORMED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3C3CFFBR3FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917537,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFAR5FT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916149,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SOFTWARE RECALL.",
        "vin": "3C3CFFGE8FT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913996,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 200C (NA). THE CONTACT EXPERIENCED SEVERAL ELECTRICAL FAILURES WITH THE VOICE RECOGNITION AND RADIO. ALSO, THE VEHICLE SHIFTED FROM DRIVE TO PARK AND THE VEHICLE WAS STILL MOVING EVEN THOUGH THE GEAR SHIFTER STATED IT WAS IN PARK. THE VEHICLE SEIZED IN THE DRIVE POSITION. THE FAILURES OCCURRED BETWEEN THE SPEEDS OF 30 TO 40 MPH. THE VIN AND FAILURE MILEAGE WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909936,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFBR8FT"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10908619,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER AND PASSENGER DOORS ARE HARD TO OPEN AND CLOSE.  TWICE, THE DOORS SPRUNG BACK WHEN OPENING, HITTING ME ONCE AND MY DAUGHTER ON ANOTHER OCCASION, BOTH TIMES NEAR THE EYE AREA.  MY DAUGHTER RECEIVED A SMALL BUMP ABOVE HER RIGHT EYE.  THE UPPER CORNERS OF THE DOORS SEEM TO BE SWEPT BACK AT A SHARPER ANGLE THAN MOST CARS.   THIS IS A LOANER BECAUSE OF THE TAKATA RECALL.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "03/27/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904825,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHILE ATTEMPTING TO ACCELERATE FROM A STOP, THE RPMS INCREASED, BUT THE VEHICLE DID NOT MOVE WITHOUT WARNING. THE CONTACT SWITCHED OFF THE IGNITION AND RESTARTED THE VEHICLE ON THE FIRST ATTEMPT; HOWEVER, THE FAILURE RECURRED. ON ANOTHER OCCASION, THE VEHICLE STALLED WHILE ATTEMPTING TO EXIT THE HIGHWAY. IN ADDITION, THE BLUETOOTH CAPABILITY FAILED. ONCE THE CONTACT WAS ABLE TO SAFELY PULL THE VEHICLE OVER, IT RESTARTED ON THE FIRST ATTEMPT. THE VEHICLE WAS TAKEN TO THE DEALER FOUR TIMES TO BE DIAGNOSED, BUT THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER RECOMMENDED A BUY BACK AS AN OPTION. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000.",
        "vin": "3C3CFFAR5FT"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/03/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904537,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE DOWN A MAIN STREET WHEN I FELT A CLUNK AND LOST CONTROL OF MY VEHICLE. NO ACCIDENT OR INJURY TO PERSON. I CALLED FOR A TOW TRUCK AS MY CAR WAS NOT DRIVABLE. THE TOW TRUCK DRIVER SAID IT LOOKED LIKE MY AXEL BROKE OFF. NOW FIAT DOES NOT WANT TO FIX THE CAR CLAIMING THAT IT CAN'T BE PROVEN TO BE MANUFACTURED DEFAULT. MY CAR HAS 16500 MILES AND IS STILL UNDER FACTORY WARRANTY.",
        "vin": "3C3CFFAR2FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903788,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHILE DRIVING BETWEEN 2 TO 15 MPH, THE GEAR SHIFTER WAS PLACED INTO THE DRIVE POSITION. WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO ACCELERATE. WHEN THE VEHICLE WAS TURNED OFF AND RESTARTED, IT OPERATED NORMALLY. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS DRIVEN TO THE DEALER AND REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 19,000.",
        "vin": "3C3CFFAR6DT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/02/2016",
        "dateOfIncident": "06/28/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A MANUAL TRANSAXLE CLUTCH RECALL THAT CAN CAUSE THE INABILITY TO SHIFT POSSIBLY RESULTING IN LOSS OF POWER.  THIS IS A SIGNIFICANT SAFETY ISSUE BUT FIAT HAS NO PARTS AVAILABLE TO FIX THE PROBLEM.  AFTER TWO CALLS TO FIAT, THE MOST RECENT ON 9/2/2016, THERE IS NO DATE AVAILABLE FOR PARTS AVAILABILITY AN NOTHING THEY CAN DO TO ADDRESS THE RESULTING SAFETY ISSUE. WE ARE ALL SUPPOSED TO WAIT AND HOPE FOR THE BEST.",
        "vin": "3C3CFFAR6FT"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899190,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT HAS TO DO WITH A SAFETY RECALL SENT TO ME FOR MY CAR (FIAT 500 POP, 2015), DATED BACK IN JUNE. THIS HAS NOT BEEN ADDRESSED, AND I'VE NOT BEEN PROVIDED A FIX IN A REASON TIME (IT'S ALMOST SEPTEMBER), AND I FIND IT DIFFICULT TO BELIEVE THAT THE PARTS ARE STILL NOT YET AVAILABLE, WHEN IT STATES THAT THE ISSUE \"MAY RESULT IN THE INABILITY TO DISENGAGE THE CLUTCH, SHIFT GEARS, AND/OR LOSS OF MOTIVE POWER . . . WHICH COULD CAUSE A CRASH WITHOUT WARNING.\" AM I SUPPOSED TO KEEP DRIVING AROUND MYSELF AND MY 11 YEAR OLD SIMPLY HOPING IT DOESN'T HAPPEN? FOUR TO SIX WEEKS IS MORE THAN ENOUGH TIME FOR A LARGE COMPANY TO FIX THIS. IT'S BEEN OVER 2 MONTHS WHICH I FIND UNACCEPTABLE FOR A NEW CAR GIVEN THE ADMITTED POTENTIAL FOR A CRASH HAPPENING. I WANT A PROPER FIX FOR THIS AND CONTACT ABOUT WHEN IT'S GOING TO HAPPEN, OR FURTHER STEPS TO TAKE.",
        "vin": "3C3CFFAR5FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898685,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CLUTCH SPRING HAS BEEN RECALLED AND STATES THAT IT CAN STOP WORKING WITHOUT WARNING AND CAUSE ME TO HAVE AN ACCIDENT. I CONTACTED MY SERVICE CENTER AND THEY TOLD ME THEY DO NOT HAVE A FIX FOR THE PROBLEM AND THEY HAVE NO FUTURE DATE OF IF THEY WILL HAVE A FIX. WHICH MAKES MY CAR UNFIXABLE UNSAFE TO DRIVE AND SUPER DANGEROUS TO DRIVE.IN TRAFFIC WHICH I DO EVERYDAY",
        "vin": "3C3CFFAR8FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2016",
        "dateOfIncident": "05/10/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895430,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "S34 RECALL TAKING EXCESSIVE TIME    MAY 10TH - S34 RECALL PUBLICLY ANNOUNCED, AFFECTED POWER TRAIN, THEREFORE A FIX IS VITAL TO SAFETY AND URGENT  JUNE 28TH - LETTER RECEIVED FROM FIAT STATING THAT PARTS WERE NOT AVAILABLE TO FIX.  JULY 10TH - SINCE IT WAS 2 MONTHS SINCE THE RECALL WAS ANNOUNCED, CALLED FIAT TO ASK WHEN PARTS/A FIX WOULD BE IN PLACE. WAS TOLD THAT THEY DID NOT KNOW WHEN/IF PARTS WOULD BE AVAILABLE AND THAT THE NEED FOR A RECALL WAS ONLY IDENTIFIED BY FIAT IN LATE JUNE 2016 SO IT WASN'T URGENT YET.  AUGUST 12TH - 3 MONTHS SINCE THE NEED FOR THE RECALL WAS PUBLICLY ANNOUNCED, STILL NO PARTS AVAILABLE, STILL NO NEWS FROM FIAT ON WHEN/IF PARTS WOULD BE AVAILABLE.    NO PHYSICAL INCIDENT AS YET, BUT THE RECALL IS TAKING AN EXCESSIVE AMOUNT OF TIME, AND SINCE THE RECALL IS TOLERANCE/FATIGUE BASED EACH TIME THE VEHICLE IS DRIVEN INCREASES THE POTENTIAL OF AN INCIDENT.",
        "vin": "3C3CFFBR1FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894163,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3C3CFFARXFT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2016",
        "dateOfIncident": "06/05/2016",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888450,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 FIAT 500. WHILE THE VEHICLE WAS BEING TOWED BY A 2002 E450 RV DRIVING APPROXIMATELY 35 MPH, THE CONTACT NOTICED SMOKE AND FLAMES COMING FROM THE VEHICLE WITHOUT WARNING. THE CONTACT IMMEDIATELY PULLED INTO A NEARBY FIRE STATION WHERE THE FIRE WAS EXTINGUISHED. A FIRE REPORT WAS FILED. THERE WERE NO INJURIES. THE VEHICLE WAS BURNED EXTENSIVELY AND DECLARED TOTALED BY THE INSURANCE COMPANY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. LESS THAN TWO MONTHS LATER, THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN). THE FAILURE MILEAGE WAS 18,000.",
        "vin": "3C3CFFAR5FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885542,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT STATED THAT THE VEHICLE INDEPENDENTLY SHIFTED OUT OF GEAR WHILE DRIVING VARIOUS SPEEDS. THE FAILURE OCCURRED WITHOUT WARNING. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS NOT PROVIDED. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 09/22/16*LJ    *CN",
        "vin": "3C3CFFAR7FT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882560,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V302000 (POWER TRAIN); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS INVALID. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.....UPDATED 08/29/16 *BF  UPDATED 08/31/16.*JB",
        "vin": "3C3CFFBR3FT"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "11/25/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864621,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHILE DRIVING 65 MPH, THE FRONT PASSENGER SIDE HUBCAP DETACHED FROM THE WHEEL. THE FAILURE RECURRED ON NUMEROUS OCCASIONS WITH ALL THE HUBCAPS ON THE VEHICLE DETACHING. THE VEHICLE WAS TAKEN TO MULTIPLE DEALERS WHO WERE UNABLE TO DIAGNOSE OR REPAIR THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 25,000.",
        "vin": "3C3CFFAR3FT"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/08/2016",
        "dateOfIncident": "03/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845553,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHEN STARTING THE VEHICLE, THE AIR BAG SAFETY RESTRAINT LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE SRS WIRE COMING FROM THE DRIVER SEAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,803.",
        "vin": "3C3CFFBR4FT"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "01/04/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821308,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. WHILE DRIVING AT UNKNOWN SPEEDS, THE CONTACT CRASHED INTO THE REAR END OF ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO A DEALER AFTER THE CRASH, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 4,500.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788410,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. THE CONTACT STATED THAT THE VEHICLE SHIFTED OUT OF DRIVE INTO NEUTRAL WHEN THE ELECTRICAL SYSTEM OVERHEATED. THE CONTACT WAS ABLE TO MOVE ONTO THE ROAD SHOULDER, RESTART THE ENGINE, AND THE VEHICLE RESUMED NORMAL OPERATION AFTER THE ENGINE COOLED DOWN. THE DEALER ADVISED THE CONTACT TO SHIFT THE GEAR INTO NEUTRAL MANUALLY WHEN THE BURNING ODOR EMITTED OR THEY COULD REPROGRAM THE ELECTRICAL SYSTEM; HOWEVER, IT WOULD NOT PERMANENTLY CORRECT THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 17,000.",
        "vin": "ZFBCFACH6EZ"
    },
    {
        "components": "SUSPENSION,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/25/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759232,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES DID NOT ENGAGE THE FIRST TIME IN ORDER TO STOP THE CAR FOR PARKING SPACE. IT HAPPENED AGAIN THE FOLLOWING DAY WHERE I TRIED TO HOLD THE BRAKE PEDAL TO THE FLOOR AND NOTHING!!! I RETRIED AGAIN A SECOND TIME AND TOO LATE CAR WAS HIT TWICE IN THE FRONT DESTROYING WHOLE FRONT END. CAR WAS PURCHASED BRAND NEW. I HAVE CONTACTED FIAT HQ TO FURTHER INVESTIGATE THIS DEADLY SAFETY ISSUE.",
        "vin": "3C3CFFBR5FT"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "06/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745170,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR ON MAY 22, 2015. LESS THAT A WEEK LATER I  NOTICED A LIGHT ON DASH DISPLAY FOR THE TIRE PRESSURE WITH A  MESSAGE STATING \"TIRE PRESSURE MONITORING UNAVAILABLE.\" I TOOK IT BACK TO THE DEALERSHIP. THE SERVICE DEPT. WORKED ON THE VEHICLE AND STATED IT WAS REPAIRED. NOT 15 MINUTES AFTER DRIVING OUT OF DEALERSHIP THE LIGHT WAS BACK ON. I CALLED THE SERVICE DEPT. AND WAS TOLD TO BRING IT BACK IN. DURING THE NEXT APPOINTMENT THE SERVICE MANAGER STATED HE HAD FOUND THE PROBLEM. HE STATED IT WAS A MODULE THAT NEEDED TO BE ORDERED. I HAD TO WAIT FOR DELIVERY OF THIS PART FOR 3 WEEKS. WHEN I TOOK THE CAR BACK, THEY REPLACED THE MODULE AND THE CAR WAS FINE. THREE WEEKS LATER, THE LIGHT AND MESSAGE WERE BACK ON. THERE IS NOT EVEN 1000 MILES ON THE CAR YET. I AM LOOKING AT OTHER OPTIONS FOR REMEDY.",
        "vin": "3C3CFFAR1FT"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2015",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726162,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FIAT 500 ABARTH 2015  AFTER DRIVING THE CAR FOR ABOUT 30 MIN. I PARKED THE CAR AND AFTER RETURNING TO LEAVE I STARTED THE CAR BACKING OUT OF PARKING SPACE AND THE ENGINE JUST DIED. TRIED TO START IT 3 TIMES WITH NO CRANKING SOUND. PUT THE CAR IN NEUTRAL AND PUSHED THE CAR BACK INTO PARKING SPACE. 5 MINUTES LATER STARTED THE CAR WITH NO PROBLEM. THE ENGINE LIGHT WAS ON BUT NOT BLINKING. I DECIDED TO REMOVE THE GAS CAP AND PUT IT BACK ON. THE ENGINE LIGHT STAYED ON FOR ABOUT A DAY AND THEN WENT OUT. CALLED THE DEALERSHIP FOR AN APPOINTMENT.. THE DIAGNOSE WAS A FAILED INTAKE BRICK AND REPLACED THE INTAKE ACTUATOR. THEN DID A PCM FLASH, FLASH, PERFORMED PCM SOFTWARE UPDATE/ THEN A TCM FLASH, FLASH, PERFORMED TCM SOFTWARE UPDATE.",
        "vin": "3C3CFFFH4FT"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "06/12/2015",
        "dateOfIncident": "02/18/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725059,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BLUETOOTH DISPLAY SAFETY ISSUE.  A MONTH AFTER PURCHASING A NEW 2015 FIAT 500 ABARTH, THE DISPLAY FOR BLUETOOTH / BLUE&ME STOPPED WORKING ON THE CENTRAL CLUSTER DISPLAY. (I.E. NO INFO DISPLAY WHEN A CALL COMES IN, NO ACCESS TO PHONEBOOK).  TOOK THE CAR TO THE DEALER WHO RESET IT.  WORKED FOR ABOUT A MONTH AND FAILED AGAIN, SO TOOK IT BACK TO THE SAME DEALER WHO REPLACED THE CTM (CONVERGENCE TELEMATICS MODULE).  THE NEW CTM THEN CAUSED INTERFERENCE TO THE SATELLITE RADIO, SO NOTIFIED THE DEALER.  WAITED A WEEK AND NO RESPONSE, SO DECIDED TO CALL SIRIUSXM MYSELF FOR SIGNAL RESET.  ALL GOOD FOR ANOTHER MONTH UNTIL THE BLUETOOTH DISPLAY FAILED AGAIN FOR THE THIRD TIME.  SO BASICALLY SAME PROBLEM EVERY MONTH SINCE PURCHASE AND PER THE DEALER, THERE ARE SIX OTHER FIATS AT HIS DEALERSHIP WITH THE SAME ISSUE AND CANNOT BE FIXED.  TALKED TO MY CASE MANAGER AT FIAT CORPORATE CUSTOMER SERVICE WHO SAID THEY ARE LOOKING INTO IT.  ANOTHER MONTH HAS PASSED BY AND STILL NO RESOLUTION TO THIS MATTER. IT IS IMPORTANT TO UNDERSTAND THAT THIS IS A SAFETY ISSUE BECAUSE WHEN THE STEERING WHEEL BUTTON FAILS AND STOPS DISPLAYING INCOMING CALL INFO ON THE CLUSTER, ONE HAS TO LOOK AT THE PHONE TO SEE WHO IS CALLING, WHICH TAKES ATTENTION OFF OF THE ROAD - EXACTLY WHAT THE DISPLAY SYSTEM IS DESIGNED TO PREVENT.",
        "vin": "3C3CFFFHXFT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723210,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FIAT 500. AFTER THE VEHICLE WAS STARTED, THE STEERING WHEEL CONTROLS AND SPEEDOMETER BECAME INOPERABLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE SYSTEM NEEDED TO BE RESET. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 350.",
        "vin": "3C3CFFCR6FT"
    }
]