[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "Dutchmen Manufacturing, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233272,
        "products": [
            {
                "manufacturer": "Dutchmen Manufacturing, Inc.",
                "productMake": "DUTCHMEN",
                "productModel": "VOLTAGE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE FOUND SEVERAL STRUCTURAL FRAME MEMBERS WITH SUBSTANDARD WELDS. WE HAVE EVEN FOUND ONE WALL FRAME MEMBER THAT HAS COMPLETELY SEPARATED FROM THE FLOOR FRAME. ALL OF THESE ARE HIDDEN AND CANNOT BE SEEN WITHOUT REMOVING BODY PANELS. ADDITIONALLY WE HAVE NUMEROUS PLACES IN SIDE WALLS THAT ARE DELAMINATING CAUSING A LOSS OF STRUCTURAL STABILITY. WE HAVE CONTACTED THE MANUFACTURER TO REQUEST WARRANTY REPAIRS.  KEYSTONE HAS DENIED ALL REPAIRS.",
        "vin": "4YDF39931FZ"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "03/31/2018",
        "fire": false,
        "manufacturer": "Dutchmen Manufacturing, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092530,
        "products": [
            {
                "manufacturer": "Dutchmen Manufacturing, Inc.",
                "productMake": "DUTCHMEN",
                "productModel": "VOLTAGE",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW FROM THE DEALERSHIP, THE LIPPERT BRAKES HAD NOT BEEN ADJUSTED TO SEAT THE SHOES INTO THE DRUM.  I HAD A LOCAL HORSE TRAILER DEALERSHIP ADJUST AND SEAT EACH OF THE 4 BRAKES PRIOR TO OUR FIRST TRIP, AS WELL AS CHECK THE HUBS.  NO GREASE WAS ADDED; THE EXISTING GREASE APPEARED IN GOOD CONDITION, AND THE DRUMS WERE SHINY AND DRY.  WE DROVE OVER DONNER SUMMIT WITHOUT INCIDENT.  THE 2018 ONE TON TOW RIG HAS AN EXHAUST BRAKE, SO BRAKING ON THE DESCENT WAS MINIMAL.  AFTER PASSING THROUGH RENO, BEFORE CARSON CITY I NOTICED THE TRAILER PUSHING THE TRUCK AND TESTED TRAILER BRAKING BY APPLYING THE TRAILER BRAKES ONLY, WHICH IS POSSIBLE WITH A THUMB LEVER ON THE GM FACTORY INTEGRATED BRAKE CONTROLLER. THE TRAILER BRAKES WERE ALMOST IMPERCEPTIBLE.  AT OUR DESTINATION JUST SOUTH OF CARSON CITY I REMOVED THE RUBBER INSPECTION GROMMITS AND COULD SEE GREASE COATING THE DRUMS.  THE NEXT DAY I HAULED THE TRAILER TO BOB'S PERFORMANCE CENTER IN GARDNERVILLE AND HAD IT FURTHER INSPECTED.  HIS TECHNICIAN LOOKED AT THE CHINESE LIPPERT BACKING PLATES (BRAKE ASSEMBLIES) AND SAID \"WE SEE THESE PIECES OF [XXX] BLOWING SEALS ALL THE [XXX] TIME?. FUNNY IF IT WASN'T PUTTING MY FAMILY AT RISK.  THEY ALSO POINTED OUT TO ME THAT THE SCOTCH LOCK ELECTRICAL CONNECTORS USED TO WIRE MY BRAKES HAD A LARGE GAUGE WIRE COMING FROM THE FRAME BUT A TINY GAUGE WIRE LEADING TO THE BRAKE MAGNETS.  THEY OPENED ONE AND SHOWED ME HOW THEY ARE NOT DESIGNED TO CONNECT SUCH DIFFERENT WIRE DIAMETERS AND TESTED THE AMPERAGE AT THE MAGNETS, WHICH WAS BELOW SPEC (1.8 AMPERES INSTEAD OF 3 AT FULL BRAKING). RATHER THAN KEEP MY KIDS OUT OF SCHOOL AND WAIT FOR APPROVAL FROM THE NOTORIOUSLY UNSCRUPULOUS RV MANUFACTURER, KEYSTONE/DUTCHMEN, I FOLLOWED THE ADVICE OF THE SHOP TECHS AND REPLACED THE ENTIRE ASSEMBLIES WITH AMERICAN MADE COMPONENTS AND ALSO HAD THEM RE-WIRE USING CRIMPED BUTT-CONNECTORS IN PLACE OF THE SCOTCH LOCKS. *TT  VIN IS INVALID CONSUMER STATED AXLES ARE NOT VENTED. UPDATED 9/20/18*JB *DT  *JB *DT THE CONSUMER CLAIMS THAT NO ONE ADDED ANY GREASE TO THEM AT THE INSPECTION, YET THOSE GREASE SEALS FAILED.*JB    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4YDF36025FZ"
    }
]