[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2021",
        "dateOfIncident": "07/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426157,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "We have a 2015 Coachmen Freelander 21R RV (with a Ford F-350). Recently, while driving on the freeway a car near us kicked up some debris. This went under the RV and within 30-60 seconds after we heard a loud explosion/boom. My husband immediately pulled over and we were thinking it was blown front tire but just as he pulled over we noticed a large cloud of white \"smoke.\" The \"smoke\" turned out to be propane coming from our propane tank. Later he crawled under the RV and found a large hole in the tank. It appears that whatever hit it was hard enough to create a large hole in it and therefore causing the explosion. Fortunately, that was the only damage and no injuries were sustained. The reason for my email is that we were very surprised to see that there was no protective cage/rock guard around the propane tank to keep debris from damaging the tank. I personally think it's a design flaw and that any propane tank accessible from the side and but located under the RV should have some sort of protection around it. If that \"cage\" had existed, we wouldn't have experienced such a close call with a fire and possibly more. Thank you for your consideration.",
        "vin": "1FDWE3FS6ED"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166090,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SCHOOL BUS WAS STOPPED AT A RAILROAD GRADE CROSSING, TRANSMISSION WAS IN DRIVE, WHEN DRIVER ATTEMPTED TO MOVE THE SCHOOL BUS FORWARD IT WOULD NOT MOVE, THE TRANSMISSION WOULD NOT ENGAGE IN ANY FORWARD OR REVERSE GEAR.  SCHOOL BUS WAS TOWED TO THE FORD DEALERSHIP FOR REPAIR.",
        "vin": "1FDEE3FL5FD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A SCHOOL BUS CARRYING STUDENTS WITH 29956 MILES.  WHEN STOPPED AT A RED LIGHT AT A BUSY INTERSECTION THE BUS WOULD NOT MOVE FORWARD.  DRIVER ATTEMPTED TO SELECT DIFFERENT GEARS FROM THE DRIVE GEAR, 3,2,1 AND REVERSE.  THE SCHOOL BUS WOULD NOT SHIFT INTO ANY GEAR.  ANOTHER BUS WAS DISPATCHED AND STUDENTS TRANSFERRED.  THIS IS A VERY DANGEROUS SITUATION AT A BUSY INTERSECTION.   FORD FOUND THAT THE COAST CLUTCH SPRING AND SNAP RING BROKEN.  THIS IS THE 3RD BUS WE OWN THAT HAS HAD THIS ISSUE.",
        "vin": "1FDEE3FL0FD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970579,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD HAS STARTED TO CRACK ON THE LEFT (DRIVER'S) SIDE. THERE IS NO INDICATION OF IMPACT. THE CRACK STARTS ABOUT 2 FEET UP AT THE EDGE OF THE GLASS, EXTENDS ACROSS THE WINDSHIELD A FEW INCHES AND THEN TURNS DOWN. IT HAS CONTINUED TO SLOWLY GROW. I BELIEVE THIS IS A DEFECT - POSSIBLY STRESS RELATED. I HAVE SEEN DOZENS OF OTHERS REPORTING THE SAME PROBLEM.",
        "vin": "1FC3E3KS1FD"
    },
    {
        "components": "SUSPENSION,STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790650,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD E-350. THE CONTACT STATED THAT THE MODIFICATIONS DESIGN OF THE MOTOR HOME WAS OVERWEIGHT ON THE REAR AXLE. WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE SWAYED SIDE TO SIDE INDEPENDENTLY AND THE STEERING WHEEL WAS DIFFICULT TO MANEUVER WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE REAR AXLE WAS OVERWEIGHT AND NEEDED AIR SHOCKS AND THE WHEEL FLAPS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. IN ADDITION, THE CONTACT MENTIONED THAT WHEN THE VEHICLE WAS STARTED, THE FUEL CAP AND CHECK ENGINE SOON WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL NOZZLE HOLDER WAS FRACTURED AND THE FUEL FILLER PIPE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 57.",
        "vin": "1FDWE3FS9FD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "06/23/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744202,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/23/15 ONE OF OUR VANS HAD THE REAR STRAP HOLDING THE FUEL TANK BREAK AND DROP THE REAR OF THE TANK TO THE ROAD. THE VAN IS CONVERTED TO 4X4 BY QUADVAN IN PORTLAND BUT NO MODIFICATION IS MADE TO THE FUEL SYSTEM AND IT WAS SOLD BY A FORD DEALER BRAND NEW. OUR LOCAL FORD DEALER HERE FIXED THE STRAP BUT PROBABLY WITH THE SAME PART.  YESTERDAY 7/27/15 OUR SECOND OF TWO VANS WE BOUGHT AT THE SAME TIME HAD THE SAME THING HAPPEN.  THE FIRST TIME WAS ON A WASHBOARD SECTION OF MAUNA KEA MOUNTAIN WHERE WE RUN TOURS AT APPROX 15MPH, THE SECOND INCIDENT WAS ON HIGHWAY AT APPROX 35 MPH ON THE WAY TO MAUNA KEA MOUNTAIN.  WE ARE VERY EXPERIENCED MECHANICALLY AND NOTE THAT UNIQUELY FORD IS USING AN ALLOY FINAL ATTACHMENT TO THE FRAME WHEREAS OUR PREVIOS DOZENS OF FORD VANS HAVE ALL USED A STEEL FINAL ATTACHMENT. IN 25 YEARS WE HAVE HAD NO SUCH PROBLEM WITH OUR MANY MANY FORD VANS.  AS ANY LATEST MODEL FORD VAN IN THE NOW DISCONTINUED E350 SERIES COULD HAVE THIS PROBLEM IF DRIVEN ON ROUGH ROADS WE FEEL IT IS AN INHERENT FAULT AND SHOULD BE SUBJECT OF A RECALL. A WORST CASE SCENARIO IS THAT THE FRONT OF THE TANK DROPS AND CONTACTS THE ROAD CAUSING A FIREBALL AND IMMOLATION OF ALL ONBOARD..!!  WE HAVE CONTACTED NEWBERG FORD IN PORTLAND OREGON AND ARE IN CORRESPONDENCE WITH THEM TO LET FORD KNOW.",
        "vin": "1FBSS3BS4ED"
    }
]