[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459439,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "My water pump went out with 0 warning.  Not even a low coolant light came on.  I checked the coolant noticed it was a little low, went to work and on my way home from work my car overheated;  again with no low coolant light or warning. I was smart enough to crank the heat in order to keep engine cool and by the time I got home, my car was chuckling.  I was worried I may have cracked the head.  I had to have the car towed ($150) and the water pump repair was ($2300).  In all my years of automotive, I've never heard of a water pump repair cost this much. Googling the part is roughly $380 but because its chain driven its an 11 hr repair. I have copies of the invoice and towing but not with me at the moment.",
        "vin": "1FAHP2E88FG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "08/29/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated while driving at an undisclosed speed, the vehicle hit a pothole and started shaking while driving. The vehicle was taken to an independent mechanic who repaired the wheel bearing; however, the failure persisted. The contact stated while driving at various speeds, the rear end of the vehicle was shaking significantly, almost causing her to lose control of the vehicle. The contact stated that she could only drive at slower speeds in order to not lose control of the vehicle. The vehicle was taken to the dealer and was test driven. The dealer diagnosed that the rear toe links were severely damaged and needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure and informed the contact that they could not assist as the VIN was not included in NHTSA Campaign Number: 20V072000 (Suspension). The failure mileage was approximately 80,000.",
        "vin": "1FAHP2E86FG"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11457683,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated that while driving into a parking space, the vehicle suddenly accelerated when the brake pedal was depressed. The contact indicated that the vehicle erroneously accelerated  and crashed into a nearby building. During the incident, the front end of the vehicle was severely damaged but the airbags did not deploy. The front passenger sustained a back injury that required medical treatment. A police report was taken at the scene and the vehicle was towed away. The cause of the failures were not determined. The manufacturer and local dealer were not notified of the incident.  The failure mileage was 14,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown,  car \"sways\" when hitting bumps, cracks in the road and when braking.",
        "vin": "1FAHP2E82FG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454823,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated upon having the tires rotated on the vehicle, the independent mechanic informed her that both the rear driver's side toe link and the rear passenger's side toe link were fractured. The contact notified an unknown dealer, who informed her that there were unknown recalls associated with the failure; however, her VIN was not included. The vehicle was not repaired. The manufacturer was notified of the failure. The failure mileage was approximately 139,000.",
        "vin": "1FAHP2H89FG"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453859,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated that while driving in the rain at various speeds, the vehicle would stall as the \"check manual\" and wrench warning light would illuminate on the instrument panel. The contact had taken the vehicle to the dealer on two separate occasions and each time the dealer was unable to duplicate the failure. The manufacturer was notified of the failure and provided a case number. The contact was then referred to the NHTSA for assistance. The vehicle had yet to be repaired and remained in the possession of the dealer. The failure mileage was approximately 42,000.",
        "vin": "1fahp2e85fg"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449844,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I was not notified from Ford about the serious safety recall on my 2015 Ford Taurus. I'd like to have this safety concern fixed immediately so I don't end up in a severe auto accident. I can drop my vehicle off. I've never had this happen and I'm nervous to drive the vehicle. I have noticed a difference in the way it drives please help get this sorted out with my local Ford Dealership in Fort Myers, FL. Thank you!",
        "vin": "1FAHP2L87FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "03/16/2021 Was the purchase date. The battery was pretty much dead when we took it in for its first oil change (about a month after purchase), they may still have record of it. The check engine light has been on since June. The front head light wiring was faulty, not sure if the person has any record of it. But I can ask that finally got fixed in December. The check engine light was only read at the auto store. Unfortunately due to me losing my job, the cobuyer (my fiancé) has been responsible for all bills and we can’t afford to have it looked at in depth. We purchased a limited warranty when we got the car, but every time we contacted them. They were rude and very put off. They made it seem like we were the issue and not the car. And they NEVER let us bring it in to have it looked at. We are paying almost $475 for a car that has had major problems since purchasing it.",
        "vin": "1FAHP2F81FG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "12/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446776,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Both Rear tow links and knuckle replaced",
        "vin": "1FAHP2E84FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "11/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439236,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Fuel pump control module failure. No start intermittent. Could have been stuck 5 hours away if it would've been a week earlier. No warning lights or indications previously.",
        "vin": "1fahp2d84fg"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432941,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's fiancé owns a 2015 Ford Taurus. The contact stated while his fiancé was driving approximately 35 MPH, the steering wheel seized. The contact stated that the power steering assist fault warning light was illuminated. The vehicle was not drivable. The driver towed the vehicle to the local dealer, where it was diagnosed with needing the steering gear and rack and pinion to be replaced. The vehicle was not repaired but was pending repairs. The manufacturer had been informed of the failure. The failure mileage was 110,717.",
        "vin": "1FAHP2F81FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430186,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated that while driving at unknown speeds, the service vehicle soon warning light illuminated and the vehicle began to violently shake and stall. The contact managed to coast the vehicle off the freeway into a parking lot where the contact turned off and restarted the vehicle and the engine was still running. The vehicle resumed normal operation prior to the failure. The vehicle was having a service check for the oil change at an independent mechanic who diagnosed the vehicle, however, was unable to duplicate the issue. The vehicle then was taken to the dealer where a second diagnostic test was performed, and it was determined the throttle body actuator failed and needed to be replaced. The vehicle was repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 38,000.",
        "vin": "1fahp2e82fg"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428299,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated the rear-view camera was pointing to the ground and was unable to visually see or use properly. The contact stated an unknown warning light was illuminated. The contact called the local dealer and made them aware of the failure. The vehicle was not repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 27,000.",
        "vin": "1FAHP2E83FG"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424653,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated that after placing the vehicle into reverse and reversing out of the parking spot, she became aware that the rear-view camera image was not working and was showing a blank screen. A message appeared on the screen suggesting to please contact the manufacturer. The vehicle was not diagnosed nor repaired. The manufacturer was made aware of the failure. The failure mileage was 79,488.",
        "vin": "1fahp2e86fg"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424660,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated while attempting to start the vehicle, the vehicle would not start. The contact stated that she attempted to get a jump start however, the vehicle still would not start. The contact stated there was no warning light illuminated. The vehicle was then towed to a local dealer where it was diagnosed with the fuel pump module and the battery needing to be replaced. The vehicle was not repaired. The contact was relating the failure to NHTSA campaign number: 16V621000 (Fuel system, Gasoline). The manufacturer had been informed of the failure and informed the contact to call back after the vehicle was diagnosed. The failure mileage was approximately 67,000.",
        "vin": "1FAHP2F81FG"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423646,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "my vehicle suddenly has a wrench light pop up and the car stalls out.  still runs but wont accelerate . this has happened three time to me on the interstate.  took car to 3 separate mechanics and no codes were coming up. the car always starts up after it turned off but this is very dangerous.  i couldve been killed.",
        "vin": "1FAHP2D88FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423364,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving with my wife on the highway on June 26th, 2021. As I was going around a turn to the right I had a warning come up saying to service advance trac. Right as that happened my steering wheel locked up straight almost causing me to crash. I do not know what could have caused this. I have gotten both my battery and alternator checked and they both are completely fine. I am getting my recall taken care of on Thursday July the 6th so it will be looked over then to see what may have been the cause of it but a toe link would not cause something like this to happen.  Ive asked family members that have been mechanics for over 10 years that don’t know what could have caused that to happen.",
        "vin": "1FAHP2KT0FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422731,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown",
        "vin": "1FAHP2E84FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419920,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Taurus. The contact stated while her husband was driving 40 MPH, the vehicle stalled without warning. The contact's husband had to physically push the vehicle to the side of the roadway. The vehicle was towed to an independent mechanic. The independent mechanic initially diagnosed the vehicle with a defective fuel pump. The fuel pump was replaced however, the failure recurred twice after the replacement. On the third failure, the modulator was replaced due to the modulator over heating the fuel pump. Upon investigation, the mechanic informed the contact of NHTSA Campaign Number: 16V621000 (Fuel System, Gasoline) however, the VIN was not included. The manufacturer was notified of the failure and confirmed that the VIN was not under recall. The vehicle was repaired. The failure mileage was approximately 100,000.",
        "vin": "1FAHP2F80FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT PULLED OFF TO THE SIDE OF THE ROADWAY AND RESTARTED THE VEHICLE TO RESUME NORMAL DRIVING. ADDITIONALLY, THE CONTACT ALSO STATED THAT THE VEHICLE FAILED ON SEVERAL OCCASIONS TO START-UP AFTER MULTIPLE ATTEMPTS. DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED TO AN INDEPENDENT MECHANIC WHERE THEY DISCOVERED THAT THE VEHICLE HAD A DEFECTIVE FUEL PUMP WHICH THE CONTACT HAD REPLACED. HOWEVER RECENTLY, WHILE DRIVING 44 MPH THE FAILURE RETURNED AND THE VEHICLE STALLED WITHOUT WARNING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED HIM THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). NO FURTHER ASSISTANCE WAS PROVIDED. THE VEHICLE WAS NOT YET REPAIRED. THE FAILURE MILEAGE WAS 73,436.",
        "vin": "1FAHP2E80FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404784,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE THE POWER WENT OFF ON MY CAR WHILE DRIVING ON THE HIGHWAY.  I WAS LUCKY TO BE ABLE TO PULL OFF THE ROAD.  WAITED A FEW MINUTES AND GOT POWER BACK.    THE CAR MAKES NOISE WHEN GOING DOWN THE ROAD, AND I HAVE ALWAYS BEEN TOLD THAT THE FORD TAURUS DOES THIS.  THEY SAID NOTHING WAS WRONG.  THE NOISE IS WHERE YOU WONDER IF YOU ARE SAFE, AND PROBABLY WOULD NEVER FIND A BUYER FOR THE VEHICLE.    THE CAR SOUNDS LIKE AN ELECTRICAL PROBLEM SOMETIMES FROM THE RADIO, AND WHEN I USE THE PHONE.  WEIRD.    THE BLUE LIGHTS ON THE DASH BOARD CAN BE BLINDING.  HAD MY EYES CHECKED BY A SPECIALIST AND NOT MY EYES.    ONE TIME I HAD LEFT MY CAR RUNNING IN PARK IN THE DRIVEWAY AND WHEN WALKING AROUND TO THE OTHER SIDE OF THE CAR, THE CAR ROLLED OUT OF MY DRIVEWAY AND DAMAGED THE DOOR ON THE GARAGE DOOR.      OBVIOUSLY THE CAR LOSING POWER TWICE ON A HIGHWAY IS A SERIOUS ISSUE.  THIS HAPPENED TWO YEARS AGO, AND TWO MONTHS AGO WAS THE SECOND TIME.",
        "vin": "1FAHP2F88FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2021",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397151,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY (395 SOUTH). CAR JUST STALLED. NO POWER NOTHING. ALMOST CAUSED ACCIDENT. I WAS LUCKY TO PULL ON THE THE SHOULDER. I AM FAMILIAR WITH THE ISSUE OCCURRED ON LINCOLN/ FORD. EVEN THOUGH THERE IS RECALL FOR CERTAIN MODELS FOR FUEL PUMP RELAY MODULE, FORD DENIES IT AND PUT MY LIFE AND OTHERS IN DANGER. MY WIFE CAME PICKED ME UP AND WENT AUTOPART STORE AND GOT THE PART, INSTALLED IT. BACK ON THE ROAD...",
        "vin": "1FAHP2E83FG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395568,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, AN ABNORMAL GRINDING CAME FROM THE VEHICLE WITHOUT WARNING. THE CONTACT THEN RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V692000 (POWER TRAIN) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT HAD TAKEN THE VEHICLE TO KUNES COUNTRY FORD OF ANTIOCH (104 IL-173, ANTIOCH, IL 60002) WHERE AN INSPECTION WAS PERFORMED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS SAFE TO BE DRIVEN HOWEVER, THE NOISE PERSISTED. THE CONTACT MADE MULTIPLE ATTEMPTS TO REACH THE MANUFACTURER HOWEVER, EACH ATTEMPT WAS UNSUCCESSFUL. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1FAHP2F9XFG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "12/22/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395478,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WILL JUST CUT OFF IN THE MIDDLE OF NOWHERE WANT CRANK THE GAS HAND WILL GO UP AND IT WILL SAY IT DOESN'T HAVE GAS THEN I TURN THE CAR OFF LET IT SIT THEN THE GAS HAND WILL GO UP .I CAN LET THE CAR RUN IT CAN BE ON A HALF TANK THEN LET IT RUN ABOUT 10MINS THEN ITS ON EMPTY TANK OF GAS.. IT WILL JUST STOP IN THE STREET",
        "vin": "1FAHP2E89FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "01/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390677,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT WHILE ATTEMPTING TO START THE VEHICLE, THE VEHICLE FAILED TO START. THE CONTACT HAD REPLACED THE FUEL PUMP MODULE. THE VEHICLE BEGAN TO FUNCTION PROPERLY. THE VEHICLE HAD NOT BEEN TAKEN TO A DEALER OR CERTIFIED MECHANIC. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT THE VIN WAS NOT UNDER RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 114,000.",
        "vin": "1FAHP2F8XFG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/25/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389880,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING OUT FROM A RED LIGHT MY CAR STALLED. NO WARNING LIGHTS. 2 DAYS LATER IT WOULD NOT START. FOUND IT TO BE THE FUEL RELAY MODULE THAT IS RECALLED ON OTHER MODELS BUT NOT MINE.",
        "vin": "1FAHP2E82FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "01/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387582,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED THE CAR AFTER WORK AND THE NEXT MORNING IT WOULDN'T START. NO WARNING, NO CHECK ENGINE LIGHTS OR ANYTHING. I HAVE TO HAVE THE CAR TOWED TO THE DEALERSHIP AND FIND OUT 3 DAYS LATER IT IS THE FUEL PUMP DRIVER MODULE.  WHY WOULDN'T I GET ANY WARNING THIS WAS GOING OUT?",
        "vin": "1FAHP2E83FG"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387281,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TOE LINK",
        "vin": "1FAHP2KTXFG"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386586,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLS WHEN I'M DRIVING AND TURNS OFF. NO CHECK ENGINE LIGHT ON",
        "vin": "1FAHP2E85FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384645,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM SEMI SKILLED TECHNICIAN CURRENTLY WORKING ON WALSER TOYOTA BLOOMINGTON. I GOT A RECALL LETTER CALLED 20S04, AND I TOOK MY CAR TO INVER GROVE FORD MN. AFTER I GOT THE SERVICE MY CAR START TO CREAT WEIRD MOTION AND UNUSUAL VEHICLE HANDLING IN HIGHWAY SPEED AND LOCAL SPEED.SOMETIMES HARD TO CONTROL THE VEHICLE. I TOOK IT BACK TO INVER GROVE FORD AND THEY TOLD ME THE STABILIZER LINK WORN. I REPLACED IT BY MY SELF AND THE PROBLEM IS STILL THERE. EVEN GETTING WORST EVERY DAY.",
        "vin": "1FAHP2MK5FG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383554,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAULT 81000 MILES. 2015 FORD TAURUS LIMITED",
        "vin": "1FAHP2F89FG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383300,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WHILE ATTEMPTING TO DRIVE. NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TOWED TO KOONS STERLING FORD (46869 HARRY BYRD HWY, STERLING, VA 20164) AND WAS DIAGNOSED THAT THE FUEL PUMP FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FAHP2D86FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383404,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON THE HIGHWAY USING ADAPTIVE CRUISE CONTROL IT WILL SHUT OFF AND SAY 'COLLISION WARNING NOT AVAILABLE/ ADAPTED CRUISE CONTROL NOT AVAILABLE' IT IS INTERMITTENT BUT HAS NOT BEEN WORKING FOR 2 DAYS NOW. AS WELL AS IF NOT WORKING NORMAL CRUISE CONTROL DOESN'T WORK.",
        "vin": "1FAHP2KT8FG"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374903,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK WHEN WITHOUT WARNING MY CAR TRACTION LIGHT CAME ON INDICATING STEERING ASSIST FAULT I ONLY HAD THE CAR FOR 3 MONTHS WHEN IT HAPPENED NHTSA ID# 10095995 MY COMPLAINT # 11374607 COMPONENTS: ELECTRONIC STABILITY CONTROL,ELECTRICAL SYSTEM,STEERING MANUFACTURER COMMUNICATION # 46210,47638*DT  CONSUMER STATED VEHICLE IS NOT ON RECALL LIST, FEELS IT SHOULD BE.*JB",
        "vin": "1FAHP2D80FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374912,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED WHILE DRIVING 60 MPH, THERE WAS AN ABNORMAL SOUND COMING FROM THE ENGINE WITH THE TRACTION WARNING LIGHT ILLUMINATED. ADDITIONALLY, THE STEERING WHEEL WAS FIRM AND DIFFICULT TO TURN. THE VEHICLE WAS TAKEN TO AUTO PARTS STORE TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ELECTRONIC POWER STEERING AND RACK AND PINION WAS DEFECTIVE. THE CONTACT WAS INFORMED THAT THE RACK AND PINION NEEDED TO BE REPLACED. THE CONTACT WAS REFERRED TO AN AUTHORIZED DEALER FOR THE REPAIRS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,553.",
        "vin": "1FAHP2D80FG"
    },
    {
        "components": "STEERING,SUSPENSION,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374607,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY I WAS DRIVING DOWN THE ROAD TO WORK AND MY LIGHTS STARTED BLINKING ON AND OFF SAYING STEERING FAULT SERVICE NOW. I LITERALLY JUST GOT THE VEHICLE IN APRIL OF 2020 AND THIS ALL STARTED IN JUNE.",
        "vin": "1FAHP2D80FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374310,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CUSTOMER STATED VEHICLE STALLED OUT WHILE DRIVING DOWN THE ROAD FROM HER HOUSE AND WOULD ONLY CRANK WITHOUT STARTING AFTERWARDS.  NO DIAGNOSTIC TROUBLE CODES STORED IN VEHICLE. VIN IS NOT COVERED UNDER THE CURRENT FUEL PUMP CONTROL MODULE RECALL.",
        "vin": "1FAHP2E83FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362765,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 10 MPH AFTER MOVING OFF FROM A TRAFFIC LIGHT, THE VEHICLE JERKED WHILE THE ACCELERATOR PEDAL WAS DEPRESSED HOWEVER, THE VEHICLE DECELERATED INDEPENDENTLY. THE RPM DECREASED AND THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL PUMP MODULE FAILED AND NEEDED TO BE REPLACED. THE CONTACT STATED THE VEHICLE WAS REPAIRED. THE CONTACT CONTACTED YANKEE FORD (165 WATERMAN DR, SOUTH PORTLAND, ME 04106, (207) 799-5591) AND WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE 75,100.",
        "vin": "1FAHP2KT4FG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER DRAIN BLOCKAGE CAUSED WATER POOLING IN INTERIOR FRONT PASSENGER SIDE OF CAR. CAR WAS PARKED OUTSIDE IN ASSIGNED PARKING SPACE AND AT THE TIME THERE WERE A COUPLE OF WEEKS OF EXCESSIVE RAINS DURING THE MONTH OF AUGUST 2020",
        "vin": "1FAHP2F86FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TRYING TO START MY CAR THIS MORNING, THE VEHICLE WOULD TURN OVER BUT WOULDN'T START. I LEARNED OF A RECALL THAT AFFECTED OTHER 2015 TAURUS' FOR THE FUEL CONTROL PUMP MODULE AND REPLACED THE PART WITHOUT ANY FURTHER ISSUE. MY VEHICLE HOWEVER STATED NO RECALLS WHEN SEARCHED BY VIN. VEHICLE WAS STATIONARY IN PARKING LOT. NO MECHANICAL CODES WERE SHOWING EITHER, VEHICLE WOULD JUST TURN OVER BUT NOT START.",
        "vin": "1FAHP2H83FG"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343478,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD, ALL OF A SUDDEN MY POWER STEERING LOCKS UP WITH A DEFAULT MESSAGE. THIS HAPPENED DRIVING STRAIGHT DOWN THE CITY ROAD GOING 40MPH.",
        "vin": "1FAHP2F8XFG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343010,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED IN A PARKING LOT AND WOULD CRANK, BUT NOT START RANDOMLY. THERE IS A RECALL FOR THIS PART ON OTHER 2015 FORD TAURUS, BUT APPARANTLY NOT FOR MY SPECIFIC MODEL, WHICH I FIND STRANGE. THE NHTSA CAMPAIGN NUMBER IS 16V621000. IT SAYS IT INCLUDES THE 2015 FORD TAURUS AWD, WHICH MY VEHICLE IS. WHEN I SEARCH RECALL BY VIN, MY 2015 FORD TAURUS SAYS THERE IS NO RECALL, WHEN CLEARLY MY MODEL SHOULD BE INCLUDED WITH THE OTHER 2015 MODELS.",
        "vin": "1FAHP2J89FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341978,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR RUNS FINE BEFORE I FILL UP WITH GAS. THEN STUTTERS LIKE IT DOESNT WANT TO START AFTER. IT HAS DONE THIS SINCE I PURCHASED IT 2 YEARS AGO. TODAY ON MY WAY TO WORK. IT STUTTERED AND A LIGHT WITH A WRENCH CAME ON AND THEN SHUT OFF. WOULD DO ANYTHING. I WAITED A FEW MINUTES THEN IT STARED RIGHT BACK UP.  I SEE THAT THERE ARE SOME RECALLS FOR 215 TAURUS BUT MINE IS NOT INCLUDED.",
        "vin": "1FAHP2D88FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT AFTER REFUELING AND ATTEMPTING TO DRIVE OFF, THE VEHICLE LOSS POWER STEERING ASSIST. THE POWER STEERING ASSIST WARNING LIGHT WAS ILLUMINATED. THE CONTACT WAITED FOR FIFTEEN MINUTES, RESTARTED THE VEHICLE AND THE VEHICLE OPERATED AS INTENDED. THE CONTACT CONTACTED OLATHE FORD LINCOLN (1845 E SANTA FE ST, OLATHE, KS 66062, (913) 782-0881) TO HAVE THE VEHICLE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE STEERING GEAR AND POWER STEERING MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS  REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND A CASE WAS FILED. THE CONTACT WAS INFORMED THAT THE REPAIR WAS NO LONGER COVERED UNDER WARRANTY. THE APPROXIMATE FAILURE MILEAGE WAS 61,900.*DT*JB",
        "vin": "1FAHP2E83FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338547,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TO GO TO LUNCH AT WORK WHEN MY CAR WOULDN'T START. THE AUTOMOTIVE INSTRUCTOR AT THE TECHNICAL COLLEGE I WORK AT TOLD ME IT WAS THE FUEL PUMP AND SYSTEM.  HE CHECK THE FUEL TANK BY AND FINALLY GOT IT TO START. WHEN I GIT READY TO GO TO WORK JULY 6TH AT 7AM, MY CAR WOULDN'T START AGAIN AND HASN'T STARTED SINCE I DROVE IT LAST ON SUNDAY JULY 5TH. I HAVE BEEN WITHOUT A VEHICLE SINCE AND NOW I'M TRYING TO TRADE IT FOR A BETTER VEHICLE. MY 2015 FORD TAURUS ONLY HAS 63,300 MILES.",
        "vin": "1FAHP2D85FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331729,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS APPROXIMATELY 58,000 MILES ON IT. THE ALARM CODE \"STEERING FAULT, SERVICE NOW\" KEEPS PERIODICALLY APPEARING ON THE DASH, SOMETIMES WHILE DRIVING AND SOMETIMES WHILE JUST SITTING IN PARK. THE STEERING BECOMES VERY HARD TO TURN. THIS STEERING SETUP IS AN ELECTRONIC STEERING ASSIST INSTEAD OF THE OLD STYLE POWER STEERING THAT USED FLUID. FROM WHAT I CAN FIND, THIS WAS A PREVIOUS RECALL FOR THE EARLIER YEAR MODELS BUT HAVE YET TO ISSUE THE SAME RECALL FOR THIS YEAR. THERE SHOULD NOT BE ANY TYPE OF FAILURE AT THIS TYPE OF MILEAGE. IT SEEMS TO BE AN OCCURRING PROBLEM WITH THIS CAR WELL BELOW THE 100K MILEAGE MARKER. THIS SHOULD NOT BE SOMETHING THAT THE OWNERS SHOULD HAVE TO DISH OUT OF POCKET. THIS IS SOMETHING THAT FORD NEEDS TO OWN UP TO AND REPLACE DUE TO THEIR SYSTEM BEING FAULTY.  *TR",
        "vin": "1FAHP2F84FG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329187,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S MAKES A WEIRD NOISE AND I TOOK IT TO PEP BOYS AND THEY DIDN'T FIND ANYTHING.  *TR",
        "vin": "1FAHP2D9XFG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326557,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY CAR START IT HESITATE FOR A LONG TIME THEN START, OR SOMETIMES WON'T START AT ALL I HAVE TO START IT AGAIN AND IT HESITATE SOME MORE THEN START AGAIN.  *TR",
        "vin": "1FAHP2E8XFG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. CONTACT STATED THAT AFTER PARKING THE VEHICLE, THEY ATTEMPTED TO RESTART THE VEHICLE HOWEVER, THE VEHICLE SHUDDERED AND STALLED. THE VEHICLE FAILED TO RESTART. THE VEHICLE WAS TOWED TO THE RESIDENCE WHERE AN INDEPENDENT MECHANIC DIAGNOSED THE VEHICLE. THE DTC CODE WAS P0627 (FUEL PUMP FAILURE). THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE FAILURE WAS RELATED TO NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE), HOWEVER, THE VIN WAS NOT INCLUDED.  THE CONTACT MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "1FAHP2H81FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "04/29/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWER STEERING WENT OUT WHILE DRIVING WHICH WAS VERY SCARY AND DANGEROUS FOR MYSELF AND OTHER DRIVERS. I KNOW THIS HAS BEEN A RECALL FOR EARLIER TAURUS MODELS 2011-2014 AND I THINK THIS YEAR NEEDS TO BE INCLUDED IN THAT RECALL AS WELL. THE COST  TO FIX IS $2,500 AT THE DEALERSHIP AND DURING THIS COVID 19 PANDEMIC THAT IS A LOT OF MONEY.  *TR",
        "vin": "1FAHP2E89FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323463,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKED IN MY APARTMENT COMPLEX PARKINGS. I WAS CHARGING MY PHONE IN THE CAR WHILE THE ENGINE IS OFF. THE RADIO AS WELL AS THE INTERIOR LIGHTS WERE ON FOR APPROXIMATELY 45 MINS. THEN, I TRIED TO START THE ENGINE, BUT IT DID NOT START. IT WAS GIVING A WEIRD SOUND THAT IS SCARY TO ME, THE OWNER. SO, I LEFT IT AS IS FOR THE NIGHT. I AM NOW REPORTING THIS PROBLEM BECAUSE WHEN I ENTERED MY VEHICLE'S VIN NUMBER, THE WEBSITE STATED THAT IT DOES NOT HAVE ANY RECALLS IN IT. I KNOW THAT 2015 FORD TAURUS HAS THIS RECALL PROBLEM, BUT FOR SOME REASON, MY CAR IS NOT INCLUDED WITH THESE CARS.  *TR",
        "vin": "1FAHP2J85FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321645,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIED TO START CAR ONE MORNING HAD IT TOWED TO A DEALER AND IT TURNS OUT IT WAS THE FUEL PUMP DRIVE MODULE AND REPLACING IT FIXED THE PROBLEM. THERE WAS A RECALL FOR FORD TAURUS OF 2013-2015 AND THEY SAID MY VEHICLE WAS NOT AFFECTED, BUT CLEARLY IT WAS.",
        "vin": "1FAHP2F82FG"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321170,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE DRIVER'S SIDE REAR TOE LINK DETACHED WITHOUT WARNING. THE CONTACT VEERED TO THE SHOULDER OF THE ROADWAY FOR ASSISTANCE. THE VEHICLE WAS TOWED TO TOOTHMAN & SOWERS FORD (2231 WHITE HALL BLVD, FAIRMONT, WV 26554, (888) 937-7330) WHERE IT WAS DIAGNOSED AND DETERMINED THAT THE DRIVER SIDE REAR TOE LINK NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTAC THAT THE REMEDY WAS UNAVAILABLE. THE CONTACT WAS INFORMED THAT THE REPAIR WAS AVAILABLE AS AN OUT OF POCKET EXPENSE. THE CONTACT WAS INFORMED THAT VEHICLE OWNERS WHO PAY OUT OF POCKET WOULD BE ELIGIBLE FOR REIMBURSEMENT. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION). THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "1FAHP2MKXFG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "09/12/2019",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321059,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM DRIVER ' ' I DISCOVERED THE CAR EITHER CAUGHT FIRE INSIDE OR THE DOOR PANEL EXPLODED.  I OBSERVED NO VISIBLE DAMAGE UPON MY RETURN TO FLETC ON MONDAY 9/9; TODAY 9/12 WAS UNABLE TO OPEN THE DRIVER'S SIDE DOOR, RESPONDED TO THE PASSENGER SIDE OF THE VEHICLE AND OBSERVED THE DRIVER'S SIDE AIRBAGS DEPLOYED, SMELL OF BURNT MATERIALS, AND DAMAGE ON THE DRIVER'S SIDE CONSISTENT WITH A FIRE/EXPLOSION.  EXTERIOR OF THE VEHICLE IS STILL INTACT, CAR IS NOT OPERABLE.\"  *TR",
        "vin": "1FAHP2MT8FG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "03/21/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319297,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY VEHICLE HOME FROM WORK THE ENGINE BEGAN SHUDDERING, SURGING, AND FINALLY DIED LEAVING ME STRANDED ON THE SIDE OF THE ROAD CAUSING POTENTIAL HAZARD FOR MYSELF AS WELL AS OTHER DRIVERS.      I TOWED THE VEHICLE TO MY MECHANIC WHO TOLD ME IT COULD BE EITHER THE HIGH PRESSURE FUEL PUMP OR THE FUEL PUMP CONTROL MODULE.  THE VEHICLE ONLY HAS 61,000 MILES ON IT MAKING IT JUST OUTSIDE THE MANUFACTURER'S 60,000 MILE WARRANTY.  FORD REFUSED TO EXTEND ANY KIND OF WARRANTY WHEN THE MECHANIC CALLED.  WHEN I CHECKED THE ISSUE ONLINE I LEARNED OF A 2016 FORD RECALL REGARDING THE FUEL PUMP CONTROL MODULE FOR 2013-2015 FORD VEHICLES WHICH APPARENTLY DOES NOT COVER MY CAR.  BOTH THE MECHANIC AND I ARE BAFFLED THAT A FUEL PUMP COULD SUDDENLY FAIL WITH ONLY 61,000 MILES ON THE VEHICLE AND HE WAS VERY SURPRISED THAT FORD WOULD NOT DO ANYTHING TO EVEN ASSIST WITH THE COST OF THE REPAIR.       AS FAR AS THE FUEL PUMP CONTROL MODULE, I AM STILL IN THE PROCESS OF TALKING WITH FORD ABOUT IT.",
        "vin": "1FAHP2KT6FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310561,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2014 FORD TAURUS. THE CONTACT STATED THAT THE FUEL PUMP MODULE FAILED. THE CONTACT PURCHASED THE PART AT FRAMINGHAM FORD DEALER, (1200 WORCESTER RD, FRAMINGHAM, MA 01702,) AND WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE FUEL PUMP MODULE WAS REPLACED. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 89,000.",
        "vin": "1FAHP2H83FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310323,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT WHILE HIS WIFE WAS ATTEMPTING TO START THE VEHICLE, THE VEHICLE FAILED TO START. THE CONTACT STATED THAT THERE WERE NO WARNING LIGHTS ILLUMINATED. THE CONTACT STATED THAT AFTER RESEARCHING THE FAILURE HE BECAME AWARE OF NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE CONTACT STATED THAT HE REPLACED THE FUEL PUMP RELAY MODULE ON HIS OWN. JARRETT FORD, INC. LOCATED AT 38300 DICK JARRETT WAY, DADE CITY, FL 33525, WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.",
        "vin": "1FAHP2F88FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310017,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONARY, AS I HAD JUST TURNED IT ON. STEERING WOULD NOT MOVE, CALLED FORD TO ASK AND SET UP AN APPOINTMENT AND WENT BACK OUT AND IT WORKED AGAIN. STEERING FELT VERY FUNNY AND DID NOT DRIVE IT TILL I TOOK IT TO THE SHOP. FORD NEVER STATED THE PROBLEM, NO CODE PRESENT. THEY REPLACED THE WHOLE STEERING RACK AND CALLED IT GOOD. I BELIEVE THIS IS THE ISSUE WHERE STEERING FAILS TO WORK. A RECALL SHOULD OCCUR.... THIS COULD BECOME A HUGE ISSUE IF I WAS IN MOTION. I BELIEVE THE CAR WAS AT 45 K MILEAGE.",
        "vin": "1FAHP2KT1FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302989,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE LOST MOTIVE POWER, BUT REMAINED IDLE. THE CONTACT COASTED THE VEHICLE OFF OF THE ROADWAY. THE CONTACT WAS UNABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHERE THE BATTERY WAS RECHARGED. THE VEHICLE OPERATED AS INTENDED FOR SEVERAL DAYS HOWEVER THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO (CORTESE FORD/LINCOLN, 2500 W HENRIETA RD, ROCHESTER, NY 14626), WHERE IT WAS DETERMINED THAT THE FUEL PUMP MODULE WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 82,316.",
        "vin": "1FAHP2F8XFG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301267,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR. IT WAS NOTICED THAT THE VEHICLE WAS PUTTING OUT COOL AIR ONLY WHEN THE HEAT WAS ENGAGED.  IT WOULD EVENTUALLY WARM A BIT BUT WOULD RETURN TO BLOWING COOL AIR ONLY.  WHEN THE VEHICLE WAS TAKEN TO A MECHANIC, IT WAS EXPLAINED THAT THE PROBLEM WAS THE WATER PUMP.  WE WERE TOLD THAT THE DESIGN OF THE VEHICLE REQUIRES THE ENGINE TO BE REMOVED TO GET TO THE PUMP AND THE COST OF THE REPAIR WOULD BE IN EXCESS OF $2000.  THE VEHICLE CANNOT BE DRIVEN IN ORDER TO PREVENT FURTHER DAMAGE",
        "vin": "1FAHP2E81FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291263,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE ATTEMPTING TO DRIVE, THE POWER STEERING SEIZED AND THE POWER STEERING WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO GORNO FORD (22025 ALLEN RD, WOODHAVEN, MI 48183) WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL SYSTEM NEEDED TO BE UPDATED. THE CONTACT WAS PROVIDED A REPAIR ESTIMATE OF $2,400. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 70,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/24/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291117,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN HAVING ISSUES WITH MY 2016 FORD TAURUS SEL WHERE MY BACK LEFT DOOR WOULD NOT OPEN. THE ELECTRONIC SYSTEM IN THE CAR WAS NOT DISTRIBUTING ANY POWER TO THE BACK DOOR TO ALLOW IT TO OPEN. THE LOCKING KNOB WOULD NOT RISE OR LOWER USING THE LOCKING SYSTEM INSIDE THE CAR OR THE KEY FOB. SHORTLY THERE AFTER, THE OTHER REAR PASSENGER DOOR ON THE RIGHT SIDE BEGAN HAVING THE SAME ISSUE. CURRENTLY BOTH OF MY REAR DOORS CANNOT BE OPENED ELECTRONICALLY. I PHYSICALLY HAVE TO LEAN IN THE BACK OF THE VEHICLE AND RAISE THE LOCKING KNOB TO OPEN THE DOOR. PULLING THE DOOR HANDLE FROM INSIDE THE CAR WILL NOT OPEN THE DOOR. IT HAS NO RESISTANCE TO THE HANDLE WHATSOEVER. THE ONLY WAY TO OPEN THE LOCKED DOOR IS TO PHYSICALLY PULL UP THE LOCKING NOB NEAR THE WINDOW. THIS HAS CREATED DIFFICULTY IN ME TRANSPORTING ANY PASSENGERS AND IS EXTREMELY INCONVENIENT TO PLACE ANYTHING IN THE BACK SEAT. THE INABILITY TO LOCK THE BLACK DOORS WITH THE KEY FOB OR ELECTRONIC SYSTEM IN THE CAR HAS RESULTED IN THE DOOR BEING LEFT UNLOCKED IF NOT THE LOCKING KNOB IS NOT PHYSICALLY PUSHED DOWN EVERY TIME.   I TOOK MY VEHICLE TO A LOCAL MECHANIC WHO INFORMED ME THAT I WOULD NEED A NEW DOOR LOCK ACTUATOR ON BOTH REAR DOORS BUT THAT IT HAD TO BE DONE AT A FORD DEALERSHIP. I CALLED FORD AND THEY INFORMED ME THAT THE DOORS WOULD NEED TO BE REPROGRAMMED AFTER INSTALLING THE DOOR LOCK ACTUATORS TO ENSURE THE DOORS ARE PROPERLY SYNCED TO THE ELECTRONICA SYSTEM OF THE CAR. THE COST OF THIS IS OVER OVER $500 PER DOOR AND I HAVE NO OTHER OPTIONS TO FIX THIS PROBLEM.   I HAVE HAD PRIOR ISSUES WITH MY 2010 FORD TAURUS WHERE THE BACK DOOR WOULD NOT OPEN AND HAD TO PAY ABOUT $500 FOR A REAR DOOR ACTUATOR TO BE INSTALLED AND SYNCED. THE USABILITY OF THE DOORS DOES NOT CHANGE WHEN THE CAR IS OFF, ON, PARKED, OR IN MOTION.   MY PASSENGERS COULD POTENTIALLY BE AT RISK AND THE COST OF REPAIR MAKES THIS ISSUE CONTINUING.",
        "vin": "1FAHP2H81FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290357,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WITHOUT WARNING. THE VEHICLE WAS TOWED TO BYERLY FORD (4041 DIXIE HWY, LOUISVILLE, KY 40216, (502) 448-1661) WHERE IT WAS DIAGNOSED THAT THE FUEL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 35,250.",
        "vin": "1FAHP2E8XFG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FORD TAURUS. CONSUMER WRITES IN REGARDS TO FORD FUEL MODULE PROBLEM. *LD      THE CONSUMER STATED WHILE DRIVING THE VEHICLE STOPPED RUNNING. THE CONSUMER STATED THE VEHICLE SHOULD HAVE BEEN INCLUDED IN RECALL 16V621000. *JS",
        "vin": "1FAHP2F88FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282778,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWING DOWN FROM APPROXIMATELY 40MPH FOR A STOP SIGN. NORMAL/BELOW NORMAL DRIVING CONDITIONS. AND THE CAR JUST DIED AT ABT 20MPH. FULL TANK OF PREMIUM GAS. NO SPUTTER. NO HESITATION. AND ONE STOPPED THE VEHICLE STARTED RIGHT BACK UP AGAIN. THIS WAS IN PHOENIX ARIZONA",
        "vin": "1FAHP2E84FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280405,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE DRIVING 65 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING. THE VEHICLE WAS TOWED TO QUALITY MOTORS OF INDEPENDENCE (2022 W MAIN ST, INDEPENDENCE, KS 67301, 833-501-1227) WHERE IT WAS DIAGNOSED THAT THE FUEL CONTROL MODULE NEEDED TO BE REPLACED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE CONTACT WAS PROVIDED CASE NUMBER: CAS24891768. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 58,000.",
        "vin": "1FAHP2E90FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279590,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 FORD TAURUS. THE CONTACT INSPECTED THE VEHICLE AND NOTICED THAT THE BATTERY WAS CRACKED, WHICH CAUSED WIRES TO CORRODE IN THE ENGINE. THE VEHICLE WAS TOWED TO FAIRWAY FORD INC (444 US-117, BURGAW, NC 28425, (800) 291-7714) AND WAS REPAIRED. THE CONTACT MENTIONED THAT THE SAME FAILURE OCCURRED ON ANOTHER VEHICLE OF THE SAME YEAR, MAKE, AND MODE THAT HE PREVIOUSLY OWNED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279630,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE DRIVING 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. ON ANOTHER OCCASION, THE VEHICLE PROVIDED THE INCORRECT FUEL READING WHEN THE CONTACT ATTEMPTED TO REVERSE THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL PUMP WAS NOT CONNECTED TO THE FUEL CONTROL MODULE, AND THE FUEL GAUGE PROVIDED AN INCORRECT READING. THE MECHANIC STATED THAT THE FUEL PUMP CONTROL MODULE FAILED AND THAT THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER AND DEALER WERE NOT CONTACTED. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "1FAHP2D9XFG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "11/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE BACKING THE VEHICLE OUT OF THE GARAGE, IT STALLED AND DID NOT RESTART. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO RICK FORD SALES (989-642-5261, LOCATED AT 111 E SAGINAW ST, HEMLOCK, MI 48626) WHERE IT WAS REPAIRED IN 2017 PER NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE TECHNICIAN DIAGNOSED AND REPLACED THE FDAA8Z/9D370/B MODULE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE RECALL WOULD NOT BE PERFORMED AGAIN. THE FAILURE MILEAGE WAS APPROXIMATELY 38,000.  *BF  *AS",
        "vin": "1FAHP2KT5FG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "12/12/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269239,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS   CRASHNO    FIRENO    INJURIES0    DEATHS0    THE VISIBILITY PROVIDED BY THE HEAD LIGHT ASSEMBLY (HIGH AND LOW BEAM), IS LESS THAN THE STANDARD FOR NIGHT DRIVING CONDITIONS AND ALMOST NON-EXISTENT WHEN MAKING TURNS ON DARK ROADS. HIGH BEAMS ARE THE EQUIVALENT OF DIMMED LOW BEAMS WHEN DRIVING AT NIGHT. THERE ARE PLENTY OF FORUM DISCUSSIONS REGARDING THIS ISSUE WITH MOST EVERYONE AGREEING ON A HEAD ASSEMBLY FLAWED DESIGN. I NOTICED THIS ISSUE AFTER PURCHASING THIS VEHICLE (NEW) FROM A FORD DEALERSHIP. I HAVE ALREADY HEAT A DEER DUE TO INADEQUATE LIGHTS. WHEN MAKING RIGHT TURN CANNOT SEE WHAT TURNING INTO. THIS DO NOT SHOW UP ON OTHER CARS I DRIVEN. I HAVE ASKED SEVERAL DEALERS ABOUT THIS WAS IGNORED.",
        "vin": "1FAHP2E94FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268842,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 55 MPH ON BUSY ROAD, VEHICLE LOST POWER.  ALMOST REAR-ENDED BEFORE BEING ABLE TO COAST INTO EMPTY PARKING LOT.  WENT INTO LIMP MODE.  COULD NOT ACCELERATE. VEHICLE MAINTENANCE INDICATOR WITH WRENCH CAME ON.  TURNED CAR OFF.  WAITED ONE MINUTE.  CAR RESTARTED.  NO INDICATOR LIGHT.  THIS IS THE SECOND TIME THIS HAS HAPPENED WITH THIS VEHICLE.  THE FIRST TIME THIS HAPPENED ON 6/18/19, I RESEARCHED  AND FOUND A RECALL 16S31 FOR MODELS BUILT IN CHICAGO.  MY VEHICLE VIN WAS NOT INCLUDED IN RECALL.  I TOOK THE CAR TO DEALERSHIP, THEY COULD NOT FIND AN ERROR CODE OR RECREATE FAILURE.  I STILL HAD THEM REPLACE THE PART UNDER THE RECALL AT A COST TO MYSELF.   PART WAS NEW FUEL PUMP CONTROL MODULE.  I FILED COMPLAINT 11220834 WITH NHTSA.  MY FEAR IS THIS IS GOING TO HAPPEN AGAIN AND IF I AM ON THE EXPRESSWAY, THE RESULTS COULD BE CATASTROPHIC.",
        "vin": "1FAHP2F86FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259132,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS OFF WITH NO WARNING WHILE DRIVING AT DIFFERENT SPEEDS. WHEEL LOCKS UP  NO POWER PERIOD. AFTER A COUPLE OF MINUTES RESETS ITSELF AND START AGAIN. IF YOU TRY  TO START IMEDIATLY, WILL NOT START. HAS HAPPENED SEVERAL TIMES OVER   PAST FEW MONTHS",
        "vin": "1FAHP2F84FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265265,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING FAULT SERVICE NOW AND SERVICE ADVANCEDTRAC WARNING LIGHTS CAME ON WHILE DRIVING 40-50 MPH ON HIGHWAY. STEERING BECAME VERY DIFFICULT AND UNSAFE. SLOWING DOWN AND TAKING A CORNER ON SIDE STREET TO GET HOME WAS EXTREMELY HARD TO TURN STEERING WHEEL. TURNED CAR OFF. RESTARTED AND EVERYTHING BACK TO NORMAL. BROUGHT IN TO DEALER AS MY WIFE HAS SOME UPCOMING TRIPS AND WANTED CAR SAFE. THEY SAID SCAN SHOWED U0420 AND C200D. THE DEALER SAID FAULT WAS THE ANGLE SENSOR AND THAT WAS PART OF STEERING GEAR ASSEMBLY. WHOLE ASSEMBLY REQUIRED REPLACEMENT. DEALER ADVISED THERE WAS A RECALL APPLYING TO SAME ISSUE ON 2013 TAURUS BUT NOT CURRENTLY ON 2015. CALLED FORD CUSTOMER SERVICE AND THEY ADVISED THE SAME AS DEALER AND RECOMMENDED REPORTING IT TO NHTSA. COST $2757.43 TO FIX A SERIOUS SAFETY ISSUE AND RE-ALIGNMENT.",
        "vin": "1FAHP2E88FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257639,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS WITHOUT WARNING WHILE DRIVING.  HAS HAPPENED TWICE SINCE I BOUGHT THE CAR THIS SPRING.  ONCE I WAS COMPLETING A TURN FROM A STOP THE OTHER TIME I WAS DOING A CONSISTENT SPEED OF ABOUT 40MPH.  NO WARNING LIGHTS BEFORE OR AFTER, JUST A NOTIFICATION THE 'TRANSMISSION NOT IN PARK' ONCE THE CAR WASN'T RUNNING.      EACH TIME THE DEALER PUT IT ON THE COMPUTER AND SAID THERE IS NO ISSUE FOUND.  THERE IS A RECALL FOR 2013-1015 TAURUS HOWEVER MY VIN ISN'T INCLUDED IN THE FUEL PUMP ELECTRIC MODULE REPLACEMENT THOUGH STALLING IS AN ISSUE CITED IN THAT RECALL.  DEALER SAYS THERE IS NO PROBLEM WITH THE FUEL PUMP ELECTRIC MODULE BECAUSE THE COMPUTER SAYS SO.  I LEFT MY CAR AT THE DEALERSHIP FOR ABOUT 3 WEEKS THINKING IT MIGHT BE AN ELECTRICAL PROBLEM SINCE THE GPS INTERMITTENTLY DOESN'T WORK THE PANIC ALARM GOES OFF MULTIPLE TIMES A WEEK FOR NO REASON.  DEALER SUGGESTS REPLACING THE SD CARD.      I AM AFRAID TO DRIVE MY CAR, ESPECIALLY WITH THE DEATHS RECENTLY FROM CARS STALLING.  I WILL MOST LIKELY PAY OUT OF POCKET TO CHANGE THE FUEL PUMP ELECTRIC MODULE AS I CAN'T AVOID THE HIGHWAY FOREVER.  I WILL BE HAPPY TO SEND YOU THE PART ONCE IT IS REPLACED IF IT WILL HELP INVESTIGATE THE PROBLEM.  HOPEFULLY THAT WILL SOLVE THE PROBLEM, OTHERWISE I AM NOT SURE WHAT TO DO.  HELP PLEASE!    I DON'T HAVE POLICE REPORTS OR ACCIDENT PHOTOS THANKFULLY.",
        "vin": "1FAHP2KT1FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254838,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, FAULTY FUEL PUMP,  WITH NO CHECK ENGINE LIGHT ON, OR NO WARNING. DROVE IT TO WORK JUST FINE , AND WHEN I GOT OF 8 HOURS LATER IT WOULDNT TURN OVER.  LIKE I SAID NO WARNING WHATSOEVER. HAD TO HAVE IT TOWED OFF MY WORK PARKING LOT AND TOOK IT TO A  FORD DEALERSHIP AND THEY SAID IT WAS THE FUEL PUMP",
        "vin": "1FAHP2F86FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/07/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253892,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAULT ON 2015 FORD TAURUS, PREVIOUS YEARS RECALLED FOR SANE REASON. WHY NO RECALL?     WAS DRIVING HOME AND MY STEERING WHEEL JERKED RIGHT AND POWER STEERING WENT OUT, WHAT IF THERE WERE CARS TO MY RIGHT?",
        "vin": "1FAHP2D87FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "09/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253111,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS.    THE VEHICLE EXPERIENCED LOSS OF POWER STEERING WHILE DRIVING    STEERING THE VEHICLE REQUIRED ADDED EFFORT    THE CONTACT BELIEVES FAILURE WAS POWER STEERING HOWEVER, THE MECHANIC WAS UNABLE TO VERIFY DUE TO NO CODES PRESENT AT DIAGNOSTIC    THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 50 MPH, WITHOUT WARNING THE POWER STEERING BECAME INOPERABLE. THE VEHICLE THEN STALLED. THE CONTACT STATED THAT EXTRA EFFORT WAS NEEDED IN MANEUVERING THE VEHICLE. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AND THE VEHICLE PERFORMED AS INTENDED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE MECHANIC WAS UNABLE TO RETRIEVE A FAULT CODE OR DUPLICATE THE FAILURE. THE FAILURE RECURRED ONCE. A LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 94,000.",
        "vin": "1FAHP2F81FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/31/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252548,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO BURLINGTON MA ON AUGUST 29, 2019 AND, WHILE MAKING A RIGHT TURN TO ENTER ONTO RTE 3 NORTHBOUND, I LOST ALL MY POWER STEERING.  AT THE MOMENT OF FAILURE, THE STEERING WHEEL SNAPPED ABRUPTLY TO THE LEFT ALMOST CAUSING ME TO HIT THE GUARD RAIL.  FORTUNATELY, I WAS ABLE TO WRESTLE/TURN THE STEERING WHEEL TO THE RIGHT AND AVOID AN ACCIDENT.  I HAD NO POWER STEERING ALL THE WAY HOME.  WHEN I WRESTLED THE CAR INTO MY DRIVEWAY AT HOME, I SHUT IT OFF, WAITED A MINUTE AND RESTARTED THE CAR.  THE DASH IDIOT LIGHT WAS OFF AND THE POWER STEERING WAS WORKING.    I HAVE NOT USED AND DON'T PLAN ON USING THE CAR UNTIL THIS PROBLEM IS FIXED.  I MADE AN APPOINTMENT TO HAVE THIS PROBLEM DIAGNOSED AND REPAIRED ON SEPTEMBER 9, 2019.    I BELIEVE THE CAUSE OF THE CATASTROPHIC FAILURE IS RELATED TO THE SENSORS ON THE STEERING WHEEL COLUMN THAT COMMUNICATE WITH THE COMPUTER WHICH CONTROLS THE ELECTRIC RACK AND PINION SYSTEM.",
        "vin": "1FAHP2D86FG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252474,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FORD TAURUS UNDER 93,000 WATER PUMP FAILURE. NO WARNINGS WHILE DRIVING ON THE HIGHWAY. STARTED TO OVER HEAT AND COOLANT WAS PORING OUT UNDERNEATH. HAD IT TOWED TO A FORD DEALERSHIP AND WAS TOLD THE WATER PUMP NEEDS REPLACED. OVER $2000 DOLLARS FOR THIS FIX. THE WATER PUMP SHOULD LAST UNTIL 150,000. FORD KNEW IT WAS AN ISSUE AND NEEDS TO STEP UP AND FIX IT. CURRENTLY STILL IN GARAGE TRYING TO FIGURE OUT WHAT I'M GOING TO DO.",
        "vin": "1FAHP2F85FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "07/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252036,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING ON MY 2015 FORD TAURUS FLASHES A MESSAGE TO HAVE THE STEERING SERVICED. SHORTLY, FOLLOWING THIS WHEN I BEGIN TO MAKE A TURN...ANOTHER MESSAGE POPS UP AND THE POWER STEERING DISENGAGES, MAKING IT VIRTUALLY IMPOSSIBLE TO CONTROL THE CAR.",
        "vin": "1FAHP2E85FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252040,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING ON OUR 2015 FORD TAURUS HAS BEEN DISENGAGING WHILE THE CAR IS BEING DRIVEN. FIRST WE GET A MESSAGE THAT THE STEERING NEEDS TO BE SERVICED. NEXT, ANOTHER MESSAGE FLASHED, THE CAR JERKS AND THE POWER STEERING DISENGAGES MAKING IT EXTREMELY DIFFICULT TO CONTROL THE CAR.",
        "vin": "1FAHP2E85FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244955,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE DRIVING 5 MPH AND MAKING A TURN, THE VEHICLE STALLED AND THE OIL CHANGE MESSAGE WAS DISPLAYED. THE VEHICLE WAS TOWED TO AN INDEPENDENT LOT AND THE TOW TRUCK DRIVER STATED THAT THE FUEL PUMP WAS INOPERABLE. THE CONTACT CALLED ACADEMY FORD (13401 BALTIMORE AVE, LAUREL, MD 20707, (800) 658-7794) AND INFORMED THEM OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO THE LOCAL DEALER. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "1FAHP2E86FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243344,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 FORD TAURUS WAS OPERATING UNDER NORMAL CONDITIONS WHEN TWO WARNINGS APPEARED ON THE DASH. ONE FOR A STEERING ASSIST FAULT AND ONE FOR AN ADVANCETRAC SERVICE BEING REQUIRED. I WAS DRIVING ON A COUNTRY ROAD AS THIS OCCURRED AND APPROACHING A SHARP CURVE.  AS THESE LIGHTS ILLUMINATED THE POWER STEERING WAS LOST WHILE OPERATING AT SPEEDS ABOUT 60 MPH. LUCKILY I WAS ABLE TO SAFELY BRING THE VEHICLE TO A STOP. WHEN I WENT TO THE FORD DEALER TODAY THEY ADVISED THAT THAT THIS IS A COMMON ISSUE WITH FORDS ELECTRONIC POWER STEERING SYSTEMS AND THAT EXTENDED COVERAGES ARE AVAILABLE ON SOME MODELS TO REPLACE THE FAULTY ITEMS HOWEVER THE 2015 TAURUS IS NOT COVERED. I WORK IN LAW ENFORCEMENT SO I AM A WELL TRAINED DRIVER AND IT IS BECAUSE OF SAID TRAINING THAT I WAS ABLE TO AVOID A COLLISION WHEN THIS SYSTEM FAILED HOWEVER IT IS EXTREMELY DANGEROUS AND I WOULD BE FEARFUL THAT THIS COULD HAPPEN TO A LESS TRAINED DRIVER AND HAVE CATASTROPHIC RESULTS.",
        "vin": "1FAHP2H87FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240706,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT HIGHWAY SPEED WHEN MY ENGINE DIED AND THE WRENCH LIGHT CAME ON. THE CAR STALLED VERY RAPIDLY. LUCKILY I WAS ABLE TO MAKE IT TO THE SHOULDER BEFORE AN ONCOMING TRAFFIC COULD COLLIDE WITH ME. AFTER RESTARTING MY CAR, I WAS ABLE TO DRIVE HOME WITHOUT FURTHER INCIDENT. THIS PROBLEM HAS HAPPENED MULTIPLE TIMES SINCE. I CHECKED AND MY MODEL IS NOT ELIGIBLE FOR RECALL 16V621000. I DON'T UNDERSTAND WHY FORD IS NOT RECALLING ALL TAURUS OF THIS YEAR RANGE AS THE PROBLEM DOES NOT SEEM ISOLATED TO JUST THE ECOBOOST ENGINES. THERE ARE MANY PEOPLE REPORTING THE SAME ISSUE WITH NON-ECOBOOST ENGINES. THIS IS NOT RIGHT TO GAMBLE WITH PEOPLE'S SAFETY. I WOULD REALLY HOPE THAT THE NHTSA TAKES THIS SERIOUSLY.",
        "vin": "1FAHP2E82FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "07/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235064,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULT CODES   U3000-96  C200D-49",
        "vin": "1FAHP2KTXFG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON I-95 S AT 70 MPH. STEERING WHEEL BEGIN TO TWITCH. STEERING BECAME EXTREMELY HARD TO TURN AND CONTROL VEHICLE. STEERING LIGHT FLASH, TRACTION CONTROL LIGHT ALSO.I MANAGE TO GET VEHICLE OFF HIGHWAY SAFETY.STOP VEHICLE. OPEN HOOD TO CHECK POWER STEERING RESERVOIR.THIS IS VERY DANGEROUS SITUATION..WITHOUT POWER STEERING , THIS VEHICLE IS AT THE POINT OF NOT BEING DERIVABLE. MY WIFE MAY HAVE BEEN DRIVE THE VEHICLE. AND SHE WOULD N'T HAVE BEEN ABLE TO CONTROL SAFETY THIS VEHICLE. GOOGLE SHOW THIS IS A ELECTRIC STEERING RACK & PINION UNIT.FORD HAS A RECALL ON THIS PROBLEM. BUT MY VEHICLE IS NOT INCLUDED, WHY NOT?? FORD HAS NOT FIX THIS PROBLEM ON ALL THE VEHICLE'S THAT ARE CURRENTLY USING THIS SYSTEM.WHAT ARE THEY WAITING FOR SOMEONE TO GET KILLED FIRST.",
        "vin": "1FAHP2KT8FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234764,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF THE OWNER OF A 2015 FORD TAURUS. WHILE DRIVING, THE VEHICLE STALLED WITHOUT WARNING. TWO PEOPLE PUSHED THE VEHICLE OVER INTO A PARKING LOT. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL PUMP SENDING UNIT FAILED. THE TECHNICIAN INFORMED THE CONTACT THAT THERE WAS AN UNKNOWN RECALL REGARDING THE FUEL PUMP SENDING UNIT. THE VEHICLE WAS LATER TOWED TO FORD OF PORT RICHEY (10715 US-19, PORT RICHEY, FL 34668, (727) 233-7148) WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP SENDING UNIT FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). NO FURTHER ASSISTANCE WAS PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 54,000.",
        "vin": "1FAHP2E8XFG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231635,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW BATTERY AND ITS DRAIN BECAUSE OF ITS SAYING CHECK CHARGE SYSTEM IN  DONT KNOW WHAT ELSE TO.DO I LOST MY JOB BECAUSE MY VEHICLE STOP RUNNING",
        "vin": "1FAHP2H8XFG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231111,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PICKING UP MY SON AFTER WORK. I HAD DRIVEN ROUGHLY 45 MINUTES AND PARKED WAITING FOR HIM FOR ROUGHLY 10 MINUTES. AFTER HE GOT IN, WE DROVE TO THE END OF THE STREET AND TURNED ON TO THE MAIN ROAD. 2 WARNINGS POPPED UP SUDDENLY. 1 FOR POWER STEERING FAILURE AND 1 FOR STABILITY CONTROL FAILURE. STEERING INSTANTLY BECAME EXTREMELY DIFFICULT TO CONTROL. I WAS ABLE TO PULL INTO A GAS STATION, AND POPPED THE HOOD. I WASN'T AWARE AT THIS POINT IT WAS ELECTRONIC POWER ASSISTED STEERING. I QUICKLY REALIZED THERE WAS NO POWER STEERING RESERVOIR. I TURNED THE CAR BACK ON AND STEERING CONTROL SEEMED TO BE RESTORED. SO I CONTINUED ON. AS I TURNED BACK ON TO THE MAIN ROAD AND THE POWER STEERING FAILED AGAIN. LUCKILY I WAS ONLY GOING ABOUT 500 FEET DOWN THE ROAD AND MANAGED TO PULL IT IN DESPITE THE INCREASE IN STEERING DIFFICULTY. THE POWER STEERING FAILURE HAS BEEN PRESENT EVER SINCE.",
        "vin": "1FAHP2KTXFG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230377,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE DRIVING 50 MPH, THE VEHICLE BEGAN TO HESITATE AND THE POWER TRAIN FAULT AND CHECK ENGINE WARNING INDICATORS ILLUMINATED. THE CONTACT WAS ABLE TO PARK THE VEHICLE ON THE SIDE OF THE ROAD BEFORE THE ENGINE SEIZED. THE VEHICLE WAS UNABLE TO START AND WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS ALSO TOWED TO GIBBES FORD (LOCATED AT 2840 ST MATTHEWS RD, ORANGEBURG, SC 29118, (888) 337-9749) WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "1FAHP2E81FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229204,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "48,217MI. I HAVE HAD SEVERAL OCCASIONS, WHILE DRIVING, WHERE THE POWER ASSISTED STEERING HAS STOPPED WORKING CAUSING DIFFICULT STEERING AS WELL AS A \"STEERING FAULT SERVICE NOW\" MESSAGE ON MY INSTRUMENT CLUSTER. FORD HAS RECALLED SEVERAL VEHICLES FOR THIS SAME CONCERN BUT MY VEHICLE HAS NOT BEEN INCLUDED IN THE RECALL SO FAR.",
        "vin": "1FAHP2H81FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220834,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65 MPH ON BUSY ROAD, VEHICLE LOST POWER.  WAS ABLE TO COAST TO SIDE OF ROAD.  VEHICLE WOULD NOT ACCELERATE.  VERY DANGEROUS SITUATION.  NO IWARNING/INDICATORS OF ANY PROBLEMS BEFORE LOSS OF ACCELERATION. ONLY INDICATOR THAT CAME ON AFTER WAS MAINTENANCE INDICATOR WHICH DISAPPEARED AFTER RESTART..    PLACED THE VEHICLE IN PARK AND RESTARTED.  VEHICLE FINE AFTER RESTARTING.  NOTICED THIS VEHICLE AND YEAR HAD A SAFETY RECALL 16S31 FOR MODELS BUILT IN CHICAGO.  I CHECKED MY VIN.  NOT INCLUDED IN RECALL, HOWEVER I HAVE A FORD TAURUS 3.5 LITER BUILT AT THE CHICAGO PLANT.  NOT SURE WHY I WASN'T INCLUDED IN SAFETY RECALL IF VEHICLE IS EXPERIENCING THIS ISSUE.  VERY DANGEROUS SITUATION TO LOOSE POWER ESPECIALLY ON BUSY FREEWAYS.",
        "vin": "1FAHP2F86FG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218253,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT 45 MILES AN HOUR THROUGH TOWN AND WITHOUT ANY WARNING THE CAR STOPPED ACCELERATING AND THEN A LOUD BANG.  THE TRANSFER CASE DETACHED RIGHT OFF THE TRANSMISSION AND THE TRANSMISSION WAS DAMAGED IN THE PROCESS.",
        "vin": "1FAHP2H86FG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216953,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE DRIVING BELOW 50 MPH, THE VEHICLE STALLED ON THE HIGHWAY WITHOUT WARNING. THE CONTACT HAD TO COAST AND STEER THE VEHICLE TO THE SIDE OF THE ROAD BEFORE THE APPROACHING TRAFFIC CAUGHT UP. THE CONTACT NOTICED THAT \"WARNING TOOL\" APPEARED ON THE INSTRUMENT PANEL WITH AN ORANGE WRENCH ICON. THE VEHICLE WAS TAKEN TO MALLOY FORD OF WINCHESTER (1911 VALLEY AVE, WINCHESTER, VA 22601, (540) 667-4434) TO BE DIAGNOSED, BUT NO FAILURE WAS FOUND. A MECHANIC DROVE THE VEHICLE AND WAS ABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS REPAIRED BUT IT WAS UNKNOWN WHICH PARTS WERE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 43,000.",
        "vin": "1FAHP2F87FG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/25/2019",
        "dateOfIncident": "05/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209919,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR IN JUNE OF 2018.  NO PROBLEMS UNTIL ABOUT A MONTH AGO, WHEN ENGINE BEGAN ACCELERATING ON ITS OWN, SOMETIMES IN PARK AFTER STARTING, OR WHEN IDLING IN DRIVE AT A LIGHT IN TRAFFIC.  MUST PRESS HARD ON BRAKE TO KEEP IT FROM MOVING UNTIL I CAN PUT IT IN NEUTRAL, WHERE IT REALLY RACES EVEN LOUDER FOR ABOUT A MINUTE, THEN RUNS NORMAL.  HAS HAPPENED ABOUT A 10 TIMES.  FINALLY QUIT DRIVING IT UNTIL I TOOK IT IN TO A FORD DEALER AND IT HAPPENED AGAIN THAT MORNING.  LEFT IT THERE AND WAS TOLD A FEW DAYS LATER THAT IT HASN'T HAPPENED WHEN THEY DROVE IT.  THEY WANT US TO PICK IT UP WITHOUT ANY REPAIRS, BUT I KNOW THERE IS SOMETHING WRONG AND FEEL IT ISN'T SAFE.  REFUSED TO PICK IT UP, BUT WILL PROBABLY HAVE TO THIS WEEK.",
        "vin": "1FAHP2F87FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE THE VEHICLE WAS STOPPED AT A STOP SIGN, THE ENGINE FAILED AND SHUT OFF. THE VEHICLE RESTARTED AFTER THE FAILURE. THE VEHICLE WAS TAKEN TO AN UNKNOWN LINCOLN DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 32,578. *BF  CONSUMER STATED WHEN I WOULD STOP AT A RED LIGHT OR STOP SIGN SOMETIMES IT WOULD JUST SHUT OFF AND WOULD NOT START IMMEDIATELY IT TOOK A FEW SECONDS OR MORE AND ON THE ONE DAY IT STARTING DOING IT MORE OFTEN SO I HAD IT CHECKED OUT AND WAS BAD PART.*JB",
        "vin": "1FAHP2F85FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208979,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE AUTOMATICALLY SHUTS OFF WITH NO WARNING. YOU MAY BE IN THE MIDDLE OF HEAVY TRAFFIC OR IN YOUR DRIVEWAY - IT SHUTS OFF WITH NO APPARENT REASON.  THE FUEL PUMP MODULE WAS REPLACED 1 YEAR AGO AND HAS NO BEGUN THE SAME THING AGAIN.  WE PURCHASED THIS CAR THINKING IT WOULD BE SAFE FOR OUR SON.  NOW WE DO NOT WANT HIM DRIVING IT",
        "vin": "1FAHP2F89FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2019",
        "dateOfIncident": "03/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192293,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE DRIVING 60 MPH, THE STEERING FAILED AND THE STEERING WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO ROCHESTER FORD-LINCOLN, INC. (119 E 4TH ST, ROCHESTER, IN 46975, (800) 634-4220) DIAGNOSED THAT THE RACK AND PINION NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 102,000.",
        "vin": "1FAHP2H84FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/24/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191204,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2015 FORD TAURUS AWD 4-DOOR SEDAN WILL STALL WHEN ACCELERATING ON THE GAS WHETHER YOU ARE STATUONARY AND GO TO TAKE OFF OR IN MOTION AND NEED TO PICK UP SPEED.",
        "vin": "1FAHP2H89FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190127,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED IN MY DRIVEWAY, WORKED FINE IN THE EARLY MORNING TO DRIVE A FEW MILES DOWN THE ROAD AND BACK. WHEN I ATTEMPTED TO START THE CAR AGAIN THE VEHICLE WOULD NOT TURN ON. DASHBOARD, RADIO, WINDOWS, STILL TURNED ON PROPERLY BUT MY VEHICLE WOULD NOT TURN ON COMPLETELY. I TOOK IT TO A FORD DEALERSHIP WHERE I WAS TOLD IT WAS THE FUEL PUMP MODULE THAT FAILED CAUSING MY VEHICLE TO NOT TURN ON.",
        "vin": "1FAHP2E82FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187269,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IN CAR TOUCH SCREEN HAS STOPPED WORKING, COMPLETELY BLACK SCREEN. FORD HAD AN UNLIMITED MILEAGE RECALL FOR THIS EXACT ISSUE UP UNTIL 2014 HOWEVER I OWN A 2015 WHICH THEY STATE IS NOT COVERED BY THE RECALL. FORD ADVISED THAT IF I FEEL IT SHOULD BE INCLUDED I SHOULD CONTACT YOU AND REPORT MY ISSUE.  THE CAR IS LESS THAN 4 YEARS OLD, THE IN CAR TOUCH SCREEN WHICH CONTROLS MOST FUNCTIONS OF THE CAR SHOULD WORK BEYOND 4 YEARS. THIS SCREEN CONTROLS CLIMATE CONTROL, RADIO FUNCTIONS, GPS, BLUETOOTH HANDS FREE FEATURES, ETC.",
        "vin": "1FAHP2E87FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184834,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC AND THE FUEL PUMP MODULE RELAY WAS REPAIRED. THE DEALER WAS NOT CONTACTED. THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME FAILURE AS LISTED IN NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "1FAHP2E80FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184387,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START AND WAS TOWED TO DARCARS FORD LANHAM (9020 LANHAM SEVERN RD, LANHAM, MD 20706). THE DEALER DIAGNOSED THAT THE FUEL PUMP FAILED AND NEEDED REPLACEMENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 52,000. THE VIN WAS INVALID.",
        "vin": "1FAHP0532F8"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183353,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE RANDOMLY STALLED BECAUSE OF FAULTY FUEL PUMP RELAY MODULE. ONLY TURBOCHARGED TAURUS MODEL RECALLED.",
        "vin": "1FAHP2F89FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "02/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180810,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TROUBLE GETTING MY CAR TO START AND WHEN IT DOES START ONCE I'M DRIVING IT IT WILL STALL WHILE IM ON THE ROAD DRIVING, THIS HAS HAPPENED TO ME SEVERAL TIMES NOW IN THE PAST WEEK",
        "vin": "1FAHP2F87FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "02/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176608,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY FORD 2015 TAURUS SEL TRIM PACKAGE OUT OF THE DRIVEWAY ONTO THE ROAD AND IT DIES WILL NOT START THE ENGINE I HAVE IS A 3.5 LITER V6 FLEX FUEL, HAD A BAD FUEL PUMP CONTROL MODULE CHECK WITH FORD MOTOR COMPANY AND THEY HAVE A RECALL ON TAURUS BUT NOT MY MODEL BUT THE SAME PART ISSUE, THE RECALL NUMBER IS 16S31, THE ENGINE WILL STOP AT ANY TIME DOES NOT MATTER IF YOU ARE IN STATIONARY OR IN MOTION THIS IS VERY DANGERS.",
        "vin": "1FAHP2E8XFG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174470,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  THE FIRST OCCURRENCE WAS IN MARCH 2018. I AM NOT THE FIRST OWNER. I GOT THE VEHICLE EXACTLY 2 MONTHS AND IT WON'T ACCELERATE.  IT WAS TOWLES TO A GARAGE AND I PAID $975.00 9FUEL PUMP AND ELECTRICAL.  ON 2/4/2019, THE VEHICLE STOPPED ACCELERATING WHILE I WAS IN TRAFFIC AGAIN.",
        "vin": "1FAHP2D81FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174276,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SO MY 2015 FORD TAURUS AND I WAS COMING TO A STOP AT A STOP LIGHT STEERING STARTED TO FEEL KIND OF TIGHT. ALMOST IS JUST ON AN OLDER CAR MY POWER STEERING FLUID MAKE IT BE GETTING A LITTLE LOW I CONTINUE GOING ABOUT MY TRIP THINKING THAT MUCH OF IT WHEN I GOT TO MY DESTINATION I CHECKED TO SEE IF THERE WAS A POWER STEERING RESERVOIR TO SEE IF THE POWER STEERING FLUID IS LOW TO FIND OUT THAT THE FORD TAURUS IS AN ALL ELECTRICAL POWER ASSIST SYSTEM. I LIVE IN UPSTATE NEW YORK AND THE WEATHER HAS BEEN PRETTY COLD OUT SO I THOUGHT MAYBE THERE WAS A ICE BUILD-UP UNDERNEATH THE VEHICLE I'LL HAVE SINCE WASHED THE BOTTOM OF THE CAR OUT AND THE WEATHER IS NOW IN THE 50 AND I'M STILL IN GETTING THE NUMB TIGHT FEELING IN THE STEERING IT'S ALMOST AS IF HEADING INTO A TURN PERIODICALLY AT ANY SPEED THE STEERING JUST SEEMS TO GET TIGHTER AS IF IT'S GOING TO LOCK UP I TRAVEL ABOUT 51 MILES TO WORK A DAY SO I CAN NOTICE A DIFFERENCE OFF AND ON THROUGHOUT THE TRIP",
        "vin": "1FAHP2F80FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE INTERSTATE THEN THE STEERING WHEEL LOCKED UP SAYING STEERING LOSS STOP SAFELY THE WHEEL COULDN'T TURN NO EARRING NO NOTHING ALMOST GOT RAN OVER BY A SEMI TRUCK",
        "vin": "1FAHP2E80FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166546,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS POLICE INTERCEPTOR",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK MERGING TO GET ON THE HIGHWAY AS I WAS TURNING THE STEERING WHEEL FROZE UP AND BECAME HARD TO TURN I ALMOST DROVE INTO THE WALL MY CAR ONLY HAS 26 THOUSAND MILES ON IT",
        "vin": "1FAHP2MT2G1"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/08/2019",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165048,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE LAST MONTH AND A HALF MY CAR DIED 3 TIMES AS I WAS DRIVING. ALL THREE TIMES I WAS SLOWING DOWN TO TURN AND A WARNING SIGN CAME ON SAYING THE TRANSMISSION ISN'T IN PARK. AFTER THAT THE CAR COMPLETELY DIED ON ME. THE LIGHTS ,STEERING,BRAKES IT JUST COMPLETELY DEAD. I WAS SO AFRAID THE CARS BEHIND ME WOULD HIT MY CAR.IT IS IN THE GARAGE NOW FOR THE THIRD TIME. THE FIRST TIME AFTER 4 DAYS THEY SENT THE CAR HOME AND SAID NO CODES CAME UP AND THEY COULDN'T FIND ANYTHING WRONG.A MONTH LATER IT HAPPENED AGAIN AND THEY REPLACED THE THROTTLE BODY AND GASKET HOPING IT WAS FIXED.JANUARY 4 2019 ,A FRIDAY NIGHT IT HAPPENED AGAIN AND THE CARS BEHAVE IND ME ALMOST HIT ME IN THE BACK. THE CAR STARTS UP WRIGHT AWAY AFTER THIS HAPPENS. I AM SO AFRAID TO DRIVE THIS CAR. THE FIRST TIME I COASTED OFF THE BUSY STREET BECAUSE I HAD NO LIGHTS , STEERING OR BRAKES. CAN YOU IMAGINE NO LIGHTS AND IF I WOULDN'T OF COASTED OFF INTO A DRIVEWAY I WOULD HAVE BEEN HIT. THE GARAGE KEEPS SAYING THAT MY CAR DOESN'T HAVE A RECALL, BUT THERE SHOULD BE ONE ON THIS CAR.MY HUSBAND WENT WITH ME TO THE GARAGE TODAY AND HE TOLD THEM THAT HE DOESN'T WANT THIS CAR BACK UNTIL THEY CAN GUARANTEE IT WILL BE FIXED SO I AM NOT IN A TERRIBLE ACCIDENT!!",
        "vin": "1FAHP2E84FG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "12/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161403,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START. THE VEHICLE WAS TOWED TO KRAPOHL FORD & LINCOLN (1415 E PICKARD RD, MT PLEASANT, MI 48858, 1-800-772-5974) WHERE IT WAS DIAGNOSED THAT THE ENGINE FUEL MODULE FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000.",
        "vin": "1FAHP2F8XFG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156588,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE DROVE HER 2015 FORD TAURUS DOWN HIGHWAY 395 THE CAR SUDDENLY CUT OFF WITHOUT ANY WARNING.  LUCKILY WE HAD ENOUGH ROOM BEHIND US BEFORE THE BIG RIG FOLLOWING BEHIND COULD AVOID US AS WE PULLED OUT OF THE WAY. TOOK THE CAR TO FORD VIA AAA. THEY INFORMED ME IT WAS A FUEL MODULE RELAY. THIS WAS A MASS RECALL SITUATION FOR FORD. COINCIDENTALLY MY VIN WAS NOT ON THE RECALL LIST FOR A WIDELY KNOWN PROBLEM. NOW I'M FORCED TO PAY FOR REPAIRS. I REQUEST THAT ALL CARS MADE FROM 2013 TO THE END OF 2015 OR NEWER BE PLACED ON THE RECALL LIST. LUCKILY IT DIDN'T RESULT IN A HORRIFIC ACCIDENT.",
        "vin": "1FAHP2E93FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154242,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASES A 2015 FORD TAURUS. WITHIN LESS THAN A MONTH AFTER THE VEHICLE WAS SERVICED PER NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE) BY SHAMALEY FORD (11301 GATEWAY BLVD W, EL PASO, TX 79936, (915) 591-8600), IT STALLED WITHOUT WARNING. THE SAME DEALER AND THE MANUFACTURER WERE NOTIFIED AND PLANNED TO CONDUCT MORE DIAGNOSTIC TESTING. A CASE NUMBER WAS PROVIDED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 16,823.",
        "vin": "1FAHP2E86FG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151873,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED MULTIPLE TIMES AT HIGHWAY SPEEDS ON BUSY INTERSTATE.  AFTER A FEW START/STALL CYCLES, MOTOR WOULD NOT START AT ALL.  FULL FUEL TANK, WELL MAINTAINED VEHICLE, WITH ONLY ABOUT 42K MILES AND NO DAMAGE HISTORY. NEEDED TO PUSH OFF ROADWAY, VERY HAZARDOUS SITUATION.  TOWED TO GARAGE, CURRENTLY AWAITING DIAGNOSIS.",
        "vin": "1FAHP2KT6FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "09/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132101,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "'TAKATA RECALL' NOT UNDERSTANDING WHY THE FUEL CONTOL MODULE IS NOT RECALLED FOR MY CAR BEING I AM HAVING TO PAY TO GET IT CHANGED OUT MYSELF.  DROVE IT ALL DAY, STOPPED A FEW TIMES. BY 10:00 AT NIGHT IN A WALMART PARKING LOT WITH MY FAMILY MY CAR WON'T START. I HAVE TO GET IT TOWED FOR THE THIRD TIME OF ME HAVING THIS CAR.  FIRST TIME I PUT IT IN THE SHOP AT A FORD DEALERSHIP THEY CHANGED A FUSE AND BATTERY SECOND TIME I PUT IT IN THE SHOP THEY CHANGE PUMP AND BODY CONTOL MOD. NOW THE THIRD TIME I HAVE THE SAME ISSUE WITH THIS CAR DOING THE SAME THING *CRANKING WITH NO TURN OVER* I GET TOLD IT'S A FUEL CONTOL MOD. YOU SHOULD HAVE THE RECALL ACROSS THE BOARD FOR THESE CARS. INSTEAD OF THE OWNERS HAVING TO SPEND 500 TO REPLACE IT BY THE DEALERSHIP.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/26/2018",
        "dateOfIncident": "08/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122410,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE AND WARNING LIGHT CAME ON DASH SAYING POWER STEERING ASSIST FAILURE. POWER STEERING IMMEDIATELY QUIT WORKING AT SPEED OF 70MPH DURING A LAND CHANGE AND ALMOST LEAD TO A CRASH. NO PRIOR EARRING THIS SYSTEM WOULD FAIL. NOT SAFE",
        "vin": "1FAHP2E85FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120379,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I  WAS DRIVING IN THE HIGHWAY THE CAR JUST SUDDENLY STARTS TO SLOW DOWN AND STALLS, I TRY TO HIT THE GAS, BUT NOTHING HAPPENS WITH THE CAR, IT JUST CONTINUES TO SLOW DOWN UNTIL IT DOES NOT MOVE ANYMORE. I HAVE TO QUICKLY GET OUT OF THE HIGHWAY AND GET TO THE MEDIAN BECAUSE OF THE FEAR OF GETTING HIT. THIS IS EXTREMELY DANGEROUS WHEN I AM ON THE ROAD AS SUDDENLY STOPPING CAN CAUSE A CAR TO HIT ME FROM BEHIND.",
        "vin": "1FAHP2F81FG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114772,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY SUDDEN SURGE OF RPM THEN LOSS OF ALL POWER.  CAR WENT INTO LIMP MODE. DISPLAYED WRENCH WARNING LIGHT AND SEE OWNERS MANUAL WHICH INDICATES POWER TRAIN/LOSS OF POWER.  DEALER SAID CODE WAS READING THROTTLE BODY.  BELIEVE THEY NEED TO INVESTIGATE FURTHER",
        "vin": "1FAHP2E89FG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111185,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR AND LOW OR HIGH SPEEDS IT WILL STALL IN THE MIDDLE OF DRIVING IT. NO ENGINE LIGHTS WILL BE ON OR ANY TYPE OF WARNING. ONCE IT STALLS AND THE VEHICLE IS TURNED OFF AND THEN TURNED BACK ON IT WILL WORK FINE UNTIL IT WILL DO IT AGAIN. WITH THE RECALLS OF SOME OF THESE MODELS I LOOKED UP THE VIN NUMBER AND THERE IS NO RECALL HOWEVER IT SEEMS BASED ON RESEARCH WE ARE HAVING THE SAME PROBLEM AS OTHER FORDS WERE HAVING WITH THE FUEL SYSTEM.",
        "vin": "1FAHP2F85FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103579,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A NUMBER OF OCCASIONS IN THE PAST 30 DAYS MY 2015 TAURUS HAS HAS A LOSS OF POWER TO THE STEERING SYSTEM WHICH MAKES IT DIFFICULT TO DRIVE   IT HAPPENS AT LOW AND HIGH SPEEDS    IT HAPPENED AT MY SONS GRADUATION IN A PARKING LOT FULL OF STUDENTS AND PARENTS AND COULD NOT STEER THE CAR  IT ALSO HAPPENED ON A MAIN ROAD TRAVELING IN MY LANE AROUND A HARD TURN IN ROAD AND THE STEERING FAILED  I STOPPED THE CAR ON THE SHOULDER BY SLAMMING ON THE BRAKES  THANK GOD NO ONE WAS BEHIND ME AND IT HAPPENED AT THE GROCERY STORE TURNING INTO A PARKING SPOT ON 2 OCCASIONS    THE WAY TO MAKE IT WORK AGAIN IS IF YOU TURN OFF CAR AND RESTART IT AND IT'S FINE TILL THE NEXT TIME            A LIGHT COMES ON ON THE DASH THAT READS POWER STEERING SYSTEM FAILURE   I CONTACTED FORD ABOUT THE PROBLEM AND I WAS TOLD THAT IT WASN'T COVERED UNDER WARRANTY AND THERE WAS NO RECALLS IN AND THAT IT NEEDED A NEW STEERING GEAR AND RACK AND IT WOULD COST ME 1500$ TO DO THE JOB   I HAVE LOOKED INTO ANY RECALLS ONLINE AND THEY DID HAVE A RECALL ON A THE POWER STEERING ASSSIST ON EARLIER MODELS OF THE TAURUS 2012-2013 SO MAKES ME THINK THAT THEY KNOW THERE IS A PROBLEM AND WON'T ISSUE A RECALL   ARE THEY WAITING FOR SOMEONE TO GET HURT OR POSSIBLY KILLED   AS I SAID PREVIOUSLY THE POWER STEERING FAILS AT ALL SPEEDS AND GIVES NO INDICATION THAT IT IS ABOUT TO HAPPEN   SOMETHING SHOULD BE DONE   THANK YOU",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/24/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097944,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. UPON ATTEMPTING TO START THE VEHICLE, IT FAILED TO START. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE CONTACT STATED THAT THE FAILURE OCCURRED TWICE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES AND REFERRED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 80,100. *TT",
        "vin": "1FAHP2E85FG"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089051,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WASHER FLUID PUMP FAILURE AFTER 30K MILES ON THE VEHICLE. BEGAN BEING INTERMITTENT AFTER 20K MILES. REPLACED PUMP AND REMOVED PROTECTIVE COVER TO FIND CORRODED MOTOR WINDINGS. FAILIRE APPEARS TO BE CAUSED BY AN INTERNAL LEAK WITH IN THE PUMP ALLOWING THE WASHER FLUID TO ENTER THE ELECTRIC MOTOR PORTION OF THE PUMP. THIS IS A PARTICULAR HAZARD DURING THE WINTER MONTHS IF YOU CANNOT CLEAN SALT, DIRT AND OTHER DEBRIS OFF YOUR WINDSHIELD ,. PARTICULARLY DURING SUNNY  DAYS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083599,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT STATED THAT THE WINDSHIELD WASHER FLUID PUMP FAILED TO FUNCTION. THE ELECTRICAL LINING AT THE TOP OF THE PUMP WAS RUSTED. THE PART WAS REPLACED BY THE CONTACT. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "1FAHP2KTXFG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "03/29/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083100,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ENGINE SOON INDICATOR CAME ON. LATER, THE CAR STALLED ON THE HIGHWAY, ALMOST CAUSING AN ACCIDENT. DEALER COULD NOT PROVIDE AN ANSWER TO WHY THIS HAPPENED. UPON INVESTIGATING THIS ISSUE MYSELF, I FOUND SAFETY RECALL 16S31 WHICH DESCRIBED THE EXACT SYMPTOMS EXPERIENCED WITH MY CAR. MY CAR WAS MANUFACTURED AT THE FORD CHICAGO PLANT DURING THE DESIGNATED TIME PERIOD OF THE RECALL, YET MY VIN # WAS NOT PART OF THE RECALL. FORD DEALER AGREED THAT THE REASON FOR THE RECALL COULD HAVE BEEN THE CAUSE OF MY CAR SHUTTING DOWN ON THE HIGHWAY. THIS SITUATION IS TOO POTENTIALLY DANGEROUS IF IT OCCURS AGAIN. I CONTACTED FORD, THEY WOULD NOT ACCEPT FAULT AND TOLD ME THEY WOULD REPORT THE INCIDENT TO NHTSA, CASE# [XXX]. *TT    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FAHP2H80FG"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED WHILE GOING 50 MPH, LIGHTS INSIDE WORKED FINE, NOTICE ALERTED ME ON THE DASH THAT CAR WAS NOT IN PARK.  I WAS UNABLE TO ACCELERATE, PULLED TO A STOP ON THE SIDE OF THE ROAD AND PUT THE CAR IN PARK AND TURNED THE VEHICLE OFF.  RESTARTED AND IT RESTARTED JUST FINE.  I NOTICED THERE WERE RECALLS ON THE 2015 FORD TAURUS THAT WERE MADE IN THE CHICAGO PLANT FOR VERY SIMILAR PROBLEMS BUT MINE IS NOT INCLUDED.  37000 MILES ON THE VEHICLE.  PRETTY DANGEROUS FOR IT TO JUST STALL WHEN GOING THAT FAST FOR NO APPARENT REASON.",
        "vin": "2FMGK5D86EB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054058,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FORD TAURUS/APPROX 7850MILES ON CAR/6 MONTHS OLD....VEHICLE WENT INTO LIMP HOME MODE AT HIGHWAY SPEED. ESPECIALLY IN THE HANDS OF A LESS EXPERIENCED DRIVER, THIS COULD CAUSE MAJOR CONFUSION, AND POSSIBLY  A MAJOR REAR END COLLISION AND IT IS A SAFETY CONCERN THAT PROVES THIS PROBLEM STILL EXISTS WITH THIS PART, EVEN THOUGH THE NHTSA HAS \"CLOSED THE FILE\" AND ACCEPTED FORD'S EXPLANATION. THE NHTSA SHOULD RE-OPEN THIS FILE AND INVESTIGATE. THE FOLKS AT FORD SERVICE SEEM TO BE ALL TOO FAMILIAR WITH THIS  PROBLEM. FORD MUST BE HELD ACCOUNTABLE FOR THESE POTENTIALLY LIFE THREATENING SITUATIONS CAUSED BY THESE PARTS AND THEY MUST BE FORCED TO PERFORM A FULL SCALE RECALL ON PART AT4Z-9E926-B (THROTTLE BODY)",
        "vin": "1FAHP2E82FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "11/12/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045929,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   MY 2015 FORD TAURUS KEEP GIVING ME THE SAME PROBLEMS AFTER I WENT TO A FORD DEALER AND PURCHASED THE FUEL PUMP MODULE AND REPLACE IT 3 WEEKS LATER THE CAR STALL WITH ME WHILE I WAS DRIVING ON THE THRUWAY. IN THIS MATTER I TRULY THINK THAT ITS UNSAFE TO DRIVE A VEHICLE WITH THAT TYPE OF PROBLEM, AND IT HAPPEN NOT JUST ONCE BUT THREE TIMES   THE VEHICLE IS ONLY 2 YEARS OLD",
        "vin": "1FAHP2H87FG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2017",
        "dateOfIncident": "10/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032332,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2015 FORD TAURUS  WITH 34,000 MILES ON IT THE BEGINNING OF OCTOBER 2015. ABOUT A MONTH AGO I HAD A PROBLEM WITH THE VEHICLE  STALLING OUT  AND THEN NOT STARTING. I SPOKE TO SOMEONE AT THE LOCAL FORD DEALERSHIP AND WAS TOLD  TO RESET THE FUEL PUMP RELAY. AFTER DOING THAT THE CAR CRANKED FINE. I DID ONLINE RESEARCH OF THE VEHICLE AND DISCOVERED THAT THE 2013 TO 2015 FUEL PUMP RELAY ON MANY OF THE SAME VEHICLES HAVE BEEN RECALLED. I SEARCHED MY VIN NUMBER AND FOUND THAT MY PARTICULAR VEHICLE WAS NOT A PART OF THE RECALL. IN MY RESEARCH I ALSO FOUND OUT THAT THIS PARTICULAR PART SHUTS OFF THE FUEL SUPPLY IN THE EVENT OF AN ACCIDENT TO PREVENT FIRE OR EXPLOSION. AND ALSO THAT USUALLY THIS PART LASTS THROUGHOUT THE LIFETIME OF A VEHICLE UNLESS IT IS FAULTY. TWO DAYS AGO THE CAR STALLED AND AGAIN WILL NOT CRANK I TRIED TO RESET THE FUEL PUMP RELAY AGAIN BUT IT WILL STILL NOT GREA TO PREVENT FIRE OR EXPLOSION. AND ALSO THAT USUALLY THIS PART LASTS THROUGHOUT THE LIFETIME OF A VEHICLE UNLESS IT IS FAULTY. TWO DAYS AGO THE CAR STALLED AND AGAIN WILL NOT CRANK I TRIED TO RESET THE FUEL PUMP RELAY AGAIN BUT IT WILL STILL NOT  CRANK. I HAVE BEEN TOLD BY A FORD MECHANIC THAT IT IS A FAULTY FUEL PUMP RELAY. I CONTACTED FORD AGAIN TO QUESTION IF THIS PART SHOULD HAVE BEEN MADE PART OF THE RECALLED BECAUSE THIS VEHICLE WAS BUILT DURING THE SAME TIME THAT THE RECALLED RELAYS WERE USED. I WAS TOLD BY FORD CUSTOMER SERVICE THAT THE NATIONAL HIGHWAY TRAFFIC AND SAFETY ADMINISTRATION AND THE ENGINEERING DEPARTMENT OF FORD NEED TO BE CONTACTED TO FURTHER HELP ME IN THIS MATTER TO DETERMINE IF THIS PART SHOULD HAVE IN FACT BEEN ADDED TO THE RECALL LIST. THANK YOU FOR YOUR TIME AND ATTENTION.",
        "vin": "1FAHP2F87FG"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2017",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023886,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FORD TAURUS SEL 3.5L ECOBOOST FLEX FUEL HAS VIBRATIONS AT IDLE AND SPEEDS OF 60-70 MPH. VIBRATION DOES NOT ALWAYS OCCUR AT IDLE OR AT HIGH SPEEDS, USUALLY HAPPENS DURING DECELERATION, AND SOMETIMES HAPPENS AT LOW SPEEDS AS WELL. WAS TOLD BY FORD DEALER THAT OTHER SIMILAR MODELS WERE TEST DRIVEN TO COMPARE, AND THESE VIBRATIONS ARE NORMAL FOR SIMILAR CARS. I DROVE A 2011 FOR TAURUS SEL FOR 4 YEARS AND NEVER HAD ANY VIBRATIONS SO AM CERTAINLY NOT HAPPY WITH THE DEALER'S RESPONSE BUT THEY SAID SINCE NO CODES ARE POPPING UP THERE IS NOTHING THEY CAN DO, AND I TOOK IT TO A DIFFERENT FORD DEALER AND THEY WOULDN'T EVEN HAVE THE TECHNICIANS CHECK ANYTHING SINCE IT WASN'T VIBRATING AT THAT MOMENT",
        "vin": "1FAHP2E83FG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023653,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON HIGHWAY 242 EAST BOUND ON THE FAST LANE DOING 65 MPH AND ON A CURE MY VEHICLES POWER STEERING GAVE OUT I WAS FORCED INTO TWO LANES BEFORE I HAD TIME TO REACT LUCKILY THERE WERE NO OTHER DRIVERS NEXT TO ME .THE TRACTION CONTROL LIGHT CAME ON AND THE STEERING WAS REALLY HAD TO TURN. IT'S BINE THAT WAY EVER SINCE.",
        "vin": "1FAHP2D87FG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015731,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 FORD TAURUS WITH THE 3.5L V6 WILL UNEXPECTEDLY STALL OUT WHILE DRIVING. THE CAR WILL GO INTO \"LIMP HOME MODE\" UNTIL YOU TURN THE CAR OFF. THIS HAS HAPPENED AT 70MPH AND AT 45MPH. THE DEALERSHIP UPDATED THE COMPUTER IN THE CAR AND COULDN'T FIND ANYTHING ELSE WRONG. A WEEK AND A HALF LATER THE CAR STARTS STALLING OUT AGAIN. THIS TIME I HAVE A OBDII HOOKED UP TO THE CAR AND THE CODE IS P2112 (THROTTLE ACTUATOR CONTROL). THE DEALERSHIP IS TOO BUSY THIS WEEK, SO I HAVE TO SEE WHAT THEY DO. FROM WHAT I'VE READ OTHER FORDS HAVE HAD THE SAME PROBLEM. THE CAR CURRENTLY HAS OVER 23,000 MILES ON IT.",
        "vin": "1FAHP2D86FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "08/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015201,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR GETS AN ALARM AND POWER STEERING STOPS WORKING. THE CAR IS VERY DIFFICULT TO TURN AT SLOW SPEEDS AND IS A WORK OUT AT ROAD SPEEDS DEPENDING ON DEGREE OF TURN. THERE ARE TWO ALARMS PRESENT. \"STEERING ASSIST FAULT SERVICE REQUIRED\" AND \"SERVICE ADVANCETRAC. THERE WAS AN ALARM THAT HAPPENED TWICE (AT AROUND 55,000 MILES & 62,000 MILES) BEFORE WITH THE SAME EFFORT NEEDED IN STEERING BUT IT WENT AWAY WHEN THE CAR WAS SHUT OFF AND RESTARTED. IF THIS HAD HAPPENED IN THE MIDDLE OF A SHARP TURN THERE WOULD HAVE BEEN AN ACCIDENT AS IT TAKES A LOT OF EFFORT TO TURN THE WHEEL",
        "vin": "1FAHP2H89FG"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "01/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003933,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE DASH THE ELECTRONIC GAUGE FOR MILAGE STOPPED WORKING,ON THE BODY THE ALARM GOES OFF WHEN THE PASSENGER SIDE DOORS ARE CLOSED,THE REAR DOORS GET FULL OF WATER AND NOW THEY ARE RUSTING BOTH LEFT AND RIGHT.",
        "vin": "1FAHP2E86FG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BEING DRIVEN DOWN THE EXPRESSWAY AT HIGHWAY SPEEDS AND THE STEERING WHEEL LOCKED UP COMPLETELY. THE ENGINE REMAINED RUNNING BUT THE STEERING WHEEL COULD NOT BE MOVED AT ALL. VERY SCARY EXPERIENCE, THE VEHICLE WAS ABLE TO BE BROUGHT TO A SAFE STOP AND HAD TO BE TOWED TO THE DEALERSHIP. THE SERVICE WRITER ADVISED ME THAT THIS IN NOT AN UNCOMMON CONDITION AMONG FORD VEHICLES (CARS AND TRUCKS) WITH ELECTRIC POWER STEERING.",
        "vin": "1FAHP2L80FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2017",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995690,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY AT ABOUT 65 MPH, THE DOOR OPEN ON ME WHILE DRIVING! THE DASH DIDN'T EVEN INDICATE THE DOOR WAS OPEN, I THEN PULLED THE HANDLE TO OPEN THE DOOR TO RECLOSE IT AND IT POPPED OPEN AGAIN.",
        "vin": "1FAHP2E86FG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2017",
        "dateOfIncident": "04/27/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981016,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE MERGING ONTO THE HIGHWAY, THE VEHICLE'S RPMS SUDDENLY REDUCED AND FORCED THE VEHICLE TO DRIVE AT APPROXIMATELY 5 MPH. THE CONTACT DROVE OFF TO THE SIDE OF THE ROAD. THE DEALER STATED THAT THEY WOULD NEED TO TOW THE VEHICLE TO THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 11,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS AT A STOP LIGHT WHEN THE STEERING POWER ASSIST COMPLETELY FAILED. I WAS STILL ABLE TO STEER THE CAR WITH MUCH GREATER EFFORT. THE DASHBOARD INDICATED A \"STEERING FAULT SERVICE SOON\", AND \"TRACTION CONTROL FAULT SERVICE SOON\" ERROR MESSAGE.",
        "vin": "1FAHP2F8XFG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2017",
        "dateOfIncident": "03/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966624,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING RPMS SHOT UP AND LOST ALL POWER. WAS ABLE TO PULL OVER SAFELY SINCE I WAS ON A CITY STREET AND RESTART VEHICLE. AFTER THE RESTART I WAS ABLE TO DRIVE OFF BUT COULD NOT GET OUT OF SECOND GEAR. ENGINE LIGHT CAME ON SHORTLY AFTER.",
        "vin": "1FAHP2KT8FG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/08/2016",
        "dateOfIncident": "12/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933877,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VISIBILITY PROVIDED BY THE HEAD LIGHT ASSEMBLY (HIGH AND LOW BEAM), IS LESS THAN THE STANDARD FOR NIGHT DRIVING CONDITIONS AND ALMOST NON-EXISTENT WHEN MAKING TURNS ON DARK ROADS. HIGH BEAMS ARE THE EQUIVALENT OF DIMMED LOW BEAMS WHEN DRIVING AT NIGHT. I TRIED REPLACING OEM  LIGHT BULBS WITH SYLVANIA HID ($112 EACH) DESPITE THE FACT THAT HID LIGHT BULBS ARE ALREADY STANDARD ON THE FORD TAURUS, WITH NO RESULTS. THERE ARE PLENTY OF FORUM DISCUSSIONS REGARDING THIS ISSUE WITH MOST EVERYONE AGREEING ON A HEAD ASSEMBLY FLAWED DESIGN. I NOTICED THIS ISSUE AFTER PURCHASING  THIS VEHICLE (NEW) FROM A FORD DEALERSHIP.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V621000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1FAHP2KT9FG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/11/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927195,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE DRIVING 65 MPH, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO RESTART, BUT FAILED TO ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE THROTTLE BODY MODULE AND GASKET FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 12,630.",
        "vin": "1FAHP2E82FG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924822,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "'MY 2015 FORD TAURUS WHILE DRIVING AT 70 MPH ON THE FREEWAY IN TRAFFIC THE ENGINE STALLS LEAVING ME WITH NO POWER TO CONTROL MY SPEED. AS MY CAR QUICKLY REDUCES SPEED ON A MAJOR FREEWAY I ATTEMPT TO GET OVER TO THE SHOULDER OUT OF HARMS WAY.  THIS IS A VERY DANGEROUS SITUATION.  I CANNOT BELIEVE FORD HAS NOT DONE A RECALL ON THIS.",
        "vin": "1FAHP2E85FG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "10/21/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD ISSUED A RECALL OF THE 2013-2015 TAURUS, BUT ONLY WITH THE TURBO-CHARGED ENGINE. RECALL IS FOR FUEL PUMP MODULES. THE CAR CAN STOP RECEIVING FUEL OR NOT START ALTOGETHER. ONCE IT STOPS RECEIVING FUEL, IT WILL NOT START. THIS CAN HAPPEN WHILE DRIVING.   ALTHOUGH MY VEHICLE IS NOT TURBO CHARGED, IT HAPPENED TO ME ON MY 2015 FORD TAURUS WITH THE 3.5 L ENGINE. 2 WEEKS AGO, IT REFUSED TO START. DEALERSHIP, ROUNTREE FORD IN SHREVEPORT, COULD NOT FIGURE OUT WHAT HAPPENED. TOOK A SHOT IN THE DARK AND REPLACE THE FUEL PUMP RELAYS. WRONG ANSWER.    LAST WEEK, WHILE DRIVING, IT SHUT DOWN IN DOWNTOWN LITTLE ROCK WHILE I WAS DRIVING IT. FORTUNATELY, I WAS ABLE TO GET IT TO THE CURB, BUT IT WOULD NOT RESTART. DEALERSHIP, NORTH POINT FORD IS NOW FIXING IT. SAID IT WAS THE FUEL PUMP, ALTHOUGH THE SAFETY BULLETIN SAYS FUEL PUMP MODULE.     I AM OUT 2 TOWING FEES AS WELL AS CAR RENTAL 2 WEEKS IN A ROW. NOT GOOD. FORD, RECALL ALL 3.5 LITER FORD TAURUS BECAUSE IT IS NOT JUST TURBO CHARGED!!  *TR  UPDATED 7/9/18*JB  *TR",
        "vin": "1FAHP2F83FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10916322,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK LID FELL AND SPLIT MY HEAD OPEN WHILE LOADING LUGGAGE.  I BLED LIKE A STUCK PIG AND THEY USE GLUE TO PATCH THE GASH IN MY SCALP.  THE BLOW TO MY HEAD MADE MY VISION GO BLACK.  KISER MEDICAL TOOK X-RAYS BUT FOUND NO FRACTURE OF THE SKULL. THE TRUNK LID FRICTION CYLINDERS FAILED TO HOLD THE LID UP AND THEY ARE ONLY 2 YEARS OLD. EVENT HAPPENED 14OCT16. IF THE CAR IS ON A FLAT SURFACE IT WILL APPEAR TO WORK BUT THE SLIGHTEST JARRING OF THE CAR OR A BIT OF WIND AND DOWN IT COMES LIKE A MEAT CLEAVER. SORRY IF THIS DOCUMENTATION IS INCOHERENT BUT THE DOCTOR SAID I MOST LIKELY HAD A CONCUSSION FROM THE HIT.  I DON'T HAVE A WAY TO FILE ANY MORE INFORMATION AT THIS TIME SINCE I AM STILL ON THE ROAD.",
        "vin": "1FAHP2F81FG"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/18/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910655,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS  STATIONARY, SUNDAY MORNING, I NOTICE THE BOTH SIDES AIR BAGS WAS DEPLOYED AND THE CAR SEAT WAS  RIPPED FROM THE DRIVER SIDE AND BACK",
        "vin": "1FAHP2E89FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893553,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SCHEDULED CHARGING NOT WORKING. THE CAR CAN BE SCHEDULED TO START CHARGING AT ANY GIVEN TIME. THE TIMER SCHEDULER WAS SETUP BUT THE CAR STARTS CHARGING IMMEDIATELY AFTER IT IS PLUGGED IN. THE CAR WAS LEFT AT THE DEALER FOR 2 DAYS AT TWO DIFFERENT TIMES. DEALER WAS ABLE TO REPLICATE THE PROBLEM BUT UNABLE TO FIX THE PROBLEM. THE DEALER NEEDS THE CAR TO BE LEFT AT THE DEALERSHIP FOR ONE WEEK WHICH LEAVES ME WITH OUT A REPLACEMENT CAR.",
        "vin": "1FADP5CU5FL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2016",
        "dateOfIncident": "07/16/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885361,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY THE ENGINE TURNS OFF. HAS DONE THAT ABOUT 8 TIMES NOW. TOOK TO DEALER AND THEY SAID NOTHING WAS WRONG. THE CHECK ENGINE IS NOW ON AND TOOK TO AUTO ZONE AND IT'S THE THROTTLE STICKING OPEN AND SHUT. TAKING BACK TO DEALER ON MONDAY !",
        "vin": "1FAHP2E84FG"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882884,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS MERGING INTO TRAFFIC ONTO AN INTERSTATE, DURING RUSH HOUR, THE CAR QUIT ACCELERATING.  SUDDENLY, THERE WAS NO ABILITY TO CONTROL ENGINE SPEED.  AS I GLANCED AT THE DASH  I NOTICED THE WRENCH WARNING LIGHT AND IT SAID SEE MANUAL.  I WAS ALMOST SIDE SWIPED BY ANOTHER VEHICLE BUT WAS ABLE AVOID THE CAR AND WAS ABLE TO COAST TO  A STOP ON THE SIDE OF THE INTERSTATE.  WHEN I PRESSED THE BUTTON, THE CAR SHUT OFF AND WHEN I DEPRESSED IT AGAIN, THE CAR STARTED.  I WAS ABLE TO MERGE INTO TRAFFIC AND HEAD HOME.    ONE THE WAY HOME, ON THE INTERSTATE, THE SAME VEHICLE MALFUNCTION OCCURRED AGAIN.  THERE WAS A CAR BEHIND ME BUT I QUICKLY TURNED MY FLASHERS ON AND WAS ABLE TO COAST TO THE SIDE OF HE INTERSTATE.      I TOOK THE CAR TO THE DEALERSHIP TO HAVE IT LOOKED AT AND AT THIS TIME THEY HAVE NOT BEEN ABLE TO ISOLATE THE PROBLEM.  HARD TO TRUST THE SAFETY & RELIABILITY OF THE VEHICLE WHEN THE AUTHORIZED SERVICE PROFESSIONALS CAN'T FIND THE PROBLEM.  ADDITIONALLY, THEY SAID THE COMPUTER DID NOT STORE ALL OF THE CODES AND ALL THEY HAD WAS  A PCM COMMUNICATION ERROR CODE.    THIS IS A SERIOUS SAFETY ISSUE, PARTICULARLY IF IT REQUIRES FREQUENT DRIVING IN HEAVILY CONGESTED TRAFFIC, AND IF YOU ARE TRAVELING AT HIGHER SPEEDS ON THE INTERSTATE.",
        "vin": "1FAHP2F80FG"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "06/29/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881918,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY AT 70 MPH EXPERIENCED SUDDEN LOSS OF ENGINE POWER- NO LIMP HOME MODE JUST LOSS OF ACCELERATION - COASTED TO THE SIDE OF THE ROAD. AFTER TURNING CAR OFF AND BACK ON WAS ABLE TO CONTINUE DRIVING.  ONLY ERROR SHOWN WAS SEE MANUAL. FAILED THREE MORE TIMES BEFORE I COULD GET OFF THE ROAD - KNOWN PROBLEM WITH THROTTLE BODY - EXTREMELY DANGEROUS SITUATION AS YOU CAN CAN HAVE DIFFICULTY GETTING OFF THE ROAD CROSSING SEVERAL LANES.  THIS SHOULD BE A MAJOR RECALL.  IF YOU ARE NOT ABLE TO GET OFF THE ROAD IN TIME YOU WILL MOST LIKELY EXPERIENCE BEING REAR ENDED ON THE HIGHWAY.   AS I RESEARCHED THIS THIS HAS BEEN HAPPENING FOR YEARS AND IS STILL NOT FIXED - WHY IS THE NHSTB NOT TAKING THIS MORE SERIOUSLY.",
        "vin": "1FAHP2E87FG"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874345,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. WHILE THE VEHICLE WAS PARKED, THE CONTACT HEARD A LOUD NOISE AND THE AIR BAG DEPLOYED WITHOUT WARNING. THE VEHICLE ACCELERATED FORWARD AND CRASHED INTO A TREE. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO THE FORD DEALER, BUT WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 23,000.",
        "vin": "1FAHP2F87FG"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "03/24/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10851916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT OVERHEATED CAUSING THIRD DEGREE BURNS ON MY WIVES BUTTOCKS. THIS WAS THE FIRST TIME THIS SEAT HEATER WAS USED. IT OCCURRED QUITE RAPIDLY. SUBSEQUENT TESTING REVEALED TEMPERATURE WENT TO 126 DEGREES IN LESS THAN 4 MINUTES, TEST WAS STOPPED AT THAT POINT FOR FEAR OF A FIRE OCCURRING. WE HAVE PICTURES WHICH CAN BE USED IF NECESSARY.",
        "vin": "1FAHP2F89FG"
    },
    {
        "components": "STEERING,POWER TRAIN,WHEELS",
        "crash": true,
        "dateComplaintFiled": "03/16/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10849916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2015 FORD TAURUS IN JULY OF 2015 BRAND NEW ONLY 3 MILE ON THE VEHICLE. I NOTICE THAT AFTER THE FIRST OIL CHANGE AND TIRE ROTATION I NOTICED SOMETHING DIFFERENT ABOUT THE FRONT PASSENGER SIDE WHEEL. ON THE SECOND MAINTENANCE VISIT I ADVISE THE INTAKE PERSON THAT THE FRONT PASSENGER WHEEL SOUND LIKE SOMETHING WAS LOSS. AFTER THE SERVICE I WAS GIVEN THE PAPERWORK THAT STATED EVERY THING WAS FINE. WELL ON 3/14/2016 WHILE DRIVING DOWN THE SMOOTHLY PAVED BUSY STREET THE STEERING WHEEL BEGAN TO SHAKE FOLLOWED BY A LOUD THUMP AND NEXT THING YOU KNOW THE CAR HAD FLIPPED ACROSS THREE LANES AND LANDED UP SIDE DOWN. I CALLED FORD DEALERSHIP I PURCHASE THE CAR FROM AND WAS TOLD BY ONE OF THE SALESMEN AFTER TELLING HIM WHAT HAPPEN THAT, \"THAT WAS A DEFECT\" AND I NEED TO GET A LAWYER. ALL I WANT IS THE SOMEONE FROM FORD MOTOR THE INSPECT THE CAR. THE CRAZY PART IS THE AXLE, BRACKET, AND SUSPENSION ARE COVERED UNDER MY POWER TRAIN WARRANTY BUT BECAUSE MY CAR FLIPPED I WAS TOLD I HAD TO FILE A CLAIM WITH MY INSURANCE EVEN THOUGH THE THE FRONT AXLE, BRACKET AND WHEEL BROKE OFF THE CAR CAUSING IT TO FLIP. THE METAL FRAME EVEN BROKE, EVERYTHING WAS STILL ATTACKED TO FRONT PASSENGER WHEEL THAT BROKE OFF AND THE CAR WAS JUST DRIVING DOWN THE STREET NO BUMPS OR ANYTHING. NOW IF MY SO WOULD HAVE DIED AND WAS SEVERELY INJURED I GUESS THEN FORD MOTOR WOULD ISSUE A RECALL LIKE THEY DID FOR THE 2013 & 2014 FORD TAURUS WITH AXLE AND BRACKET DEFECTS.",
        "vin": "1FAHP2D89FG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2016",
        "dateOfIncident": "02/27/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839291,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BACK WINDSHIELD ON MY FORD TAURUS EXPLODED, THERE WAS NO TRAFFIC AND NO ROCK OR OTHER DEBRIS HIT IT. IT JUST EXPLODED, AND HAVING A HARD TIME WITH FORD TO EXPLAIN AND OR FIX IT. PLEASE HELP. WHEN THIS HAPPENED I WAS DRIVING STRAIGHT AHEAD AT 30 MPH.",
        "vin": "1FAHP2F89FG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/26/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838597,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. A COUPLE OF DAYS AFTER PURCHASING THE VEHICLE, THE CONTACT WITNESSED MOISTURE IN THE HEADLAMPS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE MOISTURE AND CONDENSATION IN THE HEADLAMPS WAS NORMAL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 1,100.",
        "vin": "1FAHP2E83FG"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/06/2016",
        "dateOfIncident": "01/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824661,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS FULLY STOPPED AND TURNING LEFT AT A STOP LIGHT ON A CITY STREET, THE LIGHT WAS GREEN, I WAITED FOR TRAFFIC TO CLEAR.  DURING THE MIDDLE OF THE LEFT TURN, I LOST STEERING FUNCTION: WHILE I TRIED TO TURN LEFT, THE VEHICLE VEERED RIGHT.  THE RIGHT WHEEL STRUCK THE CURB.   THE VEHICLE WAS THEN TOWED TO A FORD DEALERSHIP.   THE LOWER CONTROL ARM AND BALL JOINT TOTALLY SEPARATED.   THE DEALER CLAIMS THIS HAPPENED DUE TO STRIKING THE CURB, BUT THIS IS NOT THE CASE, IT HAPPENED DURING THE LEFT TURN.",
        "vin": "1FAHP2F85FG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "06/28/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BREAK LIGHT CAME ON AND IT SAID THE PARKING BREAK WAS INGAGED I STOPED AND CHECKED THE RELEASE PEDAL AND IT WAS ALL THE WAY OUT ITURNED CAR OFF AND RESTARED IT THE LIGHT WENT OFF BUT WHEN I STARTED ON DOWN THE ROAD THE LIGHT CAME ON AGAIN SO I WENT BACK HOME  AND CLLED SHTTENKIRK FORD AND WAS TOLD TO HAVE IT TOWED TO THEIR JASPER GA. SHOP. THEY PUT IT IN SERVICE SHOP AND CAME OUT AND SAID THERE WAS NOTHING WRONG SO I TOLD THEM TEY WERE WRONG SO THE PUT BACK IN AND THEN CAME OUT AND SAID THE ROTORS WERE UNEVEN THEY RESURFACED THEM AND SAID NOW THE BREAKS ARE OK. IDROVE THE CAR TO INDIANNA AND BACK HOMEAND THEBREAKS STARTED MAKING A SRUBBING NOISE I CALLED SHOTTENKIRK AND WENT BACK TO THEM ON 8- 5 2015 AND THEY SAID THE BREAKS WERE OK. BUT THE BREAKS WERE STILL MAKEING BAD NOISE AND GRABBING WHEN TRYING TO STOP. ON 8-20-2015  I WENT TO CHESTATEE FORD IN DAHLONEGA, GA. AND THEY SAID IT WAS MAKEING A NOISE BUT THEY COULD NOT GET TO IT UNTILL THE NEXT WEEK. IT IS 8-24 2015 AND I WILL HAVE TO HAVE IT TOWED TO AHESTATEE FORD BECAUSE I AM AFRAID TO DRIVE IT.",
        "vin": "1FAHP2D8XFG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2015",
        "dateOfIncident": "06/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725189,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AVIS RENTAL CAR IN LAS VEGAS, NV:  PRESSING THE ENGINE START/STOP PUSHBUTTON SWITCH CAUSED THE WHOLE SWITCH ASSEMBLY TO FALL BACKWARDS DOWN BEHIND THE DASH PANEL, RENDERING THE TAURUS INOPERABLE.  ALTHOUGH THIS INCIDENT OCCURRED IN A PARKING LOT, PRESSING THE ENGINE START/STOP PUSHBUTTON SWITCH AND HAVING IT FALL DOWN INTO THE DASHBOARD AREA CREATES A POTENTIAL SERIOUS SAFETY ISSUE. (THIS FREQUENTLY USED SWITCH SHOULD NOT BE MOUNTED FROM BEHIND THE PANEL WITH THE SMALL TANGS/GROOVES CURRENTLY USED.)  I WAS UNABLE TO OBTAIN THE RENTAL CAR VIN BUT HAVE .JPG PHOTOS OF THE AFFECTED VEHICLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2015",
        "dateOfIncident": "03/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703393,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD TAURUS. AFTER DRIVING THE VEHICLE, A STRONG ABNORMAL ODOR EMITTED FROM THE HOOD. WHEN THE CONTACT OPENED THE HOOD, THE STEAM WAS SO HOT THAT HE COULD NOT TOUCH THE RADIATOR HOSE. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN STATED THAT THE WATER PUMP WAS PLACED IN A DIFFERENT LOCATION FROM PREVIOUS OLDER MODELS CAUSING THE RADIATOR TO EMIT HIGHER HEAT.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 300.   UPDATED 5/11/15*CN",
        "vin": "1FAHP2E8XFG"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/16/2014",
        "dateOfIncident": "09/24/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10655329,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON SHUTTING OFF ENGINE BY FRONT PASSENGER, CAR POPPED OUT OF PARK, ROLLED BACKWARDS DOWN A HILL, CRASHING INTO A TREE, PINNING FRONT PASSENGER UNDER DOOR SILL. NO ONE IN DRIVER'S SEAT.  *TR",
        "vin": "1FAHP2F89FG"
    },
    {
        "components": "STEERING,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/13/2014",
        "dateOfIncident": "09/24/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10644303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IDLING IN PARK. PUSH BUTTON START/STOP WAS PUSHED TO SHUT OFF ENGINE AND AT THAT INSTANT, CAR WAS RELEASED FROM PARK, ROLLED BACKWARDS INTO TREE, INJURING RIGHT FRONT PASSENGER. NO ONE IN DRIVER'S SEAT.  *TR",
        "vin": ""
    }
]