[
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459270,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Fiesta. The contact stated that the air bags had been inoperable since 2016. The contact stated that the air bag warning light had remained illuminated for several years. The vehicle was taken to several dealers who diagnosed the failure to be seat belt retention failure. The vehicle was not been repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 96,850.",
        "vin": "3FADP4BJ1FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458137,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IT MAY BE POSSIBLE FOR THE PAWL SPRING TAB INSIDE ONE OR MORE OF THE SIDE DOOR LATCHES TO BREAK. THIS CONDITION WILL TYPICALLY PREVENT THE DOOR FROM LATCHING. IN CERTAIN SITUATIONS, WHERE THE DOOR IS ABLE TO BE CLOSED, THE DOOR MAY UNLATCH WHILE DRIVING.  SAFETY RISK: IF YOU ARE ABLE TO LATCH THE DOOR AFTER REPEATED ATTEMPTS TO SHUT THE DOOR, THERE IS A POTENTIAL THE DOOR MAY UNLATCH WHILE DRIVING, INCREASING THE RISK OF INJURY.",
        "vin": "3FADP4GX2FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457975,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Fiesta. The contact stated that while at a complete stop, the vehicle would shudder upon depression of the accelerator pedal without warning. As the failure worsened, the contact initially took the vehicle to an independent mechanic who informed her that her vehicle was under warranty; and referred her to the dealer for assistance. The dealer then informed the contact that her vehicle was not covered under warranty and provided an estimate for the repair of a defective clutch assembly. The manufacturer was also notified of the failure and confirmed that her vehicle was not covered under warranty; she was then referred to the NHTSA for assistance. The vehicle had yet to be repaired. The failure mileage was approximately 63,000.",
        "vin": "3fadp4ej8fm"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "02/27/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457746,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Whenever I put gas in my car, it will not start right away. I have waited close to 15 minutes for my car to finally let me start it and leave the gas station. The check engine light is on. I have a diagnostic test scheduled for next week. I was told by the dealership that there is no recall for my car.",
        "vin": "3FADP4BJ5FM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "03/16/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457039,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Dealer replaced a faulty TCM, After receiving the vehicle back it still doesn't shift correctly or seem to acknowledge input from the gas pedal. will occasionally shift into neutral before going into the correct gear. At 45 MPH the RPM was 5000",
        "vin": "3fadp4aj2fm"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448336,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Fiesta. The contact stated that while driving approximately 50 MPH, the vehicle lost motive power and stalled without warning. The vehicle was towed to the local dealer who diagnosed that the transmission clutch had failed and needed to be replaced. The vehicle was not yet repaired. The manufacturer was notified of the failure but offered no assistance. The failure mileage was 37,600.",
        "vin": "3FADP4BE1FM"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/09/2022",
        "dateOfIncident": "01/06/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446759,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Swollen Lug Nuts",
        "vin": "3FADP4BJ5FM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446220,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The clutch pedal sticks to the floor after driving on the highway for 30 minutes or so. The clutch pedal can be brought back up by lifting it with my foot. The clutch pedal has a very minimal amount of travel in it when this happens and can be pumped to bring back normal operation for a few minutes. There doesnt seem to be a fluid leak in the system. My local dealer inspected the clutch slave cylinder and it appeared to be operational and otherwise fine. The risk this poses is that i need to be able to shift gears and otherwise operate the car properly in case of an emergency. a sticking clutch pedal prevents me from being able to select the correct gear for my road speed, and it affects the ability for a controlled takeoff from a stop, this potentially affects my ability to react to an emergency as well. The dealer was not able to recreate the problem because it takes too long or a certain set of circumstances to replicate the issue. The car does not have a warning light or message for this.",
        "vin": "3fadp4gx7fm"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2021",
        "dateOfIncident": "11/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440271,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Since early Friday morning on 11/5/21, my Ford Fiesta has been having an intermittent involuntary braking issue associated with all of the lights flickering on/off and the gauges swiping back/forth on the cluster/dashboard while driving. I also noticed the “Hill Assist Control” alert pops up on the radio monitor with the involuntary braking. As well as the sound of the door being open with the key in the ignition will come on while the involuntary braking occurs. Additionally, the windows were resisting being rolled up while driving but will roll up when in park. I also noticed this braking problem tends to reoccur with accelerating quickly or making a turn. On friday afternoon on 11/5/21, I had cautiously drove with my hazards on, while the intermittent involuntary braking problem continued to persist, to my local Autonation Ford to ask about a safety recall associated with this involuntary braking problem and they told me there was no safety recall associated with this problem at this time. They told me that I would need to pay $1100 to replace and reprogram my cluster/dashboard computer. This is unacceptable given the inherent safety risks associated with this intermittent and involuntary braking problem. I believe I should be able to replace and reprogram my cluster/dashboard computer for free due to the safety risks. Thank you for reviewing and considering my proposal of my safety issue.",
        "vin": "3FADP4BJ8FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435060,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I am having issues with the fueling system each and every time I will put gas in my car will shut off after it is turned on.",
        "vin": "3fadp4bj4fm"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426591,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission is stuck in gear and car will no longer operate. Check engine light is on as well as all other warning lights. This is the 3rd repair for the transmission.",
        "vin": "3fadp4ejxfm"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425085,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DISPLAYED LOW COOLANT ON DISPLAY. ADDED COOLANT AND COOLANT LIGHT WENT AWAY. A FEW DAYS LATER, THE CHECK ENGINE LIGHT CAME ON AND THE CAR COULD NOT DRIVE FASTER THAN 20 MPH. TOOK TO THE FORD DEALERSHIP AND WAS INFORMED THAT THE COOLING SYSTEM HAD OVERHEATED AND CAUSED THE OIL TO END UP IN THE CYLINDER. THE COOLING SYSTEM OVERHEATED 1.5 YEARS AGO AND HAD THE THERMOSTAT REPLACED UNDER WARRANTY. NOW VEHICLE HAS 71,000 MILES AND OUT OF WARRANTY. FORD DEALER SAYS THAT THE WHOLE ENGINE NEEDS TO BE REPLACED. IT HAS 1.0L ECOBOOST ENGINE WHICH APPARENTLY HAS MANY ISSUES.",
        "vin": "3FADP4BEXFM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423294,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UNKNOWN",
        "vin": "3FADP4AJ8FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419880,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Fiesta. The contact stated while driving 45 mph, the vehicle started to stall. The contact stated no warning light was illuminated. The contact stated she continued driving the vehicle. The contact also stated the RPM would elevate rapidly.  The contact took the vehicle to an unknown local dealer, where it was diagnosed with needing an unknown hose to be replaced. The vehicle was repaired but continued to experience the failure. The manufacturer had not been informed of the failure. The failure mileage was approximately 11,000.",
        "vin": "3FADP4AJ4FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/03/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419528,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2015 Ford Fiesta. The contact stated while depressing the brakes at various speeds, the vehicle lunged forward before coming to a complete stop. The vehicle was diagnosed and nor repaired. There was no warning light illuminated. The manufacturer was not informed of the failure. The failure mileage was approximately 34,000. Consumer stated vehicle is still experiencing the same problems at random times. The car has 4 engine cylinders.",
        "vin": "1C4RJFCM2EC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418738,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD GOING TO THE HOSPITAL IT STARTED CUTTING OUT AND WOULD NOT SHIFT GEARS AND WOULD NOT GO. sO WE CALLED THE ROADSIDE SERVICE & HAD TO HAVED IT TOWED TO THE SHOP. NOW 3 WEEKS LATER IT IS COVERED BY A RECALL AND EXTENDED COVERAGE BUT IT MAY TAKE UP TO A YEAR TO GET THE PARTS, AND WE NEED A CAR. This is supposed to be due to a problem with these particular model of Ford. Well then they should at least provide us with a car until this one is fixed.",
        "vin": "3FADP4BJ9FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416365,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS GOING DOWN THE STREET AND WOULD NOT SHIFT AND STOPPED GOING AND WE HAD TOO GET IT TOWED TO THE FORD HOUSE FOR REPAIRS,",
        "vin": "3FADP4BJ9FM"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11415317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 11, 2021, THE 2015 FORD FIESTA I WAS DRIVING UNINTENTIONALLY ACCELERATED INTO A COMMERCIAL BUILDING AT A SHOPPING MALL.  THE CAR HAD TWO INCIDENTS OF ACCELERATING WHILE APPLYING THE BRAKE PRIOR TO THE FINAL INCIDENT WHERE THE CAR RAN INTO A WALL AND WAS TOTALED.  THE CAR HAD NEVER EXHIBITED ANY BRAKING OR ACCELERATION ISSUES BEFORE THIS DAY.  THE FIRST INCIDENT, I WAS SLOWING DOWN TO GO OVER A SPEED BUMP.  AS I WAS APPLYING THE BRAKE, THE CAR JERKED FORWARD THEN STOPPED.  IT DROVE AS NORMAL THROUGH TRAFFIC FOR THE NEXT 8 MILES.  I WAS CLOSE TO MY DESTINATION, AS I WAS APPLYING THE BRAKE AT A STOP LIGHT, THE CAR SPED UP AND STOPPED WHEN I PULLED THE EMERGENCY BRAKE.  AGAIN, THE CAR DROVE FINE FOR THE NEXT  MILE.  I WAS VERY AWARE WHILE I WAS PULLING INTO A PARKING SPACE.  NEITHER THE BRAKE OR ACCELERATOR WAS APPLIED AS I WAS COASTING INTO A SPACE.  AS I APPLIED THE BRAKE, THE CAR SPED UP, JUMPED THE CURB AND ACCELERATED INTO THE SIDE OF A BUILDING.  ACCORDING TO A WITNESS AND SUPPORTED BY PATTERN OF SKID MARKS, AT ONE POINT THE CAR WAS AIRBORNE. WITH THE DISTANCE OF ABOUT 15 FEET BETWEEN THE CURB AND WALL, THERE WAS LITTLE TIME TO REACT.  IN MY ATTEMPT TO PULL THE EMERGENCY BRAKE, I INJURED MY THUMB.  MY PASSENGER SUSTAINED VARIOUS BRUISES FROM THE SEAT BELT AND THE FRONT DASHBOARD.  NEITHER THE DRIVER NOR PASSENGER AIRBAGS DEPLOYED.  ACCORDING TO THE BLACK BOX REPORT, THE CAR ACCELERATED FROM 0-100% IN THE FINAL 5 SECONDS AND THE BRAKE WAS APPLIED AT 10%-55%, YET THE CAR CONTINUED TO ACCELERATE.  I DID NOT REMOVE MY FOOT FROM THE BRAKE UNTIL AFTER THE CAR IMPACT, WHICH IS SUPPORTED BY SKID MARKS SHOWN IN PHOTOS.   IN AUGUST 2019, FORD MOTOR WAS AWARE OF A TRANSMISSION CLUTCH SHUTTER ISSUE, BUT STILL PROCEEDED WITH SELLING THE CAR TO AN AUCTION.  ONE MONTH LATER, I PURCHASED FROM A DEALERSHIP.",
        "vin": "3FADP4EJ1FM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/07/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407994,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DASH LIGHTS UP WITH ALL ALERTS AND THEN TOTALLY LOSES POWER.  YOU ARE UNABLE TO PUT CAR INTO ANY GEAR, YOUR LITERALLY STUCK WHEREVER THIS OCCURS.  I'VE BEEN TO 3 MECHANICS INCLUDING FORD AUTONATION AND AN ELECTRICAL DIAGNOSTIC GARAGE RESULTING IN THE SAME RESULTS \" NOTHING\" ! IT ALSO SAYS IMMOBILIZER ENABLED SERVICE NOW???",
        "vin": "3FADP4EJ8FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407697,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED WHILE DRIVING AND APPROACHING A STOP SIGN, THE VEHICLE STALLED. THE CONTACT SLOWLY DEPRESSED THE ACCELERATOR PEDAL AND THE RPM REVVED UP HOWEVER, THE VEHICLE FAILED TO RESPOND. THE CONTACT WAITED FOR SEVERAL MINUTES, DEPRESSED THE ACCELERATOR PEDAL AND THE VEHICLE RESPONDED SLOWLY. THE FAILURE PERSISTED EACH TIME THE CONTACT WAS APPROACHING EITHER A RED TRAFFIC LIGHT OR A STOP SIGN UNTIL THE CONTACT WAS ABLE TO GET THE VEHICLE BACK TO THE RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 79,000.",
        "vin": "3FADP4EJ8FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400333,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPENING PASSENGER DOOR TO DEPOSIT BAGS INTO PASSENGER SEAT DOOR LATCH MALFUNCTIONED AND WOULD NO LONGER ALLOW DOOR TO FULLY LATCH AND REMAIN CLOSED. THE LATCH MECHANISM MOVED FREELY WHEN MANIPULATED AND WAS NOT STUCK IN THE CLOSED POSITION. VEHICLE WAS NOT IN MOTION AND PARKED, BUT HAD TO BE DRIVEN AFTER THE LATCH FAILURE RESULTING IN THE PASSENGER DOOR WANTING TO SWING OPEN WHEN DRIVING IF NOT HELD. THERE WAS AN ACTIVE RECALL SHOWN FOR 2014-2015 FORD FIESTA'S DOOR LATCH, BUT I WAS TOLD MY VIN DID NOT QUALIFY FOR THE RECALL AND WAS CHARGED $325.17 FOR THE REPAIR/REPLACEMENT AT THE LOCAL DEALERSHIP.",
        "vin": "3FADP4EJ7FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "02/20/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397619,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED WHILE DRIVING 25 MPH, THE ENGINE OVER HEATED AS THE VEHICLE STALLED. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE FAILED TO RESTART AND THE VEHICLE WAS TOWED TO EWALD'S VENUS FORD (2727 E LAYTON AVE, CUDAHY, WI 53110) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ENGINE NEEDED TO BE REPLACED. THE CONTACT RELATED THE ISSUE TO A HEAD GASKET FAILURE. THE CONTACT STATED THAT THE HEAD GASKET HAD BEEN REPLACED ONCE PRIOR TO OWNING THE VEHICLE HOWEVER, THE FAILURE OCCURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 76,000.",
        "vin": "3FADP4BEXFM"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S FRONT DRIVER SIDE WINDOW SPONTANEOUSLY FELL OFF TRACK AND INTO THE DOOR WHILE IN A CAR WASH AT DEALERSHIP. OPERATOR WAS OVERCOME WITH WATER, ENTIRE INTERIOR WAS SOAKING WET.",
        "vin": "3FADP4BJ4FM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389409,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED AFTER REFUELING THE VEHICLE, THE VEHICLE STALLED AND WAS UNABLE TO RESTART. THE CONTACT STATED THAT SEVERAL UNKNOWN WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED.  UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 15V005000 (FUEL SYSTEM, GASOLINE) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND INFORMED THE CONTACT THAT REPAIRS WOULD BE AN OUT OF POCKET EXPENSE. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000.",
        "vin": "3FADP4EJ0FM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386894,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION HAS BEEN HAVING PROBLEMS SINCE THE DAY I DROVE MY VEHICLE OFF THE LOT. I MADE SEVERAL ATTEMPTS TO BRING IT BACK WITHIN WARRANTY; HOWEVER, I WAS TOLD NOTHING WAS WRONG AND DEPARTED HOME.   SINCE THEN, I BROUGHT IT BACK ABOUT 2 MORE TIMES & WAS TOLD AGAIN AND AGAIN, THE TRANSMISSION FELL 'WITHIN WORKING CAPABILITIES'. NOT LONG AFTER, I RECEIVED A RECALL IN THE MAIL REGARDING THE TRANSMISSION.   WHEN I BROUGHT THE CAR BACK AGAIN AND SHOWED THE REPRESENTATIVE(S) THE LETTER, I WAS REASSURED EVERYTHING WOULD BE TAKEN CARE OF. I LEFT PAYING A $100 DIAGNOSTIC FEE AND NOTHING WAS DONE TO THE VEHICLE.   AT THIS POINT, THE VEHICLE ISN'T RELIABLE AT ALL. I'VE ALREADY INVESTED $1,200 INTO FIXING A HVAC BLEND DOOR ACTUATOR ISSUE THAT APPEARED SHORTLY AFTER ITS' PURCHASE. I INFORMED FORD MARGATE ABOUT THIS ISSUE AS WELL; BUT AS MANY TIMES AS I CALL, THE ISSUES GET OVERLOOKED AND FORGOTTEN ABOUT ON THEIR END.   I ONLY HAVE 65K MILES ON THE CAR & IT ROLLS BACKWARDS IF I'M ON A HILL. THIS HAPPENS AS SOON AS I TAKE MY FOOT OFF THE BREAK AND I ANTICIPATE HITTING THE GAS. BEFORE I CAN EVER DO THAT, THE CAR STARTS ROLLING  BACKWARDS AS IF IT'S A MANUAL. THE TRANSMISSION CONSISTENTLY SHUTTERS AND THE GEARS DON'T AUTOMATICALLY SHIFT PROPERLY. IS THERE ANY WAY YOU CAN LOOK INTO THESE ISSUES?",
        "vin": "3FADP4FJ8FM"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386861,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE FRONT WINDSHIELD BUBBLED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER ANTELOPE VALLEY FORD (1155 AUTO MALL DR, LANCASTER, CA 93534 (888) 415-0959) WHERE IT WAS DIAGNOSED WITH NEEDING THE WINDSHIELD TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 20.",
        "vin": "3FADP4AJ1FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378660,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2015 FORD FIESTA AND AFTER REFUELING, THE VEHICLE WOULD NOT IMMEDIATELY START. AFTER SEVERAL TIME ATTEMPTING THE VEHICLE RESTARTED, THE VEHICLE WOULD NOT ACCELERATE PROPERLY AND WOULD LOSS MOTIVE POWER WHILE DRIVING AND STALLED AT A RED LIGHT. AFTER DRIVING FOR APPROXIMATELY ONE MILE, THE VEHICLE WOULD NOT OPERATE NORMALLY.",
        "vin": "3FADP4EJ2FM"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375600,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING UP MY TANK, I LEFT THE GAS STATION AND IMMEDIATELY APPROACHED A RED LIGHT. WHEN I CAME TO A STOP, MY ENGINE RPM DIPPED AND MY VEHICLE STALLED OUT. I HAVE NOTICED RPM DIPPING THAT OCCURS WHEN I STOP AT A RED LIGHT, USUALLY AFTER I ADD FUEL. OTHER THAN THIS STALL EVENT REPORTED, I HAVE NOT EXPERIENCED ANOTHER, BUT THE RPM DIPS DO OCCUR OFTEN, AGAIN, AFTER ADDING GAS OR FILLING MY TANK. THE DIPPING PERSISTS USUALLY FOR AT LEAST 30 MINUTES AFTER ADDING FUEL. LUCKILY I WAS ABLE TO RESTART MY CAR RIGHT AWAY WITH NO TROUBLE. RPM DIPPING WAS OBSERVED AT EACH STOP ON MY WAY HOME. INTENSITY OF THE DIP VARIED.",
        "vin": "3FADP4EJ7FM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366925,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MANY OCCASIONS WHEN MY VEHICLE IN IN MOTION THE CRUISE CONTROL COMES ON WITHOUT ANY PROMPT AND ACCELERATES WHILE TRAVELING ON STREETS AND HIGHWAYS. THIS DEFECTIVE CRUISE CONTROL HAS CAUSED MYSELF AND MY WIFE TO NEARLY HAVE AN ACCIDENT. THIS IS AN EXTREMELY DANGEROUS VEHICLE BECAUSE OF THIS FAULTY CRUISE CONTROL. THE ONLY WAY TO STOP THIS FAULTY ERROR IS TO IMMEDIATELY ENGAGE THE FOOT BRAKE PEDAL BUT THIS MAY HAPPEN AGAIN IN A SHORT PERIOD OF TIME.",
        "vin": "3FADP4BJ8FM"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365883,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V177000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER CORWIN FORD (3600 KIETZKE LN, RENO, NV 89502, (775) 329-8800) HOWEVER, THE PARTS WERE NOT YET AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3FADP4EJ9FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365438,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT AFTER REFUELING THE VEHICLE, THE VEHICLE SPUTTERED AND NEARLY STALLED. THE CONTACT STATED THAT THE VEHICLE IDLED VERY LOW. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER WARRANTY TWO YEARS AGO, FOR THE SAME FAILURE HOWEVER, THE FAILURE RECURRED. SUNNYVALE FORD (650 E EL CAMINO REAL, SUNNYVALE, CA 94087) WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED TO SCHEDULE AN APPOINTMENT FOR A DIAGNOSTIC TEST TO BE PERFORMED. THE VEHICLE WAS NOT TAKEN TO A DEALER DUE TO THE REPAIR COST. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE CONTACT WAS REFERRED TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 67,000.",
        "vin": "3FADP4GX4FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363511,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FUELING VEHICLE IT TURNS OFF.",
        "vin": "3FADP4GX8FM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361698,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT AFTER REFUELING, THE VEHICLE WOULD NOT IMMEDIATELY START. AFTER RESTARTING, THE VEHICLE WOULD NOT ACCELERATE PROPERLY AND WOULD LOSS MOTIVE POWER WHILE DRIVING. AFTER DRIVING FOR APPROXIMATELY ONE MILE, THE VEHICLE WOULD OPERATE NORMALLY. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER AUTONATION FORD BRADENTON LOCATED AT 5325 14TH ST W, BRADENTON, FL 34207, AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "3FADP4BJ9FM"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361529,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V177000 (LATCHES/LOCKS/LINKAGES) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT A DOOR UNLOCKED WHILE DRIVING WITHOUT WARNING OR AN AUDIBLE NOTIFICATION. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TAKEN TO AUTONATION FORD TUSTIN (2 AUTO CENTER DRIVE, TUSTIN, CA 92782) AND THE VEHICLE WAS INSPECTED AND THE CONTACT WAS INFORMED THAT THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 69,705.",
        "vin": "3FADP4BJ6FM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361144,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS NOT MINE. I HAD LEASED IT FOR 3 YEARS AND I TURNED IT BACK IN TO AUTONATION FORD (BRADENTON, FL) IN OCTOBER 2017. I'M SURE THEY CAN TELL YOU WHO HAS IT NOW.",
        "vin": "3FADP4BJ2FM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361196,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD CRACKLING AND POPPING COMING FROM SPEAKERS,EVEN WHEN RADIO IS OFFHAND VOLUME IS DOWN",
        "vin": "3FADP4TJ9FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ONLY HAS 64000 MILES AND THE DUAL CLUTCH TRANSMISSION WAS RECALLED! I TOOK IT TO THE FIRD DEALERSHIP AND THEY TOLD ME I WOULD HAVE TO PAY $2200.00 TO HAVE IT FIXED AND THATS WHAT THEY SAID I WOULD HAVE TO PAY BEFORE THE PART ON THE RECALL COULD BE REPLACED PLEASE I NEED SOME ANSWERS PLEASE!",
        "vin": "3FADP4BJ9FM"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352468,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT AS HE WAS MAKING A LEFT TURN AND HE WAS REAR ENDED. THE LEFT REAR QUARTER PANEL WAS HIT AND THE VEHICLE TURNED SIDEWAYS. AS A RESULT, THE REAR AXEL WAS BENT AND THE LEFT REAR WHEEL WAS ANGLED INWARD. THE VEHICLE HAD TO BE TOWED TO A DEALER BODY SHOP FOR GREEN CHEVROLET, INC. 8017 KNOXVILLE AVE, PEORIA, IL 61615 (888) 701-3462. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE DEALER DIAGNOSED ISSUE AS A DAMAGED AND BENT AXLE AND WANTED TO REPLACE IT WITH A USED AXLE. THE VEHICLE WAS STILL BEING REPAIRED WITH ANOTHER USED AXEL AT THIS TIME. THE MANUFACTURER HAD NOT BEEN CALLED YET. THE FAILURE MILEAGE WAS 69,800.",
        "vin": "3FADP4BJ4FM"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350342,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION GOES INTO NUTURAL WHILE DRIVING CREATING A LOSS OF POWER WHILE IN MOTION. THE AIR BAGS WILL NOT DEPLOY AND THE LIGHT INDICATOE IS TURNED ON ON THE DASH DISPLAY. GAS MILLEAGE HAS GREATLY DECREASED.",
        "vin": "3FADP4EJ7FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348815,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE VEHICLE HESITATED WHILE DRIVING AT VARIOUS SPEEDS WHILE DEPRESSING THE ACCELERATOR PEDAL. THE CONTACT STATED THAT THE TRANSMISSION WARNING LIGHT WAS ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO ANDERSON FORD OF ST. JOSEPH (2207 N BELT HWY, ST JOSEPH, MO 64506) WHERE THE CONTACT WAS INFORMED THAT THE TRANSMISSION WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 64,000.",
        "vin": "3FADP4BJ9FM"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RESIVOUR CAP, SIEZED UP FIRST TIME I WAS TRYING TO ADD COOLANT. IT TOOK ALONG TIME GET IT OFF! LITTERLY HAD TO BREAK CAP INTO PIECES. AND WITH OEM PART CAP. FROM THE FORD DEALERSHIP REPLACED IT? IN NOW IT'S, OVERHEATS AND NO VISIBLE COOLANT LEAK. AND THIS HAS BEEN GOING ON FOR SEVERAL MONTHS.. THE MOTOR MAKES A CLACKING SOUNDS. THE 1.0 TURBOCHARGE 3-CYL TURBO IS NOT WORKING PROPERLY. PLUS IT'S ENGINE BAY FUSE BOX SAYS ENGINE FAN IS 60 AMPS IN RECENTLY I NOTICED IT HAS HAD A 40 GAGE AMP. THANK THAT THE UNDER THE HOOD ENGINE FAN. WASN'T PERFORM AT THE RECOMMENDED FUSE.. IT ALSO AT START UP AND SITTING STILL AT MOTOR BOG'S DOWN LIKE IT'S ABOUT TO CUT OFF. KNOW THE OVERHEAT PROUBLEM'S. IF I'M SITTING STILL IN NEUTRAL AND I TURN THE AC ON FULL-BLAST IT STAYS AT 4 BARS WHICH IS NORMAL FOR AS LONG AS I WANT AND IT DOESN'T OVER HEAT ? BUT, SOON AS I PUT IT IN 1ST GEAR AND TRY TO DRIVE IT WILL OVERHEAT, NOT EVEN GOING 10FT AND I HAVE TO TURN OFF THE AC AND PUT IT ON THE HEAT. FULL BLAST! WITHIN A FEW MINUTES IT SLOWLY GOES DOWN. BUT KNOW THAT IT'S JULY IF IT'S ANYTHING OVER 90 DEGREES OUTSIDE I HAVE TO TURN HEAT ON FULL BLAST BEFORE MAKING IT 1-BLOCK OR IT OVERHEATS. IN I HAVE KEPT A CLOSE WATCH ON THE COOLANT LEVEL, AND I HAVE WATCHED YOUTUBE VIDEOS AND ETC? TRYING TO FIGURE OUT WHAT'S WRONG. IN ALL MY PARTS STORE LOCATION DON'T HAVE ANY THING FOR MY YEAR MAKE MODEL NOTHING. I GOT THIS CAR FROM A DEALERSHIP A YEAR AGO OF THE MONTH JULY. IN IT GETS REGULAR OIL CHANGES, BUT I'M LOST TRYING TO FIGURE OUT WHAT IS WRONG, AND WHAT TO DO ABOUT IT AND OTHERS I KNOW OF HAVE HAD SAME PROUBLEM WITH THERE'S ..  AND I HAVE TO HAVE HEAT ON FULL HOT ON 1-2 LEVEL IN 70 DEGREE WEATHER, AND IF I GET ONTO THE INTERSTATE AND GO TO 55-70 MPH I TURN HEAT LEVEL TO 4 FULL BLAST AND IT WILL STILL GO UP TO 1 BAR AWAY FROM IT TELLING ME THAT ENGINE IS OVERHEATED. & AT 2500 RPMS IT OVERHEATS! SMH",
        "vin": "3FADP4BE6FM"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR AN OIL CHANGE AND THE TECHNICIAN DIAGNOSED AN OIL LEAK IN THE EXHAUST. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 17V209000 (ENGINE AND ENGINE COOLING). THE CONTACT CALLED KEITH HAWTHORNE FORD LOCATED AT 617 N MAIN ST, BELMONT, NC 28012, AND INFORMED TO SCHEDULE AND APPOINTMENT TO HAVE THE VEHICLE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3FADP4EJ7FM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "04/16/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11323608,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY IN A CAR ACCIDENT WHERE THE STEERING WHEEL AIR BAG WAS ACTIVATED AND METAL FRAGMENTS CAME THROUGH THE AIR BAG AN CUT MY HEAD OPEN.   MY ACCIDENT WAS HEAD ON IMPACT WITH A STATIONARY DWELLING.  ALL WINDOWS WERE FULLY INTACT UPON AND AFTER IMPACT.  UPON RETRIEVING MY ITEMS FROM MY VEHICLE I TOOK NOTICE TO ALL THESE METAL FRAGMENTS IN THE VEHICLE.*DT  *TR",
        "vin": "3FADP4AJ9FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/25/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322906,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I DISCOVERED AFTER ACCESSING MY LEFT REAR PASSENGER DOOR THE OTHER DAY AND ATTEMPTING TO SHUT IT, THAT THE LEFT REAR PASSENGER DOOR LATCH  APPEARS TO HAVE FAILED, PREVENTING MY VEHICLE'S DOOR FROM LATCHING SHUT. I CURRENTLY HAVE TO KEEP IT CLOSED BY USING THE LEFT REAR PASSENGER SEATBELT THROUGH THE HANDLE OF THE DOOR, OTHERWISE THE DOOR WOULD SWING FREELY WHILE DRIVING. THE VEHICLE DOES NOT LOCK NOW, AND THE OPEN DOOR INDICATOR LIGHT REMAINS OPEN DUE TO THE FAILED LATCH.",
        "vin": "3FADP4EJ7FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322403,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE WOULD STALL AS THE SERVICE ENGINE WARNING LIGHT FLASHED. THE MANUFACTURER SENT OUT A NOTIFICATION TO HAVE THE VEHICLE SERVICED UNDER A CUSTOMER SATISFACTION WARRANTY. THE VEHICLE WAS TAKEN TO  KARL FLAMMER FORD (41975 US HWY 19 N, TARPON SPRINGS, FL 34689) WHERE HE WAS THEN INFORMED THAT THEY COULD NOT REPAIR THE VEHICLE UNTIL THEY RECEIVED A CERTAIN PART TO REPAIR THE TRANSMISSION. WHILE AT THE DEALER, THE CONTACT STATED THAT THE TRANSMISSION CONTROL MODULE WAS UPDATED ; DESPITE THE UPDATE, THE FAILURE PERSISTED. THE CONTACT WAS INFORMED BY THE DEALER THAT HE WOULD BE NOTIFIED OF WHEN THE PART BECAME AVAILABLE. THE MANUFACTURER HAD BEEN NOTIFIED OF THE FAILURE  AND CONFIRMED THE INFORMATION PROVIDED BY THE DEALER. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 161,000. *DT *JS",
        "vin": "3FADP4EJ9FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319540,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH TO OPEN THE CAR FROM THE DRIVERS DOOR BROKE FROM OPENING. THE MATERIAL DOES NOT DO WELL WITH THE HEAT.",
        "vin": "3FADP4EJ4FM"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "09/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2015 FIESTA THAT HAS 811 MILES ON IT.    THE VIN # [XXX]. I BOUGHT FOR    MY DAUGHTER AND SHE HAS HAD THREE ACCIDENTS.    SHE HAS NOT DRIVEN THE LAST 1  YEARS, AS THE      HIDE ORIGINAL MESSAGE  POLICE SAID IT WAS HER FAULT, ALTHOUGH SHE SAID    THAT THE CAR JUST MOVED FORWARD! AT THAT TIME    WE DID NOT HAVE ANY IDEA THAT THE FIESTA HAD    ANY PROBLEMS. SHE ALSO HAS NOT BEEN ABLE TO    WORK BECAUSE THIS WENT AGAINST HER RECORD.    I HAVE HAD THE CAR IN MY GARAGE, AND HIRE SOMEONE    ABOUT EVERY SIX MONTH TO COME AND SERVICE THIS CAR.    MAY I ASK THAT YOU CONSIDER REFUNDING TO ME THE PRICE    I PAID AND YOU CAN THEN HAVE THIS CAR BACK.    THANKING YOU IN ADVANCE FOR ANY CONSIDERATION.    KIND REGARDS,    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3FADP4BJ3FM"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316277,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU PUT GAS IN IT DON'T WANT TO START BACK . AND FOR NO ODD REASON IF YOU SLOW DOWN THE LIGHTS ON INSIDE FLICKERS AND  SHUTS CAR COMPLETELY OFF",
        "vin": "3FADP4CJXFM"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "04/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312162,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY WHILE DRIVING AND STOPPED AT STOP SIGNALS THE CAR SHUTS OFF. THE CAR ALSO OCCASIONALLY SHUTS OFF WHEN SLOWING DOWN. THE CAR ALWAYS SHUTS OFF SHORTLY AFTER FUELING, THIS MAY OCCUR BETWEEN 1-4 TIMES AFTER FUELING.    THERE HAS ALSO BEEN OIL SLOWLY ACCUMULATING AROUND THE ENGINE BLOCK NEAR THE TOP OF THE BLOCK NEAR THE VALVE COVER.",
        "vin": "3FADP4AJ4FM"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307018,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME GAS IS FILL (AND VEHICLE IS OFF), ONCE DONE PUMPING GAS, THE VEHICLE WILL NOT WANT TO START RIGHT AWAY, IT WILL TURN OFF WHILE DRIVING. THIS ONLY OCCURS LITERATELY AFTER PUMPING GAS.  1/30/20 WAS THE LAST TIME IT WAS FILLED WITH GASOLINE. BUT EVERY WEEK GAS IS PUMPED IT ALWAYS HAPPENS.  THIS STARTED WHEN MILEAGE WAS ABOUT 20,000.00 I BELIEVE, I IMMEDIATELY CALLED AND WAS INFORMED TO CALL A TOLL. I ALSO SPOKE TO THE SALESPERSON AND INFORMED HIM. I WAS INFORMED THEN TO CHANGE GAS TYPE.  ALSO BEEN TAKING THE VEHICLE FOR SAME PLACE (FORD) FOR OIL CHANGES, ALL THE SUDDEN THERE IS AN OIL LEAK AS WELL. UNSURE HOW, WHEN EXACTLY IT HAPPENED. IT'F VERY MINOR, BUT INTERESTING BEING THAT THE VEHICLE IS NOT THAT OLD. ON ANOTHER NOTE JUST TO INFORM, THE SUSPENSION OR SOMETHING LIKE THAT NEEDED TO BE COMPLETELY REPLACE DUE TO BEING FACTORY DEFECTED. AT THE TIME, VEHICLE WAS STILL UNDER WARRANTY. FOR BOTH ISSUES.",
        "vin": "3FADP4AJ4FM"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306338,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR ONE NIGHT AND IN THE MIST OF DRIVING , IT WAS JERKING REALLY BAD AND THE ACCELERATION WAS GOING IN AND OUT . THE CAR CAME TO A COMPLETE STOP AND EVEN THOUGH IT WAS ON AND RUNNING IT WOULDN'T MOVE AS IF IT WAS STUCK , LUCKILY BEFORE SOMEONE HIT ME BEHIND IT JUMPED BACK INTO TO GEAR AND STARTED TO MOVE A LITTLE UNTIL IT STARTED TO JERK AGAIN. I DIDN'T GO ANYWHERE BUT 2 MINS DOWN THE STREET AND BACK HOME. ONCE I GOT HOME AND WAS READY TO LEAVE AGAIN IT WOULDN'T START ANYMORE AND NOW I NO LONGER HAVE A CAR AND I HAVEN'T EVEN HAD IT LONG. I TOOK THE CAR TO FORD AND IT WAS STATED THAT IT'S A RECALL ON SOMETHING TO DO DUE WITH MY TRANSMISSION AND ON THE PAPER THE SAME EXACT THINGS THAT I WAS EXPERIENCING WAS ON THE RECALL POSSIBLE SYMPTOMS.",
        "vin": "3FADP4BJ0FM"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301535,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACING IGNITION SWITCH ON 2015 FORD FIESTA 23 JAN 2020 AND WAS NOTIFIED BY THE FORD SERVICE MANAGER AT FAIRWAY FORD IN EVANS, GA, THAT THE STEERING WHEEL LOCKING SYSTEM WAS NOT INSTALLED ON VEHICLE.  THIS ALSO DID NOT LOCK GEAR SHIFTER.  WE ARE NOW HAVING TO HAVE IT INSTALLED AND PAYING TO HAVE IT INSTALLED.  LUCKY THE VEHICLE WAS NOT IN ANY ACCIDENTS.",
        "vin": "3FADP4EJXFM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THERE WAS A SHUDDER IN THE TRANSMISSION. THE CONTACT RECEIVED A FIELD SERVICE ACTION AND HAD THE VEHICLE REPAIRED AT ALLAN VIGIL FORD (6790 MT ZION BLVD, MORROW, GA 30260). THE CONTACT STATED THAT AFTER THE REPAIR, THE TRANSMISSION WARNING LIGHT ILLUMINATED AND RETURNED THE VEHICLE TO THE DEALER. THE CONTACT WAS PROVIDED AN ESTIMATE OF $2,800 TO HAVE THE VEHICLE REPAIRED. THE MANUFACTURER WAS NOTIFIED AND A CASE WAS FILED WITH THE MANUFACTURER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 197,000.",
        "vin": "3FADP4BJ3FM"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289646,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR LIKES TO DECELERATE WHEN MY FOOT IS ON THE GAS. SOMETIMES IT WILL STOP WHILE I AM DRIVING IT ON THE ROAD I HAVE REPEATEDLY TAKEN IT IN TO THE DEALERSHIP WHERE I PURCHASED MY VEHICLE. THEY KEEP SAYING NOTHING IS WRONG. I KNOW FOR A FACT THAT A CAR SHOULD NEVER STOP UNLESS YOUR FOOT IS ON THE BRAKE. ALSO MY CHECK ENGINE LIGHT IS ALWAYS ON AND THE DEALERSHIP WHERE I PURCHASED MY CAR HAS TURNED IT OFF FOR ME AND IT WILL JUST TURN BACK ON.",
        "vin": "3FADP4BJ0FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288042,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON INTERSTATE 95 AT 70 MILES PER HOUR WHEN MY VEHICLE JUST TURNED OFF. I WAS DRIVING DURING NORMAL CONDITIONS, ON 12/09/2019 IN FLORIDA. ALL OF THE DASH LIGHTS REMAINED ON AND THE VEHICLE GAVE NO INDICATIONS THAT THE ENGINE WAS GOING TO CUT OFF. I HAD JUST HAD MY BATTERY TESTED A FEW DAYS PRIOR AND IT WAS IN GOOD WORKING ORDER. I WAS ABLE TO SAFELY PULL MY VEHICLE TO THE SIDE OF THE INTERSTATE THIS TIME AND THE VEHICLE STARTED AGAIN WHEN I TRIED. IT STALLED A SECOND TIME BEFORE I WAS ABLE TO MERGE BACK INTO TRAFFIC. IT RESTARTED AGAIN AND I WAS ABLE TO MAKE IT TO MY DESTINATION. I HAVE LOOKED AT THE RECALL LISTS FOR FORD AND THE 2014-2015 FORD FIESTA IS ON THE LIST WITH THE ISSUE MY VEHICLE EXPERIENCED BUT MY VIN IS NOT INCLUDED IN THAT RECALL. WILL THERE BE A RECALL ON MY VIN? THE CURRENT RECALL DEALS WITH THE FUEL PUMP STALLING THE VEHICLE. THE RECALL NUMBER RELATING TO THE FUEL PUMP PLATING IS 14S30. NHTSA CAMPAIGN NUMBER IS 15V005000",
        "vin": "3FADP4BE1FM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282113,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL AIRBAG DID NOT DEPLOYED BUT THE AIRBAG UNDER STEERING WHEEL DEPLOY",
        "vin": "3FADP4EJXFM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282270,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE OPERATING THE VEHICLE AND DEPRESSING THE CLUTCH PEDAL, THE ENGINE WOULD SOMETIMES SUDDENLY SHUT OFF. THE FAILURE ALSO OCCURRED WHILE THE ENGINE WAS IDLING. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED. THE LOCAL DEALER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 110,000.",
        "vin": "3FADP4GX3FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271420,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FINISH PUMPING GAS AND START THE CAR THE CAR STARTS TO SHAKE AND STOPS COMPLETELY.",
        "vin": "3FADP4BJ6FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "01/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256027,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS A SHUDDER ON TAKEOFF. THE TRANSMISSION MALFUNCTION LIGHT CAME ON AND WOULD NOT ENGAGE INTO GEAR.",
        "vin": "3FADP4TJ9FM"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254978,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR ABOUT A YEAR IN A HALF NOW WHEN I PUT GAS IN MY CAR AND GO TO START THE CAR, IT WILL SPUTTER AND SHUT OFF. IT WILL DO THIS FOR ABOUT 5 MINS AFTER GETTING GAS. THEN I WILL DRIVE AWAY. WHEN WAITING TO PULL OUT OF THE GAS STATION IT WILL SHUT OFF. RECENTLY WHEN THE CAR IS IN PARK IT WILL SPUTTER A LITTLE RPMS WILL GO FROM 1 TO ALMOST 0. TODAY 9/12/2019 I WAS SLOWING DOWN TO A RED LIGHT AND THE CAR JUST SHUT OFF. I COASTED UP TO THE LIGHT PUT IT IN PARK AND STARTED IT AGAIN. IT SPUTTERED AND AS I CAME UP TO THE NEXT RED LIGHT IT DID IT AGAIN. THIS DOES THIS NO MATTER HOW MUCH GAS IS IN THE CAR WHEN I FILL UP.  THE DEALER WON'T DO ANYTHING ABOUT IT CAUSE IT'S NOT UNDER RECALL. THIS IS VERY UNSAFE. I HAVE KIDS IN MY CAR. NOT WHAT I WANT GOING ON WITH THEM IN THE CAR AND IN TRAFFIC DAILY.",
        "vin": "3FADP4BJ8FM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254469,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO ACCELERATE ENGINE STALLS WHEN TRYING TO MOVE CAR DOESN'T RESPOND AND DIES. CAR WAS IN A CITY STREET",
        "vin": "3FADP4AJ3FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254571,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS REVERSE PARKING IN A PARKING LOT MY TRANSMISSION JUST STALLED AND I WAS UNABLE TO GO REVERSE, I HEARD THE REVVING BUT SHE WAS NOT MOVING. I TURNED MY CAR OFF AND RESTARTED IT SHE WAS REVVING BUT DIDN'T MOVE. I SHUT HER OFF HER FIVE MINUTES AFTER THAT AND RESTARTED HER AND I WAS ABLE TO PARK HER. AFTER THIS HAPPENED, LEAVING THE PARKING LOT THE CAR STARTED TO JERK FORWARD AND HAVING A HARD TIME TRANSITIONING INTO THE NEXT GEAR (IT'S AUTOMATIC) IT STALLED AS I WAS SLIGHTLY APPLYING PRESSURE TO ACCELERATE IN TRAFFIC IT WAS VERY SCARY. MY CAR HAS 54,000 MILES.",
        "vin": "3FADP4BJ7FM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 5,
        "odiNumber": 11254586,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I STOPPED AT A RED LIGHT AND WAS REAR ENDED IN AN AUTOMOBILE ACCIDENT AND MY AIR BAGS DIDN'T DEPLOY.",
        "vin": "3FADP4EJ9FM"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "04/12/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245410,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE TRANSMISSION FAILED WHEN HE PURCHASED THE VEHICLE. WHILE DRIVING AND DEPRESSING THE ACCELERATOR PEDAL, IT TOOK AWHILE FOR THE VEHICLE TO ACCELERATE. ALSO, WHEN DRIVING AROUND A CURVE, THE VEHICLE HESITATED TO MOVE FORWARD AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN NUMEROUS TIMES TO REYNOLDS FORD OF NORMAN (825 N INTERSTATE DR, NORMAN, OK, 73069, (877) 672-2681) WHERE AN UNKNOWN UPDATE WAS COMPLETED. THE VEHICLE WAS ABLE TO DRIVE NORMALLY FOR A DAY; HOWEVER, THE FAILURE RECURRED AND WORSENED. IN ADDITION, WHILE ACCELERATING FROM A STOP, THE VEHICLE FAILED TO ACCELERATE AND HESITATED TO MOVE FORWARD. THE VEHICLE WAS NOT REPAIRED. THE CONTACT ALSO STATED THAT THE STRUTS WERE REPLACED AT 20,000 MILES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 66,000.",
        "vin": "3FADP4EJ8FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245115,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD FIESTA HAS THE SAME ISSUES WITH THE TRANSMISSION AS DO THE OTHER FIESTAS THAT ARE BEING RECALLED.",
        "vin": "3FADP4BJ3FM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING 45 MPH, THE AIR BAG INDICATOR ILLUMINATED. THE CONTACT DROVE THE VEHICLE TO AN INDEPENDENT MECHANIC AND WAS ADVISED TO TAKE THE VEHICLE TO THE DEALER. THE CONTACT CALLED LARRY MILLER FORD (460 E AUTO CENTER DR, MESA, AZ 85204 (480) 569-7713) AND WAS INFORMED THAT THEY WANTED TO CHARGE HIM FOR THE REPAIRS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT DID NOT WANT TO PAY FOR THE DIAGNOSTIC FEE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED TWO CASE NUMBERS. THE FAILURE MILEAGE WAS 65,000. THE VIN WAS UNKNOWN. *BF     CONSUMER STATED WHILE DRIVING APPROXIMATELY 45 MILES PER HOUR THE AIR BAGS LIGHT CAME ON. I TOOK THE CAR TO THE AUTO SHOP AND THEY SAID THE AIRBAGS WILL NOT DEPLOY. I WAS TOLD THAT IT IS A MANUFACTURER DEFECT. SALAZAR USED CARS WENT OUT OF BUSINESS.*JB",
        "vin": "3FADP4EJ7FM"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240984,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR REGULARLY SHUDDERS. ACCELERATION IS A PROBLEM. PROBLEMS OCCUR WHILE DRIVING AND SWITCHING GEARS IN ALL ROAD TYPES ESPECIALLY HILLS.",
        "vin": "3FADP4TJ4FM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234477,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS OUT OF GEAR DURING NORMAL CITY DRIVING. I HAVE HAD THE CAR COMPLETELY LOCK UP, BECOME UNABLE TO DRIVE, AND NEEDED TO BE TOWED TO THE DEALERSHIP. THIS IS THE 3RD TIME I HAVE ENCOUNTERED THIS ISSUE. I'VE HAD THE TRANSMISSION COMPUTER RESTARTED, ONE OF THE CLUTCHES REPLACED, THEN A FEW MONTHS AFTER THAT HAD THE CAR TOWED TO THE DEALERSHIP AGAIN DUE TO \"IMMOBILIZER MALFUNCTION\" DESIGN FOR THE CAR IS GREAT BUT THE MECHANICS ARE TERRIBLE.",
        "vin": "3FADP4EJ5FM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233930,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING THE VEHICLE WITH FUEL, THE CAR WILL NOT START FOR AT LEAST 5 MINUTES.  ONCE DRIVING THE RPMS WILL FLUCTUATE RAPIDLY WHILE I HAVE MY FOOT ON THE GAS. THE CAR WILL HAVE TROUBLE ACCELERATING AND THEN SPEED UP AND I HAVE TO BE CAREFUL TO STOP IT. IF I HAVE TO STOP AND START TOO MANY TIMES IN TRAFFIC THIS WILL ALSO CAUSE THE RPMS TO FLUCTUATE AND THEN THE CAR WILL STALL. I HAVE TO THROW IT IN PARK AND THEN TRY TO RESTART REAL FAST AND WHEN I RESTART IT IT ACCELERATES QUICKLY.",
        "vin": "3FADP4BJ9FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232941,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE SLIPS OUT OF GEAR WHILE IN TRAFFIC AND LEAVE ME COASTING WITH THE ENGINE RACING.  THIS HAPPENS EVERY TIME IT IS DRIVEN.",
        "vin": "3FADP4BJ0FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11232358,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ON THIS VEHICLE HAS LOCKED UP SEVERAL TIMES. WITHIN A WEEK OF PURCHASING THIS 2015 FORD FIESTA IN JANUARY 2016, I HAD TO TAKE IT BACK TO THE DEALERSHIP FOR TRANSMISSION ISSUES.  THE CAR WAS JERKING AND WOULDN'T TAKE THE GAS OR BACK UP.  THEY KEPT THE CAR FOR A WEEK AND TOLD ME THAT THEY REPLACED SOME ITEMS WITHIN THE TRANSMISSION AND GAVE IT BACK TO ME FOR MY TEENAGE DAUGHTER TO DRIVE. SINCE THAT DAY, I'VE TAKEN THE CAR BACK SEVERAL TIMES FOR THE SAME ISSUE.  THE TECHNICIANS HAVE STARTED TELLING ME THAT THERE'S NOTHING WRONG WITH THE CAR WHEN CLEARLY THERE IS SOMETHING WRONG WITH THE CAR. IT HAS STALLED AND WOULD NOT MOVE AND CARS WERE COMING THAT HAS ALMOST GOTTEN MY TEENAGE DAUGHTER KILLED. I HAVE TAKEN IT BACK TO THE DEARLERSHIP SEVERAL TIMES FOR THIS ISSUE AND THEY KEEP REFRESHING IT BUT NOTHING CHANGES.  I HAVE HAD TO MAKE MY DAUGHTER PARK THE CAR SINCE SHE'S A COLLEGE STUDENT AND PURCHASE HER A NEW VEHICLE.  THIS VEHICLE IS NOT SAFE AND I CERTAINLY WOULDN'T RECOMMEND ANYONE PURCHASING THIS CAR.   FORD HAS BEEN NO HELP IN RESOLVING THIS SITUATION.  SHE HAD A CAR ACCIDENT ON A COUNTY STREET ON 8/13/2018  BECAUSE OF THIS VEHICLE'S ISSUES BUT THE AIRBAGS DIDN'T DEPLOY.",
        "vin": "3FADP4AJ8FM"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232391,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A CRASH TOTALING THE VEHICLE WHEN BRAKING THE CAR DID NOT SLOW DOWN  THIS INCIDENT HAPPENED ON AN INTERSTATE",
        "vin": "1FADP3J28FL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230899,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG LIGHT IS ON AND  THERE IS NO REASON FOR IT TO HAVE COME ON. THE CAR HAS 85000 MILES ON IT AND WARRANTY DOESN'T COVER IT. I THINK WE HAVE AN ISSUE HERE OF ITS NOT COVERED UNDER A WARRANTY THROUGH FORD UP TO 65000 MILES. THIS IS A HUGE SAFETY ISSUE. IT ONLY COMES ON AND STAYS ON WHEN CAR HOES INTO DRIVE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229503,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS HAVING ELECTRICAL ISSUES, THE TRANSMISSION WILL OVER REV BUT MY SPEED REMAINS THE SAME OR DECREASES. THE CAR WILL LOSE POWER OVER TIME AND THE PEDAL WILL BECOME SPONGY. THIS HAS BECOME A VERY LARGE INCONVENIENCE AND AN EXTREME SAFETY HAZARD TO MYSELF AND MY PASSENGER. I WAS ALMOST IN A COLLISION WITH ANOTHER VEHICLE WHICH WOULD BE DEEMED MY FAULT EVEN THOUGH IT WOULD ME THE VEHICLE MALFUNCTIONING. WHEN CONTACTING FORD DEARBORN AND PERRY FORD THEY TELL ME THERE'S NOTHING THEY CAN DO OR I CAN PAY A FEE.",
        "vin": "3FADP4EJ5FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "03/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS AFFECTED BY THE PROBLEMATIC POWER SHIFT DUAL-CLUTCH 6 SPEED AUTOMATIC TRANSMISSION. IT HAS BEEN TO THE SERVICE DEPARTMENT TWICE SINCE NOVEMBER 2018 FOR TRANSMISSION ISSUES. FORD CLAIMS MY VEHICLE IS NOT COVERED BY THE POWERTRAIN WARRANTY EXTENSION FOR VEHICLES WITH THIS TRANSMISSION IN THIS RANGE OF YEARS. THEY ARE UNRESPONSIVE TO EXPLAIN WHY I DON'T GET THE EXTENDED COVERAGE WHEN MY VEHICLE CLEARLY QUALIFIES. THERE SHOULD BE POWERTRAIN WARRANTY COVERAGE ON THIS VEHICLE FOR 100K MILES VS 60K MILES. WHEN I ASK ABOUT IT, THEY TELL ME TO FILE A COMPLAINT WITH NHTSA. THE CAR ONLY HAS 53K MILES ON IT. IT HAS SUFFERED FAILED CLUTCHES, WORN INPUT SHAFT BEARINGS, AND PROBABLY A BAD TCM. IT IS IN THE SHOP NOW FOR THE TCM. THE PROBLEMS CAUSE SHUTTERING, LURCHING, POOR ACCELERATION, AND FAILURE TO DOWNSHIFT, WHICH IS DANGEROUS WHEN TRYING TO MERGE INTO TRAFFIC. ALL THESE THINGS HAPPEN FROM A DEAD STOP OR DECELERATION FOR A TURN, AND ACCELERATION.",
        "vin": "3FADP4CJ7FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222636,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG AND CAR SHUT OFF HAD IT TOWED TO PEP BOYS AND WAS TOLD THAT IT WAS A CRACK IN CYLINDER VALVE.  INFORMED THAT THEY COULD NOT FIX IT AND THEN HAD IT TOWED BUTLER AUTOMOTIVE WHERE IT IS SITTING AS OF 6/25/19.",
        "vin": "3FADP4BJ6FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION IS SLIPPING. WHEN TRYING TO ACCELERATE, ENGINE WILL REV, RPM INCREASE,  BUT SPEED WON'T CHANGE. THIS IS CAUSED SAFETY ISSUES FOR MYSELF AND MY PASSENGERS AS IT IS DIFFICULT TO INCREASE SPEED AND KEEP UP WITH ON GOING TRAFFIC. MY CAR IS UNSAFE TO DRIVE.",
        "vin": "3FADP4BJ9FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218736,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FUEL PUMP IS FAILING CAUSING MY CAR TO STALL AT STRANGE TIMES.",
        "vin": "3FADP4TJ9FM"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218273,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE ABOUT A YEAR AGO WARNING MY VEHICLE MAY RANDOMLY STALL DUE TO A DEFECT WITH THIS VEHICLE. ABOUT 6 MONTHS LATER I STARTED EXPERIENCING RANDOM STALLS MAINLY WHILE STOPPED AT RED LIGHTS. I HAVE LOST MY RECALL NOTICE AND WHEN I CONTACTED MY LOCAL FORD DEALER THEY SAID THE VIN ASSOCIATED WITH MY VEHICLE WAS NOT ON THE RECALL LIST. HOWEVER, FORD HAS A PUBLIC RECALL RELATING TO A FUEL PUMP WARNING THE EXACT PROBLEM MY VEHICLE IS EXPERIENCING AND IT IS A HUGE SAFETY CONCERN. FORD REFUSES TO REPAIR THE VEHICLE.",
        "vin": "3FADP4BJ1FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217895,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LEFT DOOR OPENED WHILE I WAS DRIVING.   I STOPPED THE CAR TO CLOSE THE DOOR AND THE DOOR DIDN'T CLOSE ANYMORE. DOOR LATCH IS BROKEN. THERE IS A RECALL 15S16 FOR THE 2011-2014 FIESTAS FOR THIS SAME REASON. IT IS CLEAR THAT 2015 MODELS HAVE THE SAME PROBLEM. THIS IS A SAFETY CRITICAL ISSUE THAT NEEDS TO INVESTIGATED IN 2015 FIESTA MODEL SINCE THE ISSUE IS STILL PRESENT FROM SAFETY RECALL WITH NUMBER 15S16.  THE DOOR OPENED WHILE I WAS DRIVING AND COULD HAVE INJURED OR KILLED A PERSON.  I CONTACTED FORD AND THEY CANNOT CONFIRM THAT MY 2015 FORD WHICH I BOUGHT IN 2014 DOES NOT HAVE THE SAME AFFECTED PART NUMBERS FOR THE DOOR LATCHES AS THE 2011 TO 2014 MODELS.",
        "vin": "3FAFP4AJXFM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL TRANSMISSION SLIPPING ON FIRST GEAR. I ALMOST HAVE A COLLISION DUE TO THE PROBLEM, I WAS READY TO TURN ON A BUSY INTERSECTION WHEN THE SLIPPING HAPPEN AND JUST BECAUSE THE OTHER VEHICLE STOP, I DIDN'T HAVE THE COLLISION HEAD ON. SO I DECIDED TO TAKE IT TO THE FORD DEALER FOR REPAIRS, WHEN AFTER DIAGNOSTICS I WAS TOLD BY THE SERVICE ADVISOR THAT THEY NEED TO DO AN OVERHAUL ON THE MANUAL TRANSMISSION AFTER MY VEHICLE IS DRIVING FOR LESS THAN 9500 MILES.",
        "vin": "3FADP4AJ1FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION IS SLIPPING. I WILL PUSH DOWN THE ACCELERATION AND HEAR MY ENGINE REV, HOWEVER, MY CAR WILL NOT ACCELERATE. THIS HAS CAUSED SAFETY ISSUES FOR MYSELF AND OTHER DRIVERS ON THE ROAD. MY CAR IS UNSAFE TO DRIVE.",
        "vin": "3FADP4BJ0FM"
    },
    {
        "components": "INTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/06/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207308,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT WHEN STARTING THE VEHICLE, THE FUEL TANK WOULD INDICATE A HALF TANK OF FUEL AND AFTER BEING DRIVEN A FEW MILES DOWN THE ROAD, THE FUEL GAUGE INDICATED THAT THERE WAS A FULL TANK OF FUEL. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR A DIAGNOSTIC TESTING OF THE FAILURE DUE TO THE FAILURE JUST STARTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATELY FAILURE MILEAGE WAS 30,000. *DT*JB",
        "vin": "3FADP4BJ2FM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203610,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE DOORS. BOTH LATCHES BROKE. THE DOOR WONT STAY CLOSED. THEY OPEN WELL I'M DRIVING. THE BACK DOOR LATCH WENT OUT 2 WEEKS AGO AND THE FRONT WENT OUT 2 DAYS AGO. THEY HAVE A RECALL ON THE SAME MODEL FROM 2012 TO 2014. I BOUGHT MY CAR IN JULY OF 2014 SO I'M PRETTY SURE THEY WERE USING THE SAME LATCHES. IT HAPPEN AT MY HOUSE AT 6601 EUCALYPTUS SPC 358 BAKERSFIELD CA",
        "vin": "3FADP4BJXFM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "09/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193492,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STATIONARY AND IN NEUTRAL MY CAR WILL STALL AND NOT TURN BACK ON. I'VE HAD THE BATTERY TESTED AND THAT ISN'T THE ISSUE. THIS HAPPENS ON CITY STREETS, MOSTLY WHILE WAITING AT LIGHTS. ON MULTIPLE OCCASIONS, I'VE HAD TO PUSH THE CAR OUT OF AN INTERSECTION, THROUGH A LIGHT. THE CAR WILL NOT TURN ON UNTIL AN HOUR OR MORE HAS PAST. THIS HAPPENED FOR THE FIRST TIME ON SEPTEMBER 2ND 2018. I TOOK THE CAR TO A FORD DEALERSHIP AND THEY WEREN'T ABLE TO TELL ME WHAT WAS WRONG WITH IT OR CORRECT THE ISSUE. SINCE THEN IT'S HAPPENED MULTIPLE TIMES.",
        "vin": "3FADP4AJ7FM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191251,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SEVERAL MONTHS SINCE I'VE HAD THE CAR. IT WILL FROM TIME TO TIME STALL OUT. NOW IT CRANK BUT WON'T START UP. YOU CAN BE DRIVING OR IDLE AND THE CAR SHAKES AND STALLS OUT. DUE TO THIS IT CAUSED MY CAR TO OVERHEAT. MY CAR WILL CRANK BUT NOT MOVE AT ALL. THE OTHER ISSUE SINCE I BOUGHT THE CAR IT RAN HOT. SO HOT TO THE POINT THAT IT CRACK THE RADIATOR HOSE. I REPLACED. THE CAR WOULD RUN HOT IF YOU SAT IDLE WHILE DRIVING FOR TOO LONG.",
        "vin": "3FADP4BJ6FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190655,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WILL STUTTER EVERY TIME AFTER FUELING UP AND SOMETIMES STALL WHILE PULLING OUT INTO ONCOMING TRAFFIC. THIS HAS BEEN AN ONGOING DEFECT SINCE PURCHASING THE CAR.  I BROUGHT THIS TO THE DEALERS ATTENTION YEARS AGO AND THEY DID NOTHING ABOUT IT.  I HAVE FOLLOWED THERE REFUELING INSTRUCTIONS PER THERE MANUAL SINCE PURCHASING THE CAR AND THIS MAKES NO DIFFERENCE.   THIS SHOULD BE A SAFETY RECALL, THIS DEFECT CREATES A VERY UNSAFE DRIVING CONDITION.",
        "vin": "3FADP4GX1FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190454,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS 3 YEARS OLD AND HAD THE TRANSMISSION REPLACED 6 MONTHS AFTER I PURCHASED THE CAR AND THEN IT HAD THE TRANSMISSION CONTROL MODULE REPLACED - NOW I ALWAYS TAKE MY CAR TO THE DEALER FOR REPAIRS : MY CAR BROKE DOWN 2 WEEKS AGAIN AMD I HAD IT TOWED TO THE DEALER - THEY TOLD ME I HAD TO PAY FOR A NEW BATTERY IN ORDER FOR THEM TO FIND OUT WHAT WAS WRONG WITH MY CAR $300 IT COST ME ( I JUST REPLACED THE BATTERY IN MY CAR 6 MONTHS AGO), BRIGHT CAR HOME AND CHECK ENGINE LIGHT WAS ON( I ASKED TO SPEAK WITH A MANAGER AT THIS POINT AND THE MANAGER IN CHARGE TOLD ME THAT THEY WOULD GET IT FIXED -$73 IT COST ME. ( I WAS CHARGED ONLY FOR THE PART-NO LABOR ) BRIGHT CAR HOME ON THURSDAY AND CAR WAS MAKING A NOISE SO I TEXTED THE MANAGER AND HE SAID IF IT WAS STILL SAFE TO DRIVE THEN DO SO AND BRING IT IN ON MONDAY. IT BROKE DOWN THAT SUNDAY AND WAS TOWED INTO DEALER. NOW THE ENGINE IS RUINED AND THEY EXPECT ME TO PAY FOR IT WHEN IT WAS THEIR NEGLECT THAT CAUSED THE ENGINE TO BLOW. IT WAS THE TIMING BUILT - WHEN THEY FINALLY REALIZED THAT IT WAS TOO LATE. I WAS NOT CHARGED FOR THE TIMING BELT EITHER. I TAKE MY CAR ONLY TO CHAPMAN FORD 9371 ROOSEVELT BLVD 19114",
        "vin": "3FADP4BJ2FM"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PAST ONE YEAR EVERY TIME I REFUEL MY CAR WORKS WEIRD FOR A COUPLE OF MILES. WHILE I'M DRIVING AND STOPS AT INTERSECTIONS OR WHATEVER REASONS, IT FEELS LIKE THE ENGINE WANTS TO STOP (RPM DROPS TO/BELOW 500). AFTER A FEW MILES THE PROBLEM IS GONE UNTIL THE NEXT REFUELING.  ALL SYSTEM IS NORMAL AS PER THE COMPUTER / DEALERSHIP DIAGNOSTICS, AND I COULDN'T FIGURE OUT WHAT IS THE REASON.",
        "vin": "3FADP4BJ6FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2019",
        "dateOfIncident": "06/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVER SINCE I'VE HAD MY CAR THE TRANSMISSION FEELS LIKE ITS GOING OUT IT JERKS REALLY HARD WHEN YOU PRESS ON THE GAS TO TRY TO TAKE OFF.",
        "vin": "3FADP4BJ1FM"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165985,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  MY VEHICLE HAS BEEN STALLING OUT SOON AFTER FUELING AND REQUIRING 3-5 MINUTES BEFORE BEING ABLE TO STAR THE VEHICLE. OFTEN TIMES AFTER FUELING THE VEHICLE DOES NOT START BACK UP RIGHT AWAY.   IN THE LAST 4 MONTHS, I'VE BEEN SEEING THIS ISSUE PROGRESS EVEN AFTER SPEAKING WITH AND GETTING A DIAGNOSIS FROM THE FORD DEALERSHIP WHERE THE VEHICLE WAS PURCHASED. IN THE LAST 3 WEEKS. MY 2015 FORD FIESTA HAS STALLED OUT ON ME WHILE DRIVING 4 TIMES! I CAN LITERALLY BE DRIVING ON THE FREEWAY WHEN THE BATTERY AND ENGINE LIGHTS TURN ON AND MY VEHICLE AUTOMATICALLY SHUTS OFF. THIS WAS A PREVIOUS RECALL AN I HAVE NOT BEEN ABLE TO GET ANY SOLID RESPONSES AS TO WHETHER OR NOT MY VEHICLE STILL QUALIFIES FOR THIS RECALL. THIS ISSUE IS A SERIOUS SAFETY CONCERN AND THE FACT THAT FORD IS NOT GIVING SOLID ANSWERS AS TO WHETHER OR NOT THEY WILL FIX IT IS BEYOND ME. I STILL HAVE 2 YEARS LEFT ON MY WARRANTY AND THEY ARE STILL GIVING ME A HARD TIME.",
        "vin": "3FADP4BJ5FM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2019",
        "dateOfIncident": "12/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164352,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS AT START UP AFTER GAS IS PUT IN CAR, ENGINE LIGHT IS ON AND STALLS WHEN STOPPED WHILE FOOT ON BREAK AND STALLS AT TIMES WHILE DRIVING ON BOTH SIDE ROADS AND HIGHWAYS. HAS HAPPENED A HANDFUL OF TIMES. ENGINE LIGHT TURNS OFF FOR A COUPLE DAYS THEN TURNS BACK ON AND STAYS FOR MONTHS AT A TIME",
        "vin": "3FADP4EJ6FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164033,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I FILL UP AT THE GAS STATION, WHILE MY CAR IS AT AN IDLE ANY TIME WITHIN DRIVING A MILE THE IDLE DROPS LIKE THE ENGINE WANTS TO CUT OFF OR STALL. AFTER DRIVING A MILE IT SEEMS FINE AND NO OTHER PROBLEMS UNTIL THE NEXT FILL UP. THIS HAPPENS EVERY FILL UP. TRIED LEAVING THE GAS NOZZLE IN THE FILL HOLE FOR UP TO 10 SECONDS AND IT DOESN'T HELP.",
        "vin": "3FADP4AJ7FM"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163355,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "6 SPPED TRANSMISSION FAILS TO START UP.  I HAVE TO PLACE THE IGNITION BACK INTO THE KEY LOCATION ON DASH TO START CAR.  ALSO, THERE ARE EXHAUST FUMES COMING INTO THE INTERIOR OF THE CAR WHEN I USE THE HEATER FAN,",
        "vin": "4FADP4BJXFM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "09/17/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161321,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   ON MONDAY, SEPTEMBER 17, 2018, MY HUSBAND AND I HAD OUR CAR TOWED TO FRIENDLY FORD.  IT BROKE DOWN WHILE DRIVING 35 MILES AN HOUR.  IT HAD LESS THAN 21,000 MILES ON IT.  OUR SERVICE ADVISER SAID WOULD BE ABOUT FRIDAY OR SATURDAY OF THAT WEEK BEFORE WE COULD GET A DIAGNOSIS.  HE INITIALLY TOLD US THAT THERE WAS NO MORE BUMPER TO BUMPER WARRANTY LEFT ON THE CAR (IT HAD EXPIRED ON JUNE OF 2018), BUT THAT IT PROBABLY WOULD BE COVERED WITH THE POWERTRAIN WARRANTY SO WE LEFT THE CAR AT FRIENDLY FORD.  HE DETERMINED THAT THE ENGINE BELT JUMPED 45 DEGREES WHICH CAUSED IT TO GET CAUGHT IN THE PULLEY OF THE TIMING BELT AND THAT IT WAS NOT COVERED BY THE POWERTRAIN WARRANTY.  I CALLED THE FORD CORPORATION AND WAS TOLD THAT IF IT WAS NOT COVERED BY A WARRANTY THAT THEY WOULD BE ABLE TO FURNISH A CUSTOMER SATISFACTION WARRANTY ESPECIALLY WITH SUCH A LOW MILEAGE ON THE CAR, BUT WHEN I CALLED BACK TO ASKED THEM ABOUT IT, I WAS TOLD THERE WAS NOTHING AVAILABLE.  WHEN WE BOUGHT THE CAR IT ONLY HAD 10,093 MILES ON IT AND WE DIDN'T EVEN PUT 11,000 MILES ON IT BEFORE ALL OF THIS HAPPENED.  AFTER WE HAD IT TOWED TO AUTO AIR AND MORE, THEY CHECKED IT OUT AND FOUND THAT SAME PROBLEM.  WE WERE TOLD THAT THIS WAS THE THIRD FORD FIESTA THAT HAD HAD THE SAME PROBLEM BUT OURS WAS BY FAR THE WORST CASE.  FRIENDLY FORD TOLD US THAT THEY DID NOT KNOW WHY THE TIMING JUMPED 45 DEGREES BUT THERE HAS TO BE AN REASON WHY IT JUMPED.  A CAR WITH LESS THAN 21,000 MILES DOES NOT JUMP ON IT'S OWN WITHOUT SOME REASON FOR IT.  IT HAPPENED REAL FAST TOO.",
        "vin": "3FADP4EJ3FM"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156921,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE ISSUES: THE AIR BLEND DOOR ACTUATOR FAILED AND IS A KNOWN PROBLEM ON ALL FIESTAS AND FORD REFUSES TO FIX WITHOUT CHARGING $800. IT FAILED AT 37,000 MILES, 1000 MILES OVER THE BUMPER TO BUMPER WARRANTY. ADDITIONALLY, THE SLIDE PINS ON THE BREAK CALIPERS FREEZE OFTEN AND NEED TO BE GREASED TWICE A YEAR IN ORDER TO PREVENT BREAKS BEING STUCK ON.",
        "vin": "3FADP4GX8FM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149995,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR LOCK ON THE REAR PASSENGER STOPPED WORKING WHILE I WAS DRIVING. THE DOOR AJAR LIGHT CAME ON ON MY DASH AND THE DOOR CAME OPEN WHILE DRIVING. I PULLED OVER TO THE SIDE OF THE ROAD TO CHECK THE DOOR. I TRIED REPEATEDLY TO CLOSE THE DOOR AND IT WOULD NOT LATCH OR STAY SHUT. I HAD TO RIG THE DOOR CLOSED BY TYING IT OFF INSIDE THE VEHICLE SO I COULD PROCEED HOME FROM WORK. I HAVE NOT BEEN ABLE TO DRIVE THE VEHICLE SINCE THEN.",
        "vin": "3FADP4BJ8FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145358,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE TRANSMISSION FAILED TO PROPERLY ENGAGE WHEN SHIFTING GEARS AND UPON APPLYING THE ACCELERATOR PEDAL. THE PREVIOUS OWNER INDICATED THAT THE TRANSMISSION FAILURE WAS INTERMITTENT AND WORSENED ONCE THE CONTACT OBTAINED OWNERSHIP. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC WHO STATED THAT FURTHER DIAGNOSTIC TESTING WAS NEEDED. TWO DEALERS WERE CONTACTED: CASA FORD (5815 MONTANA AVE, EL PASO, TX 79925, (915) 779-2272) AND CAMELBACK FORD (1330 E CAMELBACK RD, PHOENIX, AZ 85014, (602) 635-7551), BUT THE FAILURE COULD NOT BE DIAGNOSED OR REPAIRED. THE CONTACT STATED THAT THE VEHICLE CONTINUED TO LOSE POWER, THE TRANSMISSION FAILED TO ENGAGE, AND THE VEHICLE WOULD ACCELERATE SUDDENLY. THE VEHICLE WAS DEEMED UNSAFE TO DRIVE AND REMAINED PARKED SEVERAL TIMES DUE TO THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 16,000.",
        "vin": "3FADP4BJ0FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144032,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 FORD FIESTA STALLS OUT EVERY TIME AFTER I GET GAS. IT TAKES A COUPLE OF TRIES TO GET IT STARTED UP AGAIN. ONCE I DO GET IT STARTED IT DOES DRIVE JERKY WHILE STATIONARY AND IN MOTION, AND SEEMS LIKE IT IS GOING TO STALL OUT. AFTER ABOUT DRIVING FOR 15 MINS MOST OF THE TIME MY CAR GOES BACK TO DRIVING NORMAL UNTIL I GET GAS AGAIN. I RECENTLY SAW THE FORD FOCUS HAS BEEN RECALLED FOR A FUEL TANK PROBLEM WHICH CAUSED IT STALL OUT AFTER FUELING, THIS SOUNDS VERY SIMILAR TO MY PROBLEM WITH MY FORD FIESTA.",
        "vin": "3FADP4BJ6FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHWAY MILES UNDER , 100,000 . VEHICLE WOULDN'T START IN YARD, GOT A JUMP, TOOK IT TO CROWN FORD DEALERSHIP FOR REPAIR, FORD STATED THEY TOOK CARE OF RECALL AND, CAR WAS READY AND I DROVE 3 MILES, CAR STARTED STALING AND WOULDN'T GO UP THE HILL, RETURNED CAR TO FORD,  I WAS TOLD THE CAR HAD A PROBLEM  WITH THE ENGINE-  CAR IS JUST 3 YEARS OLD I WAS SOLD A DEFECTIVE CAR.",
        "vin": "3FADP4CJ6FM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "01/25/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140158,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DRIVE THG H ED CAR IT LOSES POWER I HAVE HAD IT SERVICED SERVERAL TIME I WAS THY OLD IT IS AS FACTORY DEFECT",
        "vin": "3FACP4CJXFM"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL\"  AS I DON'T HAVE NO WHERE'S  TO GET THIS CAR FIX YET MORE ISSUES  ANOTHER PROBLEM TO ADD IS WHEN GOING PUT GAS IN THE TANK AT FIRST FUEL WAS COMING OUT LIKE IT US FULL HAVE HI LD THE PUMP UPSIDE DOWN THAN UNDER MY DASH BOARD WE HAD A SEVER RAIN STORM WHEN I GOT IN TO DRIVE UP WHEN LET UP WATER WAS RUNNING DOWN THE HAD AND BREAK PEDDLE AND I HAVE FILL VIOLENT UP 2X IN LESS 5 WEEKS I DON'T KNOW WHERE IT'S GOING PAST 2 WEEKS OFF AND ON SMELLS BURNING SMELL LIKE FUEL NOT ALL THE TIME THIS WAS WHEN I WAS DRIVING AND THE WINDOW WIPERS THEY GO FAST BUT LIKE WASN'T WORKING WELL WHEN TANNING MORE THAN A LITTLE RAIN AS YOU HAVE ALL OTHER ISSUES LISTED  BAILY FORD'S WROTE THE DON'T WANT ME THERE AND REFUSED ME SERVICE BECAUSE I HAVE BEEN COMPLAINING 2 HALF YEARS JUST TELL ME IN AUGUST MY WARRANTY RAN OUT NOT MY ISSUES 19,001  DOLLARS   CAR  THEN THERE  SEEMS MY STEERING WHEEL HAS SLOP ON IT AND HAVE ISSUES ISSUES FROM DAY ONE JUST DON'T GET AND BECAUSE OF THESE ISSUES NO GARAGES WANT TO TOUCH IT ONE BECAUSE TO MUCH TO FIX ANDBTIME THEY DON'T HAVE THE MAN POWER HEAD TOLD CHEAPER TO GET ANOTHER NEW CAR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/10/2018",
        "dateOfIncident": "09/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128451,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MANY TIMES, MY CAR DOES NOT DOWN SHIFT AFTER BEING IN A PASSING GEAR AND THEN LETTING OFF THE GAS. IT STAYS AT 5,000 RPM FOR A FEW SECONDS.     JULY, 2018, MY CAR WAS STOPPED AS I WAS WAITING TO MAKE A LEFT TURN. AS I PRESSED ON THE GAS TO TURN LEFT, MY CAR SLIPPED INTO NEUTRAL. BECAUSE MY BRAKE LIGHTS WEREN'T ON, MY CAR WAS HIT FROM BEHIND BY AN APPROACHING CAR.     SEPTEMBER 3, 2018 MY CAR WAS STOPPED, I PUT IT INTO REVERSE TO BACK INTO A PARKING SPOT. WHEN I PRESSED THE ACCELERATOR THE CAR SHIMMIED AND MOVED FORWARD INSTEAD OF REVERSE.",
        "vin": "3FADP4BJ3FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128600,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVER SINCE I GOT THE CAR, WHEN I PUT FUEL IN IT, AND TURN IT ON, IT'LL STALL IF I'M STOPPED OR AT A STOP SIGN OR LIGHT. IT'LL DO IT FOR THE WHOLE DAY AFTER I PUT GAS IN IT. IT DOES NOT MATTER IF PRIOR TO FILLING IT IS EMPTY, HALF TANK OR FULL TANK. IF I SIT AT A LIGHT LONG ENOUGH AFTER FILLING, IT TURNS OFF.",
        "vin": "3FADP4BJ2FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/11/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120147,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER DOOR LATCH FAILED.  THERE WAS A RECALL FOR THE LATCH FOR 2014 FORD FIESTAS, BUT NOT THE 2015.  THE DOOR WOULD NOT CLOSE, OR STAY CLOSED.  THE CAR WAS PARKED AT THE TIME, THIS WAS ALSO THE LEAST USED DOOR ON THE VEHICLE.  I AM JUST GRATEFUL MY 4 YR OLD DAUGHTER WAS ON THE OTHER SIDE OF THE CAR, AND THAT IT DID NOT HAPPEN WHILE DRIVING.",
        "vin": "3FADP4BJ5FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "03/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119283,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY SINGLE TIME I STOP TO PUT GAS IN MY CAR I TURN MY CAR OFF PUMP MY GAS AND ONCE I CRANK MY CAR BACK UP FOR AT MY CAR DIES AND I HAVE TO TURN MY IGNITION OFF THEN RESTART MY CAR. AND THEN MY CAR WILL START TO FLUTTER LIKE IT'S HAVING TROUBLE GETTING GAS TO GO INTO THE RIGHT PLACE",
        "vin": "3FADP4BJ4FM"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED NUMEROUS FAILURES WITH THE TRANSMISSION, ELECTRICAL SYSTEM, ENGINE, AND BRAKE PADS. ALSO, THE VEHICLE FAILED TO ACCELERATE OVER 50 MPH, THE RPMS INCREASED INDEPENDENTLY, AND THE VEHICLE JERKED WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE ELECTRICAL SYSTEM FAILURE CAUSED THE INTERIOR LIGHTING, DOOR LIGHTS, HORN, AND THE ALARM SYSTEM TO FAIL. THE CONTACT WAS ALSO UNABLE TO LOCK OR UNLOCK THE DOORS WITH THE KEY. FURTHERMORE, THE LOW BEAM HEADLIGHTS FAILED AND THE CONTACT HAD TO DRIVE WITH THE HIGH BEAMS AT NIGHT. LASTLY, THE MOTOR FAN ACTIVATED INDEPENDENTLY. THE CONTACT SPOKE WITH AN UNKNOWN DEALER WHO STATED THAT THE VEHICLE HAD TOO MANY FAILURES AND COULD NOT BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 50.",
        "vin": "3FADP4EJ4FM"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/03/2018",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104348,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FORD FIESTA. CONSUMER WRITES IN ISSUES WITH VOICE COMMAND  AND KEEPING PHONE CONNECTED TO VEHICLE. *LD      THE CONSUMER STATED THE VEHICLE WOULD LOCK UP AND THE WINDOWS TAKE 45 MINUTES TO DEFROST. *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCORDING TO THE VIN SEARCH, MY 2015 FORD FIESTA ST (XXXX), IS NOT INCLUDED IN SAFETY RECALL 17S09.    HOWEVER, I AM EXPERIENCING THE EXACT SAME PROBLEM. THE FLUID LEVEL DROPPED UNEXPECTEDLY IN MY CAR, CAUSING SEVERE OVERHEATING, REQUIRING THE CAR TO BE SHUT DOWN. THERE ARE NO LEAKS, AND IT IS UNCLEAR WHERE OR HOW THE COOLANT LEVEL DROPPED. THERE WAS NO WARNING FROM THE CAR COMPUTER.     AN ENGINE RUNNING PROPERLY SHOULD NOT BURN COOLANT. I AM NOW BEING CHARGED TO HAVE THE COOLANT SYSTEM EXAMINED, EVEN THOUGH THIS SOUNDS EXACTLY LIKE THE RECALL AND ASSOCIATED COMPLAINTS.      PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "3FADP4GX5FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103615,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.....TRANSMISSION TCM & PCM MODULE  SHUTTERING, JERKING AND SHAKING   WHILE PROCEEDING FROM A  IDLE POSITION.  CLANKING NOSE UNDERNEATH CAR.  STILL HAVING ISSUES",
        "vin": "3FADP4EJ5FM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101818,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO RESTART ON THE FOURTH ATTEMPT, BUT THE FAILURE RECURRED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED ONE WEEK LATER. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 46,000.",
        "vin": "3FADP4EJ2FM"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101835,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT WILL NOT RETRACT AND RETRACTOR IS COMPLETELY BROKEN",
        "vin": "3FADP4EJ3FM"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097976,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY HAD 36315 MILES ON VEHICLE WHEN I WAS ADVISED BY QUICK LANE WHO IS ASSOCIATED WITH KELLER FORD THAT I ALREADY NEEDED TIRES. WARRANTY ON TIRES 60 THOUSAND MILES.  LEFT REAR SHOCK ALREADY LEAKING HYDRAULIC FLUID AND NEEDING TO BE REPLACED.",
        "vin": "3FADP4EJ5FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083274,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE FAILED TO ACCELERATE AND MADE A WHINING NOISE THAT WAS COMING FROM EITHER THE TRANSMISSION OR THE ENGINE. NO WARNING INDICATORS WERE ILLUMINATED. THE VEHICLE WAS TAKEN TO VIC BAILEY FORD (501 E DANIEL MORGAN AVE, SPARTANBURG, SC 29302, (864) 585-5600) WHERE IT WAS DIAGNOSED THAT A FAULTY CLUTCH ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 10,735.",
        "vin": "3FADP4CJ4FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "09/24/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080023,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING NOISE, SHIFTS GEARS TO FAST, JUMPS ON TAKE OFF, AND JERKS, CITY DRIVING",
        "vin": "3FADP4EJXFM"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "03/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079574,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING MY GAS TANK CARS STALLS UNEXPECTEDLY. ONLY HAPPENS WHEN GAS TANK IS FILLED TO FULL, BUT STALLS EVERY SINGLE TIME REGARDLESS OF WHERE GAS IS PURCHASED OR TIME OF DAY, ETC.",
        "vin": "3FADP4BJ8FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078961,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE VEHICLE SHIFTED GEARS ABNORMALLY AND AN ABNORMAL NOISE WAS HEARD. THE DEALER (DUVAL HONDA, 1325 CASSAT AVE, DOWNTOWN, FL 32205, (904) 899-1900) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THERE WAS NO RECALL FOR THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 59,000.",
        "vin": "3FADP4BJ3FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2018",
        "dateOfIncident": "02/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072203,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL MY CAR ENGINE STOPS RUNNING AFTER I PUT GAS IN TANK. IN THE MIDDLE OF THE STREET FEW TIMES.  AT STOP LIGHTS CITY STREET BUT IT SAID THAT MY VIN NUMBER ISN'T PART OF THE RECALL. I WOULD IT CHECKED OUT FROM DEALER",
        "vin": "3FADP4JXFM2"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064073,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 FORDFIESTA LOSES SPEED STALLS AND HAS BEEN BROUGHT IN TO DEALERSHIP IN RUSTON ,WAS TOLD IT WAS CLUTCH RECALL THEY FIXED IT AND IT STILL DRIVES HORRIBLE .I LOST SPEED NEARLY GOT HIT.ON WAY TO DEALERSHIP  NOW CHECK ENGINE LIGHT ON SAYS SERVICE NOW I'M UPSET THE AT HAS UNDER 22K MILES STALLS LOSES POWER",
        "vin": "3FADP4BJ3FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062925,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION WAS RECALL. THEY SUPPOSE TO BUY BACK. I OPEN CLAIM WITH FORD. LONG AGO BUT I WAS IGNORED BY FORD.",
        "vin": "3FADP4AJ3FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058392,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE SUDDENLY SLOWS DOWN AS WARNING LIGHTS ILLUMINATE AT THE EXACT SAME TIME. I HAD NO CHOICE BUT TO AVOID TRAFFIC AND TRY TO GET THE CAR OFF THE ROADS AS IT LOSES POWER. I COULD GET THE VEHICLE RESTARTED BUT COULDN'T GET THE SPEED BACK UP TO NORMAL.  I WENT TO THE DEALERSHIP AND WAS TOLD THAT I NEED A THROTTLE BODY REPLACEMENT, FOR A CAR WITH LESS THAN 50K MILES ON IT.",
        "vin": "3FADP4EJ1FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057468,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "ENIGIEN LIGHT COMES ON AND CAR WILL NOT GO ABOVE 2K RPMS AND WILL NOT REACH 50MPH. AFTER THE FIRST TIME I BROUGHT THE CAR IN TO A DEALER, AFTER TURNING THE CAR OFF THEY COULD NOT GET THE ANY CODES FOR 4 DAYS THEY FINALLY GOT A CODE SAYING ITS THE TPS THEY CHANGED THAT 2 DAYS LATER IT HAPPENED AGAIN THIS TIME THEY KEEP IT A WEEK BEFORE CALLING FORD AND FORD TOLD THEM TO CHANGE THE INSTRUMENT CLUSTER. A REPAIR OF 1K. ABOUT 90% OF FORDS HAVE INSTRUMENT CLUSTER UNDER AN EXTENDED WARRANTY. BUT NOT ON MY CAR.",
        "vin": "3FADP4EJ6FM"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054635,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING LAS VEGAS, GOING 70 MPH DOWN HILL AND MY CAR STARTED TO LOOSE POWER WHILE IT PRODUCED A LOT OF WHITE SMOKE. I WAS IN A VERY DANGEROUS SITUATION AND WAS STRANDED FOR 4 HRS IN THE MIDDLE OF NOWHERE. THE CAR NEVER GAVE SYMPTOMS JUST DIED. NO CHECK ENGINE OR OVERHEATING, OIL, COOLANT. I WAS TRAVELING ON A TRIP SO I DID HAVE LUGGAGE BUT I NEVER MAXED CAR WEIGHT. THE CAR IS 2 YEARS OLD WITH LESS THAN 48,000 MILES. I'VE DONE ALL MY MAINTENANCE ON MY CAR EARLY THAN STICKERS AND DON'T DRIVE HARD. SINCE I'VE HAD THE CAR I'VE ADDED ABOUT 10,000 MILES. BACK TO WHAT HAPPENED, I WAS ABLE TO GET TOWED TO BARSTOW FOR FREE BUT MECHANIC I WAS REFERRED TO WAS CLOSED. FRUSTRATING AND EMOTIONALLY SCARING. I HAD TO CUT A DEAL WITH THE TOW COMPANY TO DRIVE ME AS CLOSE AS POSSIBLE TO MY HOME IN 94536 ZIP AREA. BUT I COULD ONLY AFFORD TO SAN JOSE. THE NEXT DAY I ORDERED ANOTHER ROADSIDE ASSISTANCE TO FREMONT FORD DEALER AND HAVE TO WAIT UNTIL IT'S CONVENIENT FOR THEM TO DIAGNOSE IT FOR 179. I HAVEN'T SLEPT IN 48 HRS AND FORD NEEDS TO COMPENSATE ME FOR DISTRESS. MY CONFIDENCE IN THE CAR AND EXPERIENCE IS ON A STRING.",
        "vin": "3FADP4EJ0FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047508,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE ATTEMPTING TO OPEN THE DOOR, THE FRONT DRIVER'S SIDE INTERNAL DOOR HANDLE FRACTURED. THE CONTACT STATED THAT THE FRONT PASSENGER DOOR HANDLE WAS LOOSE. THE CONTACT WAS CONCERNED THAT THE PASSENGER'S DOOR HANDLE MAY ALSO FRACTURE. FORD OF WEST COVINA (2000 E GARVEY AVE S, WEST COVINA, CA 91791, (626) 709-3550) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 40,000. *TT  *TR",
        "vin": "3FADP4TJ3FM"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042731,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHEN THE VEHICLE WAS STARTED, THE AIR BAG WARNING INDICATOR ILLUMINATED AND REMAINED LIT. AN UNKNOWN DEALER WAS CONTACTED AND RECOMMENDED A DIAGNOSTIC TEST. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO THE DEALER FOR A DIAGNOSTIC TEST. THE VEHICLE WAS NOT TAKEN TO THE DEALER AND THE FAILURE WAS NOT DIAGNOSED. THE FAILURE MILEAGE WAS APPROXIMATELY 25,000.",
        "vin": "3FADP4AJ8FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "10/29/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041157,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY VEHICLE IN MULTIPLE TIMES DUE TO STUTTERING AND INCORRECT SHIFTING FROM MY TRANSMISSION. EACH TIME THEY SAY THEY RESET THE ENGINE THEN TEST IT AND CANT FIND A PROBLEM. A FEW WEEKS LATER MY VEHICLE IS ACTING UP AGAIN AND I REPEAT THE STEPS. I HAVE FINALLY GIVEN UP TRYING TO RESOLVE THE ISSUE WITH THE DEALER AND AM CONTACTING YOU DIRECTLY. I HAVE MY TWO KIDS IN THIS CAR AND IT IS FRIGHTENING TO THINK THAT I MAY BE DRIVING DOWN THE FREE WAY AND HAVE THE TRANSMISSION JUST CUT OUT ON ME. THEY KNOW IT IS AN ISSUE WITH THIS MAKE, MODEL AND YEAR AS WELL AS AN ISSUE WITH OTHER MAKES AND MODELS. THEY REPLACED MY BROTHERS FOCUS FOR A SIMILAR ISSUE BUT REFUSE TO ACT IN REGARDS TO MY CAR. I AM HONESTLY JUST SICK OF IT AND WANT MY CAR FIXED OR REPLACED.",
        "vin": "3FADP4BJXFM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2017",
        "dateOfIncident": "10/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040995,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING ASSIST STOPPED WORKING COMPLETELY AND CAR SHOWS A WARNING LIGHT FOR POWER STEERING ASSIST.  CAR HAS 88,000 MILES ON IT.  VERY DIFFICULT TO STEER AT ANY SPEED BUT MOST ESPECIALLY AT LOW SPEEDS",
        "vin": "3FADP4EE0FM"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032688,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MY CARS TRANSMISSION IS NOT WORKING WELL.",
        "vin": "3FADP4BJXFM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2017",
        "dateOfIncident": "08/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022506,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD WATER PUMPS AND A BAD TRANSMISSION CAR LEAKS HAD WATER PUMP REPLACED AND THE TRANSMISSION STALLED ON ME TWICE TRYING TO LEAVE A PARKING LOT TO GET ON THE MAIN HIGHWAY ALMOST GOT ME HIT BY ANOTHER CAR NOT HAPPY WITH THE CAR PUMP IS LEAKING AGAIN AND HAD IT REPLACED 10000 MILES AGO",
        "vin": "3FADP4BJXFM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "07/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WAS SHUTTERING. I WAS IN BELIEF THIS WAS A WARRANTY ISSUE AS OUR COMPANY HAS HAD THE SAME ISSUE WITH OTHER FIESTAS",
        "vin": "3FADP4EJ9FM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/25/2017",
        "dateOfIncident": "08/25/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS TWO YEARS OLD, ONE PERSON DRIVER, GOT IN CAR AND WENT TO SHUT DOOR.  HANDLE BROKE RIGHT OFF FOR NO APPARENT REASON, ALL PLASTIC. NEED WHOLE NEW DOOR $498, NOT INCLUDING LABOR.  FORD DEALERSHIP OR CORPORATE DID NOT CARE AT ALL OF COMMON SENSE THIS IS SHODDY WORKMANSHIP. STUCK, WILL NEVER BUY ANOTHER FORD AGAIN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "08/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015372,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING 5 MPH, THE VEHICLE FAILED TO ACCELERATE. THE CONTACT RESTARTED THE VEHICLE. THE VEHICLE WAS TAKEN TO ALLAN VIGIL FORD LINCOLN (6790 MT ZION BLVD, MORROW, GA 30260) WHERE THE CLUTCH WAS REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. WHILE DRIVING 50 MPH, THE VEHICLE STALLED AND ALL THE INSTRUMENT PANEL LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. A DEALER WAS NOT CONTACTED. THE VEHICLE WAS REPAIRED, BUT FAILED TO ACCELERATE ONCE AGAIN. THE VEHICLE WAS TAKEN TO COURTESY FORD (1636 DOGWOOD DR SE, CONYERS, GA 30013) WHERE IT WAS DIAGNOSED THAT THE CATALYTIC CONVERTER AND THROTTLE FAILED AND NEEDED TO BE REPLACED, AND THERE WAS A LEAK IN THE FUEL INJECTION VALVE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND STATED THAT THE CONTACT SHOULD KEEP THE RECEIPTS IN CASE OF A RECALL. NO ASSISTANCE WAS PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 7.",
        "vin": "3FADP4AJ3FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "07/26/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013570,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATES AND SPUTTERS WHEN TAKING OFF ON CITY ROADS, WHEN STOPPED AT STOP LIGHT OR MAKING A LEFT HAND TURN INTO TRAFFIC. REAL SCARY TO PULL OUT IN FRONT OF TRAFFIC, WHEN YOU COULD LOSE POWER. VERY STRESSFUL TO DRIVE. MISSES WHILE DRIVING ALSO. TCM HAS BEEN FLASHED. REPLACED. CLUTCH JUST REPLACED. OVERHEATING LIGHT COMES ON AND CAR LOSES POWER: ON CITY STREET, USUALLY WHEN STOPPED AT A TRAFFIC LIGHT. DANGEROUS.! HAS DONE MULTIPLE TIMES. 3RD TIME INTO DEALER FOR OVERHEATING. LAST TIME WHEN,  PULLED OVER, AFTER LOSING POWER, IN CITY TRAFFIC, HOOD WAS RAISED TO CHECK FAN, AND THE FAN WAS RUNNING BUT THIS IS WHAT DEALERSHIP REPLACED. OVERHEATING SEEMS TO HAPPEN WHEN STOPPED IN CITY TRAFFIC. OVERHEATING LIGHT COMES ON AND THEN THERE'S A POWER LOSS. I THINK THE ONLY REASON YOU DON'T HAVE A REAL LOT OF COMPLAINTS ABOUT FORD FIESTAS IS BECAUSE, I DON'T THINK A LOT OF PPL KNOW TO GO HERE TO REPORT PROBLEMS. I JUST FOUND IT.JUST LIKE PRIOR PERSON SAID, IF YOU TRY TO SELL IT, FORD REALLY TAKES ADVANTAGE OF YOU. EVEN THOUGH YOUR CAR IS ONLY TWO YEARS OLD, AND YOU HAVE A DEFECTIVE PRODUCT. THANK YOU.  SO YOUR STUCK...",
        "vin": "3FADP4BJ7FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/26/2017",
        "dateOfIncident": "11/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010806,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS UNSAFE TO DRIVE! IT HESITATES WHEN POWER IS EXPECTED. IT WILL DOWNSHIFT AND CAUSE CAR TO LUNGE  FORWARD WHILE BRAKING! THIS IS UNCONTROLABLE!! IT LUNGED INTO THE INTERSECTION AT A RED LIGHT (WHILE MY FOOT WAS ON THE BRAKE),  WITH CARS COMING TOWARD ME FROM BOTH SIDES!! THANK GOD THEY WERE ALL PAYING ATTENTION AND HAD GOOD BRAKES!! I COULD HAVE BEEN SERIOUSLY INJURED OR KILLED!! THIS AND THE HESITATING HAS HAPPENED MULTIPLE TIMES! I AM VERY NERVOUS EVERY TIME I DRIVE. AFRAID IT WILL CAUSE ME TO WRECK BUT IT IS ALL I HAVE TO DRIVE AND CANNOT GET ANYTHING ELSE WHILE MAKING PAYMENTS ON THIS ONE.  OTHERWISE , I WOULD NOT DRIVE IT!! *YOUR FORM ONLY ALLOWS ME TO ENTER ONE DATE WHEN THIS HAPPENED BUT IT HAS HAPPENED MULTIPLE TIMES! JUST DIFFERENT PLACES AND CIRCUMSTANCES.",
        "vin": "3FADP4EJ7FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "07/18/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010537,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD TO HAVE THE TRANSMISSION CONTROL MODULE REPROGRAMMED AT LEAST 4 TIMES BY 27,000 MILES AND CLUTCH REPLACEMENT. THE CAR IS UNSAFE TO DRIVE AS IT WILL HESITATE WHEN POWER IS NEEDED AND EXPECTED OR WILL DOWNSHIFT AND CAUSE CAR TO LUNGE AGGRESSIVELY FORWARD WHILE BRAKING. IT SEEMS ALSO COMMON FOR THE MODEL TO STALL ON HIGHWAY AND CLUTCHES REFUSE TO INGAGE IN ANY GEAR. I'VE HAD MANY OF THESE ISSUES OCCURRING AND IT IS A MAJOR SAFETY PROBLEM. I FEAR FOR MY SAFETY AND LIFE EVERY TIME I HAVE TO DRIVE IT.",
        "vin": "3FADP4EJ5FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005359,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE BLEW A HEAD GASKET BECAUSE OF THE ENGINE OVERHEATED. THE COOLING SYSTEM OVERHEATED. SO I HAD TO PURCHASE ANOTHER MOTOR FOR MY VEHICLE. THE MOTOR THAT WAS INSTALLED IS DOING THE SAME THING. THE COOLING SYSTEM IS OVERHEATING AND WHEN IT DOES I HAVE TO STOP THE CAR AND WAIT UNTIL IT COOLS OFF. I AM NOT SATISFIED WITH THIS VEHICLE. I AM PAYING FOR A VEHICLE AND CANNOT DRIVE IT A LONG DISTANCE WITHOUT IT OVERHEATING. I DRIVE 50 MILES FROM MY JOB AND CANNOT DRIVE MY VEHICLE THAT LENGTH OF DISTANCES WITHOUT MY GAUGE SHOWING OVERHEATING. ATTACHED TO THIS IS A COPY OF THE INVOICE THAT SHOWS PROOF THAT I HAVE HAD ANOTHER MOTOR INSTALLED AND THE REASON IT WAS INSTALLED.",
        "vin": "3FADP4BE0FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "07/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002699,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING INTO DRIVEWAY VEHICLE RUNS HOT. EVERYTHING POINTS TO COOLANT SENSOR READING INCORRECTLY. SEARCH RECALLS AND FIND THAT MY VEHICLE ISN'T EFFECTED YET THERE IS A SAFETY RECALL FOR SAME VEHICLE AND ENGINE SIZE USING THE SAME EXACT SENSOR. WORKED FOR FORD FOR 20 YEARS. HOW AND WHY ARE YOU ALLOWING FOR TO LIE AS TO THE PROBLEM WITH A POTENTIAL FIRE BEING A HEAD GASKET AND NOT THE FAULTY SENSOR THAT IS HAVING TO BE REPLACED? LET ME ANSWER THAT. SO THEY DO NOT HAVE TO RECALL EVERY SINGLE CAR THAT HAS THE SENSOR WHICH IS EVERY SINGLE ONE. LET'S ADD TO THIS THE FACT THAT FORD CAN THEN CLAIM THAT EVERYONE LEFT WITH AN OVERHEATED ENGINE WITH CRACKED HEADS IS RESPONSIBLE FOR THE DAMAGE AND NOT THE SENSOR THAT INCORRECTLY ADJUST FOR THE SYSTEM PRESSURE AND INCORRECTLY READS THE TEMPS. THANKS, THANKS FOR LOOKING OUT FOR THE CONSUMER. NOW I AM LEFT WITH THE CHOICE OF PAYING OFF  7GRAND ON PRACTICALLY NEW MODEL OR REPLACE THE ENGINE...AND SENSOR OF COURSE.",
        "vin": "3FADP4EJ2FM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/04/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985714,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CLACKING SOUND IN DASH DUE TO A FAULTY A/C ACTUATOR. (CAR WAS IN NEUTRAL AND STOPPED) THIS HAPPENS EVERYTIME THE CAR IS STARTED, IT LAST A FEW SECONDS AND QUITS. THE DEALER REPLACED UNDER WARRANTY AND IT'S BAD AGAIN AFTER 20K MORE MILES. (PART #AV1Z 19E616 K) FROM WHAT I CAN TELL READING THE FORUMS ALL FIESTA'S ARE HAVING THE SAME PROBLEM. THANK YOU",
        "vin": "3FADP4GX4FM"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2017",
        "dateOfIncident": "05/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON EASY ACCELERATION, THE THROTTLE RESPONSE GOES DEAD AT 20 TO 30 MPH, THE CAR SLOWS DOWN TO A CRAWL YET THE ENGINE SEEMS TO IDLE WELL...MY CAR HAS AUTOMATIC TRANSMISSION..FEARING REAR END COLLISION",
        "vin": "3FADP4AJ7FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2017",
        "dateOfIncident": "05/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SHUTTER IN THE TRANSMISSION , WHEN I TOOK IT IN THEY CLAIMED THE PROBLEM WASN'T SEVERE ENOUGH FOR FORD MOTOR TO FIX THE ISSUE.  THEY ARE AWARE OF THE PROBLEMS IN THESE VEHICLES BUT AREN'T WILLING TO FIX IT.   THERE IS ALSO A CLASS ACTION LAWSUIT DO TO THE ISSUE.   SHUTTER BEFORE CAR MOVES IN FORWARD PSOITION EVERY TIME I DRIVE THE VEHICLE .",
        "vin": "3FADP4EJ0FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2017",
        "dateOfIncident": "03/24/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980780,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE TRANSMISSION TENDS TO JERK OR SHAKE WHEN BRAKING AND COMING TO A STOP OR AT TIMES WHEN ACCELERATING. YOU CAN FEEL IT AND EVEN HEAR IT WITH THE WINDOW OPEN AT TIMES.",
        "vin": "3FADP4BJXFM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978777,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V005000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS 68,000.",
        "vin": "3FADP4TJ3FM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING 60 MPH,  THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO RESTART ON THE FIRST ATTEMPT, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT A FUEL LINE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED 2,000 MILES LATER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "3FADP4AJ7FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956349,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUTTERS, DELAYS, AND/OR JERKS WHEN ACCELERATING, MORE OFTEN THAN NOT. I HAVE BEEN TO FORD ON TWO OCCASIONS FOR THEM TO FIX THE SYSTEM SETTINGS ON THE COMPUTER IN MY CAR, WHICH THE RECALLS CLAIMS FIXES THE ISSUE, HOWEVER IT HAS ONLY GOTTEN WORSE. ATTACHED UNDER DOCUMENTATION IS INFORMATION REGARDING THE RECALL. THIS HAPPENS NOT ONLY WHEN ACCELERATING FROM A STOP, BUT EVEN WHEN I JUST SPEED UP ON THE HIGHWAY, WHICH I SEE TO BE EXTREMELY UNSAFE AND I AM NERVOUS DRIVING THIS VEHICLE, HOWEVER FORD CLAIMS THERE IS NO ISSUE AND THIS IS \"NORMAL.\"",
        "vin": "13FADP4BJ9F"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2017",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948524,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN INTERSTATE 85 SOUTH BETWEEN PERRY HILL ROAD AND EASTERN BOULEVARD WHEN A ROCK HIT MY FRONT WINDSHIELD DUE TO THE UNPAVED ROAD FROM CONSTRUCTION. MY WINDSHIELD WAS CRACKED INSTANTLY THEN STARTED TO SPREAD ACROSS.  *TR",
        "vin": "3FADP4EJ1FM"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "10/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936200,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING THE FUEL TANK, THE ENGINE HAS A TENDENCY TO STUMBLE AND STALL WHEN IDLING (SUCH AS WHEN THE CLUTCH PEDAL IS DEPRESSED). ON ONE OCCASION, SEVERAL MINUTES AFTER FILLING THE TANK, I ENTERED THE ROADWAY IN STOP-AND-GO TRAFFIC.  THE ENGINE STALLED WHILE I WAS IN THE ROADWAY MOVING AT LOW SPEED.  *TR",
        "vin": "3FADP4GXXFM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/23/2016",
        "dateOfIncident": "11/13/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927727,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FORDS POWERSHIFT TRANSMISSION FAILS TO SHIFT CORRECTLY BETWEEN FIRST AND SECOND GEARS. THE CAR SHUDDERS, SHAKES, AND GROANS WITHING THE TRANSMISSION.  THE CAR HAS BEEN TO THE DEALER AS ALMOST ALL FORD DEALERSHIPS WILL TELL YOU FORD REALLY HAS NO FIX FOR THEIR DANGEROUS DESIGN OF THIS TRANSMISSION.   THE VEHICLE DOES NOT MEET FORDS SELF-IMPLEMENTED TEST TO HAVE THE TRANSMISSION FIXED.   INSTEAD THEY REFLASH THE TCM TO RETRAIN THE COMPUTER, THIS DOES NOTHING BUT PROLONG THEIR DIAGNOSTIC PROCESS, AS YOU THEN HAVE TO DRIVE VEHICLE ANOTHER 1000 MILES BEFORE THEY WILL ALLOW DEALERSHIPS TO LOOK AT VEHICLE AGAIN.  FORD IS TRYING TO AVOID A RECALL ON THIS DANGEROUS TRANSMISSION WHICH SHOULD HAVE BEEN FORCED BY THE NHTSA TO RECALL AND REPLACE ALL FORD FIESTA AND FOCUS WITH THIS TYPE OF TRANSMISSION.  THE SYMPTOMS OF THIS TRANSMISSION FAILING ARE SURGING OF VEHICLE, LOSS OF DRIVE POWER, SHUDDER, HARSH ENGAGEMENT OF ENGINE POWER, LACK OF VEHICLE CONTROL DUE TO ENGAGEMENT/DISENGAGEMENT OF ELECTRONIC ACTIVATE CLUTCHES.",
        "vin": "3FADP4BJ6FM"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "03/24/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925755,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR IN MARCH 2016 AND NOTICED RIGHT AWAY WHEN I SHIFT FROM 1ST TO 2ND MY CAR SEEMS TO STALL/SHAKE AND I HAVE IT IN AUTOMATIC, WHEN I HAVE IN THE KIND OF SHIFT THAT I DO IT DOESN'T DO IT. I HAVE CONTACTED THE DEALERSHIP ABOUT IT AND THEY ALWAYS TELL ME THERE IS NOTHING THEY CAN DO ABOUT IT. I HAVE READ WHERE OTHERS ARE HAVING THE SAME PROBLEM. A FRIEND OF MINE BOUGHT AT 2015 FORD FOCUS AND HERS IS DOING IT AS WELL.",
        "vin": "3FADP4BJ0FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "11/03/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924362,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUDDERS REAL BAD WHEN STARTING UP.  I HAVE HEARD SEVERAL FOCUS AND FIESTA HAVING THIS PROBLEM.  FORD REFUSES TO FIX IT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING 65 MPH, THE TURBOCHARGER ENGAGED AND THE ENGINE LOST POWER. THE VEHICLE DID NOT STALL. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 60,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "10/04/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST ALL THROTTLE/POWER TRYING TO ACCELERATE ONTO HIGHWAY FROM DEAD STOP. COASTED TO THE SHOULDER WHILE THE CAR IDLED. RESTART THE CAR AND PROBLEM GOES AWAY TEMPORARILY. CHECK ENGINE LIGHT/CODE SAYS THROTTLE BODY ACTUATOR CONTROL SYSTEM STUCK CLOSED (P2112).",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914322,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST POWER CHECK ENGINE LIGHT CAME ON ANF A YELLOW WRENCH LIGHT ALSO DID COME ON THIS OCCURED ON THE TURNPKE AT HIGH SPEED SHUT ENGINE DOWN RESART WRENCH LITE GONE BUT BARELY DRIVABLE CODE READER SAYS DEFECTIVE THROTTLE BODY FORD HAS RECALLED ONE AND HALF MILLION CARS FOR THIS ITS DANGEROUS.",
        "vin": "3FADP4GX5FM"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/02/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911061,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SHOCKS SHOT BOUNCING DOWN THE ROAD AND RADIATOR MOUNTS LOOSE DEALER CHANGED SHOCK AND I ADDED GROMENTS TO TOP RADIATOR MOUNTS",
        "vin": "3FADP4AJ7FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908053,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM SHOWED UP ON THE FIRST DAY WE PICKED UP THIS BRAND NEW 2015 FORD FIESTA WITH LESS THAN 25 MILES ON THE ODO.  WHILE WE WERE TURNING AT AN INTERSECTION AS WE LEFT THE MAIN HIGHWAY AND ENTERED THE SIDE STREET THE TRANSMISSION WENT INTO NEUTRAL.  THE RPMS WENT UP TO OVER 4000 BUT THE TRANSMISSION NEVER ENGAGED.  THE CAR THAT WAS BEHIND US AS WE WERE TURNING HAD TO STOP SUDDENLY TO KEEP FROM HITTING US AS WE COASTED OFF TO THE SIDE OF THE ROAD.  AS THE CAR ALMOST CAME TO A FULL STOP THE TRANSMISSION ENGAGED HARD AND JUMPED FORWARD AS IF I HAD SLAMMED IT INTO GEAR.    THIS HAS HAPPEN MANY MORE TIMES WITH MY WIFE, SISTER AND MYSELF AS DRIVER.  EACH TIME WE WERE ALMOST HIT FROM EITHER ONCOMING TRAFFIC OR THE VEHICLES FOLLOWING US.",
        "vin": "3FADP4BJ0FM"
    },
    {
        "components": "STEERING,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903065,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING AT ANY SPEED, THE FRONT PASSENGER SIDE WHEEL DISENGAGED FROM THE VEHICLE WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TIE ROD FRACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER AND DEALER WERE NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 37,388. ..UPDATED 12/20/16 *BF  *TR",
        "vin": "3FADP4BJ3FM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "08/26/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903125,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WRENCH LIGHT WOULD COME ON WHILE DRIVING THE VEHICLE. IT WOULD HAPPEN IN BOTH CITY AND INTERSTATE DRIVING. THE VEHICLE WOULD GO INTO LIMP MODE AND I WOULD JUST BARELY BE ABLE TO GET ON TO THE SHOULDER OF THE HIGHWAY. DEFINITELY A SAFETY ISSUE IN 70 MPH TRAFFIC.   STOPPING AND RESTARTING THE ENGINE WOULD ALLOW NORMAL OPERATION FOR ABOUT 5 MILES. THE PROBLEM WOULD THEN OCCUR AGAIN.  THE DEALER DIAGNOSED A BAD THROTTLE BODY WITH A CODE OF P2011. I'VE READ THAT FORD HAS A HISTORY OF THESE PROBLEMS WITH THROTTLE BODIES. IT SEEMS THEY HAVE NOT FIXED THE ISSUE ON NEWER MODELS.",
        "vin": "3FADP4GX9FM"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "07/09/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884394,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING 20 MPH, THE VEHICLE VIBRATED SEVERELY BEFORE THE FRONT PASSENGER WHEEL DETACHED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT MENTIONED THAT AN UNKNOWN NOTICE WAS RECEIVED FROM THE MANUFACTURER PERTAINING TO THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 22,000.",
        "vin": "3FADP4BJXFM"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2016",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876437,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING DRIVING, A LARGE PLASTIC PART FROM BEHIND THE DASHBOARD FELL DOWN DIRECTLY ONTO THE ACCELERATOR AND BRAKE PEDALS CAUSING PANIC AND TEMPORARY LOSS OF CONTROL. THE CAR WAS IN MOTION ON A CITY STREET. PICTURES OF THE PART THAT FELL DOWN ARE ATTACHED. I CALLED FORD - OTHER THE FIXING THE PART BACK AND DOCUMENTING THE ISSUE, THEY WERE'T REALLY BOTHERED AND SHOWED NO CONCERN. HENCE MY COMPLAINT TO NHTSA.",
        "vin": "3FADP4AJ4FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "08/08/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874330,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION CONSTANTLY STUTTERS AND JERKS WHILE ATTEMPTING TO ACCELERATE.",
        "vin": "3FADP4BJ8EM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10873896,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2015 FORD FIESTA. WHILE DRIVING 20 MPH, THE CONTACT'S VEHICLE WAS INVOLVED IN A SIDE IMPACT COLLISION. THE AIR BAGS FAILED TO DEPLOY. THE VEHICLE WAS TOWED TO A BODY SHOP. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT SUFFERED FROM NECK INJURIES AND A CONCUSSION, WHICH REQUIRED MEDICAL ATTENTION. THE FAILURE MILEAGE WAS APPROXIMATELY 19,000.",
        "vin": "3FADP4BJXFM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "05/09/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864054,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER HAVING THE CAR, THE TRANSMISSION STARTED BEING JUMPY, LOSING POWER AT TAKE OFF AND ACTING LIKE IT WILL STALL OUT. I HAVE MADE SEVERAL ATTEMPTS FOR FORD DEALERSHIP TO LOOK AT. DID SUCEED WITH ONE OF THE ATTEMPTS AND THEY SAID THEY RESET COMPUTER. THAT DID NOT WORK. THE OTHER TIMES THEY TELL ME THAT THEY CANNOT FIX AND THEY ARE WORKING ON FINDING A SOLUTION TO FIX. I HAVE TRIED TO TRADE IN AND THEY TELL ME NOW IT IS ONLY WORTH ABOUT HALF OF WHAT WE BOUGHT A YEAR AGO. MY FAMILY FEELS VERY UNSAFE IN THIS CAR AND VERY DISSATISFIED WITH ASHEVILLE FORD.",
        "vin": "3FADP4BJ7EM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/28/2016",
        "dateOfIncident": "04/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862076,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING APPROXIMATELY 60 MPH ON THE HIGHWAY, THE VEHICLE DID NOT ACCELERATE TO MOVE INTO A FASTER LANE. ON SEVERAL OCCASIONS, THE VEHICLE ACCELERATED ON ITS OWN. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER WHERE THE CLUTCH ASSEMBLY WAS REPLACED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA TO FILE A COMPLAINT. THE FAILURE MILEAGE WAS 22,000.",
        "vin": "3FADP4EJ8FM"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837934,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE REAR WINDOW SHATTERED SPONTANEOUSLY. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FAILURE OCCURRED DUE TO THE VAST TEMPERATURE CHANGES. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "3FADP4AJ4FM"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2016",
        "dateOfIncident": "11/10/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824265,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. WHILE DRIVING 10 MPH, THE VEHICLE BEGAN TO VIBRATE ABNORMALLY. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE HEAD GASKET FAILED AND NEEDED TO BE REPLACED. THE CONTACT WAS ALSO INFORMED THAT THE FRONT DRIVER AND PASSENGER SIDE SHOCKS WERE LEAKING AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 23,000.     THE CONSUMER STATED ABOUT TWO WEEKS AFTER BRINGING THE VEHICLE, THE DRIVER'S SIDE DOOR AND THE BACK PASSENGER'S DOOR HANDLES STARTED PEELING. THE DEALER SUGGESTED FOR THE CONSUMER TO BUY TOUCH UP PAINT, AS THEY WOULD NOT REPAINT THE HANDLES. THE TRANSMISSION SEEMED TO SWITCH HARD BETWEEN GEARS AND LUNGED FORWARD FROM FIRST TO SECOND GEAR. AFTER HAVING THE HEAD GASKET REPLACED, THE VEHICLE DRIVES HOT AND SHAKES AT HIGH SPEEDS. THE TRANSMISSION GEAR SHIFT BEGAN STICKING WHILE MOVING IT FROM DRIVE, TO REVERSE TO PARK. THE CONSUMER REQUESTED A REFUND FOR COST OF THE VEHICLE.   UPDATED 06/22/2017*JS",
        "vin": "3FADP4AJ8FM"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/22/2016",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821633,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT THE REAR WINDOW HAD NO WIPER, WHICH MADE IT DIFFICULT TO DRIVE IN THE RAIN OR SNOW. THE DEALER STATED THAT THE REAR WIPER WAS OPTIONAL AND COULD BE ADDED FOR A CHARGE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE, BUT DID NOT ASSIST. THE ISSUE WAS NOT RESOLVED. THE VIN AND FAILURE MILEAGE WERE NOT PROVIDED. ...UPDATED 02/23/16 *BF",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821446,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "JERKS AND SOMETIMES MAKES BAD NOISE WHEN YOU PRESS THE GAS PEDAL. HAPPENS OFTEN.",
        "vin": "3FDP4AJ4FM1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "01/18/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821165,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG WARNING INDICATOR HAS ILLUMINATED AND HAS STAYED ON FOR TWO DAYS NOW. THERE ARE ALSO STRANGE NOISES COMING FROM THE AREA BEHIND MY STEERING WHEEL.",
        "vin": "3FADP4AJ6FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2015",
        "dateOfIncident": "10/19/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790071,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LUNGES FORWARD WHILE STOPPED AT INTERSECTIONS. WHILE ON A HIGHWAY IN TRAFFIC RPMS REMAINED HIGH AFTER THE TRANSMISSION FAILED TO DOWNSHIFT FOR APPROXIMATELY A MILE. WHILE ATTEMPTING TO ACCELERATE THE TRANSMISSION DOESN'T SHIFT UP AND JUST DOESN'T GO. ROLLS BACKWARDS DOWN HILLS WHILE TRYING TO GO FORWARD AND MAKES A CLICKING SOUND. CAR HAS A REALLY BAD SHUTTER WHEN ROUNDING CURVES AND TURNING CORNERS AND OCCASIONALLY FOLLOWS WITH THE CAR NOT ACCELERATING. HAS BEEN TO FORD TO BE CHECKED ONCE ALREADY AND WAS TOLD IT HAD NOTHING WRONG WITH IT AND HAS A SECOND APPOINTMENT NEXT WEEK. I'VE ONLY OWNED THE CAR FOR 9 MONTHS AND HAVE PUT LESS THAN 10,000 MILES ON IT. SOMETIMES THE CAR FEELS LIKE IT WILL STALL OUT WHILE TRYING TO SHIFT UP. WHEN THE CAR IS PARKED CAN HEAR CLICKING IN TRANSMISSION AS IT ROCKS EXCESSIVELY ON LEVEL GROUND. CAR ALSO APPEARS TO HAVE NO POWER WHEN PULLING INTO TRAFFIC FROM A STOP AND HAS ALMOST BEEN INVOLVED IN SEVERAL ACCIDENTS BECAUSE OF THIS.",
        "vin": "3FADP4CJ7EM"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/12/2015",
        "dateOfIncident": "08/27/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781496,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM INITIALLY SURFACED WITH LESS THAN 2500 MILES ON THE VEHICLE.  IMMEDIATELY AFTER REFUELING MY VEHICLE, THE ENGINE WOULD STUMBLE AND SOMETIMES STALL COMPLETELY, WHILE AT A STOP AND WITH THE ENGINE IDLING.  THE FORD DEALERSHIP DETERMINED THE PROBLEM TO BE A FAULTY EVAPORATION CANISTER PURGE VALVE IN THE FUEL SYSTEM.  THE AMOUNT OF FUEL I ADDED TO THE TANK DID NOT SEEM TO MATTER AS EACH TIME I DID SO, THE ENGINE WOULD STUMBLE OR STALL WITHIN 1-2 MINUTES FOLLOWING THE FILL-UP.  ONCE THE STUMBLING OR STALL HAD OCCURRED, THE VEHICLE RETURNED TO NORMAL OPERATION WITHOUT ISSUE (OR UPON RESTARTING THE VEHICLE) UNTIL THE NEXT TIME I WOULD NEED TO ADD FUEL.  THE STUMBLING AND STALLING WAS PARTICULARLY DANGEROUS AS IT TENDED TO OCCUR AS I WAS PULLING AWAY FROM THE GAS STATION, MERGING INTO TRAFFIC AT A BUSY INTERSECTION OR ON-RAMP.",
        "vin": "3FADP4GX4FM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT RENTED A 2015 FORD FIESTA. WHILE ATTEMPTING TO PARK AND RELEASING THE ACCELERATOR PEDAL, THE BRAKE PEDAL WAS DEPRESSED BUT THE VEHICLE INDEPENDENTLY ACCELERATED. AS A RESULT, THE CONTACT DROVE OVER THE PARKING DIVIDER. THE CONTACT DEPRESSED THE BRAKE PEDAL AGAIN AND THE VEHICLE CAME TO A STOP. THE VEHICLE WAS TAKEN TO THE CONTACT'S RESIDENCE WHERE IT WAS TOWED TO THE RENTAL COMPANY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,300.",
        "vin": "3FADP4EJ8FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/03/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779508,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "AT A TRAFFIC LIGHT AT ABOUT, 11:45 PM. ON 10/02/2015 MY SELF AND MY BOYFRIEND WERE IN MY 2015 FORD FIESTA SE, WITH HIM DRIVING MY CAR, WHEN THE LIGHT TURNED GREEN AT A MAJOR INTERSECTION HERE IN PHOENIX, ARIZONA WERE WE RESIDE, MY 2015 FORD FIESTA LEACHED FORWARD AS BY BOYFRIEND STEPPED ON THE GAS PEDAL,AND THEN THE ENGINE SUDDENLY REVVED UP VERY HIGH, AND THE CAR MOVED FROM THE STOP LINE AT THE INTER- SECTION AT A FAST RATE OF SPEED, AND NEXT THE TRANSMISSION LOCKED UP, CAUSING THE CAR TO STOP VERY HARD ALL AT ONCE IN THE MIDDLE OF THE INTERSECTION AND STALL, AND OUR HEADS , AND OUR BODY'S  TO BE THROWN FORWARD AT THE WINDSHIELD, BUT NOT HITTING IT, BECAUSE THE SEAT-BELTS ENGAGED THANK GOD ! A CAR WAS COMING BEHIND USE AND HAD TO  SERVE SEVERELY, ALMOST CAUSING THAT CAR TO ROLL OVER AS IT JUST MISSED HITTING OR RIGHT REAR BUMPER, AT ABOUT 50 MILES AN HOUR. MY BOYFRIEND THEN PLACED THE CAR IN PARK, AND PUSHED THE HAZARD LIGHT BUTTON ON, BUT THE CAR WOULD NOT START, IT TOOK ABOUT 3 TIMES, TURNING THE KEY, TO GET IT TO START AGAIN, BY THE THE LIGHT S TURN GREEN FOR THE TRAFFIC IN THE OTHER DIRECTION, AND THE CARS STATED TO COME AT OURS. MY BOYFRIEND, THE FINAL GOT THE CAR STARTED, AND AGAIN THE CAR LEACHED FORWARD VERY ABRUPTLY, AND AGAIN JERKED VERY HARD AGAIN, AND STALLED ONCE MORE, THAT HAPPENED ABOUT FIVE TIMES. WE WERE ABLE TO FINAL GET THE CAR TO MAKE IT ENOUGH THROUGH THE INTERSECTION, TO STOP IT IN THE MIDDLE OF THE ROAD, WHEN A PEDESTRIAN WAVED TO USE ASKING TO HELP US MOVE THE CAR FROM THE MIDDLE OF THE ROAD, WE PUT THE CAR IN NEUTRAL, AND PUSHED IT INTO A WALGREENS  PARKING LOT. AND CALL FOR FORD EMERGENCY ROADSIDE ASSISTANCE. THE CAR THEN WAS PUT ON A FLAT BED TROW TRUCK, AND TAKE TO THE FORD DEALER WERE IT WAS PURCHASED  FROM.",
        "vin": "3FADP4EJXFM"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2015",
        "dateOfIncident": "07/06/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732338,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 FORD FIESTA TITANIUM WITH FORD SMART KEY SYSTEM. WE ARE ABLE TO ENTER VEHICLE AND START IT WITHOUT HAVING SMART KEY INSIDE VEHICLE. DRIVE 200 FEET WITH NO WARNING KEY WASN'T IN THE VEHICLE, AS WELL AS SHUT DOWN AND RESTART ENGINE 3 TIMES WITHOUT KEY WITHIN CLOSE PROXIMITY. CALLED DEALER TO BRING IN.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/05/2015",
        "dateOfIncident": "06/04/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723562,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. THE CONTACT STATED THAT WATER WAS LEAKING FROM THE WINDSHIELD INTO THE DASHBOARD AND THE AIR BAG AND STABILIZING WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 1,800. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/04/2015",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723457,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 FORD FIESTA. UPON DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE WAS EXTREMELY SLOW TO PICK UP SPEED AND SLOW TO DOWNSHIFT. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR FURTHER INSPECTION. THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 300.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/20/2015",
        "dateOfIncident": "02/19/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ALL CAME ABOUT AT 11:30 PM WHEN LEAVING THE WORK PLACE THE CAR WOULD NOT PROVIDE HEATING TO THE DEFROSTERS OR OTHER AREAS AFTER THE ENGINE WAS AT OPERATING TEMP. THE OUTSIDE TEMP WAS AT MINUS SIX AND WIND CHILL BELOW THAT NUMBER.THE CAR WAS DRIVEN HOME A DISTANCE OF FIVE PLUS MILES WITH THE WINDSHIELD FROSTED MAKING IT DIFFICULT TO SEE THROUGH. UPON ARRIVAL AT HOME THERE WAS TWO SMALL CLEARED SPOTS THE SIZE OF HALF DOLLARS AT THE BOTTOM OF THE WINDSHIELD. AFTER HAVING THE CAR TOWED TO THE DEALER THIS MORNING THEY DETERMINED THE PROBLEM WAS AN ICED CABIN AIR FILTER AND [FROZEN] AS IN ICED FAN BLOWER THEY HAD TO DRY OUT. PER SSM 44942 IN WHICH ENGINEERS AT FORD [ I PRESUME ] WERE INVESTIGATING OR AS STATED ON THE PAPER WORK I RECEIVED FROM THE DEALER, CONCERNED ENGINEERS. THIS FALLS UNDER SAFETY DO TO VISION BEING IMPAIRED BECAUSE OF THIS PROBLEM WHICH APPEARS TO BE KNOWN BY THE MANUFACTURE. THIS CAR WAS ONLY DRIVEN AT THIS LATE TIME OF NIGHT AS TRAFFIC WAS ALMOST NIL AND THE EXTREME WEATHER DICTATED.      *TR",
        "vin": "3FADP4CJ5FM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "01/19/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676719,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FIESTA",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "01/19/2015 MY BOYFRIEND HAD DRIVEN MY CAR TO THE STORE, ABOUT ONE MILE FROM MY HOME. ABOUT 10:40 PM.      RECEIPT SHOWS THAT HE HAD CHECKED OUT AT 10:53 PM. HE TELLS ME THAT HE ENTERED MY CAR ABOUT 3 MINUTES LATER, BECAUSE IT WAS PARKED CLOSE TO THE STORE, HE LOADED THE SHOPPING BAGS INTO THE TRUNK OF THE CAR AND GOT IN AND STARTED THE CAR AND BACKED OUT FROM THE PARKING SPACE, AND THEN WENT FORWARD HE STATES IT WAS ABOUT NO MORE THEN 25 YARDS, WHEN HE NOTICED THAT THE CARS TRANSMISSION, AT FIRST HESITATED TO SHIFT, AND THEN MADE A SLIGHT JERK TO THE NEXT GEAR, THEN JERKED ONCE AGAIN SLIGHTLY.     HE TELLS ME THAT HE THEN STOP THE CAR, AND STARTED AGAIN FORWARD, AND AT THIS TIME, HE DID NOT FEEL ANY PROBLEMS, SO I AGAIN STOPPED THE CAR, AND PUT IT INTO REVERSE. AND BACKED UP AT  4 MPH, HE   DID NOT NOTICE ANY PROBLEMS. HE AGAIN STOPPED THE CAR, AND THEN DROVE AGAIN FORWARD AT 10 TO 15 MPH WITH NO PROBLEM TO HOME.     01/20/2015 I GOT INTO MY CAR WITH MY BOYFRIEND TO GO TO WORK, 915 AM. BOYFRIEND DRIVING.  WE DROVE MY CAR OUT OF THE APARTMENT COMPLEX WHERE I RESIDE, AND DID NOT NOTICE A SHIFTING PROBLEM, UNTIL WE ENTERED THE STREET, AND THAT IS WHEN THE CAR HESITATE TO SHIFT  UPON ACCELERATION, AND THE ENGINE REVVED UP LOUDLY, AND THEN JERKED INTO GEAR.    AT THE FORD DEALERSHIP MY BOYFRIEND TOLD THE SERVICE ADVISER ABOUT THE ISSUES WITH THE CARS TRANSMISSION, AND HE WAS TOLD BY THE SERVICE ADVISER, THAT FORD KNOWS ABOUT THE ISSUE, AND HAD ISSUED A SERVICE  BULLETIN.    HE THEN WENT ON TO STATE THAT THE FORD SERVICE BULLETIN STATES THAT THE PROBLEM IS CAUSED MY A FAULTY TRANSMISSION CONTROL MODULE, AND ALSO A INTERNAL LEAK IN THE CLUTCH HOUSING ON THE TRANSMISSION, AND THAT FORD WILL ONLY REPAIR THE ISSUE AT 1,500 MILES, NOT BEFORE THAT TIME. HE ALSO STATED THAT THE TRANSMISSION COULD BE COMPUTER TUNED TO HELP STOP THE PROBLEM.  *TR",
        "vin": "3FADP4EJXFM"
    }
]