[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/06/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453913,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Acura MDX. The contact stated while driving approximately 70 MPH, the inadvertently slowed and decelerated to 30 MPH. The brake alert warning message was displayed. The vehicle was not taken to the local dealer. The vehicle was not repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 65,000.",
        "vin": "5FRYD4H47GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/13/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451919,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The sunroof exploded while driving on an empty road.  This was alarming and could have been very dangerous had the cover been open as broken glass would have fallen all over me and my children.  The dealership said they cannot help because there is no recall for this.  No warning, just completely out of the blue, explosion and cracked completely while going 50mph.",
        "vin": "5FRYD4H48GB"
    },
    {
        "components": "POWER TRAIN,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451740,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My SUV would accelerate when going down hill and the message: “transmission system problem”along with “blind spot warning malfunction” would come on.  Took to dealer the message went out.  Will come on intermittently.  This has gone on For past month.   They sai it had to stay on for them to diagnose.  Now car will not go in reverse at all.  This transmission was replaced November 2019 because of a defect.  They told me there is no recall but the other was a service bulletin that required my engine to be replaced as well.  If there is a class action I want to be added as this is a big inconvenience and the company is denying there is an issue with the transmission computer system so they can get us to pay high repair fees.  Please help!",
        "vin": "5FRYD4H48GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448015,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's wife owns a 2016 Acura MDX. The contact stated that while his wife was reversing out of the driveway with his grandchildren in the rear seats, she stopped the vehicle to check for incoming traffic but the vehicle switched gears to drive on its own and accelerated forward. The contact's wife depressed the brake pedal but it failed to respond and the vehicle crashed into his unoccupied vehicle that was parked ahead in the driveway. The driver's airbags deployed.  There were no warning lights illuminated.  The contact's wife parked the vehicle. There were no injuries sustained. A police report was not filed. The contact stated that his wife switched gears to reverse and attempted to reverse the vehicle. The vehicle only reversed for 2 feet and switched gears back to park. The contact stated that the vehicle continuously switched gears to park whenever they attempted to reverse. The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed or repaired. The failure mileage was approximately 37,592.",
        "vin": "5FRYD3H47GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/09/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436530,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I believe my transmission or the electrical component(s) to my transmission failed. I was driving down the road and all of a sudden my car shifted into neutral and would not allow me to accelerate so we had make our way to the shoulder to put the car in park. Having my vehicle thrown into neutral while driving and not being able to accelerate put not only us, but other drivers at serious risk! There were several warning messages popping up on our screen (see attached photos). In researching this issue, I found that there had been several TSBs and a class action lawsuit claiming the same issue faced by many drivers. It is currently at the Acura dealership getting serviced and they will be replacing the entire transmission and TCM harness under the CPO warranty. I cannot believe there has not been a recall on this potentially life-threatening issue.",
        "vin": "5fryd4h46gb"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2021",
        "dateOfIncident": "09/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436327,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Every since I've owned my 2016 Acura MDX I've had infrequent, and intermittent transmission issues. Several have been safety concerns: - Transmission is slow to engage when first pushing accelerator, leading to unexpected lag pulling into traffic - Transmission did not shift into park as expected, causing car to keep moving as I was opening door and starting to step out - Transmission slips and does not respond when accelerating to merge into fast lane on highway to pass slower traffic. Car speed stalls and you have to let off the gas and wait for a few seconds before the transmission reengages. - Overall horrible/hard shifting all the time... to which we're told... the car learns your driving style.  We've reset it multiple times to try to get it to start learning again.  No luck. - After coasting on highway, very hard shift with loud noise when you go to hit the accelerator  All of these situations have happened numerous times over the past 2 years of owning this car. All of them infrequent, but also unexpected... leaving you to really worry if this is the time the transmission is going to let you down and cause you to wreck.  Dealer now says a new transmission is needed, but I waited until 78,000 miles to first report it, so it's out of warranty now. Hoping Acura will step up and address this serious safety issue with the 9 speed transmission.",
        "vin": "5FRYD4H4XGB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "10/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435976,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Front driver side airbags spontaneously deployed while driving.",
        "vin": "5fryd4h23gb"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429937,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Stalling when accelerating.  Safety hazard because the car basically dies temporarily and slows down. I have to pump the gas pedal for several seconds to get it going again.",
        "vin": "5FRYD3H45GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427269,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "when air conditioner is running in hot summer days, the car hesitates to restart (sometimes) following idle stop engine shutoff after coming to a full stop at a stop sign or red light. I strongly feel this is a safety concern as this impedes traffic and can causes road rage. If needed I can share video of this situation recurring time to time. Car starts just fine every single time outside of idle stop situations and battery health is near perfect. There are hundreds of forums talking about this exact condition across acura models.",
        "vin": "5fryd4h92gb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2021",
        "dateOfIncident": "06/28/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422650,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Acura has an open recall that shows the symptoms or malfunctions my vehicle is having for my year, make, and model, but the vehicle I.D number doesn't show this type of recall for it. Now, these things do not add up give the malfunctions I'm experiencing. First and foremost, the car stalls, I could be on the NJ turnpike and as soon as traffic slows down car goes into neutral on its own and engine just shuts off in the middle of traffic, do not know when its going to happen, it just happens. Car then turns on once fully stopped and foot is on break but probably after another hour same thing and it is continuous. I have replaced a number of things and it is still malfunctioning. NHTSA Recall # 19V-060. No check engine light recorded since i bought the car and when running, car runs smoothly. It is preowned vehicle, called Acura and I was told that the fuel pump was replaced, but according to the recall it also needs a software update to fix the malfunction. At this point I just need help on taking the proper steps on getting this safety issue  fixed.",
        "vin": "5fryd4h20gb"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "07/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422016,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Acura MDX. The contact stated while driving at various speeds, the vehicle would stall. The contact also stated that the vehicle would jerk when the accelerator pedal was depressed. The contact stated the information and engine warning lights were illuminated on the control panel. The vehicle was taken to a local dealer where it was diagnosed with the transmission needing to be updated. The vehicle was repaired but the failure still occurred. The contact was relating the failure to NHTSA campaign number: 19V060000 (Fuel System, Other). The manufacturer had been informed of the failure and the contact filed a claim. The failure mileage was approximately 41,000.",
        "vin": "5FRYD4H49GB"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405329,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, THE EMISSIONS SENSOR LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER KAREN RADLEY ACURA LOCATED AT 14700 JEFFERSON DAVIS HWY, WOODBRIDGE, VA 22191, WHO DIAGNOSED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 51,000.",
        "vin": "5FRYD4H40GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405455,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR AT LEAST THE PAST FOUR YEARS, MY MDX HAS BEEN \"CATCHING\" WHILE ACCELERATING AND LURCHING AT OTHER TIMES. IF I HAVE TO STEP ON IT TO GET THROUGH TRAFFIC OR WANT TO PASS AND I ACCELERATE, THE CAR WILL JERK. THIS IS MOST NOTICEABLE AT 40 MPH BECAUSE THAT'S THE SPEED I'M DRIVING AT MOST OFTEN. IT ALSO HAPPENS AT HIGHER SPEEDS WHEN ON THE INTERSTATE. I HAVE TAKEN IT IN TO THE DEALER NUMEROUS TIMES, BUT THEY JUST KEEP TELLING ME THERE IS NOTHING THEY CAN DO ABOUT IT AND THEY BLOW ME OFF.",
        "vin": "5FRYD3H22GB"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405061,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT ON STATING: LEAN CODE, ALL WHEEL DRIVE SYSTEMS PROBLEM, EMMISION SYSTEM PROBLEM.  THE VEHICLE WAS MOVING WHEN IT CAME ON.",
        "vin": "5FRYD4H40GB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399559,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH ADAPTIVE CRUSE CONTROL ON, I WAS APPROACHING SLOWER VEHICLE. I WANTED TO GO AROUND IT WITHOUT BREAKING. WHILE DRIVING ALREADY ON HIGH SPEED (70M/H) I PRESS ACCELERATION PEDAL SO I CAN SAFELY GO AROUND SLOWER VEHICLE. I WAS HALF WAY INTO PASSING LINE (LAST LEFT LINE), THERE WAS A CAR ALREADY BEHIND ME APPROACHING WITH HIGHER SPEED, WHEN I SUDDENLY COMPLETELY  LOST POWER AND LOTS OF LIGHTS ILLUMINATED ON THE DASH. CAR BEHIND ME NOTICE THAT I START LOOSING SPEED RAPIDLY SO HE START BRAKING  THAT I COULD HEAR HIS TIRES. I DIDNT KNOW WHAT TO DO SO I JUST KEPT GOING TO EMERGENCY STOPPING LINE WHERE I ALMOST CRASH INTO THE CONCRETE DIVIDER. I MANAGE TO STOP VEHICLE SAFELY BY PURE LUCK. AFTER STOPPING I NOTICE THAT CAR IS NOT SHIFTING, AND SH-AWD SYSTEM, BLIND SPOT ASS, EMISSION SYSTEM AND TRANSMISSION SYSTEM FAULT LIGHTS CAME ON. I CALLED INSURANCE AGENT TO SEND ROAD SIDE ASSISTANCE, BUT WHILE WAITING ON THE CALL I START THE CAR AGAIN (LIKE 15MIN AFTER THIS INCIDENT) AND ALL LIGHTS WERE STILL ON EXCEPT TRANSMISSION. I TRIED CAR AND IT WAS SHIFTING NORMALLY NOW, EXCEPT SH-AWD WAS NOT WORKING (I DIDNT HAVE POWER TO THE REAR DIFFERENTIAL). THIS COULD BE VERY TRAGIC EVENT IF BOTH ME AND THE DRIVER BEHIND ME DIDNT REACT PROPERLY. I HAD TWO MORE PASSENGERS IN THE CAR, FROM WHICH ONE WAS 15 MONTHS OLD CHILD. I WAS READING THAT THIS COULD BE TRANSMISSION SYSTEM UPDATE ISSUE, BUT MY DEALER DID UPDATE TRANSMISSION ALREADY.",
        "vin": "5FRYD4H91GB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394502,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED 6 REPLACEMENT FRONT WINDSHIELDS, ALL OF WHICH WERE DISTORTED ADJACENT TO THE DRIVER AND PASSENGER A PILLARS.  ACURA ADMITS THAT THERE IS A FLAW IN THE MOLD FOR THIS WINDSHIELD AND HAS DEEMED IT 'ACCEPTABLE'.  THEY WILL NOT CERTIFY CALIBRATION OF THEIR SAFETY ELECTRONICS WITH AN AFTERMARKET WINDSHIELD.  THIS DISTORTION IS A DISTRACTION AND A SAFETY ISSUE NOT TO MENTION SLIGHTLY NAUSEATING.  IT IS NOTICEABLE SPECIFICALLY DURING TURNS.",
        "vin": "5FRYD4H97GB"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "09/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389169,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2020, CAR RANDOMLY TURNED OFF WHEN STOPPED AT A RED LIGHT (ON BUSY INTERSECTION) DURING IDLE MODE CAUSING THE CAR BEHIND US TO HIT WHEN LIGHT TURNED GREEN.  NO DAMAGE WAS DONE TO MY CAR SINCE THE CAR WASN'T MOVING AT WAS HIT AT LOW SPEED.",
        "vin": "5FRYD3H94GB"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384979,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON LOCAL ROAD ALL OF A SUDDEN THE 3 ERRORS CAME ON THE DASH BOARD TRANSMISSION SYSTEM PROBLEM, EMISSION SYSTEM PROBLEM, AND BLIND SPOT SYSTEM PROBLEM, ENGINE LIGHT CAME ON. WHEN THIS HAPPENS THE TRANSMISSION DOESN'T SHIFT RIGHT AND GRINDING OF THE GEAR IS HEARD, CAR QUICKLY SLOW DOWN. AFTER STOPPING AND START UP AGAIN, ERRORS STILL THERE BUT TRANSMISSION COULD NOT SHIFT INTO HIGHER GEARS AND CAR TOPS OUT AT 30MPH. THIS HAS HAPPENED 4 TIMES IN THE LAST FEW DAYS AND WE ARE NOW SCARED TO DRIVE THE CAR LOCAL ROADS, HIGHWAY WOULD BE BAD UNTIL WE GET IT FIXED AT THE DEALERSHIP. THIS IS POTENTIALLY A VERY DANGEROUS SITUATION IF THE CAR LOSES POWER AT AN INTERSECTION.",
        "vin": "5FRYD4H9XGB"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "10/06/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375095,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A CERTIFIED PRE-OWNED 2016 ACURA MDX SH-AWD W/ TECH A FEW WEEKS AGO & FROM DAY ONE THERE HAVE BEEN ISSUES WITH ACCELERATION OFF A COMPLETE STOP LIKE A STOP SIGN, STOP LIGHT, COMING OFF PARK OR UPON PUTTING IT INTO DRIVE.  THE VEHICLE WILL NOT MOVE WHEN THE GAS PEDAL IS DEPRESSED, WILL REV HIGH THROUGH FIRST, JUMP INTO 2 STILL REVVING HIGH BEFORE FINALLY MOVING WHEN IT HITS 3RD.  IT IS A HUGE SAFETY ISSUE WHEN OTHER TRAFFIC IS ONCOMING AS YOU ARE EXPECTING TO \"GO\" & NOTHING HAPPENS WHEN PRESSING THE GAS PEDAL. THE DEALERSHIP INSPECTED THE VEHICLE UPON PURCHASE AT OUR REQUEST ON TWO OCCASIONS BUT TOLD US IT IS NORMAL & WILL ADJUST TO MY DRIVING STYLE. THIS IS NOT NORMAL.THEY SAID THEY UPDATED THE SOFTWARE BUT FOUND NOTHING WRONG WITH THE VEHICLE.  I'M FEELING LIKE WE PAID FOR A LEMON & DRIVING SOMETHING WHICH IS VERY UNSAFE ESPECIALLY WITH CHILDREN IN THE CAR.",
        "vin": "5FRYD4H45GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2020",
        "dateOfIncident": "11/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373683,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE LAST 6 MONTHS, MY SUV HAS STALLED EITHER AT A STOP LIGHT OR WHEN PARKED.  IT WOULD SPUTTER ON TRYING TO RESTART.  BATTERY WAS NOT AN ISSUE.  THOUGHT IT WAS A STARTER ISSUE AND GOT A NEW STARTER.  BUT IT HAPPENED AGAIN TODAY AND THE TOW TRUCK GUY POWERED WITH JUMP START (EVEN THOUGH IT WAS NOT A BATTERY ISSUE) AND IT STARTED.",
        "vin": "5FRYD4H92GB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "10/08/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363602,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGAN TO STALL WHILE DRIVING. WOULD NOT ACCELERATE WHILE PRESSING GAS PEDAL AND SUDDENLY TURNED OFF. TRIED TO TURN IT BACK ON. WHICH IT DID TURN ON BUT IT DID SO WITH A LOT OF EFFORT FROM THE CAR. ENGINE LIGHT HAS NOW CAME ON ALONG WITH 3 MORE LIGHTS.",
        "vin": "5FRYD3H28GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361638,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UNCONTROLLABLE ACCELERATION, SURGING AND BUCKING DURING BRAKING OR DECREASING SPEED    THE VEHICLE HESITATES TO STOP IN ALL GEARS  - UNCONTROLLABLY DANGEROUS ACCELERATION ALSO STRESSES ADDITIONAL VEHICLE FUNCTIONS  - TIRES AND BRAKES  - SUSPENSION (INERTIA THAT CAUSES IMBALANCE)  - STEERING  - VEHICLE STEERING IS NOW SOMEWHAT UNBINDING AND VEERS RIGHT  OR LEFT WHEN ATTEMPTS TO CONTROL ANOMALOUS ACCELERATIONS WHILE BRAKING OR SLOWING THE VEHICLE    POOR ACCELERATION AT LOWER CITY SPEEDS AND REMAINS IN ERRATIC GEARS FOR UNSPECIFIED TIMES  THIS IS MOST DANGEROUS WHEN DRIVING IN ROUGHER TRAFFIC AND ESPECIALLY WHEN THERE ARE ADDITIONAL DEMANDS TO DRIVE AT ELEVATING SPEEDS    TRANSMISSION DISENGAGES BRIEFLY AT HIGHER SPEEDS  RECENTLY, AS THE VEHICLE INCREASES VELOCITY AND CONSISTENCY,  THE DRIVE GEAR DISENGAGES TO NEUTRAL FOR A FEW MILLISECONDS AND CHANGES  BACK TO THE DRIVE GEAR AND REGAINS MOMENTUM  TRANSMISSION IS NOISY  1. THUDS AND CLICKS WHILE SHIFT AT VARIOUS TIMES  2. 'CRICKET SOUNDS' GURGLING, CREAKS, GRINDS AND MILD KNOCKING IS PRESENT WHEN IDLING AND ENGAGING AFTER VEHICLE STARTUP  E. MANUAL TRANSMISSION FUNCTIONS  1. VEHICLE CONTINUES TO MOVE ONCE PARKING GEAR IS ENGAGED AND FOOT BRAKE IS RELEASED  2. ONCE VEHICLE STARTS, REVERSE AND DRIVE GEAR IS \"STICKY' AND MAKES NOISE (THUD) WHEN ENGAGED",
        "vin": "5FRYD3H28GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355256,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ZF9 TRANSMISSION WENT OUT AT ABOUT 10,000 MILES WITH METAL PARTICLES FOUND IN ATF FLUID. REPLACED BY ACURA WITH A NEW TRANSMISSION APPARATUS. APPARENTLY THIS IS A RAMPANT AND DANGEROUS PROBLEM WITH THIS MODEL YEAR TRANSMISSION. NOW AT 38,000 MILES (28,000 MILES ON THE NEW TRANSMISSION) THIS ONE IS FAILING, SLIPPING ON SHIFTS AND MAKING A SQUEAKING/CHIRPING NOISE BETWEEN GEARS. CAN RESULT IN FAILURE TO ENGAGE/ACCELERATE IN AN EMERGENCY SITUATION. ACURA PEOPLE WON'T TAKE IT SERIOUSLY SO NHTSA SHOULD GET INVOLVED. A QUICK SURVEY WILL DEMONSTRATE THIS IS A COMMON PROBLEM IN THIS CAR. ACURA HAS A TSB BUT THIS SHOULD BE A RECALL ITEM. THEY'RE TRYING TO GET BEYOND EVERYONE'S 6 YEAR POWERTRAIN WARRANTY WITHOUT HAVING TO TAKE ACTION.",
        "vin": "5FRYD4H40GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343343,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "- VEHICLE LOST POWER THE OTHER DAY HAD TO PULL OVER LUCKILY WAS STILL IN RESIDENTIAL CORRIDOR AT 35MPH WITH NO OTHER VEHICLES AROUND. TRANSMISSION PROBLEMS INCLUDE: ERRATIC SHIFTING, SENSATION OF ACCELERATION WHEN COASTING DOWN HILLS, SURGING WHEN BRAKING, TRANSMISSION FEELS LIKE IT STAYS IN VARIOUS GEARS TOO LONG. DURING SLIGHT ACCELERATION FROM A STOP, EXPERIENCE BOTH HESITATION AND SURGES AND TRANSMISSION FEELS ROUGH AT LOW SPEEDS. ALSO EXPERIENCE POOR ACCELERATION AND BOGGING AT LOW SPEEDS. ERRATIC SHIFTING AND SPEED CHANGES OCCURRING DAILY.",
        "vin": "5FRYD4H91GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342619,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IF THE OWNER SITS IN THE CAR WITH THE RADIO OPERATING AND THEN TURNS THE CAR OFF COMPLETELY BUT DOESN'T LOCK THE VEHICLE AND THEN RETURNS AT SOME POINT AND ATTEMPTS TO UNLOCK THE VEHICLE AND THEN START THE ENGINE, ON AN INTERMITTENT BASIS, THE BATTERY HAS BEEN RUN DOWN EVEN THOUGH THE ENGINE WAS TURNED OFF.",
        "vin": "5FRYD3H22GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "12/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339331,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT STATED THAT WHILE DRIVING AT 75 MPH, THE VEHICLE INDEPENDENTLY SHIFTED INTO NEUTRAL. THE FAILURE RECURRED SEVERAL TIMES AND THE CONTACT WAS UNABLE TO SHIFT THE VEHICLE BACK INTO DRIVE. THE CONTACT PULLED OVER AND RESTARTED THE VEHICLE AND THE VEHICLE OPERATED AS INTENDED. THE CONTACT STATED THAT THE POWER TRAIN CONTROL MODULE SOFTWARE WAS PREVIOUSLY UPDATED AT ROSENTHAL ACURA (623 FREDERICK AVENUE, GAITHERSBURG, MD 20879, (877)300-4226) HOWEVER, FAILED TO PREVENT THE FAILURE. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER TO BE INSPECTED. THE CONTACT REFERENCED MANUFACTURER COMMUNICATION NUMBERS: 15-034 NAD 19-003 AS POSSIBLE FIXES FOR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 39,000. *LN *TR",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "06/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338716,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS AT HIGHWAY SPEEDS. NO SOFTWARE UPDATE BY ACURA HAS FIXED THE ISSUE. THERE ARE SEVERAL LAWSUITS AGAINST ACURA FOR THE SAME BUT THEY DENY ANY RESPONSIBILITY. GOOGLE ACURA MDX TRANSMISSION CLASS ACTION LAWSUIT.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338352,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT STATED THAT WHILE DRIVING AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FAILED TO RESPOND. THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED. BERGSTROM ACURA (2910 N VICTORY LN, APPLETON, WI 54913, (800) 353-3654) WAS CONTACTED AND INFORMED OF THE FAILURE. AN APPOINTMENT WAS SCHEDULED TO HAVE THE VEHICLE DIAGNOSED WHICH WAS STILL PENDING. THE FAILURE RECURRED THREE TIMES. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 79,000.",
        "vin": "5FRYD3H40GB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329775,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 MDX SHIFTS INTO NEUTRAL AT HIGHWAY SPEEDS AND WON?T LET ME ACCELERATE. I HAVE ESCAPED GETTING INTO AN ACCIDENT MULTIPLE TIMES. EVERY TIME I TAKE IT TO THE DEALER THEY DO A NEW SOFTWARE UPDATE HOWEVER THE ISSUE STILL REMAINS. THERE ARE HUNDREDS OF PEOPLE REPORTING THIS L. PLEASE LOOK INTO THIS. ACURA HAS NOT RECALLED THE VEHICLES BUT ISSUED A TSB15-034. I HAVE RECEIVED THIS TSB UPDATE BUT THE PROBLEM HASN?T BEEN FIXED. THIS IS A VERY DANGEROUS SITUATION AS I HAVE BARELY ESCAPED GETTING INTO TERRIBLE ACCIDENT. THERE ARE MULTIPLE CLASS ACTION LAWSUITS AGAINST ACURA FOR THE SAME BUT ACURA REFUSES TO ACKNOWLEDGE THE ISSUE. WHEN THE ISSUE ARISES THE MIL STARTS FLASHING RANDOM ERROR MESSAGES. I AM ATTACHING THE PICTURES OF THE ERROR MESSAGES I GOT WHILE STRANDED ON I95.  *TR",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "04/14/2020",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324088,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CAUGHT ON FIRE WHILE DRIVING WITH MY FAMILY INSIDE THE VEHICLE! LUCKY US POLICE WAS AROUND TO HELP EVERYONE OUT OF THE VEHICLE.  *TR",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE ENGINE IS COLD THE CAR HESITATES WHEN IT SHIFTS INTO 2ND & 3RD GEARS.  IT ALMOST STALLS.  I  HAVE ALMOST BEEN HIT NUMEROUS TIMES AT INTERSECTIONS. THE DEALER SAYS NOTHING IS WRONG, YET 2 LOANERS THAT WERE SIMILAR AGES & MILES DIDN'T DO THAT. THE PROBLEM GOES AWAY AFTER THE CAR IS DRIVEN A FEW MILES. HAPPENS EVERY DAY.  *TR",
        "vin": "5FRYD4H21GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "04/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322583,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA NEEDS TO DO SOMETHING ABOUT THIS ISSUE! MY PREVIOUS COMPLAINT WAS #11269881 AND COVERED FOUR SEPARATE INCIDENCES IN 2019. THIS IS A SAFETY ISSUE! PREVIOUSLY TWO OF MY FOR INSTANCES OF THIS HAPPENING INVOLVED SIGNIFICANT INSTANT SLOWING DOWN OF THE CAR (BELOW 30 MPH) AND RPM RAISING WHILE WHILE DRIVING 70+ MPH ON INTERSTATE IS DANGEROUS! THIS TIME THE AFTERNOON PRIOR THE CAR EXPERIENCED A LOUDER THAN NORMAL ENGINE SOUND AND RPM LIKE IT WAS IN A LOWER GEAR. ON THE MORNING OF 4/24/20 WHEN THE CAR WAS STARTED THE WARNING LIGHTS CAME ON AND CYCLED THROUGH AND REMAINED ON MOST OF THE DAY.  IT WAS NOT UNTIL THE FOURTH TIME DRIVING THE CAR THAT THEY ALL STOPPED LIGHTING UP. HOWEVER THE CAR STILL SEEMS TO BE DRIVING IN A LOWER GEAR BUT NO LIGHTS REMAIN ON.  THIS TIME IT DID NOT LOSE POWER BEFORE THE LIGHTS CAME ON.  THEY JUST APPEARED ON WHEN WE WENT TO START THE CAR IN THE MORNING. TRAILER STABILIZATION ASSIST PROBLEM, ROAD DEPARTURE MITIGATION SYSTEM PROBLEM, EMISSIONS SYSTEM PROBLEM,BRAKE SYSTEM PROBLEM,POWER STEERING SYSTEM PROBLEM,VEHICLE STABILITY ASSIST PROBLEM,HILL START ASSIST PROBLEM,. MILEAGE AT 122,044. LAST TIME MY DEALER TOLD ME IT WAS MISFIRING SO CHANGE THE SPARK PLUGS. I DID BUT IT HAS HAPPENED NOW THREE MORE TIMES SINCE THEN.",
        "vin": "5FRYD4H42GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11316652,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT STATED WHILE DRIVING 20 MPH, WHEN DRIVING OVER A SPEED BUMP THE VEHICLE ACCELERATED INDEPENDENTLY AND IMPACTED THE VEHICLE IN FRONT.  THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. AIR BAGS DID NOT DEPLOY. THE CONTACT STATED SHE WAS NOT INJURED. THE CONTACT STATED THE DRIVER OF THE OTHER VEHICLE SUSTAINED UNKNOWN INJURIES BUT WAS NOT AWARE IF MEDICAL ATTENTION WAS REQUIRED. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DRIVABLE AND WAS TOWED TO AN INDEPENDENT COLLISION CENTER. THE VEHICLE FAILURE WAS NOT DIAGNOSED BY AN INDEPENDENT MECHANIC OR DEALER. THE CONTACT ALSO MENTIONED AFTER THE ACCIDENT THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 19V060000 (FUEL SYSTEM, OTHER) AT NORRIS ACURA (8559 BALTIMORE NATIONAL PIKE, ELLICOTT CITY, MD 21043) ON 10/11/2019. THE CONTACT STATED AFTER THE RECALL REMEDY THE VEHICLE HAD A FUEL LEAK. THE DEALER WAS CONTACTED, HOWEVER STATED SHE WOULD BE REASONABLE FOR DIAGNOSES AND REPAIRS FEES. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 64,053.",
        "vin": "5FRYD4H22GB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312080,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 MDX HAS HAD ITS TRANSMISSION REPLACED TWICE.  THE SYMPTOMS ARE USUALLY \"CHIRPING\" NOISES AND/OR ROUGH/VIOLENT SHIFTING BEHAVIOR.    ON THE VERY DAY THAT I PICKED THE VEHICLE UP FROM THE ACURA SERVICE SHOP AFTER ITS 2ND TRANSMISSION REPLACEMENT, THE VEHICLE STILL WILDLY EXHIBITED \"CHIRPING\" NOISES, ALL OF WHICH ARE DOCUMENTED IN A YOUTUBE VIDEO THAT WE TOOK WHILE DRIVING THE VEHICLE HOME THAT DAY.    EVEN AFTER 2 TRANSMISSION REPLACEMENTS, THE TRANSMISSION IS BEGINNING TO EXHIBIT THE SAME SYMPTOMS YET AGAIN.  THIS IS A LEMON TRANSMISSION.    THIS WEEK, I HAD AN INDEPENDENT MECHANIC WHO SPECIALIZES ONLY IN ACURA/HONDA VEHICLES INSPECT THE TRANSMISSION.  HE DOCUMENTED THE \"CHIRP\" NOISE AS WELL AS \"HARSH\" AND \"ERRATIC\" SHIFTING.  THIS IS ALL DOCUMENTED IN WRITING ON HIS WORK ORDER RECEIPT, WHICH I CAN PROVIDE UPON REQUEST.    THIS MECHANIC ALSO SUGGESTED THAT IF THE TRANSMISSION FAILS, IT COULD CAUSE A CATASTROPHIC CRASH AND POTENTIAL INJURY OR DEATH TO OCCUPANTS DEPENDING ON THE SITUATION.    PRIOR TO THE INDEPENDENT MECHANIC EXAMINING THE VEHICLE, MY LOCAL ACURA SERVICE SHOP GAVE ME THE \"RUN-AROUND\" SONG-AND-DANCE BY SAYING THEY CAN'T FIX ANYTHING BECAUSE THEY WERE \"UNABLE TO RECREATE THE SYMPTOMS\".  THEY STATED THIS DESPITE THE FACT THAT I HAVE EXTENSIVE VIDEO/AUDIO EVIDENCE OF THE SYMPTOMS ON YOUTUBE OF MY SPECIFIC VEHICLE.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311881,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DESIGN DEFECT ON THIS ACURA IS THAT THE VEHICLE SUFFERS FROM \"SUDDEN ACCELERATION,\" AFTER DEPRESSING THE ACCELERATOR THE VEHICLE CONTINUES TO ACCELERATE FOR VARIOUS SECONDS. THE SAME ISSUE HAPPENS WHEN THE VEHICLE SLOWS DOWN AFTER PRESSING THE BRAKE WHEN ARRIVING TO AN INTERSECTION, AFTER RELEASING THE BRAKE WHEN GETTING READY TO STOP THE VEHICLE WILL CONTINUE TO ACCELERATE, CAUSING A TREMENDOUS HAZARD AND RISK OF DEATH FOR AN ACCIDENT TO PEOPLE IN OTHER VEHICLES, PEDESTRIANS, AND OCCUPANTS OF THE VEHICLE ITSELF.    I TOOK THE VEHICLE FOR REPAIR AT YOUR ACURA DEALERSHIP IN MISSION VIEJO, CALIFORNIA (SEE ENCLOSED BACK UP DOCUMENTS), AND THE SERVICE SPECIALIST FROM ACURA RECOMMENDED ME TO PAY FOR ADDITIONAL SERVICES OVER AND BEYOND MY STILL EXISTING WARRANTY (WARRANTY IS VALID UNTIL 03/2020), LIKE A SOFTWARE UPDATE AND AN TRANSMISSION FLUSH, STATING IT WOULD REPAIR THE CONDITION. WELL, THE CONDITION WAS NEVER FIX AND THE RISK OF ACCIDENT STILL REMAINED.    I TOOK THE VEHICLE ON A SECOND OCCASION TO THE SAME DEALERSHIP, AND THIS TIME, SINCE THEY HAVE ALREADY TAKEN MY MONEY ON THE PREVIOUS SERVICE, DECLINED TO DO ANY MORE REPAIRS ARGUING THAT CONDITION (SUDDEN ACCELERATION) IS NOT CONSIDERED HAZARDOUS BY ACURA USA, AND THAT IT HAPPENS TO OTHER ACURA VEHICLE WITH THIS TYPE OF TRANSMISSION, AND THEREFORE THEY WOULDN'T DO ANYTHING TO FIX IT. ON THIS SECOND TIME I RECORDED THE CONVERSATIONS WITH THE SERVICE CONSULTANTS AND WITH THE SERVICE MANAGER, IN CASE I HAD TO ESCALATE THIS ISSUE FURTHER LIKE I'M DOING NOW OR TAKE FURTHER LEGAL ACTIONS IN THIS REGARD.    I ALSO HAD MULTIPLE PHONE CONVERSATION WITH THE ACURA CLIENT RELATIONSHIPS, STATING MY ISSUE AND YOUR REPRESENTATIVES DIDN'T OFFER ANY HELP, THEY ONLY INDICATED I'D HAVE TO DEAL WITH DEALERSHIP DIRECTLY, EVEN THOUGH HE'S A REPRESENTATIVE OF THE NAME, ACURA USA.  (SEE ENCLOSED LETTER TO YOU FOR MORE INFORMATION)",
        "vin": "5FRYD3H44GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308001,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ATTEMPTED TO ACCELERATE WITH PEDAL WHILE AT FREEWAY SPEEDS AND AFTER CANCELING CRUISE CONTROL, VEHICLE DOES NOT ACCELERATE, DOWNSHIFTS INSTANTLY TO 2ND GEAR, MULTIPLE WARNING LIGHTS ON DASH, MAIN DISPLAY READS 'EMISSIONS SYSTEM PROBLEM'. ACCELERATOR FUNCTION RETURNS BUT TRANSMISSION IS STUCK IN 2ND GEAR AT FREEWAY SPEEDS AND VERY HIGH ENGINE RPM. MUST MAKE EMERGENCY STOP ON SIDE OF ROAD AND RESTART VEHICLE TO REMEDY. CHECK ENGINE LIGHT AND 'EMISSIONS SYSTEM PROBLEM' WARNING REMAIN FOR A DAY OR TWO FOLLOWING AN INCIDENT BUT VEHICLE DRIVES OK. THIS ISSUE HAS OCCURRED ON 4 SEPARATE OCCASIONS. TOOK TO ACURA DEALER AFTER 3RD INCIDENT AND DEALER REPORTED NO TROUBLE FOUND.",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11303030,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT HIGHWAY SPEEDS FOR AT LEAST A HALF HOUR AND ATTEMPTING TO ACCELERATE, THE ENGINE SPEED WILL DROP TO IDLE AND WILL NOT RESPOND TO ACCELERATOR PEDAL MOVEMENT FOR SEVERAL SECONDS. WHEN THIS HAPPENS, THERE ARE NO: WARNINGS, LIGHTS, OR MESSAGES AND NO FAULT CODES ARE STORED IN ANY OF THE CONTROL MODULES. THIS HAS NEVER HAPPENED WHEN USING CRUISE CONTROL. THIS HAS HAPPENED ON AT LEAST 9 DIFFERENT TRIPS. THIS IS AN EXTREMELY DANGEROUS CONDITION THAT HAS NEARLY RESULTED IN ANOTHER VEHICLE IMPACTING OURS FROM BEHIND, DUE TO THE RAPID DECELERATION.",
        "vin": "5FRYD4H46GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300557,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE WE PURCHASED THIS CAR WE HAVE ISSUES WITH THE VEHICLE WHERE IT IS HESITATING TO ACCELERATE WHEN GOING FROM 0 MPH TO 30 MPH. WE TOOK IT TO THE DEALERSHIP AND THEY UPDATED THE SOFTWARE FOR THE POWERTRAIN BUT STILL THE VEHICLE HAS ACCELERATION ISSUES WHEN GOING FROM 0 TO 40 MILES PER HOUR. WE HAVE RESEARCHED THIS ISSUE ON INTERNET AND IT SEEMS LIKE LOTS OF PEOPLE OWNING ACURA ARE HAVING THIS ISSUE. THIS ISSUE IS ATTRIBUTED TO NEW 7 SPEED TRANSMISSION THAT ACURA BUILT. IT LOOKS LIKE A SAFTEY ISSUE SINCE THE VEHICLE WOULD NOT ACCELERATE AFTER STOPPING AT TRAFFIC LIGHT OR STOPPING TO TAKE RIGHT AND RE ACCELERATING.",
        "vin": "5FRYD4H29GB"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290005,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ACCELERATION IS SLUGGISH AT STOP AND GO. DURING HIGHWAY SPEED, IF TRANSMISSION IS IN LOW CRUISING GEAR AND YOU NEED TO ACCELERATE, TRANSMISSION IS SLUGGISH. ISSUES WAS CORRECTED AT DEALER. DEALER FOUND 1 FAULTY TRANSMISSION COMPUTER CODE. NEW SYMPTOMS AFTER COMPUTER FIX, OVER ACCELERATION AND HARSH SHIFT POINTS. DEALER ADVISED TO DRIVE 500 MILE AFTER COMPUTER REFLASH.     INTERIOR LIGHT DO NOT DIM AFTER A FEW SECONDS. INTERIOR LIGHTS WILL NOT TURN OFF REGARDLESS OF LOCKING VEHICLE.     REAR SUSPENSION HAS A 0.55 CAMBER DIFFERENCE,  VEHICLE HAS 26,765 MILES. I ASKED DEALERSHIP SERVICE TO LOOK AT THIS ISSUE. DEALER NEVER ADVISED ON ISSUES.",
        "vin": "5FRYD3H43GB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286445,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NOVEMBER 10, 2019 TRAVELING ON HIGHWAY AT ~65 MPH, PRESSED ACCELERATOR TO PASS CAR AND VEHICLE WOULD NOT SPEED UP...FELT LIKE THE CAR WAS IN NEUTRAL.  AFTER ABOUT 7 TO 10 SECONDS THE TRANSMISSION FINALLY KICKED IN AND THE CAR ACCELERATED. IF THIS HAPPENED ON A 2 LANE ROAD THE LACK OF TRANSMISSION DELIVERING POWER TO WHEELS COULD HAVE RESULTED IN A HEAD ON COLLISION.  SERVICE APT SCHEDULED WITH ACURA DEALERSHIP WHERE PURCHASED AND WAS TOLD THEY COULD FIND NO 'CODES' OR ALERTS IN CARS COMPUTER AND THAT THEY FOUND NOTHING WRONG.  THE DID SAY THEY REPROGRAMMED THE TRANSMISSION SOFTWARE...BUT THEY HAVE DONE THAT 2 OTHER TIMES.  CAR HAS ONLY 35K MILES ON IT AND WE HAVE BROUGHT CAR INTO ACURA DEALERSHIP 4 TIMES TO ADDRESS THE HARSH SHIFTING OF TRANSMISSION AND TOLD THEM EACH TIME WE FELT IT WAS A SERIOUS SAFETY CONCERN.  THE ABOVE INCIDENT OF NO POWER WHEN ATTEMPTING TO PASS ON HIGHWAY IS THE FIRST TIME THAT HAS HAPPENED..BUT IS A VERY SERIOUS CONCERN.  WE WERE TOLD FOR THE 3RD TIME THAT THE HARSH SHIFTING AND GEAR-WANDERING WAS A 'CHARACTERISTIC' OF THIS MAKE / MODEL CAR AND THAT ACURA HAS BEEN TRYING TO ADDRESS THE ISSUE WITH TRANSMISSION SOFTWARE UPDATES.  I HAVE SEEN MANY ONLINE COMPLAINTS OF THE \"GEAR-WANDERING' TRANSMISSION ISSUE ONLINE AND HAVE ALSO READ SIMILAR SAFETY COMPLAINTS OF CAR LOSING TRANSMISSION POWER AT HIGHWAY SPEEDS.  PLEASE THOUGHTFULLY REVIEW THIS COMPLAINT AND CONTACT ME IF YOU NEED ADDITIONAL INFORMATION. WE FIRMLY BELIEVE THAT THE KNOWN REPORTED ISSUES OF THE 2016 ACURA MDX SHAWD TRANSMISSION PROBLEMS ARE A HUGE SAFETY ISSUE.  THIS 7 SEATER SUV IS DRIVEN BY MANY FAMILIES!",
        "vin": "5FRYD4H42GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278645,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCE THREE DIFFERENT SCENARIOS WHERE THE TRANSMISSION EITHER APPEARS TO SHIFT INTO NEUTRAL OR GEARS GRINDING.    1) SHIFTING FROM PARK TO DRIVE, THE VEHICLE ALL OF A SUDDEN STALLS AND ENGINE REVS UP WITHOUT ANY MOTION.  RESOLVED BY SHIFTING VEHICLE BACK TO PARK, AND THEN TO DRIVE.    2) WHEN VEHICLE IS IN-MOTION AT HIGHWAY SPEEDS BETWEEN 40-70 MPH, ALL OF A SUDDEN VEHICLE LOSES ACCELERATION POWER AND SPEED DECREASES FOR 3-4 SECONDS FORCING OTHER VEHICLES FROM BEHIND TO EITHER BRAKE OR SLOW DOWN.  OFTEN OCCURS WHILE MERGING ONTO THE HIGHWAY OR LANE CHANGES WHERE ACCELERATION IS REQUIRED.    3) WHILE DRIVING ON NORMAL STREETS AT 30-40 MPH, GEARS GRIND FOR APPROXIMATELY 1-2 SECONDS WITHOUT LOSING ACCELERATION.",
        "vin": "5FRYD4H49GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271772,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 MDX HAS A FUEL PUMP FAILURE WHICH HAS CAUSED MY MDX TO STALL AND LED TO PROBLEMS WITH MY FUEL INJECTORS. THERE IS A RECALL BUT MY ACURA DEALER REFUSES TO HONOR IT.  ON 10/18 MY WIFE WAS DRIVING THE CAR ON THE FREE WAY AND IT SLOWED TO A STALL.  THIS IS A KNOWN ISSUE. I HAVE PASTED A URL TO THE RECALL BELOW. THE DEALER REFUSED TO FIX MY FUEL INJECTORS OR REPLACE MY FUEL PUMP.  THE ARE OFFERING A FREE FUEL PUMP SOFTWARE UPGRADED BUT THEY WANT ME TO PAY TO REPLACE THE FUEL PUMP AND FUEL INJECTORS.   HTTPS://WWW.CONSUMERREPORTS.ORG/CAR-RECALLS-DEFECTS/HONDA-ACURA-RECALL-POTENTIAL-STALLING-ISSUE-ACCORD-MDX-TLX/",
        "vin": "5FRYD3H42GB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271354,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT DRIVER SIDE SUSPENSION IS MAKING A CLUNKING SOUND WHEN DRIVING OVER A SPEEDBUMP OR POTHOLES OR WHEN TURNING. THE VEHICLE SWAYS- PITCHING AND ROLLING.",
        "vin": "5FRYD4H24GB"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11271252,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS APPROACHING A STOP LIGHT ON A BUSY STREET ON A VERY BRIGHT DAY AND DID NOT SEE THAT THE STOP LIGHT I WAS APPROACHING HAD TURNED RED.  WHEN I REALIZED IT WAS RED, I BRAKED RAPIDLY OF COURSE BUT STILL GOING AT A PRETTY GOOD SPEED I HIT THE STOPPED CAR IN FRONT OF ME.  THE COLLISION WAS BETWEEN DRIVERS SIDE OF MY MDX AND RIGHT REAR OF A MEDIUM-SIZED WHITE JEEP.  MY 17 YR OLD SON WAS IN THE FRONT PASSENGER SEAT AND HIS AIR BAG DEPLOYED, HOWEVER MY DRIVER BAG DID NOT DEPLOY.   BOTH SEAT BELTS LOCKED UP.  THE IMPACT WAS VERY STRONG ON DRIVER SIDE GIVEN THAT IS WHERE WE HIT.   FORTUNATELY, MY SEAT BELT KEPT ME FROM HITTING THE WINDSHIELD.   MY ONLY INJURIES ARE NECK ACHE, HEAD ACHE, SEAT BELT BRUISES, AND RINGING EARS.        MY CONCERN IS FOR FUTURE USE OF MY CAR.   IF THE DRIVER AIR BAG DID NOT DEPLOY GIVEN THIS HARD OF A HIT, I DO NOT BELIEVE IT WILL DEPLOY IN ANY COLLISION.   I FILED A COMPLAINT WITH ACURA REQUESTING THEM TO INSPECT THE AIRBAG AND BLACK BOX TO DETERMINE WHY IT DID NOT DEPLOY AND THEY SAID THAT AIRBAGS ARE DESIGNED TO ONLY DEPLOY WHEN NEEDED AND IN THIS CASE THE CARS COMPUTER DETERMINED IT WAS NOT NEEDED HENCE THERE IS NO REASON TO INSPECT IT FURTHER.   I BELIEVE THAT IF THE AIRBAG DEPLOYED ON THE PASSENGER SIDE WHERE THE IMPACT WAS LESS THEN THE AIR BAG SHOULD HAVE ALSO DEPLOYED ON THE DRIVER SIDE.     MY INSURANCE ADJUSTER ALSO SUPPOSEDLY REQUESTED ACURA TO INSPECT THE VEHICLE AND THEY ALSO DID NOT GET ANY FAVORABLE ACTION FROM ACURA.    HONDA/ACURA OF AMERICA RETURNED MY PHONE CALLS TWICE AND SIMPLY SAID THERE IS NO SUPPORTING INFORMATION INDICATING THAT THE AIRBAG OR CARS COMPUTER SHOULD BE INVESTIGATED.   THEY ALSO DID NOT ASK ANY QUESTIONS ABOUT THE ACCIDENT IN WHICH ADDITIONAL INFORMATION COULD BE PROVIDED.     THE ESTIMATED REPAIR ON THE CAR IS OVER $12K.",
        "vin": "5FRYD3H45GB"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269881,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "APRIL 25,2019 DRIVING FROM ILLINOIS TO MS AT 75 MPH ON INTERSTATE AND APPLIED BREAK FOR UPCOMING CONSTRUCTION ZONE AND ALL WARNING SYSTEM LIGHTS FLASH THROUGH DASH AND CARE IMMEDIATELY STARTED SLOWING AND HAD NO ACCELERATION AT ALL. DISABLED ALL SAFETY FEATURES. ROAD DEPARTURE, BRAKE SYSTEM, ECT.  PULLED OVER TO SIDE OF ROAD.  RESTARTED SEVERAL TIMES AND ALL BUT TWO LIGHTS REMAINED ON SO CALLED DEALER.  TWO LIGHTS REMAINED FLASHING AND CAR NOW SEEMED TO DRIVE OK SO COULD BE BROUGHT TO DEALER ABOUT 80 MILES AWAY.  MEMPHIS ACURA DEALER WANTED TO KEEP CAR BECAUSE THEY INDICATED TRANSMISSION ISSUE BUT SINCE LIGHTS WERE RESET THEY SAID TAKE TO DEALER IF COMES ON AGAIN.  MILEAGE 92,321. CALLED PEORIA IL ACURA DEALER A WEEK LATER TO CHECK ON ISSUE AND THEY SAID CODE WAS IMPLY A GLITCH.  JULY 28, 2019 DRIVING 40 MPH IN TOWN AND ALL SAFETY LIGHTS CAME ON DASH.  DISABLE ED ALL SAFETY FEATURES OF VEHICLE.  RESTARTED SEVERAL TIMES AND EVENTUALLY ALL LIGHTS BUT TWO REMAINED ON.  A FEW HOURS LATER ALL LIGHTS WERE NOW OFF.  MAKE APPOINTMENT WITH PEORIA IL ACURA DEALER.  MILEAGE 97,974.  PEORIA DEALER SAID THE LIGHTS SOME ON BECAUSE WE NEEDED OUR 105,000 SERVICING WHICH INCLUDES ABOUT $1500 IN SERVICE LIKE PLUGS AND TIMING BELT.  I CHALLENGE THEIR CLAIM (NOT AT THE MILEAGE) THAT ACURA WOULD CAUSE A SERIOUS SAFETY ISSUE FOR US ALL TO GET US TO DO THE SERVICE. THEY SAID UNFORTUNATELY THAT IS WHAT HAPPENS. NEXT WEEK HAD SPARK PLUGS REPLACED SINCE THEY SAID THAT CAUSED MISFIRE CODE. AUGUST 21 2019 AT 99,800 MILEAGE DRIVING 40 MPH ALL SAFETY LIGHTS ON CAR LOST POWER AND HESITATED AND THEN QUICKLY WENT OFF.  OCTOBER 6 2019 AT 105,392 MILEAGE DRIVING ON INTERSTATE IN ILLINOIS AT ABOUT 75 MPH AND APPLIED BREAK FOR REST STOP AND ALL LIGHTS ON AND THIS TIME RPMS ROSE TO BETWEEN 5/6. DROVE 20 MPH ON SIDE TO REST STOP.  RESTARTED SEVERAL TIMES AND ONLY TWO LIGHTS REMAINED. CAR DRIVABLE.",
        "vin": "5FRYD4H42GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269782,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS WHEN ACCELERATING. I WAS TRYING TO PASS A LARGE TRUCK ON A TWO LANE HIGHWAY AND THE CAR STOPPED ACCELERATING AS I WAS TRYING TO PASS THE TRUCK IN THE OTHER LANE. I HAD TO HIT BRAKES TO COAST BACK BEHIND TRUCK WHILE I WAITED FOR TRANSMISSION TO REENGAGE. RPMS DROPPED TO 0 DURING THIS EVENT.   CAR WAS IN TO DEALER 2 WEEKS AGO FOR THIS SAME ISSUE AND THEY UPDATED THE CAR'S SOFTWARE.",
        "vin": "5FRYD3H92GB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269036,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG ALERT LIGHT CAME ON WITH RED AIRBAG AND STEERING WHEEL SIGN. TAKING IT TO DEALER TOMORROW, AND WILL UPDATE TOMORROW. THIS HAPPENED WHILE I WAS DRIVING STRAIT ON FREEWAY.",
        "vin": "5FRYD3H45GB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/06/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267652,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. WHILE TURNING THE VEHICLE, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A DEALER AND THE MANUFACTURER WERE NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "5FRYD4H63GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266352,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 ACURA MDX. CONSUMER WRITES IN REGARD TO DEFECTIVE TRANSMISSION. *AS    THE CONSUMER STATED THE TRANSMISSION WAS REPAIRED TWICE AND FAILED A THIRD TIME. *JS",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256151,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD AN ELECTRONIC FAILURE (EPS) WHICH CAUSED A LOSS OF STEERING CONTROL. VEHICLE WAS IN MOTION IN OUR DRIVEWAY.",
        "vin": "5FRYD3H48GB"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252206,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BEFORE SHARING THE DETAILS, YOU SHOULD KNOW THAT THIS COULD BE A DEADLY SAFETY MATTER.  IF A TRANSMISSION FAILS AT HIGHWAY SPEEDS (OR ANY SPEED), THE VEHICLE LOSES POWER AND COULD VERY EASILY GET CRUSHED BY AN 18-WHEELER.  A DRIVER AND/OR A WHOLE FAMILY COULD DIE.  YOU SHOULD GO AFTER ACURA BEFORE SOMEONE HAS TO DIE AS A RESULT OF ACURA'S NEGLIGENCE.    MY 2016 ACURA MDX HAD ITS FIRST TRANSMISSION REPLACEMENT IN OCTOBER 2016 AT AROUND 14,000 MILES AND ABOUT 18 MONTHS INTO OWNERSHIP.  I HAD PURCHASED THE VEHICLE AS A BRAND NEW CAR FROM AN ACURA DEALER.  I AM THE ONLY OWNER, AND IT HAS BEEN \"BABIED\" AND RECEIVED PROPER MAINTENANCE FROM ACURA DEALER SERVICE SHOPS ONLY.    LEADING UP TO THE 1ST TRANSMISSION REPLACEMENT, THE VEHICLE WAS MAKING AWFUL \"CHIRPING\" NOISES UPON SLIGHT ACCELERATION AT SLOW SPEEDS.  AFTER THE 1ST TRANSMISSION REPLACEMENT, ALL SEEMED FINE UNTIL RECENTLY.    AT AROUND 38,000 MILES (SPRING 2019, STILL BARELY WITHIN THE 4 YEAR WARRANTY), THE VEHICLE BEGAN TO EXHIBIT IDENTICAL SYMPTOMS.  AT 39,000 MILES, THE MDX RECEIVED ITS 2ND TRANSMISSION REPLACEMENT.  ON THE VERY DAY THAT I PICKED IT UP FROM THE 2ND TRANSMISSION REPLACEMENT REPAIR WORK, THE MDX STARTED MAKING FAR WORSE NOISES THAN BEFORE THE REPAIR WORK.    IT IS BACK IN THE SHOP AGAIN AND ACURA SEEMS TO BE AT A COMPLETE LOSS FOR HOW TO FIX IT PROPERLY FOR A 3RD TIME!    THERE ARE MANY ACURA/HONDA TECHNICAL SERVICE BULLETINS ABOUT TRANSMISSION ISSUES ON THESE AND ACURA/HONDA-RELATED VEHICLES WHICH USE THE SAME TRANSMISSION.  IT IS CLEARLY A WELL-KNOWN PROBLEM PUTTING COUNTLESS DRIVERS/PASSENGERS AT PHYSICAL RISK OR FINANCIAL RISK.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244901,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT RECEIVED  NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V060000 (FUEL SYSTEM, OTHER). THE CONTACT STATED THAT THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS SERVICED AT DALLAS ACURA (4801 LEMMON AVE, DALLAS, TX 75219, (214) 692-2872), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE CONTACT MENTIONED THAT THE CHECK ENGINE INDICATOR REMAINED ILLUMINATED AFTER THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "5FRYD3H97GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/10/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243010,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE CAR 7/6/2019 USED WITH 26,943 MILES. AT 27,961 MILES I WAS DRIVING ON THE FREEWAY IN STOP AND GO TRAFFIC. PRESSED ON THE ACCELERATOR AFTER A STOP AND THE CAR JERKED AND I HEARD A LOUD \"CLUNK\". WARNING LIGHTS APPEARED FOR \"TRANSMISSION SYSTEM PROBLEM\" AND \"BLIND SPOT WARNING MALFUNCTION\". THE CAR SEEMED TO STAY IN FIRST OR SECOND GEAR AS I SLOWLY EXITED THE FREEWAY AT HIGH RPM. HAD IT TOWED TO THE ACURA DEALER. TRANSMISSION REPLACED AS A RESULT.",
        "vin": "5FRYD4H46GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/10/2019",
        "dateOfIncident": "09/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243032,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 80,000 MILES CAR STARTED MAKING A NOISE SOUNDING LIKE METAL SPINNING ON METAL.  TRANSMISSION SYSTEM PROBLEM LIGHT CAME ON.  RPMS WENT REALLY HIGH WHEN I TOOK MY FOOT OFF THE GAS THE RPMS WENT REALLY LOW. THIS ALL HAPPENED WHILE I WAS ON THE HIGHWAY. PULLED OVER, SHUT CAR OFF, RESTARTED CAR, WARNING LIGHT WENT AWAY RPMS WERE FINE BUT THE NOISE WAS STILL THERE. TOOK CAR IN FOR SERVICE THEY COULDN'T FIND ANY PROBLEM HAD TRANSMISSION FLUID REPLACED AND THE NOISE WENT AWAY HOWEVER OCCASIONALLY THE TRANSMISSION SYSTEM PROBLEM WOULD OCCUR. SO I SHUT OFF THE CAR RESTART AND THE PROBLEM GOES AWAY. SEEMS THE TRANSMISSION PROBLEM HAPPENS WHEN I'M ON THE HIGHWAY AND GOING UP HILL BETWEEN 60 AND 70 MILES AN HOUR WHEN THE RPMS GO SLIGHTLY ABOVE TWO.  IT DOES NOT SEEM TO HAPPEN ON LEVEL GROUND. I DO MOSTLY CITY DRIVING AND PUT ANOTHER 50,000 MILES ON SINCE THE FIRST TIME THE PROBLEM HAPPENED. TOOK CAR IN FOR SERVICE WHILE THE LIGHT WAS ON, DIAGNOSTIC SHOWS TORQUE CONVERTER PROBLEM.  THEY TELL ME I NEED A NEW TRANSMISSION. APPARENTLY 2016 MODELS YOU CANNOT REBUILD BECAUSE THERE ARE NO PARTS AVAILABLE. STILL DRIVING CAR TODAY WITH NO PROBLEM DOING CITY DRIVING BUT I ALWAYS PANIC WHEN I HAVE TO GET ON THE HIGHWAY. APPARENTLY I'VE GONE 60,000 MILES MORE WITH A TRANSMISSION THAT CANNOT GO ON A HIGHWAY UPHILL. JUST RECENTLY MY CAR IS BEEN GOING INTO NEUTRAL BY ITSELF AND IT STALLS OCCASIONALLY. THIS HAPPENS WHILE I'M DRIVING. I FEEL VERY UNSAFE BUT I DON'T HAVE THE MONEY TO REPLACE MY TRANSMISSION. I WISH THE TORQUE CONVERTER COULD BE REPLACED BUT THERE ARE NO PARTS AVAILABLE. I BELIEVE ACURA IS NOT ADMITTING TO A PROBLEM",
        "vin": "5FRYD4H29GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240394,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. WHILE DRIVING 75 MPH, THE VEHICLE DECELERATED TO 45 MPH AND THE EMISSION, ALL WHEEL DRIVE, TRANSMISSION, AND BLIND SPOT WARNING INDICATORS ILLUMINATED.  THE VEHICLE WAS TAKEN TO FOX ACURA (4330 29TH ST SE, GRAND RAPIDS, MI 49512, (616) 942-8040) WHERE IT WAS DIAGNOSED THAT THE SOFTWARE NEEDED TO BE UPDATED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 105,000.",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233636,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 ACURA MDX. STALLED TWICE. BOTH TIMES IN START AND STOP TRAFFIC  WHEN STOPPED THE CYLINDER DEACTIVATION ENGAGED, HOWEVER THEN THE POWER WENT OUT COMPLETELY WITHOUT WARNING, IT TOOK ABOUT 5-10 MIN THEN THE PUSH TO START WORKED AND THE CAR RESTARTED. AFTER THE FIRST STALL WE TOOK IT ACURA, HOWEVER THEY SAID THERE WAS NOTHING WRONG. I AM WRITING THIS REPORT AFTER THE SECOND STALL TODAY.",
        "vin": "5FRYD4H91GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233186,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED STALLING AT LOW SPEEDS AND HIGHER SPEEDS.  WHEN SLOWING DOWN BY TAKING THE FOOT OFF THE GAS (COASTING SOMETIME) AND WHEN GAS PEDAL IS PRESSED, THE CAR SEEMS TO HAVE A TRANSMISSION STALL.  YOU CAN PRESS THE GAS PEDAL TO THE FLOOR AND AFTER A MOMENTARY STALL, THE TRANSMISSION CATCHES BACK UP AND REGAINS POWER.  VERY DANGEREOUS FOR INTERSECTIONS AND INTERSTATE DRIVING.    7-18-19 WAS THE LAST DATE TO EXPERIENCE THIS OCCURANCE.  I HAVE TAKEN THE CAR FOR SERVICE AT ACURA AND THEY ASSURUED ME THE COMPUTER UPDATE WAS DONE AND NO OTHER ISSUES SHOULD OCCUR.  MANY HAVE OCCURRED SINCE THAT UPDATE.",
        "vin": "5FRYD4H49GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228614,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE TIMES WHILE TRAVELLING ON THE INTERSTATE MY VEHICLE SUDDENLY SHIFTED INTO SECOND GEAR WHILE I WAS TRYING TO ACCELERATE, AND GOT STUCK THERE.  IT SUDDENLY DROPPED MY SPEED FROM 70 MPH TO 30.  I WAS PRESENTED WITH SEVERAL ALERTS ON MY DASH (EMISSIONS FAILURE, SH-AWD FAILURE, TRANSMISSION FAILURE).  I WAS ABLE TO CONTINUE DRIVING AT 30 MPH UNTIL I COULD GET TO A SAFE AREA.  AFTER I TURNED OFF THE VEHICLE AND WAITED FOR A PERIOD OF TIME THE WARNINGS WOULD CLEAR.  I WAS FINALLY ABLE TO GET THE VEHICLE TO A DEALERSHIP WHILE THE WARNINGS WERE PRESENT.  I WAS TOLD AFTER DIAGNOSIS THAT THE TRANSMISSION SOFTWARE NEEDED TO BE UPDATED.  AFTER THE UPDATE THE PROBLEM HAS NOT PRESENTED ITSELF AGAIN.  I WAS TOLD SOFTWARE UPDATES ARE NOT COVERED UNDER WARRANTY UNLESS THEY ARE A RECALL ISSUE.",
        "vin": "5FRYD4H95GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220990,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. ON SEVERAL OCCASIONS, WHILE STOPPED AT A TRAFFIC LIGHT, THE VEHICLE STALLED. WHEN THE PUSH TO START BUTTON WAS PRESSED, THE VEHICLE RESTARTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A DIAGNOSTIC APPOINTMENT WAS SCHEDULED WITH ACURA OF FREMONT (LOCATED AT 5700 CUSHING PKWY, FREMONT, CA 94538, (510) 431-2500). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 38,000.",
        "vin": "5FRYD4H94GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/25/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209994,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHIFTING HARD. I ALSO HEAR AND FEEL A GRINDING SOUND. WHEN SHIFTING ON THE LOWER GEARS, IT SHIFTS HARD. I HAVE READ THAT THERE IS A BULLETIN ON THIS BUT NO RECALL YET. THERE HAVE BEEN MANY COMPLAINTS. BULLETIN TSB NO. 15-054. HOW MANY COMPLAINTS ARE NEEDED BEFORE A RECALL IS ISSUED?",
        "vin": "5FRYD4H20GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/25/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210001,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A CERTIFIED PRE-OWNED ACURA MDX DEC. 30, 2018. SINCE OWNING THE VEHICLE WE HAVE EXPERIENCED 3 EPISODES OF VEHICLE LOSING FORWARD THROTTLE WHILE DRIVING AT HIGHWAY SPEEDS. 2 EPISODES OCCURRED WHILE ATTEMPTING TO PASS ANOTHER VEHICLE. IT IS AS IF THE CAR GOES INTO NEUTRAL. THERE ARE NO ERROR MESSAGES OR ENGINE SHUT OFF. WITHIN 10-15 SECONDS THE TRANSMISSION ENGAGES. AFTER EACH INCIDENT WE HAVE BROUGHT THE VEHICLE TO OUR LOCAL ACURA DEALERSHIP. P2638 CODE IS GENERATED WITH EACH INCIDENT. THEY CANNOT REPLICATE THE PROBLEM. THEY HAVE UPDATED THE SOFTWARE AND COMPLETED ALL THE LATEST RECALLS. CORPORATE HAS BEEN NOTIFIED AND WE HAVE A CASE NUMBER. EACH TIME THE VEHICLE HAS BEEN RETURNED TO US TELLING US IT IS SAFE TO DRIVE. CORPORATE REFUSES TO HELP AND ASSURES US IT IS SAFE. THE MOST RECENT EPISODE MAY 19,2019 HAPPENED AFTER THE DEALERSHIP HAD OUR VEHICLE FOR 2 WEEKS.",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206946,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016-2018: NOTICED CAR OCCASIONALLY HESITANT LIKE NOT 'GETTING' INTO GEAR BUT NO STALLING. WIFE DRIVING CAR AND STALLS WHILE STOPPED AT A LIGHT. SIMPLY RESTARTS CAR WITH NO ISSUE.    FEBRUARY 2019: WIFE DRIVING CAR AND STALLS BUT WHEN RESTARTED, ALL LIGHTS IN DASH ARE ON AND CAR WILL ONLY MOVE FORWARD AT IDLE SPEED AND THROTTLE COMPLETELY NOT RESPONSIVE (E.G., CAN PRESS GAS PEDAL TO FLOOR WITH NO ACCELERATION).     REGAL ACURA (2615 LAKELAND HILLS BLVD BLDG 2, LAKELAND, FL 33805, (863) 262-4238)) VISIT 1 (MARCH 2019): MATTHEW IN SERVICE. REGAL SERVICE DOES FULL CHECK AND REPORTS 'NOTHING WRONG.'    MARCH 2019: VEHICLE CONTINUES WITH HESITANCY AND STALLS.    REGAL ACURA VISIT 2 (MARCH 2019): BRING BACK TO MATTHEW AND THEY REPEAT CHECK AND FINDING NOTHING WRONG. I INSIST ON FUEL LINE FLUSH WHICH I PAY FOR.    APRIL 2019: VEHICLE CONTINUES WITH HESITANCY AND STALLS. I CALL MATTHEW IN REGAL ACURA SERVICE AND LET HIM KNOW THAT THERE IS A RECALL (P3W MDX) ON THIS ISSUE. REGAL ACURA PERFORMS SOFTWARE UPDATE. VEHICLE CONTINUES TO EXHIBIT HESITANCY WHILE DRIVING.    APRIL 2019:  I RECEIVE LETTER FROM ACURA AUTOMOBILE DIVISION OUTLINING THE RECALL:  1.SAFETY CONSEQUENCE PER RECALL: 'REDUCED FUEL FLOW TO THE ENGINE COMBINED WITH VEHICLE OPERATION IN HIGH TEMPERATURE CONDITIONS CAN RESTRICT VEHICLE ACCELERATION AND/OR CAUSE AN ENGINE STALL, WHICH INCREASES RISK OF CRASH.'  2.WHAT WILL ACURA DO? 'THE DEALER WILL UPDATE THE SOFTWARE FOR THE ENGINE CONTROL UNIT'. IF THE DIAGNOSTIC SCAN CONFIRMS A PREVIOUS OCCURRENCE OF ENGINE STALLING, THE FUEL PUMP WILL BE REPLACED FOR FREE.'    I HAVE HAD MULTIPLE CALLS WITH REGAL ACURA AND ACURA NATIONAL AND THEY WILL NOT REPLACE FUEL PUMP NOR WILL THEY LET ME PURCHASE A NEW FUEL PUMP BECAUSE THERE ARE NONE AVAILABLE DUE TO THE RECALL!!! I FEEL THIS CAR IS UNSAFE TO DRIVE WITH CURRENT FUEL PUMP AS OUTLINED IN THE ATTACHED RECALL LETTER.",
        "vin": "5FRYD4H4XGB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205997,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT STATED THAT THE DRIVER'S SEAT MOVED BACK AND FORTH ON ITS OWN. THE SEAT EVEN  CHANGED HEIGHT LEVELS WHILE THE CONTACT WAS DRIVING AND THE ALL WHEEL DRIVE WARNING INDICATOR ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO CURRY ACURA SCARSDALE (685 CENTRAL PARK AVE, SCARSDALE, NY 10583, (914) 472-6800) TO BE REPAIRED PER NHTSA CAMPAIGN NUMBERS: 19V256000 (EXTERIOR LIGHTING) AND 19V060000 (FUEL SYSTEM, OTHER). THE DEALER DID NOT DIAGNOSE OR REPAIR THE DRIVER'S SEAT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND NO ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 169,000.",
        "vin": "5FRYD4H26GB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203300,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL DASH DISPLAY WARNING LIGHTS WILL COME ON SPORADICALLY WHILE STANDING OR IN MOTION, LAST FROM A FEW HOURS TO A FEW DAYS OR SO, WHICH CAUSES VEHICLE SPEED TO DECREASE AND CERTAIN FEATURES TO NOT WORK.  DEALER SERVICE UNABLE TO RESOLVE PROBLEM, BUT WILL CLEAR ERROR CODES IN COMPUTER TO SHUT OFF WARNING LIGHTS.",
        "vin": "5FRYD4H92GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197304,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMITION PROBLEM ( ELECTRICAL )",
        "vin": "5FRYD4H22GB"
    },
    {
        "components": "WHEELS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197332,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARE TIRE ,AS MOUNTED IN REAR UNDER VEHICLE, IS SHOWING EXCESSIVE WEAR ON SIDE WALL  THE WEAR MARKS AS RUBBING THROUGH THE SIDEWALL WHICH IS THE WEAKEST PART ON THE TIRE AND I AM AFRAID TO USE IT. THE TIRE HAS NEVER BEEN USED. I HAVE CHECKED THE PRESSURE 3 TIMES SINCE I PURCHASED THE VEHICLE NEW AND THERE ARE THREE WEAR MARKS FROM THE STORAGE AREA WHERE THE TIRE IS KEPT. ALSO WHEN I PURCHASED THE VEHICLE THE SALESMAN MADE A BIG DEAL ABOUT THE REARVIEW MIRRORS AUTOMATICALLY AIMING DOWN AS THE CAR IS PUT IN REVERSE. THIS SAFETY FEATURE ALLOWS THE DRIVER TO SEE WHAT IS ON THE GROUND NEAR THE REAR TIRES WHEN BACKING UP.AFTER APPROXIMATELY ONE YEAR THE REARVIEW MIRRORS NO LONGER AIMED DOWN. THE DEALER NOW SAYS THAT IS VEHICLE NEVER DID THIS AND I HAVE ASKED ABOUT IT AT 3 DIFFERENT SERVICE APPOINTMENTS. ALSO ABOUT THE SPARE TIRE WEAR , THE DEALER SAID \"DON'T WORRY ABOUT IT\", AFTER I COMPLAINED ABOUT IT. ORDI CASEMENT # 11194881   NO ACCIDENT OR INJURY HAS OCCURRED BUT THE COMPLAINT IS PROACTIVE PREVENTION SINCE THE POTENTIAL FOR AN ACCIDENT OR INJURY IS POSSIBLE.. ALSO THE REARVIEW MIRROR PROBLEM HAS BEEN AROUND SINCE 2010 BASED ON READING ACURA BLOGS POSTED BY OWNERS.",
        "vin": "5FRYD4H46GB"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197265,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE 19-019 AND 19-011 RECALL SOFTWARE UPDATE ON 04/13/19 WE STARTED  EXPERIENCING THE VEHICLE DISPLAYING AND MOTIONING STEERING WHEEL LANE DEPARTURE WHEN THE LANE ASSIST IS NOT TURNED ON. THIS ISSUE HAPPENS WHEN THE VEHICLE IS IN MOTION CROSSING TO ANOTHER LANE ON CITY STREETS. WE HAVE NOT DROVE THE VEHICLE ON THE HIGHWAY AND ARE AFRAID THE STEER ASSIST WILL JERK THE VEHICLE AT HIGH SPEEDS. WE DID NOT EXPERIENCE THESE ISSUE UNTIL AFTER THE RECALL SOFTWARE UPDATE.",
        "vin": "5FRYD4H49GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196665,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE SLID WHEN THE BRAKE PEDAL WAS DEPRESSED. PRIOR TO THE FAILURE, THE VEHICLE LURCHED FORWARD. THE CONTACT HAD  TO APPLY MORE PRESSURE THAN USUAL TO THE BRAKE PEDAL TO STOP THE VEHICLE. IN ADDITION, THE BRAKE INDICATOR WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO TOYOTA EXPRESSWAY (700 MORRISSEY BLVD, BOSTON, MA 02122, (855) 814-9680) WHERE IT WAS DIAGNOSED THAT NEW BRAKES NEEDED TO BE INSTALLED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 45,716.",
        "vin": "5FRYD4H47GB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196079,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SLOWING DOWN AT A YIELD OR A RIGHT TURN ON A GREEN LIGHT TO ABOUT 5-10 MPH AND THEN WHEN PUSHING ON THE GAS PEDAL THERE IS NO ACCELERATION. THE CAR FEELS LIKE IT LOSES POWER AND THEN AFTER A SECOND OR TWO, THE CAR WILL JERK AND ACCELERATE VERY QUICKLY WHILE REVING THE RPM VERY HIGH. THIS HAS HAPPENED ON NUMEROUS OCCASIONS AND IS EXTREMELY DANGEROUS WHEN MAKING A RIGHT TURN. THERE HAVE BEEN TIMES WHERE I MAKE THE TURN AND THE CAR DOES NOT ACCELERATE AND THEN THERE ARE CARS BEHIND ME THAT MUST SWERVE TO AVOID ME.",
        "vin": "5FRYD4H90GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "06/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195949,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 10, 2018 - 4 HOURS INTO 5.5 HOUR TRIP, TRAVELING ON HWY 98, SOUTH OF TALLAHASSEE, FL, VEHICLE LOST ACCELERATION, SERIES OF WARNING LIGHTS STARTED FLASHING.  LIMPED OVER ONTO SHOULDER, TURNED VEHICLE OFF, CALLED ROADSIDE ASSISTANCE.  WHEN TOW TRUCK ARRIVED AN HOUR LATER, STARTED VEHICLE AND IT RAN NORMALLY....DROVE VEHICLE TO PROCTOR ACURA, FOLLOWING TOW TRUCK.  DEALERSHIP AND FACTORY PERSONNEL UNABLE TO DETERMINE PROBLEM.    DECEMBER 4, 2018 - 1 HOUR INTO 3 HOUR TRIP, WIFE TRAVELING ALONE ON INTERSTATE 10E, MOBILE, AL.  WHILE ON BRIDGE ACROSS MOBILE BAY, VEHICLE LOST ACCELERATION.  AS SHE WAS COASTING ONTO NARROW SHOULDER, FRANTICALLY PUMPING ACCELERATOR, VEHICLE RE-ENGAGED AND TRIP WAS COMPLETED WITH NO FURTHER ISSUE.  UNSURE IF WARNING LIGHTS CAME ON.    MARCH 8, 2019 - 3.5 HOURS INTO 5 HOUR TRIP, TRAVELING ON HWY 49N, BETWEEN HATTIESBURG AND COLLINS, MS.  VARIOUS WARNING LIGHTS CAME ON, EMERGENCY FLASHERS CAME ON BY ITSELF, VEHICLE NEVER LOST ACCELERATION.  PULLED OVER ONTO SHOULDER, LEFT ENGINE RUNNING, AND THEN DROVE APPX 5 MILES TO A SONIC DRIVE-IN.  TURNED VEHICLE OFF, LET IT SIT FOR A FEW MINUTES, CALLED ACURA CUSTOMER SERVICE AND WAS ASSIGNED A CASE #.  RESTARTED ENGINE, EMERGENCY FLASHERS NO LONGER ON, OTHER WARNING LIGHTS STILL FLASHING AND DROVE TO DESTINATION.  STARTED TRIP BACK HOME THE NEXT DAY, WARNING LIGHTS REMAINED ON UNTIL A THIRD OF THE WAY, THEN THOSE LIGHTS WENT OFF.  TOOK VEHICLE TO TIM SMITH ACURA, FT. WALTON BEACH, FL.  MET WITH DEALERSHIP SERVICE MANAGER, WHO EXPLAINED DIAGNOSIS AND REPAIRS MADE, BUT WOULD PROVIDE NO ASSURANCE WHATSOEVER PROBLEMS WOULD NOT REOCCUR.  ALSO MENTIONED HE JUST RECEIVED AN EMAIL FROM FACTORY THAT A POSSIBLE FIX WAS AT HAND BUT WOULD BE A FEW WEEKS AWAY.    NOTES:    * PROBLEMS OCCUR ONLY DURING A ROAD TRIP  * VEHICLE FIXES ITSELF EVERY TIME  * VEHICLE IS UNSAFE & UNRELIABLE  * EMAILED AM HONDA, NO REPLY",
        "vin": "5FRYD4H67GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "01/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195619,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS JERKS AND SLIPS. THESE PROBLEMS WERE ADDRESSED TO DEALERSHIP 4 TIMES AFTER PURCHASE. FIRST TWO VISITS THEY CHANGED TRANSMISSION SOFTWARE. EACH TIME TRANSMISSION WORKED WORSE THEN BEFORE UPDATE. ON 3 AND 4TH VISIT ANSWER WAS - \"THIS IS ACURA'S DESIGN\". ON JAN 21 CURRENT YEAR WHILE TRYING TO START FROM INTERSECTION TURNING TO THE RIGHT TRANSMISSION LOST ANY TRACTION/TORGUE FOR 1-2 SECONDS AFTER START MOVING. ENGINE RPM WENT UP TO 6-7 RPM WITHOUT ANY TRACTION TO THE WHEELS. THIS ALMOST LED TO THE ACCIDENT BUT TRUCK DRIVER MOVING STRAIGHT WAS ABLE TO BREAK IN AND CHANGE HIS TRAJECTORY. ON JAN 23D IT HAPPENED AGAIN ON STOP SIGN WHEN CAR REFUSED TO START FOR FEW SECONDS WHILE ENGINE RPM WAS IN ALMOST RED ZONE. BOTH HAPPENED ON COUNTRY ROAD. THESE WERE THE COLDEST WINTER DAYS (LESS THAN -20 F) AND TRANSMISSION ACTED WORSE. ALL OTHER TIME IT \"JERKS\" AND \"SLIPS\" INTERMITTENTLY DURING DRIVING WITHOUT CRUCIAL CONSEQUENCES SO FAR. ATTACHED IS SERVICE REPORT FROM 2D VISIT TO THE SERVICE WITHIN FIRST MONTH OF OWNERSHIP.",
        "vin": "5FRYD4H4XGB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/10/2019",
        "dateOfIncident": "04/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195368,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. WHILE DRIVING APPROXIMATELY 15 MPH AND MAKING A RIGHT TURN, THE BRAKE PEDAL FAILED TO RESPOND AND THE CONTACT CRASHED INTO A PARKED VEHICLE. THE FRONT PASSENGER SIDE AIR BAG DEPLOYED. THE DRIVER WAS SHAKEN UP BY THE INCIDENT, BUT WAS NOT INJURED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED BY THE INSURANCE COMPANY TO RALLYE ACURA (1750 NORTHERN BLVD, ROSLYN, NY 11576, (516) 625-7070); HOWEVER, THE DEALER REFUSED TO INSPECT AND DIAGNOSE THE CAUSE OF THE BRAKE FAILURE. THE DEALER STATED THAT DUE TO THE AIR BAG DEPLOYMENT, THE COMPUTER SYSTEM WAS NOT AVAILABLE TO BE ACCESSED TO PROVIDE A TECHNICAL ANALYSIS. THE INSURANCE COMPANY WAS TO REPAIR THE COLLISION DAMAGES. THE MANUFACTURER HAD NOT ISSUED ANY BRAKE SYSTEM RECALLS FOR THIS YEAR, MAKE, AND MODEL VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE CRASH. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194846,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE SUV AFTER THE SECOND GEAR KICKS IN THE TRANSMISSION HAS A JOLT AND IT FEELS LIKE A LAG IN THE SHIFT BUT THEN PULLS VERY HARD. THIS SHIFT PULL HAPPENS WHEN YOU ARE GOING 15-20 MPH.  ENGINE TIMING BELT HAS A LOUD CHIRPING NOISE.",
        "vin": "5FRYD3H47GB"
    },
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194881,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. THE CONTACT STATED THAT SIDEWALLS OF THE SPARE TIRE, WHICH WAS STORED UNDERNEATH THE VEHICLE, WAS WEARING THROUGH AT THREE DIFFERENT LOCATIONS. THE TIRE WAS TAKEN TO MCDANIELS ACURA OF CHARLESTON (2283 SAVANNAH HWY, CHARLESTON, SC 29414, (843) 766-1299) AND THE CONTACT WAS INFORMED NOT TO WORRY. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 20,000.",
        "vin": "5FRYD4H46GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193930,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR 2016 ACURA MDX NEW, BACK IN 2016.  STARTING IN 2018, WE BEGAN EXPERIENCING ISSUES WITH THE WAY THE VEHICLE CHANGED GEARS.  WHEN WE ATTEMPTED TO ACCELERATE, IT WOULD NOT.  THE TACHOMETER WOULD REV UP, AND THEN THE GEAR WOULD VIOLENTLY ENGAGE.  WE TOOK IT IN MULTIPLE TIMES TO THE DEALERSHIP AND WERE ADVISED THAT THEY COULDN'T FIND ANYTHING WRONG.      ON 1/8/19, WHILE MY WIFE WAS OUT OF TOWN, WE EXPERIENCED A \"CATASTROPHIC FAILURE\" OF THE TRANSMISSION, LITERALLY POUR OUT TRANSMISSION FLUID AND OTHER MECHANICAL PARTS OF THE TRANSMISSION AND LEAVING MY WIFE STRANDED OUT OF TOWN.  WE WERE TOWED TO THE ACURA DEALERSHIP IN THE AREA, AND THE TRANSMISSION HAD TO BE COMPLETELY REPLACED.      WE GOT THE VEHICLE BACK ABOUT A WEEK LATER ONLY TO DISCOVER THAT THE SAME SYMPTOMS THAT EVENTUALLY THAT LED TO THE CATASTROPHIC FAILURE ARE STILL ON GOING.  I TOOK THE VEHICLE IN TO THE LOCAL ACURA DEALERSHIP AND MET WITH THE SERVICE MANAGER WHO ADVISED ME THAT THIS IS A KNOWN ISSUE WITH THE 9 SPEED TRANSMISSION, AND PRECISELY WHY ACURA REPLACED THIS TRANSMISSION WITH A NEW 10 SPEED TRANSMISSION IN THE LATER MODELS.  THE SERVICE MANAGER ADDED THAT SINCE THERE WAS NO FIX, THERE WASN'T ANYTHING THEY COULD DO FOR ME AND REFERRED ME TO THE \"CUSTOMER SERVICE\" CORPORATE LINE.    FOR WEEKS I WORKED WITH A CASE MANAGER TO REACH A REASONABLE RESOLUTION.  MY ASK WAS TO EITHER 1) FIX THE KNOWN DEFECT IN MY TRANSMISSION, 2) EXTEND THE WARRANTY TO COVER THE EVENTUAL FAILURE OF THE TRANSMISSION, AGAIN, OR 3) BUY BACK THE VEHICLE.    THEY CLOSED MY CASE YESTERDAY AND ADVISED ME THAT THERE'S NOTHING THEY CAN DO FOR ME DESPITE THIS AGAIN, BEING A KNOWN ISSUE.  MEANWHILE, I'M STUCK WITH A LEMON.  I DON'T HAVE FAITH IN THIS VEHICLE AND CERTAINLY DON'T FEEL SAFE WITH MY WIFE AND CHILDREN TRAVELING IN IT.  ITS A MATTER OF TIME BEFORE IT BREAKS DOWN AGAIN, LEAVING US STRANDED.  *JS",
        "vin": "5FRYD3H28GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187377,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ACCELERATED SPEED ON THE INTERSTATE THE CAR STALLS AND RPMS GO UP.  THE LAST TIME IT HAPPENED THE ENGINE LIGHT CAME ON.  I PULLED OVER AND TURNED IT OFF FOR A FEW MINUTES.  WHEN I TURNED IT BACK ON THE LIGHT WAS OFF AND THE RPMS WERE NORMAL. I TOOK IT TO THE DEALERSHIP AND THEY FOUND NOTHING WRONG. THIS HAS HAPPENED AT LEAST 6 TIMES.",
        "vin": "5FRYD4H48GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186341,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ELECTRICAL ACTIVATED WHEN START BUTTON WAS PUSHED BUT IT WASN'T CLEAR IF ENGINE WAS RUNNING.  CAR WOULD NOT \"TURN OFF\" OR LOCK.  MANY ERROR MESSAGES CAME ACROSS DASH AND CAR WAS NOT PROPERLY RECOGNIZING FOBS.  AN ACURA SERVICE CENTER WAS CALLED AND WE WERE TOLD OUR ONLY OPTION WAS TO DISCONNECT BATTERY LEADS OR LET THE CAR RUN UNTIL THE BATTERY DIED.  MANY HOURS LATER THE BATTERY DIED.  WHEN THE ACURA SERVICE TRUCK CAME TO GET US THEY COULDN'T EVEN GET THE CAR INTO NEUTRAL AFTER CHARGING THE BATTERY AND WHEEL TRUCK HAD TO BE CALLED.  THE DEALERSHIP HAD THE CAR FOR WEEKS AND WAS NOT ABLE TO DETERMINE THE PAUSE.  WE HAVE MULTIPLE VIDEOS OF THE INCIDENT.  NOTE THAT THE CAR WAS NOT IN ACCESSORY MODE AND THE BEHAVIOR IS INCONSISTENT WITH ACCESSORY MODE.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184987,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION, FIRST BRAKELIGHT HAD WARNING THEN WARNING ABOUT TRAILER STABILITY ASSIST. WHEN I WENT IN REVERSE, THE WHOLE DASHBOARD INCLUDING THE NAVIGATION SCREEN WENT BLACK AND THE CAR FELT LIKE THE ENGINE STOPPED. THIS HAPPENED A FEW TIMES. I DON'T THINK THE ENGINE ACTUALLY STOPPED THOUGH BECAUSE I DID NOT HAVE TO RESTART THE CAR.  THE BRAKE LIGHT ERROR MESSAGE HAS OCCURRED DRIVING FORWARD AS WELL, BUT NOT ACCOMPANIED BY THE BLACKOUT OF THE DASH AND NAV PANEL.  ALL OF THIS HAPPENED WHILE IN MOTION.      THE WORST OF THIS HAPPENED ON 07/30/2018 BUT VARIATIONS OF THIS OCCURRED PRIOR TO THAT.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "03/04/2019",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184352,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 ACURA MDX. WHILE DRIVING 40 MPH ON THE HIGHWAY, THE CONTACT SMELLED SMOKE WHEN THE HEATER WAS ACTIVATED. THE CONTACT EXITED THE HIGHWAY, PARKED, AND EXITED THE VEHICLE. SMOKE AND FLAMES ENGULFED THE VEHICLE FROM UNDERNEATH THE FRONT PASSENGER SIDE. THE POLICE ARRIVED SHORTLY AND CALLED THE FIRE DEPARTMENT. THE VEHICLE WAS DESTROYED BY THE TIME THE FIRE DEPARTMENT ARRIVED. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED. THE CONTACT'S INSURANCE COMPANY CONTACTED THE MANUFACTURER TO SCHEDULE AN APPOINTMENT TO DETERMINE THE CAUSE OF THE FIRE. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 89,000.",
        "vin": "5FRYD4H9XGB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183849,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE A NUMBER OF INCIDENTS PRIOR TO 16 FEBRUARY 2018 WHERE THE CARE JERKED WHILE COMING TO A STOP AND HESITATED ON ACCELERATION POSSIBLY RELATED TO TRANSMISSION MISSHIFTING.  WE TOOK OUR CAR INTO AN ACURA DEALER ON 16 FEBRUARY 2018 BUT THE ISSUE WAS NOT RESOLVED.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2019",
        "dateOfIncident": "02/24/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183655,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND MY SUNROOF EXPLODED.  IT MADE A LOUD BANG AND I COULD HEAR GLASS FLYING OFF AND MOVING AROUND IN THE SUNROOF COVER.",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183331,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE JERKED WHILE STOPPING (IN MOTION), VEHICLE WOULD HESITATE ON ACCELERATION (IN MOTION OR FROM A STOP), THIS WAS FOLLOWED BY FLASHING ERROR LIGHTS.  THE VEHICLE WAS INOPERABLE AND HAD TO BE TOWED IN BY ACURA SERVICE.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CRUISING AT ABOUT 70MPH ON THE INTERSTATE, I ATTEMPTED TO ACCELERATE AND THE VEHICLE RPM WOULD DROP TO ABOUT 1000 RPM AND NOT ALLOW ME TO CONTROL THE ACCELERATION. REGARDLESS OF VARIOUS ATTEMPTS TO ACCELERATE THE VEHICLE CONTINUE TO LOSE MPH.  AFTER 5-10 SECONDS, I WAS FINALLY ABLE TO REGAIN CONTROL OF THE VEHICLE.  THIS HAS HAPPEN ON ABOUT 6 OCCASIONS SINCE I PURCHASED THE VEHICLE IN 2015.  I'VE ATTEMPTED TO HAVE THIS ISSUE RESOLVED AT THE DEALERSHIP SERVICE. ON EACH OCCASION THEY STATED A SOFTWARE FIX WOULD CORRECT THE PROBLEM BUT THIS CONTINUES. I'VE ALSO HAD THE ISSUE OCCUR WHILE DRIVING ABOUT 40MPH ON THE CITY STREET.  I WAS TOLD BY ONE DEALERSHIP (THE ABOVE INCIDENT OCCUR WHILE MORE THAN 500 MILES FROM HOME)THAT THIS APPEARS TO BE A TRANSMISSION ISSUE AND THAT IT WOULD NEED TO BE REPLACED  TO RESOLVE AND WOULD BE COVERED BY WARRANTY, THIS DEALERSHIP PROVIDED ME A COMPUTER CODE FROM MY VEHICLE.  MY CURRENT HOME DEALERSHIP CONTINUES TO STATE IT IS ONLY A SOFTWARE ISSUE, DESPITE THE FACT THAT I HAD BROUGHT MY VEHICLE IN FOR MAINTENANCE 2-DAYS PRIOR TO MY TRIP AND A SOFTWARE UPDATE WAS PERFORMED.  THE FIRST TIME THE OCCURRED MY VEHICLE HAD LESS THAN 20,000 MILES, THE VEHICLE CURRENTLY AS ABOUT 77,000 MILES",
        "vin": "5FRYD4H42GB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174479,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. WHEN THE VEHICLE ACCELERATED AFTER SLOWING DOWN, THE TRANSMISSION SLIPPED AND THE VEHICLE STALLED SEVERAL TIMES WHEN MAKING TURNS. IN ADDITION, THE VEHICLE MADE AN ABNORMAL CHIRPING SOUND FROM THE ENGINE COMPARTMENT, WHICH DISTRACTED THE DRIVER. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE DEALER HAD NOT BEEN NOTIFIED; HOWEVER, THE CONTACT PLANNED TO TAKE THE VEHICLE TO FINLADY ACURA (315 AUTO MALL DR, HENDERSON, NV 89014) FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 34,000.",
        "vin": "5FRYD3H47GB"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171145,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SHIFTED TO NEUTRAL WHILE DRIVING AT 70 MPH AND THE DASH STARTED SHOWING TRANSMISSION AND FUEL SYSTEM ERRORS. THE VEHICLE WOULD NOT SHIFT BACK TO DRIVE MODE. AFTER PULLING OVER TO THE SHOULDER AND TURNING THE VEHICLE OFF AND ON THE VEHICLE COULD NOT BE PUT IN DRIVE. AFTER ABOUT 30 MINUTES OF REPEATEDLY TURNING OFF AND ON THE VEHICLE SHIFTED TO DRIVE AND WAS DRIVE ABLE. THIS COULD HAVE LEAD TO AN ACCIDENT IF THERE WERE VEHICLES BEHIND ME.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165850,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY BOUGH THE CAR AND I AM NOW REGRETTING IT BECAUSE THE 9 SPEED TRANSMISSION IS VERY SLUGGISH AND DOESN'T PROVIDE POWER WHEN NEEDED. IN THE MORNING WHEN I START THE CAR THE CAR JUST LAGS THE POWER UNTIL I PRESS HARD ON THE GAS PEDAL. WE TOOK THIS ON A ROAD TRIP TO CALIFORNIA FROM UTAH AND AT TIMES I FEEL LIKE I DON'T HAVE AMPLE POWER TO PASS OTHER DRIVERS AND IT TAKES A FEW SECONDS TO THINK BEFORE IT DOES ANYTHING. I HAVE AN APPT SCHEDULED WITH ACURA TOMORROW TO SEE WHAT CAN BE DONE TO FIX THIS OTHERWISE I AM TAKING THIS SUV BACK TO THE DEALER FOR ANOTHER CAR. I AM VERY DISAPPOINTED WITH ACURA FOR MAKING THIS KIND OF A TRANSMISSION AND I WISH I HAVE KEPT MY BMW.",
        "vin": "5FRYD3H4XGB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/30/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164126,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF A RESTAURANT  LOT PARKING SPACE ON A WET RAINY NIGHT, APPLIED BRAKES REPEATEDLY  AND CAR WOULD NOT STOP RESULTING IN HITTING A PARKED CAR IN THE LOT. IMMEDIATELY NOTIFIED MY  INSURANCE CO. SAME TYPE OF PROBLEM HAPPENED A YEAR AND HALF AGO. HAVE NOTIFIED ACURA TO CORRECT PROBLEM. INTEND TO TRADE CAR  BECAUSE OF CONCERN..",
        "vin": "5FRYD3H49GB"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "06/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161322,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA IS REFUSING TO ADDRESS A SERIOUS PROBLEM WITH THE ENGINE AND POWER TRAIN WITH THE VEHICLE, THIS MAY HAVE ALREADY CAUSED ACCIDENTS ON OTHER CARS IN OTHER STATES. PLEASE SEE THE HISTORICAL DATA WHICH GIVES A COMPLETE AUDIT OF THE ISSUES I HAVE HAD.     9/22/18 11 DAYS- VEHICLE TAKEN TO THE DEALER AND DROPPED FOR SERVICE, PUNCH LIST OF ISSUES SINCE PURCHASE THAT NEEDED ADDRESSED. ALIGNMENT REPORT IS SIGNED OFF ON 9/24/18, BATTERY CHECK 10/1/18, SERVICE WAS STARTED ON 9/29/18, CAR SAT FOR A WEEK WITH NO SERVICE ATTEMPT MADE. OIL STAINS ON ROOF LINER WERE LEFT THERE AND WAS TOLD THEY WOULD NOT CLEAN THEM OFF (LATER PROVEN TO BE MECHANICS GREASE BY MERRILLVILLE) AND SPIDER WAS MY PROBLEM NOT THERES PER 'ROB' IN SERVICE. ISSUES THE CAR WAS TAKEN IN FOR. ALL OF THE BELOW SERVICE WAS COMLETED IN 5 MILES ACCORDING TO ODOMETER READINGS.       ON 10/12/18 I TOOK THE VEHICLE TO ACURA OF MERRILLVILLE PER 'ANTHONY' FROM ACURA CLIENT CARE TO HAVE IT CHECKED. I DROVE IT WITH THE TECH AND THE TECH WAS ABLE TO VALIDATE A LOT OF THE ISSUES RIGHT AWAY. IT WAS RETURNED TO ME ON 11/2/18 22 DAYS     ON 11/24/18 I RETURNED THE VEHICLE TO ACURA OF MERRILLVILLE DUE TO THE TRANSMISSION ISSUE RETURNING, ALSO ADDRESSED A COUPLE OF ISSUES. CAR RETURNED ON 11/28/18 4 DAYS     VEHICLE LOSES POWER WHEN SHIFTING TO ACCELERATE, OFTEN HAVE TO DOWNSHIFT USING PADDLE SHIFTERS TO MAKE POWER OR CAR ACTS LIKE ITS GOING TO STALL.    BRAKES DO NOT FUNCTION UNILATERALLY, HIT THE BRAKES HEAVY WHILE IN TRAFFIC AND THE BACK WILL BEGIN TO COME AROUND AS THOUGH ONE OF THEM DOES NOT GRAB.    ENGINE LOSES POWER WHEN IN TRAFFIC IT STRUGGLES TO ACCELERATE WHICH COULD CAUSE A CRASH IF NEEDING POWER TO ACCELERATE  ONTO A EXPRESSWAY FROM AN ENTRANCE RAMP, OR ANYWHERE THAT REQUIRES POWER TO MOVE THE CAR.",
        "vin": "5FRYD4H40GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/05/2018",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156088,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 9 SPEED TRANSMISSION ON THIS CAR IS TERRIBLE.  HARD SHIFTING, LUNGING FORWARD, THE CAR ACCELERATES ON IT'S OWN LIKE IT DOESN'T KNOW WHICH GEAR IT SHOULD BE IN.  WHEN ACCELERATING, THE CAR HESITATES AND  FEELS LIKE IT LOSES POWER.  THIS IS A VERY DANGEROUS VEHICLE.  TOOK IT TO THE DEALER SEVERAL TIMES AND THEY SAY THIS IS THE WAY THE CAR WAS DESIGNED.  IT WAS DONE TO MEET FUEL EFFICIENCY STANDARDS.  ACURA IS SACRIFICING SAFETY AND COMFORT IN ORDER TO MEET THE FUEL STANDARDS.",
        "vin": "5FRYD4H28GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141237,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION SHIFT VERY HARD AND WHEN I RELEASE THE GAS PEDAL THE CAR STAR TO BRAKE AND ACCELERATE BY HIM SELF AND IT'S DANGER AND ANNOYING",
        "vin": "5FRYD3H20GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2018",
        "dateOfIncident": "08/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119430,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LETTERS ON THE SHIFTING CONTROLS ARE WEARING OFF WITH NORMAL USE CREATING AN UNSAFE CONDITION AS IT IS BECOMING UNCLEAR WHICH SHIFT BUTTONS PUT THE VEHICLE IN PARK.  THIS HAS OCCURRED ON BOTH MY 2016 HONDA VEHICLES.  HONDA HAS ACKNOWLEDGED THIS ISSUE BUT ONLY OFFERS TO PAY ONE HALF OF THE COST OF CORRECTING THIS DANGEROUS ISSUE.",
        "vin": "5FRYD3H20GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113899,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AROUND 75 MPH ON THE INTERSTATE I WENT TO SWITCH LANES AND WHEN PRESSING THE ACCELERATOR NOTHING HAPPENED AND ACCELERATION WAS NOT POSSIBLE.  ALL WARNING LIGHTS CAME ON, INCLUDING ALL WHEEL DRIVE SYSTEM PROBLEM, EMISSION SYSTEM PROBLEM, ALL WHEEL DRIVE SYSTEM PROBLEM, TRANSMISSION SYSTEM PROBLEM. CHECK ENGINE AND SH-AWD.  THE POWER STEERING AND BRAKES STILL WORKED AND WAS EXTREMELY LUCKY TO GET THE CAR TO THE SHOULDER WITHOUT GETTING INJURED OR KILLED.  HAD CAR TOWED TO CHATTANOOGA ACURA DEALER.  CAR WAS OPERATING NORMALLY WHEN THEY RECEIVED IT.  ACURA TECH SUPPORT ADVISED DEALER TO REPLACE TRANSMISSION AND TRANSMISSION CONTROL MODULE (TCM).  ALSO WAS TOLD ACURA IS WORKING ON A SOFTWARE UPDATE FOR THE TCM BUT IT IS NOT AVAILABLE YET BUT I HAVE LITTLE CONFIDENCE IN THE FIX AND LITTLE CONFIDENCE THAT THIS WON'T REOCCUR.  STRONGLY CONSIDERING REPLACING THE CAR",
        "vin": "5FRYD4H99GB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/19/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112342,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "9 SPEED TRANSMISSION LURCHES FORWARD WHEN TRYING TO STOP - SENDING THE CAR FORWARD WHILE TRYING TO BRAKE.  HAPPENS WHEN THE CAR SHOULD SHIFT BETWEEN GEARS 3-2 AND 1-2/2-1.  ACURA DEALERSHIP SAID IT'S THE FUEL SAVER ONCE, NORMAL THE SECOND TIME, AND UPDATED THE TCM/PCM ANOTHER.  THERE IS NO ONE ADDRESSING THIS WHEN IT COULD SEND MY CAR INTO ANOTHER CAR WHEN TRYING TO STOP.  THE LAST TIME I DROVE IT ON SUNDAY 7/15 I WAS SLOWING DOWN TO TURN INTO A SHOPPING CENTER, GOING AROUND 20MPH WHEN THE CAR JERKED FORWARD, SNAPPING MY NECK FORWARD 12\"-14\" THEN BACK AGAIN.  THE CAR IS AT THE DEALERSHIP NOW WITH THE SERVICE ADVISER SAYING THE LURCHING IS THE FUEL SAVER AND THAT ACURA WON'T PAY FOR A WARRANTIED ITEM UNLESS THE SERVICE LIGHT/CODES ARE THERE.",
        "vin": "5FRYD4H97GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "09/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102159,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATES FROM A STOP. USUALLY FIRST DRIVE OF THE DAY. INTERMITTENT BUT BECOMING MORE FREQUENT AND AT RANDOM TIMES. SOMETIMES, AFTER DRIVEN AND LEAVING A STOP SIGN/LIGHT OR ENTERING TRAFFIC. ACURA CLAIMS THEY HAVE NEVER DUPLICATED PROBLEM IN MY VEHICLE AND NO DTCS SET. OPERATES NORMAL. RECENTLY RETIRED DEALER SERVICE MANAGER TOLD ME IT HESITATED TWICE FOR HIM (NEVER PUT IT IN WRITING), ONCE WITH COMPUTER ATTACHED. ACURA TECH LINE WAS SENT DATA AND RESPONDS OPERATION NORMAL. ACURA DISTRICT PARTS AND SERVICE MANAGER STATES ORDINARY OPERATIONS OF ALL SYSTEMS INCLUDING TRANSMISSION. HE STATES TIME LAG BETWEEN THE TIME STARTED, SHIFTING TRANSMISSION INTO GEAR, SENSORS SENDING AND RECEIVING DATA AND VEHICLE RESPONDING. THIS IS A DRIVE BY WIRE SYSTEM THAT INVOLVES A COMPUTER AND SENSORS AND SOMETIMES THEY COMMUNICATE SLOWER IT APPEARS THERE IS A HESITATION. THIS IS A NORMAL PROCESS OF THE VEHICLE. WHEN I PRESS ACCELERATOR PEDAL, AFTER SHIFTING INTO DRIVE, VEHICLE DOES NOT MOVE, RPM DOES NOT CHANGE. SUDDENLY AND AGGRESSIVELY, THE VEHICLE LURCHES FORWARD, I THINK CORRESPONDING TO THE ACCELERATOR POSITION AT THE TIME, AND THE RPM SURGES. I THINK THE VEHICLE DRIVES AND OPERATES FINE AFTER IT IS MOVING. IT IS A SERIOUS SAFETY HAZARD THAT COULD CAUSE ME TO RUN INTO SOMEONE OR BE HIT BY SOMEONE. ACURA'S DENIAL OF THE PROBLEM DOES NOT MAKE IT GO AWAY. IF THE HESITATION WAS NORMAL, EVERY VEHICLE LIKE MINE WOULD HESITATE. IF IT WERE NORMAL, THEY WOULD BE ABLE TO DUPLICATE IT. IT IT WERE NORMAL, IT WOULD HESITATE EVERY TIME I DRIVE IT. IF THE HESITATION WAS NORMAL, IS IT NOT NORMAL WHEN IT DOESN'T HESITATE? HESITATION BEGAN WITHIN WEES OF PURCHASING  FROM THE DEALER. CURRENTLY HAVE 38000+ MILES. HAVE LITERALLY CHANGED THE WAY WE OPERATE THE VEHICLE ANTICIPATION IT WILL HESITATE. SEVERAL VIDEOS SHOWING RPM SURGE WITH ACCELERATOR FULLY DEPRESSED THAT ARE TOO LARGE TO UPLOAD.",
        "vin": "5FRYD4H46GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099060,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OR PARKED THE \"TRANSMISSION SYSTEM PROBLEM\" ILLUMINATED ON THE DASHBOARD. THE \"D\" LIGHT ALSO BEGAN FLASHING ON CONSOLE AND THEN CAR GOES INTO NEUTRAL BY ITSELF.  IN ADDITION ANOTHER WARNING LIGHT CAME ON THE DASHBOARD THAT SAID \"BLIND SPOT WARNING MALFUNCTION\" FOLLOWED BY 3RD MESSAGE THAT SAID \"TRANSMISSION SYSTEM PROBLEM\" AND D LIGHT DISAPPEARS FROM DASHBOARD . WHEN DRIVING, THE CAR CONTINUES AT SAME RATE SPEED THANKFULLY.  WHEN PARKED, CANNOT PUT VEHICLE IN PARK AND HAVE TO USE EMERGENCY BRAKE.  WHEN THIS HAPPENS THE CAR CANNOT BE LOCKED SINCE IT RECOGNIZES CAR IN DRIVE.  TAKING TO DEALERSHIP TOMORROW. I DON'T LIKE DRIVING THE CAR SINCE I'M CONCERNED IT WILL GO INTO NEUTRAL AS I'M DRIVING.  I BELIEVE THIS COULD BECOME A SIGNIFICANT SAFETY ISSUE FOR MYSELF AND OTHER DRIVERS AT RISK. ANY TIME A CAR DOES THIS WITHOUT EXPLANATION ON THE HIGHWAY WARRANTS AN INVESTIGATION.",
        "vin": "5FRYD4H4XGB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098086,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR OVERHEATED AND WAS LEAKING BLUE FLUID, STARTED SMOKING AND HAD A WEIRD CHIRPING NOISE COMING FROM THE ENGINE. THE CAR WAS PARKED AND WAS JUMPING ANOTHER CAR WITH A DEAD BATTERY.",
        "vin": "5FRYD3H41GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091742,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. WHILE DRIVING APPROXIMATELY 5 MPH AND ATTEMPTING TO DEPRESS THE BRAKE PEDAL, THE VEHICLE INADVERTENTLY ACCELERATED WITHOUT WARNING. THE CONTACT STATED THAT THE FAILURE RECURRED SEVERAL TIMES. THE CONTACT ALSO STATED THAT WHEN THE GEAR WAS SHIFTED BETWEEN THE FOURTH AND FIFTH GEARS, WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE DID NOT ACCELERATE FOR ABOUT TWO SECONDS. THE VEHICLE WAS TAKEN TO ACURA OF MODESTO (4325 MCHENRY AVE, MODESTO, CA 95356, (209) 527-7000) WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS PERFORMING AS DESIGNED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO THE DEALER. THE FAILURE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 300.",
        "vin": "5FRYD3H28GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089118,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. WHILE DRIVING 72 MPH WITH THE CRUISE CONTROL ACTIVATED, THE VEHICLE LURCHED TWICE AND ALL THE WARNING INDICATORS ILLUMINATED, DISPLAYING TRANSMISSION SYSTEM FAILURE, FUEL EMISSION FAILURE, AND LANE DEPARTURE FAILURE. THE VEHICLE STALLED AND WAS COASTED TO THE SIDE OF THE ROAD. THE CONTACT ATTEMPTED TO RESTART THE VEHICLE, BUT WAS UNSUCCESSFUL. THE VEHICLE WAS TOWED TO AN ACURA DEALER (ACURA OF JACKSON, 828 ADCOCK ST, RIDGELAND, MS 39157) WHERE IT WAS DETERMINED THAT THERE WAS A COMPUTER GLITCH. THE COMPUTER SYSTEM WAS RESET. THE DEALER STATED THAT THIS WAS A KNOWN FAILURE WITH ACURA AND NO PERMANENT REMEDY WAS UNAVAILABLE. THE DEALER ALSO STATED THAT THE FAILURE COULD RECUR IN 10 TO 10,000 MILES. THE CONTACT WAS CONCERNED THAT THE FAILURE WOULD RECUR AND TOOK THE VEHICLE TO DAVID MCDAVID ACURA OF AUSTIN (13553 RESEARCH BLVD, AUSTIN, TX 78750). THE CONTACT INFORMED THE DEALER THAT SHE FELT UNSAFE DRIVING THE VEHICLE AND WANTED TO TRADE IT IN FOR ANOTHER VEHICLE. THE MANUFACTURER WAS NOTIFIED AND ADVISED THE DEALER TO ATTEMPT TO DUPLICATE THE FAILURE. THE VEHICLE WAS CURRENTLY AT THE DEALER AWAITING A NEW DIAGNOSIS AND POSSIBLE REPAIRS. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "5FRYD3H67GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082599,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING AND SWITCHING LANES ON THE INTERSTATE AROUND 70MPH THE CAR REDUCED POWER AND THEN DOWNSHIFTED AND REVVED UP TO OVER 4K RPMS. THE CAR WOULD NOT ACCELERATE WITH FOOT ALL THE WAY INTO IT AND REDUCED SPEED TO 50MPH.   EMISSIONS SYSTEM ERROR, TRANSMISSION PROBLEM ERROR, SH AWD ERROR AND BLIND SPOT ASSIST ERROR WERE ALL ILLUMINATED.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073056,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DIFFERENT SETTINGS I HAVE EXPERIENCED A LAG OR HESITATION WHEN I PRESS THE ACCELERATOR.  THE HESITATION IS SUFFICIENT THAT IT MAKES IT DANGEROUS TO SHIFT LANES AT HIGHWAY SPEEDS AS WELL AS TO TURN LEFT AT A STOP SIGN ON A LOCAL STREET.  I HAVE DISENGAGED THE AUTO-IDLE FEATURE TO MINIMIZE THE ISSUE AT STOP SIGNS AND I AM NOW DRIVING IN SPORTS MODE 100% OF THE TIME BECAUSE THIS MINIMIZES THE HESITATION; HOWEVER, IT IS NECESSARY TO \"GUN\" THE ENGINE TO ENSURE THAT THE HESITATION DOES NOT RESULT IN A MAJOR ACCIDENT.  I HAVE DISCUSSED THE ISSUE WITH THE ACURA SERVICE DEPARTMENT EACH TIME I HAVE BROUGHT MY CAR IN FOR AN OIL CHANGE OVER THE PAST 1.5 YEARS, AND THEY DENY THAT THERE IS AN ISSUE WITH THE POWER TRAIN. I DO NOT ALLOW OTHER MEMBERS OF MY FAMILY TO DRIVE MY MDX AS I FEAR THEIR INEXPERIENCE WITH THE TRANSMISSION PROBLEM WILL RESULT IN A MAJOR CAR ACCIDENT.",
        "vin": "5FRYD4H99GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "02/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY THE \"TRANSMISSION SYSTEM PROBLEM\" ILLUMINATED ON THE DASH BOARD. THE \"D\" LIGHT ALSO BEGAN FLASHING. IN ADDITION ANOTHER WARNING LIGHT CAME ON THAT SAID \"BLIND SPOT WARNING MALFUNCTION\". THE CAR SLOWED DOWN. IT WOULD NOT GO FASTER THAN 15-20 MPH ON THE HIGHWAY WHILE THE RPM'S SURGED TO OVER 4,000 RPM. THE CAR HAD TO BE TOWED TO THE DEALERSHIP YESTERDAY. AS OF TODAY THEY STILL HAVE NOT BEEN ABLE TO IDENTIFY WHY THIS HAPPENED. I BELIEVE THIS IS A SIGNIFICANT SAFETY ISSUE THAT PUT MYSELF AND OTHER DRIVERS AT RISK. ANY TIME A CAR DOES THIS WITHOUT EXPLANATION ON THE HIGHWAY WARRANTS AN INVESTIGATION.",
        "vin": "5FRYD4H93GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072424,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR RPMS DO NOT KEEP UP WITH THE SPEED.  WHEN DECELERATING IN TRAFFIC RPMS REMAIN HIGH AND THE CAR SURGES FORWARD.  GOING DOWN HILLS WHEN TAKING FOOT OFF THE BRAKE THE CAR SURGES FORWARD.  WHEN SITTING AT A STOP SIGN AND STARTING AGAIN THE CAR WOULD SURGE FORWARD. THE ENGINE IS VERY ERRATIC AND THE SOFTWARE UPDATES DO NOT REMEDY THE SITUATION.  VERY SCARY DRIVING THE CAR.  COLD WEATHER MAKES THE SYMPTOMS WORSE.  NEED TO WARM UP THE CAR A MINIMUM OF FIVE MINUTES.  IT IS VERY SLUGGISH IN THE COLD AND THE SURGING IS MORE PROMINENT.  NOT GOOD IF YOU LIVE IN COLD CLIMATES.  I NEED TO DRIVE THROUGH A RESIDENTIAL AREA OF A CITY WITH CHILDREN CROSSING THE STREET.  I AM AFRAID IF THE CAR SURGES WHEN I BREAK THERE MAY BE AN ACCIDENT WITH A PEDESTRIAN OR I MAY REAR END THE CAR IN FRONT OF ME.  I HAVE ANOTHER APPOINTMENT WITH THE DEALER TO ADDRESS THE PROBLEM.  LOOKING TO TRADE IN THE VEHICLE WITH A DIFFERENT TRANSMISSION.  THIS VEHICLE SHOULD NEVER BE RESOLD!",
        "vin": "5FRYD4H48GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064367,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ALL WARNING AND HAZARD LIGHTS COM ON HAS HAPPENED 3 TIMES NOW IN DEALER SHOP FOR OVER A MONTH I DO NOT FELL SAFE IN CAR THE DEALER CAN NOT TELL ME WEATHER SAFE OR NOT AND DOES NOT SEEM TO BE ABLE TO FIX PROBLEM",
        "vin": "5FRYD4H40GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062225,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM:  ON JANUARY 06 2018 MILEAGE (49,930) WHILE DRIVING 60-68 MPH FOR APPROXIMATELY 20MINUTES BETWEEN INDIANAPOLIS AND MARTINSVILLE IN, I ATTEMPTED TO ACCELERATE, MOVE TO THE LEFT LAND AND PASS.  I PRESSED THE ACCELERATOR AND THAT WHEN THE PROBLEM OCCURRED:  1)THE CAR WOULDN'T ACCELERATE,   2)THE 'D' LIGHT BEGIN FLASHING  3)WOULD NOT SHIFT, EVEN USING PADDLES  4)TRANSMISSION 'MALFUNCTION' LIGHT  5)TACHOMETER WAS AT APPROXIMATELY 4500 RPM @50 MPH  6)EMISSIONS LIGHT STARTED FLASHING  7)YELLOW ENGINE ICON WAS ON,  8)BLIND SPOT NOT WORKING INDICATOR WAS ON.   I MADE IT TO A PARKING LOT, TURNED THE CAR OFF, WENT INTO A STORE FOR LESS THAN 10 MINUTES, AND RESTARTED THE CAR.  ITEMS 1-5 AND 8 WERE NO LONGER FLASHING, AND THE CAR DROVE AND SHIFTED NORMALLY.  I ARRIVED AT MY DESTINATION, TURNED THE CAR OFF FOR 5-7 HOURS, STARED IT, AND ITEMS 6 AND 7 ABOVE NO LONGER APPEARED ON THE DASHBOARD.    THIS WAS THE 3RD TIME THE CAR HAD 'MIS-SHIFTED' UNDER THOSE SAME DRIVING CONDITIONS (60-68 MPH FOR APPROXIMATELY 20MINUTES, BUT THE FIRST TIME I'D GOTTEN AND FLASHING TRANSMISSION INDICATOR AND THE REST AS STATED IN ITEMS #1-8 ABOVE.      I AM VERY CONCERNED ABOUT THESE TRANSMISSION/SOFTWARE PROBLEMS.  WHEN IT OCCURS IT TRULY DOES CREATE A SAFETY ISSUE AS THE CAR NO LONGER ACCELERATES AND ONLY FORWARD MOMENTUM IS MOVING THE CAR FORWARD.",
        "vin": "5FRYD4H47GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "01/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060847,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING DOWN THE HIGHWAY THE CAR PICKS UP A GUARDRAIL AND THINKS IT IS AN OBJECT. THE AUTOMATIC BRAKING SYSTEM TURNS ON AND THERE IS A GRINDING BRAKE THAT GETS APPLIED WHILE YOU ARE DOING 65 MPH ON THE HIGHWAY. IT'S REALLY UNSAFE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055687,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING STRAIGHT ON A RESIDENTIAL STREET AT AROUND 20-25 MPH WHEN ALL OF A SUDDEN I HEAR A LOUD SNAPPING SOUND.  I IMMEDIATELY LOST ALL CONTROL OF THE VEHICLE AND IT JERKED HARD TO THE RIGHT HITTING TWO PARKED VEHICLES.  UPON INSPECTION, IT APPEARS AS THOUGH THE REAR CONTROL ARM ON THE PASSENGER SIDE FRONT WHEEL SNAPPED, CAUSING ME TO LOSE CONTROL.",
        "vin": "5FRYD4H91GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054182,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ON THIS VEHICLE IS UNSAFE & THE CAR SURGES UNCONTROLLABLY DRIVING DOWNHILL.  MY WIFE & I CAN NO LONGER DRIVE THIS CAR & OUR LOCAL OAKLAND, CA ACURA DEALER HAS NOT CORRECTED THE PROBLEM - WE HAVE TAKEN IT IN FOR CORRECTION SEVERAL TIMES.  WE HAVE 3 KIDS SO WE CAN'T DRIVE AROUND IN AN UNSAFE CAR & DONT WANT SOMEONE ELSE DRIVING AN UNSAFE CAR.   ACURA RECENTLY ISSUED A WARRANTY EXTENSION ON THIS ISSUE -  THIS CAR IS LEASED & WE WANT TO TURN IT IN NOW.    PLEASE ASSIST.  [XXX] - [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "5FRYD3H28GB"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2017",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048856,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAILED A LETTER ABOUT A WARRANTY EXTENSION FOR MY ASSOCIATED VIN. I DEFINITELY HAVE EXPERIENCED ASSOCIATED ISSUES WITH MY MDX. AFTER CALLING THE ACURA DEALERSHIP ON 11/24/17, I WAS GIVEN AN APPOINTMENT FOR 11/28/17 AND I WAS TOLD THEY WOULD INSPECT MY CAR OVER 2 DAYS AND PROVIDE A LOANER CAR. MY EXPERIENCE WAS \"TO SAY THE LEAST\" THE INVERSE; EXTREMELY DISAPPOINTING. THE SERVICE TECHNICIAN TOOK MY CAR FOR A TEST DRIVE AND TOLD ME NOTHING WAS WRONG. IN ADDITION, THE SERVICE TEAM WAS EXTREMELY UNPROFESSIONAL AS ONCE AGAIN, THE CUSTOMER WAS WRONG. PLEASE ADVISE ABOUT THE NEXT STEPS FOR SERVICE. I AM EXTREMELY DISAPPOINTED WITH ACURA UNWILLINGNESS TO LISTEN TO THE CUSTOMER. I DID TAKE THE CAR FOR SERVICE ASSOCIATED WITH THIS ISSUE ABOUT A MONTH PRIOR.     OVERALL PROBLEM IS MANY TIMES I EXPERIENCE SHIFTING AND ACCELERATING HESITATION THAT IS JERKY. WHICH INDICATES A PROBLEM WITH THE TRANSMISSION: THIS IS WHAT THE WARRANTY EXTENSION STATES .... THE TRANSMISSION SHIFTS POORLY.",
        "vin": "5FRYD4H46GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031945,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MAKING HIGH-PITCH CHIRP AFTER ENGINE IS WARM.  NOTICABLE AT IDLE.  NOT NOTICABLE DURING DRIVING/CRUISING SPEEDS.  TOOK VEHICLE TO DEALER REGARDING HIGH-PRESSURE FUEL PUMP TSB.  DEALER STATED THAT HIGH-PRESSURE FUEL PUMP WAS NOT INVOLVED.  STATED IT MAY BE DUE TO THE STARTER (DEFECTIVE SOLENOID OR DRIVE PISTON NOT DISENGAGING).  NO CURRENT TSB EXISTS FOR STARTERS.  PLEASE INVESTIGATE.",
        "vin": "5FRYD3H40GB"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2017",
        "dateOfIncident": "06/18/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014920,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A NEW MDX 2016 AND THE CAR WAS ACTING VERY STRANGE.THE POWERTRAIN WAS OFF, 30000 MILES ENGINE WAS OUT IN THE MIDDLE OF THE ROAD, NOISES EVERYWHERE. IT IS IN THE SHOP NOW AND IT HAS BEEN 2 MONTHS NOW SINCE REPAIR.IT IS STILL IN THE SHOP AND IT HAS BEEN OVER 2 MONTHS.",
        "vin": "5FRYD3H20G5"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013817,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS THE VEHICLE IS MOVING AT 60 -70 MPH AND YOU DECELERATE OR REDUCE ACCELERATION THE RPM GOES TO ZERO, CAR CANNOT ACCELERATE AND YOU DO NOT CONTROL OVER ACCELERATION IN MOVING TRAFFIC. IF THE CAR IIS COASTING AND NOT ABLE TO HAVE A STABLE SPEED WITH MOVING TRAFFIC THIS IS CAN BE DANGEROUS.  SUDDENLY, THE TRANSMISSION WILL ENGAGE WITH A SHARP ENGAGEMENT (METAL SOUND) OF THE TRANSMISSION AFTER ABOUT 6-10 SECONDS. I COMPLAINED TO THE DEALER AS THIS HAS HAPPENED SEVERAL TIMES.  THEY SAID THEY COULD NOT HELP ME SINCE THERE WAS NOTHING WRONG AT THE TIME OF INSPECTION AND THEY HAVE NOT HEARD ABOUT THIS PROBLEM.   LAST WEEK SIMILAR SITUATION OCCURRED EXCEPT THE DASHBOARD ERROR LIGHTS SHOWED SH-AWD, EMISSIONS, TRANSMISSION PROBLEMS AND REAR SIDE WARNING INDICATOR FAULT.  I HAD TO PULL OF ONTO THE SIDE OF ROAD. ONCE IN PARK THE CAR WOULD ONLY GO INTO SPORT MODE IN FIRST GEAR.  CALLED ACURA ROADSIDE ASSISTANCE AND THEY TOWED TO A LOCAL DEALER.  NEXT MORNING THEY SAID IT WAS OK.  ONCE THEY TESTED VIA DIAGNOSTICS THEY SAID THERE WERE ERRORS IN THE TRANSMISSION MODULATOR.  HOPE THIS FIXES THE PROBLEM.  CAR HAS 36K MILES ON THE ODOMETER.  THE DEALER WAS VERY HELPFUL AND HELPED ME GET TEMPORARY TRANSPORTATION TO MY HOME CITY 4 HOURS AWAY.  OTHER PEOPLE ON THE INTERNET ARE HAVING SIMILAR PROBLEMS THAT HAVE OCCURED TO ME.  MY BIGGEST CONCERN IS ONCE THE CAR IS OUT OF WARRANTEE THIS BECOMES MY PROBLEM NOT THE MANUFACTURER.   WHAT RECOURSE DO I HAVE IF THIS A DESIGN OR QUALITY DEFECT FOR ME AND OTHER CONSUMERS.  CURRENT REPAIRS HAVE BEING COMPLETED AND UNKNOWN IF THIS PROBLEM WILL OCCUR AT FUTURE DATE.",
        "vin": "5FRYD4H42GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010242,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT IN MY CAR THIS MORNING AN AS SOON AS I PUT IT IN REVERSE, IT LURCHED FORWARD BEFORE FINALLY MOVING BACKWARDS (THERE WAS NO SLOPE). THEN, AS I APPROACHED A TRAFFIC LIGHT ON A CITY STREET AND APPLIED THE BRAKE, THE CAR FELT AS THOUGH IT ACCELERATED SLIGHTLY BEFORE SLOWING DOWN.",
        "vin": "5FRYD3H22GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "06/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994232,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE INVOLVES THE FWS(FORWARD WARNING SYSTEM) ON THIS VEHICLE THE FWS OPERATES INTERMITTENTLY AND ERRACTICALLY. WHEN DRIVING HOME IN THE RAIN TODAY IT FLASHED ON AND OFF WITHOUT ANOTHER VEHICLE NEARBY. IN MANY CASES IT HAS FAILED TO WARN WHEN I AM APPROACHING ANOTHER VEHICLE AT CONSIDERATE SPEED. IN MOST CASES IT HAS FAILED TO WARN. THIS INTERMITTENT AND APPARENT OPERATION HAS SERVED AS A DISTRACTION AND HAS BECOME A SAFETY ISSUE, THE SALESMAN AND SERVICE MANAGER    HAVE INTIMATED THAT THIS CAN BE CONSIDERED \"NORMAL\" FOR THIS SYSTEM. FOR ME THIS PROBLEM RESULTED IN A NEAR COLLISION AND AM CONCERNED FOR OTHER DRIVERS EXPERIENCING THE SAME PROBLEM THIS PROBLEM OCCURRED IN CITY AND HIGHWAY DRIVING (ROAD TRIP FROM WEST COAST TO CHICAGO AND BACK) ONLY OCCURS WHEN IN MOTION WHETHER TURNING OR NOT.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "05/23/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991219,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR SIR/MADAM - I WAS HEADING TO MY OFFICE FROM HOME ON THE HIGHWAY CA-84. WHILE DRIVING TODAY ON THE HIGHWAY AT AROUND 50MPH I HEAR SUDDEN LOUD POP UP SOUND FROM THE ROOF, I FELT LIKE AN EARTHQUAKE AND VEHICLE STARTING TO SHAKE. AS I SLOWED DOWN I FELT SOMETHING WRONG WITH SUNROOF. SINCE HIGHWAY LEADS TO THE BRIDGE AND HAS NO EXIT I CONTINUED TO DRIVE. HIGHWAY BECOMES INTERNAL ROAD AFTER 5 MILES. AS I GOT AN OPPORTUNITY I PARKED THE VEHICLE AND GET ABOVE TO CHECK WHAT REALLY HAPPENED. I WAS AMAZED TO SEE SUNROOF GLASS IS BROKEN, BUT MOST IMPORTANTLY THE ENTIRE CASING IS CAVING IN. THIS IS VERY SERIOUS SAFETY ISSUE. SINCE THIS VEHICLE IS PRIME FOR MY KIDS COMMUTE I'M NOT SURE HOW SAFE THIS VEHICLE IS.",
        "vin": "5FRYD4H65GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "02/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ABOUT 30 MPH IN A STRAIGHT LINE IN TRAFFIC.  MDX SUDDENLY WOULDN'T ACCELERATE.  CAR STARTED SLOWING EVEN THOUGH ENGINE WAS STILL RUNNING.  I WAS ABLE TO PULL OFF TO CURB.  COULDN'T  SHIFT.  CUT ENGINE OFF  AND RESTARTED.  CAR THEN RAN NORMAL.",
        "vin": "5FRYD4H69GB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985476,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UN INTENDED NON ACCELERATION. DUE TO SEVERE LAG, DELAY, AND SLUGGISH TRANSMISSION RESPONSE.    ACURA HAS REPLACED MY TRANSMISSION UNDER WARRANTY AT 11,000 MILES AND DID NOT ADMIT FAULT AND SAY THERE WAS A PROBLEM.    HERE'S MORE ON MY EXPERIENCE..IN MY 1 YEAR OF OWNERSHIP..    TO WHOM IT MAY CONCERN:    2016 ACURA MDX 13,000 MILES , PURCHASE NEW FROM SIERRA ACURA , ALHAMBRA, CA    I AM WRITING TO REQUEST BUY BACK OF MY VEHICLE  THIS CAR IS A LEMON. SINCE TAKING OWNERSHIP A YEAR AGO, MY 2016 MDX PURCHASED NEW HAS EXPERIENCED NOTHING BUT ONE PROBLEM AFTER PROBLEM. ACURA REPLACED TRANSMISSION A MONTH AGO BUT THE PROBLEM IS STILL THERE. IS IT ENGINEERED AND DESIGNED TO PERFORM IN A NOT SAFE MANNER ? MANY TIMES I EXPERIENCE SHIFTING AND ACCELERATING HESITATION AND JERKY/JOLTING. MY FAMILY AND I DO NOT FEEL SAFE OPERATING AND RIDING IN THIS VEHICLE. SEVERAL TIMES GAS PEDAL DEPRESSED AND VEHICLE LAGGED AT 20 MPH FOR MORE THAN 10 SECONDS BEFORE ACCELERATING.    A FEW OF THE LATEST NEW AND ONGOING PROBLEMS ARE BELOW.    DRIVER DOOR NOW APPEARS OFF SET AND AT DIFFERENT ANGLE PROTRUDING OUT NOW. APPEARS THAT THE DOOR IS NOT CLOSING PROPERLY AND THEREFORE NOT SEALED AT CLOSING.    FURTHERMORE EVERY SINGLE WINDOW HAS EXPERIENCED FAULTY MECHANISMS WITH MOTORS, ACTUATORS, AND SEALS. WHEN CLOSING THE DOORS IT FEELS LIKE THE WINDOWS ARE LOOSE.    THERE ARE ALSO SQUEAKS AND RATTLES EMINATING THROUGHOUT THE CABIN AREA. I SECURED AND COLLECTED ALL LOOSE ITEMS AND THE SOUND IS STILL THERE.    AT ENGINE START UP EACH TIME, THERE IS A HIGH PITCH WHINING NOISE FOR A FEW SECONDS BEFORE ENGINE STARTS (PERHAPS SOMETHING ELSE FAULTY?) I HAVE VIDEO / SOUND DOCUMENTATION OF THIS WITH 2 SEPERATE RECORDING DATES .    WITH REGARD TO THE NAVIGATION, MULTIMEDIA UNIT, IT HAS BEEN LAGGING, SLOW (ER) TO FUNCTION, AND SEVERE DELAY IN BACKUP CAMERA ACTUATING, AND AUDIO FUNCTIONS DELAY IN RESPONSE SOMETIMES.",
        "vin": "5FRYD3H64GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/28/2017",
        "dateOfIncident": "04/26/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981197,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPRACHIING A RED LIGHT. I APPLIED THE BRAKES AND VEHICLE APPEARED TO ACCELERATE AND BRAKES DID NOT STOP CAR, I TURNED RIGHT ON TO SHOULDER OF MAJPR HIGHWAY TO AVOID ACCIDENT. NEXT DAY .WHILE BRAKING TO PARK, CAR WOUND NOT STOP AND ROLLED INTO FIELD. MY WIFE WAS WITH ME TO CONFIRM IT WAS NOT ME PUSHING THE GAS PETAL BY MISTAKE.",
        "vin": "5FRYD3H49GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "02/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956227,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I THOUGHT IT WAS THE TRANSMISSION BUT THEY REPLACED THE TIMING BELT PULLEY AND IT'S STILL MAKING THE SAME CHIRPING SOUND.  THE CAR IS VERY JERKY WHEN IT SHIFTS GEAR WHILE DRIVING.  ALSO, THE CAR ACCELERATES WHEN IT'S GOING DOWN HILL WHILE IN MOTION.  ALSO THE DRIVE 1, 2, 3 BUTTON IS ON THE STEERING WHEEL AND WHEN YOU ACCIDENTALLY HIT IT, THE CAR ABRUPTLY SLOWS DOWN AND WILL NOT MOVE FORWARD AND I HAD TO LITERALLY TURN OFF THE CAR AND TURN IT BACK ON WHILE DRIVING IN A PARKING LOT AND ANOTHER TIME WHILE IN TRAFFIC, HAD TO KEEP PUSHING THE BUTTON BECAUSE THE CAR WOULD NOT GO BUT ONLY IDLE. (CITY STREET.)  THIS HAPPENED MULTIPLE TIMES ON DIFFERENT DATES.  THE ACCELERATING WHILE GOING DOWN HILL HAPPENS ALL THE TIME.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2017",
        "dateOfIncident": "01/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948141,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED ALL OF A SUDDEN WHILE DRIVING ON A FREEWAY AT AROUND 70MPH. HEARD AN EXPLOSION ABOVE THE CAR, HAD TO PULL OVER IMMEDIATELY, AND FOUND THAT THE SUNROOF HAD EXPLODED. I HAVE A ROOF TOP BOX BUT THERE IS NO WAY THIS CAN MAKE CONTACT WITH THE SUNROOF. AS YOU CAN SEE IN THE PICTURE, THE EXPLOSION WAS OUTWARDS. GOOD THING OUR INSIDE SLIDING ROOF WAS CLOSED! WE ALSO HAD 2 KIDS IN THE CAR AT THE TIME.",
        "vin": "5FRYD4H9XGB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943825,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON JAN. 7, 2017 IN SNOW MY WINDSHIELD WASHER WAS NOT OPERATING. DUE TO SALE ACCUMULATION THIS WAS A VERY DANGEROUS SITUATION. I TOOK MY CAR TO THE DEALER AND WAS TOLD THAT MY WASHER FLUID FROZE. THE TEMPERATURE THAT DAY WAS 19 DEGREES. THE WINDSHIELD WASHER FLUID IS NOT SUPPOSED TO FREEZE AT THAT TEMPERATURE.  THE DEALER REFUSED TO TAKE ANY FURTHER ACTION OTHER THAN ADDING A CONCENTRATE TO THE WASHER FLUID.    SINCE THE FLUID WAS ORIGINAL EITHER ACURA USED THE WRONG FLUID OR THERE IS AN EQUIPMENT PROBLEM THAT FREEZES AT 19 DEGREE TEMPERATURE.    THIS IS VERY DANGEROUS SITUATION AND SOME ACTION BY OR AGENCY IS NEEDED..  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943879,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INEXPLAINABLE BATTERY DRAIN ON SEVERAL OCCASIONS RESULTING IN NOT ENOUGH POWER TO START CAR. NO SOLUTION FROM ACURA EXCEPT THAT IT HAPPENS TO A LOT OF OWNERS.     MOST RECENTLY CAR DIED IN AN INTERSECTION (WITH TWO KIDS IN CAR) AND COULD NOT RESTART OR SHIFT TO NEUTRAL (WITHOUT POWER) TO MOVE OUT OF INTERSECTION. CAR WAS STOPPED AT INTERSECTION, DRIVER MOVED FORWARD TO MAKE TURN, DRIVER STOPPED IN INTERSECTION AND AUTO-IDLE ENGAGED (TURNING CAR OFF MOMENTARILY), WHEN DRIVER RELEASED BRAKE, WHICH WOULD NORMALLY RESTART ENGINE, CAR WOULD NOT RESTART DUE TO LOSS OF POWER. STUCK FOR AN HOUR IN MIDDLE OF INTERSECTION UNTIL JUMPED.     THREE DAYS PRIOR TO THAT, CAR SAT FOR 5 DAYS WITHOUT USE IN 40-50 DEGREE WEATHER, AND BATTERY WAS DEAD WHEN ATTEMPTED TO START. SEEMS TO BE A PARASITIC DRAIN OR FAULTY CHARGING ELECTRICAL PROBLEM WITH CAR.",
        "vin": "5FRYD4H93GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940148,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HI,     I BOUGHT A MDX 2016 FROM AUTONATION ACURA LAST YEAR. I HAD A PROBLEM WITH THE CAR THIS WEEK. WHEN I WAS DRIVING(MOVING), MERGING ONTO A FREEWAY, AS THE TRAFFIC WAS MORE, IT WAS SLOW MERGE, SUDDENLY I WAS NOT ABLE TO ACCELERATE AS THE TRANSMISSION MOVED TO \"NEUTRAL\" FROM \"DRIVE\" AUTOMATICALLY. I DON'T THINK THIS IS NORMAL BEHAVIOR AND I DID NOT TOUCH THE GEAR BUTTONS OR STEERING WHEEL SHIFT PADDLES. THIS COULD BE A PROBLEM WITH CAR AND ITS DANGEROUS ISSUE. I WAS LUCKY THAT THE TRAFFIC WAS SLOW MOVING AND I DID MANAGE TO PUSH TO DRIVE AGAIN AND ACCELERATE. WHAT IF THIS IS ON A FAST MOVING FREEWAY.     THANKS,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5FRYD4H90GB"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2017",
        "dateOfIncident": "11/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939081,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE DOES NOT START AND ALL THE WARNING LIGHTS COME UP ON DASHBOARD. AFTER A FEW SECONDS, EACH OF THE SYSTEM COMES UP AS FAILED. DASHBOARD SHOWS AS ACC FAILED, LANE WARNING FAILED, EMISSION FAILED, ENGINE CHECK FAILED. THIS IS A SECOND FAILURE IN LAST 45 DAYS. FIRST FAILED ON NOV 20 AND CAR WAS IN SERVICE TILL DEC 21. AGAIN THE ENGINE FAILED ON JAN 02, NOT ALLOWING TO START AT ALL.",
        "vin": "5FRYD4H47GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934049,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN TRANSIT WITH JUST 15000 MILES ON THE CAR THE TRANSMISSION SYSTEM PROBLEM LIGHT ILLUMINATED.  CAR WAS IMMEDIATELY TAKEN TO DEALER. THIS VEHICLE HAS A CENTER CONSOLE PUSH BUTTON CONTROL FOR THE TRANSMISSION. THE DEALER SAID THAT THERE WAS RESIDUE IN THE CONTROLLER MOST LIKELY DUE TO A SPILLED DRINK.  THE CONTROLLER WOULD NEED TO BE REPLACED AND IT WOULD NOT BE COVERED UNDER WARRANTY.  TO THE BEST OF OUR KNOWLEDGE WE SPILLED NO DRINKS ON THE CONTROLLER. HOWEVER, WHAT A POOR DESIGN. THE DRINK HOLDERS ARE RIGHT NEXT TO THE CONTROLLER! COULD A SPILLED DRINK CAUSE THE TRANSMISSION TO LOCK UP BASED ON THIS DESIGN?",
        "vin": "5FRYD3H22GB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "10/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928282,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON CITY STREET IN TRAFFIC AT ABOUT 20 MPH. ALL WARNING LIGHTS CAME ON. INDIVIDUAL FAILURE ALERTS FLASHED ON NAVIGATION SCREEN. CONTINUED 2 MILES TO DESTINATION AND TURNED OFF IGNITION. RETURNED 2 HOURS LATER AND EVERYTHING WAS BACK TO NORMAL. TOOK CAR TO DEALER AND WAS TOLD THEY COULD FIND NOTHING WRONG. CONTACTED ACURA CORPORATE AND THEY SAID IT WAS UP TO THE DEALER! RESEARCH SHOWS OTHERS HAVE HAD THE SAME PROBLEM BUT IN SOME CASES WITH HIGHWAY SPEEDS THE CAR ALSO SUDDENLY DROPPED SPEED. OBVIOUSLY, THIS COULD BE VERY DANGEROUS. THE ISSUE IS CLEARLY AN INTERMITTENT BUG, PROBABLY SOFTWARE. RATHER THAN DO THEIR JOB AND TRY TO RECREATE IT AT THEIR LABS, ACURA IS JUST WAITING UNTIL THERE IS A LUCKY HIT ON THE PROBLEM OR AN ACCIDENT BEFORE RESPONDING. CLEARLY THIS IS A TOUGH PROBLEM BUT THAT IS EXACTLY WHY THE \"STANDARD\" METHODOLOGY ISN'T SUFFICIENT. I GUESS THE ONLY RESPONSE FOR A USER IS TO NOT EVER BUY AN ACURA AGAIN. THAT WILL BE MY SOLUTION.  *TR",
        "vin": "5FRYD4H94GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925626,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION - CAR LURCHES AT LOW SPEEDS AND HESITATES WHEN YOU TRY TO START OFF FROM A STOP.   I PURCHASED A 2016 ACURA MDX FROM JAY WOLFE HONDA IN KANSAS CITY, MO AND SO FAR MY TOTAL OVERALL EXPERIENCE IS A \"0\" I HAVE HAD MY CAR IN THE SHOP FOR ABOUT 20% OF THE TIME I HAVE OWNED IT AND MY LAST REPAIR WAS TO REPLACE THE TRANSMISSION WITH 10,000 MILES ON THE VEHICLE! IT STILL SHIFTS JERKY AT LOW SPEED BUT I HAVEN'T TAKEN THE CAR BACK BECAUSE I AM GOING TO PURSUE THE LEMON LAW AND/OR ACURA ARBITRATION. I HAD A LOUD NOISE IN THE REAR END, AFTER THEY REPLACED THE STRUTS (AFTER 3 REPAIR ATTEMPTS) AND IT IS BETTER. THERE ARE 3 SERVICE BULLETINS OUT THERE FOR THOSE OF YOU WHO WANT TO TRY THEM TSB NO 16-035 REPLACE REAR SUSPENSION DAMPERS AND REAR UPPER MOUNT BUSHINGS. TSB NO 15-039 REPLACE TRANSMISSION END COVER GASKETS TSB NO 15-054 SOFTWARE UPDATE IN POWERTRAIN AND TRANSMISSION CONTROL MODULES. I CALLED ACURA AND NONE OF THESE WERE LINKED TO MY SPECIFIC VEHICLE VIN #. HAD THEY REPLACED THE GASKETS, I MAY NOT HAVE HAD A FLUID LEAK WHICH SUPPOSEDLY CAUSED THE TRANSMISSION REPLACEMENT. THE MODULE UPDATE IS SUPPOSED TO CORRECT THE SHIFTING - THAT IS QUESTIONABLE. THE REAR END WORK DID HELP THE NOISE IN THE REAR END. I COULD CONTINUE WITH MINOR DETAIL ISSUED BUT SUFFICE TO SAY I WOULD NOT PURCHASE NOR WOULD I RECOMMEND ANYONE TO PURCHASE AN ACURA MDX!!",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "10/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 ACURA MDX. WHILE PARKING THE VEHICLE AND APPLYING THE BRAKE PEDAL, THE VEHICLE CONTINUED TO MOVE FORWARD. THE CONTACT SHIFTED THE VEHICLE INTO REVERSE AND THE VEHICLE ROLLED BACKWARDS OUT OF THE GARAGE WHILE THE BRAKE PEDAL WAS STILL BEING DEPRESSED. THE CONTACT COULD NOT STOP THE VEHICLE. THE VEHICLE MOVED INTO THE STREET UNTIL THE CONTACT PRESSED THE START/STOP IGNITION BUTTON WHILE STILL APPLYING THE BRAKES. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE ISSUE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED  THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 5,000.  UPDATED 06/01/17*LJ  UPDATED 09/07/2017*JS",
        "vin": "5FRYD3H43GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910814,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING BUT TROUBLE SINCE I BOUGHT IT. PURCHASED JAN 2016. HAS REPLACED --- NAVIGATION, AMPLIFIER & FUEL  PUMP!!!  OWNED 2016 MDX FOR LESS THAN A WEEK- VEHICLE JOLTS FORWARD-GIVES ITSELF EXTRA GAS EVEN WHEN YOUR FOOT IS ON THE BRAKE! TRANSMISSION NOT SMOOTH.  BEEN IN FOR SERVICE OVER 40 DAYS NOW (TOTAL). HESITATES SOMETIMES- WAS STUCK AT 15 MPH FOR A FEW MINUTES. RADIO GOES UNRESPONSIVE- NO BUTTONS WORK GETS STUCK AT STATION/VOL CAN'T TURN OFF EITHER. NAVIGATION DIED- TURNED OFF, THEN FLICKERED(WAS REPLACED) . SPEAKERS WENT FLAT- AMPLIFIER DIED (WAS REPLACED). THE ENGINE IDLE FEATURE DOESN'T WORK RIGHT. IT DOESN'T KEEP MY SAMSUNG PHONE CHARGED. I'VE TRIED MULTIPLE CORDS INCLUDING THE ORIGINAL ONE THAT CAME WITH PHONE. ACURALINK DOESN'T ALWAYS WORK EITHER. I SENT A DESTINATION BUT IT DOESN'T SHOW UP FOR A FEW HOURS OR DAYS!  IT TWEETS NOW. THE WINDOW NOW SQUEAKS (NO, IT IS NOT TINTED OR ANYTHING).  IT MAKES A STRANGE DRIPPING NOISE WHEN YOU TURN IT OFF. IT EATS GAS! I FILL IT UP AND IT'S GONE IN A BLINK..NOT THE APPROPRIATE MILES.  IT BEEPS LOUDLY AND BLINKS THAT THERE IS AN OBJECT APPROACHING FOR NO REASON- NO ONE/THING THERE- NOTHING MOVING. IT HAS A MIND OF IT'S OWN.  I'VE BEEN A LOYAL HONDA/ACURA OWNER FOR OVER 18 YEARS AND THEY HAVE NOT HELPED. WHEN THEY REPLACED THE NAVI THEY SAID THEY'D GIVE ME $500 FOR MY TROUBLE- BUT DIDN'T ANYWAY. THEY SAY THERE IS NOTHING WRONG WITH IT-- BUT JUST MONDAY SAID IT NEEDS A NEW FUEL PUMP BUT IS \"SO NEW\" THEY DON'T HAVE ONE SO IT HAD TO BE ORDERED. DISGRACEFUL. I ASKED FOR IT TO BE REPLACED- WAS DENIED. ACURA CLIENT REP SAYS- \"AT THIS TIME THERE IS NOTHING WE CAN DO\"  I HAVE A SPINAL CONDITION AND THE JOLTING HURTS ME GREATLY. SOMEDAYS I CAN'T DRIVE MY BRAND NEW VEHICLE BC I CANT TAKE THE PAIN. THEY DON'T CARE. THEY DON'T STAND BEHIND THEIR PRODUCT EITHER. HIGHLY DISAPPOINTED IN VEHICLE AND COMPANY",
        "vin": "5FRYD4H91GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909783,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO WAY TO PLACE THE CAR IN NEUTRAL WITHOUT TURNING THE ENGINE ON. TODAY I WAS AT A GAS STATION WHEN A FUEL PUMP MALFUNCTIONED AND THERE WAS A FUEL SPILL THAT NEEDED TO BE CLEANED. THE PROCEDURE WAS TO MOVE THE CAR WITHOUT TURNING ON THE ENGINE SO THEY CAN ACCESS THE AREA TO CLEAN UP THE SPILL. AFTER SPEAKING TO MY LOCAL DEALER AND TO THE MAIN CONTACT PHONE NUMBER FOR HONDA NORTH AMERICA, THERE IS NO WAY TO GET THE CAR IN NEUTRAL WITHOUT THE ENGINE BEING ON. THIS CAUSED A SIGNIFICANT DELAY IN GETTING MY CAR MOVED SINCE A TOW TRUCK WITH A DOLLY WAS NEEDED.",
        "vin": "5FRYD3H46GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2016",
        "dateOfIncident": "08/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893785,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I DRIVE MY CAR I EXPERIENCE VERY STRANGE BEHAVIOR FROM MY 9 SPEED TRANSMISSION. IT OCCURS BOTH WHILE ACCELERATING AND DECELERATING. DURING DECELERATION: (1) BY ONLY TAKING YOUR FOOT OFF THE GAS TO DECELERATE CREATES TRANSMISSION CONFUSION (THE CAR DOESN'T KNOW WHICH GEAR TO BE IN), WHICH CAN CAUSE THE CAR TO LUNG FORWARD OR JERK BACKWARD (2) THIS ALSO MAKES IT HARD TO STOP, REQUIRING LOTS OF EXTRA BRAKE PRESSURE. DURING ACCELERATION THE CAR CAN FEEL UNRESPONSIVE, WHICH CAN PROVE SCARY WHEN PULLING OUT INTO TRAFFIC.",
        "vin": "5FRYD3H44GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892606,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2016 ACURA MDX WITH SH-AWD.  WITHIN THE FIRST FEW WEEKS WE NOTICED THE TRANSMISSION SHIFTS WERE JERKY AND ERRATIC.  MOST OF THE PROBLEMS OCCURRED WHEN DRIVING BLOW 40 MPH.  THE VEHICLE ALSO LUNGES FORWARD UNEXPECTEDLY WHEN DECELERATING WHILE YOUR FOOT IS OFF THE GAS PEDAL.  IT FEELS AS IF THE CAR DOWNSHIFTS AND YOU GET SOME UNEXPECTED ACCELERATING.   WE HAD ISSUES WITH THE TRANSMISSION SINCE THE FIRST FEW WEEKS, THE DEALERSHIP KEPT SAYING THAT IT IS AN 'ADAPTIVE TRANSMISSION' AND WILL GET BETTER AFTER TIME.  AFTER A FEW MONTHS, THINGS ONLY GOT WORSE.  THE TRANSMISSION WOULD MAKE A LOUD METAL ON METAL NOISE WHEN STARTING THE CAR UP.  THE VEHICLE WAS IN THE DEALERSHIP FOR ALMOST 3 WEEKS BEFORE THEY COULD IDENTIFY AND FIX THE PROBLEM.  THEY ENDED UP REPLACING THE ENTIRE TRANSMISSION DECEMBER 2015 AND WE HAD TO GO BACK TO HAVE THE TRANSMISSION ADJUSTED AS IT WAS SHIFTING SO HARD THAT YOU WOULD HEAR A CLUNK.  THE VEHICLE HAS NEVER BEEN THE SAME AND IT DOES NOT FEEL SAFE TO DRIVE, ESPECIALLY IN THE WINTER.  WE ARE VERY CAREFUL WHEN COMING TO A STOP BECAUSE YOU NEVER KNOW IF IT WILL SUDDENLY LUNGE FORWARD.  NOW 8 MONTHS AFTER HAVING THE TRANSMISSION REPLACED, THE SAME NOISE IS COMING BACK.  THE CAR IS BACK IN THE DEALERSHIP AND THEY WERE ABLE TO REPLICATE THE SOUND AGAIN.  HOWEVER, NOW THEY ARE TELLING US THAT IT'S A CHARACTERISTIC OF THE TRANSMISSION AND THAT 40-50% OF ALL MDX'S WITH THE 9 SPEED AUTO WILL DEVELOP THIS NOISE!  THEY SAY IT IS DUE TO THE FLUID BUILDING UP AT THE BOTTOM OF THE TRANSMISSION AND WHEN IT STARTS UP THE FLUID GETS PUSHED THROUGH ALL THE GEARS.  IT SOUNDS MORE LIKE METAL ON METAL TO ME AND WHY WAS THE NOISE NOT THERE PRIOR AND ALWAYS DEVELOPS AFTER 6-8 MONTHS?  I HAVE NOT SEEN ANYTHING ONLINE REGARDING THIS NOISE THAT SUPPOSEDLY OCCURS TO 40-50% OF MDXS.",
        "vin": "5FRYD4H97GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2016",
        "dateOfIncident": "09/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887999,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK A TEST DRIVE LOCALLY AROUND THE DEALER ON CITY STREETS AND DROVE MOSTLY UNDER 35 MILES PER HOUR. LATER THAT DAY WE TOOK DELIVERY OF OUR NEW 2016 ACURA MDX. AS WE STARTED DRIVING IT WE EXPERIENCED PROBLEMS WITH SHIFTING. IT WAS ABNORMAL JERKING AND HESITATING AT SPEEDS BETWEEN 10-55MPH. IT WOULD SHIFT THROUGH GEARS RANDOMLY. SO MUCH JERKING AND HESITATING THAT MY FAMILY COMPLAINS OF JOLTS TO THEIR BODY.     I HAVE TAKEN MY CAR IN SEVERAL TIMES AND THEY INSIST THAT THIS IS NORMAL TO DUE 9 SPEED OPERATION. THE ONLY WAY THAT I AM DRIVING THE CAR SMOOTHLY IS BY BABYING THE PEDAL. I DO NOT FEEL SAFE AND DO NOT FEEL CONFIDENT IN DRIVING IT. YOU WOULD HIT THE ACCELERATOR THE CAR WILL HESISTATE BEFORE THE CAR GOES FORWARD.     THE BUTTONS WHILE BEING A COOL NEW FEATURE PRESENTS A SAFETY PROBLEM BECAUSE YOU HAVE TO LOOK DOWN AND FREQUENTLY CANNOT ENGAGE IN THE PROPER GEAR.     IF YOU NEED TO GO FAST OR EVER GET CHASED?? THEN YOU CAN'T DO SO IN A QUICK MANNER!     CAR NOW HAS 9800 MILES AND THIS PROBLEM STILL EXISTS.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882333,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A BRAND NEW 2016 ACURA MDX MODEL AND WITHIN FEW MONTHS, STARTED HAVING TRANSMISSION PROBLEMS. THE CAR WOULD START STALLING IN THE MIDDLE OF THE ROAD AND COULD NOT ACCELERATE TO PICK UP SPEED. THIS HAPPENED IN A MAJOR HIGHWAY WHEN IT SUDDENLY STALLED AND COULD NOT PICK UP SPEED. FELT LIKE HAVING NO CONTROL OF CAR SPEED. THE D LETTER ON DASHBOARD STARTED FLASHING AND ALSO SHOWED BLIND SPOT MONITOR REPORT FAILURES. TOOK THE CAR TO DEALER FIRST TIME AND THEY COULD NOT FIND ANYTHING AND SAID IT SHOULD NOT HAPPEN AGAIN. THE SECOND TIME HAPPENED IN A SHORT PERIOD OF TIME. TOOK IT TO DEALER AND HE SAID ITS FIXED AND KEPT CAR FOR FEW DAYS. WITHIN VERY FEW DAYS THE PROBLEM HAPPENED AGAIN. APART FROM THIS, THE CAR WHEN PUT IN DRIVE FROM PARK WOULD START GOING BACKWARDS WITH LITTLE UPHILL WHICH ALMOST GOT ME IN AN ACCIDENT ON THE HIGHWAY. I FELT VERY UNSAFE TO DRIVE THE CAR ON A HIGHWAY DUE TO THESE SAFETY CONCERNS AS THERE WAS A POTENTIAL FOR ACCIDENTS AND INJURY TO SOME ONE. WE DEMONSTRATED THIS TO DEALER THE THIRD TIME. WE CALLED CLIENT SERVICES OF ACURA MANUFACTURER AND OPENED A CASE. THE REGIONAL MANAGER MENTIONED THEY WILL LOOK INTO THE ISSUES. WE HAD A LONG ROAD TRIP PLANNED AND WE WERE DEPENDENT ON THIS CAR AS IT WAS A FAMILY CAR BUT FELT VERY UNSAFE. THE CLIENT SERVICES OF ACURA HAD COMPLETE LACK OF EMPATHY AND WAS UNWILLING TO DO ANYTHING. HE KEPT STRESSING THAT WE NEED TO PICK UP THE CAR AND RETURN THE LOANER CAR ALTHOUGH WE HIGHLIGHTED THE SAFETY CONCERNS. WE ARE COMPLETELY DISAPPOINTED WITH ACURA AND STILL FEEL UNSAFE WITH THE CAR NOT KNOWING WHAT WILL HAPPEN NEXT.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE PURCHASED THE VEHICLE ON 3/23/16 AND FROM DAY ONE I HAVE BEEN HAVING ISSUES WITH THE TRANSMISSION. WHEN I COME TO A STOP AND WAIT FOR ONCOMING TRAFFIC TO GIVE ME CHANCE TO CROSS THE STREET. WHEN I FINALLY GET THE CHANCE TO CROSS I PRESS THE GAS PEDAL AND THE CAR JUST DOES NOT WANT TO GO, IT STALLS.  SAME ISSUE WHEN GETTING ON THE HIGHWAY WAITING FOR A CHANCE TO GET IN BUT THE CAR DOES NOT WANT TO. IT IS AN SAFETY ISSUE FOR EVERYONE BECAUSE I DO NOT KNOW IF THE CAR WILL RESPOND AND IF IT DOES NOT I CAN CAUSE OTHER VEHICLES TO CRASH INTO MINE. ANOTHER ISSUE JUST CAME OUT YESTERDAY I JUST GOT HOME AND WAS PARKING THE CAR ON MY PARKING LOT WHICH IS FLAT. WHILE PARKING AND SHIFTING FROM REVERSE TO DRIVE THE CAR JUST WOULD NOT MOVE FORWARD AT ALL AND A LIGHT CAME OUT SHIFT TO PARK  SO I DID AND THEN WHEN I SHIFTED TO REVERSE THE CAR WOULD ACCELERATE RAPIDLY.  I HAVE THAT SEVERAL TIMES AND EVERY TIME WOULD DO THE SAME DID NOT GO FORWARD AT ALL AND REVERSE RAPIDLY. I HAVE RECORDED THE WHOLE ISSUE ON MY PHONE AND BROUGHT IT TO THE DEALER. THEY HAVE TOLD ME THAT THEY NEVER HAVE SEEN THIS PROBLEM AND THEY WILL STAY WITH MY NEW CAR FOR ABOUT ONE WEEK. SOMETHING SHOULD BE DONE WITH TRANSMISSION ISSUE BEFORE ANYONE GETS INJURED OR KILLED. DEFINITELY DID NOT EXPECT THAT FROM A $54,000 LUXURY SUV.  I HAD TRADED MY 2009 ACURA MDX FOR THIS HUGE PROBLEM, WHAT A MISTAKE.",
        "vin": "5FRYD4H69GB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873977,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED. THIS 9 SPEED TRANSMISSION HAS A FLUID HEATER IN IT THAT HAS RADIATOR WATER SUPPLIED TO IT. CAR WAS NOT SHIFTING CORRECTLY AND MAKING A BEEPING NOISE AT 20 TO 25 MPH. CAR WAS TAKEN TO DEALER ON 06/11/16 WITH 8,800 MILES ON IT. THEY CALLED TO TELL ME THAT THE 2 WAY VALVE BETWEEN THE COOLANT AND TRANSMISSION WAS FAULTY AND COOLANT GOT INTO THE TRANSMISSION. ACURA TOLD THEM TO REPLACE THE TRANSMISSION ENTIRELY. WILL TAKE 2-3 WEEKS. HAVE BEEN HAVING ISSUES THE ENTIRE TIME WE HAVE HAD THE CAR. WHEN TAKING OFF THE CAR DOES NOT ACCELERATE QUICK, IN FACT, TENDS TO STALL THEN LURCH. HAVE HAD ISSUES WITH THE SENSORS COMING ON, NOT SURE IF THIS IS RELATED TO THE TRANSMISSION, BUT IS A CONTINUOUS ISSUE.",
        "vin": "5FRYD3H45GB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/24/2016",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870647,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 1300 MILES. VEHICLE EXHIBITED A CONDITION WHERE THE ENTIRE ELECTRICAL SYSTEM FAILED, TRIGGERING ALERTS FOR EVERY SYSTEM. EMISSIONS, STABILITY, EVERY SAFETY FUNCTION, BRAKES, STEERING. VEHICLE WENT INTO SOME KIND OF FAILSAFE MODE WHERE THE TRANSMISSION DID NOT SHIFT WELL AT ALL, AND THE CAR WAS BARELY DRIVABLE. VEHICLE DID THIS TWICE OVER A WEEKEND. TOOK IT TO ACURA, AND AFTER AN ANALYSIS THEY BLAMED \"BAD GAS.\" THIS IS AN EXCUSE AS THE VEHICLE ONLY HAD 1300 MILES ON IT AND HAD ONLY HAD 2 FILL UPS, AND BOTH WERE WITH TOP TIER PREMIUM GASOLINE. IN ADDITION, I DO NOT BELIEVE SOME \"BAD\" GAS SHOULD CAUSE THE ENTIRE VEHICLE TO GO COMPLETELY HAYWIRE SHUTTING EVERY SYSTEM OFF. THIS SEEMS TO BE A MAJOR FLAW IF SO. HOWEVER, AS I DON'T BELIEVE THE ANALYSIS THAT IT WAS \"BAD GAS\", I THINK ACURA HANDLED THE SITUATION WRONG AND IS SIMPLY USING AN EXCUSE RATHER THEN DETERMINING WHY SOME SORT OF ELECTRICAL CONDITION CAUSED THIS MASSIVE FAILURE OF THE VEHICLE.",
        "vin": "5FRYD3H40GB"
    },
    {
        "components": "AIR BAGS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854355,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW ACURA MDX 2016 WAS PURCHASED FROM WEIR CANYON ACURA HONDA IN ANAHEIM, CALIFORNIA ON MARCH 18TH 3/18/2016.  IT HAS 40K BUMPER TO BUMPER WARRANTY PER PAPERWORK AND DEALER PLUS PURCHASED EXTENDED 100,000 8-YEAR WARRANTY FOR ANY DEFECTS, ETC. AGAIN BUMPER TO BUMPER.  WITHIN ONE WEEK ON 3/25/2016 WITHIN ONLY 190 MILES ON THE ODOMETER ON THIS BRAND NEW $60K VEHICLE GLASS WINDSHIELD DEFECT WAS NOTICED WITH CRACKING DESPITE NOT SEEING OR HEARING ANYTHING HIT THE WINDSHIELD.  IT WAS DRIVEN ON CALIFORNIA FREEWAY HOME FROM ANAHEIM TO NORTH SAN DIEGO COUNTY (120 MILES.)    UPON NOTICING THE DEFECT THE DEALER WAS CONTACTED BUT THEY SAID ANYTHING CAN HIT THE GLASS AND SAID WILL DO NOTHING ABOUT IT.  (CONTACTED ELI SALES MANAGER AND PAUL SWIM GENERAL MANAGER OF WEIR CANYON HONDA ACURA)   THEN PERFORMED A SEARCH ON THE INTERNET AND NOTICED MANY OTHER ACURA OWNERS HAVE GLASS BREAKAGE AND CRACKING ISSUES AND THERE ARE BLOGS AND ENTRIES FROM ACURA OWNERS ON THE INTERNET'S GOOGLE SEARCH OF ACURA GLASS CRACKING BREAKAGE AND IT SEEMS TO BE A COMMON TREND.  SO I PROCEEDED TO CONTACT DEALER AGAIN TO DISCUSS IT SOME MORE WITH THE DEALER AND EXPLAINED TO THEM THIS IS BRAND NEW VEHICLE PURCHASED WITH NEW AUTO WARRANTY PLUS ADDITIONAL $3000 EXTENDED WARRANTY FROM YOUR DEALERSHIP SO WHY ARE YOU NOT PERFORMING CUSTOMER CARE AND CARE ABOUT DEFECT IN YOUR VEHICLE'S SAFETY COMPONENT (WINDSHIELD) BUT THEY HUNG UP THE PHONE OR USED PROFANITY WHEN CALLED BACK.  PAUL SWIM GENERAL MANAGER EVEN COMMENTED THAT EVEN ONE OF HIS OWN LOANER DEALERSHIP VEHICLES HAS A CRACK BREAK ON THE WINDSHIELD GLASS DESPITE BEING NEW. OPENED CASE WITH ACURA HEADQUARTERS IN TORRANCE CA ON 3/29/16 CASE# 4559849 BUT TALKING TO THEIR MANAGER (JUAN) AND DISTRICT MANAGER THEY REFUSED TO BE ACCOUNTABLE AND IGNORED COMPLAINT AS WELL.  THE FRONT WINDSHIELD IS BASICALLY WEAK FRAGILE AND UNABLE TO PROVIDE REASONABLE SAFETY.",
        "vin": "5FRYD4H9XGB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839808,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE TOO SOFT.  MAIN BRAKE PUMP HAS BEEN CHANGED IN FEW DAYS AFTER DELIVERY.   STILL BRAKES ARE SOFT AND HAVE LONG RANGE FOR PEDAL  TO GO DOWN. KIND OF DO NOT FEEL THE RESISTANCE. VERY UNCOMFORTABLE AND DO NOT FEEL SAFE.",
        "vin": "5FRYD4H20GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/26/2016",
        "dateOfIncident": "02/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838573,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED CAUSING ENGINE TO OVERHEAT.  THIS 9 SPEED TRANSMISSION HAS A FLUID HEATER IN IT THAT HAS RADIATOR WATER SUPPLIED TO IT.  CAR WAS NOT SHIFTING CORRECTLY AND MAKING A BEEPING NOISE AT 20 TO 25 MPH. CAR WAS TAKEN TO DEAL ON 2/13/16 WITH 5,635 MILES THEY TEST DROVE AND SAID THEY COULD NOT FIND ANYTHING WRONG.  SAME ISSUES DRIVING HOME FROM DEALER.  WHILE DRIVING CAR ON 2/23/2016 WITH APPOX. 6700 MILES ENGINE LIGHT CAME ON , SMOKE FROM UNDER HOOD, DISPLAY SAID  ENGINE  OVERHEATED AND APPOX. 1 QUART OF LIGHT BLUE FLUID LEAKED OUT FROM UNDER CAR.  TOWED TO DEALER, THEY SAID TRANSMISSION HEATER(NOT COOLER) RUPTURED, CAUSING THE  TRANSMISSION FLUID AND ENGINE COOLANT TO MIX AND  THIS IS WHAT CAUSED OVERHEATING.  TTHEY ARE ORDERING A NEW TRANSMISSION WITH AT LEAST ONE WEEK DOWN TIME.",
        "vin": "5FRYD3H27GB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/26/2016",
        "dateOfIncident": "02/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838644,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT FOR A CAR WASH AND WHEN THEY VACUUMED OR REMOVED THE WEATHER TECH FLOOR MATS THE SENSOR WAS DAMAGED.  MOST ANYTHING THAT GOES BELOW THE SEAT CAN BREAK OR DAMAGE THE SENSOR RIBBON WIRE.  IT IS COMPLETELY EXPOSED ON THE SEAT FRAME WITH NO PROTECTION.  THE ACURA COST TO REPAIR FOR PARTS AND LABOR IS $993.42 PLUS TAX.  \"THIS REPAIR IS NOT UNDER WARRANTY SINCE IT WAS BROKEN, ONLY MANUFACTURES DEFECTS ARE COVERED UNDER WARRANTY.\"",
        "vin": "5FRYD4H69GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "02/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837273,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE 2016 MDX TAKEN (DELIVERY DATE)10/12/2015, ON 2/16/2016 WHILE I WAS DRIVING AT 5:15 PM SUDDENLY SHUT OFF AND WOULD NOT RESTART. ALL WARNING LIGHTS WERE DISPLAYED ON THE DASH BOARD LIKE BRAKE PROBLEM, EMISSION PROBLEM. VSA PROBLEM ETC. SO VEHICLE WAS TOWED TO DEALER ON SAME DAY AT 8 PM. IT WAS DETERMINED THAT FLOORS WERE SOAKED WITH WATER DRIVER AND PASSENGER SIDE BUT THERE WAS SOME FEW RAIN WATER DROPS THAT NOTICED IN THE CAR DUE TO THE SUNROOF/MOON ROOF ISSUE THAT ALSO REPORTED TO THEM. I DON'T THINK THIS ISSUE IS BECAUSE OF THE WATER THERE WOULD BE SOME ISSUE THAT MIGHT HAVE EFFECTED SO JUST WANT TO REPORT THIS.     DEALER REPORTED THAT ALLOWED VEHICLE TO 2 SIT FOR 2 DAYS AND CLEARED CODES. PERFORMED MULTIPLE TEST DRIVES AND NOTED THAT NO ISSUES HAVE REOCCURRED ON VEHICLE.",
        "vin": "5FRYD4H45GB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "01/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836351,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS LESS THAN 3000 MILES ON IT.  FOR THE LAST MONTH, THERE HAS BEEN 3 TIMES THAT THE CAR WILL NOT START.  FIRST TIME IT WAS JUMPED OFF AND DRIVEN INTO THE ACURA DEALERSHIP...\"WIRE TO BATTERY LOOSE\".  SECOND TIME THE DEALERSHIP SENT A TECHNICIAN OUT AND THE REPLACED THE BATTERY WITH A NEW ONE.  THIRD TIME CAR WAS TOWED TO DEALERSHIPS AS  IT COULD NOT TO BE STARTED AT ALL.  THE DEALERSHIP KEPT IT FOR ALMOST TWO WEEKS AND RETUNED IT TO ME WITH THE EXPLANATION \"COULD NOT FIND ANYTHING WRONG WITH THE CAR\".  CLEARLY THERE IS SOMETHING WRONG WITH THE ELECTRICAL SYSTEM. THE CAR IS DRIVEN 5-6 DAYS A WEEK, NO ACCESSORIES LEFT ON.  NOW I AM SCARED IT WILL QUIT GOING DOWN THE HIGHWAY AND I WILL LOSE POWER BRAKES AND POWER STEERING.",
        "vin": "5FRYD4H49GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/14/2016",
        "dateOfIncident": "02/08/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10826061,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2016 MDX ON 02/01/2016 AND WAS QUITE HAPPY WITH THE INITIAL PURCHASE.  AFTER DRIVING FOR TWO DAYS I STARTED SETTING UP THE CAR'S OPTIONS, I REALIZED THAT THE CARS DRIVE SYSTEM WAS SET TO START IN SPORT MODE.  I CHANGED THE OPTION TO ALLOW THE CAR TO START IN 'NORMAL' MODE PERMANENTLY AND THAT'S WHEN I STARTED TO FEEL THE PROBLEM.   THERE IS A NOTICEABLE 2 - 3 SECOND LAG AT TAKE OFF OR WHEN ATTEMPTED TO ACCELERATE FROM A REDUCED SPEED IN LOWER GEARS.  A VERY UNCOMFORTABLE FEELING WHEN ATTEMPTING TO MAKE A LEFT TURN WHEN YOU HAVE ONCOMING TRAFFIC AND THE CAR FALLS TO ENGAGE AFTER YOU MAKE THE COMMITMENT TO DRIVE.  I WAITED A FEW DAYS TO SEE IF THIS WAS JUST A KINK THAT WOULD GO AWAY SINCE THE CAR WAS NEW.  NO SUCH LUCK.  I TOOK THE CAR TO THE DEALER AND THEY SAID EVERYTHING WAS FINE.  I ASKED ABOUT THE LAG AND THEY SAID IT IS NORMAL OPERATIONAL PART OF THE CAR.  APPARENTLY THIS IS A KNOWN ISSUE WITH THE CAR FOR WHICH THEY DON'T THINK IT IS WORTH LOOKING INTO.  THE SALESMAN ACTUALLY TOLD ME HE HAS THE SAME MODEL AND IT'S JUST SOMETHING YOU HAVE TO GET USED TO.  I GUESS THIS WILL ONLY BE ADDRESSED WHEN SOMEONE GETS KILLED MAKING A TURN AND DON'T GET THE POWER THEY EXPECT.  I HAD THIS ISSUE IN A NEW 2007 CAMRY I BOUGHT A FEW YEARS AGO AND THEY WERE ABLE TO GET IT FIXED WITH AN UPDATE TO THE COMPUTER SYSTEM ON BOARD.  I DON'T KNOW WHY ACURA HAS TAKEN THIS STANCE AND HOPE YOU GUYS CAN GET THEM TO ADDRESS THIS ISSUE.",
        "vin": "5FRYD3H20GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "01/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823626,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH GEAR SHIFT AND CARS SEEMS TO BE REV-UP AT  LOW GEARS . THIS CAN CREATE  A DANGEROUS CONDITION WHILE ACCELERATING FROM STOPS .",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2016",
        "dateOfIncident": "01/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822793,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS FROM BETWEEN SHIFT 1-2 AND 2-3.  CAR ALSO AT TIMES LUNGES FORWARD WHILE COMING TO A STOP",
        "vin": "5FRYD4H4XGB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "01/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822236,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO DAYS AFTER GETTING OUR FIRST OIL CHANGE. THE CAR WOULDN'T START IN OUR GARAGE. THE SYSTEM FLASHED ON AND OFF RAPIDLY. A TECH CAME OUT AND JUMP STARTED THE ENGINE MANUALLY BECAUSE THE COMPUTER WOULDN'T START IT. I DROVE IT TO A SECOND ACURA DEALERSHIP AND THEY STATED THAT THE ONBOARD COMPUTER RANDOMLY SOUGHT OUT A SYSTEM UPDATE SO IT IMPACTED THE ENGINE.  I ASKED WHAT CAUSED THIS ON A NEW 2016 MDX AND THEY COULDN'T EXPLAIN IT NOR COULD THEY PROMISE IT WOULDN'T HAPPEN AGAIN. IF THEY COULDN'T PREDICT WHEN THE COMPUTER DOES THIS, THEN WHAT'S TO STOP IT FROM DOING THIS WHILE THE CAR IS IN MOTION? THIS IS A SAFETY ISSUE THAT NEEDS TO BE INVESTIGATED. THANK YOU.  *TR",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2016",
        "dateOfIncident": "10/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820183,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 1000ISH MILES ON CAR, WHILE WE WERE DRIVING IT SHIFTED INTO NEUTRAL THEN INTO PARK BY ITSELF. WE WERE UNABLE TO SHIFT THE CAR AT ALL. FORTUNATELY WE WERE AT AN INTERSECTION AND NOT ON A FREEWAY. THE DEALERSHIP WORKING WITH ACURA WERE UNABLE TO DIAGNOSE THE PROBLEM. THEN IT MAGICALLY WORKED BUT THEY DIDN'T FEEL WE SHOULD DRIVE IT. BECAUSE CAUSE NOT DETERMINED.",
        "vin": "5FRYD4H44GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820331,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS ALMOST BRAND NEW 2016 ACURA MDX AWD (WITH TECH AND ENTERTAINMENT PACKAGES).    WHEN ACCELERATING ON A FREEWAY/ROAD, SUDDENLY LOTS OF  THE WARNING LIGHTS TURN ON AND THEN THE VEHICLE DOES NOT ACCELERATE ANY MORE. THE SPEED SUDDENLY DROPS. THIS IS DEFINITELY A HAZARD - ESPECIALLY BECAUSE I AM TRYING TO ACCELERATE.     THIS HAPPENED 4 TIMES SO FAR - ROUGHLY 500 MILES BETWEEN EACH INCIDENTS. THE PROBLEM CONDITION GOES AWAY AFTER WE COMPLETELY STOP THE VEHICLE AND TURN IT OFF AND ON MULTIPLE TIMES (AND ALSO PUT THE VEHICLE IN NEUTRAL IN BETWEEN).    LAST TIME WHEN THE PROBLEM HAPPENED, I CLEARED THE CONDITION AND THEN DROVE AND SHOWED THE VEHICLE TO THE DEALER. THE DEALER SAID THAT THERE WERE PERSISTENT CODES ABOUT COMMUNICATION FAILURE AND HE CLEARED THEM.  AND ASKED US TO CALL BACK WHEN THE PROBLEM HAPPENED AGAIN. DEALER DOES NOT SEEM TO KNOW ANY SYSTEMATIC PROBLEMS WITH SUCH TYPES OF VEHICLE.    I HAVE A VIDEO OF THE PREVIOUS PROBLEM CONDITION AT HTTPS://YOUTU.BE/LJSLICWJ7-8",
        "vin": "5FRYD4H64GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2015",
        "dateOfIncident": "12/17/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810977,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION ON A CITY STREET.  WHILE APPROACHING BRAKING AND STOPPING TRAFFIC, THE VEHICLE WAS COASTING AT ABOUT 20-25 MPH WHEN THE BRAKES WERE APPLIED.  THE BRAKE PEDAL WOULD NOT DEPRESS AND THE CAR CONTINUED TO APPROACH STOPPED TRAFFIC WITH NO CHANGE IN SPEED.  THE VEHICLE WAS MANEUVERED INTO SNOW ALONG THE SIDE OF THE ROAD TO SLOW TO AVOID A COLLISION, WHEN THE SPEED DROPPED DOWN TO <10 MPH, IT WAS MANEUVERED BACK ONTO THE DRIVE PAVEMENT AND BRAKING WAS EFFECTIVE.  THERE WERE NO OBSTRUCTIONS ON OR NEAR THE BRAKE PEDAL.  THE PAVEMENT WAS DRY AND CLEAR.  THERE WAS NO SKIDDING.  THE WEATHER WAS COLD (APPROX. 22 DEG F) AND THE CAR HAD BEEN SITTING OUT OVERNIGHT.  THE CAR HAD BEEN RUNNING FOR APPROXIMATELY 10 MINUTES AND DRIVEN FOR 5 MILES BEFORE THE INCIDENT OCCURRED.  THE BRAKE PEDAL FELT OCCASIONALLY \"STIFF\" FOR THE NEXT COUPLE OF MILES.  IT WAS THEN TAKEN TO A DEALER FOR INSPECTION, RESULTING IN NO VISIBLE OR DISCOVERABLE FINDINGS OR DEFECTS.  THERE WERE NO WARNING LIGHTS OR INDICATIONS AND NO FAULTS INDICATED IN THE COMPUTER.",
        "vin": "5FRYD4H41GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "11/28/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809286,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE ON 10/29/15.  THE CAR IS NOT DRIVEN ON A DAILY BASIS SO THERE WAS ONLY A LITTLE OVER 200 MILES WHEN MY HUSBAND NOTICED A LEAK WHILE THE CAR WAS PARKED ON THE DRIVEWAY.  WHEN IT WAS TAKEN TO THE DEALER, THE TECHNICIAN HAS CONFIRMED THAT IT WAS A TRANSMISSION LEAK.  GASKET AND COVER WILL BE REPLACED.  THE SERVICE ADVISOR MENTIONED TO ME THAT THERE WAS SERVICE BULLETIN FOR THAT PROBLEM DATED BACK AUGUST.  DON'T KNOW WHY THE PROBLEM WASN'T ADDRESSED BEFORE THE CAR WAS SOLD.",
        "vin": "5FRYD3H41GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/05/2015",
        "dateOfIncident": "05/27/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808566,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SPEEDS UP WHEN TAPPING BRAKES WHILE GOING DOWNHILL AND ON FLAT GROUND. FEELS LIKE IT GOES INTO NEUTRAL. THIS IS A SAFETY ISSUE THAT ACURA WILL NOT ADDRESS. THEY CLAIM IT IS NORMAL BEHAVIOR.",
        "vin": "5FRYD4H21GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/25/2015",
        "dateOfIncident": "10/22/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807071,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT MY 2016 ACURA MDX IN JULY. SINCE THEN, I AM HAVING TRANSMISSION PROBLEMS. OFF-THE-LINE SHIFTS ARE ERRATIC, DEPENDING ON HOW MUCH THROTTLE I GIVE THE ENGINE. GIVE IT 3/4 THROTTLE AND ACCELERATION IS GREAT, BUT MILEAGE SUFFERS BADLY. GIVE IT ANY LESS THROTTLE AND ACCELERATION IS MEAGER, PLUS THE ENGINE REVS VERY HIGH BETWEEN SHIFTS.    ONE TIME, I WAS PULLING AWAY FROM A STOPLIGHT AFTER SLOWING TO NEARLY A FULL STOP (THE LIGHT JUST CHANGED AS I APPROACHED), I PRESSED 1/2 WAY ON THE ACCELERATOR AND THE ENGINE BOGGED TO NEARLY ZERO RPMS. I THOUGHT IT DIED. I LET UP AND PRESSED DOWN AGAIN AND IT RETURNED TO NORMAL.    MERGING ON THE HIGHWAY IS ALSO VERY DANGEROUS AND SCARY. AS I HIT THE GAS TO ACCELERATE ON THE ON-RAMP, THE ENGINE HESITATES SO BADLY, I NEARLY RUN OUT OF RAMP. PASSING ON THE HIGHWAY IS THE SAME, UNLESS I PRESS THE THROTTLE TO THE FLOORBOARD.    ANOTHER TIME, I FLOORED THE THROTTLE ON THE HIGHWAY WHILE GOING 50 MPH, TO PASS A CAR. THE TRANSMISSION DOWN SHIFTED THEN REVVED UP TO 5,000 RPM AND STAYED THERE, EVEN AFTER I TOOK MY FOOT OFF THE GAS PEDAL! I HAD TO FLOOR THE PEDAL AGAIN TO COAX THE TRANS TO UP-SHIFT.     I COMPLAINED TO ACURA HQ. THEY TOLD ME TO TALK TO MY DEALER. I SPOKE TO MY DEALER, AND THEY SAID THAT'S JUST HOW THE TRANSMISSION IS.    SO DISAPPOINTED WITH CAR. I SUSPECT BAD PROGRAMMING IN THE TRANSMISSION ON ACURA'S PART. THEY NEED TO FIX THIS PROBLEM BEFORE SOMEONE DIES IN A HIGHWAY TRAFFIC ACCIDENT.",
        "vin": "5FRYD4H96GB"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2015",
        "dateOfIncident": "09/22/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806637,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON CITY AND HIGHWAY ROADWAYS, THE VEHICLE WANTS TO DRASTICALLY VEER TO THE LEFT ON SECTIONS OF ROADS SLOPED TO THE LEFT. YOU NEED TO CONSTANTLY APPLY PRESSURE TO THE WHEEL TO KEEP THE VEHICLE FROM VEERING TO THE LEFT. THE VEHICLE IS ALIGNED CORRECTLY FOR ROADS SLOPED TO THE RIGHT. WHILE VEHICLE WAS IN THE DEALERSHIP TO INVESTIGATE THE PROBLEM 3 TIMES WITH NO FIX, OTHER MDX'S DRIVEN AS LOANERS ACTED THE SAME. THE DEALER STATED ON THIRD REPAIR SUMMARY THAT ROAD TESTED VEHICLE AND STATED VEHICLE TRACKING AND STEERING NORMALLY COMPARED TO OTHER MDX'S. THE VEHICLE IS STILL VEERING TO THE LEFT AS BEFORE. DRIVING LONG DISTANCES IS NOT ENJOYABLE WITH THE CONSTANT STEERING COMPENSATION REQUIRED.",
        "vin": "5FRYD4H97GB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/14/2015",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790358,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT NIGHT ON COUNTRY ROADS,UP AND DOWN HILLS, A DARK LINE APPEARS ACROSS THE TOP HALF OF THE WINDSHIELD. LEAVING A VIEW OF 40 -50 FT.  YOU CAN ONLY SEE THREW THE BOTTOM HALF OF WINDSHIELD. VERY DANGEROUS!!  I PURCHASED THIS VEHICLE FOR ALL THE SAFETY FEATURES IT HAS ON IT BUT NOW I CAN'T  DRIVE IT AT NIGHT. WENT TO DEALER  AND THEY TESTED HEADLIGHTS ON A WALL WITH A BLACK LINE AND THE LIGHTS HIT 2-3 INCHES BELOW THAT LINE. WAS TOLD IT WAS FINE. I WANTED IT RAISED A BIT BUT WAS TOLD  THE LIGHTS WERE JUST FINE AND CAN'T BE ADJUSTED. I HAVE READ SOME COMPLAINTS ON THIS VERY SUBJECT. I WOULD LIKE SOMEONE TO TEST DRIVE THIS CAR ON DARK, HILLY, COUNTRY ROADS THAT HAVE NO STREET LIGHTS. I ALSO FINE THAT ON HIGHWAYS, LIKE THE TURNPIKE, LOW BEAMS JUST DON'T GO REACH OUT FAR ENOUGH. I JUST WONDER IF THESE JEWEL EYE HEADLIGHTS ARE LINED UP CORRECTLY? THANK YOU FOR TAKING THE TIME TO READ THIS AND I HOPE THERE IS A SOLUTION TO THIS PROBLEM.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781179,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY SIMILAR TO NHTSA ID NUMBER: 10762375.    AFTER 3-4 DAYS OF DRIVING THE CHECK ENGINE LIGHT CAME ON ALONG WITH TRANSMISSION SYSTEM U0401, VSA PROBLEM, HILL START ASSIST PROBLEM ETC ETC ETC. THE SUV WOULD NOT SPEED ABOVE 35-40 MILES AND SHAKE.     DEALERSHIP REPLACED CRACKED SPARK PLUG, IGNITION COIL - CAUSE - POSSIBLE MOISTURE IN SPARK PLUG.  THEY WERE NICE ENOUGH TO TAKE THE CAR BACK AND CURRENTLY WAITING FOR IT TO BE REPLACED.",
        "vin": "5FRYD4H49GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT ADAPTIVE/MOBILITY,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "08/29/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762377,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FORWARD/FRONT COLLISION MITIGATION BRAKING SYSTEM DIDN'T ENGAGE ENOUGH TO REDUCE OR AVOID IMPACT OF THE COLLISION. MY VEHICLE TOOK A RIGHT TURN AT ABOUT 20-25 MPH AND TRAVELLED LESS THAN 2-2.5 CAR LENGTH BEFORE GETTING ONTO THE CURB AND HITTING AN IRON PILLAR ABOUT 2 FEET HIGH ON SIDE WALK.    IT WAS A SIDE FRONTAL COLLISION AND THE PASSENGER SIDE FRONT WHEEL DIRECTLY HIT THE IRON PILLAR.     THE VEHICLE SPEED WASN'T REDUCED TO MITIGATE IMPACT/DAMAGE FROM THE COLLISION AND VEHICLE TOOK FULL IMPACT OF THE COLLISION.    THE FORWARD/FRONT COLLISION MITIGATION BRAKING SYSTEM MUST BE EVALUATED TO ASSESS SUITABILITY TO AVOID COLLISION WITH OBJECTS OF LOW HEIGHT.",
        "vin": "5FRYD4H96GB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "09/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762375,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9/3/15, I WAS PULLING INTO MY GARAGE WHEN ALL THE WARNING LIGHTS ON THE DASHBOARD WENT OFF - TRANSMISSION, CHECK ENGINE, LANE DETECTION LIGHT ETC.  SINCE I WAS GOING OUT OF TOWN THE NEXT MORNING, I PUT IT IN REVERSE AND DROVE DIRECTLY TO THE DEALER.  THE CAR WAS IN \"LIMP MODE\" AND I COULD ONLY DRIVE 35-40 MPH.      I SHOWED THE TECH IN THE SERVICE DEPT. ALL THE WARNING LIGHTS GOING OFF, AND HE SAID HE HAD NEVER SEEN ANYTHING LIKE THIS BEFORE.  HE WROTE UP A WORK ORDER WITH THE FOLLOWING INFO:  INSPECT FOR CHECK ENGINE LIGHT ON, CHECK ENGINE LIGHT FLASHING AND EVERY WARNING LIGHT IN THE VEHICLE IS ON, WOULD NOT ACCELERATE OVER 35 MPH.    THE FOLLOWING DAY I WAS CONTACTED BY THE SERVICE DEPT. AND WAS TOLD THEY COULD NOT FIND A PROBLEM; THERE WERE NO LIGHTS ON, THEY EVEN DROVE IT FOR 40 MILES.  THE SERVICE DEPT. SAID THEY ARE ONLY ALLOWED TO HOLD THE CAR FOR FIVE DAYS.      TODAY, 9/8/25 I PICKED UP THE CAR.  THE DEALER'S INVOICE READS:  CAUSE:  LIGHT ON  123505 DIAGNOSTIC TROUBLE CODES/PROGRAMMED FUEL INJECTION (PGM-FI)  RETRIEVE CODES WITH THE HDS, READ DATA, 74  WA3.  INSPECTED FOR CHECK ENGINE LIGHT ON, FOUND DTC P0303 (CYLINDER # 3 MISFIRE) RECORDED FREEZE DATA AND CLEARED CODES, AT TIME OF INSPECTION VEHICLE WAS RUNNING PERFECTLY, TEST DROVE VEHICLE TWICE ON EXTENDED TEST DRIVES AND ENGINE RAN PERFECTLY, NO DTCS ARE RESET NO PROBLEM IS PRESENT AT THIS TIME.    SINCE THE SERVICE DEPT. COULD NOT FIND THE PROBLEM AND FIX IT, THIS MEANS THE CAR HAS NOT BEEN REPAIRED AND I AM DRIVING A DEFECTIVE CAR.  THE NEXT TIME THE WARNING LIGHTS GO ON, I COULD BE TRAVELLING ON A CROWDED FREEWAY AT A HIGH RATE OF SPEED (WITH MY FAMILY INSIDE), THE CAR GOES IN TO \"LIMP MODE - 35 MPH AND AN ACCIDENT OCCURS.  THIS IS A SAFETY ISSUE.  HOW CAN ACURA MANUFACTURE A $50,000.00 CAR AND THEIR DEALERSHIP NOT BE ABLE TO FIND THE PROBLEM AND REPAIR IT?",
        "vin": "5FRYD4H43GB"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACURA LANE KEEP ASSIST SYSTEM (LKAS) MIS-READS SOME INTERSECTIONS AND JERKS THE WHEEL TOWARD A SIDE STREET ONLY TO QUICKLY TRY TO COMPENSATE BY JERKING BACK. THERE IS ONE INTERSECTION IN PARTICULAR THAT THIS HAPPENS CONSISTENTLY. THE DEAL SAYS THE SYSTEM IS WORKING PROPERLY. I BELIEVE THIS IS A SOFTWARE \"DEFECT\". IT IS QUITE STARTING THE FIRST TIME THIS HAPPENS AND AT SPEED IT REPRESENTS AN UNSAFE CONDITION.    ANOTHER CASE OF A SAFETY SYSTEM CREATING AN UNSAFE CONDITION.",
        "vin": "5FRYD4H95GB"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745761,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE MDX SHIFTS INTO NEUTRAL AND CANNOT BE SHIFTED OUT OF NEUTRAL. THIS HAS OCCURRED ON THE HIGHWAY MULTIPLE TIMES. THE INFORMATION DISPLAY SHOWS FIRST EMISSIONS PROBLEM, THEN TRANSMISSION PROBLEM. ACURA HAS A TSB OUT FOR THIS B15-034, BUT WON'T APPLY IT UNTIL THE PROBLEM APPEARS. HAVING YOUR VEHICLE SHIFT INTO NEUTRAL IN A HIGH SPEED ENVIRONMENT IS EXTREMELY DANGEROUS. TSB B15-034 NEEDS TO BE A RECALL BEFORE THEIR MDX SHIFTS INTO NEUTRAL DRIVING ON THE HIGHWAY AND THEY BECOME IMMOBILIZED AND PEOPLE ARE KILLED AS A RESULT....UPDATED 09/22/15 *BF",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2015",
        "dateOfIncident": "06/22/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733774,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 9 SPEED ZF TRANSMISSION HAS UNPREDICTABLE BEHAVIOR INCLUDING: DELAYED SHIFTING LEADING TO PAUSES IN POWER, DELAYED DOWN SHIFT DURING ATTEMPTS AT HIGHWAY SPEED ACCELERATION, JERKY SHIFTS, CAR REMAINS IN NEUTRAL WHEN SHIFTING FROM DRIVE TO REVERSE.  VERY UNSAFE CONDITION DUE TO UNPREDICTABLE EFFECTS ON SPEED AND CAR CONTROL.  THIS IS NOW A WIDESPREAD PROBLEM AFFECTING THE SAME TRANSMISSION IN JEEP, CHRYSLER, AND ACURA MODELS.  THE ACURA TLX HAS PREVIOUSLY BEEN DESCRIBED WITH THIS PROBLEM.  NOW THE SAME TRANSMISSION HAS BEEN INCLUDED IN THE 2016 MDX WITH THE SAME OUT COME......UPDATED 10/20/15 *BF  THE CONSUMER STATED THE TRANSMISSION WAS REPLACED. UPDATED 12/17/15.*JB",
        "vin": "5FRYDH96GB0"
    }
]