[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456824,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A6. The contact stated that after starting the vehicle, the check engine warning light remained illuminated continuously. The vehicle was taken to an independent mechanic where it was diagnosed that the vehicle was overheating and the thermostat needed to be replaced. The dealer was not contacted. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 48,000.",
        "vin": "waugfafc9gn"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2021",
        "dateOfIncident": "09/10/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435089,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A6.  The contact stated the emergency lights were illuminated. The vehicle loss coolant and overheated. The stop immediately message was displayed. The vehicle was taken to an independent mechanic who stated that the engine coolant housing assembly needed to be replaced. The vehicle was repaired.  The local dealer was not contacted. The manufacturer was notified and referred the contact to NHTSA. The failure mileage was approximately 51,000.",
        "vin": "WAUGFAFC6GN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2021",
        "dateOfIncident": "08/26/2021",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430632,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine caught fire without being used for 24 hours before",
        "vin": "WAUCFAFC8GN"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395680,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OK PURCHASED THE CAR OCTOBER 2019, IMMEDIATELY NOTICED A BURNING SMELL, IN THE CAR. TOOK OUT TO AUDI MULTIPLE TIMES ASK IF THERE WAS A LEAK, BEFORE THE WARRANTY RAN OUT. THEY SAID NO, NOW A YEAR LATER MY CHECK ENGINE LIGHT HAS COME ON. ONE DIAGNOSTIC DONE AT JIFFY LUBE READ A CODE THAT SAYS IT IS THE COMPUTER AUXILIARY OUTPUT. TOOK THE CAR TO AUDI TO DO A SECOND DIAGNOSTIC, THEY SAID ITS THE THERMOSTAT, AND COOLANT PUMP. MY CAR IS NOT EVER HEATING AND THE HEAT AND AIR WORK FINE. HOW IS IT NOW THAT THE CAR IS NOT UNDER WARRANTY THEY NOTICE THE LEAK IN THE COOLANT PUMP, WHEN I COMPLAINED ABOUT THE SMELL OF BURNING WATER WHEN I FIRST PURCHASED THE CAR. THERE ARE NO INDICATIONS OF A LEAK ON MY DRIVEWAY. THE DEALERSHIP HAS QUOTED ME 1683.00 THOUGH THERE IS A RECALL ON THE SAME PARTS. A YEAR AGO WHEN I PURCHASED THE CAR THERE WERE FAULTY ISSUES WITH THE COMPUTER. AUDI DID REPLACE THIS UNDER WARRANTY, BUT A MONTH AGO THE COMPUTER WOULD NOT COME ON SEVERAL DIFFERENT TIMES. CALLED THE DEALERSHIP TOLD THEM IT WAS ON AND OFF THEY SAID TO BRING IN IF IT CONTINUES. SOON AFTER THE CHECK ENGINE LIGHT COMES ON, AND NOW ALL OF A SUDDEN ITS A LEAK IN THE COOLANT PUMP ALLEGEDLY. I REPEATEDLY ASKED THEM IF THE CA HAD A LEAK WHEN I FIRST BOUGHT IT ONLY BECAUSE THE ENGINE WAS GIVING OFF THE BURNT SMELL. THEY WAITED UNTIL THE CAR WAS OUT OF WARRANTY TO AGREE WITH ME. THERE IS A RECALL TO FIX THE COOLANT PUMPS ON THE AUDI BUT THEY ARE WANTING TO CHARGE ME TO REPAIR MINE. RIGHT NOW THE VEHICLE SHUT OFF ON ME TONIGHT AND THE EPC LIGHT IS ON. CAR WILL NOT START, NOR WOULD THE ENGINE RECEIVE THE GAS WHEN TRYING TO ACCELERATE. ONLY BEEN DRIVING THE VEHICLE FOR A YEAR, I SHOULD NOT HAVE MAJOR ISSUES WITH IT AS OF NOW.",
        "vin": "WAUGFAFCXGN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395849,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE VIBRATES HEAVILY WHEN THE BRAKES ARE APPLIED AT HIGHWAY SPEEDS.  BRAKES ROTORS REPLACED WITH LESS THAN 15K MILES VEHICLE APPEAR TO HAVE THE SAME ISSUE AND HAS CONFIRMS BY AUDI DEALER BUT REFUSED TO ADDRESS THE SAFETY ISSUES... ROTORS REPLACED AT 25K MILES AND VEHICLE NOW HAS 40K MILES AND NEED ROTORS REPLACE AGAIN",
        "vin": "WAUFGAFC7GN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375203,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM#1 FUEL DOOR CLIP SUDDENLY STOPPED CLOSING, THEREFORE I COULDN'T FULLY CLOSE IT.     PROBLEM #2 TRUNK LATCH STUCK, THEREFORE I HAVE TO GET INTO THE TRUNK USING THE REAR SEATS, THEN RELEASING THE LATCH FROM INSIDE. ALL THIS HAPPENED WITHIN 1 YEAR OF FINANCING THE VEHICLE.",
        "vin": "WAUFFAFC3GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/08/2019",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287720,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE VIBRATES HEAVILY WHEN THE BRAKES ARE APPLIED AT HIGHWAY SPEEDS. NO ACCIDENT HAS OCCURRED BUT IS OF GREAT CONCERN",
        "vin": "WAUGFAFC8GN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256340,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI RECALLED 2012-2015 A6 CARS WITH THE 2.0L TFSI ENGINE, ALONG WITH OTHER AUDI MODELS, DUE TO FAULTY COOLANT/WATER PUMP (NHTSA RECALL # 18V-229  MFG RECALL #19N3/19N4).  FOR THE A6, THE BRACKETING WAS FOR CARS BUILT FROM 4/4/2011 - 12/22/2014.  THE BRACKETING FOR OTHER MODELS IMPACTED BY THE RECALLED VARIED FROM 2012-2017.  MY A6 2.0 WAS BUILT IN FEB 2015, BUT WAS CLASSIFIED AS A 2016 MODEL. ON 8/28/2019 MY CHECK ENGINE LIGHT TURNED ON.  I TOOK THE CAR INTO MY AUDI DEALERSHIP FOR SERVICING.  THE TECHNICIAN STATED THAT I HAD A DEFECTIVE COOLANT/WATER PUMP, AND THAT THE PUMP WAS ABOUT TO BURST AND NEEDED IMMEDIATE REPLACEMENT.  I WAS AWARE OF THE RECALL, AND ASKED IF THE PUMP ON MY CAR WAS SIMILAR TO THE PUMPS COVERED UNDER THE RECALL, WHICH THEY CONFIRMED THE PUMP PART NUMBER ON MY CAR MATCHED THE PUMP PART NUMBER THAT WAS BEING RECALLED.  HOWEVER, SINCE MY CAR WAS CLASSIFIED AS A 2016, IT WAS NOT COVERED UNDER THE RECALL.  IT APPEARS THAT THE BRACKETING THAT WAS USED TO DETERMINE WHICH CARS SHOULD BE COVERED UNDER THE RECALL WAS NOT BROAD ENOUGH FOR THE A6 MODELS, AS IT APPEARS THAT THE DEFECTIVE PUMPS WERE ALSO USED ON SOME 2016 A6 MODELS OR CARS BUILT AFTER 12/22/2014.",
        "vin": "WAUGFAFC9GN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255113,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEBRUARY 2019 I RECEIVED A RECALL LETTER, NHTSA 19V035, FROM AUDI TELLING ME MY CAR MAY HAVE A DEFECT IN THE FUEL RAILS WHICH COULD LEAK FUEL CAUSING A FIRE! I IMMEDIATELY CONTACTED MY DEALER AUDI OF WALLINGFORD CT AND PUT MY NAME ON A WAITING LIST FOR REPAIR. I HAVE NOW BEEN WAITING SEVEN MONTHS AND DESPITE SEVERAL CALLS TO THE SERVICE DEPT, IT HAS NOT BEEN FIXED. THEY TELL ME THEY ARE NOT GETTING THE PARTS FROM AUDI. TODAY THEY TOLD ME THEY HAVE NOT RECEIVED THE NEEDED PARTS IN MONTHS! THIS IS FOR A DEFECT WHICH COULD CAUSE A FIRE. IS THIS PERMISSIBLE? WHAT CAN BE DONE?",
        "vin": "WAUFGAFC2GN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252138,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE LEAK NOTICED BY TECHNICIAN. DURING ROUTINE OIL CHANGE. SKID PAN FULL OF TRANSMISSION FLUID. NOT AN ISSUE IN PREVIOUS INSPECTIONS. AUDI DEALERSHIP LOOKING FOR CAUSE. NO PERFORMANCE ISSUES NOTICED",
        "vin": "WAUCFAFC6GN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222175,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 AUDI A6. CONSUMER WRITES IN REGARDS TO  FUEL RAILS SAFETY RECALL. *LD    THE CONSUMER STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME TO COMPLETE THE RECALL REPAIR. *JS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184924,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED VEHICLE IN PARKING LOT EXITED ONTO A MULTI-LANE ROAD WHERE TRAFFIC SPEED IS 50 MPH BUT CARS OFTEN DRIVE MUCH FASTER. THE VEHICLE WAS IN DRIVE BUT STAYED IN FIRST GEAR AND WOULD NOT AUTOMATICALLY SHIFT TO HIGHER GEARS. THIS CAUSED THE CAR TO NOT MERGE AT PROPER SPEED WHILE VEHICLES WERE FAST APPROACHING. AFTER MULTIPLE ATTEMPTS AT RELEASING AND APPLYING THE GAS PEDAL, THE VEHICLE STILL FAILED TO SHIFT GEARS. FORTUNATELY, I WAS ABLE TO FIND AN AREA TO PULL OFF THE ROAD AND AFTER 15-30 SECONDS, THE CAR BEHAVED CORRECTLY. A SIMILAR SITUATION HAPPENED A COUPLE TIMES WHILE ON THE FREEWAY WHERE THE CAR TACHOMETER INCREASED VERY HIGH AND THE CAR FAILED TO SHIFT INTO HIGHER GEARS. IN THESE CASES, I DID NOT FEEL AS UNSAFE AS THE VEHICLE WAS ALREADY TRAVELLING AT 50-60 MPH. I'VE TAKEN THE CAR TO THE DEALER TWICE WHEN THE ISSUES OCCURRED BUT THERE ARE NO DIAGNOSTICS TO INDICATE A PROBLEM OCCURRED AND THE DEALER WAS UNABLE TO REPRODUCE THE ISSUE. I ALSO INFORMED THE DEALER THAT BLACK LIQUID WAS LEAKING FROM THE VEHICLE (SEE ATTACHED PHOTOS) BUT THE DEALER FOUND NO LEAKS. I PHOTOGRAPHED THE LEAKS AND SAVED A RAG WITH THE LIQUID AND PRESENTED THIS AT THE DEALER. THERE ARE NO OTHER VEHICLES OR EQUIPMENT THAT PARK IN MY GARAGE AND AM 100% CERTAIN, THE LIQUID IS FROM THE VEHICLE. THE IMAGE SHOWS THAT THE LEAK HAD OCCURRED SEVERAL TIMES AND IT PERSISTED SEVERAL TIMES AFTER THE PHOTO. HOWEVER, I'VE NOT NOTICED THE LEAK FOR THE PAST COUPLE MONTHS.",
        "vin": "WAUFGAFC9GN"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180999,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS SHUT OFF WHILE DRIVING.     VEHICLE HAS SHUT OFF WHILE AT A STOP LIGHT; WOULD NOT IMMEDIATELY RESTART. FIDDLED WITH THE GEARS, PUT IN PARK.  GOT VEHICLE TO START AFTER ABOUT 30-60 SECONDS. 30-60 SECONDS IS A SIGNIFICANT AMOUNT OF TIME AT A STOP LIGHT THAT HAS JUST TURNED GREEN. THIS HAS HAPPENED 3 TIMES.     ENTER VEHICLE; START; PUT IN REVERSE OR DRIVE TO EXIT MY DRIVEWAY; CAR HAS SHUT OFF WHILE ATTEMPTING TO EXIT DRIVEWAY, 4 TIMES; WARNING/PROMPTING ME TO PUT IT IN PARK.     BRAKES OR ROTORS MAKE A SCRATCHING NOISE; NOTICE IF DRIVING CLOSE TO A WALL OR MEDIAN (TO REFLECT THE SOUND) WHEN WINDOWS ARE DOWN.  HAVE HAD BRAKES CHECKED BY DEALER MULTIPLE TIMES AND HAVE BEEN TOLD THEY WERE FINE. HOWEVER, THEY MAKE A CONSTANT NOISE.     MY PARKING SENSOR HAS BEEN STUCK IN A POSITION THAT MAKES VEHICLE THINK THE PASSENGER SIDE FRONT BUMPER IS IN CONTACT WITH SOMETHING. WILL USUALLY GO BACK TO NORMAL BY THE NEXT DAY.  THIS HAS HAPPENED TWICE.",
        "vin": "WAUGFAFC6GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142839,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 AUDI A6. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 18V370000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL LETTER IN JULY OF 2018. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE PARTS WERE UNAVAILABLE FOR REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  CONSUMER STATED IT'S BEING 5 MONTHS SINCE THE RECALL LETTER. DEALER SAYS THEY COULD NOT DO ANYTHING. UPDATED 01/29/19*JB",
        "vin": "WAUGFAFC5GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139253,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A6. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 18V370000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOTIFIED AND STATED THE PART WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  *JB",
        "vin": "WAUFFAFC8GN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPERATING AT LOW SPEEDS THE VEHICLE WILL SOMETIMES UNEXPECTED LURCH  FORWARD OR BACKWARDS DEPENDING ON IF THE TRANSMISSION IS IN FORWARD OR REVERSE.  I HAVE AUTOMATIC TRANSMISSION.  THIS OFTEN HAPPENS IN MANEUVERS SUCH AS PARKING OR BACKING INTO OR OUT OF A GARAGE PARKING PLACE.  IT HAPPENS WHEN THE TRANSMISSION IS IN FORWARD OR REVERSE AND TYPICALLY WHEN THE DRIVER'S FOOT IS ON THE BRAKE AND YOU ARE SLOWLY EASING INTO OR OUT OF A PLACE LIKE A PARKING SPOT OR GARAGE.   THIS CONCERNS ME FROM A SAFETY PERSPECTIVE SINCE A PRIME TIME WHEN THIS HAPPENS MIGHT BE WHEN I AM PULLING INTO OR OUT OF MY GARAGE AT THE BEGINNING OR END OF A TRAVEL.  MY CONCERN IS THAT A CHILD OR ADULT MAY BE CROSSING IN FRONT OF OR BEHIND THE CAR BEFORE IT STARTS MOVING AND THEN THE CAR UNEXPECTED LURCHES FORWARD OR BACK AND HITS THE PEDESTRIAN.    IT IS ALMOST AS IF THE ENGINE MISFIRES AND THE ENGINE AND CAR \"JUMPS\" AFTER THE MISFIRE.    I HAVE REPORTED THIS TO THE DEALERSHIP SERVICE DEPARTMENT MULTIPLE TIMES AND THEY CAN NOT \"REPRODUCE\" THE INCIDENT.  HOWEVER, ONE OF THE SERVICE DEPARTMENT PERSONNEL HAS THE SAME MODEL VEHICLE AS ME AND SAYS HE KNOWS WHAT I AM TALKING ABOUT BECAUSE HE HAS EXPERIENCED IT AS WELL.    IT HAS HAPPENED ON MULTIPLE OCCASIONS THOUGH I CAN NOT TELL YOU ANY EXACT DATES.",
        "vin": "WAUGFBFC0GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/07/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119749,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A6. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED INTERMITTENTLY. THE CONTACT WAS CONCERNED FOR HIS AND HIS FAMILY'S SAFETY IN THE EVENT THAT THE AIR BAGS MIGHT DEPLOY. THE VEHICLE WAS TAKEN TO AUDI OF SPRINGFIELD (3500 E SUNSHINE ST, SPRINGFIELD, MO 65809, (417) 459-4633). THE DEALER STATED THAT THE PART WAS NOT AVAILABLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V370000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED CASE NUMBER: 181157166. THE APPROXIMATE FAILURE MILEAGE WAS 22,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  CONSUMER STATED PASSENGER SEAT AIRBAG MONITOR IS NOT WORKING. UPDATED 12/18/18*JB",
        "vin": "WAUGFAFC6GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "08/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118713,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS PODS RECALL.  CALLED AUDI USA REP TODAY AT CONTACT US (800-253-2834) INSTRUCTED NO FIX IN YET AND TO KEEP DRIVING, THAT THEY WERE NOT REPLACING NOR SUBSTITUTING VEHICLE UNTIL FIX.  I DO NOT FEEL PASSENGER ENDANGERMENT IS APPROPRIATE WITH RECALL ON PODS.",
        "vin": "WAUFGAFC7GN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/07/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11118561,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SMALLISH SIZED PURSE SLIPPED OFF THE PASSENGER SEAT AND WEDGED BETWEEN THE SEAT AND THE FLOOR BOARD BELOW THE DOOR, LANDING ON THE ELECTRONIC SEAT CONTROLS THAT RECLINE THE PASSENGER SEAT. IT RECLINED THE BACK WHILE I WAS DRIVING ON A BRIDGE AND COULDN'T PULL OVER OR STOP, SMASHING MY GRANDSON'S LEGS, WHO WAS IN HIS CAR SEAT BEHIND THE PASSENGER SEAT. HE WAS SCREAMING AND THERE WAS NO WAY FOR ME TO REACH THE CONTROLS TO STOP THE EMPTY SEAT FROM RECLINING, SQUISHING HIM INTO HIS CAR SEAT ! LUCKILY, IT DIDN'T BREAK BOTH OF HIS LEGS, BUT IT COULD EASILY HAVE DONE THAT  IF HE'D BEEN A LITTLE BIGGER. AS IT WAS HE WAS TERRIFIED AND SO TRAUMATIZED, I'M NOT SURE I'LL EVER GET HIM BACK IN THIS CAR. THERE SHOULD BE CONTROLS THAT CAN'T ACCIDENTALLY BE ENGAGED OR SOME KIND OF REACHABLE CONTROL FROM THE DRIVER'S SEAT.",
        "vin": "WAUFGAFC7GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112011,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A6. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V370000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (AUDI BAKERSFIELD, 6000 WIBLE RD, BAKERSFIELD, CALIFORNIA 93313) WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUCFAFC0GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112012,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE AIRBAG OFF LIGHT GOES ON AND OFF AT TIMES ON THIS VEHICLE WHILE SOMEONE SITTING ON PASSENGER SEAT. AUDI DOES NOT HAVE AN ETA FOR REPLACEMENT PARTS AND NOT WILLING TO PROVIDE A LOANER VEHICLE. I AM AFRAID FOR THE SAFETY OF MY FAMILY AT THIS POINT AND THINK AUDI SHOULD TAKE BACK THIS LEASE OR PROVIDE US WITH A NEW VEHICLE THAT IS SAFE TO DRIVE UNTIL IT HAS BEEN REPAIRED.",
        "vin": "WAUCFAFC0GN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090249,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I THINK THE AUDI RECALL NEEDS TO INCLUDE MORE YEARS. IT ENDS AT 2015 A6. I HAVE A 2016 A6 THAT NEEDED TOWED IN MARCH. I WAS DRIVING AND THE CAR STARTED SMOKING, THE ENGINE COOLANT WAS GONE, AND THE CAR HAD TO BE TOWED IN. THE PROBLEM SEEMS THE SAME AS THE RECALL FOR THE COOLANT SYSTEM THAT WAS JUST ANNOUNCED. THEY REPLACED THE COOLANT SYSTEM IN MARCH OF THIS YEAR. MY VEHICLE ONLY HAD ABOUT 26K MILES.",
        "vin": "WAUDFAFC6GN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "02/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072020,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS SLOWING THIS CAR DOWN TO MAKE A RIGHT TURN ON A BUSY EXPRESSWAY, AFTER SHE MADE THE TURN, THE ENGINE SUDDENLY SHUT OFF AND THE 'STOP/START DEACTIVATED MANUALLY RESTART YOUR CAR\" LIGHT CAME ON. THE STEERING WELL WAS LOCKED, THE CAR DEAD ON THE STREET, THE INTERIOR LIGHTS AND RADIO WERE WORKING NORMALLY, HER SEAT BELT WAS BUCKLED, ALL DOORS WERE CLOSED.  THANKFULLY THE OTHER DRIVERS DID NOT HIT OUR CAR, SHE WAS ABLE TO RESTART THE CAR AFTER 2 MINUTES AND WE DROVE HOME WITHOUT FURTHER INCIDENT. THE STOP/START FUNCTION OFTEN HESITATED WHEN I HAD DRIVEN THE CAR BUT NEVER SHUT DOWN COMPLETELY LIKE THIS BEFORE.",
        "vin": "WAUFGAGC1GN"
    },
    {
        "components": "SEAT BELTS,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019265,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI AMERICA AND ITS DEALERS HAVE FAIL TO ENSURE MY SAFETY AND FIXING MY  CAR ISSUES. AUDI AMERICA SOLD ME A LEMON VEHICLE. EVER SINCE I PURCHASE VEHICLE IT HAS HAD ISSUES INCLUDING STABILITY, WHEEL WROBBLY, AND LOST OF HORSE POWER FEELING LIKE THE CAR IS SHUTTING OFF ON FREE WAY.",
        "vin": "WAUGFAFC2GN"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013357,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A6. WHILE CHANGING A FLAT TIRE, THE JACK FRACTURED AND CAUSED THE VEHICLE TO COLLAPSE. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE BY THE INSURANCE COMPANY. THE OWNER CONTACTED THE DEALER (PAUL MILLER AUDI IN PARSIPPANY, NJ) WHO CAME TO THE CONTACT'S RESIDENCE TO CHANGE  THE TIRE. THE DEALER REPRESENTATIVE, CHRIS DEXTER WITH AUDI OF MENDHAM IN MENDHAM, NJ, FROM WHERE THE ORIGINAL EQUIPMENT WAS PURCHASED, WAS CONTACTED AND PROMISED TO CALL BACK, BUT DID NOT. THE MANUFACTURER WAS CALLED, BUT NO ONE ANSWERED THE PHONE. THE JACK WAS NOT REPLACED. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000.   UPDATED 10/18/17*LJ  *JS",
        "vin": "WAUGFAFC4GN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/12/2017",
        "dateOfIncident": "10/13/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972115,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A6. WHILE DRIVING VARIOUS SPEEDS, THE BRAKE PEDAL WAS DEPRESSED AND PULSATED. THE STOPPING DISTANCE WAS INCREASED AND THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED WITH WARPED FRONT BRAKE ROTORS THAT NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND A COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS 17,000.",
        "vin": "WAUFGAFC2GN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946420,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER CONDENSER FAILED AT 5000 MILES.",
        "vin": "WAUFFAFC2GN"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860975,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT A WARNING LIGHT THAT ADAPTIVE CRUISE AND BRAKING WERE NOT AVAILABLE. ACCORDING TO THE SERVICE DEPT. THERE WAS A SEAM IN THE BODY THAT WAS NOT WELDED PROPERLY IN THE MANUFACTURING PROCESS. I HAVE 6500 MILES ON MY CAR. THEY SAID THAT WATER WAS LEAKING IN ON ELECTRICAL MODULES. THIS PROBLEM HAPPENS WHILE DRIVING.",
        "vin": "WAUGFAFC7GN"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2016",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845864,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STUMBLES AND CUTS OFF AT A FEW MOMENTS OF IDLING. IT HAS ALSO LOST POWER AND THE GAINED IT BACK MOMENTS LATER AT RAPID PACE.",
        "vin": "WAUDFAFC2FN"
    }
]