[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457271,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My car got the recall of PODS a year ago and Audi still doesn't have part availability to fix it. This impacts my driving a lot.",
        "vin": "wauj8gff8g1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451977,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Contacted the place that sold me the car Audi North Houston. Everytime I try to replace it. They say that they’re out of the part and will contact me. It has been months and it still hasn’t been replaced. I’m worried about driving an unsafe vehicle.",
        "vin": "Waua7gff1g1"
    },
    {
        "components": "VISIBILITY/WIPER,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448382,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Rearview backup camera is intermittently inoperative.  Cannot use camera to see what is behind the car.  Dealer inspected, duplicated and confirmed problem.   Dealer at first ignored.  Once out of warranty, dealer duplicated problem.  It is a known problem.  Manufacturer issued Technical Service Bulletin: 91 16 87 2045730/1 November 7, 2016.",
        "vin": "WAUTPBFF0GA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445944,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact and his wife own a 2016 Audi A3. The contact had received a recall notice for NHTSA Campaign Number: 21V198000 (Air Bags). The dealer was contacted and informed that the parts remained unavailable despite the letter that stated otherwise. The contact also stated that the passenger occupant detection system (PODS) was inactive and that the passenger air bag warning light had illuminated on the instrument panel. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The failure mileage was approximately 20,000. Parts distribution disconnect.",
        "vin": "waue8gff6g1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439966,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the message “Vehicle Electronic System Malfunction Shift Car to Park Before Exiting Vehicle.” The car can fail to shift into gear, or change gears while the vehicle is in motion. The mechanic that I usually take my car to said that’s he’s seen the same message in some of his other customers cars. Sometimes it pops up when the car is started, other times is comes up when the car is in motion. I’ve parked the car and turned it off, and the message came back on after restarting the car.",
        "vin": "WAUA7GFF5G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "05/22/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439790,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A3. The contact received a recall notification for NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact stated that the front passenger’s side air bag warning light was illuminated, and the State Inspector informed her that the vehicle would fail inspection if the recall repair was not completed.  The dealer was notified of the failure but did not provide any assistance. The manufacturer was not notified of the failure. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 55,000. VIN tool confirms parts not available.",
        "vin": "WAUB8GFF9G1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/10/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437383,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A3. The contact stated while driving 40 MPH, he started to smell gasoline fumes inside the vehicle. The contact stated that there was no warning light illuminated. The contact was able to drive to a nearby gas station and noticed a fuel leak. The contact was able to drive to his destination. The contact stated he replaced the fuel cap and evaporator air filter, the fuel pressure sensor, and the evaporator purge valve but continued to experience the failure. The contact called the local dealer and made them aware of the failure. The vehicle was not diagnosed or repaired. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 16V647000 (Fuel System, Gasoline, Engine and Engine Cooling) however, the VIN was not included. The manufacturer had been informed of the failure. The failure mileage was approximately 65,000.",
        "vin": "WAUG7GFF7G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436608,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A3. The contact received notification of NHTSA Campaign Number: 21V198000 (Air Bags) however, the part to do the recall repair was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact stated that the passenger’s side air bag warning light was illuminated. The dealer and manufacturer were not made aware of the failure. The vehicle was not diagnosed nor repaired. The failure mileage was approximately 65,000. VIN tool confirms parts not available.",
        "vin": "waua7gff0g1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436678,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was sold a vehicle with a manufacturer recall that I was ensured was no big deal and would be fixed but there isn't currently a solution for the recall on the vehicle. The recall was issued in March of 2021 and it is now September 2021. I should have not been sold a faulty vehicle especially one with no foreseeable solution to the recall.",
        "vin": "wau57lff1g1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/22/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434060,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A3. The contact received a recall notification for NHTSA Campaign Number: 21V198000 (Air Bags) however, the dealer informed the contact that parts for the recall repair were not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "WAUA7GFF8G1"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433922,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL TIRE NORTH AM",
                "productModel": "CONTIPROCONTACT",
                "productYear": "9999",
                "size": "225/45R17",
                "type": "Tire"
            }
        ],
        "summary": "On August 30th 2021 around 12:45pm driving to work I experienced something I did not realize was possible.  I was in the fast lane going 70-75mph when my steering wheel began to shake profusely, I felt like something was under my car and hitting/whipping the right passenger  side of my vehicle. I lost control of my car, almost flipped and thought it was a blowout, while trying to come to a stop on the highway and nowhere to pullover. 18wheelers all  around me and I had no choice but to stop on left small shoulder.  At this time we realized that my tire had not blown, but ALL the Tread had separated from the tire. It had separated and this caused roughly 6feet of extreme whipping of tread while separating from the tube part of tire was beating my car in multiple areas under the car, damaged and took off half of my bumper, tore up the passenger side back and front door while causing large dents.  I called a tow truck while my daughter called my husband to help us. Tow driver stated he hadn’t seen that happen and we were very lucky something catastrophic didn’t happen,  Myself and my daughters life was in great risk!! We almost flipped the car due to tire separation, and we could’ve caused a multi car accident!   My car had to go to the collision center ( Caliber Collision ) which is a vendor my insurance company works with - they have taken multiple photos of the damage. I have also taken multiple photos of damage.   It has not been inspected by authorities etc… yet.  No warning lights representing tire pressure, concerns etc….were alerting me of anything to be concerned of.  The interior passenger airbag light was stating airbag was off - which caused for more concern ( I am driving a 2016 Audi A3 with a National recall & no fix!! ) with if we would’ve crashed, rolled, wrecked into someone/something that the airbags would’ve potentiality not gone off to protect my daughter or myself!",
        "vin": "WAUB8GFF5G1"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433557,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I have filed multiple complaints with you all regarding my concern for safety and anxiety each time I get behind the wheel of my car.  I contacted Audi, National, local dealer and no help with National safety recall.  My car has been presenting random electrical concerns. It has shown numerous check engine lights telling me to shut engine down immediately, my AC will shut off, my speed declines at times and becomes almost as if I’m losing control of the car. It has done this at a stop and also on the highway going 75.  I have had to pullover many times. I am so scared something is going to happen.  I took to Audi after calling numerous times about recall and how the electrical has got to be a part of this National recall and they stated “ yes, that’s cannot be ruled out “ but they would not fix under recall more could they fix anything with the National recall they’ve had for years!  They have stopped making all A 3’s and pulled them all off the lots! This is huge and tells me it is VERY serious and something has to be done!!!  I recently got my car back from a collision center from driving to see a patient going 75 in the fast lane when we feel the car shaking out of control, I’ve lost control of the vehicle and we are in the far left lane with nowhere to go but into a 18wheeler! We had nowhere safe to go! It happened so fast that I’m screaming snd praying God please take the wheel!!  My tire tread completely separated from my right rear side and caused about 6feet of tread whipping the car underneath and along the passenger side doors, windows etc… it was horrific and I’m terrified to drive!!  My daughter was in the passenger seat and the air bag was not working when we were able to come to a stop on the shoulder! We had to be towed and tread was everywhere! I didn’t know at that time what happened!   I thought it was a blowout, it was the tread came completely off the rubber! We almost flipped!  My fear!!! We could’ve died - I cannot wait for next time!!",
        "vin": "WAUB8GFF5G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433413,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The passenger air bag keeps going off every time one of my kids is sitting in the front.  I can not afford to leave that seat unoccupied since I have four children and the front seat is always occupied.  There is no solution to the air bag problem.",
        "vin": "waua7gff0g1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432451,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI BATON ROUGE INFORMED ME THERE IS A PROBLEM WITH COOLANT MIGRATION AT COOLANT TANK CONNECTOR (COOLANT COULD LEAK INTO WIRE HARNESS) AND CAUSE SEVERE DAMAGE TO ELECTRICAL SYSTEM WANT $300 +_ TO REPAIR. SINCE THIS IS NOT SOMETHING CAUSED UNDER NORMAL CONDITIONS OR NEGLIGENCE ON MY PART I DO NOT FEEL I SHOULD BE RESPONSIBLE FOR COST OF REPAIR, SHOULD BE A RECALL ON AUDI",
        "vin": "WAUA7GFF2G1"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431217,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A3. The contact stated that the check engine warning light was illuminated. The contact received notification of NHTSA campaign numbers: 21V198000 (Air Bags) and 19V474000 (Air Bags) however, the part to do the recall repair was unavailable. The vehicle was taken to the local dealer who declined to repair the vehicle for unknown reasons however, the dealer received payment. The vehicle was not diagnosed or repaired. The vehicle was taken to an independent mechanic where the contact was informed that the ignition coil needed to be replaced. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the failure however, no further assistance was provided.  The failure mileage was approximately 84,000. VIN tool confirms parts not available for NHTSA campaign number: 21V198000 (Air Bags) and Parts distribution disconnect for NHTSA Campaign Number: 19V474000 (Air Bags).",
        "vin": "WAUB8GFF2G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427865,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Takata recall. The contact owns a 2016 Audi A3. The contact received notification of NHTSA campaign number: 21V198000 (Air Bags) however, the part to do the recall repair was unavailable. The contact called the local dealer who stated the parts were not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware if the issue. The contact had not experienced a failure. Vin tool confirms parts not available.",
        "vin": "WAUTPBFF9GA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424486,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Audi has not responded to this Recall in a prompt manner. I was in the process of selling my Audi A3 but I cannot due to this. I took my car in to have this issue addressed in December 2019 and now I am learning that there is still a problem with the Passenger Occupant Detection System (PODS) and Audi has no solution. They have known about this issue since March 2021.",
        "vin": "WAUA7GFF9G1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/04/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423391,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "There has been a National recall on my VIN with no known fix at this time. My car has stalled, would not cool off, it will read error codes that don’t make any sense. It goes from speed, to shut engine off now, immediately exit and turn off vehicle, saying it’s too Hot, oil leaking, airbag lights coming on/off randomly, the air  conditioner won’t cool off when the dash lights are reading multiple codes and I’ve had to stop my car multiple times on the highway and when just running to the store a few miles away. It’s very strange and concerning. It’s becoming for frequent and I drive every day all day for work, along with having children in my car. I purchased this brand new from Audi of Fort Worth Texas in 2016. All routine maintenance has always been done. My concern for myself and children has increased over the last few months and each time I have to get in my car I have a fear that overwhelms me! I’ve contacted the Audi dealership multiple times and they’ve said I need to be patient, there is no fix at this time and they don’t know if/when there will be one. This is not acceptable and is putting our lives at risk on a daily basis. I would like to know my options and their legal responsibility to help the situation. I will notate the most recent date of occurrence below. The pictures I’ve uploaded are from the most recent experience when leaving a Sam’s grocery club and had just turned from a red light on a main road. I had to stop my vehicle, shut off the engine and remain in a center lane dangerously fast traffic all around me and had to call my son to pick me up.",
        "vin": "WAUB8GFF5G1"
    },
    {
        "components": "AIR BAGS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423259,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Audi A3. The contact received recall notifications for NHTSA Campaign Number: 19V474000 (Air Bags) and 21V198000 (Air Bags) however, the part to do the recall repair was not available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repairs. The manufacturer was made aware of the issue and a case was filed. The manufacturer referred the contact to the dealer for assistance. The contact stated that when the vehicle was started, the hood ajar warning light was illuminated. The contact inspected the hood and became aware that the hood was securely closed. The vehicle was taken to the dealer where it was diagnosed with a faulty hood switch. The vehicle was not repaired. The manufacturer was not made aware of the failure. The approximate failure mileage was 31,300. VIN tool confirms parts not available.",
        "vin": "WAUB8GFF5G1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422712,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I have contacted Audi USA several times regarding the recall on my Audi A3 2016 but it seems that they don't care about the issue and asked me to drive it and nothing will happen.",
        "vin": "WAUB8GFF4G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "04/04/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421740,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I have received this recall infirmation multiple times with no remedy listed. The warning lights are constantly going on and off which is unnerving not knowing whether my passenger is protected. I drive for a living. It’s affecting my livlihood.",
        "vin": "WAUA7GFF7G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419440,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was recently made aware of a nationwide safety recall for all Audi A3’s 2016 to present.  I received a mailer with safety concern and warning for this recall. Audi has not been able to identify the root cause and believe it is more than just the initial air bags/PODS system in the vehicle.  This has been in place for some time after I researched the site checking for updates to repair.  I am very concerned for my safety along with my families safety when driving my car. My car is the primary vehicle. I use my car for work daily and do not feel comfortable.   I am not 100% sure on initial date Audi identified this problem, but it appears earlier this year and it was the second recall for the same issue. They have no fix at this time.   I did run my VIN to determine mine being affected and it is. The campaign number on site for this is:  NHTSA’s campaign number: 19V474",
        "vin": "WAUB8GFF5G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/08/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415696,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I CONTACTED AUDI TO FIX THE SAFETY RECALL ON MY CAR, BUT THEY DON'T HAVE THE FIX AND ASKS ME TO DRIVE IT. I DO BUSINESS ON THE CAR AND HAVE FACED LOSS OF INCOME DUE TO THE RECALL.",
        "vin": "WAUB8GFF4G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413477,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN OPEN SAFETY RECALL ON MY CAR, THE MANUFACTURER DOESN'T HAVE THE FIX AVAILABLE. I USE MY CAR TO DRIVE FOR LYFT/UBER AND IF THE SAFETY RECALL IS NOT FIXED I WILL NOT BE ABLE TO DRIVE, HENCE RISK OF LOSING MY INCOME AND WILL BE OUT OF WORK, HOWEVER, I CONTACTED AUDI TO FIX MY CAR, THEY SAID THERE IS NO FIX AVAILABLE AND I CAN CONTINUE TO DRIVE THE CAR, LYFT/UBER ISSUED ME A WARNING THAT EFFECTIVE MAY 1, I WILL BE UNLISTED IF THE SAFETY RECALL IS NOT FIXED.",
        "vin": "WAUB8GFF4G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405759,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A3 QUATTRO 2016 MALFUNCTION INDICATOR LAMP (MIL) CAME ON WHILST DRIVING SLOWLY IN TRAFFIC.    I BELIEVE THE VERSION OF THE ECM IN MY VEHICLE IS DEFECTIVE AND MAY BE RELATED TO \"SAFETY RECALL 24DF\":    HTTPS://STATIC.NHTSA.GOV/ODI/RCL/2017/RCONL-17V508-5502.PDF  HTTPS://STATIC.NHTSA.GOV/ODI/RCL/2017/RCAK-17V508-2021.PDF    CROSS REFERENCING \"APPLICATION FOR EMISSIONS CERTIFICATION  2016 MODEL YEAR\" \"TEST GROUP: GVGAV02.0APA\", IN PARTICULAR PAGE 79 FOR MY ENGINE CODE \"CNTC\" WHICH LISTS SOFTWARE ID \"5G0906259L\":    HTTPS://IASPUB.EPA.GOV/OTAQPUB/DISPLAY_FILE.JSP?DOCID=43249&FLAG=1    THE ECU PART NUMBER WAS SUPERSEDED WITHOUT BEING PROPERLY RELEASED FOR EDIR OR CAL ID AND CVN INFORMATION.    PLEASE NOTE THE DIFFERENCE IN PART NUMBER SUFFIX. \"B\" VS \"L\".    I AM CONCERNED THAT MY CAR IS CURRENTLY DANGEROUS TO DRIVE AND NEEDS REPAIRING.    BELOW IS OUTPUT FROM VCDS DIAGNOSTIC TOOL SHOWING THE FAULT AND ECU SOFTWARE ID \"5G0 906 259 D\" 0001 (FULL OUTPUT CAN BE PROVIDED):    -------------------------------------------------------------------------------  ADDRESS 01: ENGINE (J623-CNTC)       LABELS:. 06K-907-425-V1.CLB     PART NO SW: 5G0 906 259 D    HW: 06K 907 425 B     COMPONENT: 2.0L R4 TFSI  H13 0001     REVISION: --H13---       CODING: 0A1D00124426000F2000     SHOP #: WSC 06385 790 00016     ASAM DATASET: EV_ECM20TFS0205G0906259D 001002     ROD: EV_ECM20TFS0205G0906259D.ROD     VCID: 2F3B1884879B11D3269-807A    1 FAULT FOUND:  15059 - FUEL RAIL/SYSTEM PRESSURE            P0087 00 [104] - TOO LOW            INTERMITTENT - CONFIRMED - TESTED SINCE MEMORY CLEAR               FREEZE FRAME:                      FAULT STATUS: 00000001                      FAULT PRIORITY: 2                      FAULT FREQUENCY: 2                      MILEAGE: 119924 KM                      DATE: 2021.03.17                      TIME: 12:39:23",
        "vin": "WAUB8GFF2G1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405299,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL   THE CONTACT OWNS A 2016 AUDI A3. THE CONTACT STATED THAT WHILE ATTEMPTING TO START THE VEHICLE, AN ABNORMAL RUMBLING SOUND WAS PRESENT COMING FROM THE ENGINE. THE VEHICLE FAILED TO IMMEDIATELY START-UP. ADDITIONALLY, WHILE ATTEMPTING TO REFUEL THE VEHICLE, THE NOZZLE WOULD CONTINUOUSLY CLICK OFF. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER REEVES AUDI LOCATED AT 105 E FOWLER AVE, TAMPA, FL 33612 AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE HOWEVER, NO ASSISTANCE WAS OFFERED. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN THE NHTSA CAMPAIGN NUMBER 16V647000 (FUEL SYSTEM, GASOLINE, ENGINE AND ENGINE COOLING). THE CONTACT STATED THAT THE VEHICLE HAD EXPERIENCED THE FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 45,093.",
        "vin": "WAUJ8GFF9G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394783,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY CAR IN A FEW WEEKS AGO FOR A RECALL REPAIR AFFECTING THE PASSENGER AIRBAG. THE AIRBAG WAS NOT ABLE TO SENSE WHEN THERE WAS A PASSENGER IN THE VEHICLE, AND WOULD RANDOMLY TURN ON/OFF EVEN WHEN THERE WAS A PASSENGER IN THE VEHICLE. HAD THE ERROR MESSAGES POP IMMEDIATELY ON THE WAY HOME FROM THE DEALER AFTER THEIR \"FIX\". I TOOK IT BACK IN TODAY AND THEY DEALER SAID IT WAS THE ACTUAL PODS SENSOR AND IT WOULD COST $1,100 TO REPAIR! THIS WAS BECAUSE THE RECALL REPAIR ONLY INCLUDED THAT WIRE CONNECTION. I DRIVE MY YOUNGER BROTHER TO SCHOOL EVERY DAY AND DO NOT THINK IT'S FAIR THAT AUDI'S RECALL ONLY FIXED HALF THE PROBLEM - NOW THERE'S NO WAY TO TELL IF THE AIRBAG IS WORKING PROPERLY AND IF MY BROTHER OR ANY OTHER PASSENGER IS SAFE IN THE CAR.",
        "vin": "WAUA7GFF8G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388378,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT IN TO GET THE PODS CONNECTOR RECALL WORK DONE. BEFORE THIS WORK WAS DONE THE PASSENGER AIRBAG WOULD GO ON AND OFF INTERMITTENTLY, HOWEVER, NOW THE PASSENGER AIRBAG IS ALWAYS OFF. THEY ARE SAYING THAT THE CONNECTOR IS A SEPARATE PROBLEM FROM THE WEIGHT SENSOR. THE PODS SYSTEM HAS BEEN RECALLED IN OTHER AUDI MODELS FOR THIS VERY PROBLEM.",
        "vin": "WAUB8GFF1G1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372945,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AIR BAG IS PERMANENTLY DISABLE, EVEN WHEN A PASSENGER IS SEATED ON IT- IT APPEARS THE SENSOR UNDER THE SEAT DOES IS NOT WORKING PROPERLY. THIS IS CRITICAL MALFUNCTION AS THE PASSENGER WILL NOT BE PROTECTED IN A COLLISION CASE. ADDITIONALLY, THE SEATBELT LIGHT COMES ON TO FASTEN SEATBELT EVEN WHEN NO ONE IS SAT ON THAT SEAT AND WON'T GO AWAY UNTIL THE BELT IS FASTEN. I HAVE BEEN WAITING FOR AUDI TO INCLUDE MY VEHICLE IN THE CURRENT NATIONAL RECALL TO FIX THAT PROBLEM.",
        "vin": "WAUUPBFFXGA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372933,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT IS ON, IT BEEPS A WARNING, THE MESSAGE 'AUDI PRE SENSE SYSTEM FAULT' AND THE 'PASSENGER AIRBAG IS OFF' LIGHT IS ON WHEN THERE IS SOMEONE IN THE SEAT. THIS IS INDICATING THAT THE AIRBAG SAFETY SYSTEM IS NOT FUNCTIONING. THE DEALER HAS STATED THAT THERE ARE NO OPEN RECALLS FOR THE VEHICLE. THE WARNINGS ARE VISIBLE WHILE PARKED (STATIONARY) AND WHILE DRIVING (IN MOTION) AND ALSO THE SAME WITH THE WARNING BEEPS; WHILE PARKED AND WHILE DRIVING.",
        "vin": "WAUTPBFF6GA"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365628,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CUTS ON WITH OVERHEATING AND EPS ERROR WHEN STARTING CAR SOMETIMES. WHEN YOU SHUT OFF CAR IT CUTS OFF AND RETURNS TO NORMAL. IT STARTED LAST YEAR AND HAS CONTINUED, I WAS TOLD IT MAY BE A SENSOR SHORTAGE.",
        "vin": "WAUA7GFF4G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360733,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN A PERSON OR ITEM IS IN THE FRONT PASSENGER SEAT THERE WILL BE AN INTERMITTENT ERROR AND THE PASSENGER SIDE AIRBAG WILL DISABLE. IT DOESN'T HAPPEN EVERY TIME BUT AS TIME GOES ON IT HAPPENS MORE OFTEN.. I'VE CONTACTED 'AUDI CHATTANOOGA' ABOUT THE ISSUE AND THEY SAY A RECALL TO FIX SAID PROBLEM HAS ALREADY BEEN COMPLETED YET THE PROBLEM PERSISTS.",
        "vin": "WAUE8GFFXG1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/13/2020",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354758,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM EXPERIENCING ISSUES WITH THE PASSENGER SEAT AIRBAG. AIRBAG IS DISABLE WHEN PASSENGER IS SAT ON THE SEAT. ADDITIONALLY, THE SEATBELT SENSOR CALLS FOR FASTENING WHEN NO ONE IS SAT ON THE SEAT, PASSENGER SIDE AS WELL. I BELIEVE MY VEHICLE IS EXPERIENCING ISSUES ALREADY ACCOUNTED FOR IN THE MOST RECENT RECALL.",
        "vin": "WAUUPBFFXGA"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354193,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AN IMPROPER ELECTRICAL CONTACT MAY CAUSE THE PASSENGER OCCUPANT DETECTION SYSTEM (PODS) TO FALSELY DETECT A MALFUNCTION AND DEACTIVATE THE PASSENGER AIR BAG. THE DEALERSHIP WILL SAY THEY FIXED IT BUT SHORTLY AFTER THE PASSENGER AIRBAG AND SEATBELT SIGN GOES OFF AGAIN BEEPING AND ADVISING YOU THE PASSENGER SEATBELT IS NOT ON. WHEN YOU HAVE NO PASSENGER.THIS IS A SAFETY HAZARD AND THE DEALERSHIP CANNOT FIX THE ISSUE. THEY ARE INCOMPETENT AND DO NOT CARE ABOUT THE SAFETY OF THE VEHICLE DRIVERS. IF IT IS SAYING THE AIRBAG IS OFF WHAT WILL HAPPEN IF THERE IS AN ACCIDENT AND THE AIRBAG DOESN'T GO OFF DUE TO THIS RECALL. THIS IS NEGLIGENCE ON THE DEALERSHIP/AUTOMAKER.",
        "vin": "WAUB8GFF2G1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "05/29/2020",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331785,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A3. THE CONTACT STATED THAT WHILE DRIVING AT 20 MPH, HE NOTICED A BURNING SMELL IN HIS VEHICLE. THE CONTACT PARKED HIS VEHICLE IN HIS DRIVEWAY AND OPENED THE HOOD WHEN FLUIDS BUBBLING WHERE COMING FROM ONE OF THE COOLANT RESERVOIRS AND THE BURNING ODOR WAS COMING FROM THE PASSENGER SIDE COMPARTMENT. THE DEALER AUDI BOISE (8400 W FRANKLIN RD #1, BOISE, ID 83709 208-377-5400) SUGGESTED THE VEHICLE BE TOWED WHERE THE VEHICLE REMAINED FOR A FEW WEEKS AND NO FAILURE WAS DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED A CASE NUMBER. THE FAILURE MILEAGE WAS 19,500.",
        "vin": "WAUVPBFF7GA"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326383,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS ON AND SEAT BELT LIGHT IS ON. ERROR MESSAGE ON DASHBOARD: SAFETY SYSTEM: SYSTEM FAULT. CAR HAD A RECALL FOR SIMILAR ISSUE ON JANUARY 2020. TOOK TO THE DEALERSHIP AND WANT TO REPLACE A SENSOR FOR $1300. DEALERSHIP STATED IS NOT THE SAME ISSUE RELATED TO THE RECALL. THIS IS A SAFETY ISSUE. CAR IS NOT UNDER WARRANTY ANYMORE.  *TR  *BF   UPDATE: THE CAR WAS INVOLVED IN A COLLISION WHILE PARKED IN FRONT OF THE CONTACT'S APRTMENT. THE AIR BAGS DID NOT DEPLOY. *AS",
        "vin": "WAUA7GFF1G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315320,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 AUDI, CONSUMER WRITES IN REGARDS TO PASSENGER OCCUPANT DETECTION SYSTEM. *LD    THE CONSUMER CONTACTED THE DEALER TO MAKE A REPAIR FOR RECALL 69Z4. NO ASSISTANCE WAS OFFERED. THE MANUFACTURER WAS NOTIFIED, BUT DID NOT OFFER ANY ASSISTANCE. *JS",
        "vin": "WAU67LFF2G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310883,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE SEAT POD RECALL REPAIR MADE ON MY CAR AND THIS DID NOT FIX THE PROBLEM OF THE INDICATOR GOING OFF AND A NOTICE ON THE DASH OF \"AUDI PRE-SENSE: SYSTEM FAULT!\" NOTICE.  IN OTHER WORDS, THE PROBLEM OF A FAULTY AIRBAG CONNECTOR WIRE WAS NOT SOLVED BY A WIRE REPLACEMENT.  I WAS TOLD THAT THE SEAT-OCCUPIED WEIGHT SENSOR WAS PROBABLY BAD - FROM DEALER BUT NOT COVERED UNDER THE WARRANTY.",
        "vin": "WAUJ8GFF2G1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297295,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I CANT GET GAS , IT GOES OUT OF THE TANK",
        "vin": "WAUA7GFF0G1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "12/07/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288953,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS GARAGED AND FUNCTIONING UNDER NORMAL CONDITIONS. APPX. 64000 MILES.    WHEN THE CAR WAS TURNED ON AND PUT IN REVERSE, THE REARVIEW CAMERA'S VIEW WAS MODERATELY VISIBLE, BUT GARBLED PAST ANY USEFUL VIEW.  THIS DID APPEAR TO HAPPEN AFTER THE TRUNK WAS SIMPLY OPENED AND SHUT BEFORE GETTING IN THE CAR, ALTHOUGH THAT SHOULD HARDLY AFFECT THE ABILITY FOR THE CAMERA TO WORK OR NOT.    THE NEXT TIME I STARTED THE CAR, I DID NOT OPEN THE TRUNK, AND THE PROBLEM PERSISTED.  THE TIME AFTER THAT, I OPENED THE TRUNK AND SHUT IT AND IT WENT AWAY.  THEN IT CAME BACK. THIS HAS BEEN GOING ON FOR OVER 2 MONTHS NOW AND WOULD APPRECIATE SOME RESOLUTION. TOO EARLY FOR SIMPLE ELECTRONICS LIKE A CAMERA TO BE BREAKING, HOWEVER, CHECKING OTHER AUDI VEHICLES TSBS INDICATES THIS PROBLEM IS COMMONPLACE AND REPAIR WORK HAS BEEN PRESCRIBED IN THE PAST TO REPLACE THE WIRING HARNESS AND/OR THE CAMERA.    IF THE CAMERA IS NOT WORKING PROPERLY, IT COULD CREATE AN UNSAFE SITUATION WHILE DRIVING IN REVERSE THAT THE USE OF THE CAMERA IS SUPPOSED TO PREVENT - I.E. A CRASH OR ACCIDENT WITH A PEDESTRIAN.",
        "vin": "WAUUPBFF9GA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265720,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY. ALL OF A SUDDEN I HEARD A LOUD SOUND AND THE SUNROOF SHATTERED. IT WAS A SUNNY DAY AND THERE WAS NOT MUCH TRAFFIC ON THE FREEWAY. THE SUNROOF SHADE WAS DRAWN SO IT CAUGHT GLASS THAT COULD HAVE FALLEN INSIDE THE CAR. THERE WERE NO OTHER OBJECTS CAUGHT IN THE SHADE, ONLY GLASS. I DON'T THINK IT WAS POSSIBLE THAT ANYTHING HIT THE SUNROOF. I DID NOT SEE ANYTHING, THERE WASN'T TRAFFIC OVERHEAD, AND THERE WEREN'T ANY LARGE VEHICLES NEAR MY CAR. THE SUNROOF JUST SUDDENLY SHATTERED WITH A LOUD SOUND.",
        "vin": "WAUJ8GFF3G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256484,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 AUDI A3 THAT HAS A CURRENT RECALL ON THE (PODS) SYSTEM AND THE DEALER AND AUDI USA TELLS ME THEY DO NOT HAVE THE PARTS AND HAVE NO IDEA WHEN IT WILL BE AVAILABLE!  I DRIVE AND PICK UP MY 15 YEAR OLD GRANDSON TO SCHOOL EACH DAY AND I AM FEAR-FULL  AUDI MUST BE MADE TO COME UP WITH THE PARTS.  WHAT GOOD IS A RECALL BY NHTSA IF NOTHING GETS COMPLETED??",
        "vin": "WAU67LFF4G1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230233,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS CAR DECEMBER OF 2018 (6 MONTHS AGO), VEHICLE STILL UNDER WARRANTY. LATE JAN (A MONTH AFTER PURCHASE), WHILE DRIVING ON THE ROAD, THE LEFT SIDE BUMPER GRILLE, A LARGE PLASTIC PIECE FELL OFF. I THOUGHT IT WAS A FLUKE, SO I PURCHASED A REPLACEMENT PART AND PUT IT BACK INTO THE BUMPER. A MONTH LATER IN LATE MARCH, THAT SAME PIECE FELL OFF AGAIN WHILE I WAS DRIVING ON THE FREEWAY, CAUSED A LARGE BOOM NOISE AND WAS A HAZARD TO OTHER VEHICLES DRIVING AT HIGH SPEEDS ON THE FREEWAY. I TOOK IT BACK TO THE DEALER AND THEY REPLACED THE PART AGAIN. FAST FORWARD TO JUNE, THIS SAME PART ON THE RIGHT SIDE FELL OFF AGAIN WHILE DRIVING ON THE FREEWAY AND CAUSING THE SAME ROAD HAZARD FOR ALL VEHICLES. IN SUMMARY, WITHIN A SPAN OF 6 MONTHS THIS PART HAD FELL OFF 3 TIMES. THIS IS A DESIGN FLAW IN THE BUMPER DESIGN OF THIS CAR AND NEED TO BE INVESTIGATED, OTHERWISE IT'S A MAJOR ROAD HAZARD TO HAVE CAR PARTS FALLING OFF AND FLYING ON THE FREEWAY.",
        "vin": "WAUA7GFF9G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "02/16/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185773,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VW BOUGHT BACK MY 2016 A3 TWO YEARS AGO BUT I'M STILL RECEIVING THE RECALL INFORMATION.",
        "vin": "WAUBJNBFM5B"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162057,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS AFTER RUNNING, STALLS AT INTERSECTIONS. NO WARNING LIGHTS SHOW ON THE DASH AND RESTART IS NOT IMMEDIATE. LAST EVENT WAS IN CITY STOPPED AT STOP SIGN, STALLED WHEN ATTEMPTED TO ACCELERATE. SAME SYMPTOMS AS IN RECALL 17V508000. THIS HAS HAPPENED NO FEWER THAN 20 TIMES OVER THE LAST 2 YEARS. TODAY'S DATE DOCUMENTED TODAY.",
        "vin": "WAU78LFF8G1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/01/2018",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154777,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A3. WHILE OPERATING THE VEHICLE, THE CHECK ENGINE INDICATOR REMAINED ILLUMINATED. ALSO, AN ABNORMAL CLICKING NOISE AND SMOKE WERE PRESENT COMING FROM THE ENGINE. THE VEHICLE WAS TAKEN TO THE DEALER (FLETCHERS JONES AUDI CHICAGO, 1111 N. CLARK ST, CHICAGO, IL) WHERE IT WAS DIAGNOSED THAT THE EXHAUST WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 3. *TT  CONSUMER HAS STATED THE PROBLEM IS STILL OCCURING AND SMOKING IS GETTING WORSE. DEALER REFUSES TO REPLACE OR REPAIR THE VEHICLE.*JB",
        "vin": "WAUA7GFF7G1"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "01/28/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067212,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE I HAVE EXPERIENCED THE RANDOM LOSS OF POWER.   THE FIRST TIME OCCURRED ON A LOCAL STREET, DRIVING APPROXIMATELY 40 MPH, AND ALL OF A SUDDEN THE VEHICLE STUTTERED AND LOST POWER. IT APPEARED AS IF THE VEHICLE WAS SLOWING DOWN, NOT EVEN COASTING BUT SLOWING DOWN CONSIDERABLY.  I WAS REQUIRED TO PULL ONTO A SIDE ROAD.  I RESTARTED THE CAR AND THE ISSUE DISAPPEARED.     THE SECOND TIME OCCURRED ON THE HIGHWAY DRIVING IN THE LEFT LANE AT APPROXIMATELY 70 MPH.  SAME ISSUE, CAR STUTTERED AND THEN LOSS POWER.  THE CAR'S SPEED SLOWED CONSIDERABLE FAST, FROM 70 TO 30 IN APPRXIMATELY 5-7 SECONDS. WITH THE INABILITY TO ACCELERATE ON A THREE LANE HIGHWAY, IT WAS DIFFICULT TO MAKE MY WAY TO THE SHOULDER ON THE RIGHT SIDE OF THE ROAD.  AFTER THE STUTTER, YOU CAN PRESS THE GAS PEDAL AND NOT ACCELERATION IS EXPERIENCED.  I DID NOT NOTICE ANY WARNING LIGHTS ON THE INSTRUMENT PANEL.    BROUGHT THE VEHICLE TO AUDI TO ADDRESS THIS ISSUE, AND THEIR RESPONSE WAS \"WE DON'T SEE ANY FAULT CODES, THEREFORE WE HAVE NO RECORD OF IT HAPPENING\", AND SENT ME OFF WITH A \"GOOD LUCK\"     VEHICLE HAD APPRXIMATELY 12,000 MILES AND 15,000 MILES WHEN ISSUES OCCURRED.   ALL DEALER RECOMMENDED MAINTANENCE WAS PERFORMED.",
        "vin": "WAUA7GFF1G1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "09/05/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021558,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A QUESTION THAT I WAS HOPING YOU COULD HELP ME WITH. MY FAMILY AND I HAVE BEEN LOYAL AUDI CUSTOMERS FOR OVER 15 YEARS AND WE HAVE PURCHASED MANY MANY VEHICLES FROM AUDI. ONE CAR THAT WE CURRENTLY HAVE IS A 2016 AUDI A3 CONVERTIBLE. WHEN THE CAR IS PUT IN \"R\" (REVERSE) THE CAR GOES FORWARD BEFORE GOING BACKWARD. THE CAR GOES FORWARD QUITE A BIT AS WELL, IF IT WAS JUST A FEW INCHES THEN I WOULDN'T HAVE AN ISSUE WITH IT BUT LIVING IN LOS ANGELES I HAVE TO STREET PARK AND PARALLEL PARK OFTEN THEREFORE IT IS VERY DANGEROUS THAT THIS IS HAPPENING. I TOOK IT INTO THE DEALERSHIP AND THEY STATED THAT THIS IS NORMAL AND IT DOES THIS BECAUSE ITS A 4 CYLINDER. I FIND THIS TO BE RATHER ODD. I HAVE NEVER HEARD OF A CAR GOING FORWARD BEFORE GOING BACKWARD WHEN PUT IN 'R\".THE CAR IS IN GREAT CONDITION, NEVER BEEN WRECKED OR INVOLVED IN ANYTHING. I HAVE TRIED HOLDING THE BREAK BEFORE PUTTING IT IN \"R', I HAVE TRIED REVERSING THE CAR WITH EMERGENCY BREAK ON AND OFF, ON A HILL AND ON FLAT LAND. THE RESULT IS ALWAYS THE SAME. COULD YOU PLEASE INFORM ME ON YOUR THOUGHTS OR ADVICE. THE DEALERSHIP SAYS ITS NORMAL AND THE CAR IS FINE THEREFORE I AM WRITING YOU. ALL THE CARS WE HAVE OWNED FROM AUDI: Q5, Q7, A7, A8 HAVE NOT DONE THIS.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021593,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A3. WHEN PLACING THE VEHICLE IN REVERSE, THE VEHICLE WOULD LUNGE OR ROLL FORWARD BEFORE REVERSING. THE MANUFACTURER AND AN UNKNOWN DEALER WERE CONTACTED, BUT COULD NOT PROVIDE A REMEDY. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "WAU67LFF2G1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/26/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019857,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3 ETRON",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI ETRON SUNROOF EXPLODED WHILE DRIVING.  WHILE FUTZING WITH THE WINDOWS TRYING TO STOP THE \"WOOP WOOP WOOP\" AIR PRESSURE THING THAT HAPPENS WHEN THE WINDOWS ARE PARTIALLY OPEN, THE SUNROOF EXPLODED OUT OF THE CAR.   SOUNDED LIKE A GUNSHOT, HAPPENED IN A SPLIT SECOND, SCARED THE BEJESUS OUT OF ME.  THE ENTIRE CENTER OF THE SUNROOF DISAPPEARED INSTANTLY.   THE DEALER SAYS TO REPLACE IT MIGHT TAKE WEEKS, AND COST THOUSANDS.  APPARENTLY, THEY HAVE TO REPLACE ALL OF THE GLASS ON THE ROOF, TAKE OFF THE DOORS, AND GUT THE INTERIOR ROOF.  ARGH",
        "vin": "WAUUPBFF5GA"
    },
    {
        "components": "EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "12/12/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011845,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A-RECALL SUCTION PUMP   SMELL INSIDE CAR LEAK VAP SYSTEM GAS   A-RECALL SIDE MARKER LIGHTS",
        "vin": "WAUA7GFF7G1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002951,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A CPO 2016 A3 1.8T FROM AUDI OF PALO ALTO ON MAY 20, 2017 WITH A LITTLE UNDER 19100 MILES. GREAT FAST CAR. UNTIL JUNE 17, 2017 WHEN IT HAD 19878 MILES. THE CAR STARTED TO STUTTER/SPUTTER/JERK WHILE ON THE FWY. I WAS GOING ABOUT 50-60MPH ON THE FWY, CRUISING, AND THEN IT STUTTERED. IT LOST THE POWER TO ACCELERATE TO KEEP UP THE FWY PACE AND IT SLOWED DOWN CONSIDERABLY SO I PULLED OVER. I HAD IT TOWED TO THE NEAREST DEALER (AUDI OF CONCORD). IT WAS THERE FROM 6/17 TO 6/29. DEALER SAID IT HAD A FAULTY TURBO, STATING THE WASTEGATE FAILED, SO THEY REPLACED THE ENTIRE TURBO. I GOT THE CAR BACK WITH ABOUT 20072 MILES, SO APPARENTLY THEY DID SOME ROAD TESTS.    YESTERDAY, JULY 3, 2017, WHILE PICKING UP SOME GIFTS FOR MY DAUGHTER'S BIRTHDAY, THE ISSUE CAME BACK AGAIN. THIS TIME, MY WIFE AND 2 SMALL CHILDREN WERE IN THE CAR. WE WERE CRUISING AROUND 60-65 MPH. IT WAS SCARIER AS I HAD TO THINK FOR THEIR SAFETY FIRST AND FOREMOST. IMAGINE A CAR THAT SUDDENLY LOST ACCELERATION POWER ON THE FREEWAY AT AROUND 6:30PM. WE EASILY COULD HAVE GOTTEN REAR-ENDED.    ANYWAY, I RESEARCHED ON AUDI'S RELIABILITY AND DID READ ON SOME COMMENTS ABOUT HOW LOUSY THEY ARE. I GAMBLED AND DECIDED TO BUY ONE ANYWAY. BOY DID I LOSE BIG. AT THIS POINT, I'D RATHER HAVE A KIA OR CHEVY.",
        "vin": "WAUA7GFF4G1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000378,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 50-60 MPH ON THE FWY WHEN ALL OF A SUDDEN THE CAR STARTED TO JERK/STUTTER AND THEN IT LOST SPEED. THE JERKING IS SIMILAR TO A NEW DRIVER LEARNING HOW TO DRIVE A MANUAL TRANSMISSION WHERE YOU'RE THROWN FWD AND BACK SOMEWHAT VIOLENTLY.  AS I TRIED TO ACCELERATE BACK TO FWY SPEED, IT WOULDN'T ACCELERATE. IT KEPT SLOWING DOWN INSTEAD. NO CEL ILLUMINATED. I DECIDED TO EXIT AND PULLED INTO A PARKING LOT.",
        "vin": "WAUA7GFF4G1"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2017",
        "dateOfIncident": "04/25/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984399,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVED TWO SAFETY RECALLS FROM AUDI: NHTSA RECALL #16V647 AND #16V642. WE WERE INFORMED BY AUDI THAT THE SERVICE WOULD HAVE TO BE COMPLETED BY AN AUTHORIZED AUDI DEALER.   THE CLOSEST AUDI DEALER IS IN HONOLULU, WHICH WOULD REQUIRE US TO SHIP OUR CAR FROM MAUI. GIVEN THIS WAS AN AUDI RECALL, IT WAS MY EXPECTATION THAT THEY WOULD EITHER PAY THE COSTS OR AUTHORIZE THE WORK TO BE DONE ON MAUI BY THE VW DEALER, WHICH IS ONE OF AUDI'S SISTER COMPANIES.  NEITHER RECALL HAS BEEN COMPLETED AS OF TODAY. SINCE THESE ARE SAFETY RECALLS, I WOULD FULLY EXPECT AUDI TO PAY FOR ALL COSTS AS WELL AS THE INCONVENIENCE OF NOT HAVING A CAR FOR AT LEAST A WEEK, DUE TO INTER-ISLAND SHIPPING SCHEDULES.  ALTHOUGH AUDI CLAIMS THEY WOULD CONSIDER COMPENSATING US FOR OUT OF POCKET COSTS, BASED ON A RECENT REPAIR THAT IS COVERED BY OUR WARRANTY, I DO NOT TRUST THAT AUDI WILL COMPENSATE US.  ON APRIL 25, 2017, THE PASSENGER SEAT BELT AND AIR BAG ALERT LIGHTS LIT UP FOR NO REASON. THE OWNER'S MANUAL SAID THAT WHEN BOTH LIGHTS ARE ON, THE OWNER SHOULD GET THE CAR TO A TECHNICIAN IMMEDIATELY. WE HAD THE CAR EVALUATED AND REPAIRED BY THE LOCAL VW DEALER, PAYING FOR IT OUT OF POCKET. ON MAY 1, I CONTACTED AUDICARE TO GET UNDERSTAND THE REIMBURSEMENT PROCESS. I WAS TOLD TO SEND IN THE WORK ORDER AND PROOF OF PAYMENT AND THEY WOULD PROCESS IT UNDER THE WARRANTY COVERAGE. THE CASE NUMBER THEY ASSIGNED US IS CASE NUMBER 170475720. COPIES ARE ATTACHED.  TODAY, MAY 8, I CALLED AUDI TO CONFIRM RECEIPT AND WAS INFORMED THAT THEY ARE NOT GOING TO COMPENSATE US. THEIR REASONING IS THAT BECAUSE THE WORK WAS NOT DONE BY AN AUDI TECHNICIAN, THEY WOULD NOT PAY FOR THE COST. HOWEVER, GIVEN THIS WAS A SAFETY ISSUE RELATED TO A FAULTY AIRBAG SENSOR, WE HAD TO GET THE CAR TO A TECHNICIAN IMMEDIATELY. GIVEN THIS WAS A SAFETY RELATED ISSUE, THERE WAS NO WAY WE COULD SHIP THE CAR TO AN AUDI DEALER ANYWAY.",
        "vin": "WAU67LFF7G1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "02/11/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954252,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3 ETRON",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "225/45R17",
                "type": "Tire"
            }
        ],
        "summary": "CONTINENTAL PROCONTACT 225/45R17 91H   DOT AF7RWBRD4615  RIGHT FRONT TIRE SIDEWALL BLEW OUT AFTER GOING OVER SMALL DRIVEWAY CURB AT VERY LOW SPEED  VEHICLE 2016 AUDI A3 ETRON",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2017",
        "dateOfIncident": "07/25/2016",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948733,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 AUDI A3. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, IT WAS INFORMED THAT THE VEHICLE CAUGHT ON FIRE. IT WAS UNKNOWN HOW THE FIRE WAS EXTINGUISHED. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOTALED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 45,000.",
        "vin": "WAUJ8GFF2G1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "01/11/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944395,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO WARNING, AND NO IGNITION LOCKOUT, WHEN THE ETRON POWER PORT DOOR AND COVER IS LEFT OPEN AT THE FRONT OF THE CAR.  (THE POWER PORT IS HOW TO RECHARGE THE BATTERIES IN THE CAR).  THIS ALLOWS WATER TO BE FORCED INTO THE HIGH VOLTAGE ELECTRICAL SYSTEM WHEN DRIVING IN THE RAIN, WHICH COULD TRIGGER AN ELECTRICAL FIRE OR MALFUCTION IN THE SYSTEM AND POSSIBLY EXPLODE THE LITHIUM ION BATTERIES THAT POWER THE CAR.   THE PROBLEM WAS FIXED ON THE 2017 MODEL, BUT THERE IS NO SOLUTION (YET) FOR A 2016 ETRON ACCORDING TO DEALER.",
        "vin": "WAUVPBFF1GA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2016",
        "dateOfIncident": "04/30/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929393,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS IN REGARDS TO THE A3 E-TRON.  THERE IS A DELAY BETWEEN STARTING THE CAR AND THE CAR BEING ENGAGING THE POWERTRAIN AND BEING \"READY\" TO DRIVE.  DURING THAT DELAY, ONE IS ABLE TO PUT THE CAR IN GEAR BEFORE THE ENGINE IS 'READY'.  THIS CREATES SITUATIONS WHERE YOU CAN PUT THE CAR IN GEAR ON A HILL, AND THE CAR ROLLS BACKWARDS AND YOU DO NOT HAVE STEERING OR POWER BREAKS TO STOP THE CAR.   THE ONLY WAY TO REGAIN CONTROL OF THE CAR IS TO TO PUT YOUR FOOT ON THE BREAK (WITHOUT POWER STEERING), PUT THE CAR IN GEAR, AND POWER CYCLE THE CAR.",
        "vin": "WAUTPBFF3GA"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920211,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 AUDI A3. THE CONTACT STATED THAT THE FUEL PUMP WAS FAILING. THE CONTACT WAS ADVISED TO TAKE THE VEHICLE TO THE DEALER. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN....UPDATED 12/14/16 *BF  UPDATED 08/10/2017*JS",
        "vin": "WAUA7GFF7G1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/12/2016",
        "dateOfIncident": "04/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855077,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "CENTENNIAL TIRES",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SINCE PURCHASING MY AUDI A3 ON 3/26/2016 I HAVE A FLAT TIRES IN 6 DAYS ON 4/2/16. CAR TIRES ARE OEM AND ARE CONTIPROCONTACT 225/40 18 92H. TIRE FAILURES HAD HAPPENED AT LOW SPEED (20-30 MPH) GOING OVER A POTHOLE. HOWEVER, I HAVE DRIVEN ON THESE SAME CANTON ANN ARBOR ROADS FOR 5 YEARS AND NEVER HAD TIRE DAMAGE FROM A POTHOLE BEFORE. I CONTACTED SEVERAL COMPANIES FOR TIRE REPLACEMENT AND ALL OF THEM SAID THAT THEY DON'T HAVE THESE TIRES IN STOCK AND THESE ARE DISCONTINUED TIRES. I ALSO FOUND THESE TIRES ON CLEARANCE AT SEARS. I DECIDED TO FILE A COMPLAIN AFTER I SEARCHED ONLINE AND FOUND OUT THAT OTHER PEOPLE ARE FACING THE SAME ISSUE WITH THE SAME BRAND AND SIZE.     HTTP://M.CARCOMPLAINTS.COM/AUDI/A3/2015/WHEELS_HUBS/WHEELS.SHTML     THERE IS A RECALL IN CANADA ON THESE TIRES    HTTP://WWWAPPS.TC.GC.CA/SAF-SEC-SUR/7/VRDB-BDRV/SEARCH-RECHERCHE/DETAIL.ASPX?LANG=ENG&MK=7041&MD=0&FY=0&TY=9999&FT=&LS=0&SY=0&RN=2015313&CF=SEARCHRESULT&PG=0      DEALERSHIP IS NOT OFFERING ANY SOLUTIONS. I AM SCARED TO DRIVE MY CAR.",
        "vin": "WAUB8GFF1G1"
    }
]