[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "07/27/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290215,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A KNOWN ISSUE WITH 2015+ BMW F80 M3 S55 ENGINE. THE ISSUE IS THE CRANK HUB SPINNING OUT AND DAMAGING THE CAR. IT LEAVES THE VEHICLE IN A DANGEROUS STATE WHEN  DRIVING ON THE ROAD AND TO OTHERS NEAR BY. THIS ISSUE HAPPENS TO STOCK VEHICLES AND MODDED ONES. IF THE CRANK HUB SPINS WHILE THE CAR IS MOVING, IT CAN LEAVE THE CAR IN A  DANGEROUS STATE WITH NO POWER. LINKS ABOUT IT: HTTPS://WWW.YOUTUBE.COM/RESULTS... SPECIFIC VIDEO THAT EXPLAINS THE CRANK HUB ISSUE WITH THIS MODEL OF A CAR:  HTTPS://YOUTU.BE/SJR3ZHEGS_U?T=160    THIS ISSUE HAS PERSONALLY HAPPENED ON MY M3. I WAS COASTING DOWN A HILL TOWARDS A GREEN STOPLIGHT, AND A DRIVETRAIN MALFUNCTION ERROR POPPED UP ON MY SCREEN. I IMMEDIATELY PUSHED IN THE CLUTCH, AND WITHIN 1 SECOND MY ENGINE TURNED OFF. MY CAR WAS LEFT WITH NO POWER, THE ENGINE WOULD NOT RESTART. I GOT THE CAR HOME BY TOWING IT, THEN USING A WINCH TO GET IT IN MY GARAGE. I USED MY OBD2 READER TO READ THE DTC'S AND ALL THE CODES THAT CAME UP WERE DIRECTLY RELATED TO THE CRANK HUB SPINNING.     IT WAS DANGEROUS BECAUSE I WAS APPROACHING A BUSY INTERSECTION. I HAD TO PUSH MY CAR OUT OF THE INTERSECTION.    I WAS NOT INJURED, I DID NOT CRASH, AND I DID NOT LOSE CONTROL. ALTHOUGH IF I WAS GOING AT A HIGHER RATE OF SPEED, IT WOULD BE EASY TO LOSE CONTROL FROM THIS ISSUE.",
        "vin": "WBS8M9C53GP"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289880,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRANKHUB ON THESE CARS ARE TICKING TIME BOMBS AND IS LIKELY TO FAIL JUST OUTSIDE OF WARRANTY FORCING HUGE REPAIR BILLS. IN SOME CASES, A \"LUCKY\" FEW JUST NEED TO BE RETIMED AND ONLY REQUIRE 18 HOURS OF LABOR. HOWEVER, OTHERS HAVE NOT BEEN SO LUCKY AND HAVE REQUIRED AN ALL-NEW ENGINE. THIS IS AN ISSUE BMW IS FULLY AWARE OF BUT HAS NOT TAKEN RESPONSBILITY FOR THEIR INSUFFICIENT ENGINEERING.",
        "vin": "WBS8M9C56G5"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "07/27/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289964,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A KNOWN ISSUE WITH 2015+ BMW F80 M3 S55 ENGINE. THE ISSUE IS THE CRANK HUB SPINNING OUT AND DAMAGING THE CAR. IT LEAVES THE VEHICLE IN A DANGEROUS STATE WHEN DRIVING ON THE ROAD AND TO OTHERS NEAR BY. THIS ISSUE HAPPENS TO STOCK VEHICLES AND MODDED ONES. IF THE CRANK HUB SPINS WHILE THE CAR IS MOVING, IT CAN LEAVE THE CAR IN A DANGEROUS STATE WITH NO POWER.   LINKS ABOUT IT:  HTTPS://WWW.YOUTUBE.COM/RESULTS...  SPECIFIC VIDEO THAT EXPLAINS THE CRANK HUB ISSUE WITH THIS MODEL OF A CAR:  HTTPS://YOUTU.BE/SJR3ZHEGS_U?T=160",
        "vin": "WBS8M9C53GP"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/13/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232137,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEEP HEARING A KNOCKING SOUND ON DRIVER SIDE WHEN GOING OVER BUMPS.  FEELING VIBRATION UNDER CAR UNDER ACCELERATING AND BREAKING.  CARBON FIBER ROOF LAMINATE PEELING OFF.",
        "vin": "WBS8M9C52G5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "12/08/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099977,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE TAKEN MY VEHICLE IN TO THE SERVICE DEALER MULTIPLE TIMES SINCE I'VE PURCHASED THE CAR BACK IN NOV. 2016.  I NOTICED A CLUNKING AND JOLTING SENSATION FROM MY REAR AXLE WHICH I KNEW WAS NOT NORMAL.  THE DEALER AFTER DIAGNOSING THE ISSUE TOLD ME IT IS NORMAL AND THERE ISN'T AN ISSUE AT ALL.  UPON FURTHER RESEARCH ONLINE AND PERSONAL FRUSTRATION KNOWING I'M PAYING FOR A NEW CAR WHICH DOESN'T FEEL NEW AT ALL, I FOUND THE ATTACHED RECALL NOTICE.  MY CAR HAS A PRODUCTION DATE OF MAY 20, 2016 WHICH FALLS IN BETWEEN THE TIMELINE MENTIONED IN THE ATTACHED RECALL MEMO WHICH WILL REQUIRE A REPLACEMENT OF THE REAR DIFFERENTIAL.  ALSO, SEARCHING ONLINE ON THE BMW M3 FORUMS, MANY OTHER OWNERS OF THIS SIMILAR VEHICLE HAVE SUCH AN ISSUE AND I AM WORRIED THIS MIGHT ALSO POSE A SAFETY THREAT TO ME.  FOR THESE REASONS, I AM SUBMITTING THIS FORM HERE.",
        "vin": "WBS8M9C57G5"
    }
]