[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/13/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11317890,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 BMW Z4. THE CONTACT STATED THAT WHILE HIS WIFE WAS STOPPED AND THE BRAKE PEDAL WAS DEPRESSED AN UNKNOWN NOISE WAS HEARD AS, THE VEHICLE ACCELERATED OUT OF CONTROL AND CRASHED INTO THE REAR OF THE VEHICLE IN FRONT CAUSING THAT VEHICLE TO CRASHED INTO THE VEHICLE AHEAD OF IT. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE DRIVER'S SIDE FRONTAL AND KNEE AIR BAGS DEPLOYED. THE DRIVER SUSTAINED MINOR INJURY THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN AUTO BODY REPAIR FACILITY. THE CONTACT CALLED THE BMW OF TEMPLE DEALER (6006 S GENERAL BRUCE DR, TEMPLE, TX 76502) AND WAS TOLD TO CALL THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AS THE CONTACT WAS AWAITING THE REPORT FROM THE EVENT DATA RECORDER (EDR) AND A CASE WAS OPENED. THE CONTACT WAS CONCERNED AS HE WANTED THE CAUSE OF THE FAILURE TO BE DIAGNOSED BEFORE THE VEHICLE WAS RETURNED TO HM. THE FAILURE MILEAGE WAS APPROXIMATELY 8,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908777,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 20% OF TIME, DRIVER SIDE SEAT BELT JAMS, WILL NOT RELEASE FROM RECESS/RETAINER BEHIND SEAT WITHOUT USING MY HAND FOR COUPLE MINUTES TO JIGGLE ENOUGH. NO PROBLEM ONCE I GET IT TO RELEASE. THEN FITS IN CONNECTOR AND ALSO RELEASES OK. TWO LOCAL DEALERS UNABLE TO FIX. ONE EVEN REPLACED ENTIRE MECHANISM, STILL JAMS. MANAGER SAID THIS MODEL SEEMS TO HAVE THIS PROBLEM. THIS OCCURS AT A STAND STILL, BEFORE PUTTING CAR IN GEAR, SOMETIMES WITH MOTOR ON, SOMETIME BEFORE I START THE ENGINE. SOMETIMES JUST OPENING THE DOOR CAUSES THE RELEASE. OTHER TIMES, I HAVE TO PUT MY HAND UNDER THE BELT AND MANEUVER THE BELT UNTIL IT RELATES FROM THE RETAINER INTO WHICH THE BELT RETRACTS. NO PICTURES INCLUDED. JUST A STANDARD SEAT BELT. HAD A BMW 3351 FOR 7 YEARS. NEVER HAD THIS PROBLEM ONCE.",
        "vin": "WBALL5C51GA"
    }
]