[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446428,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The incident that happened to us was the shattered front panel sunroof while driving in a cold temperature on the highway. We don't believe this was caused by a rock because it should have cracked the whole panel but instead, it shattered.",
        "vin": "5UXWX9C53G0"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415249,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT HAD BEEN RAINING IN MY AREA THE WEEK OF 4/16/2021. ON THE EVENING OF 4/16/2021 MY REAR HATCH CONTROL AND REAR HATCH ALARM STARTED MALFUNCTIONING. I DISCOVERED WATER HAD GOTTEN INTO THE ELECTRICAL COMPARTMENT IN THE REAR HATCH. I BROUGHT MY SUV TO THE SHOP/DEALER FOR REPAIR AND WAS TOLD THE SUNROOF FRAME WAS CRACKED ALLOWING WATER PENETRATION FROM THE HEADLINER TO THE REAR HATCH CAUSING THE HATCH CONTROL UNIT TO MALFUNCTION. MY VEHICLE HAS NEVER BEEN INVOLVED IN AN ACCIDENT AND I HAVE NEVER STORED OR TRANSPORTED ANYTHING ON MY ROOF. THE REPAIR SHOP/DEALER WAS UNABLE TO OFFER A REASON FOR WHAT COULD HAVE CAUSED THE SUNROOF FRAME TO CRACK. THE ONLY EXPLANATION THAT MAKES SENSE IS THAT THE SUNROOF WAS EITHER INSTALLED IMPROPERLY BY THE MANUFACTURER OR THE SUNROOF FRAME IS DEFECTIVE. IT WAS $4,298.08 TO REPAIR THE SUNROOF AND CONTROL UNIT. THIS IS MOST CONCERNING AS MY SUV IS LESS THAN 5 YEARS OLD, ONLY HAS 81,448 MILES AND THERE IS NO RECOMMENDED MAINTENANCE FOR THE SUNROOF.",
        "vin": "5UXWX9C54G0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/12/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407824,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY 2016 BMW X3 FOR ABOUT 30 MILES ON THE HIGHWAY. I EXITED THE HIGHWAY AND CAME TO A STOP AT A LIGHT. MY REAR HATCH OPENED WHILE AT THE LIGHT AND MY VEHICLE WAS IN DRIVE.   I HAD TWO DOGS IN THE REAR AREA THAT NEARLY JUMPED OUT. WE DID DETERMINED THAT A KEY FOB IN A POCKET PROBABLY WAS PRESSED. WHILE THE VEHICLE IS IN DRIVE AND THE DOORS ARE LOCKED THERE IS NO REASON A REAR HATCH SHOULD BE ABLE TO OPEN.      I WAS ABLE TO REENACT THIS EXACT SAME SITUATION WITH THE VEHICLE IN DRIVE, AND THE DOORS LOCKED BY PUSHING THE HATCH BUTTON.  ITDOES ALLOW THE REAR HATCH TO FULLY OPEN EVEN WHEN THE VEHICLE IS IN DRIVE.",
        "vin": "5UXWX9C50G0"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403050,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY EMERGENCY BRAKE KEEPS MALFUNCTIONING, I HAVE BEEN UNABLE TO USE THEM FOR ABOUT 3 MONTHS NOW. ALSO STARTING AROUND 2/20/21 WHEN IM AT A RED LIGHT FOR MORE THAN A MINUTE AND THE LIGHT TURNS GREEN, MY TRANSMISSION GETS STUCK AND THE CAR WONT GO, A WARNING SIGN COMES ON. THEN I HAVE TO RE PUT IT IN DRIVE AND CAN GO.",
        "vin": "5UXWX9C56G0"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "08/30/2020",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354903,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/30/20,AFTER SITTING FOR AN HOUR AFTER A LONG DRIVE, THE CAR BURST INTO FLAMES AND BURNED DOWN TWO ADJACENT HOMES.  THE CAR WAS PARKED FOR AN HOUR BEFORE IT STARTED TO BURN.",
        "vin": "5UXWX9C5XG0"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "10/13/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11291909,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 8-YEAR OLD DAUGHTER WAS SITTING ON REAR PASSENGER SIZE SEAT ON A BOOSTER SEAT WITH SEAT BELT ON. SHE FIRST PLAYED WITH MY SON WHO WAS SITTING ON A READ DRIVER SEAT ON A CAR SEAT. THEN SHE FELL ASLEEP. IN THIS PROCESS THE SEAT BELT SOME HOW GOT WRAPPED AROUND HER. WHEN WE STOPPED FOR A BATHROOM BREAK WE UNBUCKLED THE BELT TO FIND OUT THAT THE BELT WAS WRAPPED AROUND HERE AND WE COULD NOT UNWRAP IT. THE MORE WE TRIED TO PULL OUT THE MORE TIGHTER IT GOT. SHE WAS IN SEVERE PAIN. WE HAD TO BORROW A SCISSOR FROM THE GAS STATION TO CUT THE BELT.SEE THE PIC WITH THE SCAR. SHE WAS IN PAIN FOR NEXT FEW DAYS.     WE TOOK THE CAR TO DEALER AND THEY SAID THAT BELT WORKED AS DESIGNED. THE CHILD LOCK KICKED IN AND THE LOCK WONT RELEASE UNTIL THE BELT GOES ALL THE WAY IN. BELT COULD NOT GO ALL THE WAY IN BECAUSE IT WAS WRAPPED AROUND HER.     THERE SHOULD HAVE BEEN SOME MANUAL BUTTON/SWITCH TO RELEASE THE BELT.",
        "vin": "5UXWX9C56G0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/25/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258064,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG POSSIBLE FAILURE. PASSENGER AIRBAG HAS BEEN TURNED OFF BY THE VEHICLE.",
        "vin": "5UXWX7C51G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219776,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT A STOP (LIGHT OR STOP SIGN), TRANSMISSION SWITCHES TO PARK FROM DRIVE.  DOES NOT HAPPEN IN SPORT MODE JUST STANDARD AND ECONO.  THIS PROBLEM OCCURS INTERMITTENTLY WITH NO KNOWN TREND WHEN OR WHY OCCURRING.  THIS PROBLEM PRESENTS A SAFETY RISK TO BOTH THE OCCUPANTS AND OTHER DRIVERS.  IF CAR FORWARD MOTION FROM A STOPPED POSITION IS DELAYED DUE TO HAVING TO SWITCH FROM STANDARD TO SPORT AND FROM PARK TO DRIVE, CAR IN REAR COULD ASSUME SUBJECT CAR WILL BE TIMELY WITH MOVING FORWARD AND STRIKE THE SUBJECT CAR OR THE DRIVER OF SUBJECT CAR (WITH PROBLEM) PANICS AND HAS A DELAY IN MOVING INTO TRAFFIC, THIS SITUATION COULD LEAD TO A VEHICLE OR CYCLIST OR PEDESTRIAN STRIKE.  APPEARS THAT TREND IS WELL KNOWN BASED ON INTERNET SEARCH.  ENCINITAS, CA. BMW HAS SEEN CAR ON THREE OCCASIONS AND HAVE NOT BEEN ABLE TO IDENTIFY THE TRIGGER FOR CONDITION (IE. ROOT CAUSE IS UNKNOWN).  HOWEVER, A BATTERY WAS REPLACED BUT PROBLEM STILL PERSISTS. AND, ENCINITAS BMW HAS BEEN VERY HELPFUL TRYING TO ADDRESS WITH WONDERFUL CUSTOMER SERVICE. HOWEVER, I FEEL A MORE FOCUSED AND EXPANDED STRATEGY IS NEEDED BY BMW TO IDENTIFY ROOT CAUSE.  I'M REPORTING THIS DUE TO THE POTENTIAL WIDESPREAD /SIMILAR CONDITION THAT OTHER BMW OWNERS MAY BE FACED WITH.  PLEASE LET ME KNOW WHAT I CAN DO TO HELP EXPEDITE ADDRESSING THIS SITUATION.  I'M WORRIED THAT MY WIFE AND DAUGHTER (DRIVERS OF CAR) COULD BE EXPOSED TO A SERIOUS BAD EVENT DUE TO THE VEHICLE MALFUNCTION DESCRIBED ABOVE.  AND OTHER PERSONS MAY BE EXPOSED AS WELL.  THANK YOU AND I LOOK FORWARD TO HEARING FROM YOU.  (XXXXX)    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202871,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V755000 (ENGINE AND ENGINE COOLING). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AUTOBAHN BMW FORT WORTH (2828 WHITE SETTLEMENT RD, FORT WORTH, TX 76107, (817) 665-5831) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXWY3C54G0"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184715,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 BMW X3. WHEN PARKING THE VEHICLE, THE RPMS INCREASED WHEN THE BRAKE PEDAL WAS DEPRESSED. AS A RESULT, THE VEHICLE CRASHED INTO A TREE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO BMW OF ONTARIO (1301 AUTO CENTER DR, ONTARIO, CA 91761, (909) 402-3052) TO BE DIAGNOSED, BUT THE RESULTS WERE NOT DISCLOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "5UXWY3C59G0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183058,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VALVE STEM BODY FAILED DURING TIRE INFLATION.  IT IS NOT POSSIBLE TO INFLATE TIRE TO SPEC.  POSSIBLE RAPID AIR PRESSURE LOSS WHILE DRIVING.  BMW OF SAN FRANCISCO REFUSED TO REPAIR UNDER EXISTING MANUFACTURED WARRANTY.",
        "vin": "5UXWY3C56G0"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175533,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 BMW X3. CONSUMER WRITES IN REGARDS TO ISSUES WITH THE SEAT BELTS IN VEHICLE. *LD  *TR",
        "vin": "5UXWX9C57G0"
    },
    {
        "components": "UNKNOWN OR OTHER,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166476,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP REFUSED TO PERFORM RECALL ON CAR FOR SEAT BELT BRACKET SAYING THEY DID NOT HAVE THE TIME.  APPOINTMENT WAS MADE NEARLY 3 MONTHS PRIOR",
        "vin": "5UXWX9C51G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/07/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149963,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION - UNCOMMANDED CHANGE FROM DRIVE TO PARK  THE AUTO START/STOP FEATURE TURNS THE CAR OFF WHEN YOU STOP AND BACK ON WHEN YOU START. THE FAULT IS THAT IT INTERMITTENTLY PUTS THE TRANSMISSION IN PARK OR NEUTRAL. IT HAPPENS WHEN YOU TAKE YOUR FOOT OFF THE BRAKE, WHILE IT IS RESTARTING THE VEHICLE. IT OCCASIONALLY HAPPENS WHILE YOU ARE JUST STOPPED AND THE ENGINE RESTARTS. USUALLY THIS IS WHEN YOU ARE TRYING TO ACCELERATE FROM A STOP SIGN OR TRAFFIC SIGNAL TO GET INTO TRAFFIC. NEARLY GOT REAR-ENDED WHEN MY BRAKE LIGHTS CAME OFF, BUT I DID NOT ACCELERATE BECAUSE THE VEHICLE HAD SWITCHED FROM DRIVE TO PARK.I HAVE VIDEO OF IT OCCURRING, BUT THE DEALER CANNOT REPEAT IT, AND UPLOADING NEW SW DID NOTHING.",
        "vin": "5UXWY3C52G0"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145186,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPROACHING A STOPLIGHT, BRAKED, THEN WENT TO ACCELERATE AND THE VEHICLE TOTALLY SHUTDOWN AND STOPPED WHILE DRIVING IN TRAFFIC. THIS WAS A CATASTROPHIC FAILURE, WHICH COULD HAVE KILLED BOTH OCCUPANTS OF THIS VEHICLE. THE CHECK ENGINE LIGHT WAS ACTIVATED. UPON ATTEMPTING TO RESTART THE VEHICLE TO MOVE IT OUT OF THE WAY OF TRAFFIC, THE VEHICLE WOULD NOT START. THE TRANSMISSION WOULD NOT BE PLACED IN NEUTRAL NOR COULD THE PARKING BRAKE BE DISENGAGED SO THE VEHICLE COULD BE PUSHED OUT OF THE WAY OF TRAFFIC. THIS WAS A VERY DANGEROUS SITUATION. THIS VEHICLE IS DANGEROUS AND SHOULD BE TAKEN OFF OF THE MARKET.",
        "vin": "5UXWY3C59G0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132051,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLY FAILURE OF DIESEL EMISSIONS SYSTEM AT 45,569 MILES    DEALER REPLACED BOTH NOX SENSORS, UPPER O2 SENSOR, AND DPF FILTER",
        "vin": "5UXWY3C5XG0"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129955,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A VERY DANGEROUS AND CATASTROPHIC SITUATION IS CREATED WHEN USING THE START/STOP FEATURE. WHEN STOPPED AT A TRAFFIC LIGHT OR STOPPED IN STOP AND GO TRAFFIC ON THE HIGHWAY THIS FEATURE FAILS. ONCE THIS FEATURE IS ENGAGED WHEN THE VEHICLE IS STOPPED WHEN THE ACCELERATOR IS PUSHED TO START AGAIN THE VEHICLE GOES INTO PARK INSTEAD OF ACCELERATING. THIS PRESENTS A VERY DANGEROUS AND POTENTIALLY CATASTROPHIC SITUATION BECAUSE YOU MAY BE MAKING A MANEUVER BY ACCELERATION TO SWITCH LANES OR SOMETHING SIMILAR AND THE CAR FAILS AND GOES INTO PARK AND DOES NOT MOVE. PERILLO BMW PERFORMED UNSUCCESSFUL SERVICE ON THIS APPROXIMATELY FOUR WEEKS AGO. THIS DID NOT FIX THE PROBLEM. PERILLO PERFORMED SERVICE AGAIN FOR THE SAME ISSUE TWO WEEKS AGO. MY HOPE IS THAT THIS IS A PERMANENT FIX BECAUSE TO NOT TAKE THIS PROBLEM SERIOUSLY AND LEAVE IT TO CHANCE THAT THIS MAY OCCUR WITH SEVERE CONSEQUENCES. THIS IS A SAFETY ISSUE THAT I THINK THE NHTSA SHOULD ADDRESS DIRECTLY WITH BMW.  SPECIFICALLY- 1. THE CAR COMES TO A COMPLETE STOP AT A TRAFFIC LIGHT, STOP SIGN OR IN STOP AND GO TRAFFIC ON THE HIGHWAY.  2. THE START/STOP FEATURE IS ENGAGED  3. WHEN THE ACCELERATOR IS PUSHED TO GO AGAIN THE CAR IMMEDIATELY GOES INTO PARK AND THE STEERING WHEEL LOCKS.  4. TO GO AGAIN, THE BREAK MUST BE PRESSED AND THE GEAR SHIFTED MANUALLY INTO DRIVE.   PRIOR TO BMW SERVICING THE VEHICLE THIS HAS OCCURRED MORE THAN 20 TIMES IN A THREE-MONTH PERIOD. THERE IS ABSOLUTELY NO CHANCE THAT THE DRIVER ACCIDENTALLY PRESSED THE PARK WHILE STOPPED. THE DRIVER PURPOSELY DOES NOT KEEP THEIR HANDS ON THE SHIFT GEAR.",
        "vin": "5UXWX9C58G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104512,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPLODING SUNROOF.  HAPPENED WITHOUT IMPACT, ON FREEWAY, NO NEARBY OVERPASS AND NOTHING TRAVELING TOWARDS VEHICLE.  SOUNDED AND FELT LIKE A BOMB WAS GOING OFF, WHICH COULD HAVE BUT FORTUNATELY DID NOT CAUSE ME TO LOSE CONTROL OF VEHICLE.",
        "vin": "5UXWX9C58G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2018",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103498,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ~75 MPH ON I-25 NORTH OF DENVER ON JUNE 22, 2018 ABOUT 1:30 PM AND MY SUNROOF EXPLODED.  FEW CARS CLOSE TO ME.",
        "vin": "5UXWX9C57G0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2018",
        "dateOfIncident": "03/17/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085140,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS A 2016 BMW X3. MY SISTER BOUGHT IT USED AT APPROXIMATELY 30,000 MILES A FEW MONTHS AGO. IT WAS ME, MY MOM, AND MY 1 NEPHEW AND 2 NIECES. WE DECIDED TO USE IT TO TAKE IT ON A TRIP TO TYBEE ISLAND. BUT, MY SISTER DIDN'T COME WITH US. WHILE ON ISLANDS EXPRESSWAY APPROACHING THE INTERSECTION AT BRYAN WOODS RD SOUTH TO TYBEE ISLAND, MY MOM PRESSED THE BRAKES AND IT MADE A SCRUBBING SOUND. IT DIDN'T ACCELERATE, THOUGH. IT STOPPED AFTER. WE BOTH JUST DUSTED IT OFF OUR SHOULDERS AND CONTINUED TO TYBEE ISLAND. WE THEN WENT BACK TO THE HOUSE. ON THE SAME DAY, IN DECATUR, GA WE WERE HEADING OUT ONTO FLAT SHOALS PKWY AT AROUND 9:00 PM. MOM WAS AT THE STOP SIGN. SUDDENLY, THE TRUCK RAISED TO APPROXIMATELY 4000 RPM AND SURGED INTO TRAFFIC A BIT. MY MOM WAS SCARED SHE PRESSED IN MORE ON THE BRAKES AND THE TRUCK DID A BURN OUT. WE COULD'VE GOT HURT BAD. AS A CAR WAS DRIVING PAST US AND THE CAR WAS SURGING, OUR VEHICLE WAS ALMOST HIT! IT ACCELERATED FOR ABOUT 5 SECONDS AND STOPPED. MY MOM WAS VERY ANXIOUS AND REFUSED TO DRIVE THAT TRUCK AGAIN. WE HAD TO GET MY BROTHER TO PICK US UP. SHE WAS SCARED, AND THAT BOTHERED THE KIDS. MY SISTER ALSO HAD AN EXPERIENCE LIKE THIS AND SHE JUST THOUGHT IT WAS HER MIND. AFTER WE GOT OFF OF VACATION IN ATLANTA, MY SISTER TOOK IT TO THE DEALERSHIP. THE DEALERSHIP SAID THEY LOOKED THROUGH IT AND SAID NOTHING ELSE AFTER THAT (MY SISTER'S WORDS) MY MOM IS ANGERED. I HOPE BMW DOES A RECALL ON THIS FROM ALL THE CASES THAT HAVE OCCURRED AND ALL THE DAMAGE THAT HAS HAPPENED. I WILL PUT THIS CASE UNDER MY MOTHER'S NAME.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/30/2018",
        "dateOfIncident": "03/28/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082125,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW TECH LOOKED TIRES OVER AND FOUND REAR TIRES WORN THROUGH INNER EDGE TO THE POINT THAT IT APPEARS ONLY THE INNER LAYER OF RUBBER IS HOLDING THE TIRE TOGETHER.  FULL SEPARATION BETWEEN THE SIDEWALL AND FACE OF THE TIRE ON BOTH REAR TIRES IN SOME SPOTS.  REAR TIRES ARE DANGEROUS AND SHOULD NOT BE  USED ON THE ROAD OR HIGHWAY UNTIL REPLACED.  THE CAR HAS ONLY 36,000 MILES AND THE REST OF THE TIRE HAS TREAD. WE FEEL THIS IS WELL BEYOND NORMAL WEAR AND IT APPEARS THAT IS A DEFECT.  I'VE ATTACHED PICTURES OF THE 2 REAR TIRES.",
        "vin": "5UXWZ7C59GO"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862862,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 BMW X3.  CONSUMER WRITES IN REGARDS TO VEHICLE SUDDEN ACCELERATION AND EPISODES OF STEERING WHEEL BRIEFLY UNRESPONSIVE WHEN MERGING INTO TRAFFIC.  *SMD    THE CONSUMER STATED THE VEHICLE WOULD SUDDENLY ACCELERATE WHILE THE VEHICLE WAS MOVING AND STOPPED WITH THE DRIVER'S FOOT ON THE BRAKE.  *JS",
        "vin": "5UXWX7C59G0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/31/2017",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057745,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING TO SLOW THE VEHICLE TO A STOP BEHIND TRAFFIC AT A RED LIGHT, AFTER COMING OFF A HIGHWAY EXIT RAMP, THE BRAKES FAILED TO RESPOND TO ADDED PRESSURE APPLIED TO BRING THE VEHICLE TO A COMPLETE STOP. THE BMW X3 KEPT MOVING FORWARD, AND COLLIDED, AT VERY SLOW SPEED, WITH THE STOPPED VEHICLE AHEAD. I QUICKLY CHECKED TO ENSURE THAT MY FOOT WAS PROPERLY ON THE BRAKE PEDAL AND DEPRESSED THE PEDAL AGAIN, WHICH AGAIN FAILED TO BRING THE VEHICLE TO A COMPLETE STOP, RESULTING IN SECONDARY CONTACT WITH THE VEHICLE AHEAD. WHEN ATTEMPTING TO MOVE THE VEHICLE TO THE SIDE OF THE ROAD, THE ELECTRONIC TRANSMISSION REPEATEDLY JUMPED INTO PARK FROM DRIVE, REQUIRING ME TO TURN OFF THE IGNITION AND RESTART THE VEHICLE BEFORE I COULD SAFELY MOVE IT TO THE SIDE OF THE ROAD.",
        "vin": "5UXWX9C50G0"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035564,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 BMW X3 XDRIVE28 I   I PULLED INTO A FRIEND'S DRIVEWAY AND APPLIED THE BRAKES APPROXIMATELY 2 FEET FROM THE  CLOSED GARAGE DOOR. MY CAR \"LEAPT \" INTO THE SIDE OF THE HOUSE,  THEN CAREENED INTO  THE GARAGE DOOR. THE CAR ACCELERATED WITH SUCH FORCE THAT BOTH AIRBAGS WERE DEPLOYED.  I AM SURE THAT I DID NOT HIT THE ACCELERATOR  BY ACCIDENT.  AT THE CLOSE PROXIMITY TO THE GARAGE I COULD NOT HAVE ACCELERATED TO CAUSE  SUCH A VIOLENT CRASH THAT DEPLOYED THE AIRBAGS. MY CAR WAS DECLARED A \" TOTAL LOSS \". THIS WAS ONE OF THE MORE FRIGHTENING EXPERIENCES OF MY LIFE. IT ALL HAPPENED IN A SPLIT SECOND. I AM THANKFUL THAT I WAS NOT IN TRAFFIC.",
        "vin": "5UXWX9C55GO"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/09/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032860,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS 2 ROF",
                "productYear": "9999",
                "size": "275/50R20",
                "type": "Tire"
            }
        ],
        "summary": "TIRE IS A RUN FLAT TYPE OF TIRE AND THE WEAR OF ALL FOUR TIRES WAS SEVERE ON THE INSIDE OF TIRE WHILE TREAD ACROSS THE REST OF THE TIRE WAS STILL SATISFACTORY. REAR TIRE TREAD STARTED SEPARATING AND THE VEHICLE HAD TO BE TAKEN OFF THE ROAD DUE TO THE SEVERITY OF THE TREAD SEPARATION. CONTINUED OPERATION OF THE VEHICLE WOULD HAVE RESULTED IN COMPLETE DESTRUCTION OF THE TIRE AND LOSS OF CONTROL OF THE VEHICLE  INTERNET RESEARCH INDICATES THIS TO BE A \"COMMON\" PROBLEM WITH THIS VEHICLE AND THE MANUFACTURER REFUSES TO RECOGNIZE THE DANGER TO THE PUBLIC.",
        "vin": "5UXWX7C58G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "08/27/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024588,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 31, WHILE SLOWING TO ENTER A TOLL BOOTH, ENGINE STARTED REVVING UNCONTROLLABLY, MAINTAINING EXCESSIVE SPEED. I BRAKED HARD AND VEHICLE STOPPED IN TIME TO AVOID A COLLISION. VEHICLE OPERATED NORMALLY THEREAFTER UNTIL AUGUST 27, WHEN, STOPPED AT A TRAFFIC LIGHT ON A HIGHWAY, ENGINE AGAIN STARTED REVVING, RANGING FROM ABOUT 3500 TO 4000 RPM. I SHIFTED TO PARK AND ENGINE IMMEDIATELY REVVED UP TO OVER 7000, IN RED ZONE OF TACHOMETER. REVVING STOPPED AFTER A MINUTE OR SO AND VEHICLE OPERATED NORMALLY. THE NEXT DAY, I HAD VEHICLE TOWED TO BMW ROCKVILLE. SERVICE DEPARTMENT EXAMINED VEHICLE AND FOUND NO DEFECTS, SUGGESTING POSSIBILITY THAT DRIVER MAY HAVE HAD FOOT ON BRAKE AND ACCELERATOR AT SAME TIME. I DID NOT THINK SO, ESPECIALLY AS THIS HAD NEVER HAPPENED BEFORE AND REVVING WAS UP AND DOWN, REQUIRING RHYTHMIC ACTION ON GAS WHILE HOLDING BRAKE DOWN FIRMLY. AS WIFE AND I DID NOT FEEL SAFE DRIVING THE CAR, WE HAD ALSO ALERTED BMW NORTH AMERICA, WHICH SENT AN ENGINEER TO TEST THE VEHICLE. BMW NA'S ANALYSIS FOUND NO DEFECTS BUT OFFERED TO HELP AS WE WISHED TO TRADE IN THE CAR. IT WAS TRADED IN TO BMW ROCKVILLE SEPT 17, AT CONSIDERABLE FINANCIAL LOSS. I HAVE A COPY OF BMW NA'S REPORT, BUT IT SHOWS ONLY THAT THE CAR IS IN PERFECT OPERATING CONDITION. BMW ROCKVILLE SALESMAN SAID VEHICLE WOULD NOT BE RESOLD, BUT WOULD BE CANNIBALIZED FOR SPARE PARTS.",
        "vin": "5IXWX9C62G0"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991289,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PULLED INTO A PARKING LOT TRAVELING VERY SLOWLY THEN TURNED LEFT INTO A PARKING SPACE WITH MY FOOT ON BRAKE BUT JUST BEFORE COMING TO A COMPLETE STOP THE CAR SUDDENLY SURGED FORWARD AT GREAT SPEED, LEAPT OVER A CONCRETE \"LOG\" DESIGNED TO STOP A VEHICLE AND CRASHED INTO A CONCRETE WALL 3 FEET IN FRONT OF THE CAR.  MY FIRST REACTION WAS TO LIFT MY FOOT FROM THE PEDAL THINKING I HAD DEPRESSED THE ACCELERATOR IN ERROR, HOWEVER THE CAR INCREASED SPEED AND I JUST HAD TIME TO GLANCE DOWN AND ASCERTAIN THAT MY FOOT WAS ON THE BRAKE BEFORE THE CAR PLOWED INTO THE WALL, DEPLOYING THE AIR BAGS.  THE WHOLE INCIDENT WAS OVER IN 2 - 3 SECONDS AND THE CAR WAS PERFECTLY ALIGNED IN THE PARKING SPACE EXCEPT FOR THE FRONT WHEELS BEING THE WRONG SIDE OF \"LOG\".  THE X3 WAS NOT DRIVE-ABLE AND WAS TOWED ON A FLATBED TO THE BMW SERVICE CENTER AND SUBSEQUENTLY DECLARED A COMPLETE WRITE-OFF BY THE INSURANCE COMPANY.  I AM HORRIFIED BY THE FACT THAT MANY CAR MANUFACTURERS ARE AWARE OF THIS SUDDEN UNINTENDED ACCELERATION PROBLEM YET, BECAUSE IT IS DIFFICULT TO PROVE, USUALLY PUT ALL REPORTED INCIDENTS DOWN TO OPERATOR ERROR, THEREFORE ABSOLVING THEM OF RESPONSIBILITY.  MY INSURANCE COMPANY IS NOT INVESTIGATING THE CAUSE, NEITHER IS BMW.   WHY IS THAT? IS IT GOING TO TAKE A FATALITY BEFORE SOMETHING IS DONE TO RECTIFY THIS VERY REAL PROBLEM.  BELOW IS THE CONTACT DETAILS FOR THE CHUBB CLAIMS EXAMINER WHO IS WILLING TO SHARE HIS REPORT AND PHOTOS SHOULD NHTSA DECIDE TO INVESTIGATE.  SAM JACKSON   800 432 2482  EXT 0860  SAM.JACKSON@CHUBB.COM  CLAIM # 77140147",
        "vin": "5UXWX9C58GO"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970858,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH HEADLIGHT LENSES ARE CRACKING AND PITTED ON THE INSIDE OF THE LENSES. VEHICLE IS UNDER WARRANTY AND HAS BEEN AT THE DEALER ON TWO SEPARATE OCCASIONS. THE 2ND TIME AT THE DEALER THEY HAD A REGIONAL TECH MANAGER CHECK THE HEADLIGHTS.THE CONCLUSION HE CAME TO IS THAT THE PITTING AND CRACKING IS ON THE OUTSIDE AND THEREFORE NOT A DEFECT. WELL, A CHILD COULD SEE AND TELL, EVEN BY TOUCHING THE FACE OF THE HEADLIGHTS THAT THIS IS ON THE INSIDE OF THE PLASTIC HEADLAMP ASSEMBLIES. I BELIEVE THIS IS A SERIOUS SAFETY ISSUE AT NIGHT, AS WELL AS A CLEAR MATERIALS DEFECT. I BELIEVE THAT BMW DOES KNOW THAT THEY ARE DEFECTIVE, AND SIMPLY DOESN'T WANT TO PAY FOR THE HEADLIGHTS. THEY SAID I COULD REPLACE THEM MYSELF IF I WANTED TO AT A COST OF $5000.00.",
        "vin": "5UXWZ7C58G0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/24/2017",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968350,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 BMW X3. WHILE STATIONARY, THE VEHICLE ACCELERATED RAPIDLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO BE REPAIRED, BUT THE DEALER COULD NOT DIAGNOSE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 13,000.",
        "vin": "WBAEK13537C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947260,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN TRAFFIC AT A LIGHT AND MOVING SLOWLY BEHIND CAR IN FRONT OF ME.  I WAS BRAKING AND THE CAR JUST KEPT GOING FORWARD.  I HIT THE CAR IN FRONT OF ME. THEN I HIT IT AGAIN AS IT MOVED FORWARD AND A THIRD TIME AS IT MOVED FORWARD.  ALL THE TIME I WAS HITTING THE BRAKES.  THE CAR SEEMED TO BE ACCELERATING.... I FINALLY HAD TO PULL OFF ONTO A SIDEWALK AND PUT THE CAR IN PARK TO GET IT TO STOP.  THE POLICE WHO ARRIVED ON THE SCENE ALSO TESTED THE BRAKES AND SAID THEY WERE NOT WORKING.  LATER WHEN THE CAR WAS TOWED THE BRAKES WORKED?  I DO NOT WANT TO DRIVE THIS CAR WITHOUT THE BRAKES BEING FIXED.  I AM WAITING FOR NEWS FROM BMW ON THE SITUATION.  VERY SCARY....  *TR",
        "vin": "5UXWX7C50G0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2016",
        "dateOfIncident": "12/17/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935972,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME IN THIS VEHICLE THAT OUR BRAKES HAVE FAILED. WE FILED A COMPLAINT THE FIRST TIME, GAVE THE CAR TO BMW SERVICE, HAD AN ENGINEER FROM BMW COME AND LOOK AT THE CAR - THE ENGINEER FILED A REPORT SAYING THAT THE BRAKES WERE FINE AND NOTHING WAS WRONG WITH THE VEHICLE. WE BEGGED AND PLEADED TO BE GIVEN ANOTHER CAR BUT BMW NA REFUSED TO BUDGE. FORCED TO TAKE THE CAR BACK, WE DROVE THIS MORNING AND AS WE WERE SLOWING TO A RED LIGHT NEARING A BUSY INTERSECTION, OUR BRAKES FAILED ONCE MORE. I PUSHED DOWN ON THE BRAKE PEDAL AND THE CAR ACCELERATED INTO THE INTERSECTION. I HAD TO HONK THE HORN TO WARN OTHER DRIVERS AND USE THE EMERGENCY BRAKE TO STOP THE CAR. THIS IS A 2016 BMW X3 XDRIVE28I AND IT IS UNSAFE TO DRIVE. TWO BRAKE MALFUNCTIONS 1 MONTH APART, BMW REFUSES TO ADMIT ANY FAULT.",
        "vin": "5UXWX9C50G0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "11/18/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926927,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWING TO A STOP AT A RED LIGHT ON A VERY BUSY STREET AND THE BRAKES IN MY X3 FAILED. INSTEAD OF SLOWING THE CAR DOWN - IT SPED UP AND CRASHED INTO THE CAR IN FRONT OF ME. I PUSHED DOWN ON THE BRAKES AND THE CAR JUMPED FORWARD. THERE IS MINIMAL DAMAGE TO THE FRONT BUMPER BUT I AM SCARED TO GET BEHIND THE WHEEL AGAIN.",
        "vin": "5UXWX9C50G0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "02/29/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908077,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PRESSURE MONITOR SIGNALS LOW AIR PRESSURE EVERY WEEK ON INSTRUMENTATION. RUN-FLAT TIRES LOSE AIR WEEKLY. TIRE HAS TO BE TOPPED-UP WITH AIR THEN TIRE PRESSURE MONITOR TEST PERFORMED. OWNED VEHICLE SINCE FEBRUARY, 2016 AND FREQUENT, ANNOYING, EMBARRASING TIRE AIR FILLING HAS TO BE DONE WEEKLY.",
        "vin": "5UXWX9C56G0"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "09/11/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10905931,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT PRETENSIONER FAILING TO HOLDBACK PASSENGER ON  DECCELLERATION ON EXIT RAMP AT 4 DEGREES INCLINE OR DECLINE FROM 65 TO ZERO ON CONTROLLED DECCELERATION",
        "vin": "5UXWX7C53G0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/12/2016",
        "dateOfIncident": "12/29/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819810,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ALL HAPPENED THE SAME DAY BEGINNING ABOUT 10AM ON 12/29/15. THE CAR IS A 2016 BMW X3 THAT I BOUGHT NEW IN AUGUST 2015.    1.SLOWED TO BRAKE AT A RED LIGHT. I WAS THE FIRST CAR AT THE INTERSECTION. AS I PUSHED THE BRAKE TO COME TO A FULL STOP, THE CAR LURCHED INTO THE INTERSECTION. I LOOKED DOWN AND SAW MY FOOT ON THE BRAKE AND THE CAR IN DRIVE. FORTUNATELY, THERE WAS NO CROSS TRAFFIC. I SLOWLY ACCELERATED AND CONTINUED WITH MY ERRAND.    2. I STOPPED AT A BUSINESS WITH A PARKING LOT. I SLOWLY DROVE THROUGH THE LOT AND FOUND A OPEN SPOT.  EACH PARKING SPOT HAD A CONCRETE \"STOP BAR\". I SLOWLY TURNED INTO THE SPOT. WHEN I PUSHED ON THE BRAKE FOR A FULL STOP, IT LURCHED FORWARD OVER THE \"STOP BAR\" AND HIT THE CAR PARKED DIRECTLY IN FRONT OF ME. I PUT THE CAR IN REVERSE AND WAS ABLE TO GET BACK OVER THE \"STOP BAR\".  I LOOKED CAREFULLY AT BOTH CARS AND COULD FIND NO DAMAGE ON EITHER ONE.    3. I DROVE SLOWLY DIRECTLY TO THE BMW DEALERSHIP WHERE I BOUGHT THE CAR ON AUGUST 13, 2015.  TWO DIFFERENT SERVICE TECHS DROVE IT AND THEY RAN ALL POSSIBLE SYSTEM TESTS ON IT.  THEY COULD FIND NOTHING WRONG.    4. I WAS SO AFRAID TO DRIVE IT, I TRADED IN THE 2016 X3 FOR A 2016 X1 THE SAME DAY - 12-29-15. BOTH WERE NEW WHEN I BOUGHT THEM. THE X3 HAD 2,500 MILES ON IT WHEN I TRADED IT IN.  I DROVE 139 DAYS.    5. MY CONCERN IS THAT THE X3 WILL BE SOLD AS A USED CAR WITHOUT ANY FURTHER INVESTIGATION INTO THE PROBLEM.    6. THE NHTSA REPORTED THAT 88,000 BMWS (VARIOUS MODELS INCLUDING THE X3) WERE RECALLED IN 2014 FOR A BRAKE PROBLEM. I GAVE THIS INFORMATION TO THE DEALERSHIP.  NHTSA CAMPAIGN NUMBER #14V627000, NHTSA ACTION NUMBER: PE13030. I DO NOT KNOW IF THIS PROBLEM IS THE SAME PROBLEM I HAD.    NHTSA COMPLAINTS LIKE MINE:   4 OUT 8 COMPLAINTS FOR 2014 X3  4 OUT 8 COMPLAINTS FOR 2015 X3  0 OUT OF 1 COMPLAINT FOR 2016 X3",
        "vin": "5UXWX9C52G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2015",
        "dateOfIncident": "07/21/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10736180,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR HATCH CAME DOWN WITHOUT WARNING WHILE I WAS LOADING ITEMS INTO THE BACK CARGO SPACE.  THIS IS THE SECOND INCIDENT.  THE SAME THING HAPPENED 2 OR 3 WEEKS EARLIER.  AT THAT TIME BMW RAN DIAGNOSTICS AND FOUND NOTHING WRONG.  I PLAN TO REPORT THIS INCIDENT.",
        "vin": "5UXWX9C50G0"
    }
]