[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Boom International",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005302,
        "products": [
            {
                "manufacturer": "Boom International",
                "productMake": "BOOM",
                "productModel": "BD125-15",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 (NA) BOOM BD 125-15 (GROM CLONE) MOTORCYCLE. THE CONTACT STATED THAT THE MOTORCYCLE WAS NOT CRANKING TO START. THERE WAS ALSO A SUDDEN LOSS OF POWER SEVERAL TIMES AND A REDUCTION OF SPEED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO PINELLAS POWER SPORTS (9145 66TH ST N, PINELLAS PARK, FL 33782, (727) 497-1777), BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 0.",
        "vin": "L2BBFACG7GB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "08/22/2016",
        "fire": true,
        "manufacturer": "Boom International",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899322,
        "products": [
            {
                "manufacturer": "Boom International",
                "productMake": "BOOM",
                "productModel": "BD125-15",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 35MPH DRIVING DOWN THE A BUSY ROAD AT 7:45PM ON 8/22  MY SCOOTER BEGINS TO SMOKE! I PULL OVER AND ALL OF THE GAS IS DRAINING ON THE THE EXHAUST WHICH THE EXHAUST HAS NOW BEGAN TO FLAME I HAD A WATER BOTTLE AND PUT OUT FLAME AFTER I TURNED OFF THE SCOOTER. I WALK THE SCOOTER HOME WHICH WAS ABOUT A MILE AND A HALF AWAY. WHEN I GET THERE I FIND THAT THE SCREWS HAD FALLEN OUT THE \"SEALED CARB\" THE CARB HAD SCREWS WITH NO HEADS SO IT COULD NOT BE TAMPERED WITH, WHICH I FOUND THE SCREWS ATTACHED TO THE MAGNETIC STARTER. I HAVE VIDEOS OF THE VEHICLE LEAKING THE FUEL AFTER I PUT OUT THE FLAME. I ALSO REACHED OUT TO BOOMMOTOR.COM (T:909-222-6618) & SUPPORT@BDMOTOR.COM AND THEY TOLD ME THEY COULD NOT HELP ME AND BASICALLY THEY DO NOT CARE, BUT I FEEL THAT ALL THERE VEHICLES SHOULD BE RECALLED, AND SHOULDN'T BE STREET LEGAL THIS IS A DANGER!  THIS VEHICLE WAS 2WEEKS OLD AND HAD 50 MILES ON IT!",
        "vin": "L2BBFACG8GB"
    }
]