[
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2022",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "For approximately 2 months, my 2016 Impala LTZ, would display a message on the small screen in front of the driver in the dash, stating for the driver to, \"press ignition button again to turn vehicle off.\" The worst part about it was this would happen very randomly whether I would be driving in city traffic, or be sitting in a parking lot at a local store. I took it to my local Chevrolet dealership. Five different times, because they were not able to get the occurrence to duplicate for them. They replaced the ignition, as well as other suspected parts with no resolution. Resolution. Ended up costing me over $1,200. That was the first time I took it in for this issue. The other four times didn't cost me anything because they hadn't fixed the issue. Come to find out it was a wire on the body control module that had some of the insulation sheathing removed, which then in turn caused the wire to ground out on the car's frame. Just thought I would put this out there in case anybody else goes through it because it wasn't real inconvenience.",
        "vin": "2G1145S32G9"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "On Fb 08 2022, at app 5:30 in the evening my 2016 Impala had a non-driver directed surge of  speed. As I was slowing down to enter a driveway, the vehicle surged forward powerfully. I was able to press the brakes forcefully engaging the antilock mechanism. The vehicle shook as I continued to apply breaking force. It came to stop barely missing another vehicle parked in the driveway. I have no explanation for this dangerous episode. I had not used any type of automatic speed control. The car is serviced by authorized dealership: Hampton Chevrolet in Hampton VA. I was in the car with two of my grandaughters when the incident occurred. I was  able to drive the car back without any problem, but I'm scared to drive it.",
        "vin": "2G1115S36G9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the road at night and attempted a right hand turn when my power steering quit. The warning light on the dash came on. I almost got rear ended by cars coming from behind. I called the previous owner to see if they had ever had this happen. They stated it had happened once. They said they turned off the ignition and waited about 1/2 hour then cranked the car and the problem was solved. That’s what I did and it worked. Since this is an intermittent problem the service tech could not help.",
        "vin": "2G1115S35G9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2021",
        "dateOfIncident": "12/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444839,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Chevrolet Impala. The contact stated that upon starting the vehicle, the check engine warning light illuminated. The contact stated that she was able to drive the vehicle; however, she noticed that smoke coming out of the exhaust pipe was dark blue. The contact stated that upon arriving at her residence, her husband depressed the OnStar On Demand Diagnostic button and the failure was diagnosed as an emission system failure. The contact notified the dealer of the failure and an appointment was scheduled for diagnostic testing. The manufacturer was not notified of the failure. The vehicle was not diagnosed or repaired. The approximate failure mileage was 54,922. Consumer stated fluid leaking from underneath the car and steering noise coming from the steering wheel when turning.",
        "vin": "2G1115S31G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "All instruments failed.  After a couple restarts they came back on.  Lane departure alert doesn’t work now.  From a web search, I’m afraid it’s just the beginning.  No, I haven’t taken it to the dealer; they charge for diagnosis.  And it hasn’t been inspected.  The problem doesn’t act up all the time.  There are no warning lights, the system just fails.  I have 50,600 miles on it.  If you find what I’ve found in my web search, the cost of repair is staggering, especially for retirees.  I hope you look into Chevrolet’s problem they’ve been having with the Impala.",
        "vin": "2g1145s34g9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/14/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I parked my car at work and worked a full day Saturday the 13th of November. I go out to start my vehicle and 3 warnings appear all at once. Stabilitrak, ABS, and power steering. Reading online I’m not the only one but with only 109,xxx miles it’s kind of BS that there’s obviously an engineering flaw with these vehicles and I probably will give a few car payments worth to get this fixed. I’ve owned this vehicle since 17,xxx miles",
        "vin": "2G1115S33G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436003,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Electrical glitches and full loss of engine power wile driving.  Dealer don’t know how to fix it. Very unsafe to drive",
        "vin": "2G1145s32G9"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2021",
        "dateOfIncident": "08/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430033,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "After starting car (and sometimes put in reverse), steering appears locked and message says to get power steering serviced. After putting back in park, power steering starts working. This happened multiple times last few weeks. Took car in to Joe Johnson Chevorlet (Troy OH) for scheduled next morning service. After 2 full days of excusses why they couldn't get to our car, we picked it up and took it to independent service shop. He test drove it and steering was fine. Got car back and next day it happened multiple times again. Took it back to independent to run code, which did not give exact problem. Drove car 1 block and power steering went out turning. Then again 1 block later. It is now parked and afraid to drive it. Chevy seems not to want to work on it and independent does not know what is wrong, said it could take him up to a week to trouble shoot entire system. He hasn't got back to me yet. HELP! Also, parking brake seems to engage by itself overnight. When starting car, sometimes it is on. We never use it. This may be related.",
        "vin": "2G1145S38G9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "08/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving home from work on the highway, the power steering failed and the steering wheel became very physical to actuate. The DIC indicated the warning for power steering off. The failure occurred simultaneously with the warning indication with no prior warning. While driving at high speed, this failure could have caused a serious accident. The failure happened on the street as well. Both times while reaching destination the car was shut off and when restarted, the steering worked once again.",
        "vin": "2G1145S32G9"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424089,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Chevrolet Impala. The contact stated while driving out of a parking space, the steering wheel was difficult to maneuver and she heard an abnormal clinking sound coming from the steering wheel. There were no warning lights illuminated. The vehicle was taken to the dealer who diagnosed that the front axle needed to be replaced. The contact stated that the vehicle was repaired, however, the failure persisted. The vehicle was taken back to the dealer, where it was diagnosed with the steering gear needing to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure but did not provide any assistance. The approximate failure mileage was 75,000.",
        "vin": "2G1115S39G9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "04/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417470,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My brake assist will come and say “brake assist off”. When pushing brakes my car will skip and the brakes sound crunchy. It’s been almost a couple of weeks of this. I’m concerned safety wise due to the fact it almost didn’t stop. No mechanic shop can help apparently though. Any advice? Please and thank you.",
        "vin": "2G11Z5SA1G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS BEEN GOING ON OVER A YEAR NOW AND THE PLACE THAT I JUST HAD AN OIL CHANGE SAID THAT I SHOULD FILE A COMPLAINT. I BELIEVE MY AIRBAG SYSTEM IS DEFECTIVE. SPECIFICALLY WITH THE FRONT PASSENGER SIDE OF THE VEHICLE. I SEE MANY SIMILAR ISSUES ONLINE AND SOME HAVE BEEN RECALLED AND FIXED FOR FREE BY THE MANUFACTURER. THE CHEVY DEALER I WENT TO SAID THAT CHEVY SAID IT IS NOT PART OF A RECALL AND THAT I AM RESPONSIBLE FOR THE FULL COST OF REPLACEMENT. OVER $2000.00. I THINK THAT CHEVY NEEDS TO FIX THIS ISSUE AND COVER IT IN FULL. THE AIRBAG SYSTEM GOES ON AND OFF AT WILL. WORKS AND DOESNT WORK. ESPECIALLY ANY CHANGE IN TEMPERATURE OR A PERSON MOVING AROUND IN THE SEAT MAKES THE WARNING LIGHT GO ON AND OFF. THERE IS DEFINETLY A PROBLEM WITH THEIR SYSTEM AND/OR WIRING.",
        "vin": "1G1145S33GU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/02/2021",
        "dateOfIncident": "04/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 27 APRIL 2021 MY SON IN HIS 2016 IMPALA WAS INVOLVED IN A COLLISION WHEN THE VEHICLE FAILED TO STOP AT AN INTERSECTION.  WHILE ATTEMPTING TO STOP THE BRAKE PEDAL SEIZED AND FAILED TO STOP THE CAR BEFORE HITTING ANOTHER VEHICLE. I AM CONCERNED WITH THIS ISSUE BECAUSE I ALSO HAVE A 2016 TAHOE THAT WAS RECALL (N192261050) FOR A BRAKE ISSUE.   ACCOUNTS OF THE VEHICLES ACTIONS AT TIME OF INCIDENT ARE EXACTLY THE SAME AS WHAT WAS HAPPENING WITH 2016 TAHOE.  WHILE THE 2016 TAHOE HAS UNDERWENT RECALL REPAIR, ITS STILL NOT BRAKING NORMALLY BUT IT DOES STOP ALTHOUGH ROUGHLY.  THE DRIVER OF 2016 IMPALA WAS A PASSENGER IN TAHOE THIS PAST WEEKEND AND DURING A ROUGH STOP THE PASSENGER INDICATED \"THAT'S WHAT MY CAR SOUNDED LIKE WHEN BRAKES DIDN'T WORK.\"  I'VE REPORTED THE ISSUE TO INSURANCE COPY ASKING THEY THOROUGHLY INSPECT THE VEHICLE AND ALSO REPORTED TO MANUFACTURER.",
        "vin": "2G1145S39G9"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "02/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR JUST STOPS ON MY WHILE I'M WAITING AT A LIGHT.CAR JUST SHUTS OFF RANDOMLY   AND IT DOESN'T TURN ON RIGHT AWAY AFTER I PUT GAS   CAR SHAKES AND HAVE TO PRESS GAS ALL THE WAY DOWN TO TURN BACK ON",
        "vin": "2G1145S3XG9"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395344,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY A LOUD EXPLOSION MADE MY  PASSENGER'S AND ME GET STARTLED FOLLOWED BY A RINGING IN OUR EARS. IT CROSSED MY MIND THAT THE VEHICLE WAS GETTING SHOT AT. UPON INSPECTION THERE WAS NO INTERIOR DAMAGE, HOWEVER WHILE INSPECTING THE OUTSIDE OF THE VEHICLE THERE WAS DAMAGE ON THE SUNROOF OF THE VEHICLE. THE SUNROOF HAD SHATTERED IN AN UPWARDS POSITION AS IF IT HAS EXPLODED OR DAMAGE CAME FROM THE INSIDE OUT. CLOSER EXAMINATION DID NOT PROVIDE A REASON OR FOREIGN OBJECT THAT COULD HAD CREATED THE DAMAGE. IT WAS VERY DANGEROUS TO HAVE THIS HAPPEN WHILE DRIVING AND/OR WITH THE POSSIBILITY OF EYES TO FALL ON ANY OF THE PASSENGERS OF THE VEHICLE.",
        "vin": "2G1145S32G9"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394258,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT SIDE (RADIATOR SIDE) CATALYTIC CONVERTER DEVELOPS HAIRLINE CRACKS AND EVENTUALLY BREAKS FROM THE FLANGE ATTACHED TO THE ENGINE. IF IT BREAKS, IT FALLS FORWARD AND GETS CAUGHT IN THE FAN, POSSIBLY CAUSING FURTHER DAMAGE. APPEARS THAT CRACKS DEVELOP DUE TO LACK OF STRENGTH FROM THIN METAL AND POSSIBLE STRESS OF WEIGHT AT GIVEN POINT, WHICH IF UNNOTICED, THE CONVERTER WILL BREAK.",
        "vin": "2G1145S32G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390228,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "1. THE DISPLAY SCREEN WENT BLACK WHILE DRIVING USING NAVIGATION.  THE FAULT WAS A DEFECTIVE HMI MODULE, GM PART # 84296482 AT A COST OF $1100 (SEE ATTACHED DOCUMENT).   THE SUDDEN LOSS OF THE SCREEN WAS DISCONCERTING AND COULD HAVE CAUSED AN ACCIDENT.   THIS SHOULD LEAD TO A RECALL AND REIMBURSEMENT OF THE REPAIR COST.  2. WHEN THE ADAPTIVE CRUISE CONTROL (ACC) CAUSES THE BRAKES TO BE APPLIED IT DOES SO VERY SUDDENLY AND IN THE ABS \"CHATTERING\" MODE EVEN WHEN THERE IS NO COLLISION DANGER.  THIS PRODUCES A JOLT TO THE DRIVERS AND OCCUPANTS WHICH IS AN UNEXPECTED AND UNSAFE RESPONSE.",
        "vin": "1G1145S34GU"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2020",
        "dateOfIncident": "12/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385486,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AND THE REDUCE ENGINE POWER CAME ON, MY VEHICLE IMMEDIATELY START SLOWING DOWN AND I COULDN'T GO OVER 19 MPH !! VERY SCARY AND UNSAFE AND GM HAS FAILED TO TAKE CARE THE PROBLEM!!",
        "vin": "1G1115S31GU"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION FAILURE.  MANY OTHER MODELS 2014-2017 ARE COVERED UNDER GM N172097060 - SPECIAL COVERAGE SIDE BLIND ZONE ALERT MODULE WATER INTRUSION. OUR 2016 IS NOT, BUT DOES HAVE THIS PROBLEM.",
        "vin": "2G1145S34G9"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR BRAND NEW, AND NOW IT HAS JUST OVER 24,400 MILES ON IT AND I HAVE ALREADY HAD TO REPLACE THE FUEL PUMP AND FUEL RAILS ON THE CAR 4 TIMES. LAST TIME WAS JUST DRIVING STRAIGHT DOWN THE HIGHWAY AND UP AND DIED COMPLETELY, CAR WOULD THEN TURN OVER BUT NOT FIRE, SO WAS STRANDED ALONG SIDE THE HIGHWAY WAITING FOR A TOW TRUCK TO COME OUT. I HAD IT REPLACED THE FIRST TIME AT 9991 MILES ON 12-14-17, THEN AGAIN AT 20798 MILES ON 11-20-19, THEN 21074 ON 2-15-20, THEN AT 24111 ON 9-9-20. YES I KNOW IT IS UNDER WARRANTEE AT THIS TIME, BUT GETTING REALLY ANNOYING NOT BEING ABLE TO TRUST THAT NEW OF A VEHICLE TO GO ANY DISTANCE AND NOT KNOWING IF WILL LEAVE SIT STRANDED ALONG SIDE THE ROAD WAITING FOR A TOW AGAIN OR NOT. I HAVE EMAILED THE DEALERSHIP AND THE ARE EMAILING ME A COPY OF ALL THE PAPERWORK, JUST HAVEN'T RECEIVED IT FROM THEM YET TO ATTACH IT, BUT THE HAVE IT ALL AT SCHWIETERS CHEVROLET OF WILLMAR.",
        "vin": "2G1115S36G9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU START IT THE SPEED AND RPM' S START JUMPING THE COOLANT GADGET WAVES AT YOU   THEN WHEN YOU PUT IT IN REVERSE OR DRIVE IT BUMPS WHEN YOU DRIVING YOU DON'T KNOW HOW FAST YOU GOING BECAUSE OF THE GADGET BOUNCING UP AND DOWN TO TOP IT OFF ITS JUMPING THE WHOLE TIME YOU DRIVING IT.",
        "vin": "2G1115S36G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE TURNED OFF SEVERAL DIFFERENT OCCASIONS ONCE AS I WAS DRIVING FREEWAY SPEED APPROXIMATELY 60-65MPH ENGINE COMPLETELY SHUT OFF I ATTEMPTED TO PUT IN NATURAL AND RE START THE IGNITION AS THE VEHICLE WAS STILL MOVING WITH NO POWER VEHICLE DID NOT START I MERGED TO THE SIDE OF THE HIGHWAY BREAKED TO STOP  AND PLACED THE GEAR SHIFT ON PARK AND TRIED TURNING THE IGNITION ON AND STILL DID NOT TURN ON A FEW ATTEMPTS LATER CAR STARTED. ANOTHER INCIDENT I WAS DRIVING CAME TO A RED LIGHT AS I WAS WAITING FOR MY GREEN LIGHT MY CAR SHUT OFF WHILE I HAD MY FOOT ON THE BREAK I PUT THE SHIFT GEAR I TO PARK TURNED THE IGNITION ON AND CAR STARTED",
        "vin": "2G1115S36G9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE AT A LOW SPEED SOON AFTER STARTING, A SERVICE WARNING \" SERVICE POWERSTEERING DRIVE WITH CARE\" APPEARED ON THR DIC. VEHICLE BECAME EXTREMELY HARD TO STEER BUT I WAS ABLE TO MANEUVER IT TO A SAFE LOCATION PUTTING A LOT OF PHYSICAL PRESSURE ON THR STEERING WHEEL.  SWITCHED CAR ON  AND OFF SEVERAL TIMES AND WARNING STILL APPEARED. AFTER REMOVING KEY FROM IGNITION AND SPENDING APPROXIMATELY 20 MINUTES ATTEMPTING TO TROUBLESHOOT, RESTARTED VEHICLE AND WARNING  REMOVED AND WAS ABLE TO STEER AGAIN. WOULD'VE BEEN A VERY NASTY SITUATION FOR A NOVICE DRIVER OR ON A BUSIER AND CURVIER ROADWAY.",
        "vin": "1G1115S36GU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE AIR BAG POPPING UP. CREASE ON DASH",
        "vin": "2G1115S37G9"
    },
    {
        "components": "SUSPENSION,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364163,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAK FROM TRUNK. MOLD. DAMAGE CLOTHING CAR SEAT. THE LINE ISN'T SEALING",
        "vin": "2G1115S36G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354956,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET IMPALA. THE CONTACT STATED THAT DURING INCLEMENT WEATHER, WATER ENTERED THE VEHICLE FROM THE REAR TAILLIGHTS. THE CONTACT STATED THAT THE TRUNK AND THE INSIDE CABIN OF THE VEHICLE EXPERIENCED WATER INTRUSION IN THE VEHICLE. THE CONTACT STATED THAT THERE WAS MOLD AND AN ABNORMAL ODOR INSIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO TWO INDEPENDENT MECHANICS TO BE DIAGNOSED. IT WAS CONFIRMED THAT THE FAILURE WAS WITH THE DRIVER'S AND PASSENGER'S SIDE TAILLIGHTS. THE CONTACT STATED THAT THE COMPUTER IN THE TRUNK OF THE VEHICLE WAS COMPLETELY UNDER WATER. ADDITIONALLY, THE SPARE TIRE AND JACK WERE RUSTED. THE VEHICLE WAS TAKEN TO MIKE ANDERSON CHEVROLET (5333 W IRVING PARK RD, CHICAGO, IL 60641, 773-465-2000) AND AN APPOINTMENT WAS SCHEDULED TO HAVE THE VEHICLE INSPECTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 32,000.",
        "vin": "2G1145S31G9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GOING OUT WHILE DRIVING",
        "vin": "2G1115S34G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342089,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET IMPALA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE LOSS MOTIVE POWER AND STALLED. THE CONTACT STATED THAT CHECK ENGINE WARNING LIGHT ILLUMINATED AFTER THE VEHICLE WAS RESTARTED. THE VEHICLE WAS TAKEN TO SANDY AND BUBBA'S MILTON CHEVROLET (5925 US-90, MILTON, FL 32583) WHERE THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE OR DIAGNOSE THE VEHICLE. SEVERAL MONTHS LATER, THE VEHICLE WAS TAKEN TO HEARTLAND CHEVROLET (501 RTE 291, LIBERTY, MO 64068) WHERE THE VEHICLE WAS DIAGNOSED WITH TRANSMISSION FAILURE. THE CONTACT HAD REACHED OUT TO THE MANUFACTURER AND WAS INFORMED THAT A REPRESENTATIVE WOULD CALL HER BACK HOWEVER, THE CONTACT WAS YET TO RECEIVE A CALLBACK. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 66,000.",
        "vin": "2G1145S35G9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM HAS FAILED, CAUSING MY DASH BOARD TO STAY OFF OR FLICKER AND AT TIMES MY VEHICLE NOT STARTING.",
        "vin": "1G1145S35GU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG MAINTENANCE LIGHT WENT ON, WHILE DRIVING. DEALER INSPECTED AND INDICATED IT WAS A FAULTY SENSOR ON THE PASSENGER AND DRIVER SIDE THAT DOES RECOGNIZE IF THEIR IS A PERSON OCCUPYING THE SEAT.",
        "vin": "2G1115S3XG9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338513,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  AIR CONDITION BLOWING HOT AIR   COST  1700.00 TO REPAIR MY CAR IS A 2016 CHEVROLET IMPALA   THEY SAY THE DASH HAS TO COME OUT TO REPLACE  PART   THERE SHOULD BE A RECALL ON THIS",
        "vin": "2G1115S37G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11332006,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR WENT OUT IN MY CAR. I THOUGHT THAT IT WAS JUST TIME FOR A RECHARGE, BUT WHEN I WENT TO GET IT REPAIRED I WAS TOLD I HAD A LEAK. SADLY AND VERY EXPENSIVE, I GOT THE A/C KIT(ALL COMPONENTS) REPLACED AND IT WENT OUT AGAIN! I WAS TOLD THAT THE IMPALA, AND CAMARO HAD A RECALL ON THE EVAP CORE. I HAVE A 2004 BLAZER AND THE AIR STILL WORKS IN IT! I AM HIGHLY DISAPPOINTED RIGHT NOW AS I'VE ALREADY GOTTEN ONE RECALL FIXED AND THIS ONE ISN'T LISTED. THIS IS AN EXTREMELY COSTLY REPAIR FOR A 4 YEAR OLD CAR!!! I ALSO OWN A 1980 IMPALA. I LOVE CHEVROLET BUT I THINK I GOT A BAD ONE&#128557;  *TR",
        "vin": "2G1115S32G9"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": true,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "06/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330904,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT KEEPS TURNING ON. AND THE CAR HAS TROUBLE SHIFTING. I TOOK IT TO GET IT CHECKED OUT AND THEY INFORMED ME THAT IT HAS TO DO  SOMETHING WITH THE TRANSMISSION AND THAT MULTIPLE PEOPLE ARE HAVING THIS PROBLEM WITH THE SAME TYPE OF VEHICLE.  *TR",
        "vin": "1G1145S3XGU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE IMPALAS ARE DOWNSHIFTING ON GEARS 2/3 AND WHEN TRYING TO ACCELERATE IT IS NOT SHIFTING AS THEY SHOULD   THIS IS FROM MULTIPLE AUTO SHOPS AND CHEVROLET DEALERSHIPS IN DEARBORN AND DETOUR MICHIGAN ARE AWARE AND BOTH ARE STAYING THEY ARE GETTING ALOR IF COMPLAINTS ABOUT THIS ISSUE   I AM. NOT ONE OF THOSE INDIVIDUALS WHO HAVE 4000 JUST SITTING AROUND   I AM ALSO NOT WORKING DUE TO COVID   I HAVE ONLY HAD THIS CAR 15 MONTHS WHEN THIS ISSUES STARTED   GM AND CHEVROLET NEED TO DO A RECALL TO CHECK AND REPLACE AND PROVIDE LOANER VEHICLES AT THEIR EXPENSE.  *TR",
        "vin": "2G1115S30G9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/13/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SIDE DETECTION SYSTEM WARNING CAME ON AND CAR WOULD NO LONGER START. SIDE DETECTION LIGHTS STAY ON AND WON'T GO OFF.  *TR",
        "vin": "2G1115S34G9"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "04/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGIN TO JERK WHEN ACCELERATING.  TOOK THE VEHICLE TO THE DEALERSHIP AND WAS ADVISED THERE WAS INTERNAL DAMAGE TO THE TRANSMISSION.  THE DEALERSHIP ADVISED THEY ARE UNAWARE OF WHAT CAUSED THE INTERNAL DAMAGE.  THIS WAS REPAIRED 9 MONTHS LATER WHILE DRIVING ON THE HIGHWAY AND THE VEHICLE BEGIN TO FLASH A WARNING TO TURN OFF VEHICLE.  ENGINE LIGHT CAME ON AS WELL.  I TOOK THE VEHICLE TO THE DEALERSHIP AND WAS ADVISED THERE IS INTERNAL DAMAGE TO THE ENGINE.  DEALERSHIP ADVISED THEY ARE UNSURE WHAT CAUSED THIS.",
        "vin": "2G1145S30G9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/18/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321461,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS GOING 80 MPH (CRUISE CONTROL) ON THE HIGHWAY, AND IT GLITCHED TURNED ON AND OFF.   WE WERE GOING DOWN HILL MOTION CAR SLOWED DOWN BUT CONTINUED ROLLING. WHEN THE CAR GLITCHES BACK ON 1 MINS LATER KICKED BACK ON CAR PICKED BACK UP TO THE 80 MPH ON THE CRUISE CONTROL.  *TR",
        "vin": "2G1145S32G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE ONLY HAVING 58,000 MILES WITHOUT NOTICE OR ANY WARNINGS BEGAN TO STALL AND WOULD NOT GO PAST 30 MPH. LATER I ATTEMPTED TO PUT VEHICLE IN REVERSE AND IT HAD NO REVERSE WHAT SO EVER. ALL FLUIDS  AND MAINTENANCE WERE UP TO DATE. AFTER CONSULTING WITH SEVERAL MECHANICS IT HAD BEEN DETERMINED THAT THE TRANSMISSION WAS NOT GOOD",
        "vin": "2G1145S32G9"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317229,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN GIVING ME PROBLEMS EVER SINCE I BEGUN USING E85 GAS. CHECK ENGINE LIGHT CONSTANTLY COMES ON AND OFF. MECHANICS FROM THE DEALER TOLD ME I SHOULD STOP USING E85. MAKES NO SENSE. CHEVY SHOULD STOP FALSE ADVERTISING.  THIS IS A COMMON ISSUE WITH CHEVY. WHY MAKE A CAR FOR E85 IF IT WONT WORK PROPERLY IF USE IT. DASHBOARD CONSTANTLY LIGHTING UP LIKE CRISTMAS. SAYS REDUCE ENGINE SPEED. SERVICE STABILITRAK,  SERVICE TRACTION CONTROL.  THIS CAR HAS GAVE ME MORE PROBLEMS THAN ANY CAR I OWNED. THIS SHOULD BE RECALLED.",
        "vin": "2G1WC5E30G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAGS LIGHTS CAN ON MY 2016",
        "vin": "1G1145S38GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11316721,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I REACHED FOR THE DRIVER'S SIDE DOOR HANDLE TO OPEN THE DOOR AND SOMETHING PUNCTURED MY FINGER FROM THE UNDERSIDE OF THE HANDLE WHICH STARTLED ME. I TRIED TO TAKE A CLOSER LOOK, BUT I COULDN'T SEE ANY EXPLANATION FOR THE PUNCTURE, SO I TRIED TO OPEN THE DOOR AGAIN AND RECEIVED ANOTHER PUNCTURE WOUND. BY THIS TIME, MY FINGER HAD BEGUN TO BLEED QUITE A BIT BECAUSE THE PUNCTURES WERE PRETTY DEEP. AT THE TIME, THE VEHICLE WAS STATIONARY BECAUSE I HAD JUST PARKED IN A PARKING LOT, AND I WAS TRYING TO EXIT MY VEHICLE",
        "vin": "2G11Z5SA9G9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311380,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SERICES LIGHT CAME ON FOR POWER STEERING",
        "vin": "2G1115S30G9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310932,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO MY 2016 CHEVY IMPALA LIMITED LTZ  HAS A IDLE ISSUE WHEN I COME TO A STOP.IT WILL IDLE LOW AN STUMBLE LIKE IT'S GOING TO CUT OFF THEN IT GOES BACK TO NORMAL.ANY SUGGESTIONS.MY CHECK ENGINE LIGHT IS NOT ON.IT DOES THIS ALMOST EVERY TIME I COME TO A STOP.",
        "vin": "2G1WC5E34G1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "02/14/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310586,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 POLICE IMPALA WITH 63,829 CAUGHT FIRE AND IS NO LONGER USABLE. THE OFFICER PARKED AND LOCKED THE CAR UP TO DO A FOOT PATROL AROUND BUILDING 33 ON DLA RICHMOND.  WHEN HE RETURNED TO THE CAR, KEYFOB WOULD NOT OPEN THE DOOR SO HE OPENED IT MANUALLY.  WHEN HE OPENED THE DOOR, THE SMOKE FROM THE FIRE BILLOWED OUT, BUT THE FIRE WAS ALREADY OUT.  THE DLA FIRE DEPARTMENT INDICATED THAT THE FIRE STARTED AT THE DRIVER SEAT ELECTRIC MOTOR.  MAINTENANCE RECORDS INDICATE THE SEAT MOTOR WAS PREVIOUSLY SERVICED/REPLACED BY HERITAGE CMA CHEVROLET ON AUGUST 24, 2018.",
        "vin": "2G1WD5E31G1"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306251,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY VEHICLE, THE RPM GOES TO 4 OR 5 WHILE ONLY ATTEMPTING TO DO SPEED LIMING, IT STALLS AND JERKS AS IF SOMEONE IS PULLING ON THE VEHICLE AS I TRY TO ACCELERATE. ON THE EXPRESSWAY, MY VEHICLE STRUGGLES TO HIT 40MPH - 60MPH WITHOUT IT FEELING FORCED AND RPM AT 5. IT STALLS TO REVERSE SOMETIMES AND STALLS TO TAKE OFF.",
        "vin": "2G1105SA8G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300883,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CONCERNING THE 2016 CHEVROLET IMPALA TRUNK, THERE WERE SEVERAL OCCASIONS OF THE TRUNK BEING FOUND OPENED ON IT'S OWN WHEN NOT IN USE.  RECENTLY, THE TRUNK WILL NOT CLOSE OR WILL NOT OPEN.  I'VE PURCHASED FUSES TO NO AVAIL AS THEY CONTINUE TO BLOW.  CONTACTED CHEVROLET CUSTOMER CARE, THEY LIED AND SAID NO COMPLAINTS HAD BEEN RECEIVED ON ANY MODELS SINCE 2000.  THERE ARE AT LEAST 2 OTHER COMPLAINTS ABOUT THE TRUNK ON THE NTHSA SITE.  CHEVROLET (ROB) INFORMED ME MY COMPLAINT IS NOW IN THEIR RECORDS.  CONCERNING THE ELECTRICAL SYSTEM, DOORS COULD BE HEARD CLICKING WHEN NOT IN USE.  MY BATTERY HAS DRAINED SEVERAL TIMES DUE TO EROSION.  I PURCHASED NEW CABLE WHICH WORKED FINE FOR SOME MONTHS BUT THEN HAD TO PURCHASE NEW BATTERY.  THESE ARE OBVIOUS ISSUES GM SHOULD ADDRESS.",
        "vin": "2G1145S38G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "01/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK LID WONT OPEN IN GARAGE, TRIED FACTORY REMOTE, TRIED LATCH ON REAR OF TRUCK LID, TRIED TRUCK RELEASE LOCATED BY STEERING WHEEL. ALL THREE ITEMS ABOVE WONT WORK. HAD TO CLIMB THROUGH REAR SEATS TO GET THE TRUCK TO OPEN. AND PULL SAFETY LATCH.",
        "vin": "2G1145S32G9"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288781,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS DRIVING DRIVING ON THE 91 FREEWAY GOING TO WORK AT THE SPEED, APPROXIMATELY 65 MPH THE TRANSMISSION STARTED SHIFTING ERRATICALLY LIKE IT WAS GOING TO STOP OR IT WAS STUCK IN THE WRONG GEAR. MY HUSBAND WAS TOLD TO MAKE AN APPOINTMENT TO BRING THE CAR INTO GMC WEEKS LATER THEY FINALLY DECIDED THAT WE COULD BRING THE CAR IN ONLY TO BE TOLD THAT THERE WAS NO LIGHTS ON THE DASH BOARD AND THEY TEST DROVE IT AROUND THE BLOCK AND DID NOT FEEL ANY ISSUES.THAN AROUND OCTOBER I WAS DRIVING AND THE AIR BAG LIGHT KEPT POPPING UP ON THE DASHBOARD AND MAKING A BEEPING NOISE AROUND EVERY 2-3 MINUTES OF DRIVING. MY HUSBAND TOOK THE CAR BACK IN TO THE DEALERSHIP(PENSKE CHEVROLET IN CERRITOS AUTO SQUARE) THE TECHNICIAN UNHOOKED THE WIRES FOR THE AIR BAG AND SAID THAT THEY WOULD ORDER THE PART. I WAS INFURIATED!! NOT ONLY WAS I DRIVING A CAR THAT I DO NOT FEEL SAFE IN BUT. I HAVE TO PUT MY 12 YEAR OLD DAUGHTER WHO HAS BEEN HAVING SEIZURES LIFE IN DANGER AS WELL. THE TECHNICIAN ALSO STATED THAT THERE IS A SAFETY RECALL ON THE DEFECTIVE SEAT BELTS AS WELL. ONE MONTH LATER THE DEALERSHIP CALLS MY HUSBAND AND SAYS THAT THE PART IS IN FOR THE SEAT BELT AND AIRBAGS HE INSTALLS IT AND CALLS MY HUSBAND AND SAYS THAT THE PARTS ARE DEFECTIVE. 2 MONTHS LATER TODAY AND STILL HAVE NO PARTS, NO SOLUTION AND THE CONSTANT RUN AROUND!",
        "vin": "1G1145S31GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288261,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2015 CHEVY IMPALA, 3 DIFFERENT MECHANICS HAVE TOLD ME MY BRAKES ARE GOOD AS NEW AND I SHOULDN'T HAVE ANY PROBLEMS WITH THEM HOWEVER MY CAR IS STILL HAVING TROUBLE COMING TO A COMPLETE STOP AND IT'S SCARY BECAUSE NOT ONLY DO I HAVE TWO CHILDRE BUT I ALSO LIVE IN A SNOWY STATE.",
        "vin": "2G11X5SAXG9"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A '16 IMPALA LS2 WITH 37K MILES, AFTER OWNING IT FOR A WEEK, I CHECKED THE AIR PRESSURE ON THE SPARE TIRE TO FIND THE TRUNK WITH ABOUT 4\" OF WATER IN TRUNK, THE DEAL REPLACED THE TAIL LIGHT GASKETS AND HAVE NOT HAD AN ISSUE SINCE.    AFTER DRIVING THE CAR FOR 6 MONTHS AND JUST OVER 10K MILES, I WAS DRIVING THROUGH THE SMALL TOWN I LIVE IN AND MY POWER STEERING JUST STOPPED WORKING AND \"POWER STEERING FAILURE\" NOTE POPPED UP. THANKFULLY GOT PULLED OVER SAFELY, TURNED CAR OFF, WAITED 30 SEC., RESTARTED THE CAR AND STILL NO POWER STEERING. WAS ABLE TO GET THE CAR TO THE DEALER SHIP WHERE I BOUGHT CAR, I WAS FORTUNITE THAT I WAS ONLY 200 YARDS FROM DEALERSHIP. DEALERSHIP CALLED AFTER HAVING CAR FOR ABOUT 4-5 HOURS AND THEY CANT FIND ANY PROBLEM!!!   I SURE HOPE THAT THEY DO FIND SOMETHING AND THEY FIX IT. MY \"CERTIFIED\" WARRANTY WILL EXPIRE IN ABOUT 2500 MILES AND I DON'T WANT THE PROBLEM TO HAPPEN AGAIN AND HAVE TO PAY OUT OF POCKET WHEN THIS IS CLEARLY AND ISSUE ON THESE ELECTRONIC STEERING MODULES.",
        "vin": "2G1115S31G9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE EVERYTHING GOES OUT YOU HAVE NO CONTROL, THE VEHICLE IS COMPLETELY DARK, ABSOLUTELY NO CONTROL. THE VEHICLE WAS IN MOTION, HAD NO POWER AT ALL",
        "vin": "2G11X5SA8G9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HEADLIGHTS WOULD NOT COME ON, NOTHING IS WORKING",
        "vin": "2G1115S34G9"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY IMPALA AIR BAG LIGHT FREQUENTLY LIGHTS UP.  THEN THE PASSENGER AIR BAG LIGHT SAYS OFF EVEN WHEN THERE IS A PASSENGER.  AT OTHER TIMES THE PASSENGER SEAT BELT SIGN IS ON AND THE AIR BAG SIGN SAYS ON, AND THERE IS NO PASSENGER. IT HAPPENS WHEN I START THE CAR AND RANDOMLY WHILE DRIVING.  I HAD THIS DIAGNOSED AT A CHEVY DEALER AND THE CAR NEEDS PASSENGER PRESENCE SENSOR AND ELECTRONIC CONTROL UNIT HARDWARE.  THESE PARTS ARE EXPENSIVE.  THE IMPALA HAS 41000 MILES.  I BELIEVE THIS A SAFETY CONCERN FOR REQUIRED EQUIPMENT ON AUTOMOBILES.",
        "vin": "2G1145S39G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO START THE CAR AND THE SIDE DETECTION SYSTEM WENT OUT AND IS CAUSING ELECTRICAL PROBLEMS IN THE CAR. SIDE DETACTION, COMPUTER, IGNITION, ETC.",
        "vin": "2G1145S3XG9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START AND ALL OF MY SENSORS ARE GOING OFF NEEDING TO BE SERVICED. THEN IT GOES AWAY. I DROVE IT THE DAY BEFORE WITH NO PROBLEMS. GO TO MY CAR THE NEXT DAY AND ALL OF MY SENSORS ARE ACTING UP.",
        "vin": "1G1115S30GU"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING IS ELECTRIC AND IT'S JUST TURNING OFF WHEN THE CAR MAKES A TURN WITHOUT NOTICE.",
        "vin": "2G1115S30G9"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON 2 LANE HIGHWAY AROUND 40-45 MPH WHEN SUDDENLY THE STEERING WHEEL BECAME EXTREMELY HARD TO TURN.  WARNING MESSAGE \"SERVICE POWER STEERING DRIVE WITH CAUTION\" POPPED ON.  HAD EXTREME RESISTANT TRYING TO TURN INTO A PARKING LOT TO CHECK FOR LOST OF FLUID. NEARLY HIT A CAR TRYING TO GET THE IMPALA INTO THE PROPER RIGHT LANE. AFTER ABOUT 30 MINUTES OF LOOKING IN OWNER'S MANUAL AND SEARCHING IN ENGINE COMPARTMENT TO DISCOVERED THAT THIS IS AN ELECTRIC STEERING.  CHECK FOR ANY BLOWN FUSE - FOUND NONE. AFTER ABOUT 45 MINUTES FROM PULLING OVER, RESTARTED THE ENGINE AND FOUND POWER STEERING HAS RETURN TO NORMAL OPERATION.  MILEAGE IS 52,454.  WILL BE CONTACTING DEALER.",
        "vin": "2G1145S38G9"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11233353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVROLET IMPALA. CONSUMER WRITES IN REGARDS TO MALFUNCTION OF TIRES. *LD    THE CONSUMER STATED THAT THE TIRES WERE THE CAUSE OF THE ACCIDENT. THE TIRE MANUFACTURER DID NOT ACCEPT RESPONSIBILITY BUT, STATED THE TIRE DAMAGE WAS DUE TO THE ACCIDENT ITSELF.*JS",
        "vin": "2G1115S34G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "06/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232025,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK FILLED WITH WATER IN TIRE COMPARTMENT.",
        "vin": "2G1115S39G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT COMES ON AND OFF{INTERMITTINGLY) WHILE DRIVING.",
        "vin": "2G1WC5E3XG1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIR BAG LIGHT KEEPS COMING ON SO THEREFORE THE PASSENGER IS NOT PROTECTED. MY CAR IS ONLY 3 TEARS OLD AND THE AIRBAGS SHOULD NOT BE MESSING UP. THE EXTENDED WARRANTY WILL NOT COVER IT. IT IS GOING TO BE $1250.00 TO GET IT FIXED I HAVE A CAR NOTE AND I AM NOT ABLE TO PAY THAT.",
        "vin": "2G1145S32G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING ON HWY AT 65MPH, TWO MINUTES AFTER STOPPING AT A CONVENIENCE STORE. 92F OUTDOOR TEMP. AC JUST COOLED OFF VEHICLE. 2017 BLACK CHEVY IMPALA LTZ. BOTH FRONT WINDOWS AND WINDSHIELD PREVIOUSLY CRACKED AFTER STARTING TO DRIVE WHILE CAR COOLING OFF (AC ON) DURING PREVIOUS SUMMERS. I WAS ON THE PHONE DURING THE SUNROOF BLOWOUT AND THE OTHER PARTY WAS WITNESS TO THE EXTREMELY LOUD EXPLOSION SOUND.  THANK GOODNESS I DECIDED TO TINT THE SUNROOF WHEN I BOUGHT IT, COULD HAVE BEEN MUCH WORSE.",
        "vin": "2G1145S35G9"
    },
    {
        "components": "STRUCTURE,WHEELS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11210725,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS INSPECTED AND AND MARKED \"GOOD\" FOR BRAKES BY FAIRWAY CHEVROLET DEALER IN LAS VEGAS, NV. THE BRAKING SYSTEM DIDN'T SEEM TO WORK AS DID BEFORE. I WAS DRIVING ABOUT 30 MPH APPROACHING AN INTERSECTION WHEN THE VEHICLE IN FRONT OF ME SUDDENLY STOPPED ON THE YELLOW LIGHT. I HIT THE BRAKES AND HELD IT SO HARD I GOT A FOOT INJURY. WITH PLENTY OF ROOM TO STOP THE BRAKES FAILED TO STOP MY VEHICLE BEFORE I COLLIDED INTO THE VEHICLE IN FRONT OF ME. THE AIRBAGS DIDN'T DEPLOY. THE DAMAGE TO MY FRONT END IS ESTIMATED OVER $6000 TO REPAIR. THE OTHER VEHICLE ONLY GOT A SCRATCH ON THE BUMPER. I HAD TO GO TO AN URGENTCARE FACILITY TO RECEIVE EMERGENCY CARE. SOMETHING IS WRONG WITH THE BRAKING SYSTEM. THE SAME SYMPTOMS ARE IN OUR 2014 EQUINOX BUT THE DEALER SAYS THERES NOTHING WRONG. PLEASE CALL ME FOR ANY NEEDED INFORMATION. I CAN SEND MORE PICTURES.",
        "vin": "2G1WC5E33G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/27/2019",
        "dateOfIncident": "05/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION MODULE IS FAILING. I RESEARCHED AFTER MY DASHBOARD WON'T TURN ON, AND AFTER READING SIMILAR COMPLAINTS FROM OTHER IMPALA OWNERS, IT IS DUE TO THE SIDE DETECTION MODULES NOT WORKING PROPERLY. APPARENTLY WHEN THE MODULES FAIL THEY CAN CAUSE ALOT OF ELECTRICAL DAMAGE TO THE VEHICLE. CHEVY OR GM IS NOT ANSWERING MY QUESTIONS, AND I DONT SEE THE NEED TO PAY OUT OF POCKET FOR SOMETHING THAT SEEMS TO BE A PROBLEM IN MOST PEOPLE'S IMPALA.",
        "vin": "1G1145S39GU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207124,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT GOES AND OFF ON THE DASH. I HAD IT SCANNEDC AT AUTOZONE AND THE OBD READER SHOWS \"DRIVER SEAT BELT ANCHOR PRETENSIONER DEPLOYMENT LOOP, SHORT TO GROUND \".",
        "vin": "2G1WC5E3XG1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183670,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOUCHSCREEN RADIO DOESN'T WORK AT TIMES IT'S DOESN'T SHOW ANY PRESET RADIO STATIONS NOR THE TEMPERATURE PLUS I HAVE NO SOUND AND THE ONSTAR DOESN'T WORK PLUS I CAN'T TURN THE RADIO OFF BY PUSHING THE OFF BUTTON IT'S NERVE WRACKING.",
        "vin": "2G1115S31G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183444,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION NOT SHIFTING GEAR, VEHICLE DISABLED AND UNSAFE TO DRIVE. WHEN VEHICLE IS SHIFT IN DRIVE IT PROPELS IN REVERSE. THE ISSUES FIRST OCCURRED WHILE CAR WAS IN MOTION IN DRIVE ON A BUSY TRAFFIC WAY. AS I PRESSED THE ACCELERATOR THE VEHICLE DID NOT MOVE FORWARD AND WAS STALKING BUT THE ENGINE REVVED UP.",
        "vin": "2G1115S3XG9"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING USED IS TASTY TO SQUIRRELS AND MY RIGHT HAND BLINKER WIRING HAS BEEN CHEWED UP TWICE NOW, FIXING IT HAS COST $1000.00 EACH TIME. VEHICLE WAS STATIONARY PARKED IN MY DRIVEWAY  AT HOME.",
        "vin": "2G1115S35G9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182834,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CATALYST CONVERTER EXHAUST BROKE AT THE TOP WHILE DRIVING DOWN THE ROAD (CITY STREET).  THE CAR BECAME LOUD.  NO ENGINE LIGHT OR ANY OTHER WARNING LIGHT CAME ON.",
        "vin": "2G1145S34G9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176174,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET IMPALA. WHILE STOPPED AT A TRAFFIC LIGHT, THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. AN APPOINTMENT WAS MADE TO HAVE THE VEHICLE DIAGNOSED AT FREEDOM CHEVROLET BUICK GMC (8008 MARVIN D LOVE FWY, DALLAS, TX 75237, (972) 649-0829). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 57,292. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "12/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164638,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 24TH OF DECEMBER AS I WAS PULLING INTO THE DRIVEWAY MY POWER STEERING SYSTEM LOCKED UP AND I COULD NO LONGER TURN THE VEHICLE.   THE \"CHECK POWER STEERING\" INDICATOR LIGHT CAME ON.  IT WAS TOWED TO A LOCAL MECHANIC WHO \"RESET THE ERROR CODE\" AND INFORMED ME HE DIDN'T KNOW WHEN AND IF THIS WOULD HAPPEN AGAIN.  I LEFT THAT MECHANIC AND WENT TO THE DEALERSHIP WHERE I PURCHASED THE VEHICLE (PRESTON HOOD IN FORT WALTON BEACH).  AFTER RUNNING A DIAGNOSTIC THERE, THEY SAID NOTHING WAS WRONG AND THEY HAD NEVER SEEN THIS PROBLEM BEFORE.  I HAVE RECENTLY SEPARATED FROM THE MILITARY AND WAS ON THE WAY TO MY NEW JOB ON NEW YEAR EVE.  I WAS DRIVING ON THE INTERSTATE (AT INTERSTATE SPEED) AND THE SAME PROBLEM OCCURRED AGAIN.  I WAS ABLE TO MANEUVER TO AN OFF RAMP WITHOUT CAUSING AN ACCIDENT AND PARKED THE CAR.  IT IS NOW AT A CHEVY DEALERSHIP IN PENSACOLA BEING DIAGNOSED AGAIN.  A SEVERE SAFETY ISSUE THAT COULD HAVE EASILY COST ME MY LIFE OR SOMEONE ELSES'.  I CAN NO IONGER DRIVE THIS VEHICLE WITH CONFIDENCE.  I NEED A LONG TERM SOLUTION AND I NEED YOUR HELP !!!!!!",
        "vin": "2G1145S39G9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET IMPALA. THE CONTACT STATED THAT THE VEHICLE'S TRUNK CONTAINED MOISTURE AND THE CHECK ENGINE INDICATOR ILLUMINATED WHILE DRIVING. THE CONTACT TOOK THE VEHICLE TO CENTURY 3 CHEVROLET (2430 LEBANON CHURCH ROAD, WEST MIFFIN, PA 15122, (412) 466-9210) WHERE IT WAS DIAGNOSED THAT WATER PENETRATED THE TRUNK AND DAMAGED THE TAIL LIGHT GASKET. THE FAILURE WAS DUE TO A MANUFACTURER DEFECT. THE DEALER REPLACED THE TAIL LIGHT GASKET. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 84894766162. THE FAILURE MILEAGE WAS 35,699. *TT*JB",
        "vin": "2G1145S30G9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161027,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAKING A RIGHT TURN AND THE TRACTION STABILIZATION ERROR POPPED UP ON MY DASH AND THE CHECK ENGINE LIGHT CAME ON. I CAME TO A STOP AND THE CAR STARTED SHAKING WHILE IT WAS AT A COMPLETE STOP. THE CAR NEVER SLID OR ANYTHING SO I DON'T KNOW WHY THE STABALIZATION ERROR WOULD COME ON AND THIS IS THE 2ND TIME IT HAS DONE THIS. THE VEHICLE IS FAIRLY NEW SO I DON'T KNOW WHY IT DOES THIS. ONCE I STEPPED ON THE PEDAL SLOWLY TO GO AGAIN THE ENGINE FELT LIKE IT JERKED. I HAVE READ MANY COMPLAINTS ON THIS ISSUE ON OTHER FORUMS.",
        "vin": "2G1115S39G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "11/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152317,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE SPARE TIRE WELL IN THE TRUNK WAS FILLED WITH WATER.  THE TRUNK WAS DAMP IN THE BACK CORNERS BY THE TAIL LIGHTS AND SOME OF MY ITEMS IN THE TRUNK WERE WET.  THIS IS THE FIRST I HAVE NOTICED THIS BUT IT COULDN'T HAVE BEEN LIKE THIS LONG.  IT HAS BEEN COLD OUT AND I ONLY NOTICED A SMALL AMOUNT OF MOLD AND NO ODOR YET.",
        "vin": "2G1115S34G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133273,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE TRUNK FILLS WITH WATER WHEN IT RAINS.  IT SITS ON THE SPARE TIRE AND WILL EVENTUALLY ROT OUT THE TIRE AND TRUNK.  IT'S UPSETTING AS THE ITEMS INSIDE THE TRUNK HAS GOTTEN DAMAGED",
        "vin": "2G1WC5E39G1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/29/2018",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132220,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG REDYNESS LIGHT STAYS ON MOST OF THE TIME BUT IT DOSE GO OFF ONCE IN AWHILE FOR A FEW MINUTES. I UNDERSTAND THIS IS EXTREMELY COMMON AND DATES BACK TO 2009 I STRONGLY FEEL A RECALL ON THIS ISSUE IS IN ORDER BECAUSE POTENTIALLY MILLIONS OFF PEOPLE'S LIVES ARE AT RISK. FROM MY RESEARCH DEALERSHIPS ARE CHANGING $300-400 TO FIX THIS PROBLEM THE PROBLEM SHORTLY RETURNS AND THAT WANT TO CHARGE YOU AGAIN THEY JUST SAY SAVE YOUR RECEIPTS IN CASE A RECALL IS ISSUED. I STRONGLY FEEL GM IS FULLY AWARE OF HOW COMMON THE ISSUE IS AND APPARENTLY THE COST OF A RECALL OUT WEIGHS HUMAN LIFE.",
        "vin": "2G1WC5E33G1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS DO NOT ILLUMINATE THE ROAD PROPERLY AT NIGHT TIME, ESPECIALLY AT DUSK. THE REFLECTOR INSIDE THE HOUSING DOES NOT HAVE SUFFICIENT REFLECTABILITY TO PRODUCE THE APPROPRIATE BEAM. THE HOUSING RELIES SOLELY ON THE BULB TO PRODUCE SUFFICIENT LIGHTING. I HAVE TRIED SEVERAL HALOGEN BULBS AND LED BULBS TO SEE BETTER AT NIGHT WHILE DRIVING AND NOT ONE BULB VS. ANOTHER MAKES MUCH DIFFERENCE. THE HOUSING IS JUST NOT DESIGNED TO PRODUCE A REALISTIC BEAM OF LIGHT FOR SAFE TRAVEL DOWN THE ROADWAY. THE PERIPHERALS ARE OKAY, BUT EVEN THE USE OF THE HIGH BEAM FUNCTION DOES NOT SUPPLY ADEQUATE LIGHTING DOWN THE ROADWAY TO SEE ANY BETTER.",
        "vin": "2G1105SAXG9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "04/02/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 2ND, 2018, I WAS DRIVING TO WORK AROUND 4:50 A.M. DRIVING ON THE 303SB ONLY ABOUT 7 MINUTES INTO MY DRIVE I NOTICED THAT MY VEHICLE BEGAN TO LAG AND STALL OUT, I BEGAN TO NOTICE GREY SMOKE COMING FROM THE HOOD AND THAT'S WHEN I REALIZED THAT MY CAR WAS ON FIRE. WHILE TRYING TO AVOID TRAFFIC AND AFTER ALMOST BEING HIT BY ONCOMING TRAFFIC I WAS FINALLY ABLE TO GET MY VEHICLE INTO A SAFE ARE ON THE SIDE OF THE ROAD AND CALL EMERGENCY ROADSIDE ASSISTANCE ON PROVIDED BY MY AUTO INSURANCE USAA. MY CONCERN IS THAT THE VEHICLE NEVER PROVIDED ANY TYPE OF NOTIFICATION LETTING ME KNOW THAT THE VEHICLE WAS SEVERELY DAMAGED. IF MY OIL IS LOW MY VEHICLE TELLS ME SOMETHING, WHEN THE TIRES ARE LOW ON AIR, MY VEHICLE TELLS ME. HOW COME WHEN MY VEHICLE CAUGHT FIRE AND WHILE IT BEGAN STALLING OUT I STILL RECEIVED NO NOTICE?    I COULD HAVE BEEN KILLED HAD I GOT HIT BY ONCOMING TRAFFIC AND THE SITUATION MAY HAVE ENDED A LOT WORSE. I HAD MY VEHICLE TOWED TO THE NEAREST REPAIR SHOP AS COVERED UNDER THE USAA ROADSIDE ASSISTANCE ENDORSEMENT THAT BEING CHEVROLET SANDS. I RECEIVED A CALL FROM A REP WHO STATED THAT THE VEHICLE HAD HAD PRE-EXISTING DAMAGE TO THE VEHICLE SUCH AS OLD BATTERY ACID THAT HAD OVER TIME ATE AT THE WIRING OF THE VEHICLE CAUSING THE TRANSMISSION TO BLOW OUT. THIS VEHICLE IS A DEATH TRAP. I MENTIONED THAT THE VEHICLE WAS A CERTIFIED PRE-OWNED VEHICLE AND THAT THE VEHICLE WAS ONLY IN OUR CARE FOR LESS THAN A YEAR IN A HALF AND THAT WHEN WE BOUGHT THE VEHICLE IT CONTAINED 20,022 MILES AND THAT THE VEHICLE NOW ONLY HAD ABOUT 65,000 MILES. NONE OF THE SECURITY FEATURES EVER TURNED ON THE AUTO STOP FUNCTION DOESN'T OPERATE, THE BATTERY WAS BUILT ON TOP OF THE TRANSMISSION SAFETY ISSUE. THE  IGNITION CUT OFF DEVICE DIDN'T WORK.",
        "vin": "2G1145S34G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093704,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS, MY AIR BAG PAT KEEPS COMING ON AND I HAVE TAKEN IT TO THE DEALERSHIP TO GET IT CHECK AND IT CONTINUES TO COME ON.",
        "vin": "1G1145S3XGU"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/10/2018",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092811,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE WAY TO WORK IN THESE LIGHTS CAME ON DON'T KNOW WHY BUT I JUST BROUGHT THIS CAR FROM THE DEALERSHIP NOT EVEN MORE THEN 30 DAYS IN THIS COMES ON WTF",
        "vin": "2G1115S35G9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,    I AM REQUESTING TO INVESTIGATE THE DESIGN OF HEADLIGHTS IN CHEVROLET IMPALA 2016 V6 LT.  THE DESIGN OF HEADLIGHTS AND ITS HOUSING FOR THIS CAR NEVER PROVIDE CLEAR SIDE VIEWS OF THE ROAD IN FRONT OF THE CAR. CURRENTLY, THE FOCUS OF BOTH THE HEADLIGHTS (WHEN TURNED ON) STAYS IN THE MIDDLE OF THE ROAD AHEAD WHICH MAKES THE SIDE VIEW OF THE ROAD AHEAD OF THE CAR UNCLEAR. BOTH THE HEADLIGHTS' FOCUSES MERGE AT THE CENTRE OF THE ROAD AHEAD. IT MAKES TO TAKE A TURN VERY DIFFICULT AT NIGHT.  I HAVE TRIED PUTTING HALOGEN, HIDS, LED BULBS INTO MY CAR'S HEADLIGHT BUT NONE OF THE BULBS COULD PROVIDE THE CLEAR VIEW. I HAD TAKEN THE CAR TO A LOCAL CHEVROLET DEALER RECENTLY AND THE TECHNICIAN SAID THAT HOUSING OF THE BULBS ARE DESIGNED SUCH WAY THAT CAR WILL NEVER GIVE A CLEAR VIEW OF BOTH SIDES OF THE ROAD AHEAD.  I HAVE RECENTLY VISITED A LOCAL CHEVROLET DEALER TO CHECK IF THE SIMILAR ISSUE EXISTS IN NEWER VEHICLES, DEALERSHIP CONFIRMED THAT DESIGN OF THE HEADLIGHTS AND THEIR HOUSING IS THE SAME AND HAS CHANGED IN LAST FEW YEARS.    I HAVE ATTACHED A PHOTO OF MY CAR FROM INSIDE WHEN I WAS DRIVING AT NIGHT. IN THIS PHOTO, YOU CAN SEE THE HEADLIGHTS DOES =N'T GIVE ANY CLEAR VIEW OF THE SIDE ROADS/PATHWAYS IN FRONT OF THE CAR. EVEN THOUGH I HAD PUT THE 6000 LUMEN LED BULBS IN MY CAR WHICH ORIGINALLY HAD HALOGEN BULBS FACTORY INSTALLED AND ARE LESS BRIGHT THAN THE LED BULBS.    I WANT TO HAVE A SAFETY INSPECTION OF CARS OF THIS PARTICULAR MAKE AND MODEL AND ITS HEADLIGHT DESIGN.    THANKS AND REGARDS,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2G1115S37G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2018",
        "dateOfIncident": "04/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ITS WAS ROUND 9:00 P.M. WHEN I WAS DRIVING DOWN A TWO LANE ROAD, GOING AROUND A CURVE WHEN ALL MY INTERIOR LIGHTS(DASH BOARD, RADIO, AND GEAR SHIFT LIGHTS)TURN OFF FOR ABOUT THREE SECONDS. THE CAR FELT AS IT WAS COMPLETELY OFF BUT POWERED BACK UP AND CONTINUED TO DRIVE NORMAL.",
        "vin": "2G1105SA6G9"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063631,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOSS POWER STEERING, ABS BRAKE CONTROL AND SPEEDOMETER. MULTIPLE SERVICES LIGHTS FLICKED ON / OFF. HAPPENED SEVERAL TIMES IN THE LAST 1-2 MONTHS, HAPPENED ON CITY STREETS AND THE HIGHWAY. HAD TAKEN TO BE SERVICED TWICE. INTERMITTENT CHECK ENGINE LIGHT TURNS OFF AFTER A DAY OR TWO.",
        "vin": "2G1115S31G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST 3 MO. UPON STARTING THE VEHICLE I HEAR A \"POP\" NOISE. IT ONLY HAPPENS EVERY ONCE IN A WHILE IN THE MORNING OR THE EVENING WHEN I GET OFF WORK. SOMETIMES IT WILL GO A WEEK OR MORE WITHOUT MAKING THE SOUND. THE SOUND WILL NOT REPEAT ITSELF IF I IMMEDIATELY TURN THE CAR OFF AND RESTART IT. THE 1ST TIME I TOOK IT TO THE DEALERSHIP, THEY SIAD NOTHING WAS WRONG & THEY DIDN'T HEAR THE \"POP\". THE 2ND TIME THEY SAID IT WAS THE EXHAUST SO THEY REPALCED SOME HOSES, THE 3RD TIME, IN WHICH THE \"POP\" WAS MORE FREQUENT AND LOUDER, THEY SAID IT WAS THE STARTER STICKING. AFTER REPLACING THE STARTER, A WEEK LATER, I STILL HEAR THE \"POP\" UPON STARTING IT.  THE VEHICLE IS NOT IN MOTION WHEN THIS HAPPENS. OBVIOUSLY, THEY DON'T KNOW WHAT THE PROBLEM IS IF THEY DIAGNOSED IT AS THE EXHAUST FIRST & THEN THE STARTER AND IT'S STILL MAKING THE SAME NOISE AFTER SERVICING BOTH SAID PROBLEMS. I AM VERY FRIGHTENED ABOUT THIS PROBLEM BECAUSE 7 MO. AGO MY BUICK PARK AVE CAUGHT FIRE ON ME IN MY GARAGE UPON STARTING IT AND HEARING THE SAME \"POP\" NOISE. A COWORKER OF MINE HAS THE SAME KIND OF CAR AND IS EXPERIENCING THE SAME PROBLEM. I AM ALMOST SURE WE AREN'T THE ONLY TWO CONSUMERS WHO IS EXPERIENCING THIS ISSUE. I PURCHASED THE CARM ON 04/07/2017 AND THIS PROBLEM STARTED ABOUT THE 1ST TO 2ND WEEK IN AUGUST AFTER MY 1ST OIL CHANGE. PLEASE LOOK INTO THIS, TOO MANY CARS ARE CATCHING FIRE AND PEOPLE ARE BEING HURT AND EVEN KILLED.",
        "vin": "2G1105SA1G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "08/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020091,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SOMETIMES DOESN'T WANT TO STAR(YOU TURN THE KEY TO START AND IT DOES NOTHING )  ALSO WHEN CAR GOES ON AUTO STOP AND COMES OFF AUTO STOP IT CLUNKS LIKE IF THE CAR HAD BAD MOTOR MOUNTS",
        "vin": "2G11X5SA6G9"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/26/2017",
        "dateOfIncident": "12/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11010802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING UP THE HIGHWAY AND A MAN HIT ME FLYING OUT AN PARKING LOT AND THE AIRBAGS NEVER WENT OFF AND I WAS GOING 35 TO 40 MPH, AND HIT AN SUV. NONE OF THE AIR BAGS CAME OUT. SO NOW I HAVE HERNIATED DISK IN MY BCK AMD ALSO LENDONS OUT OF PLACE EVERYWHERE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHTING ON MY INSTRUMENT PANEL FADES OR DISAPPEARS SO THAT I CAN'T SEE INFORMATION LIKE MY ODOMETER READING.  ON JUNE 8, 2017  THE PROBLEM WAS SO BAD THAT I COULDN'T EVEN SEE THE LIGHT THAT SHOWS WHICH GEAR I SHIFTED INTO.  ON JUNE 12, 2017 THE INFORMATION WAS FADED BUT READABLE IF EXAMINED CAREFULLY. I HAD A SIMILAR OCCURRENCE IN MARCH WHILE TRAVELING.  ALL THREE PROBLEMS OCCURRED ON BRIGHT, SUNNY DAYS WHEN THE VEHICLE WAS HOT (FROM DRIVING OR FROM THE TEMPERATURE).  ON JUNE 12, 2017 I NOTED THAT, WHEN I PULLED MY KEY FROM IGNITION, THE KEY HAD GOTTEN SO HOT THAT IT ALMOST BURNED ME.  ALL THREE TIMES THE VEHICLE WAS STATIONARY WHEN THE PROBLEM BEGAN. IT HAD BEEN PARKED AND WHEN THE KEY WAS INSERTED PARTS OF THE INSTRUMENT DISPLAYS DID NOT LIGHT UP AS THEY SHOULD HAVE.  FOR THE MARCH OCCURRENCE, THE VEHICLE WAS TURNED OFF AND AFTER A WAITING PERIOD IT WAS TURNED BACK ON AND THE DISPLAYS REAPPEARED.  FOR THE JUNE 8TH OCCURRENCE, THE DISPLAY GRADUALLY REAPPEARED.  FOR THE JUNE 12TH OCCURRENCE, THE DISPLAYS APPEARED DIM FOR MY ENTIRE 20 MILE DRIVE.",
        "vin": "2G1115S32G9"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "05/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992246,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET IMPALA. THE CONTACT STATED THAT ON SEVERAL OCCASIONS, THE TRUNK UNLATCHED AND OPENED INDEPENDENTLY. AS A RESULT, THE BATTERY WAS DRAINED. THE CONTACT WAS CONCERNED THAT THE FAILURE COULD HAPPEN WHILE DRIVING. NO WARNING LIGHT ILLUMINATED. THE LOCAL BONNER CHEVROLET DEALER WAS CONTACT AT 694 WYOMING AVE, KINGSTON, PA 18704, PHONE NUMBER: (570) 763-9906 WHERE THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 160.",
        "vin": "2G1145S34G9"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968587,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 23, 2017 I WAS PUTTING ON MY SEAT BEAT WHEN ALL OF A SUDDEN I NOTICED IT WAS NO LONGER ATTACHED TO THE SIDE OF THE DRIVERS SEAT. I NOTICED THAT THE ALUMINUM CABLE , WHICH HAS SMALLER STRANDS OF WIRE IN THE MIDDLE OF IT HAD TOTALLY BROKEN FROM ITS BASE. THE CABLE WAS NO LONGER USABLE, THEREFORE THE VEHICLES DRIVERS SEATBELT COULD NOT SECURE THE DRIVER. I CANNOT TELL YOU WHAT CAUSED THIS TO HAPPEN. POSSIBLE BAD DESIGN OF THE SEAT BELT OR METAL FATIGUE COME TO MY MIND.   THE 2016 CHEVROLET IMPALA ONLY HAS A LITTLE OVER 25,000 MILES ON IT. THIS SEAT BELT BREAKING HAS ME VERY CONCERNED, NOT KNOWING IF THIS WILL HAPPEN AGAIN IN THE NEAR FUTURE EVEN WITH THE SEAT BELT BEING REPLACED UNDER WARRANTY. I ALSO KNOW , BEING A RETIRED LAW ENFORCEMENT OFFICER THAT THERE ARE A LOT OF CHEVROLET IMPALAS BEING DRIVER BY OFFICERS OUT THERE ALONG WITH OTHER CHEVROLET POLICE CARS AND PICK UP TRUCKS. IN FACT, I LEARNED WHILE AT THE DEALERSHIP THAT THE SAME PROBLEM HAS HAPPENED TO THE SILVERADO PICK UP TRUCK, ACCORDING TO ONE OF THE EMPLOYEES WORKING THERE. HAD THIS HAPPENED IN A FRONTAL OR SIDE IMPACT, I AM SURE THAT I WOULD HAVE NOT BEEN ABLE TO REMAIN IN MY SEAT.    I ALSO HAD THIS HAPPEN IN MY 2014 CHEVROLET IMPALA AND THE SAME SEPARATION OF THE SEAT BELT FROM THE SIDE OF THE SEAT HAPPENED WHEN I WAS REAR ENDED AT A TRAFFIC LIGHT . THE SEAT BELT WAS PROBABLY READY TO BREAK ANYWAY, BUT THE ACCIDENT FINISHED THE TASK OF IT BREAKING. CHEVROLET KNEW OF THIS, BUT AGAIN THE SAME STYLE SEATBELT THAT WAS IN MY 2014 IMPALA WAS IN MY 2016 IMPALA.    I ASKED FOR THE SEATBELT PARTS OF THIS FIX, BUT THE SERVICE FOLKS AT WALLACE CHEVROLET SAID THEY WOULD BE SENDING THEM TO SOMEONE TO LOOK AT I NOTICED THEM THAT I WOULD BE WRITING YOU AND TO MAKE SURE THE SEATBELT CAN BE VIEWED BY OTHER FOLKS BEYOND THE CHEVROLET TEAM IF NEEDED.",
        "vin": "2G11Z5SA2G9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2017",
        "dateOfIncident": "01/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940402,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO PLACE A COMPLAINT ABOUT MY 2016 CHEVY IMPALA LTZ THAT I PURCHASED FROM CAR MAX IN GLENCOE, IL ON NOVEMBER 11 2016. I AM A FREQUENT TRAVELER TO CENTRAL MICHIGAN AND  ON MY RETURN TRIP TO CHICAGO ON JANUARY 6, 2017, I WAS TRAVELING SOUTH ON HIGHWAY 127 JUST SOUTH OF MT. PLEASANT MICHIGAN WHEN ALL OF SUDDEN, THE CAR LOST POWER AND IT SLOWED DOWN RAPIDLY, THERE WAS A CAR BEHIND ME WHO ALMOST REAR-ENDED ME, MY WIFE AND I WERE TERRIFIED. I PULLED OVER TO THE SIDE OF THE HIGHWAY AND PUT ON MY FLASHERS. I LOOKED AT THE DASH AND THE FOLLOWING ERROR LIGHTS WERE ON (SERVICE ENGINE SOON, CHECK ENGINE LIGHT, REDUCED ENGINE POWER, AND STABLITRACK LIGHT). I LOOKED AT THE OWNER'S MANUAL AND IT SUGGESTED THAT I TURN THE VEHICLE OFF AND THAT IT WOULD RESET. I FOLLOWED INSTRUCTIONS, TURNED ON VEHICLE AND ALL LIGHTS WERE CLEARED EXCEPT CHECK ENGINE LIGHT. I GOT BACK ON THE HIGHWAY AND STARTED TO DRIVE TOWARDS GRAFF CHEVROLET IN MT. PLEASANT. IN ROUTE, IT HAPPENED AGAIN. CAR LOST POWER AGAIN, AND ALL PREVIOUS LIGHTS RETURNED. I SOMEHOW MADE IT TO THE DEALERSHIP. PLEASE SEE ATTACHED INVOICE, CUSTOMER NUMBER 213805 FOR WORK DONE.  FROM WHAT I SEE, ALL THAT WAS DONE WAS ALL CODES WERE CLEARED. I DID SOME RESEARCH ON THE INTERNET AND IT SEEMS TO HAVE HAPPENED TO OTHER CHEVY OWNERS.  I THINK THAT IT'S EXTREMELY DANGEROUS AND MY WIFE AND I NOW LITERALLY AFRAID TO DRIVE THIS CAR. WHAT IS BEING DONE TO ADDRESS THIS PROBLEM, IN MY OPINION, THESE TYPES OF ERRORS SHOULD NOT BE HAPPENING TO A ONE YEAR OLD CAR",
        "vin": "2G1145S33G9"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "12/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10936840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG A FOUR-LANE DIVIDED HIGHWAY WITH A 50 MPH LIMIT WHEN WITHOUT WARNING AN ONCOMING VEHICLE TURNED LEFT INTO ME AT AN INTERSECTION. MY ESTIMATED IMPACT SPEED WAS 35 MPH.  THE AIRBAGS FAILED TO DEPLOY. THE OTHER CAR'S AIRBAGS DEPLOYED.  I WONDER IF THE AIRBAGS IN THE CHEVROLET WERE EVEN INSTALLED.  IT MAKES NO SENSE TO ME WHY THEY DID NOT DEPLOY.  *TR",
        "vin": "2G1115S36G9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10927144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, NOVEMBER 18, 2016 AT APPROXIMATELY 5:20 A.M. I WAS PARKING MY CAR IN A CENTER CITY PARKING GARAGE. I WAS APPROXIMATELY 2 CAR LENGTHS FROM THE PARKING SPOT.  I WAS BACKING MY CAR INTO THE SPOT.  THE CAR WAS STOPPED AND I REMOVED MY SAFETY BELT AND LOWERED THE WINDOW.  I PUT THE CAR IN REVERSE AND DEPRESSED THE ACCELERATOR TO PROCEED INTO THE LINED PARKING SPOT.  THE CAR PROCEEDED AT A HIGH RATE OF SPEED INTO A CONCRETE WALL.  THERE WERE NO OBSTRUCTIONS AND THE ACCELERATOR WAS NOT FULLY DEPRESSED WHEN THIS OCCURRED.  I IMMEDIATELY TOOK MY FOOT OFF OF THE ACCELERATOR AND HIT THE BRAKE BUT THE BRAKE  DID NOT RESPOND SINCE THIS ALL OCCURRED IN ROUGHLY IN SECONDS AND APPROXIMATELY 20 FEET IN LENGTH.  UPON IMPACT A SMOKE FILLED THE CABIN AREA.  I HIT MY HEAD AGAINST THE HEADREST AND SLIGHTLY INTO THE STEERING WHEEL.  ANOTHER PARKING PATRON SAW THIS ALL PLAY OUT AND CAME TO MY AID.  IT WAS A HORRIFIC INCIDENT.  I AM THANKFUL AND LUCKY TO BE ALIVE.  IT WAS AS IF THE CAR ACTED ON IT'S OWN.  AFTER PUTTING THE CAR IN PARK ALL OF THE LIGHTS IN THE CAR AND THE FLASHER WERE ON.  ONSTAR NOTIFIED ME TO ASK IF I WAS OK.  I EXPLAINED TO HER WHAT HAD HAPPENED.  AFTER TWO HOURS NO ONE CAME TO MY AID DESPITE BEING TOLD SOMEONE WAS DISPATCHED.  THE BATTERY WENT DEAD AND IT WAS AT THAT TIME I CONTACTED AAA TO HAVE THE CAR TOWED OUT OF THE GARAGE.  IT IS CURRENTLY IN \"BRENDAN'S COLLISION, LTD, 210 W. HILLCREST AVENUE, HAVERTOWN, PA.  I CONTACTED GM IMMEDIATELY AFTER THE ACCIDENT AND THEY TOOK A REPORT.  THE CAR WAS PURCHASED IN JULY 2016 AND HAD 3021 MILES ON IT.  IT WAS SURREAL AND I WAS FULLY AWARE OF WHAT WAS HAPPENING DURING THIS WHOLE ORDEAL.",
        "vin": "2G1145S34G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "07/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892209,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING ON THE HIGHWAY OR LOCAL ROADS. MY VEHICLE WOULD WARN ME TO SHIFT INTO PARK TO STOP THE ENGINE. THE AFTER 3 NOTICES IT WOULD SHUTDOWN COMPLETELY.",
        "vin": "2G1145S35G9"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876611,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT THE TOP OF THE HILL ON A PRIVATE ROAD. WHEN I TOOK MY FOOT OFF THE BRAKE AND PRESSED THE ACCELERATOR, NOTHING HAPPENED. THE CAR BEGAN TO ROLL BACKWARDS AND I PRESSED DOWN ON THE BRAKE. THE BRAKE WAS VERY WEAK AND IT TOOK 50-60 FEET AND ALL OF MY PRESSURE ON THE BRAKE PEDAL TO BRING THE CAR TO A STOP. AFTER I STOPPED, I REALIZED THAT THE ENGINE HAD TURNED OFF AND THE IGNITION WAS INT HE OFF POSITION. I ROTATED THE KEY IN THE IGNITION BACK TO THE START POSITION TO START THE ENGINE. I CONTINUED BACK UP THE HILL NORMALLY AFTER THE ENGINE WAS STARTED. LUCKILY, THERE WERE NO CARS BEHIND ME ON THE HILL OR THEY WOULD'VE BEEN HIT.",
        "vin": ""
    }
]