[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457569,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine and engine parts of my vehicle malfunctioned and caused excessive oil leakage. The vehicle is available for inspection upon request.   The safety of my family is put at risk because: - The vehicle engine sputters while driving. - The engine leaks oil excessively, smokes, and lets off an oil burning odor. - The radio screen blanks out frequently.  All of the issues combined worry me because I have had the vehicle serviced multiple times and the safety issues still exist.   The vehicle was serviced by the manufacturer. The problems found were: engine concern for squeaking drive belt, front timing cover leaking oil, and camshaft cover leaking. The vehicle had special coverage warranties with the manufacturer for some of the parts that needed to be repaired.   There were not any warning lamps, messages, or indicators for the engine issues. I encountered the engine smoking, the vehicle sputtering, a strong odor of oil burning, and excessive oil leakage spots in my driveway. These issues made me take the vehicle in. The engine light did not light up for the issues. No indicator light(s) were on when the vehicle was taken in to be serviced.   The vehicle was serviced and the faulty parts were replaced. However, the same issues are present and have not subsided after being serviced, replaced, and or repaired. I worry that the engine issues for my vehicle can not be corrected and that select engine parts should be recalled.",
        "vin": "1G1PF5SB2G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "There was a recall on leaking antifreeze for previous Chevy Cruze years but that is also happening with my 2016 Cruze in the same way. My car would not warm up in the cold and would not clear the sight of my windshield over the ice, I waited about an hour for the sun due to lack of heat. While on my way my car then overheated while on the highway which created an even bigger safety issue. The problem has been recalled before on different Cruze year types, my mom had a 2013 Cruze with the same issue I am experiencing. It has not been inspected yet by those listed but when I add more coolant it is empty within an hour of just sitting there. The only light is when it was overheating, but I’ve been having to refill my antifreeze repeatedly and unsure as to why until I discovered the previous recall information and it sounded like my exact issue.",
        "vin": "1G1PC5SG0G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "02/21/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453444,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Cracked Thermostat Housing Unit. No sensors went off, and smoke started pouring out from under the hood obscuring vision. Vehicle is already under repair so not available for inspection. The Thermostat Housing Units, after first repair taking the one that came with the vehicle, have also all cracked, and has had to be replaced multiple times.",
        "vin": "1G1PE5SB9G7"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452248,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Both side airbags deployed without crash or damage to the vehicle.  Passenger and driver seatbelts locked.  Front airbags did not deploy.",
        "vin": "1G1PE5SB6G7"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "1st of all the motor was running g great! Then all of a sudden it started running rough and shaking. Was driving on the highway at 65 mph.no warni g lights or anything. Then a warning light came on for the brakes and it was hard to stop. The vacuum pump went out for the brakes and almost ended up in the ditch. Well put a vacuum pump on it and that fixed that problem but it was missing like crazy. Had it checked out and here the #1cylinder piston broke apart. Now it needs a motor. Almost cost me my life on that one.Motor is not cheap and don't know if it is worth it. I have been reading alot on them and people are having to change motors at 8,000 miles and sometimes twice in the same car before 18,000 miles. Don't you think there is something wrong with that?",
        "vin": "1G1BE5SM8G7"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2021",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438781,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PCM failure Almost had numerous accidents. The problem has not been reproduced or confirmed by a dealer or service center. It has been reproduced by other people after explaining the issue. Also has been reproduced on another Gm product around the same year. Vehicle has been inspected by an independent shop, the only thing that was found was excessive brake wear in rear. Problem appeared when I first started driving the car. It is definitely a software issue. Software should be polling the wheel speed sensor while in engine off. There were no idiot lights. Recently, on a private road that had an inclination, I reproduce the problem. The vehicle obtained at least two miles an hour rolling backwards for about a minute.  The speedometer did not register any speed. I did not want to test this any longer for fear of engine starting back up and damaging the transmission.     Approaching a stop softly applying the brakes with an incline, whether at a controlled intersection or in traffic, when the auto engine shutdown activates, the vehicle rolls backwards.",
        "vin": "1g1bc5sm8g7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a Chevy Cruze LT 1.4 l turbo engine and it has an exhaust leak by the manifold or the Cadillac converter is not working, a mechanic we took it to has confirmed that one of the hoses going into the Cadillac converter burst due to the Cadillac converter not working properly today is October 2nd it happened three days ago from today I have talked to other Chevy Cruze owners and confirmed the day also had the same problem I heard there is a recall for this problem on 2016 Chevy cruise so I would like to know if my car is on that recall list so I can go and get it fixed I have $133,000 miles on my car so it's not under the manufacturer's warranty anymore it is a very pricey repair which I do not have the money for due to the pandemic as we all know so please contact me through my email you guys have onfile and also because of this problem I cannot work I use my car for work,My car is a 2016 Chevy Cruze LT with a 1.4 L turbo engine thank you",
        "vin": "1G1PE5SB2G7"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/04/2021",
        "dateOfIncident": "08/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431737,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The driver's windshield wiper is not working properly.  It seems that the wiper has become loose.  I live in Florida and it rain a majority of the time, so this is a issue when it comes to driving everywhere.",
        "vin": "1G1PE5SB3G7"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Chevrolet Cruze. The contact stated that after depressing the button to raise the front driver’s side window, a mechanical motor noise was present, and the window would not move and remained stuck in the halfway opened position. The vehicle was taken to an independent mechanic who diagnosed that the front passenger’s side window regulator was faulty and needed to be replaced. The vehicle was not yet repaired. The manufacturer and local dealer were not yet notified of the failure. The failure mileage was 83,000.",
        "vin": "1G1PE5SB3G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2021",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My car and 2 other Chevrolet Cruzes that I know of have had overheating problems with the engines.",
        "vin": "1G1PE5SB0G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Coolant system.  I had to pull over on a major I-70 coming into Kansas City.   A major extremely dangerous and  busy area.  I had to get off on exit 69South.  It was 100 degrees outside.  was not able to let the car cool down all of the way.  I would wait for 45 mins, drive two miles and have to pull over again.  Check engine light came on.  Overheating alarm came on with turn off ac.  Which I did and turned on the heater.  AGAIN, it was 100 degrees outside.  I was without a vehicle in a dangerous part of town.",
        "vin": "1G1PE5SBXG7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "When slowing down car just dies out. Not check engine light on and no codes are being thrown. It’s very dangerous when your on the freeway In stop and go traffic and your car just dies with out warning. Everything freezes up the steering and brakes. Thankful car starts back up after a few minutes",
        "vin": "1G1PF5SB1G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/19/2021",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425461,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Chevrolet Cruze. The contact stated while driving 60 mph, the hydroplane warning light illuminated and the vehicle independently downshifted and decelerated to 50 mph. The contact stated that a couple of weeks later, the contact was driving at 65 mph and the vehicle independently downshifted and decelerated to 55 mph. The contact then stated that while driving at various speeds, the air bag warning light illuminated causing the vehicle to stall. The vehicle was not taken to a local dealer or independent mechanic to be diagnosed. The vehicle was not repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 109,911.",
        "vin": "1G1PE5SB3G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "06/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my 2016 Chevy Cruze and a light appears om my dashboard saying the my engine was overheating. My mechanic was booked, and recommended a shop down the road. I brought my car in on 4/8/21. The Coolant housing and hose.  Then on May 27th I was driving to the store and I received the same message that my car was overheating. I brought it to my mechanic after the long holiday weekend. He says it needs another coolant hose. My research shows that this is not uncommon in these cars. Isn't there something that can be done? I bought the car used in 2018. I have 97k miles on it, and I am still making payments.",
        "vin": "1g1pe5sbxg7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT WENT ON AND I PAID $940.00 TO TRY TO FIX THE PROBLEM. THE PROBLEM WAS NOT FIXED AND THE QUOTE TO FIX THE PROBLEM WAS ESTIMATED TO BE APPROXIMATELY $2,000.00. I CAN DRIVE THE CAR, BUT I WILL NOT PASS THE OH EMISSIONS TEST UNTIL IT IS FIXED.",
        "vin": "1G1PE5SB6G7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/13/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416503,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING, 55 MILES AND HOUR ON HIGHWAY. I WAS  WAS STRUCK ON THE DRIVER FRONT SIDE BY ANOTHER VEHICLE AND THE AIRBAGS DEPLOYED.  UPON DEPLOYMENT THE EXTREME FORCE OF THE CARS BAGS KNOCKED ME OUT THEREBY CAUSING ME TO RUN OFF THE ROAD. .",
        "vin": "1G1PE5SB4G7"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "04/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408416,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 CHEVROLET CRUZE IS ONLY 4 YEARS OLD. I HAD TO REPLACE THE THERMOSTAT AND AFTER A INSPECTION. THE (VVT) VARIABLE VALVE TIMING WHEN TRYING TO START MY CAR, IT WOULD CLICK BUT WOULDN'T TURN OVER ALL LIGHTS AND POWER WAS ON BUT CAR WOULD NOT START.  ALSO, MY ENGINE LIGHT WAS ON AND AND THE METAL WIRE RING INSIDE OF THE STARTER WAS COMPLETELY BROKEN IN HALF.AND HAD TO BE REPLACED",
        "vin": "1G1PC5SH0G7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING OIL RIGHT BENEATH THE DIPSTICK BUT NOT DIRECTLY OUT OF THE DIPSTICK. COMING FROM UNDER THE PLASTIC ECO TECH COVER",
        "vin": "1G1PE5SB8G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "03/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 CHEVY CRUSE WITH 70,000 MILES AND AS OF 3-4-2021 I HAVE A CRACK ENGINE BLOCK. MY CAR AS BEEN SERVICED ACCORDING TO BOOKLET.I HAVE CALLED DANVERS CHEVROLET WHERE CAR WAS PURCHASED AND THEY ARE UNWILLING TO HELP. THIS IS A SERIOUS ISSUE AND I AM DISAPPOINTED THAT HERB CHAMBERS SELLS CUSTOMERS CARS THAT BREAK DOWN AFTER WARRANTY. CUSTOMER SERVICE AND MODEL OF CAR WAS DECISIVE IN MY PURCHASE OF THIS VEHICLE. MY EXPECTATIONS OF HERB CHAMBERS CUSTOMER SERVICE IS A LETDOWN. I COULD HAVE BEEN SERIOUSLY INJURED WHILE DRIVING WHEN THE CAR DIED IN THE BOURNE ROTARY",
        "vin": "1G1PC5SG1G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON I PAID OUT OF POCKET FOR 3 DIFFERENT DIAGNOSTICS FOR THEM TO SAY THEY FIXED IT AND STILL HAVE THIS PROBLEM. CAR GOES IN STABILITY TRACK AND REDUCED ENGINE POWER WONT DRIVE OVER 5MPH THIS IS THE SAME PROBLEM I SEE NUMEROUS OTHER PEOPLE WITH THIS CAR ARE COMPLAINING ABOUT WHY ARE YOU GUYS NOT INVESTIGATING OR RECALLING THIS ENGINE BECAUSE IT'S CLEARLY A MANUFACTURER ISSUE",
        "vin": "1G1BE5SM7G7"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "02/13/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11396071,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND REPORT I'M MAKING ABOUT THIS CARS ENGINE PROBLEMS THE STABILITY TRACK AND REDUCED ENGINE POWER CAUSED MY CAR TO STOP ON THE EXPRESSWAY AND I ALMOST HIT SOMEONE ! PLEASE INVESTIGATE INTO THIS ISSUE THEIR ARE SEVERAL PEOPLE UNDER THIS POST FROM DIFFERENT PARTS OF THE WORLD SAYING THE SAME THING",
        "vin": "1G1BE5SM7G7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/10/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IM DRIVING AND STOP AT A LIGHT IT SOUNDS LIKE MY CAR IS GONNA DIE IT SPUTTERS AND ALMOST DIES AND NOW ITS DYING WHEN I STOP AT A LIGHT BUT CRANKS RIGHT BACK UP AFTER IT DIES THERE WAS A ERG VALVE RECALL WE GOT FIXED BUT IT SEEMS TO BE THE SAME ISSUE AS BEFORE",
        "vin": "1G1PC5SH8G7"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "12/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEH STARTED WITH A SMALL WATER LEAK, THEN A VERY LARGE LEAK. FOUND OUT THAT THE WATER PUMP WAS BAD AND THE THERMOSTAT WAS BAD. THE WINDSHIELD WIPER FLUID HOLDER HAS A LARGE CRACK IN IT. THE VEHICLE STILL NEEDS MAINTENANCE ON IT AND CAN'T AFFORD IT. NO PHOTOS TO SHARE BUT RECEIPTS OF MY BILL TO REPLACE IT",
        "vin": "1G1PE5SB5G7"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389330,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT HAD COME ON I GOT IT CHECKED AT MY MECHANIC BUT CAN'T SEEM TO FIGURE OUT THE PROBLEM. WHEN YOU FIRST START THE IGNITION IT FEELS LIKE THE CAR IS BOBBING BACK AND FOURTH. ALSO AFTER THE AUTO STOP GOES ON AND YOU TAKE YOUR FOOT OFF THE BRAKE AND PUT IT ON THE GAS PEDAL THE CAR STUTTERS. I ALSO HAD A PROBLEM WHEN I WAS COMING OUT OF MY DRIVEWAY IT STALLED AND LOST ALL POWER STEERING I HAD TO TURN THE CAR OFF AND BACK ON AGAIN.",
        "vin": "1G1BC5SMXG7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "12/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS SHAKING PROFUSELY ON LOCAL STREET, DID NOT ACCELERATE BEYOND 5 MPH, AND HAD A 'STABILITRAK' ERROR CODE. BARELY MADE IT BACK TO THE DRIVEWAY. HAD IT TOWED TO A DEALERSHIP AND CONFIRMED PISTON/CYLINDER PROBLEM, WHICH WILL REQUIRE A COMPLETELY NEW ENGINE. BOUGHT IT USED IN 2018 (WITH 54K MILES) FROM A DEALER, BUT WAS NOT MADE AWARE OF SERVICE BULLETIN PIP5421; AND THE MFG'ERS WARRANTY IS NO LONGER VALID AS THERE IS OVER 90K MILES (BUT STILL WITHIN 5 YEARS).  DEALER INDICATES IT WILL COST $9500 TO PUT NEW ENGINE IN, AND WE STILL OWE ON IT....WORTHLESS CAR!",
        "vin": "1G1BE5SM4G7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387859,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON. TOOK CAR TO DEALERSHIP TO GET CHECKED. THE PURGE VALVE, WATER PUMP, AND CAM ACTUATOR SEALS ALL WENT BAD.",
        "vin": "1G1PE5SB4G7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387432,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BEFORE LEAVING WORK, I TURNED ON MY CAR FOR ABOUT TEN MINUTES TO WARM UP. WHEN I ENTERED THE CAR TO LEAVE WORK, I WAS OVERCOME WITH THE SMELL OF WHAT I THOUGHT WAS GASOLINE. I DROVE LIKE NORMAL ON MY WAY HOME, ROLLING THE WINDOW DOWN TO GET RID OF THE SMELL, AND I ALSO THOUGHT SOME SMOKE OR HAZE MAY HAVE ENTERED MY CAR, ALTHOUGH IT WAS DARK AND FOGGY SO I CANNOT BE SURE. WHILE DRIVING ON THE HIGHWAY, MY CAR'S (2016 CHEVY CRUZE) OIL LIGHT CAME ON. IT GAVE ME AN URGENT MESSAGE OF \"LOW OIL PRESSURE- STOP ENGINE\" AND BEEPED CONTINUOUSLY, WHILE A THICK SMELL OF OIL FILLED THE CAR. I AM VERY LUCKY THAT I WAS NEAR AN EXIT AND I PULLED OFF IMMEDIATELY INTO A GROCERY STORE PARKING LOT. THE CAR HAD TO BE TOWED AND LATER THAT WEEK, I LEARNED THAT MY CAR HAD LEAKED 3.3 QUARTS OF OIL, LEAVING ME WITH 1.25 QUARTS. THE MECHANIC TOLD ME THAT I WAS LUCKY I PULLED OFF WHEN I DID, AND THAT THERE WAS A SERIOUS RISK OF ENGINE DAMAGE. HE ALSO LET ME KNOW THAT ANOTHER CAR, SAME MAKE AND MODEL, WAS ALSO IN THE SHOP WITH THE SAME EXACT PROBLEM, AND THAT THAT CAR'S ENGINE HAD TO BE REPLACED. I QUOTE FROM MY $500+ INVOICE, \"THE TURBO OIL FEED PIPE WAS LEAKING AT THE OIL COOLER DUE TO POOR SEALING. VEHICLE WAS 3.3 QUARTS LOW ON FLUID.\"",
        "vin": "1G1PE5SB6G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2021",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2016 CHEVROLET CRUZE WITH AN AUTO STOP FEATURE. THE VEHICLE WAS PURCHASED AS A USED VEHICLE IN AUGUST OF 2019. AT THE TIME OF PURCHASE, IT HAD 70,000 MILES ON IT. LESS THAN TWO MONTH INTO HAVING THE VEHICLE, THE CAR STARTED SHUTTING OFF EACH TIME I CAME TO A COMPLETE STOP. THE ONLY WAY TO GET THE CAR MOVING AGAIN WAS BY PLACING IT IN PARK AND RESTARTING THE VEHICLE. THIS ISSUE OCCURS IN ALL SETTINGS INCLUDING CITY STREETS AND HIGHWAYS. I HAVE TO BE IN TRAFFIC IN ORDER FOR THE ISSUE TO PRESENT ITSELF ON THE HIGHWAY. THE ISSUE PRESENTS ITSELF ON THE STREET ANYTIME I STOP AT A LIGHT, STOP SIGN, OR YIELD TO ONCOMING TRAFFIC. IT HAS DONE THIS HUNDREDS OF TIMES TO DATE. I TOOK THE CAR TO A CHEVROLET DEALERSHIP IN OCTOBER OF 2019 SHORTLY AFTER THE ISSUE BEGAN. A REPRESENTATIVE EXPLAINED THAT THIS HAPPENED BECAUSE THE AUTO-STOP COMPONENT WASN'T ABLE TO RECEIVE ENOUGH POWER TO STAY ON. I HAD THE COMPONENT REPLACED OUT OF POCKET, SINCE MY WARRANTY DIDN'T COVER. THE SAME DAY I DROVE THE VEHICLE HOME, THE ISSUE PERSISTED. SINCE THEN, I HAVE ALSO HAD THE BATTERY REPLACED. AS OF NOVEMBER 2020, THE CAR IS STILL EXPERIENCING THE SAME ISSUES, COUPLED WITH A CHECK ENGINE LIGHT THAT COMES ON AND GOES OFF EACH TIME RESTART THE VEHICLE. THE TECHNICIANS HAVE NOT BEEN ABLE TO PROPERLY DIAGNOSE THIS VEHICLE'S ISSUE AFTER MULTIPLE VISITS. MUCH OF MY TIME AND MONEY HAS BEEN WASTED TRYING TO FIX A VEHICLE WITH NO ACTIVE RECALLS. THIS IS ALSO THE SECOND TIME I AM FILING A COMPLAINT WITH THE NHTSA.",
        "vin": "1G1BE5SMXG7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "11/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CARS CAM SHAFT WAS REPLACED SIX MONTHS AGO, AND IT WAS STILL UNDER WARRANTY. NOW I'M HAVING A BUNCH OF OTHER ISSUES SOME OF THE PROBLEMS ARE BECAUSE THE CHEVY DEALERSHIP, THAT REPLACED IT MY CAM SHAFT WHEEL THEY HAD TO TO TAKE PARTS OFF AND BACK ON TO FIX IT NOW THOSE PARTS THEY TOOK OFF AND NOW BAD PLUS OTHER BOTTOMS UP. IT WON'T KEEP COOLANT. AND KEEPS OVER HEATING, AND THE DEALERSHIP, IS TRYING TO OVER PRICE ME ON PARTS THAT I CAN GET, FOR A FRACTION OF THE PRICE THERE CHARGING ME, AND NOW I'M WITH OUT A VEHICLE UN LESS I COME UP WITH OVER $1400, I FEEL LIKE THEY PURPOSELY DIDN'T PUT EVERYTHING BACK TOGETHER RIGHT, CUZ THEY NEW THEY COULD GET AND MAKE MORE MONEY OUT OF IT BECAUSE SOME OF THE PARTS ARE STILL UNDER WARRANTY. PLUSE WHEN THEY FIXED IT THE FIRST TIME. THEY CHARGE FOR A NEW BELT ON THE CAR AND I ALREADY HADE ONE WHICH WASN'T MINE TO START WITH, IT BELONG TO A FRIEND OF MINE, AND THE STOLE IT AND PUT IT ON MY CAR THEN CHARGE ME FOR IT. BE CAUSE IT WAS IN THE BACK SEAT,   MY VEHICLE IS SITTING AT THE SHOP NOW. IT'S AT LEACH-WILSON CHEVROLET-BUICK IN SHELBYVILLE ILLINOIS, THERE GOING TO START WORKING ON IT ON JANUARY 11TH, THAT'S WHAT THEY SAID ANYWAYS AND I DON'T FEEL SAFE WITH THEM DOING THAT BUT I HAVE NO OTHER OPTION RIGHT NOW. AND I'M BEING FORCED TO PAY OVER $1400. PLUS THEY STOLE PARTS OUT OF MY CAR I WAS HOLDING FOR A FRIEND AND I HAD IN THE CAR AND THEY USE THEM AND CHARGED THE WARRANTY FOR THOSE PARTS AND IT WASN'T THEIRS TO SELL LIKE THAT",
        "vin": "1G1PE5SB3G7"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS PARKED LOOKS LIKE A RAINBOW COLOR IS COMING OUT FROM UNDER THE ENGINE. IT LOOKS LIKE WATER FROM A DISTANCE UNTIL YOU GET CLOSER. I HAVE NOTIFIED THE DEALERSHIP WHERE I BOUGHT IT AND HE TELLS ME THERE IS NOTHING THEY CAN DO",
        "vin": "1G1PE5SB5G7"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD BLEW OUT IT'S SENSOR. NOT LIKE IT JUST WENT OUT,  BUT SOME HOW PRESSURE BUILT UP AND BLEW IT OUT OF THE MANIFOLD. THIS IS EXACTLY WHAT THE REPRESENTATIVE AT THE DEALERSHIP JUST TOLD ME OVER THE PHONE. CAR IS AT THE SERVICE DEPARTMENT BECAUSE OF THE ONGOING ISSUES WITH THE TURBO AND THE MISSING BOLTS AND THE FACT THAT THIS ENGINE WAS OBVIOUSLY A FAULTY BUILD, AS GM HAS ALREADY ACKNOWLEDGED. I AM TERRIFIED TO DRIVE THIS CAR AND I STILL OWE ON IT. SO NOW WITH THE INTAKE MANIFOLD BLOWING UP AND A LEAKING VALVE COVER....I JUST DON'T UNDERSTAND HOW GM ISN'T RESPONSIBLE FOR GETTING THESE CARS OFF THE ROAD. I AM SO AFRAID OF BLOWING UP WHILE DRIVING THIS CAR I DON'T KNOW WHAT TO DO AND I BELIEVE IN KARMA AND DO NOT WANT TO TRADE IT IN FOR FEAR OF RISKING SOMEONE ELSE'S LIFE. I'VE OWNED A LOT OF VEHICLES IN THE 30 YEARS I'VE BEEN DRIVING AND AM THANKFUL I'VE NEVER HAD THIS PROBLEM BUT GOOD LORD, HOW DO I FIX THIS?",
        "vin": "1G1PG5SB5G7"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER, MY DAUGHTERS 4 SIDE AIRBAGS BLEW OUT WHILE DRIVING. SHE WASN'T IN ANY COLLISION OR ACCIDENT, THEY JUST BLEW OUT AND THE PIECE THAT BLEW OUT ON HER SIDE, HIT HER IN THE HEAD TOO.IN MAY, LESS THAN A WEEK AFTER WE GOT THE CAR, SHE WAS GOING UP AROUND A CURVE, SOMEONE CAME AROUND THAT CURVE ON HER SIDE, HITTING HER DRIVER SIDE MIRROR, CRACKING,AND BREAKING THE GLASS. SHE WAS RAN OFF THE ROAD BY THE OTHER DRIVER, AND SHE DID GO OVER ROCKS, SCRATCHING THE BOTTOM OF THE CAR, WE PUT IT ON A LIFT AND THERE WASN'T ANY DAMAGE, JUST SCRATCHED. AFTER HER AIRBAGS DEPLOYED, I WAS TOLD TO CONTACT GENERAL MOTORS RIGHT AWAY, SO I DID. I TOLD THEM WHAT HAPPENED, AND MADE SURE I TOLD THEM WHAT HAPPENED IN MAY,THE LADY THAT TOOK THE CLAIM, SAID THAT'S FINE, SHE WILL MAKE SURE ALL THAT WAS NOTATED! NOW, FROM THE TIME I CALLED GM, IT TOOK THEM A WEEK TO CONTACT ME, WHICH IS UNACCEPTABLE. I EVEN CALLED BACK IN A COUPLE DAYS DEMANDING SOMEONE CONTACT ME RIGHT AWAY. I WAS TOLD IT WAS A MECHANICAL ISSUE, AND IT NEEDS TO BE DEALT WITH. I WAS TOLD BY A GM DEALERSHIP, THAT IT IS VERY OBVIOUS IT WAS MECHANICAL, FAULTY AIRBAGS. IT TOOK ALMOST 3 WEEKS FROM THE TIME I CALLED GM FOR THEM TO GET IT TO A DEALERSHIP AND GET THEIR INVESTIGATOR OUT TO LOOK AT IT. SHE CAN'T DRIVE THE CAR, THE SEATBELTS DON'T WORK AND AIRBAGS DEPLOYED,SO I REFUSE TO LET HER DRIVE IT. SO FROM THE TIME THE INVESTIGATOR CAME OUT AND LOOKED AT IT, RECORDED HIS FINDINGS, IT WAS ANOTHER 2 WEEKS.MY DAUGHTER CALLED THE LADY AT GM AND THE INVESTIGATOR THAT CONTACTED HER TO GET INFO. I SENT AN EMAIL ASKING WHY IT'S TAKING SO LONG TOO. FINALLY, GM CALLED ME, SAYING THE DECISIONS ARE FINAL AND THEY 'FOUND NO MERIT THAT IT WAS A MECHANICAL ISSUE',AND THEY WON'T BE DOING ANYTHING TO HELP. SHE ALSO TOLD ME NOTHING LIKE THAT HAS EVER HAPPENED BEFORE. I WANT THEM TO TAKE RESPONSIBILITY! THEY ARE USING WHAT HAPPENED IN MAY!",
        "vin": "1G1BE5SM9G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375261,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NEGATIVE BATTERY CABLE SHORTED OUT, FAILING A MAIN FUSE AND THE STARTER. CAR TURNED OFF WHILE DRIVING DOWN I-5. WE WERE ABLE TO GET THE CAR TO RESTART ONE TIME, THEN ONCE WE WERE TO A SAFE PLACE TO PULL OVER TURNED OFF THE CAR AND THE ELECTRICAL IN THE CAR WOULD NOT TURN OFF (STEREO, LIGHTS, ETC..) PUSH BUTTON START IN CAR. ONCE WE FINALLY GOT EVERYTHING TO TURN OFF THE CAR WOULD NOT START AGAIN AND WAS TOWED TO THE REPAIR SHOP.",
        "vin": "1G1PG5SB5G7"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSINGER FRONT SEAT IS JAMMED AND  CAN NOT BE MOVED FORWARD OR BACKWARD",
        "vin": "1G1PJ5SB8G7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2016 CRUZE LIMITED, 2 YEARS AFTER THE PURCHASE OF THE CAR, WATER PUMP AND THERMOSTAT HOUSING REPLACEMENT(COVERED BY THE DRIVE-TRAIN WARRANTY),2 YEARS LATER, CAR OVERHEATS AGAIN, I AM APPARENTLY LOSING WATER BUT NOT EVIDENT IN THE ENGINE COMPARTMENT, I TAKE IT BACK TO THE DEALER, TOLD THEM WHAT I THOUGHT WAS HAPPENING AGAIN AND THEY CONDUCTED AN ANALYSIS FOR WHICH I HAD TO PAY $96.00, (CAR HAS 72,000 MILES, OUT OF WARRANTY) TELLING ME THE SAME THING I HAD ALREADY FIGURED OUT, THAT I NEED A NEW WATER PUMP AND THERMOSTAT HOUSING.  THEY TELL ME IT WILL COST ME ABOUT $870.00. TO REPLACE THE WATER PUMP AND THERMOSTAT. NOW UNDERSTAND, MY WIFE AND I BOUGHT THIS CAR ON GOOD FAITH THAT IT WAS GOING TO BE SOMETHING THAT WE COULD RELY ON. I AM RETIRED AND SHE IS DISABLED. I NEEDED A DEPENDABLE MODE OF TRANSPORTATION. WHEN WE FIRST BOUGHT IT, IT WAS GREAT. BUT BACK TO OUR DILEMMA, AFTER I WAS GIVEN THE ESTIMATE, I TOLD THEM I DID NOT HAVE THAT KIND OF MONEY FOR THE REPAIR, AND THEY MADE SURE THE COOLANT WAS FULL AND I LIMPED IT BACK TO MY HOUSE. I PURCHASED A NEW WATER PUMP, THERMOSTAT HOUSING, AND A WATER OUTLET ASSEMBLY AND REPLACED IT MYSELF. I AM AN EXPERIENCED MECHANIC. AFTER REPLACEMENT, WHILE ON OUR WAY TO AN APPOINTMENT THE NEXT DAY, THE CAR OVER HEATED AGAIN. GOT IT BACK TO THE HOUSE, FOUND NO LEAKS, BLED THE SYSTEM TO MAKE SURE THERE WAS NO AIR IN THE LINES. DROVE IT THE NEXT DAY AND THE ENGINE STOPPED ON ME ON THE ROAD WHILE I WAS DRIVING, IT WOULD NOT RE-START. CHECKED THE OIL DIPSTICK AND FOUND WATER IN ENGINE!  SOME ANALYSIS I WAS GIVEN. HAD IT TOWED TO MY HOUSE. HERE WE ARE WITH A 4 YEAR OLD CAR, 72,000 MILE ENGINE AND IT IS DONE. WE LIVE ON SOCIAL SECURITY AND I STILL OWE PAYMENTS. WHY WEREN'T THESE CARS RECALLED IF THEY KNEW SO MANY PEOPLE WERE HAVING THIS COOLING PROBLEM ON THE CARS? NOW WHAT DO WE DO? I DON'T WANT TO MAKE PAYMENTS ON A BROKEN CAR!",
        "vin": "1G1PE5SB5G7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365475,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REOCCURING PROBLEMS WITH PCV SYSTEM.EMISSIONS SYSTEM, MASS AIR FLOW SENSORS,O2 SENSORS,INTAKE MANIFOLD, VALVE COVERS WONT ACCELERRATE, STALLS WHILE DRIVING AND IDLING, HARD SHIFTING, STABILITY CONTROL SSUES AND STABILITRACK ISSUES, INTAKE AIR FLOW SYSTEM,FUEL TRIM SYSTEM LEAN BANK",
        "vin": "1G1PF5SB8G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT HOSE LEAKAGE, CRACKED COOLANT HOSE CONNECTOR, THERMOSTAT BROKEN",
        "vin": "1G1PE5SB3G7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVER'S SIDE WINDOW FELL INTO THE DOOR UNEXPECTEDLY. NO DAMAGE, NO ACCIDENT. JUST SEEMED TO FALL INTO DOOR WITH NO PRECURSOR.",
        "vin": "1G1PC5SGXG7"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362594,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVROLET CRUZE LS   REAR-WINDSHIELD OUTER BRAKE LIGHT PLASTIC HOUSING HAS VERTICAL CRACK ON THE RIGHT-HAND SIDE OF THE OUTER PLASTIC HOUSING. UPON RESEARCHING, THIS WRITER FOUND ONLINE THREADS AND OTHER COMPLAINTS OF THE SAME ISSUES WITH THE OUTER PLASTIC HOUSING HAVING A VEHICLE CRACK.",
        "vin": "1G1BC5SM0G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/30/2020",
        "dateOfIncident": "09/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361947,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH-MOUNT STOP LIGHT LEAKING AGAIN AFTER RECALL REPAIR. SCREW MOUNTING HIGH MOUNT STOP LIGHT HAS BACKED OUT AGAIN CAUSING LEAKING ONTO THE HEADLINER AND WATER COLLECTING IN THE BATTERY TUB.         DEALER REFUSES TO  COVER COST OF FIXING IT DUE TO \"WORK WARRANTY\" LAPSED.     EXTENDED WARRANTY REFUSES TO COVER IT AS IT IS CLASSIFIED AS A 'TRIM PIECE' EVEN THOUGH IT IS REQUIRED BY D.O.T.      I SHOULDN'T HAVE TO PAY TO HAVE THIS FIXED AGAIN AS IT'S ALREADY A KNOWN ISSUE THAT WAS RECALLED ONCE BEFORE AND THEIR 'FIX' OBVIOUSLY DIDN'T WORK.",
        "vin": "1G1BB5SM9G7"
    },
    {
        "components": "AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361111,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 CHEVROLET CRUZE. THE CONTACT STATED THAT WHILE DRIVING AT 25 MPH THEN MAKING A RIGHT TURN, THE FRONT PASSENGER SIDE WHEEL FEEL OFF THE VEHICLE. THE VEHICLE ROLLED OVER THE WHEEL AND THE SIDE AIR BAGS ENGAGED BUT THE FRONT AIR BAGS DID NOT. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE VEHICLE WAS TOTALED BY THE CONTACT'S INSURANCE COMPANY. THE VEHICLE WAS TOWED TO THE DEALER HENDRICK CHEVROLET SHAWNEE MISSION 8300 SHAWNEE MISSION PKWY, MERRIAM, KS 66202 (913) 225-7967 AND THEY ALONG WITH THE INSURANCE REPRESENTATIVE TOTALED THE VEHICLE. THE FAILURE MILEAGE WAS 28,000.",
        "vin": "1G1PC5SH3G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360810,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHOLE ENGINE WENT OUT AND THE AUTO REPAIR SHOP THAT I TOOK IT TOO IS SAYING THE WHOLE ENGINE NEEDS TO BE REPLACED. I'M ALSO NOT THE ONLY WHO IS HAVING THIS PROBLEM WITH THIS CAR. WHAT IS GOING ON IS THAT THE ENGINE IS ALWAYS OVERHEATING AND HAVING PROBLEMS.",
        "vin": "1G1PC5SH5G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUDDENLY OVERHEATED AND WITHIN 30 SECONDS MANAGED TO SPRAY COOLANT EVERYWHERE. THE COOLANT WENT IN THE SPARK PLUGS, WARPED THE HEAD AND MANAGED TO ENTER THE PISTON COMPRESSION CHAMBER. THE HEAD WARPED AND ALLOWED COOLANT IN THE ENGINE. THIS ISSUE SHOULD HAVE BEEN JUST A SIMPLE FIX AND A REFILLING OF COOLANT BUT INSTEAD HAS BECOME A FULL ENGINE DISASTER. LUCKILY  I WAS NOT ON A HIGHWAY WHEN THIS HAPPENED AND I WAS ON AN EMPTY ROAD GOING 55 OR THIS COULD HAVE BECOME A GREATER ISSUE. WHEN THE COOLANT HOUSING BUSTED IT SPRAYED ALL OVER THE ENGINE BAY AND SOME EVEN MADE IT ON THE WINDSHIELD CUTTING SOME OF MY VISABILITY. I FEEL FORTUNATE THAT I WAS DRIVING IN A STRAIGHT LINE AND NOT IN THE MIDDLE OF TRAFFIC OR A WINDING ROAD.",
        "vin": "1G1PE5SBXG7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353803,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DTC CODE P0011 IS AN ISSUE WITH 2016 CHEVY CRUZE LIMITED CHEVY IS AWARE PIP4543D CHEVY NEEDS TO COVER THE COST OF THIS REPAIR IT IS GOING TO CAUSE ME TO GET HURT IN THIS CAR AND IF SO I WILL HOLD CHEVY RESPONSIBILE THEY NEED TO DO THE RIGHT THING THE CAR AS 90,000 MILES ON IT AND CONTIMUES TO HAVE THIS ISSUE DAILY",
        "vin": "1G1PC5SH9G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353886,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "P0171 CODE CONTINUES TO COME UP, VALVE COVER AND INTAKE MANIFOLD HAVE BEEN REPLACED MULTIPLE TIMES, WITHIN A WEEK BREAKS AGAIN.",
        "vin": "1G1PE5SB7G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11351042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A CRASH ON JULY 27,2020,PM HOURS.I WAS DRIVING STRAIGHT ON INTERSTATE,IT BEGAN RAINING,I SLOWED DOWN & ADJUSTED TRACTION CONTROL/STABILITY CONTROL SETTING.THE CAR VEERED TO THE RIGHT FOR SOME REASON,I GOT CAR BACK IN STRAIGHT MOTION,THEN IN A SPLIT SECOND,IT SHOT TO THE LEFT OF THE ROAD WAY.I TRIED GAINING CONTROL,TO GET BACK IN THE CORRECT LANE,AND THE CAR RAN INTO THE GUARDRAIL IN TRYING TO GET CONTROL OF IT. I DO NOT THINK THAT THE RATE OF SPEED,NOR WEATHER,WERE THE ONLY REASONS FOR THIS ACCIDENT. PRIOR TO THIS CRASH,MONTHS BEFORE,AT VARIOUS TIMES,AND AND FOR NO REASON, THE SERVICE POWER STEERING,AT TIMES THE SERVICE TRACTION CONTROL,AND AT TIMES THE SERVICE STABILITY MESSAGE WOULD APPEAR,ONLY FOR A SPLIT COUPLE OF SECONDS,AT RANDOM TIMES. THE CHECK ENGINE LIGHT WAS ON,AND A PRIOR CERTIFIED MECHANIC DIAGNOSED IT AS BANK 1 CATALYCT CONCERTER CLOGGED. WE,WERE TRYING TO GET THE VEHICHLE RE-DIAGNOSED BY A DIFFERENT MECHANIC SHOP,AT THE TIME FRAME THIS ACCIDENT HAPPENED,BUT,COVID 19,MADE THINGS TO DIFFICULT TO ARRANGE AND PLANS WERE IN PROGRESS TO HAVE IT CHECKED ASAP.I BELEIVE THE VEHICHLE HAD A MALFUNCTION AND HOPE TO GET THE SENSORS,COMPUTERS,RELAYS OR ANY OTHER CHECKED OUT BY YOU,NOT ONLY GM. EVERY AIRBAG ALONG DOORS OF CAR DEPLOYED.BUT, THE STEERING WHEEL AIRBAG DID NOT. MY HEAD HIT EITHER THE STEERING WHEEL OR WINDSHEILD. I HAD A BLOW TO MY HEAD. IF ALL OTHER AIRBAGS DEPLOYED,THEN I FEEL STEERING WHEEL BAG SHOULD HAVE ALSO. THIS IS SERIOUS MALFUNCTIONS. THERE WERE PROBLEMS FROM THIS CAR FROM DAY 1. THINGS WENT WRONG WAY BEFORE EXPECTED TIME FOR. SUCH AS HEATERCORE, IGNITION COIL,COOLANT LEAKS, THERMOSTAT HOUSING OUTLET, DRIVER DOOR WINDOW & MOTOR,ALL OF MOST WENT BAD BEFORE 80,000 MILES.EVEN ELECTRICAL SUCH AS DOOR CHIME,LIGHTS NOT WORKING AT CORRECT TIME. AIR BAG MALFUNCTION LED TO MY HEAD BEING HURT.THANK YOU.",
        "vin": "1G1PC5SH4G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2020",
        "dateOfIncident": "08/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349365,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS HAD OVERHEATING ISSUES SINCE I BOUGHT IT. REPAIRED IT TWICE AND IS EXPERIENCING PROBLEMS AGAIN. I HAVE CHANGED ALL COMPONENTS OF THE COOLING SYSTEM TO NO AVAIL. I HAVE COME ACROSS COUNTLESS COMPLAINTS ABOUT THIS. WHY HASN'T THERE BEEN A RECALL FOR THIS YET?",
        "vin": "1G1PG5SB9G7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED THIS CAR AND SEVERAL TIMES WHILE I'M DRIVING ON THE FREEWAY THE RADIO SHUTS OF THEN TURNS BACK ON NUMEROUS TIMES. THEN I USUALLY GET A STABILITY'S ERROR MESSAGE.  THEN THE BEST PART. THE POWER STEERING WILL COMPLETELY GO OUT WHILE CHANGING LANES OR IN MID TURN.  I HAVE BEEN DRIVING THROUGH A ROUND ABOUT AND ALSO WHILE MAKING SHARP TURNS TO GET ON AND OFF THE FREEWAY. THIS IS SO DANGEROUS! I SEE THAT SO MANY PEOPLE ARE REPORTING THE SAME EXACT PROBLEM! SOMETHING NEEDS TO BE DONE ABOUT THIS! I CALLED ONSTAR 3 TIMES IN ONE TRIP.  FIRST IT DISCONNECTS BECAUSE ALL ELECTRICAL COMPONENTS SHUT OFF, THEN THEY ACTUALLY TOLD ME I HAVE TO WAIT TO CALL THEM BACK WHILE I AM LOSING MY STEERING.  ONLY TO CONCLUDE THEY CAN ONLY HELP AFTER I AM IN AN ACCIDENT.  WHEN THIS IS NOT GOING ON THE CAR RUNS GREAT AND I LOVE IT SO IT IS OBVIOUSLY SOME KIND OF MANUFACTURE DEFECT.",
        "vin": "1G1PE5SB5G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO",
        "vin": "1G1PE5SB8G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS OFF ABRUPTLY WHEN STOPPED OR AT TIMES WHEN SPEED IS DECREASED TO ALMOST PARKED. THIS TYPICALLY HAPPENS AT RED LIGHTS OR WHEN CAR IS GOING UNDER 10 MPG. IT'S HAPPENED IN BUMPER-TO-BUMPER TRAFFIC. I HAVE TO PUT IT IN PARK AND RESTART THE PUSH START.  THIS HAS BEEN GOING SINCE LAST SUMMER (2019) OR SO.",
        "vin": "1G1BE5SM6G7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY THROUGH THE MOUNTAINS WHEN I HEARD A POP. I WAS GOING DOWN A STEEP HILL AND PICKING UP SPEED AND THE SERVICE BRAKE ASSIST LIGHT CAME ON. I TRIED TO SLOW DOWN THE CAR BUT IT WAS NOT SLOWING G DOWN. I STARTED PUMPING THE BRAKES AND SAW I WASN'T SLOWING DOWN FAST ENOUGH. LUCKILY THERE WAS A RUN AWAY TRUCK RAMP SO I SWERVED INTO A CONSTRUCTION ZONE AND ONTO THE TRUCK RAMP. ONCE I WAS SLOWING DOWN FINALLY I PUT ON THE EMERGENCY BRAKE AND CAME TO A SCREECHING HALT.",
        "vin": "1G1BC5SM9G7"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339423,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VALVE COVER HAS WENT BAD AND STARTED LEAKING OIL AROUND MY SPARK PLUGS. UPON FURTHER INVESTIGATION OF MY OWN I HAVE FOUND OUT THAT THIS IS A COMMON ISSUE FOR MANY YEAR MODELS OF THE CHEVY CRUZE. MY VALVE COVER IS AN UPDATED VERSION OF THE PLASTIC ON THE 2015 AND OLDER AND IS NOW A METAL ONE. I SPOKE WITH A LOCAL MECHANIC WHO INFORMED ME HE HAS REPLACED 75 NEW VALVE COVERS THAT GENERAL MOTORS HAS BUILT A NEW VALVE COVER TO REPLACE THE METAL ONE ON MY CAR. ALSO THIS METAL VALVE COVER HAS CAUSED MY CAR TO START SMOKING HEAVILY WHEN I DROVE IT TO MAKE ME HAVE TO HAVE MY CAR TOWED HOME UNTIL I CAN GET THE ISSUE FIXED.",
        "vin": "1G1BC5SM4G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338818,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2016 CHEVROLET CRUZE WITH <100K MILES, NO ACCIDENT HISTORY, AND NO PREVIOUS ISSUES. I BOUGHT THE CAR NEW FROM THE DEALERSHIP AND HAVE BEEN THE ONLY OWNER.    I WAS DRIVING STRAIGHT ON A RESIDENTIAL STREET (<30 MPH) WHEN THE CAR STARTED PUTTERING AND SHAKING. THE CAR SUDDENLY SHUT OFF RIGHT IN THE MIDDLE OF THE ROAD, AND I HAD TO SWERVE TO THE SHOULDER TO AVOID CRASHING. UPON BRINGING THE CAR TO THE CERTIFIED CHEVY DEALERSHIP, WE LEARNED THE CAR HAD A DAMAGED PISTON AND CRACKED CYLINDER WALL. THE ONLY FIX WAS TO COMPLETELY REPLACE THE ENGINE. IT SHOULD BE NOTED THE OIL HAD BEEN CHANGED JUST THE WEEK PREVIOUS.    I KNOW CHEVY IS AWARE OF THIS ISSUE BECAUSE THEY RELEASED SAFETY BULLETIN PIP5421F BACK IN 2018 REGARDING THIS VERY ISSUE. I ALSO KNOW THERE IS AN ACTIVE LAWSUIT IN THE STATE OF CALIFORNIA, BUT THIS DOESN'T APPLY TO US IN MINNESOTA. I FIND IT UNACCEPTABLE THAT CHEVROLET IS AWARE OF PREMATURE ENGINE FAILURE IN THEIR VEHICLES, AND HAVE NOT ISSUED A RECALL, EVEN THOUGH IT POSES A SAFETY HAZARD.",
        "vin": "1G1BE5SM8G7"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338344,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LIGHT KEEPS COMING ON.  THERE DOESN'T APPEAR TO BE ANYTHING WRONG WITH THE ENGINE.  THE LIGHT WILL CLEAR ITSELF EVENTUALLY, BUT THEN IT WILL COME BACK ON AGAIN.  THIS HAS BEEN GOING ON FOR ABOUT 1 YEAR.",
        "vin": "1G1PC5SG2G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331372,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY OLD COMPANY EBARA INTL CORPORATION GOT A HOLD OF MY VIN NUMBER AND MESSED WITH THE COMPUTER SYSTEM. THEIR IT GUY RICK JOHAN",
        "vin": "1G1BE55MXG7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2020",
        "dateOfIncident": "06/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN REVERSE AND APPLY THE BRAKE THE CAR CONTINUES TO MOVE AND MY FOOT IS TO THE FLOOR IT TAKES A SECONDS BEFORE BRAKES ENGAGE.  WE HAVE COMPLAINED TO THE DEALER & THEY HAVE NO ANSWER-(IT DOES NOT ALWAYS HAPPEN ) IT IS VERY SCARY THERE IS SOMETHING WRONG -IT HAS HAPPENED AT LEAST 6 TIMES IN THE LAST WEEK.  (STARTED SEVERAL MONTHS AGO)",
        "vin": "1G1PG5SB4G7"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE STABILTRAK LIGHT FLASHED, FOLLOWED BY THE CHECK ENGINE LIGHT COMING ON. THIS IS THE SECOND TIME SINCE I PURCHASED THIS CAR IN 2018 THAT THIS SAME ISSUE HAS HAPPENED. MY CAR WILL SHAKE WHILE STALLED AT RED LIGHTS OR STOP SIGNS. WHEN I GO TO PUT ON THE GAS MY CAR IS SLOW TO GET BACK IN GEAR AND ALMOST CAME TO A COMPLETE HALT AT A STOPLIGHT WHICH COULD HAVE RESULTED IN A COLLISION IF THE PERSON BEHIND ME WAS NOT PAYING ATTENTION. DOES NOT FEEL SAFE TO DRIVE AT ALL. THIS HAS HAPPENED TWICE TO MY CAR IN THE LAST YEAR AND A HALF.  *TR",
        "vin": "1G1PE5SB2G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "03/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325284,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "P0301 CODE; STABILITRAK LIGHT FLASHES INTERMITTENTLY; AFTER TAKING IT TO A MECHANIC FOR DIAGNOSTICS THE MECHANIC STATED THAT COMPRESSION ON CYLINDERS 2-4 WAS 120PSI; CYLINDER 1 IS AT 15 PSI; AFTER FURTHER TESTING FOUND ISSUE WITH PISTON. VEHICLE WILL SHAKE WHEN RUNNING ON IDLE, SLOW TO START.  *TR",
        "vin": "1G1BE5SMXG7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325026,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES HARD TO APPLY BRAKE ASST. LIGHT ON.  *TR",
        "vin": "1G1BG5SM5G7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCIDENT. AIRBAGS NEVER DEPLOYED.",
        "vin": "1G1PE5SB2G7"
    },
    {
        "components": "AIR BAGS,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "04/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WHILE DRIVING SUDDENLY SPUTTERS AND STALLS. I GET AN ERROR MESSAGE SAYING TO CHECK AIRBAGS. THE LOCKS ON THE DOORS WILL UNLOCK AND LOCK AND UNLOCK AN LOCK MULTIPLE TIMES WHILE DRIVING. CHECK ENGINE LIGHT COMES ON. WHEN I PUMP GAS THE CAR WONT START IMMEDIATELY IT SPUTTERS AND CLICKS EVERY TIME.",
        "vin": "1G1PC5SG4G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320409,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS A BAD SMELL COMING FROM THE ENGINE. IT STARTED SMELLING LIKE A DEAD ANIMAL UNDER THE HOOD, THEN IT SMELLED LIKE ANIMAL URINE, AND NOW IT SMELLS NAUSEATING, I'M NOT SURE WHERE IT IS COMING FROM OR WHY IT'S THERE, WE ALREADY CHECKED UNDER THE HOOD FOR ANY VISIBLE DAMAGE TO THE HOSES AND IT IS DISAPPOINTING THAT THERE IS NOT A RECALL FOR THIS PROBLEM THAT CHEVY CRUZE OWNERS SEEM TO COMPLAIN ABOUT. MY CAR ONLY HAS 48K MILES ON IT AND WE LET IT SIT IN THE DRIVEWAY MORE THAN RUN IT BECAUSE OF THE SMELL.  THE SMELL IS THERE WHEN YOU START THE CAR -- WE HAVE TO DRIVE WITH THE WINDOWS OPEN A LITTLE BIT SO THAT WE DON'T OVERWHELMED WITH THE SMELL.",
        "vin": "1G1PE5SB9G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2020",
        "dateOfIncident": "03/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320235,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TURBO IS GOING OUT.  THE CAR HEAVILY SHAKES WHEN IN IDLE OR AT A STOP LIGHT. IT STOPPED IN HEAVY TRAFFIC WHILE TRYING TO CROSS THE STREET, I HAD MY FOOT COMPLETELY DOWN ON THE GAS AND THE CAR DIDNT BUDGE FOR 2 MINUTES LEAVING ME SITTING IN THE MIDDLE OF THE ROAD IN HEAVY TRAFFIC..",
        "vin": "1G1PF5SB0G7"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPAIRING THE COOLANT SYSTEM CAR, I DROVE IT AROUND THE BLOCK TO ENSURE IT WAS WORKING PROPERLY. UPON DOING SO, ALL GAUGES STOPPED WORKING. I ALSO PUT THE CAR IN REVERSE TO PARK IT IN THE DRIVEWAY AND THE TRANSMISSION WOULD NOT GO INTO THE SELECTED GEAR. WE HAD TO PUT THE CAR INTO NEUTRAL AND PUSH IT INTO THE DRIVEWAY. ALSO, ALL NOTIFICATION LIGHTS WERE ALSO LIT AT THE TIME. WHEN IT FINALLY SHIFTED INTO DRIVE THE CAR JERKED VERY HARD.",
        "vin": "1G1PE5SB3G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS OUT AFTER AUTO STOP IS DISENGAGED. BATTERY IS DEAD CAR WONT START EVEN THO BATTERY HAS POWER. DOOR LOCKS LOCK AND UNLOCK ON THERE OWN. TOUCH SCREEN FLICKERS.",
        "vin": "1G1BC5SM8G7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LESS THAN A YEAR THE AIRBAG NEEDS SERVICING MEANING IT WILL NOT DEPLOY IN AN ACCIDENT.",
        "vin": "1G1BE5SM1G7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE MIDDLE OF DRIVING HOME THE CAR WAS NOT OPERABLE AND WOULD NOT ALLOW ME TO TURN THE VEHICLE AND IT STARTED DOING A SCRUBBING SOUND BEFORE IT STOPPED TURNING COMPLETELY",
        "vin": "1G1BE5SM3G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILITY OF DRIVING IS OFF, IDLING IS HARD AND SLIPS GEARS WITH LACK OF POWER AND ELECTRICAL IS GLITCHY. STARTED WHEN I WOULD DRIVE UP HILL AND DEALERSHIP CALLED IT INTERMEDIATE PROBLEM NOTHING DONE. NOW ITS ALL HAPPENING DAILY. SHIFT IS INTO THE RED ON RPM LACK OF POWER AND MY HEAD LIGHTS FLICKER AND RANDOMLY TRUNK OPENS.",
        "vin": "1G1PC5SG7G7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE HOME SCREEN BECAME INOPERABLE. THE CONTACT STATED THAT THE POWER STEERING CEASED AND THE STABILITRAK WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "1G1PE5SB6G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299379,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM NEW MEXICO ON THE INTERSTATE AND MY CHECK ENGINE LIGHT RANDOMLY CAME ON. WHEN I FINALLY MADE IT HOME I TOOK IT TO A CHEVY DEALERSHIP AND SAID I HAD A TURBO LEAK. THEY DIDN'T GIVE ME ANY SPECIFICS.",
        "vin": "1G1PE5SB9G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298241,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING DIAGNOSTIC FOUND EXCESSIVE OIL MIXED IN WITH THE COOLANT ALL THROUGH THE ENGINE. REMOVED SPARK PLUGS AND FOUND CYLINDER #4 HAD   COOLANT ON TOP OF THE PISTON AND THE SPARK PLUG WAS SATURATED IN   COOLANT AS WELL. REMOVED CYLINDER HEAD AND CLEANED HEAD GASKET SEALING SURFACE. INSPECTED FOR ANY SIGNS OF CRACKS AND FOUND NONE. USING A   STRAIGHT EDGE COULD NOT FIND ANY AREAS OF THE CYLINDER HEAD THAT WERE WARPED OR DAMAGED INDICATING A HEAD GASKET FAILURE. HOWEVER ONLY FOUND OIL IN COOLING'SYSTEM BUT NO COOLANT IN THE ENGINE OIL. REMOVED OIL DRAIN PLUG AND FOUND NO SIGNS OF COOLANT. REMOVED TRANSMISSION DRAIN PLUG AND FOUND NO COOLANT IN THE TRANSMISSION FLUID EITHER. AFTER INSPECTING OIL COOLER FOUND IT HAD INTERNALLY FAILED CAUSING   THE OIL TO LEAK IN TO THE COOLANT. RECOMMEND REPLACING HEAD GASKET, RADIATOR INLET HOSE, OIL COOLER INLET HOSE, HEATER CORE INLET HOSE, HEATER CORE OUTLET HOSE, BOTH TURBO CHARGER COOLER HOSES, THE TURBO CHARGER OIL INLET PIPE AND THE TURBO CHARGER OIL RETURN PIPE.   AFTER COMPLETING REPAIRS CLEANED COOLING SYSTEM AND FLUSHED WITH   WARM WATER 4 TIMES BEFORE FILLING COOLING SYSTEM WITH COOLANT. TEST DROVE VEHICLE AND NO PROBLEMS WERE FOUND AFTER TEST DRIVE. RECOMMEND CUSTOMER HAVE COOLANT FLUSHED DURING. NEXT .. OIL . CHANGE TO REMOVE ANY OIL THAT MAY HAVE BEEN LEFT IN THE COOLING SYSTEM AFTER REPAIRS WERE MADE",
        "vin": "1G1PE5SB8G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297456,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS 66062 MILES SITTING TURNED ON THE CAR HOSES STARTED LEAKING AND THE CAR STARTED SMOKING FROM UNDER THE HOOD. TOWED IT TO THE MY SHOP FOR A PRESSURE TEST THEY ADVISED IT WOULD HAVE TO GO THE DEALER FOR A COOLANT HOSE PROBLEM THEY COULD NOT ADDRESS.  TOWED IT TO THE CHEVY DEALER. REPAIRS DONE WATER PUMP REPLACEMENT AND THE WATER OUTLET HOSES WERE LEAKING.  I RESEARCHED THIS PROBLEM AND THIS WAS A RECALL FOR THE VERY SAME MODEL ONLY FOR THE YEARS 2011-2014.  THE 2016 MODELS SHOULD BE INCLUDED IN THAT RECALL AS WELL BUT WERE NOT.  I HAVE RESEARCHED MANY OF THE VERY SAME COMPLAINTS FOR THE 2016 MODELS BUT NO RECALL YET. RECALL WAS 1/2015  BULLETIN #14371B -ENGINE COOLANT LEAK FROM WATER PUMP. #",
        "vin": "1G1PE5SB2G7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/15/2019",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289205,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A CAR ACCIDENT. MY WHOLE FRONT END WAS DAMAGED AND MY VEHICLE AIR BAGS NEVER DEPLOYED LIKE THEY SHOULD HAVE.",
        "vin": "1G1PE5SB7G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "11/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288919,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE THE VEHICLE WAS PARKED AND IDLING IN THE DRIVEWAY, IT TURNED OFF ON ITS OWN AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT STATED THAT THE FAILURE OCCURRED THREE OTHER TIMES EVEN WHEN DRIVING. THE VEHICLE WAS TAKEN TO KNIGHT AUTOMOTIVE INC (383 ROUTE 3, PLATTSBURGH, NY 12901) THREE TIMES WHERE IT WAS DETERMINED THAT THERE WAS COIL FAILURE. THE VEHICLE WAS REPAIRED THREE TIMES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 67,000.",
        "vin": "1G1PC5SG0G7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286635,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CAR RADIO HAS CUT OUT MULTIPLE TIMES WHILE 'SERVICE STABILITRACK' HAS BEEN DISPLAYED ON THE DASH. THE BATTERY WAS REPLACED AND THE ISSUES CONTINUED. THIS IS MAINLY SEEN WHILE SLOWING DOWN OR STOPPING AT A RED LIGHT. THE LACK OF POWER TO THE CAR THREATENS SAFETY AS MY TURN SIGNALS FAILED TO WORK AND I LOST POWER STEERING ON ONE OCCASION. I PERSONALLY RESEARCHED THIS ISSUE THROUGH ONLINE FORUMS AND FOUND OUT THAT MANY OTHERS SHARE THE SAME PROBLEM. THE RESULT MAY BE A FAULTY NEGATIVE BATTERY CONNECTION.",
        "vin": "1G1PC5SG2G7"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286270,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 CHEVROLET CRUZE WITH LESS THAN 90K MILES AT THE TIME WAS RUNNING HOT IN 2018,CAR WAS FIXED BY LOCAL CHEVY DEALERSHIP (_COOLANT JUG LEAK/ WATER HOUSING MADE OF PLASTIC CRACKED AT CLAMP CONNECTION AREA) WAS DIAGNOSTIC. AFTER FEW MONTHS IT STARTED RUNNING HOT AGAIN 2019, DEALERSHIP SAID DIAGNOSIS WAS THERMOSTAT, WATERPUMP, HOSES LEAKING.. AFTER ALL PARTS WAS REPLACED AND DRIVEN FOR COUPLE DAYS CAR DASHBOARD NOTIFICATION SAID A/C OFF/ IDLE ENGINE OVERHEATING. PAID FOR ANOTHER DIAGNOSTIC FROM DEALERSHIP AND NOW THEY ARE SAYING MAYBE A BLOWN HEADGASKET OR CRACKED ENGINE BLOCK DUE TO OVERHEATING.SEEMS AS THOUGH THE DEFECTED/ CHEAP PARTS CAUSED THIS FROM THE BEGINNING AND SHOULD BE RECALLED BEFORE SOMEONE ENGINE BLOW UP FROM OVERHEATING",
        "vin": "1G1PE5SB3G7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286321,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH HYDRAULICS FAILED WHILE DRIVING IN MY STANDARD TRANSMISSION CAR DUE TO POORLY MANUFACTURED PARTS. CLUTCH WOULD STAY ON THE FLOOR WHEN PUSHED DOWN. MULTIPLE MECHANICS STATED AIR WAS GETTING INTO HYDRAULIC LINE DUE TO POOR MANUFACTURING.",
        "vin": "1G1BB5SM9G7"
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/23/2019",
        "dateOfIncident": "11/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2016 CHEVROLET CRUZ NG ON SEPTEMBER 7, 2016. ON SEPTEMBER 10, 2019, I TOOK MY VEHICLE TO THE CHEVROLET AGENCY TO CHECK THE WATER FILTERING OF THE 3 LIGHT STOP OF THE CAR, IT LEAKED WATER AGAIN AFTER THE REPAIR OF THE RECALL N162064340 . ON THIS VISIT I WAS NOTIFIED THAT THE CAR HAD A RECALL OF THE STEERING SYSTEM (RECALL N182201620) WHICH PRESENTS A FAILURE IN THE PACKAGING OF THE STEERING BOX CAUSING MOISTURE TO ENTER THE PART AND DEACTIVATE THE POWER STEERING.  AFTER CHECKING THE CAR THE AGENCY INDICATED THAT THERE WAS NO PROBLEM WITH THE STEERING SYSTEM AND THE AGENCY CLOSED THE RECALL N182201620.  ON NOVEMBER 5, 2019, WHEN I STARTED MY VEHICLE AND PUT IT IN DRIVE, THE STEERING SYSTEM WAS DEACTIVATED, PREVENTING ME FROM TURNING, I IMMEDIATELY STOPPED THE VEHICLE, AND THE BOARD THREW A MESSAGE 'THE POWER STEERING HAS BEEN DEACTIVATED, DRIVE WITH CAUTION', THE STEERING WHEEL IS COMPLETELY HARD AND IT IS NOT POSSIBLE TO MANIPULATE IT. I CONTACTED THE AGENCY AND THE CAR WAS TOWED TO THE CHEVROLET WORKSHOP AT MY COST, THE AGENCY ANALYZED THE FAULT AND RESPONDED THAT IT WAS NOT RELATED TO RECALL N182201620 (SAME FAULT THAT IS NO LONGER SHOWN ON THE GM PAGE) AND THAT THE THE CAR HAD NO GUARANTEE, THE AGENCY NOTIFIED ME THAT I SHOULD PAY FOR THE CHANGE OF THE PART. TALK TO GM 01800 AND I REPORT THE SITUATION, THEY CONTACTED ME AFTER 72 HOURS WITHOUT AN ANSWER, AFTER 6 DAYS GM'S RESPONSE WAS THAT THE VEHICLE HAD NO WARRANTY AND THAT THEY WOULD NOT REPAIR IT, THE ADVISOR INDICATED THAT THE RECALL OF THE STEERING SYSTEM WAS THE RESPONSIBILITY OF THE AGENCY AND THAT GM WAS NOT RESPONSIBLE, THEY REFUSED TO GIVE ME A TECHNICAL RESPONSE OF THE FAILURE OF THE PIECE AND THEY VIOLATION OF IATF RULE 16949: 2016 CLAUSE 10.2.6, THEY REFUSED TO PERFORM AN ANALYSIS OF THE PIECE FAILED AND REFUSED TO CHANGE OR REPAIR THE FAULT OF THE STEERING SYSTEM FOR FREE.",
        "vin": "3G1B85DM8GS"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279621,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN COLORADO, AND EVER TIME ITS COLD IN THE MORNING WHEN I START UP MY CAR IT GIVES ME HARD TIME AND THEN DOES AN ANT THEFT SYSTEM LOCK. WHEN IM HOME, OKAY ITS DURABLE BUT NOW ITS DONE IT WHILE IM DRIVING, AND WHEN I WAS AT THE CAR WASH. COMPLETE LOCK, STEERING WHEEL, KEY IS LOCKED IN THE IGNITION. THIS IS SUPER UNSAFE!! IVE GOTTEN THIS CAR FIXED SOOOOOO MANY TIMES THIS OUTRAGEOUS.",
        "vin": "1G1PE5SB7G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "08/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276986,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED VEHICLE FROM ATLANTA LUXURY MOTORS AT KIA SOUTH ON AUGUST 11, 2019. I PURCHASED THIS VEHICLE AS-IS, BUT NO MECHANIC CLAIMS TO HAVE FOUND ANY ISSUES AT THE TIME OF INSPECTION. THE VEHICLE IS A 2016 CHEVROLET CRUZE AND ONLY HAD 70,000 MILES ON IT AT THE TIME OF PURCHASE. ABOUT TWO WEEKS AFTER PURCHASE, THE ENGINE CUT OFF AFTER THE AUTO-STOP INITIATED AND THE CHECK ENGINE LIGHT CAME ON. I HAD TO RESTART THE VEHICLE IN ORDER TO GET OUT OF THE ROAD. SINCE THEN, THE NUMBER OF TIMES THE ENGINE HAS CUT OFF HAS INCREASED IMMENSELY. AS OF OCTOBER 29, 2019, MY ENGINE CUTS OFF ANYTIME THE CAR FALLS INTO AUTO-STOP. TODAY IT HAPPENED EIGHT TIMES DURING ONE FORTY-FIVE MINUTE COMMUTE.",
        "vin": "1G1BE5SMXG7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAYS OR CITY STREETS THE CAR JUST SHUTS OFF AT RANDOM TIMES. NO CHECK ENGINE LIGHT OR ANY LIGHTS ARE ON THE DASHBOARD BEFORE IT HAPPENS. ONCE CAR HAS SHUT OFF, WE CAN PUT IT IN PARK TURN THE KEY OFF AND BACK ON. IT HAS BEEN HAPPENING MORE FREQUENTLY.",
        "vin": "1G1PC5SH5G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268649,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE IDLING AT A TRAFFIC LIGHT, THE VEHICLE SEIZED. THE CONTACT STATED THAT THE RADIO WAS STILL OPERATING WHEN THE FAILURE OCCURRED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT WAS ABLE TO SHIFT INTO PARK AND RESTART THE VEHICLE. THE CONTACT STATED THAT THE FAILURE OCCURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT THE FAILURE WAS UNABLE TO BE DUPLICATED. THE CONTACT CALLED AN UNKNOWN DEALER AND WAS INFORMED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "1G1PC5SHXG7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE GOES INTO AUTO SHUT OFF AT A STOP SIGN OR DURING TRAFFIC JAMS WHERE I AM JUST STOPPED BY MY BRAKE BUT NOT IN PARK  IT FAILS TO RESTART AND SHUTS THE ENGINE COMPLETELY OFF. I HAVE TO QUICKLY PUT IT IN PARK AND PRESS THE BUTTON TO START THE ENGINE IN ORDER TO GO.",
        "vin": "1G1BG5SM1G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267935,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT GO INTO PARK WHILE STATIONARY IN A PARKING LOT. THE SHIFTER WOULD MOVE BETWEEN REVERSE, NEUTRAL, AND DRIVE BUT STOPPED AT PARK. I HAD TO PUSH VERY HARD ON IT TO FORCE IT INTO PARK. DANGEROUS BECAUSE IT COULD ROLL. PLUS YOU CAN'T REMOVE THE KEY FROM THE IGNITION SO YOUR CAR COULD GET STOLEN.     THE ENTIRE SHIFTER ASSEMBLY HAD TO BE REPLACED.",
        "vin": "1G1PC5SH6G7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266865,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS GETTING READY TO LEAVE THE HOUSE TO GO TO THE STORE BRAKE PEDAL BECAME HARD AFTER STARTING THE ENGINE. FEELS LIKE THE BRAKE HAS A LOSS OF THE POWER ASSIST. AFTER STARTING THE CAR, PUT IT IN DRIVE, RELEASE THE BRAKE, VEHICLE BEGINS TO MOVE, APPLY BRAKE, BRAKE PEDAL WAS VERY HARD WITH EXCESSIVE FORCE NEEDED TO STOP THE VEHICLE. THIS JUST HAPPENED OUT OF NO WHERE.  I HAVE DONE SOME RESEARCH AND FOUND THE SAME THING OCCURRED ON 2013-2014 MODELS.",
        "vin": "1G1BE5SM4G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2016 CHEVY CRUZE LIMITED EDITION WITH LESS THAN 40,000 MILES AND MY RADIO HAS STOPPED WORKING.  THE DISPLAY SCREEN AND PHONE CHARGER ARE ALL CONNECTED TO THE RADIO SO NONE OF THEM ARE CURRENTLY WORKING. I HAVE AN EXTENDED WARRANTY HOWEVER THE RADIO IS NOT COVERED.  MY BIGGEST ISSUE IS THIS SHOULD BE COVERED UNDER THE 5YR WARRANTY ON THE CAR. I WAS TOLD BY THE DEALERSHIP THAT TO REPLACE IT WOULD COST $1206.34.  EVEN THOUGH ONCE YOU GET USE TO THIS FEATURE YOU MISS IT WHEN IT'S NOT WORKING HOWEVER THIS DOES NOT HAVE ANY BEARING ON RUNNING THE CAR HOWEVER THE COST WOULD MAKE YOU THINK IT DOES.  I THINK GM/CHEVROLET SHOULD STAND BEHIND THEIR PRODUCT AND REPLACE THE REPLACE THE RADIO.  THE CAR IS ONLY A 2016 AND I HAVE OWNED 4 CHEVROLET CARS AND HAVE NEVER HAD THIS TYPE OF ISSUE.  I'M NOT HAPPY ABOUT THIS IS ISSUE AND WOULD LIKE A BETTER RESOLUTION.",
        "vin": "1G1PG5SB0G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254830,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM INVOLVES THE AUTO STOP/START FEATURE ON MY CAR.  WHEN MY CAR IS IN DRIVE, THE BRAKE PETAL IS DEPRESSED, AND COMES TO A COMPLETE STOP, SAID FEATURE WILL ENGAGE AND SHUT THE ENGINE OFF.  THE ANOMALY OCCURS WHEN THE BRAKE PETAL IS RELEASED AND THE ENGINE IS SUPPOSE TO REIGNITE; HOWEVER, MY CAR'S ENGINE WILL NOT COME BACK ON.  INSTEAD THE CHECK ENGINE LIGHT WILL ILLUMINATE, AND THE ENGINE WILL TURN TO AN IDLE STATE.  DURING THIS STATE, THE ELECTRONICS (RADIO, SCREEN DISPLAY, AND INSTRUMENT PANEL) STILL WORK, BUT THE CAR WILL NOT ACCELERATE.  TO CORRECT THE PROBLEM, THE CAR MUST BE PUT IN PARK AND KEY MUST TURNED AGAIN TO START THE IGNITION.    THE RATE AT WHICH THE PROBLEM OCCURS SEEMS TO BE SPORADIC.  IT HAS OCCURRED AS OFTEN AS THREE SEPARATE TIMES IN TEN MINUTES, AND IT HAS GONE AS LONG AS TWO WEEKS WITHOUT BEFORE THE NEXT INCIDENT.    THE LAST TIME THE ISSUE OCCURRED, I WAS SITUATED ON AN INCLINE STOPPED AT A TRAFFIC LIGHT.  WHEN MY FOOT RELEASED THE BRAKE PETAL AND THE CAR MALFUNCTIONED, MY CAR PROCEEDED TO ROLL BACKWARDS DOWN THE INCLINE AND ALMOST COLLIDED WITH THE CAR BEHIND ME.  I BRAKE BEFORE THIS HAPPENED.    I PROMPTLY TOOK MY CAR TO THE SAME CERTIFIED CHEVROLET DEALERSHIP FOR THE THIRD TIME FOR THIS EXACT SAME ISSUE.  THE DEALERSHIP HAS BEEN UNABLE TO DIAGNOSE THE PROBLEM AND HAS BEEN UNSUCCESSFUL IN RECREATING THE ISSUE; HOWEVER, THE CARS FAULT REPORTING SYSTEM HAS PRODUCED ERROR CODES AS EVIDENCE THAT A PROBLEM EXISTS.    I HAVE OPENED A CASE WITH CHEVROLET'S CUSTOMER SERVICE CENTER TO RECEIVE FURTHER HELP.  I WAS DIRECTED TO GET A RENTAL CAR FROM ENTERPRISE, AND I WAS TOLD THE COST WOULD BE REIMBURSED FOR UP TO THREE DAYS.  LATER THAT DAY I RENT A CAR. MY CASE WAS ELEVATED TO A HIGHER STATUS BECAUSE OF THE SAFETY CONCERN.  TWO DAYS LATER, I RECIEVED A CALL FROM A SENIOR ADVISER STATING THAT MY RENTAL CAR COST WOULD NOT BE REIMBURSED.",
        "vin": "1G1BE5SM4G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH PEDAL DID NOT RETURN TO PROPER POSITION.  THIS DID NOT ALLOW THE ABILITY TO SHIFT.  IF THIS HAD HAPPEND WHILE DRIVING COULD HAVE BEEN DANGEROUS. VEHICLE WAS STATIONARY IN PARKING LOT.  THIS IS A KNOWN ISSUE, TSB IS PIP5558C.",
        "vin": "1G1BD5SM0G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252095,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER INFORMATION CENTER, SPEEDOMETER, TACHOMETER, FUEL GAUGE, TEMP GAUGE, AND TOUCHSCREEN DISPLAY QUIT WORKING THIS MORNING ON OUR '16 CRUZE.  CAR STARTS AND RUNS FINE BUT KNOW WAY OF KNOWING OUR SPEED OR WHAT GEAR IT'S IN. PERSISTS THROUGH BATTERY DISCONNECT.",
        "vin": "1G1BE5SM1G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252099,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE OVERHEATS ON A REGULAR BASIS.  IT WENT IN FOR SERVICE FOR THIS PROBLEM ON 07-03-19, 05-06-19, 11-21-18 & 09-25-18.  THE LAST BILL WAS FOR $2919.60.  THE DEALERSHIP WHERE THE SERVICE IS BEING COMPLETED HAS ADVISED THAT THE 2016 CHEVY CRUZE IS VERY WELL KNOWN FOR THIS TYPE OF PROBLEM.  THE LAST TIME THE VEHICLE WAS IN FOR SERVICE IT TOOK 49 DAYS FOR THE PROBLEM TO BE FIXED.  THE SERVICE DEPARTMENT SAID THAT THE PARTS THAT WERE NEEDED WERE ON BACK ORDER BECAUSE SO MANY CHEVY CRUZE'S HAD THE SAME ISSUE.  THIS IS A SAFETY ISSUE BECAUSE THE VEHICLE COULD BREAK DOWN AT ANY TIME AND WE COULD BE IN A VERY REMOTE AREA WITHOUT ANY HELP.  THE VEHICLE HAS BEEN WORKED ON FOR THIS PROBLEM AT SANBORN CHEVROLET 1210 S. CHEROKEE LANE, LODI CALIFORNIA 95241-1057.  TELEPHONE NUMBER 209-334-5000.  IT APPEARS THAT GENERAL MOTORS IS WELL INFORMED ABOUT THIS ISSUE BUT CHOOSES TO PUT THEIR CUSTOMERS AT RISK.",
        "vin": "1G1PE5SB6G7"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/18/2019",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11244761,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Azure Dynamics Corporation",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT ELECTRIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "[XXX] OF EBARA FLUID HANDLING DIVISION WITH THE SHOP FLOOR'S PERMISSION AND WITHOUT MINE PLACE PLAY EQUIPMENT IN VEHICLE AND PASSED OUT PIECES TO SPY ON ME. TO MY KNOWLEDGE THE COPS HAVE RECOVERED SOME OF THE PIECES. BUT, THE FOLLOWING INDIVUALS OF EBARA INTL CORPORATION STILL HAVE SOME OF THE PIECES THEY REFUSE TO GIVE BACK. [XXX]- HUMAN RESOURCES, [XXX]- HUMAN RESOURCES, AND [XXX] - MARKETING HAVE USED THIS EQUIPMENT TO SPY ON ME AND HARASS ME WHILE DRIVING ON THE FREEWAY BY MAKING THERE VOICES POP UP IN DIFFERENT PARTS OF MY VEHICLE. YOU MAY CONTACT THEM AT [XXX] AND ASK FOR [XXX] FOR FURTHER DETAILS. YOU MAY FIND MY VEHICLE BY THE LICENSE PLATE [XXX].        INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243672,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING VARIOUS SPEEDS, THE CONTACT NOTICED AN ABNORMAL FUEL ODOR COMING FROM THE FUEL TANK. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED AND THE FAILURE RECURRED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED THE CONTACT WITH CASE NUMBER: 9-542-4410467. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 18V304000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS APPROXIMATELY 8,000.",
        "vin": "1G1PC5SGXG7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ONSTAR MODULE FAILED AT APPROXIMATELY 53,500 MILES, TAKEN TO DEALERSHIP AT 54,542 MILES, GM PART NUMBER 84024907, NOT COVERED BY WARRANTY, ONSTAR SAFETY SYSTEM WILL NOT WORK.",
        "vin": "1G1BC5SM7G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2019",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPED IN A PARKING LOT, WAITING FOR A PARKING SPOT THE CAR JUST DIED. I HAD TO RESTART THE ENGINE. THIS HAS HAPPENED TWICE. I HAD PLENTY OF GAS.",
        "vin": "1G1PC5SGXG7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIRBAG LIGHT AND INDICATOR BEEP HAVE BEEN PRESENT ON MY VEHICLE FOR 1 WEEK NOW....JULY 16-23 2019. STILL OCCURRING TODAY, JULY 23, 2019",
        "vin": "1G1BC5SM3G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER MY CAR IS TURN OFF FOR 2HRS OR MORE THE VEHICLE WILL NOT START, UNLESS I USE A START JUMPER BOX.",
        "vin": "1G1PE5SBXG7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228901,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS AT INTERSECTIONS. THE AUTO STOP FEATURE GOES FROM \"AUTO STOP\" ON THE DASH TO \"OFF\". PROBLEM OCCURS AS YOU ARE MOVING FOOT OVER FROM BRAKE TO GAS AND CAUSES THE CAR TO TURN OFF. HAVE TO PUT CAR IN PARK AND COMPLETELY RESTART THE ENGINE BY TURNING THE CAR OFF AND THEN BACK ON. TYPICALLY HAPPENS WHEN IN AN INTERSECTION/AT A STOP SIGN AND HAVE TO COME TO A COMPLETE STOP. HAS HAPPENED BEFORE IN MANY SETTINGS- CITY STOP LIGHT, CITY STOP SIGN, HIGHWAY TRAFFIC, HIGHWAY STOP SIGN, ETC. SUPER UNSAFE BECAUSE CAR IS UNABLE TO MOVE AND SHUT OFF IN THE MIDDLE OF THE ROAD FOR ABOUT 10 SECONDS. HAPPENS AT LEAST 1 TIME A DAY. MANY OTHER CHEVROLET CRUZE USERS HAVE BEEN POSTING IN FORUMS THAT IT HAS HAPPENED TO THEM AS WELL. COULD CAUSE ACCIDENTS. MAKES THE DRIVER FEEL UNSAFE AND UNEASY EVERY TIME THEY GET IN THE CAR TO DRIVE BECAUSE THERE IS A FEAR THAT IT WILL STALL OUT/BREAK DOWN AT EVERY INTERSECTION OR STOP THAT IS MADE THROUGHOUT THE DRIVE.",
        "vin": "1G1BC5SM6G7"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222136,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE WILL JUST SHUT OFF RANDOMLY, WITH NO WARNING AT ALL. I HAVE TOOK IT INTO DEALER BECASE IT WAS STILL COVERED UNTIL POWERTRAIN, OF COURSE THEY FOUND NOTHING AFTER HAVING MY CAR FOR 4 DAYS. MY CAR SHUTS OFF ON THE HIGHWAY, IN THE MIDDLE OF TRAFFIC, OR WHILE COMING OFF THE HIGHWAY WITH CARS TRAILING BEHIND ME. IT SHUTS OFF SITTING AT RED LIGHTS, WHEN THE AUTO START COMES BACK ON IT NEVER FULLY WILL COME BACK ON, AND JUST COMPLETELY SHUTS OFF. IN WHICH I HAVE TO PUT MY CAR IN PARK AND START THE CAR AGAIN, AND AT TIMES IT DOESN'T START RIGHT AWAY! MY CHECK ENGINE LIGHT HAS BEEN UP, HOWEVER, THE DEALERSHIP AND AN AUTO STORE BOTH PULLED CODES AND NONE HAD ANYTHING TO DO WITH THE ACTUAL ENGINE.  THERE IS ALSO A \"SERVICE BRAKE ASSIST\" WARNING THAT HAS BEEN ON AS WELL. MY BREAKS WORK, BUT YOU HAVE TO PUSH DOWN VERY HARD FOR THEM TO WORK AT 100%.  I HAVE 2 CHILDREN, AND AM A SINGLE MOM, THIS IS A HUGE SAFETY CONCERN AND PUTTING ALL OF OUR LIVES AT RISK!  NO ONE SEEMS TO KNOW WHAT IS WRONG WITH THE CAR, AND I DON'T WANT ANY OF US TO GET INJURED OR DIE BECAUSE OF THIS ISSUE, BECAUSE SOONER OR LATER SOMEONE WILL.",
        "vin": "1G1BE5SM9G7"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/10/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERHEATING, SPEED DROP WHEN I DRIVING, ENGINE MAKE WEIRD NOISE DEALER CAN'T FIX IT THIS IS SAFETY ISSUE",
        "vin": "1G1PE5SB0G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216920,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL GOING DOWN THE ROAD COOLENT OUTLET HOUSING DISINTEGRATED WHILE HOSE ON THE RADIATOR WAS IN MOTION ON HIGHWAY IT CRACKED WHERE THE PART IS MOLDED PART IS GETS BAD QUICKLY OVERTIME AND HEAT",
        "vin": "1G1PF5SB9G7"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 CHEVY CRUZE LIMITED STARTED TO LOSE ACCELERATION AND WOULDN'T GO OVER 40 MILES AN HOUR. NO CODE LIGHTS ARE ON AND NONE DETECTED. SO I DROVE HOME AND PARKED THE CAR AND WAITED UNTIL IT WAS COOLED DOWN AND OPENED THE HOOD TO CHECK MY OIL. I UNSCREWED THE OIL CAP WHERE YOU ADD OIL AND IT COMPLETELY SMELLED LIKE GASOLINE. NOW THE ENGINE IS STARTING TO GO CRAZY AND I AM TAKING IT IN BEFORE IT CATCHES FIRE AND PUTS ME AND ANYONE ELSE IN DANGER.",
        "vin": "1G1PC5SG6G7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED. EAST HILLS CHEVROLET OF FREEPORT (42 EAST SUNRISE HIGHWAY, FREEPORT, NY 11520, (888) 739-7889) WAS NOTIFIED OF THE FAILURE AND HAD NOT YET SCHEDULED AN APPOINTMENT. THE DEALER REQUIRED THAT THE CONTACT FOLLOW-UP WITH THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1G1BG5SM9G7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPING, AN INITIAL PRESS OF THE BRAKE PEDAL WOULD NOT ENGAGE BRAKE LIKE USUAL. HAD TO PUSH ALL THE WAY DOWN TO GET THE VEHICLE'S BRAKES TO ENGAGE. THIS HAS HAPPENED THREE TIMES, EACH TIME THE VEHICLE WAS IN MOTION, DRIVING UNDER 20MPH.",
        "vin": "1G1PE5SB7G7"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193976,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 CHEVY CRUZE LS STARTED MAKING A ROARING NOISE WHILE DRIVING DOWN THE ROAD THEN THE STEERING GOT VERY STIFF I BARELY MADE IT HOME AND I CALLED THE DEALERSHIP AND THEY INFORMED ME THAT IF I CONTINUE TO DRIVE THE CAR THIS WAY THE STEERING WILL LOCK UP AT ANYTIME AND IT COULD CAUSE A VERY BAD ACCIDENT FOR I WILL NOT HAVE NO CONTROL OVER THE CAR.",
        "vin": "1G1BB5SM1G7"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN LEAVING A GROCERY STORE, ROUGHLY 2 MILES, MY HUSBAND SAID THE GAS PEDDLE CLICKED. MOMENTS LATER, THE CAR STARTED SHIFTING WEIRD. WOULD NOT GET PAST FIRST GEAR. SECOND GEAR MADE THE CAR SUPER SHAKY AND THEN IT SHUT OFF. WHEN RESTARTING, CAR WOULD DRIVE NORMAL FOR A MINUTE THEN ACT UP AGAIN. WE WOULD PUT IT IN NEURAL AND COAST IT WITH NO PROBLEMS UNTIL IT DIED AGAIN. WHEN WE GOT HOME ABOUT 30 MINUTES LATER, I PULLED THE CODE AND IT WAS PULLING O2 BANK 1 SENSOR 2. CAR IS AT THE DEALERSHIP NOW. WAITING FOR A CALL ON THE DIAGNOSIS.",
        "vin": "1G1PC5SG4G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENTERTAINMENT SYSTEM INTERMITTENTLY CUTS OUT WHILE DRIVING, ERROR MESSAGE WILL BRIEFLY FLASH ON SCREEN. THE PROBLEM WAS IDENTIFIED AS A FAULTY NEGATIVE BATTERY CABLE. THE SAME PROBLEM WAS PRESENT IN 2011-2015 CRUZE'S AND CHEVY ISSUED A SPECIAL COVERAGE ADJUSTMENT FOR THOSE MODEL YEARS. SEE BULLETIN 14311B. I EXPERIENCED THE EXACT SAME ISSUES, AND THE FIX BY THE MECHANIC WAS THE SAME FIX. WHY ISN'T CHEVY COVERING LATER MODEL YEARS?",
        "vin": "1G1PE5SB6G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO START THE CAR AND IT WOULD NOT START. TRIED A SECOND TIME AND IT STARTED WITH A WARNING THAT IT WAS IN \"REDUCED ENGINE POWER\". COULD NOT DRIVE THE CAR. PUT IT IN PARK, SHUT IT OFF. TRIED TO START IT AGAIN AND IT STARTED IN FULL ENGINE  POWER BUT WITH THE CHECK ENGINE LIGHT ON. IT WAS RECENTLY SERVICED AT DENOOYER CHEVROLET IN KALAMAZOO MICHIGAN DUE TO THE SAME ISSUES, 3 TIMES PRIOR TO THIS. CAR HAS 70,000 MILES ON IT AND DOES NOT SEEM TO BE RELIABLE AT ALL WITH SAME ISSUE OCCURING SHORTLY AFTER \"SERVICE/REPAIR\". I WANT SOMETHING DONE ABOUT THIS. I DO NOT FEEL SAFE!!",
        "vin": "1G1PE5SB5G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHEN DRIVING IN COLD WEATHER, THE TURBO BOOSTER FAILED TO OPERATE. THE CHECK ENGINE INDICATOR ILLUMINATED AND THE ENGINE SEIZED. THE VEHICLE WAS TAKEN TO WALSER POLAR CHEVROLET (612-284-4672, LOCATED AT 1801 COUNTY RD F EAST, WHITE BEAR LAKE, MN 55110) WHERE IT WAS DIAGNOSED THAT DRIVING IN THE COLD TEMPERATURE CAUSED MOISTURE TO FREEZE UP THE TURBO BOOSTER. THE TECHNICIAN STATED THAT THERE WAS NO CURRENT REMEDY FOR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO REMEDY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 59,000.",
        "vin": "1G1BG5SMXG7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR OVERHEATED AND THERE IS NO COOLANT IN THE TANK AND OIL IS POURING OUT OF THE HEAD GASKET THE CAR ONLY HAS LESS THAN 70K MILES.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING UP A HILL AT APPROXIMATELY 70 MPH, THE VEHICLE SUDDENLY LOST POWER AND DECELERATED TO 20 MPH. ALSO, THE SERVICE STABILITRAC AND CHECK ENGINE INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO WEIMER CHEVROLET (10355 MT. SAVAGE ROAD NW, CUMBERLAND, MD) WHERE IT WAS DIAGNOSED THAT THE ENGINE PISTON FAILED AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 82,800.",
        "vin": "1G1BE5SM6G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS OUT WHEN TRYING TO ACCELERATE OVER 30MPH AND AFTER 5-10 SECONDS THE ENGINE UNSTALLS AND CAR SHOOTS FORWARD. PROBLEM HAPPENS MORE FREQUENTLY WHEN THE AIR CONDITIONING IS RUNNING. TOOK CAR TO DEALERSHIP FOR WARRANTY SERVICE AND SERVICE ADVISOR SAID THAT HIS 2010 CRUZE HAD THE SAME PROBLEM. SERVICE TECHS COULD NOT DIAGNOSE THE ISSUE AND SAID NOTHING COULD BE DONE TO RESOLVE THE ISSUE",
        "vin": "1G1PG5SB2G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2019",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD ISSUES WITH ENGINE LOSING POWER OR STALING WITHOUT WARNING. NO WARNING LIGHTS WILL COME ON BEFORE HAND. I FIRST STARTED EXPERIENCE ISSUE IN JULY 2018, THE ENGINE STALLED AT STOP LIGHT; THE VEHICLE WAS REPAIRED AND RETURNED IN AUGUST. THE ISSUE RETURNED IN OCT, AT THIS TIME IT STALED GOING THREW INTERSECTION WHICH ALMOST RESULTED IN A WRECK.  DEC IT LOSS POWER WHILE GOING DOWN HEY I PULLED TO SIDE AND HAD CAR PULLED IN. LAST WEEK IT STALLED WHILE GOING DOWN HIGHWAY HAD NO POWER, I CALLED DEALERSHIP AND CHEVY AND WAS GIVING AN APPOINTMENT TO BRING IT IN. ITIS CURRENTLY IN THE SHOP FOR THE SAME ISSUES. I HAVE MADE SEVERAL COMPLAINTS TO CHEVOLET AND DEALERSHIP WITH NO RESULTS. THE CAR IS BEING SERVICE AT PARIS TEXAS CHEVOLET (903) 784-7446 FOR THE 4TH TIME.",
        "vin": "1G1BC5SM7G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2019",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" CAR RANDOMLY LOOSES POWER AND SHUTS OFF WHILE DRIVING ON FREEWAY, ELECTRICAL OUTLETS WON'T WORK, STABILIZATION WARNING APPEAR, BATTERY LEAKS ACID.",
        "vin": "1G1PC5SH6G7"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUING ILLUMINATION OF THE \"CHECK ENGINE\" LIGHT. TIED TO EMISSION SUSPECT MALFUNCTION CODES.   HAS BEEN SERVICE FOR THIS PROBLEM AT LEAST FIVE TIMES. REPLACED FUEL INDUCTION SYSTEM, TURBO, FUEL INDUCTION SOLENOID AND OTHER COMPONENTS.  STILL NO RESOLUTION.  PROBLEM IS MADE KNOWN BY ILLUMINATION OF \"CHECK ENGINE\" LIGHT WHILE THE CAR IS RUNNING.  NO AFTER MARKET PARTS, APPROX 48,000 MILES.  THE DEALER SERVICE DEPARTMENT CANNOT SEEM TO CORRECT THE PROBLEM AFTER MULTIPLE TRIES.",
        "vin": "1G1PE5SB2G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE ENGINE IS RUNNING, THE TRANSMISSION SUDDENLY AND WITHOUT WARNING FAILS. CAR IS IN GEAR BUT DOESN'T MOVE. FIRST OCCURRENCE WAS WHEN CAR WAS PARKED IN THE MORNING AND PUT INTO REVERSE TO BLACKOUT AND SECOND OCCURRENCE WAS A COUPLE WEEKS LATER WHEN STOPPED AT A RED LIGHT. TURNING THE CAR OFF FOR  A FEW MINUTES SEEMS TO TEMPORARILY CORRECT THE PROBLEM. I AM WORRIED THE TRANSMISSION WILL FAIL SUDDENLY WHILE IN AN INTERSECTION OR OTHER DANGEROUS SITUATION",
        "vin": "1G1BE5SM2G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2018",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF COOLANT. UNABLE TO BE DETERMINED BY DEALER ON MULTIPLE OCCASIONS. I HAVE TO KEEP ADDING ANTIFREEZE.  THERE ARE NO EXTERNAL LEAKS FOUND. LOSS OF HEAT WITH LOSS OF ANTIFREEZE.",
        "vin": "1G1PC5SG1G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IS KNOCKING CLICKING AND ROCKING. ACTING LIKE IT'S GOING TO STALL STATIONARY. ENGINE LIGHT ON, TRACTION CONTROL LIGHT ON AND ALL START DOES NOT WORK. ALL CAME ON AT THE SAME TIME.",
        "vin": "1G1PF5SB1G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157220,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECAL  THE ENGINE SHUTDOWN COMPLETELY WITHOUT A REASON, GAS TANK ALL THE SUDDEN IS EMPTY AND THE WHEELS  LOCKED AND SHUTDOWN.",
        "vin": "1G1BG5SMXG7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/04/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVY CRUZE LTZ FAULTY BATTERY NEGATIVE CABLE CAUSING BATTERY CORROSION, WHILE DRIVING CAR HAS POWER STEERING ERRORS (LOSS OF STABLE STEERING CAPABILITIES), TRACTION SYSTEM ERRORS, REDUCED VEHICLE POWER, PROBLEMS WITH CRUISE CONTROL (SPEEDS UP BY ITSELF). CONTACTED GM AND INFORMED THEM OF THIS ISSUE. THEY DENIED COVERAGE, DESPITE HAVING IDENTIFIED THE SAME SAFETY ISSUES WITH THE 2011-2015 MODELS.",
        "vin": "1G1PG5SB4G7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE DEALER WHERE I BUT MY CAR AND THEY TOLD THAT THEY  SOLD THE SERVICE CONTRACT TO ANOTHER DEALER WHO IS  TO FAR FROM WHERE I LEAVE AN I AM A DIALYSIS PATIENT AND 74 YRS OLD TAHTS WHY I CAN TAKE THE CAR FOR BE INSPECTED. THE DEALER ALBERIC COLON AUTO SALES",
        "vin": "1G1BC5SM2G7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145212,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE LOOKING FOR PARKING IN MY APARTMENT COMPLEX IT BECAME VERY HARD TO PRESS DOWN ON THE BREAK PEDDLE AND I WAS FORCED TO USE MY E-BREAK TO STOP. MY BREAK PEDDLE IS NOW VERY HARD TO PRESS AND AFTER SPEAKING WITH A MECHANIC I WAS TOLD IT WAS THE POWER BREAK BOOSTER.",
        "vin": "1G1BB5SM4G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT DOESN'T HAPPEN ALL THE TIME BUT EVERY FEW DAYS PASSENGER SIDE DOORS STAY IT'S OPEN WHETHER I'M DRIVING OR SITTING STILL. THE LOCKS WILL TRY TO LOCK WHEN THEY ARE ALREADY LOCKED AND THE DOOR WARNING SIGN GOES OFF.     ALSO IF MY FRONT TIRE NEEDS AIR THE BACK TIRE WARNING SIGN WILL GO OFF AND VICE VERSA. THE FIRST TIME I REALIZED THIS I HAD PUT AIR IN THE FRONT TIRE BUT THE LIGHT STAYED ON FOR THE BACK TIRE. WHEN I PUT AIR I THE FRONT TIRE THE BACK TIRE WARNING SIGN WENT OUT.     TODAY THE RADIO WENT OUT BUT THE SCREEN DIDN'T CUT OFF. THE CAR IS PARKED AND KEYS ARE NOT IN THE IGNITION BUT THE RADIO SCREEN IS STILL LIT UP.  UPDATED 11/9/18*JB",
        "vin": "1G1PC5SH6G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE LAST YEAR IN LATE SEPTEMBER.  ON SEPTEMBER 22ND THIS YEAR I HAD TO HAVE A PISTON JOB PERFORMED ON MY ENGINE DUE TO THE CYLINDER #1 MISFIRING. THE TOW THAT AAA PROVIDED AND MY MECHANIC WHERE MY CAR WAS TOWED TO BOTH TOLD ME AT SEPARATE TIMES THAT MY AC BEING ON MADE THE PROBLEM WITH MY ENGINE WORSEN. MY MECHANIC ACTUALLY TOLD ME TO NOT TURN ON MY AC AS I WAS DRIVING IT OUT OF HIS GARAGE TO TAKE TO A CHEVY DEALER. AN ADVISOR AT THE DEALER INFORMED ME THAT THE TWO,  THE ENGINE AND THE AC, ARE APART FROM EACH OTHER AND THE AC SHOULD NOT BE AFFECTING THE ENGINE IN THIS MANNER. AFTER THE LABOR ON MY CAR WAS COMPLETE I IMMEDIATELY NOTICE THE SAME ROUGH SHAKE WITHIN THE ENGINE AND THE LOUD SOUND COMING FROM THE AREA WHERE THE AC IS HOUSED THAT SOUNDS LIKE SOMEONE IS KNOCKING ON A DOOR OR PLAYING DRUMS OR EVEN AS IF A TRAIN IS GOING BY ON THE TRACKS. THIS WOULD HAPPEN EVERY TIME I TURNED MY AC OR HEAT ON WHETHER I WAS STATIONARY,  IN MOTION,  ON A CITY STREET,  OR HIGHWAY. I WAS SO ACCUSTOMED TO THIS THAT I HAD NEVER THOUGHT IT MAY BE ABNORMAL BECAUSE I NEVER HAD A VEHICLE WITH AUTO STOP, WHICH IS WHAT I FIRST THOUGHT I WAS EXPERIENCING. THE PISTON JOB WAS A $6,000 JOB. FORTUNATELY,  I DID NOT HAVE TO PAY THAT AMOUNT. MY CAR WAS AT 61,263 MILES WHEN I HAD TO GET IT SERVICED. I TRULY BELIEVE THAT THIS ISSUE IS A SAFETY RISK NOW BEING THAT IT IS STRAINING ON THE ENGINE AND POSSIBLY THE REASON WHY THE CYLINDER #1 FAILED FOR NO REASON WHEN MY CAR IS MAINTAINED AND NOT NEGLECTED.",
        "vin": "1G1BE5SM7G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DOOR AJAR ALARM GOES OFF NOT STOP WHEN CAR IS IN MOTION AFTER 3 MINS THE LOCKS TRY TO UNLOCK AND LOCK GOING DOWN THE ROAD AND THE DOME LIGHTS FLASH ON AND OFF. MY ALARM SYSTEM GOES OFF EVERY 10 TO 20 MIN IN THE MIDDLE OF THE NIGHT OR DAY SO YOU CANT SET YOUR ALARMS AND ALL ORDER FOR THE PART ARE ON BACK ORDER. THE DOOR SENSOR TRIGGERS THE MOST WHEN MAKING A HARD RIGHT TURN. MOVING PARKED OR SITTING I  DRIVE THE SENSOR STILL ALARMS OUT",
        "vin": "1G1PC5SH6G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR AJAR SENSOR GOES OFF WHILE DRIVING, PARKED CAUSE ALARM SYSTEM TO GO OFF. DOOR LOCKS GO BACK AND FORTH WHILE DRIVING. DOME LIGHTS GO OFF AND ON.",
        "vin": "1G1PC5SH6G7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129749,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS IN REVERSE GOING OUT THE DRIVE WAY THAT WAS ON A SLIGHT HILL. CAR CUT OFF AND WOULD NOT START. GOT OUT CAR AND SEEN GAS LEAKING AND CHECK ENGINE LIGHT CAME ON. THE CAR WAS IN MOTION ON A NEIGHBORHOOD ROAD. HAD TO HAVE CAR TOW WAS UNSAFE TO DRIVE. ON 8/8/2018 TOOK  CAR TO BRADSHAW OF GREER BECAUSE OF A RECALL ON THE FUEL LEAK. CERTAIN GM VEHICLES COULD POSSIBLY HAVE AN ISSUE THAT COULD CAUSE A FUEL LEAK AND THE VPS SENSOR NEEDS A LOCK RING INSTALLED. HAD THE CAR WORKED ON FOR THE RECALL AND I STILL HAD A GAS LEAK. VERY DANGEROUS AND UNSAFE. DEALER SHIP WOULD NOT HAVE MY CAR TOW AFTER THE RECALL SHOULD HAD BEEN FIXED.  18159 NONCOMPLIANCE RECALL---FUEL LEAK DURING F/CMVSS TESTING",
        "vin": "1G1BC5SM9G7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11129644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I WAS LEAVING A PARKING LOT AND WENT TO TURN INTO MY LANE AND SOMEONE CUT OVER AT THE LAST MINUTE CAUSING ME TO JERK MY WHEEL OUT OF REACTION AND THE FRONT END OF MY CAR SLAMMED INTO THE GUARD RAIL. MY AIR BAGS NEVER WENT OFF AND MY HEAD BOUNCED OFF THE STEERING WHEEL TWICE CAUSING SOME DAMAGE TO MY FACE.",
        "vin": "1G1PC5SH7G7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129541,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING 10 MPH, THE CONTACT HEARD AN ABNORMAL NOISE ON THE PASSENGER SIDE OF THE VEHICLE NEAR THE PASSENGER SIDE TIRE. THE VEHICLE WAS TAKEN TO ANCIRA CHEVROLET (6111 BANDERA RD, SAN ANTONIO, TX 78238, 210-681-4900) WHERE IT WAS DIAGNOSED THAT THE RACK AND PINION COULD BE THE CAUSE OF THE FAILURE. THE VEHICLE WAS REPAIRED, BUT THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME SYMPTOMS. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THEY WOULD LAUNCH AN INVESTIGATION. THE FAILURE MILEAGE WAS APPROXIMATELY 28,650.",
        "vin": "1G1BE5SMXG7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2018",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL",
        "vin": "1G1BC5SM1G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR FIRST STARTED HAVING ISSUES WITH SWITCHING GEARS. GOING INTO AND OUT OF DRIVE SPECIFICALLY. WOULDN'T EVEN BUDGE. DEALERSHIP SAID IT MUST BE SOMETHING STICKY SPILLED IN GEARS. HAVE HAD NO SPILLS IN THAT AREA. SOON AFTER THIS VISIT MY CAR WOULD TURN OFF IN STOP AND GO TRAFFIC. DEALERSHIP SAID THEY COULDN'T REPLICATE THE ISSUE SO THEY COULDN'T TELL ME WHAT IT WAS. NOW, NOT MUCH LATER THAN THE LAST VISIT, MY CAR IS SHUTTING OFF ON THE INTERSTATE, EVERY LIGHT INSIDE CAR (DOOR OPEN LIGHTS, RADIO LIGHTS, A/C LIGHTS, DASH LIGHTS) ARE DIMMING AND BRIGHTENING OR TURNING ON AND OFF ON THEIR OWN, WINDOWS ROLL UP AND DOWN ON THEIR OWN, A/C SHUTS ON AND OFF OR WILL CHANGE VENTS ON ITS OWN, BURGLAR SYSTEM DETECTION GOES OFF WHEN TRYING TO START THE CAR, AND CAR WON'T START AFTER BEING OFF FOR 20-30 MINUTES WITHOUT A JUMP. THREE DIFFERENT PLACES HAVE USED BATTERY AND CODE READERS AND CANNOT FIND AN ISSUE. MY BATTERY, STARTER, AND ALTERNATOR ARE IN GREAT CONDITION. EVERY PLACE EXCEPT THE DEALERSHIP HAS TOLD ME IT'S A \"MAJOR ELECTRICAL ISSUE THAT NEEDS TO BE FIXED ASAP.\" CAR IS STILL UNDER WARRANTY. HAS HAD ALL WORK ASIDE FROM THE READINGS DONE AT DEALERSHIP. THEY SAY THEY CAN'T FIND OUT THE ISSUE. THIS IS THE THIRD TIME WITHIN 4 MONTHS THAT MY CAR ISSUES HAVE BEEN AVOIDED BY THE DEALERSHIP AND I HAVE BEEN TOLD THEY CAN'T REPLICATE WHAT I'M DEALING WITH WHEN THEY TEST DRIVE IT SO THEY CAN'T HELP ME. IT IS A DANGER TO ME AND ANY OTHER DRIVER AROUND ME WHEN MY CAR SUDDENLY SHUTS OFF AT 70 MPH AND I HAVE TO TRY TO PULL OVER TO PARK MY CAR TO TRY TO START IT AGAIN. CLICKING AND ZAPPING SOUNDS CAN ALSO BE HEARD FROM UNDER OR BEHIND MY ENGINE THAT SHOULD NOT BE THERE. WAS TOLD AT THE DEALERSHIP IF THEY CAN'T FIGURE IT OUT THEY WOULD HAVE TO SEND ME HOME WITH MY VEHICLE... STILL DOING ALL THESE THINGS. I HAVE BEEN THE ONLY OWNER AND DRIVER, UNDER 20K MILES ON VEHICLE, NO MODS ADDED.",
        "vin": "1G1PC5SH7G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WILL START WITH THIS HAS HAPPENED TWICE. I NO LONGER FEEL SAFE IN MY CAR, BUT THE MECHANIC CANNOT FIGURE OUT WHAT IS WRONG. MY CAR GOT STUCK AT 3,000 RPMS WHILE DRIVING IN TRAFFIC. WHEN I PUT MY FOOT ON THE BREAK THE CAR WOULD NOT COME TO A STOP IT KEPT BUCKING BUCKING FORWARD WITH THE ENGINE ROARING. I TRIED PUTTING THE CAR IN NEUTRAL AND THAT DIDN'T DO ANYTHING. I FINALLY PUT THE CAR IN PARK AND THE CAR FINALLY STOPPED MOVING, BUT WAS STILL REVVING AT 3,000 RPMS. I FINALLY HAD TO TURN THE CAR OFF. ONCE I TURNED THE CAR BACK ON THE GUAGES WERE WERE SWIPING BACK AND FORTH AND THEN FINALLY I HEARD A LOUD CLUNK AND THEN THE GAUGES WENT BACK TO NORMAL AND THE CAR WAS OKAY. I DID CHECK TO MAKE SURE THE GAS PEDAL WASN'T STUCK I PULLED IT UP WITH MY FOOT, BUT IT WAS UP ALL THE WAY SO THE I KNOW THE GAS PEDAL WAS NOT STUCK. THIS HAPPENED DURING RUSH HOUR TRAFFIC TWICE. I FEAR NEXT TIME I WILL NOT BE SO LUCKY. I'M 21 WEEKS PREGNANT AND I HAVE AN 11 YEAR CHILD THAT DRIVES OFTEN WITH ME. THIS IS NOT SAFE SOMEONE HAS TO DO SOMETHING.",
        "vin": "1G1BE5SM4G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113015,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IM PRESSING THE BREAKS WHILE TURNING THE RPMS GO UP TO 3. WHEN IM GOING UP A HILL AND TRYING TO ACCELERATE THE CAR IS SLOW AT GETTING UP TO A 3 IN THE RPMS",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111489,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE U0164 :DATA COMMUNICATION WITH THE CLIMATE CONTROL SYSTEM HAS BEEN LOST OR INTERRUPTED.  CODE U0155 : DATA COMMUNICATION WITH THE INSTRUMENT PANEL SYSTEM HAS BEEN LOST OR INTERRUPTED.  RECEIVED THESE CODES FROM ON STSR TOOK MY VEHICLE TO DEALERSHIP NEXT DAY THEY SAID THEY FOUND NO ERRORS. BUT, I DON'T KNOW HOW NOW WHEN EVER I USE XM SIRIUS RADIO IT ALWAYS SAYS LOST CONNECTION/SIGNAL. ALSO, VEHICLE IS ALWAYS HOT LIKE THE HEATER IS ON WHEN IT'S NOT ON. HAS LOST IN ACCELERATION WHILE DRIVING HIGHWAY AND CITY STREETS BEEN DOING THAT FOR THE LAST MONTH OR 2. ALSO THE DASHBOARD SEEMS TO NOT BE WORKING NO LIGHTS COME ON WHEN FLUIDS ARE NEEDED.",
        "vin": "1G1PC5SG8G7"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104519,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING 45 MPH, THE VEHICLE STALLED WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE VEHICLE WAS SHIFTED INTO PARK AND RESTARTED ON THE FIRST ATTEMPT. THE CONTACT STATED THAT THE FAILURE OCCURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO HURRICANE CHEVROLET (200 SATURN WAY, HURRICANE, WV 25526, (304) 562-3005) WHERE IT WAS DIAGNOSED THAT THE CONVERTER MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE PERSISTED. THE VEHICLE WAS TOWED BACK TO THE DEALER AND WAS INFORMED THAT THE WIRE TO WIRE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS AT THE DEALER AWAITING FURTHER DIAGNOSTIC TESTING AND REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 25,000. *TT  *TR",
        "vin": "1G1BE5SM4G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "06/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN THE LAST THREE MONTHS THIS CAR HAS STOP WHILE I WAS DRIVING. IN APRIL I WAS  MAKING A LEFT TURN AND IT STOP. MAY 29,  WHILE I WAS DRIVING IT STOP ON A STRAIGHT STREET.  JUNE 19 IT STOP NO A STRAIGHT STREET. I AM SO AFRAID TO DRIVE THIS CAR WHEN I GET IT BACK THE MECHANIC FIRST SAID IT WAS OUT OF GAS, BUT IT WAS NOT, THIS LAST TIME HE SAID IT STARTED AS SOON AS THEY TOOK IT OFF THE TOW TRUCK. I ASK HIM TO KEEP IT AND DRIVE IT, TODAY JUNE 21, HE CALLED AND SAID IT HAD STALLED AGAIN.      HELP 66 YEAR OLD SCARED DRIVER",
        "vin": "1G1BC5SMXG7"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V304000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (SCHUMACHER CHEVROLET OF LIVINGSTON, 606 W MT PLEASANT AVE, LIVINGSTON, NJ 07039, (877) 849-2010) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1G1BC5SM5G7"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101541,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER I ADJUST MY SEAT BACK SUPPORT AND RELEASE THE LEVER. IT WILL STILL POP BACK LIKE IT WAS NEVER LOCKED IN POSITION AND THE WHOLE SEAT SEEMS LIKE IT LEANS TO THE RIGHT.",
        "vin": "1G1BC5SM5G7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY ON MY WAY TO DROP OFF MY DAUGHTER TO THE BABYSITTER WHEN SUDDENLY MY STEERING WHEEL STARTED GETTING HARD AND THE CAR WOULDN'T RUN, I KEPT PUSHING THE GAS PETAL AND NOTHING, MY CAR WASN'T RUNNING. WHEN SUDDENLY THE CHECK ENGINE LIGHT STARTED BLINKING AND THE TRACTION CONTROL LIGHT AS WELL. THE CAR WAS OFF IN THE MIDDLE OF THE FREEWAY, LUCKILY THERE WAS TRAFFIC AND THE CARS WERE BARELY MOVING.  UNTIL FINALLY I TURNED IT BACK ON AND CONTINUED DRIVING. THE FOLLOWING DAY WHEN I WAS LEAVING TO GO TO WORK MY CAR FELT HARD AND THE ENGINE WAS SHAKING RIDICULOUSLY AND I'D PUSH ON THE GAS PETAL ON THE CAR AND IT WOULDN'T DRIVE. I HAD TO LEAVE THE CAR AT HOME AND I WASN'T ABLE TO CALL THE DEALER BECAUSE IT WAS CLOSED DUE TO MEMORIAL DAY. MY CAR WON'T GO AND I'M WAITING TO SEE WHAT THE DEALER IS GOING TO TELL ME. KEEPING IN MIND THAT THE CAR WAS BRAND NEW OLDS WHEN I GOT IT OUT OF THE DEALER.",
        "vin": "1G1BE5SM1G7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY INVOLVED IN AN ACCIDENT WHERE I WAS REAR ENDED.  WAS STOPPED AT A RED LIGHT, LIGHT HAD JUST CHANGED, I PUT MY FOOT ON THE GAS PEDAL TO ACCELERATE WHEN I WAS HIT FROM BEHIND.  NO AIRBAGS DEPLOYED, ALTHOUGH THERE IS A MESSAGE ON MY DASH NOW THAT STATES AIR BAG DEPLOYED AND ALSO THE SERVICE AIR BAG LIGHT IS ON.  CAR IS CURRENTLY IN THE SHOP FOR THE REPAIRS TO THE REAR END, BUMPER AND DECK LID.",
        "vin": "1G1BC5SM7G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WIPERS STOPPED WORKING ON MY 2016 CHEVY CRUZE. ONLY 2 YEARS OLD AND NOW CAN'T WIPE RAIN AWAY CAUSE IT STOPPED WITH NO WARNING AND NO PROBLEMS PRIOR",
        "vin": "1G1BD5SMXG7"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/13/2018",
        "dateOfIncident": "04/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085004,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SEAT BELT ON THE DRIVER SIDE WILL NOT LATCH. I CAN'T HOOK MY SEAT BELT AND IF I GET IN A ACCIDENT THEN I WILL GET HURT. I NEED THIS TO BE TAKING CARE OF AS SOON AS POSSIBLE.",
        "vin": "1G1PE5SB6G7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/07/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL     WINDOW ON DRIVER SIDE NOT GOING UP OR DOWN IF WE GET IT TO GO DOWN WE HAVE TO SLAM THE DOOR 3 TIMES THEN THE WINDOW WILL GO UP . I HAVEN'T HAD MY CAR A FULL YEAR YET.",
        "vin": "1G1PC5SH0G7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083145,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY CAR IN THE PARKING LOT AT MY WORK AND I HAD THE BRAKE UP BUT THE CAR ROLLED BACK AND HIT A PARKED CAR.  THANKFULLY, NOT A LOT OF DAMAGE WAS DONE TO THE CAR BUT I COULDN'T RELAX ABOUT MY CAR.  I TOOK MY CAR INTO THE DEALERSHIP BECAUSE I HAD THE CAR ONLY 1 1/2 YEARS AND THEY HAD MY CAR FOR 4 HOURS.  WHEN I CALLED THEM, I FELT LIKE THEY WERE TALKING DOWN TO ME BECAUSE I'M A GIRL AND THEN THEY TOLD ME THAT THE CAR WAS WORKING THE WAY THAT THE MANUFACTURER DESIGNED IT.  I HAVE DRIVEN A STICK SHIFT FOR OVER 20 YEARS AND THE MANUFACTURERS SHOULDN'T BE DESIGNING CARS SO THAT THE BRAKES DON'T WORK.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "02/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075251,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING APPROXIMATELY 35 MPH AND MAKING A LEFT TURN, A GRINDING TYPE NOISE WAS PRESENT COMING FROM THE STEERING COLUMN. THE POWER STEERING MALFUNCTIONED AND MADE THE STEERING WHEEL VERY DIFFICULT TO TURN. DURING THE FAILURE, THE \"SERVICE STABILITRAC\" AND \"SERVICE POWER STEERING\" MESSAGES DISPLAYED. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 9,070.",
        "vin": "1G1BB5FM2G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2018",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073420,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM OF SICKENING, STRONG ODOR INSIDE THE CAR WHILE THE ENGINE IS RUNNING.  SWEET SMELL OF COOLANT EMANATING FROM INSIDE THE DASHBOARD VENTILATION AREA SYSTEM. ODOR PERSISTS THROUGHOUT THE DRIVE.   IT PERSISTS IN ALL SETTINGS OF VENTILATION, A.C., AIR, ETC. I HAVE BROUGHT THE CAR IN FOR REPEATED,FAILED ATTEMPTS BY THE CHEVY DEALERSHIP, LOU BACHRODT OF POMPANO BEACH, FL., TO CORRECT THE ISSUE ON 9/27/16, 11/07/16 AND 11/21/16. I BELIEVE THEY ONLY FUMIGATED THE CAR WITH AN ANTI-FUNGAL? RATHER THAN CORRECT THE SOURCE OF THE PROBLEM.  THEY DID NOT ACKNOWLEDGE THERE WAS AN ISSUE EITHER WRITTEN ON MY WORK ORDERS OR WHEN I SPOKE WITH THE SERVICE REPS.  MORE RECENTLY A SOUR, MOLDY ODOR IS PRESENT INSIDE THE VEHICLE BESIDES THE COOLANT LEAK ODOR.  ORDINARILY, I DRIVE UNDER 10 MILES A DAY ON CITY STREETS AND THE ODORS PERSISTS THROUGHOUT.",
        "vin": "1G1BC5SM4G7"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS LESS THAN 17,000 MILES ON IT, AND THE CAR JERKS LIKE A FAILING TRANSMISSION. WHEN DRIVING AND STARTING UP AFTER STOPPING IT JERKS AND HESITATES. BRAKES ARE CONTINUOUSLY BEING BLOWN OUT AS THEY SQUEAL.",
        "vin": "1G1PC5SG5G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "10/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT RESERVOIR CRACKED, POSSIBLE BLOWN HEAD GASKET, OR BAD WATER PUMP.",
        "vin": "1G1PE5SB5G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040594,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING ALONG A FREEWAY IN NORTH CAROLINA WHEN SHE NOTICED THE TIRE PRESSURE MONITOR WARNING FOR THE RIGHT FRONT TIRE WAS DISPLAYING IN RED, THAT ONLY 12 POUNDS OF AIR WAS IN THAT TIRE.  SHE STOPS AT A GAS STATION AND CHECK THE TIRE WHICH APPEARED NORMAL.SHE GETS BACK ONTO THE FREEWAY AND WITHIN A FEW MILES, THE RIGHT REAR TIRE BLOWS OUT, COMPLETELY SEPARATING THE THREADED PORTION FROM THE REST OF THE TIRE. FORTUNATELY SHE WAS ABLE TO GET TO THE SHOULDER AND STOP THE VEHICLE. SHE CALLS HER BOYFRIEND WHO IS A POLICE OFFICER.WHEN HE ARRIVES ON THE SCENE, HE INSPECTS WHAT WAS LEFT OF THE TIRE AND COULD NOT FIND ANY PUNCTURES OR DAMAGE THAT MAY HAVE CONTRIBUTED TO THE PROBLEM.THE NEXT DAY, I TOOK THE VEHICLE TO DEALERSHIP WHERE SHE PURCHASED IT AND SPOKE WITH THE SERVICE MANAGER TRYING TO DETERMINED IF THERE IS A SAFETY ISSUE OR FAULTY TIRE. I WAS TOLD THAT BECAUSE SHE HAD HAD THE TIRES ROTATED SEVERAL WEEKS EARLIER, THE TIRES PRESSURE MONITORING SYSTEM SHOULD HAVE BEEN RE-REGISTERED.IN OTHER WORDS, THERE SYSTEM WAS STILL MONITORING THE TIRE WHICH HAD BEEN ROTATED FROM THE FRONT AS IF IT WAS STILL THERE, ONLY THIS TIRE IS NOW ON THE REAR OF THE CAR. THE INDICATION SHOWED THAT THE FRONT TIRE WAS LOW WHEN IN FACT, IT WAS THE REAR TIRE THAT NEEDED ATTENTION. I'VE SPOKEN TO 2 WALMART AUTO SERVICE MANAGES AND A GOODYEAR SERVICE MANAGER WHO ALL TOLD ME THAT THEY DON'T EVER RE-REGISTER A TIRE MONITORING SYSTEM WHEN THEY SERVICE A VEHICLE.THE WALMART GUYS SAID THAT THEY HAD NEVER HEARD OF SUCH A THING.I MAY BE NAIVE, BUT I TOO WAS UNDER THE IMPRESSION THAT THE SYSTEM AUTOMATICALLY REGISTERED THE TIRE THAT IS THERE, NO MATTER IF THEY WERE ROTATED. I SPOKE WITH A CHEVROLET SALES ASSOCIATE WHO SAID THAT THE CONSUMER IS NOT MADE AWARE OF THIS WHEN THEY PURCHASE A VEHICLE. SEEMS TO ME THAT THIS IS A FLAWED SYSTEM. TIRE ROTATION RE-REGISTERING. I HAVE PICTURES.",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2017",
        "dateOfIncident": "07/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032666,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS UNABLE TO RESTART. THE VEHICLE WAS TOWED TO WALKER CHEVROLET (3940 CAR OTHERS PKWY, FRANKLIN, TN, 37067) WHERE IT WAS DIAGNOSED THAT THE CO2 SENSOR FAILED. THE SENSOR WAS REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, TWO MONTHS LATER, THE FAILURE RECURRED. THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. AFTER MULTIPLE ATTEMPTS, THE VEHICLE RESTARTED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE SECOND LOCAL DEALER (LUCAS CHEVROLET CADILLAC, 101 S JAMES CAMPBELL BLVD, COLUMBIA, TN, 38401). IT WAS DIAGNOSED THAT DUE TO AMBIENT TEMPERATURES OVER 100 DEGREES FAHRENHEIT, VAPOR BUILD-UP WAS IN THE FUEL FEED LINE AND CAUSED THE VEHICLE TO STALL. THE DEALER STATED THAT THERE WAS NO REMEDY EXCEPT HIGHER OCTANE. THE DEALER ALSO RECOMMENDED THAT THE VEHICLE BE KEPT IN COOLER TEMPERATURES AND REFRAIN FROM IDLING. THE FAILURE WAS UNDER BULLETIN PIP5507B. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000. .UPDATED 11/09/17 *BF  UPDATED 11/13/2017*JS",
        "vin": "1G1PC5SH9G7"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR GOES INTO LIMP MODE AFTER WARMS UP AND SAYS SERVICE POWER STEERING AND SERVICE TRACK STABILITY VERY DANGEROUS IN TRAFFIC",
        "vin": "1G1PC5SH3G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2017",
        "dateOfIncident": "09/26/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LEAST ONCE A WEEK,  MY CHEVY CRUZE 2016 ENGINE SHUTS OFF COMPLETELY WHILE IDLE AT A STOP SIGN OF RED LIGHT. I HAVE AUTO SHUT OFF AND WHEN THE AUTO SHUT OFF IS IN PLAY IT NEVER CUTS BACK ON WHEN TAKING MY FOOT OFF THE BRAKE. I HAVE TO PUT MY CAR INTO PARK AND RESTART THE ENGINE.",
        "vin": "1G1BC5SMXG7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024207,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE STATIONARY, THE VEHICLE ACCELERATED RAPIDLY WITHOUT WARNING AND CRASHED INTO A TREE. UPON REMOVING PRESSURE FROM THE BRAKE PEDAL, THE VEHICLE ACCELERATED INDEPENDENTLY. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS ABLE TO BE DRIVEN AWAY FROM THE SCENE. THE VEHICLE WAS NOT DESTROYED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE FAILURE MILEAGE WAS 3,400.",
        "vin": "1G1BC5SM9G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "08/06/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013367,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 CHEVROLET CRUZE. WHILE THE VEHICLE WAS PARKED IN A PARKING LOT, THE CONTACT AND OTHERS BEGAN TO SMELL A BURNING ODOR OUTSIDE THE CHURCH BUILDING. WHEN THEY EXITED THE CHURCH, THE SMELL INTENSIFIED. FLAMES EMERGED FROM THE REAR SEAT AND THE VEHICLE WAS FILLED WITH SMOKE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE, WHICH HAD ALREADY SPREAD TO THE NEXT VEHICLE. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER AND DEALER WERE NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.",
        "vin": "1G1BC5SM6G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED WHILE MAKING A LEFT TURN IN TRAFFIC- A VERY DANGEROUS SITUATION.",
        "vin": "1G1BE5SM4G7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "05/13/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986039,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 60 MPH, THE VEHICLE BEGAN TO SHAKE AND SMOKE BEGAN TO COME FROM UNDERNEATH THE HOOD OF THE VEHICLE. THE CONTACT PULLED OVER AND PLACED THE VEHICLE IN PARK HOWEVER, THE VEHICLE BEGAN TO REVERSE ON ITS OWN. THE CONTACT REMOVED THEMSELVES FROM THE VEHICLE AND NOTICED LIQUID COMING FROM UNDERNEATH THE VEHICLE. THE VEHICLE CAME TO A ROLLING STOP AT WHICH POINT THE CONTACT NOTICED SMOKE COMING FROM THE VEHICLE AGAIN. THE CONTACT OPENED THE HOOD AND NOTICED A FIRE COMING FROM THE TRANSMISSION OF THE VEHICLE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE AND FILED A REPORT. THE VEHICLE WAS TOWED. THE VEHICLE HAD NOT RECEIVED A DIAGNOSING FOR THE FAILURE AND WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCED ANY INJURIES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO ADVISED TO CONTACT THEIR INSURANCE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "1G1BE5SM5G7"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE IN MARCH OF 2017 WITH 36,000 MILES ON IT. A FEW DAYS AFTER PURCHASE, I'VE NOTICED THAT THE RADIO WILL RANDOMLY SHUT OFF AND COME RIGHT BACK ON. EVERY TIME THIS HAPPENS I WILL ALSO SEE A MESSAGE APPEAR ON THE DASHBOARD STATING \"SERVICE STABILITRAK\". I NOTICE IT HAPPENS ONCE IN A WHILE IF I AM DRIVING THROUGH CITY STREETS. WHEN I DROVE THE CAR ON THE HIGHWAY, I REALIZED IT SHUTS OFF AND ON MORE FREQUENTLY. I ALSO NOTICED THAT WHEN MY RADIO FLICKERS OFF, MY LIGHTS AND TURN SIGNALS ALSO SHUT OFF.",
        "vin": "1G1PC5SH2G7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985039,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS, DURING ACCELERATION, I EXPERIENCE A STUCK THROTTLE CONDITION ON MY 2016 CHEVY CRUISE. ONCE IN EARLY APRIL (REPORTED TO DEALER) ON A CITY STREET AND A SECOND TIME ON MAY 10TH, 2017 ON A FREEWAY ON RAMP. DURING THE FIRST INCIDENT I WAS ABLE HIT THE GAS PEDAL WITH MY FOOT AND IT RELEASED, DURING THE SECOND ACCELERATION INCIDENT, I TRIED TO UNSEAT THE PEDAL WITH MY FOOT TO NO AVAIL, I THEN PUSHED THE SHIFTER TO NEUTRAL AND THE ACCELERATOR DISLODGED. I TOOK THE VEHICLE TO FISHER CHEVROLET ON MAY 10TH AND THEY ROAD TESTED THE CAR AND WERE UNABLE TO \"VERIFY THE CONCERN.\" THE DEALER HAS SINCE CALLED ME AND STATED THAT THEY HAD CONTACTED GM ENGINEERING AND WERE TOLD THIS CONDITION COULD NOT HAVE HAPPENED. IT DID HAPPEN, ON TWO OCCASIONS. IN BOTH CASES I WAS FORTUNATE TO BE IN S SITUATION WHERE NO ONE WAS DIRECTLY IN FRONT OF ME. I'M GREATLY CONCERNED WITH THE VEHICLE'S CONDITION OF SAFETY. A STUCK THROTTLE IS A TERRIFYING AND SERIOUS SAFETY SITUATION. MY WIFE NOW REFUSES TO DRIVE THIS VEHICLE AND GM DENIES THE POSSIBILITY OF IT HAPPENING. \"I'M OFFENDED BY THEIR RESPONSE. THEY WANT ME TO RETURN TO DEALERSHIP FOR MORE TESTING. AT THIS POINT, I AM EXTREMELY HESITANT TO BE TOLD \"WE FIXED IT\". I HAVE LOST ALL CONFIDENCE IN THE SAFETY OF THE CAR. I WANT GM TO BUY IT BACK! IT IS UNSAFE AND I'M HESITANT TO EVEN DRIVE THE VEHICLE... I'M PAYING TO DRIVE AN UNSAFE VEHICLE. YOUR IMMEDIATE ATTENTION TO THIS MATTER IS GREATLY   APPRECIATED. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G1BG5SM7G7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/01/2017",
        "dateOfIncident": "04/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10981547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS INVOLVED IN A CAR ACCIDENT INVOLVING A 2016 CHEVY CRUZE. AIRBAGS WERE DEPLOYED AS THEY HIT ANOTHER CAR SITTING AT A RED LIGHT. THE VEHICLE MY SON WAS IN WAS TURNING LEFT CAUSING MOST OF THE IMPACT TO THE FRONT PASSENGER SIDE OF THE CAR. HE WAS IN THE PASSENGER SEAT AND WAS THE ONLY ONE INJURED. A LARGE, DEEP, CLEAN CUT ON HIS FOREHEAD WAS HIS BIGGEST INJURY. DOCTOR EXPLAINED THAT IT SEEMS A PIECE OF METAL OR HARD PLASTIC MADE THE CUT. IT WAS CLEAN AND DOWN TO HIS CRANIUM. WE HAVE BEEN UNABLE TO IDENTIFY THE OBJECT THAT CAUSED THIS INJURY AND WE'RE LEAD TO INQUIRE ABOUT COMPONENTS IN THE AIRBAG.",
        "vin": "1G1BE5SM6G7"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971082,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V057000 (SEATS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOTIFIED. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1G1BE5SM3G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "01/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957974,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY CAR IN TO HAVE RECALL WORK DONE (HIGH MOUNT STOP LAMP FASTENERS LEAK ) CHMSL. AND I HAVE HAD A WATER LEAK EVER SINCE. MY CAR HAS BEEN TO THE DEALERSHIP 3 TIMES IN THE PAST MONTH. EVERY TIME THEY TELL ME ITS SOMETHING DIFFERENT THAT THEY FIX, YET I STILL HAVE A WATER LEAK THAT COULD CAUSE A SHORT IN THE PRINTED CIRCUIT BOARD RESULTING IN AN UNATTENDED FIRE.",
        "vin": "1G1BE5SM8G7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10950295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROACHED A CURVE IN ROAD AT APPROXIMATELY 50MPH, TOOK FOOT OFF THE GAS AND ACCELERATOR DID NOT DISENGAGE AND CONTINUED AT FULL SPEED SO FAST COULD NOT NEGOTIATE THE CURVE AND WENT OFF THE CURVE AND CRASHED INTO RAVINE BELOW.  THIS OCCURED ONE DAY AFTER THE CAR HAD BEEN SERVICED BY A GM GARAGE ON 1/31/17 ABOUT  A COMPLAINT ABOUT THE GAS PEDAL.",
        "vin": "1G1PE5SB1G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948927,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKED IN AN OUTDOOR PARKING LOT. WHEN I GOT TO MY VEHICLE I COULD NOT ENTER MY IT EVEN THOUGH I HAD THE KEY FOB IN MY HAND (KEYLESS ENTRY). I USED THE CHEVROLET MYLINK APP TO GAIN ACCESS TO THE VEHICLE. THEN I COULD NOT START MY CAR USING THE START BUTTON. RECEIVED A MESSAGE ON DRIVER'S DISPLAY THAT THERE WAS AN ERROR WITH THE KEY FOB. I COULD NOT ACCESS THE ENTIRE MESSAGE, BECAUSE THE BUTTONS ON THE STEERING WHEEL WOULD NOT TOGGLE THROUGH AS IT SHOULD. SINCE I WAS 100 MILES FROM HOME I DECIDED TO PRESS THE ONSTAR BUTTON FOR ASSISTANCE. THE ONSTAR BUTTON WOULD NOT WORK EITHER -- PRESSED IT SEVERAL TIMES, BUT NOTHING WOULD HAPPEN. THEN I WAS LOCKED IN THE CAR AND COULDN'T GET OUT. I USED THE APP TO UNLOCK THE DOORS. I USED MY CELL PHONE TO CALL ONSTAR FOR ASSISTANCE. WAS TOLD TO PUT THE KEY FOB ON SOME TYPE OF TRAY TO \"RESET\" IT. THERE IS NOTHING LABELED IN THE CAR, NOR IS THERE IS ANYTHING IN THE OWNER'S MANUAL TO GUIDE ONE TO FIND THE TRAY. I WAS TRANSFERRED TO GM ROADSIDE ASSISTANCE FOR HELP. WAS TOLD TO PLACE THE KEY FOB IN A CUP HOLDER (NEAR THE FRONT OF THE CONSOLE AREA). I HAD ALREADY DONE THIS (OUT OF HABIT THIS IS WHERE I PLACE THE KEY WHEN I AM DRIVING). THIS RESET THE KEY FOB AND I WAS ABLE TO START THE CAR. IT WASN'T UNTIL THE KEY FOB WAS RESET AND I WAS ABLE TO RESTART THE VEHICLE THAT THE ONSTAR SERVICE WOULD WORK PROPERLY. THE CAR IS AT THE DEALERSHIP, AGAIN, SEE PREVIOUS NHTSA REPORT. THEY CAN FIND NO CODES TO INDICATE WHAT HAPPENED. THIS CAR IS A LEMON AND I WANT A NEW VEHICLE. IT HAS 5000 MILES ON IT. IT HAS SPENT 7 WEEKS OF THE 4 MONTHS I HAVE OWNED THE VEHICLE IN THE SHOP! HOW DO I GET THEM TO FIX THESE ISSUES SO I CAN RELY ON MY VEHICLE? IT IS UNSAFE AND I CAN'T DEPEND UPON IT TO GET ME WHERE I NEED TO GO!  *TR",
        "vin": "1G1BG5SM1G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST RECEIVED A RECALL LETTER OF SOME FORM FOR MY 2016 CHEVY CRUZ  STATING THAT A FIRE MAY START WHEN THE D.C./D.C. CONVERTER IS POWERED DUE TO A RESISTIVE SHORT OCCURRING DUE TO ELECTRICAL/ LIGHTING PROBLEMS I BELIEVE THE LETTER DESCRIBES IT BETTER THEN I CAN. THE PROBLEM I HAVE IT THE LETTER STATES THAT CHEVROLET WILL PAY FOR A TEMP FIX IF I TAKE IT TO MY DEALERSHIP BEFORE JAN.31ST BUT AFTER THAT ANY PROBLEMS DUE TO THIS MANUFACTURING ERRROR WILL COME OUT OF MY POCKET. I HAVE TWO CHILDREN AND MY WIFE WHO USE THE VEHICLE OBVIOUSLY THIS IS A SERIOUS RISK FOR MY FAMILY THAT NEEDS TO BE PERMANTLY FIXED BY CHEVROLET NOT TEMPORALLY PREVENTED",
        "vin": "1G1BC5SM4G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/14/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WITHOUT WARNING, THE VEHICLE HAD AN INTERNAL LEAK THAT SATURATED THE REAR OF THE VEHICLE, THE FLOORING, THE ELECTRONIC COMPONENTS, AND CAUSED VARIOUS SHORTS WITHIN THE VEHICLE. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE'S INNER COMPONENTS WERE DAMAGED DUE TO THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 250.",
        "vin": "1G1BC5SM9G7"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2016",
        "dateOfIncident": "10/24/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933978,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING AT ANY SPEED AND ATTEMPTING TO MAKE A TURN, THE STEERING COLUMN LOCKED. THE DEALER REPAIRED THE STEERING GEAR. THE FAILURE RECURRED AND ALL THE INSTRUMENT PANEL INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DIFFERENT DEALER WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000.",
        "vin": "1G1PE5SB8G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930344,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. THE CONTACT STATED THAT THE ELECTRICAL SYSTEM FAILED, THE VEHICLE DECELERATED WHILE DRIVING, AND THE INSTRUMENT PANEL LIGHTING DIMMED. DURING THE FAILURES, THE ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE FAILURE. THE DEALER RESEATED THE COMPUTER SYSTEM AND SERVICED THE FUEL INJECTOR, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2016",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING THE VEHICLE, THE \"START, STOP\" FEATURE WAS ACTIVATED WHEN THE CONTACT APPROACHED A RED LIGHT. WHEN THE ACCELERATOR PEDAL WAS APPLIED WHILE MAKING A RIGHT TURN, THE VEHICLE LOST POWER AND WAS ALMOST STRUCK BY ANOTHER VEHICLE FROM THE REAR. THE FAILURE RECURRED MULTIPLE TIMES. THE DEALER WAS NOTIFIED, BUT THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 1,400.",
        "vin": "1G1BG5SM7G7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "11/29/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928655,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED FIRST INSPECTION, LEAVING THE DEALER, THE CAR SMELLED OF POSSIBLY A BURNING OR SOMETHING UNKNOWN. I DID NOT ASSUME THIS WASN'T NORMAL AS THEY HAD TO CHECK SEVERAL THINGS FOR THE INSPECTION.  I HAD TO DRIVE VEHICLE WITH OPEN WINDOWS FOR A FEW  DAYS. BUT I THOUGHT THAT PERHAPS WHILE CHECKING THE OIL THEY MAY HAVE GOTTEN SOME ON THE ENGINE OR SOMETHING.  A FEW DAYS LATER, THE CAR WAS MAKING A CLANK SOUND WHEN DRIVE GEAR ENGAGED FROM FULL STOP. 11 DAYS LATER, STARTED THE CAR AND IT  HAD REVVED OVER 4000 RPM. STOPPED ITSELF WITHIN SEVERAL SECONDS. FOOT WAS STILL ON THE BRAKE. DROVE 5 MILES, STOPPED AND PARKED VEHICLE. RETURNING HOME, ON A HIGHWAY, MY CAR SUDDENLY WENT OVER 4000 RPM AGAIN WHILE NOT ACCELERATING EXCESSIVELY, FLAT AND STRAIGHT ROADWAY, OVERCAST DAY, MID AFTERNOON.  WAS DOING @54 MILES MPH. AT THE HIGH REV, THE CAR HAD STOPPED ITS MOMENTUM AND WAS SLOWING DOWN, BUT THE RPM DID NOT. THE CAR WENT THROUGH SEVERAL GEARS THEN ORIENTED ITSELF MANY SECONDS LATER. RECOVERY SPEED WAS 42 MPH.  IMMEDIATELY CALLED THE DEALER AND SCHEDULED A DROP OFF. HAS @10,000 MILES ON IT. MOSTLY HIGHWAY DRIVING, A FEW DAYS A WEEK. OTHERWISE IT IS PARKED. MY FEAR WAS FAILURE TO CONTINUE MOMENTUM RESULTING IN ANOTHER VEHICLE COLLIDING WITH MINE AND THE INABILITY TO TAKE ANY STEPS TO PREVENT THAT FROM OCCURRING DUE TO LOSS OF MOBILITY AND CONTROL OF ACCELERATION.  *TR",
        "vin": "1G1PE5SB0G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "10/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. LESS THAN A MONTH AFTER LEASING THE VEHICLE, THE CONTACT BEGAN HAVING ISSUES WITH THE REAR CAMERA. WHILE OPERATING THE VEHICLE, THE CENTER CONSOLE WOULD NOT ILLUMINATE, THE BUTTONS WOULD NOT WORK, AND THE REAR CAMERA WOULD NOT OPERATE WHEN THE VEHICLE WAS IN REVERSE. THE FAILURES OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER AND A RADIO ERROR THAT CONTROLLED THE CONSOLE AND THE SOFTWARE WAS UPDATED. THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE DIAGNOSIS WAS UNKNOWN. THE VEHICLE WAS TAKEN BACK A THIRD TIME BECAUSE GM RECOMMENDED REPLACING THE RADIO. THE RADIO WAS REPLACED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 2,100.",
        "vin": "1G1BG5SM1G7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/18/2016",
        "dateOfIncident": "11/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10926924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 CHEVROLET CRUZE. WHILE DRIVING 55 MPH AND ATTEMPTING TO MAKE A TURN, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE VEHICLE BEGAN TO FISHTAIL. THE VEHICLE STRUCK A GUARDRAIL AND COLLIDED WITH A TREE. THE CONTACT ALSO STATED THAT THE GROUND WAS DRY. THE CONTACT HAD TO BE TRANSPORTED BY AMBULANCE TO THE HOSPITAL AND HAD HIP SURGERY AND LACERATIONS TO THE BACK OF THE HEAD, WHICH REQUIRED MEDICAL ATTENTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS DESTROYED AND TOWED. A POLICE REPORT WAS FILED. THE APPROXIMATE FAILURE MILEAGE WAS 2,135.",
        "vin": "1G1BE5SM9G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "09/20/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917708,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ABOUT 35 ON A CITY STREET, EVERYTHING SEEMED LIKE JUST ANY OTHER DAY. BUT IT WAS FAR FROM IT. I STARTED TO SMELL A FUNNY PLASTIC/RUBBER LIKE SMELL COMING FROM THE FRONT OF MY CAR. SO IMMEDIATELY PULLED OVER TO CHECK WHAT WAS GOING ON. IT IS KEY TO NOTE THAT I ALSO CHECKED MY ENGINE TEMPERATURE, SPECULATING THAT MAYBE I FORGOT TO TOP OFF THE COOLANT OR SOMETHING, BUT THE TEMPERATURE WAS PERFECT. I STOPPED THE CAR, POPPED THE HOOD, AND SAW WHAT WAS TO MY SHOCK JUST INSANE... A 3 FOOT FLAME THAT WAS BURNING UP MY WHOLE ENGINE COMPARTMENT. I DID NOT EVEN TRY TO PUT THE FLAME OUT WITH ANY MEANS BECAUSE THE FLAME WAS LOCATED TOO CLOSE TO THE FUEL INJECTORS AND I WAS NOT CONFIDENT ENOUGH TO RISK IT AND TRY TO PUT OUT THE FLAME. I CALLED 911 AND IN SEVERAL MINUTES, TO MY LUCK, THEY WERE THERE AND PUT THE FLAME OUT BEFORE THE CAR BLEW UP. HOWEVER, THE WHOLE FRONT OF THE CAR AND SOME OF FRONT INTERIOR IS BASICALLY MELTED AND THE CAR IS NOT USEFUL FOR ANYTHING ANYMORE. THIS WAS A SPONTANEOUS FLAME THAT HAPPENED WHILE DRIVING NORMALLY AT ABOUT 35 MPH ON A 70 DEGREE DAY. WHAT HAPPENED? I DO NOT KNOW... BUT WHAT I DO KNOW IS THAT CARS ARE NOT SUPPOSED TO PUT THEIR DRIVERS AND PASSENGERS AT RISK OF DYING JUST BECAUSE A PERSON WANTS TO PEACEFULLY DRIVE DOWN TO POINT B FROM POINT A. PLEASE LOOK INTO THIS, WHOEVER WILL BE DOING SO. THIS KIND OF CAR MANUFACTURING IS UNACCEPTABLE!  *TR",
        "vin": "1G1PE5SBXG7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2016",
        "dateOfIncident": "09/20/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PROVED TO BE SPONTANEOUSLY COMBUSTIVE THUS THE CAR BURNED UP IN A FIRE DUE TO ELECTRICAL HARNESS CATCHING FIRE AS STATED FIRE FIRE DEPARTMENT FIRE INSPECTOR. NO SIGNS SHOWED ANY IMMINENT DANGER, THE DRIVER OF THE VEHICLE BARELY ESCAPED BEFORE CAR WENT UP IN FLAMES. THE VEHICLE WAS IN MOTION BEING DRIVEN ON A CITY STREET.",
        "vin": "1G1PE5SBXG7"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CRUZE THE STEERING LOCKED AS I WAS  MERGING INTO TRAFFIC WITH MY 16 YEAR DAUGHTER ALL ELECTRICAL SYSTEM WAS GOING OFF AND ON. AFTER A COUPLE OF MINUTES STEERING RELEASED AND RADIO SYSTEM CAME BACK ON AND WAS ABLE TO MAKE IT TO THE LOCAL DEALERSHIP.  WE PURCHASED THIS CRUZE FOR MY 16 YR DAUGHTER AS HER FIRST CAR BUT FIND IT VERY UNSAFE. THIS PROBLEM IS A SAFETY HAZARD  THIS PROBLEM NEEDS TO BE FIXED BEFORE SOMEBODY GETS SERIOUSLY INJURED OR KILLED. CHEVY NEEDS TO LOOK INTO THIS PROBLEM AND GET THIS FIXED. THIS HAPPENED 9/14/16 AND CAR IS STILL AT DEALERSHIP. SERVICE TECH CAN NOT FIGURE OUT WHAT IS WRONG WITH IT. HE WAS NOT EVEN ABLE TO DRIVE IT HIMSELF.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/10/2016",
        "dateOfIncident": "03/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10905160,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER OF 2015 I WAS SITTING AT A STOP SIGN AND SOMEBODY HIT ME HEAD ON AT APPROXIMATELY 45 TO 50 MPH CAUSING A SUBSTANTIAL AMOUNT OF DAMAGE TO THE FRONT END OF MY CAR COSTING NEARLY A TOTAL OF $9,000. THE AIR BAGS DIDNT DEPLOY RESULTING MINOR INJURIES. ON MARCH 06, 2016 MY VEHICLE WAS INVOLVED IN A HEAD ON COLLISION WITH A DEER AT APPROXIMATELY 65 MPH RESULTING IN $8,100 WORTH OF DAMAGE TO MY VEHICLE. THE AIR BAGS DID NOT DEPLOY AGAIN ONLY THIS TIME NO INJURIES WERE CAUSED. RIGHT AFTER THE ACCIDENT BEFORE THE CAR WAS TOWED FROM THE SCENE THERE WAS A AIRBAG LIGHT ON MY DASHBOARD THAT WAS STAYING ON FOR A COUPLE DAYS THEN WENT AWAY.  I CONTACTED GM PERSONALLY AND THEY TOLD ME THAT THERE IS NOTHING THAT THEY CAN DO FOR ME. BOTH THE DEALERSHIP WHERE I PURCHASED THE CAR AND MY INSURANCE COMPANY HAVE STATED THAT BASED ON ALL INFORMATION GIVEN, THEY BELIEVE THAT THE AIRBAGS SHOULD HAVE DEPLOYED AND THAT GIVEN THAT THEY DIDN'T THERE IS A FAULT IN PERFORMANCE.",
        "vin": "1G1PC5SH8G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "09/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904936,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RENTAL CAR FROM AVIS HAS AN OPEN RECALL AND THEY RENTED THE CAR IN ATLANTA, GA ON SEPTEMBER 9TH.",
        "vin": "1G1BG5SM5G7"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/16/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 CHEVROLET CRUZE. WHILE DRIVING APPROXIMATELY 35 MPH, THE CHECK POWER STEERING WARNING LIGHT ILLUMINATED. WHEN ATTEMPTING TO STOP THE VEHICLE, THE BRAKES WERE INOPERABLE. AFTER COASTING TO THE SIDE OF THE ROAD, BLACK SMOKE WAS PRESENT COMING FROM THE WINDOW VENTS. WHILE ATTEMPTING TO EXIT THE VEHICLE, THE DOORS WOULD NOT IMMEDIATELY UNLOCK. THE CONTACT WAS ABLE TO EXIT THE VEHICLE AND WITNESSED FLAMES UNDER THE HOOD OF THE VEHICLE. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FIRE. THE VEHICLE WAS DESTROYED. THE CAUSE OF THE FIRE WAS NOT DETERMINED. THERE WERE NO INJURIES. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 10,000.   UPDATED 10/18/16*LJ  THE CONSUMER STATED A POLICE REPORT WAS FILED. UPDATED 10/19/16.*JB",
        "vin": "1G1PC556667"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVY CRUZE LMTD LTZ, DRVG DOWN HWY MIDDLE OF NO WHERE 5 HOURS FROM HOME 1T 1AM DRVG 70 MPH, TMS SUDDENLY SHOWS RIGHT FRONT PASSENGER TIRE WITH A TIRE PRESSURE OF 12LBS, NEAREST GAS STATION 10 MILES DOWN HWY, AS DRIVE THERE TIRE PRESSURE SLOWLY CREEPS UP TO 25 LBS BUT GOES NO HIGHER. GET TO GAS STATION, TIRE IS NOT DEFLATED, PURCHASE MANUAL TIRE GAUGE SHOWS TIRE PRESSURE AT  32LBS, TMS STILL SHOWING 25LBS EVEN AFTER RESTARTING CAR SEVERAL TIMES.  GET BACK ON HWY AFTER DRVG FOR ANOTHER HOUR, TIRE PRESSURE GOES BACK TO 32LBS.",
        "vin": "1G1PG5SB0G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "06/26/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON WITH MY 2016 CHEVY CRUZE WITH LESS THAN 1300 MILES ONIT. DEALERSHIP CANT GET ME IN UNTIL LATE NEXT WEEK!!! WHY IS THIS ON ALREADY!!",
        "vin": "1G1BB5SM4G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873002,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED AND WAS COMPLETELY DEAD IN THE MIDDLE OF THE HIGHWAY, HAZARD LIGHTS DIDN'T WORK. ONSTAR DIDN'T WORK, I COULDN'T ROLL WINDOWS DOWN AND COULD NOT UNLOCK DOORS TO GET OUT OF VEHICLE. 10 MINS LATER VEHICLE RESTARTED LIKE NOTHING HAD HAPPENED. AFTER HAVING IT TOWED BACK TO DEALERSHIP SEEING AS CAR WAS LEASED ONLY 14 DAYS PRIOR, THEY STATED THIS WAS A KNOWN RECALL AND THAT BATTERY CABLE WASN'T PROPERLY SECURED. I WAS NEVER MADE AWARE OF THE RECALL EVEN THOUGH GM SAID THEY ISSUED IT ON 5/24/16 AND THIS HAPPENED ON 6/1/16. DEALERSHIP AND GM BOTH REFUSED RESPONSIBILITY STATING IT WAS A KNOWN RECALL WHEN I ASKED TO RETURN THE CAR THAT ALMOST KILLED ME AND OFFERED ABSOLUTELY NO ESCAPE ROUTE. BEWARE THERE IS NO WAY OUT OF THE 2016 CHEVY CRUZE WITHOUT BATTERY POWER; DOORS AUTO LOCK AND \"KNOB\" RECEDES INTO DOOR AND CANNOT BE MANUALLY OPENED IN ANY WAY.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870498,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. THE CONTACT STATED THAT WHEN DRIVING, THE VEHICLE STALLED WITHOUT WARNING. THE FAILURE HAD OCCURRED ON MULTIPLE OCCASIONS. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 80. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/11/2016",
        "dateOfIncident": "04/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2016 CHEVY CRUZE LIMITED FROM FAIRWAY CHEVROLET ON 4/2/16. AT THE TIME OF PURCHASE I WAS NOT AWARE THAT IT HAD A CENTER HIGH MOUNTED STOP LIGHT FLASHING DEVICE ON IT[THE DEALER CALLED IT A \"RED ALERT SYSTEM\". I STATED TO DEALERSHIP PERSONNEL THAT PER DOT LAWS THAT I BELIEVE SUCH A DEVICE IS NOT LEGAL. THEY STATED THAT IT WAS LEGAL .I REMOVED THE DEVICE MYSELF AS THEY WERE TO BUSY TO DO IT WITHOUT A LENGTHY DELAY.CAN YOU PLEASE LOOK INTO THIS ISSUE? THE DEALER SERVICE PERSONNEL STATED THAT THEY INSTALL THESE ON ALL THERE NEW VEHICLES AND IF ITS NOT LEGAL PER DOT LAWS THEN I HOPE YOU CAN AND WILL RECTIFY THIS ISSUE. MY NAME IS [XXX] PHONE #[XXX] AND MY EMAIL IS [XXX]. PLEASE LET ME KNOW WHAT YOU CAN DO ABOUT THIS ISSUE IF ANYTHING.        INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G1PE5SB4G7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2016",
        "dateOfIncident": "03/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840269,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE STICKS. ITS HAPPENED THREE TIMES NOW",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2016",
        "dateOfIncident": "02/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838142,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET CRUZE. WHILE DRIVING APPROXIMATELY 70 MPH, THE STEERING WHEEL BECAME EXTREMELY DIFFICULT TO MANUVER AND REQUIRED EXCESSIVE FORCE. THE FAILURE OCCURRED WHILE DRIVING ON A STRAIGHT ROAD FOR AN EXTENDED PERIOD OF TIME AND 55 MPH OR GREATER. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE VEHICLE WAS TEST DRIVEN; HOWEVER, THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE DEALER FAILED TO PERFORM DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,850.",
        "vin": "1G1PE5SB9G7"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/22/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DISTINCT \"CLUNKING\" NOISE COMING FROM THE REAR OF THE VEHICLE WHEN TRAVELING OVER A BUMP, THROUGH A DIP OR ON AN UNEVEN ROAD SURFACE.  THE CHEVROLET DEALER HAS CONFIRMED THAT THE PROBLEM IS IN THE REAR SUSPENSION, BUT THAT CHEVROLET DOES NOT HAVE A REPAIR FOR THE PROBLEM.  I HAVE DRIVEN FOUR OTHER 2016 CHEVROLET CRUSE VEHICLES WITH SIMILAR MILES AND THEY ALSO HAVE THE PROBLEM.  THE CHEVROLET DEALER STATES THAT THEY ALSO HAVE ENCOUNTERED THE PROBLEM IN NUMEROUS 2016 CHEVROLET CRUZE VEHICLES.  I AM BEING TOLD TO OPERATE THE VEHICLE WITH THIS KNOWN CONDITION AS CHEVROLET MAY OR MAY NOT DEVELOP A REPAIR FOR THE REAR SUSPENSION PROBLEM.",
        "vin": "1G1PE5SBXG7"
    }
]