[
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448862,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2016 volt bought from NYC and I am the first owner currently residing in TX.  My volt currently has mileage of 30,020 but this propulsion power will be reduce error has been shown since last 100 miles or so, my commune is usually under 5 miles a day so I rarely use gas however recently due to work I have to commune pretty far for a week and relied more on gas and this error popup during on of the commune. (It slowed my car down significantly while on highway and eventually stop with message on the console says engine offline)  With the following error codes found: P0031 P0054 P0030 P0135 P0403 P0405 P0443 P0458 P0489 P0597 P0598 P06DA P06DB P0AC4 P0030  This car barely has much gas mileages as it was primarily on electric, but this failure on highway comes suddenly.",
        "vin": "1G1RD6S59GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "11/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a “Shift to park” message on the driver information screen when attempting to shut off vehicle. I don’t know if the vehicle is still in gear and will move (forward or back) when I think it is in Park. I have not had it in for inspection/repair yet, as it is a recent occurrence that is becoming increasingly frequent. This started happening around 11/15/2021.",
        "vin": "1g1rd6s54gu"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2021",
        "dateOfIncident": "10/31/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle shift to park warning , does not go in reverse or forward , shifter moves but it does not detect is in park mode , therefore it doesn't reset battery status or able to drive in forward or reverse.",
        "vin": "1G1RA6S58GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "When parking vehicle a \"Shift To Park\" error appears on the dash and vehicle will not turn off for some time. This is an intermittent issue that seems to be getting more frequent as time goes on. Vehicle can be stolen if issue is unnoticed.",
        "vin": "1g1rc6s56gu"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433311,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Failure of car's keyless remote system. I got my fob and moved the car to where we charged it in the morning. In the afternoon after it was charged I had the same fob and got in to move it back by our front door and the screen gave the message \"No remote detected\". I assumed the fob battery was dead and changed it and it still would not recognize the fob. Then I got my wife's fob and it would not recognize that one either. So the keyless remote system in the car had failed in some way. I went online and saw there were plenty of cases of this happening to this model and other Chevy models that used a similar system. There is some issue with this system and it is very dangerous as someone could easily get stranded if they were alone in some remote place and not understanding how to even get in their car as there is no visible keyhole on the door to put the mechanical key.  To follow up just as I was going out to the car to read the mileage all of a sudden the fob worked again. Both now work. It has been about 20 hours where it wouldn't work. I tried it many many times over those 20 hours and neither fob would work but now they both do. So this as many have reported , is an intermittent problem but dangerous because at any time you could be locked out of your car and you have to know how to pry off part of the door handle and insert the mechanical key and then place the fob in the special place under the lid in the console to be able to drive. Certainly once it happens to you and you learn all that you can do it in a reasonable time frame but when it happens the first time you are really stuck.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430779,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2016 Chevy Volt has an issue where the is an intermittent shift to park message displayed while the vehicle in in park. This issue has been identified as a widespread issue and Chevrolet has published a Service Bulletin (NHTSA Technical Service Bulletin 19-NA-206). The most recent version is Version 6 that was published in December 2020. The dealership is refusing to perform repairs that are clearly under warranty. The service bulletin specifically says it is covered under the warranty.",
        "vin": "1G1RD6S55GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "07/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "When I shift the car into \"park\" it will not register as \"park\" and a message comes up on the dash \"shift to park.\"  I'm unable to turn the car off at this point because it's required to be in \"park\" mode to accomplish this.  Jiggling the shift handle will sometimes correct this but it appears to be getting worse over time.  I spoke to a service tech at GM and they said they are aware of the issue and that it is a problem with this model.  I was told the only fix was a costly replacement that may or may not solve the problem.  A web search indicates there are many Chevy Volt drivers experiencing this same issue.",
        "vin": "1G1RC6S57GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Any time that the vehicle is turned off, a warning message displays on the HUD saying \"Action Required: Shift to Park\". This occurs whenever the vehicle is turned off, despite the gearshift already being in Park.",
        "vin": "1G1RD6S59GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421846,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I’m experiencing the infamous “shift to park” error.   After entering a parking spot, I come to a stop, shift the car from Drive into Park gear, and attempt to turn the car off but it will not turn off because it thinks the car is still in Drive gear mode, and it says “shift to park”.  It happens intermittently and unpredictably from when I bought the car 2 years ago until now.   Sometimes I have to shift back into drive and then to park several times in a row before it finally shows that it’s in Park gear.",
        "vin": "1G1RD6S5XGU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/16/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle Shifter does not correctly register the vehicle is in park.    Does not allow the vehicle to be turned off.  This is a common issue experienced by Gen2 Volt owners and well known by GM Service Tech and GM has not yet issued a recall.  There is a potential safety issue if someone believes the vehicle is parked and exits the vehcile and the car is left running.  Potential Driver Confusion on the park status could lead to the vehicle continuing to run or being put back in gear.  GM needs to issue a recall for Gen2 Volts - 2016 and on.",
        "vin": "1G1RC6S58GU"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419631,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "1. AN ERROR APPEARS \"SHIFT TO PARK\" WHEN PARKING. THE CAR DOES NOT RECOGNIZE THAT IT IS SHIFTED TO PARK THUS IT CONTINUES TO RUN EVEN WHEN POSITIONED ON PARK. A RUNNING VEHICLE THAT CANNOT BE TURNED OFF AND CAN RUN ON GAS IS A CONSIDERABLE HAZARD. THIS IS AN EXTREMELY COMMON ISSUE WITH THE 2016 VOLT.",
        "vin": "1G1RC6s56gu"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "05/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415464,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "GET \"SHIFT TO PARK\" ERROR WHEN TRYING TO SHUT OFF IGNITION. SHIFT LEVER IS IN PARK BUT NOT RECOGNIZED BY CARS ELECTRONICS OR SWITCHES OR? THIS PREVENTS CAR FROM BEING SHUT OFF -THIS IS MORE THAN JUST AN IRRITANT. WHEN YOU ARE STOPPED SOMEWHERE AND CAN'T TURN OFF YOUR IGNITION, YOU ARE IN A REALLY SERIOUS PREDICAMENT! GM HAS HAD THIS PROBLEM ON MANY ELECTRONIC HYBRIDS SINCE 2016 MODELS AND WILL NOT OR CANNOT FIX! ONE GOOGLE OF CHEVY VOLT \"SHIFT TO PARK\" WILL SHOW HUNDREDS OF COMPLAINTS (MANY TO YOUR DEPT.) AND NO HELP IN FORCING GM TO RESOVE PROBLEM !",
        "vin": "1G1RD6S51GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414456,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PUT THE CAR IN PARK AND TRY TO TURN IT OFF, I FREQUENTLY GET AN ERROR ON THE GAUGE DISPLAY THAT SAYS \"ACTION REQUIRED, SHIFT TO PARK.\"  THIS IS VERY FRUSTRATING. WHEN THIS ERROR HAPPENS, I'M UNABLE TO POWER OFF THE CAR OR LOCK THE DOORS. I TURN THE CAR BACK ON, JIGGLE THE SHIFTER OR MOVE IT INTO DRIVE AND BACK TO PARK, AND THEN TRY TURNING THE CAR OFF AGAIN. SOMETIMES I HAVE TO GO THROUGH THIS PROCESS 5 OR MORE TIMES BEFORE THE CAR WILL POWER DOWN. THIS ERROR HAPPENS ABOUT HALF THE TIME THAT I USE MY CAR, WHICH MAKES IT A DAILY PROBLEM. I BOUGHT THE CAR USED IN OCT 2019, AND THE PREVIOUS OWNER ALSO HAD THE PROBLEM BUT I DON'T KNOW WHEN IT STARTED FOR HIM.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "GETTING THE \"ACTION NEEDED SHIFT TO PARK\" WARNING INTERMITTENTLY WHEN PARKED AND ATTEMPTING TO TURN OFF CAR TO EXIT. UNABLE TO SHUT DOWN VEHICLE WHEN OCCURS.",
        "vin": "1G1RD6S54GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE ISSUES A MESSAGE TO MOVE THE GEAR SHIFTER INTO PARK (SHIFT TO PARK) MESSAGE EVEN WHEN IT IS ALREADY IN PARK. THE VEHICLE WILL NOT ENGAGE NOR WILL IT ENABLE THE DRIVER TO TURN THE VEHICLE OFF WHICH RESULTS IN UNSAFE DRIVING CIRCUMSTANCES AND STRANDS THE DRIVE IN UNTENABLE SITUATIONS. THIS IS KNOWN IN SOCIAL MEDIA AS THE \"SHIFT-TO-PARK\" PROBLEM WITH VOLT AND OTHER GM VEHICLES WHILE GM IS HUSH-HUSH ABOUT THE ISSUE. THERE ABSOLUTELY NEEDS TO BE A RECALL ISSUED FOR ALL AFFECTED VEHICLES AS THIS IS CLEARLY A MANUFACTURER DESIGN ISSUE GIVEN ALL OF THE PROBLEMS DRIVERS ARE HAVING. IT STARTS AS AN INTERMITTENT PROBLEM AND CONTINUES TO GET WORSE OVER TIME WITH OUT ANY WARNING.",
        "vin": "1G1RC6S55GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388475,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AN ERROR APPEARS \"SHIFT TO PARK\" WHEN PARKING. THE CAR DOES NOT RECOGNIZE THAT IT IS SHIFTED TO PARK THUS IT CONTINUES TO RUN. A RUNNING VEHICLE THAT CANNOT BE TURNED OFF AND CAN RUN ON GAS IS A CONSIDERABLE HAZARD. THE GM FORUM FOR VOLTS CONTAINS MANY SUCH MESSAGES FOR 2016 VOLTS AND A PROBLEM WITH THE SAME SYSTEM ERROR LED TO A RECALL IN 2017 VOLTS. THE PROBLEM IS OCCURRING WITH INCREASING FREQUENCY IN THIS CAR, STARTING A FEW MONTHS AGO.",
        "vin": "1G1RC6S51GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "09/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE DRIVER ATTEMPTS TO POWER DOWN THE CAR, THE DRIVER RECEIVES AN ERROR THAT THE CAR MUST BE SHIFTED TO PARK BEFORE TURNING OFF EVEN THOUGH THE CAR IS IN PARK.  AS A RESULT THE CAR MAY NOT BE TURNED OFF.  REPEATED ATTEMPTS AND \"PLAYING\" WITH THE SHIFTER MAY OR MAY NOT RESOLVE THE PROBLEM.",
        "vin": "1G1RC6S5XGU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377178,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKING THE CAR THERE'S A CHANCE FOR THE ERROR \"SHIFT TO PARK\" TO OCCUR WHEN TRYING TO TURN OFF THE CAR,. THIS IS DUE TO A DEFECTIVE SWITCH THAT WEARS OUT WITHIN THE SHIFTER ASSEMBLY. THE ERROR STARTS TO BECOME MORE AND MORE COMMON AS TIME GO ON. IT IS TOO EASY TO ACCIDENTALLY LEAVE THE CAR \"ON\" WHEN SHIFTING THE CAR TO PARK AND STEPPING OUT OF THE CAR AND USING THE PUSH TO STOP. THE ONLY KNOWN WORKAROUND IS TO FLICK THE SHIFTER BUTTON UNTIL THE CAR REGISTERS THAT THE CAR IS NOW SHIFTED TO PARK. THIS IS A RECURRING AND WELL KNOWN ISSUE IN THE CHEVY VOLT COMMUNITY. IT'S PREDICTED THAT ALL 2016+ CHEVY VOLTS WILL EVENTUALLY DEVELOP THIS ISSUE DUE TO THE DEFECTIVE DESIGN OF THIS SWITCH. I HAVE ANOTHER VOLT IN THE FAMILY THAT'S ALREADY HAD THE SHIFTER REPLACED BECAUSE OF THIS SAME ISSUE.",
        "vin": "1G1RC6S52GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2020",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE CONDENSATION FROM WATER LEAK BELOW THE FRONT PASSENGER FLOOR. IT WAS WITHIN THE BUMPER TO BUMPER WARRANTY, BUT 3 SEPARATE CHEVY DEALERS DID NOT DIAGNOSE OR FIX PROBLEM UNTIL AFTER WARRANTY EXPIRED. ONE DEALER EVENTUALLY FOUND A BAD WELD RESULTING IN A WATER LEAK AND SEALED IT. UNFORTUNATELY, THE LEAK HAS RETURNED AND THERE IS A LOT OF WATER BELOW THE FLOOR AGAIN. THIS REQUIRES REMOVING THE SEATS, TRIM, CARPET, AND FINDING ANOTHER BAD WELD.",
        "vin": "1G1RD6S53GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363657,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 100K MILES RIGHT WHEN MY WARRANTY ENDS, I'M GETTING THE SHIFT TO PARK ERROR MESSAGE, CONSTANTLY HAVING TO POWER UP THE VEHICLE OFF AND ON IS ANNOYING. I I FEEL LIKE THE CAR IS BREAKING MORE. VERY UNSAFE.",
        "vin": "1G1RD6S56GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360707,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PUTTING THE SHIFT LEVER IN PARK, THEN POWERING THE VEHICLE OFF THE DASHBOARD WOULD ADVISE TO SHIFT THE VEHICLE IN PARK. COULD NOT LOCK VEHICLE, LIGHTS WOULD REMAIN ON. THIS COULD BE WORKED AROUND BY PRESSING THE SHIFTER KNOB A FEW TIMES TO CLEAR THE MESSAGE.      BROUGHT VEHICLE IN FOR REGULAR SERVICE, WAS ADVISED THERE WAS A SHORT IN THE WIRING HARNESS RELATED TO THE SHIFTER KNOB. HARNESS WAS REPLACED, ISSUE HAS NOT REPEATED.  IT HAS BEEN NOTED ONLINE THAT THIS IS A COMMON ISSUE WITH GENERATION 2 VOLTS, I WANTED TO ADD MY VEHICLE TO THE LIST OF THOSE AFFECTED.",
        "vin": "1G1RD6S56GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354952,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ELECTRIC CAR WOULD NOT TURN OFF AND I RECEIVED THE ERROR MESSAGE \"ACTION REQUIRED: SHIFT TO PARK\" ON THE DRIVER DISPLAY . I WOULD HAVE TO PLAY WITH THE GEAR SELECTOR MULTIPLE TIMES SOMETIMES IT WOULD TAKE 20 MINUTES JUST TO TURN THE VEHICLE OFF. VISITING OTHER FORUMS, THIS IS A COMMON ISSUE AS IT IS DANGEROUS TO BE STRANDED NOT BEING ABLE TO TURN OFF YOUR CAR.",
        "vin": "1G1RD6S5XGU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2020",
        "dateOfIncident": "01/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUTTING SHIFTER TO PARK, THE ACTION REQUIRED MESSAGES IS SHOWN AS: 'SHIFT TO PARK' ISSUE. THE CAR WILL EFFECTIVELY NOT TURN OFF.   YOU'LL BE UNABLE TO LOCK THE CAR AND THE LIGHTS WILL STAY ON FOR A FEW MINUTES.   WORSE YET, IT IS INTERMITTENT ALTHOUGH IT GENERALLY GETS WORSE OVER TIME.",
        "vin": "1G1RD6S51GU"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348826,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO TURN OFF THE CAR IT SAYS \"ACTION REQUIRED: SHIFT TO PARK\" AND WILL PROCEED AS BEING LEFT ON, DESPITE BEING IN PARK. THIS OCCURS ABOUT 70% OF THE TIME THE CAR IS DRIVEN AND TAKES SEVERAL TRIES OF TURNING ON THE CAR, MOVING, PARKING, AND TURNING BACK OFF BEFORE THE ENGINE SHUTS OFF WITHOUT THIS WARNING.",
        "vin": "1G1RD6S50GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342642,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DOES NOT RECOGNIZE IT HAS BEEN SHIFTED INTO PARK, WHICH DOES NOT ALLOW THE VEHICLE TO BE TURNED OFF. DASH DISPLAY STATES 'ACTION REQUIRED, SHIFT TO PARK'. THIS HAPPENS CONSISTENTLY AND IS A KNOWN ISSUE BY CHEVROLET. YET THEY HAVE NOT ISSUED ANY RECALL. IT IS KNOWN AS THE 'SHIFT TO PARK' ISSUE. THERE IS NO WORK-AROUND FOR THE ISSUE OTHER THAN SHIFTING BACK AND FORTH INTO GEARS, SOMETIMES HUNDREDS OF TIMES, BEFORE THE ERROR CLEARS.  FOR EXAMPLE: MY WIFE TOOK MY DAUGHTER TO AN EMERGENCY ROOM AND COULD NOT GET THE VEHICLE TO TURN OFF. SHE TRIED TO CLEAR THE ERROR A FEW TIMES BEFORE HAVING TO LEAVE THE VEHICLE RUNNING IN THE PARKING LOT.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341731,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEEP GETTING ACTION REQUIRED MESSAGE \"SHIFT TO PARK\" EVEN THOUGH THE CAR HAS BEEN POWERED OFF. IT TAKES ABOUT 5 TRYS NOW TO ACTUALLY POWER OFF THE CAR, HAVE TO REPEATEDLY TURN THE CAR ON AND OFF TO ACTUALLY POWER OFF THE VEHICLE.",
        "vin": "1G1RC6S51GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVY VOLT 2016, SHIFTED INTO PARK, BUT CAR WARNING COMES UP \"SHIFT TO PARK\" AND THUS CAR WILL NOT TURN OFF.",
        "vin": "1G1RC6S52GU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "07/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338889,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 CHEVROLET VOLT IS EXHIBITING THE \"SHIFT TO PARK\" ISSUE. MORE OFTEN THAN NOT, WHEN I SHIFT TO PARK AND ATTEMPT TO SHUT MY CAR OFF, IT ALERTS ME THAT I NEED TO SHIFT IN ORDER TO PARK. I HAVE TO TURN THE CAR BACK ON, THEN TURN IT OFF AGAIN, SOMETIMES I MOVE THE SHIFTER OR FLICK THE SHIFTER BUTTON TO FIX IT.",
        "vin": "1G1RC6S59GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PRESS THE POWER BUTTON TO TURN OFF THE CAR, IT WON'T SHUT OFF. A MESSAGE ON THE DASH SAYS I MUST \"SHIFT TO PARK\". OF COURSE, I'VE ALREADY SHIFTED INTO PARK. IF I PUT THE SHIFTER BACK INTO THE \"L\" POSITION SEVERAL TIMES, EVENTUALLY IT WILL SHUT OFF. THIS PROBLEM IS GETTING WORSE BY THE DAY. NOW I NEED TO REPEAT THIS PROCESS OF SHIFTING BACK AND FORTH MANY MANY TIMES TO GET IT TO SHUT OFF. THIS IS THE 2ND TIME IT HAPPENS TO THIS CAR. GM REPLACED THE SHIFT ASSEMBLY ONE YEAR AFTER I PURCHASED THE CAR TO FIX THIS EXACT SAME PROBLEM. THE CAR WAS PARKED WHEN THIS HAPPENED.",
        "vin": "1G1RD6S56GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/11/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING OFF VEHICLE:  VEHICLE IS SHIFTED TO PARK  IGNITION BUTTON IS PRESSED  MESSAGE APPEARS ON CONSOLE 'ACTION REQUIRED: SHIFT TO PARK'  VEHICLE WILL NOT TURN OFF WITH PRNDL IN PARK POSITION",
        "vin": "1G1RD6S57GU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/06/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327496,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SYSTEM DOES NOT RECOGNIZE WHEN GEAR IS IN PARK (P) - THE PROMPT ON THE SCREEN STATES \"ACTION REQUIRED:  SHIFT TO PARK\" (SEE ATTACHED SCREENSHOT) EVEN WHEN THE GEAR IS ALREADY ON PARK (P) - THE WORK-AROUND IS SHIFTING THE GEAR FROM PARK (P) THEN L THEN BACK TO PARK - SOMETIMES YOU HAVE TO DO THIS SEVERAL TIMES.  *TR",
        "vin": "1G1RC6S52GU"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO TURN OFF CAR WHEN SHIFTER IS PHYSICALLY SHIFT TO PARK, BUT DASH WARNING HAS A \"SHIFT TO PARK\" WARNING.  BACK IN DEC 26 I BOUGHT THE CAR IN FOR THE SAME ISSUE AND THE SHIFTER CABLE WAS REPLACED.  BUT SHIFT TO PARK WARNING RETURNED A FEW MONTHS LATER.  IT IS A MATTER OF TIME BEFORE THIS ISSUE WILL RETURN .  *TR",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/01/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFT TO PARK ISSUE. WHEN TRYING TO TURN OFF THE CAR YOU PUT IN PARK AND PRESS ON/OFF BUTTON. CAR SAYS YOU NEED TO SHIFT INTO PARK EVEN THOUGH YOU HAVE SHIFTED INTO PARK AND IS SO INDICATED ON THE DASH. YOU HAVE TO SHIFT THE SHIFTER AND TURN ON AND OFF UNTIL FINALLY TURNS OFF. CRAZY AND A KNOW PROBLEM. DANGEROUS AND NEED A RECALL.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "04/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322441,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SAYS \"SHIFT TO PARK\" AT RANDOM, WHEN CAR IS ALREADY IN PARK. PREVENTS YOU FROM POWERING OFF THE VEHICLE, AND HAVE TO SOMETIMES WIGGLE THE SHIFTER BEFORE IT WILL DETECT IT IS ACTUALLY IN PARK.",
        "vin": "1G1RC6S58GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VARIOUS TIMES WHEN PUTTING THE CAR INTO PARK AND THEN TURNING OFF THE CAR THE MESSAGE STATING ACTION REQUIRED: SHIFT TO PARK WILL SHOW ON THE CONSOLE SCREEN. THE CAR WILL NOT TURN OFF UNTIL THE CAR RECOGNIZES THE GEAR IS IN THE PARK POSITION, WHICH IT ALREADY IS. IT TAKES SOME SHAKING OF THE SHIFT BUTTON TO GET THE CAR TO REGISTER THAT THE GEAR IS IN THE PARK POSITION. IT USED TO HAPPEN MAYBE ONCE A MONTH BUT NOW IT SEEMS TO HAPPEN A FEW TIMES EACH WEEK.",
        "vin": "1G1RD6S5XGU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PUTTING MY CAR INTO PARK AND ATTEMPTING TO TURN IT OFF, THE MESSAGE \"SHIFT TO PARK\" IS DISPLAYED ON THE DRIVER INFORMATION CENTER. THE CAR THINKS IT IS NOT IN PARK UNLESS I EITHER PRESS THE BUTTON ON THE SHIFT STICK A COUPLE TIMES OR TURN THE CAR COMPLETELY OFF AND BACK ON.",
        "vin": "1G1RD6S59GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315827,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKING THE VEHICLE, THE VEHICLE DOES NOT RECOGNIZE THAT THE SHIFTER IS IN \"PARK\" AND WON'T POWER OFF, EVEN THOUGH THE SHIFTER IS IN PARK.  A MESSAGE APPEARS ON THE SCREEN TO SHIFT VEHICLE INTO PARK.  THE VEHICLE IS STATIONARY AND SHIFTED INTO PARK, BUT THE VEHICLE JUST DOESN'T RECOGNIZE THIS.  THIS HAPPENS ON A DAILY BASIS, AND I NEED TO WIGGLE THE SHIFT LEVER, AND/OR PUSH THE ON/OFF BUTTON SEVERAL TIMES UNTIL IT FINALLY REALIZES THAT IT IS IN PARK AND SHUTS OFF.",
        "vin": "1G1RC6S57GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312291,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 GEN 2 CHEVY VOLT EXPERIENCING ERROR MESSAGE OF 'SHIFT TO PARK' EVEN THOUGH CAR IS IN PARK. CAR WILL NOT TURN OFF UNTIL MESSAGE CLEARED AND THAT TAKES SEVERAL ATTEMPTS. ISSUE IS WIDESPREAD BASED ON INTERNET SEARCH.    ALSO, TRANSMISSION COOLING FLUID LEAK FROM TRANSMISSION COOLANT INTAKE LINE REQUIRING COMPLETE REPLACEMENT.",
        "vin": "1G1RC6S50GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302596,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN UPDATE TO MY ORIGINAL COMPLAINT #:11299056 FOR UN-COMMANDED ACCELERATION ON 1/13/2020. THE CHEVY DEALERSHIP WORKED WITH GM CORPORATE ENGINEERS AND WERE UNABLE TO DUPLICATE THE PROBLEM AFTER SEVERAL DAYS. THE RETURNED THE CAR AND BLAMED IT ON THE FLOOR MAT. THIS IS NOT LIKELY SINCE THE MAT IS A OEM HEAVY RUBBER MAT AND THE ACCELERATOR PEDAL DOES NOT REST ON THE FLOOR BOARD. SINCE THE CAR WAS RETURNED AND DRIVING FOR WEEKS, I NOTICED THE BATTERY RANGE WILL NOT CHARGE MORE THAN 49 MILES OF ELECTRICAL CHARGE WHEN IT OFTEN CHARGED UP INTO THE 50-60 MILE RANGE PRIOR TO THE INCIDENT. I'VE BEEN DRIVING THE CAR IN SLOWER HEAVY TRAFFIC LATELY AND THIS DRIVING STYLE OFTEN INCREASES ELECTRIC MILEAGE RANGE AFTER A FULL NIGHTS CHARGE. IT WILL NOT DO SO ANYMORE EVEN THOUGH THE ECONOMY MANAGEMENT SCREEN INDICATE MAXIMUM RANGE ECONOMY OF OVER 250 MPG. I'M A RETIRED GAS TURBINE MECHANIC AND I KNOW A PROBLEM WHEN I EXPERIENCE ONE. I SUSPECT THAT A BATTERY CELL MAY HAVE HAD AN UNCONTROLLED DISCHARGE AND IS NO LONGER ABLE TO ACCEPT A RECHARGE. I HAVE RELAYED THIS INFORMATION TO THE DEALER. NO RESPONSE YET.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST TWO WEEKS, A \"SHIFT TO PARK\" MESSAGE HAS BEEN OCCURRING INCREASINGLY UPON VEHICLE POWER OFF.  VEHICLE HAS 29716 MILES.  TYPICALLY OCCURS UPON PARKING THE VEHICLE AND SHIFTING INTO PARK WHEN THE VEHICLE IS AT A FULL STOP.  UPON DEPRESSING THE POWER BUTTON TO POWER OFF THE VEHICLE, A SHIFT TO PARK\" MESSAGE APPEARS ON THE INSTRUMENT CLUSTER.  (WHICH IS ODD SINCE THE VEHICLE SHIFT IS ALREADY IN PARK.) THE VEHICLE WILL NOT POWER DOWN AS LONG AS THE \"SHIFT TO PARK\" MESSAGE REMAINS ON THE INSTRUMENT CLUSTER.  ATTEMPTS TO CLEAR THE MESSAGE FROM THE INSTRUMENT CLUSTER DO NOT SEEM TO BE DETECTED.  (TRIED WIGGLING SHIFT; DEPRESSING THE SHIFT TRIGGER; SHIFTING TO DRIVE AND BACK INTO PARK SEVERAL TIMES; OPEN AND CLOSED DOOR SEVERAL TIMES; DEPRESSED POWER BUTTON ON AND OFF SEVERAL TIMES WITH NO APPARENT EFFECT.  VEHICLE EVENTUALLY CLEARS THE SHIFT TO PARK MESSAGE AND ALLOWS THE DRIVER TO POWER OFF WITH NO APPARENT CONNECTION TO A CLEAR CUT METHOD TO MANUALLY CLEAR THE MESSAGE.  (THERE IS NO TYPICAL TIME THAT CAN BE RELIED UPON FOR THE EVENTUAL CLEARING OF THE MESSAGE FROM THE INSTRUMENT CLUSTER TO RETURN TO NORMAL POWER OFF FUNCTIONALITY.)  VEHICLE WAS TAKEN TO DEALERSHIP.  DEALERSHIP REPORTED THAT THE PROBLEM WAS IN THE SHIFT MECHANISM.  DEALERSHIP REPLACED THE ENTIRE SHIFTER ASSEMBLY AND JUMPER HARNESS, N-HARNESS AND N-CONTROL.  BILL FOR REPAIR WAS  $572.26  .   DEALERSHIP DID NOT COVER THE REPAIR UNDER WARRANTEE.  DEALERSHIP ALSO COMMUNICATED THAT REPAIR HAD NO EXISTING RECALL NOTIFICATION AND COULD NOT BE COMPENSATED BY MANUFACTURER RECALL.",
        "vin": "1G1RA6S54HU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO TURN THE CAR OFF A \"SHIFT TO PARK\" LIGHT COMES ON AND THE CAR WILL NOT TURN OFF. WHEN LOOKING FOR AN EXPLANATION I FOUND THAT THIS A COMMON PROBLEM WITH THE 2ND GEN VOLT. WHEN I TOOK THIS CAR TO THE DEALER THEY WERE WELL AWARE OF THIS PROBLEM. THIS IS A COMMON PROBLEM THAT IS A DESIGN FLAW AND THE SECOND GEN VOLT SHOULD BE RECALLED BY THE MANUFACTURER.",
        "vin": "1G1RD6S57GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WON'T SHUT DOWN AND STATES SHIFT TO PARK ON SCREEN WHILE CAR IS IN PARK. SHIFT ASSEMBLY IS BAD.",
        "vin": "1G1RD6S58GU"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11299570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 CHEVROLET VOLT. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE MESSAGE SERVICE STABILITRAK SUDDENLY DISPLAYED. THE BRAKE PEDAL WAS STILL AND THE STEERING WHEEL FAILED TO RESPOND WHEN TURNED AS A RESULT CONTROL OF THE VEHICLE WAS LOST AND THE CONTACT CRASHED INTO A BLUFF. THE VEHICLE WAS DESTROYED. THE DRIVER SUSTAINED A SORE BODY DUE TO THE IMPACT AND MEDICAL ATTENTION WAS NOT SOUGHT. NO POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED AWAY. THE LOCAL DEALER (UNKNOWN) WAS CALLED AND INFORMED THAT THE VEHICLE WAS DESTROYED BUT THE FAILURE EXPERIENCED WAS NOT DISCUSSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE FAILURE MILEAGE WAS 177,000.",
        "vin": "1G1RC6S55GU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299056,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UN-COMMANDED VEHICLE ACCELERATION UNDER FULL ELECTRIC DRIVE MODE (TWICE). WHILE DRIVING STEADY AROUND 65 MPH ON THE FREEWAY (NO CRUISE CONTROL USED), A SLIGHT STEP ON THE ACCELERATOR, CAUSED THE CAR IMMEDIATELY ACCELERATED UP TO 88 MPH (DASH SHOW LARGE ELECTRICAL DRAW OF BATTERY POWER). STEPPING ON THE BRAKE, USING THE REGEN PADDLE ON THE STEERING WHEEL AND REPEATED PRESSING THE CRUISE CONTROL POWER DIDN'T DISENGAGE THE POWER SURGE. CAR WOULD ACCELERATE WHEN BRAKE PRESSURE WAS LIFTED. AFTER REPEATED HARD PRESSING OF THE BRAKE PEDAL, THERE WAS A \"CLACK\" SOUND FROM BELOW THE DRIVER CONSOLE AND THE CAR RETURNED TO NORMAL. BEING ON THE FREEWAY, I WAS NOT ABLE TO PULL OVER AND RESTART/REBOOT THE CAR. I CONTINUED TO DRIVE CAUTIOUSLY, MONITORING THE CAR AND LEFT THE FREEWAY FOR SURFACE STREETS. EVERYTHING SEEMED TO BE OKAY UNTIL I CAME TO A COMPLETE STOP BEHIND TRAFFIC. WHEN TRAFFIC STARTED MOVING AGAIN, I LIGHTLY DEPRESSED THE ACCELERATOR PEDAL AND THE CAR BEGAN ACCELERATING QUICKLY ON IT'S OWN. SEVERAL HARD PRESSES OF THE BRAKE PEDAL AND THE CAR RETURNED TO NORMAL. THIS SECOND INCIDENT WAS NOT AS VIOLENT AND THE FIRST AND THERE WAS NO \"CLACK\" SOUND FROM BELOW THE DRIVER DASH AS WITH THE FIRST. THIS IS WORRISOME AND CANNOT BE RELATED TO THE CRUISE CONTROL SINCE IS WAS AT A STOP AND CC ISN'T SUPPOSED TO ENGAGE UNDER 25 MPH. THE REST OF THE SEVERAL MILES TO MY WORK WAS UNEVENTFUL. I'VE CONTACTED THE DEALER ABOUT THE SAFETY OF DRIVING IT OR HAVING IT TOWED. WAITING FOR THEIR RESPONSE. I IMAGINE THE ON-BOARD COMPUTER WOULD'VE STORED TODAY'S DRIVING DATA.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297134,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHOWS A MESSAGE ON THE INSTRUMENT CLUSTER THAT SAYS SHIFT TO PARK EVEN THOUGH THE GEAR SHIFT LEVER IS ALREADY IN PARK.  THIS FAILURE TO DETECT WHEN THE GEAR SHIFT LEVER IS MOVED TO PARK PREVENTS THE CAR FROM SHUTTING OFF AND LOCKING.  SOMETIMES CONTINUOUSLY WIGGLING THE GEAR SHIFT AND REPEATEDLY SHIFTING TO OTHER GEAR POSITIONS AND BACK TO PARK CAN SOMETIMES GET THE VEHICLE TO RECOGNIZE IT IS IN PARK. THIS SITUATION OCCURS INTERMITTENTLY WITHOUT A PATTERN.  VERY FRUSTRATING.  AND DANGEROUS.",
        "vin": "1G1RD6S51GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VOLT CENTER DISPLAY HAS GONE BLANK, PROBABLY A BAD SCREEN.  THE DISPLAY SERVES MULTIPLE PURPOSE: INFOTAINMENT, NAVIGATION, CHARGING CONTROL (BEING AN ELECTRIC VEHICLE), AND MOST IMPORTANTLY THE BACK UP CAMERA DISPLAY.  THE REAR HATCHBACK VISIBILITY IS VERY POORLY DESIGNED, WITH GREAT DEPENDENT & RELIANCE ON DRIVER TO USE THE BACK CAMERA.  WITHOUT THE DISPLAY, BACKING DRIVER CAN NOT SEE A SMALL CHILD NOR ANY OBJECT.",
        "vin": "1G1RC6S54GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKING THE CAR AFTER HAVING STOPPED, ANT ERROR MESSAGE 'SHIFT TO PARK' APPEARS ON THE DISPLAY EVEN THOUGH THE SHIFTER WAS IN PARK. THIS PROBLEM PREVENTS CAR FROM BEING TURNED OFF.",
        "vin": "1G1RC6S5XGU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289511,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO TURN OFF POWER TO CAR WITH ERROR ON DASHBOARD SAYING SHIFT TO PARK.  HAVE TO POWER ON AND OFF SEVERAL TIMES WHILE MOVING THE SHIFTER IN AND OUT OF PARK TO GET THE CAR TO TURN OFF.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2019",
        "dateOfIncident": "10/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A SHIFT TO PARK MESSAGE THAT BEEN SEEN ON MANY GM VEHICLES. SOME OF THE OWNER SITES I HAVE BEEN TO SAY THAT THIS IS COVERED UNDER WARRANTY. I HAVE NOT BEEN SO LUCKY WITH GM. THE DEALER DID COVER 1 REPAIR OF THIS PROBLEM BUT NOW SAYS I HAVE TO PAY. THE PROBLEM HAS RETURNED AND PERSISTS. A SHIFT TO PARK MESSAGE IS DISPLAYED ON THE DASH AFTER THE CAR IS IN PARK AND WILL NOT SHUTDOWN. I HAVE ATTACHED ALL THE DOCUMENTATION THAT I HAVE.",
        "vin": "1G1RC6S52GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING ABOUT AIRBAG SYSTEM NOT WORKING CORRECTLY AND TOLD TO BRING CAR TO DEALER WITHIN 1 DAY. CAR WAS IN MOTION ON CITY STREET WITH MY SON IN FRONT. I DON'T KNOW EXACT PARTS BUT I BROUGHT IT TO CHEVY AND THEY REFUSED TO PAY FOR FIX (SO THE CAR IS STILL THERE WHILE I APPEAL). IT WAS SOMETHING ABOUT THE SYSTEM IN THE SEAT AND POSSIBLY DASH THAT CONTROLS THE AIRBAG.",
        "vin": "1G1RC6S58GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269348,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SENSOR DOES NOT RECOGNIZE WHEN CAR IS IN PARK. CONTINUES TO RUN AND WILL NOT TURN OFF WHEN IN PARK. ERROR MESSAGE DISPLAYED IS \"SHIFT TO PARK\" EVEN WHEN IN PARK. THIS IS A SAFETY ISSUE BECAUSE CAR WILL NOT DISENGAGE OR TURN OFF. THIS OCCURS FREQUENTLY.",
        "vin": "1G1RD6S52GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET VOLT. THE CONTACT STATED THAT THE BACK-UP CAMERA WAS MALFUNCTIONING AND THE FRONT CONSOLE WOULD NOT WORK IF OTHER SERVICES WERE BEING USED. THE CONTACT HAD TO TURN OFF AND RESTART THE VEHICLE TO GET THE CONSOLE TO WORK AGAIN. THE VEHICLE WAS TAKEN TO RELIABLE CHEVROLET (800 N CENTRAL EXPY, RICHARDSON, TX 75080, (972) 201-9240) WHERE THEY RE-FLASHED THE MODULE AND CHANGED THE CAMERA; HOWEVER, THE FAILURE RECURRED AND THE VEHICLE WOULD SHUT OFF WHEN PARKED. THE VEHICLE WAS A HYBRID AND THE BATTERY WAS DEPLETED. THE CONTACT WAS CONCERNED ABOUT THE CARBON MONOXIDE LEVEL IN HER GARAGE. THE VEHICLE WAS GETTING MORE AND MORE DIFFICULT TO SHUT OFF AND THE CONTACT HAD TO WAIT SEVERAL MINUTES TO MAKE SURE IT FINALLY SHUT OFF. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THEY STATED THAT THEY WOULD CONTACT THE MANUFACTURER AND CALL BACK. THE FAILURE MILEAGE WAS 5,000. *TT  *JB *TT  THE CONSUMER STATED UNRESPONSIVE DISPLAY GOES BLANK WHEN STARTING THE VEHICLE. THE CONSUMER FURTHER STATES WHEN A VEHICLE IS TURNED OFF HAVING ERRORS NOT RECOGNIZING THE VEHICLE IS IN PARK. *TR",
        "vin": "1G1RD6S59GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "06/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFT TO PARK DISPLAYS AFTER YOU'VE SET THE CAR TO PARK.",
        "vin": "1G1RD6S59GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "04/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BECAME DISABLED WHILE DRIVING, DISPLAYING A \"POWER REDUCED\" MESSAGE. THE VEHICLE WAS IN MOTION ON A BUSY STREET, AND I HAD TO TRY TO PULL OVER WITH TRAFFIC MOVING AT A FAST PACE. THIS HAPPENED TO ME TWICE. DEALERSHIP WAS UNABLE TO REPLICATE THE PROBLEM AND DID NOT DO ANYTHING TO FIX.",
        "vin": "1G1RD6S58GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "06/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE AIR CONDITION STOPPED WORKING WHILE DRIVING, CHECK ENGINE LIGHT CAME ON. MESSAGE FROM ONSTAR READS: AN ISSUE WITH THE LITHIUM-ION BATTERY IN YOUR 2016 CHEVROLET VOLT HAS BEEN DETECTED. PLEASE SERVICE YOUR VEHICLE WITHIN 1 DAY.",
        "vin": "1G1RD6S58GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL VEHICLE SYSTEMS ARE NOT REGISTERING THAT THE VEHICLE IS IN PARK WHEN THE SHIFTER IS IN THE PARK POSITION.  THE INSTRUMENT CLUSTER GEAR INDICATOR REGISTERS THE VEHICLE AS IN PARK, BUT WHEN ATTEMPTING TO POWER DOWN THE VEHICLE AN ERROR MESSAGE OCCURS DIRECTING THE DRIVER TO SHIFT THE VEHICLE INTO PARK.  WHEN EXITING THE VEHICLE THE DOORS WILL NOT LOCK.",
        "vin": "1G1RC6S58GU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/10/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE STABILITRAK LIGHT CAME ON ALONG WITH ABS AND TRACTION CONTROL AND CHECK ENGINE   SERVICE CENTER FOUND METAL DEBRIS ON TONE RING. UNKNOWN ORIGIN",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/31/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY WHEN I SMELLED SMOKE, THEN SAW SMOKE, AND THEN SAW FLAMES ON THE REAR PASSENGER FLOOR.  I PULLED TO THE SIDE OF THE FREEWAY AND PULLED MY CHILDREN FROM THE VEHICLE.  WITHIN 2-3 MINUTES, THE CAR WAS ENGULFED IN FLAMES.",
        "vin": "1G1RC6S53GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142158,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS SHIFTED INTO PARK POSITION AND ENGINE IN POWERED OFF, THE DASH READS OUT THAT VEHICLE MUST BE IN PARK POSITION. I HAVE TO JIGGLE THE SHIFTER OR DEPRESS THE BUTTON SEVERAL TIMES TO ENGAGE INTO PARK POSITION. IF THIS IS IGNORED THE VEHICLE DOES NOT REGISTER IN PARK AND CANNOT SAFELY BE LEFT UNATTENDED. THIS OCCURRENCE HAS BEEN HAPPENING FOR OVER A MONTH AT A DAILY RATE. THE DEALERSHIP DOES NOT HONOR THE POWER TRAIN WARRANTY FOR THIS ISSUE.",
        "vin": "1G1RC6S55GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET VOLT. WHILE DRIVING 55 MPH, THE VEHICLE LOST POWER WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER (F H DAILEY CHEVROLET, 900 MARINA BLVD, SAN LEANDRO, CA 94577), BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 13,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT PROBLEM WHERE THE CENTER DISPLAY CONSOLE GOES BLANK ON STARTING THE CAR AND IS COMPLETELY UNRESPONSIVE.  THIS DISPLAYS VITAL INFORMATION SUCH AS LOCATION, CHARGE CAPACITY, CLIMATE CONTROLS, ETC.  COULD NOT FIND A WAY TO RESET THIS.  IT CORRECTS ITSELF AFTER THE CAR IS OFF FOR A BIT.  THIS IS THE SECOND TIME THIS HAS HAPPENED IN TWO DAYS.  THIS IS FOR CASE ID NUMBER 10872363.",
        "vin": "1G1RD6S59GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "01/31/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958862,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS STATIONARY IN A LEFT TURN LANE AT AN INTERSECTION.  I TOOK MY FOOT OFF THE GAS AND PRESSED THE GAS PEDAL TO ACCELERATE THE CAR THROUGH THE INTERSECTION.  WHEN  I PRESSED THE GAS, THE CAR DID NOT ACCELERATE.  I REPEATEDLY TRIED TO ACCELERATE AND THE CAR SEEMED TO NOT EVEN IDLE BECAUSE IT WOULD ROLL BACKWARDS WHEN THE BRAKE WAS RELEASED.  AFTER A WHILE THERE WAS SOME WEIRD NOISES AND THE CAR DID SOME UNUSUAL SHAKING.  I ALSO OBSERVED ON MY DASHBOARD THAT THE CAR WAS SWITCHING BETWEEN THE ELECTRIC BATTERY POWER AND THE GAS FUEL POWER.  I WAS NOT CLICKING ANYTHING TO DO THIS IT WAS DOING IT WHILE I HAD MY FOOT ON THE BRAKE AND WAS TOUCHING NOTHING ELSE.  AFTER ABOUT AN HOUR AND MANY TRIES THE GAS FINALLY ENGAGED AND I WAS ABLE TO PULL THE VEHICLE INTO A NEARBY PARKING LOT BUT THERE WERE STILL VARIOUS NOISE PROBLEMS AND SHAKING.  HAD THE VEHICLE TOWED TO THE DEALERSHIP TO HAVE IT SERVICED.  THE DEALERSHIP SAID THE TRANSMISSION FAILED AND A NEW ONE WAS SENT AND PUT INTO THE VEHICLE.  THE VEHICLE ONLY HAD 1080 MILES ON IT.",
        "vin": "1G1RD6S53GU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943712,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN REGARD TO RECALL 16055 REPROGRAM HYBRID POWERTRAIN CONTROL; MODULE 2. I HAD THIS RECALL DONE ON JANUARY 5, 2017. THIS SERVICE CHANGES SOME SETTINGS WITHOUT NOTIFICATION TO THE OWNER. CRITICALLY IMPORTANT IT CHANGES THE ENGINE RUN ON REMOTE START FROM OFF TO ON. IF THE OWNER STARTS THEIR CAR TO WARM UP IN THE GARAGE THE ENGINE WILL RUN UNKNOWING TO THE OWNER. THIS COULD BE A VERY DANGEROUS SITUATION FOR THE BUILDUP OF CARBON MONOXIDE IN THE GARAGE.",
        "vin": "1G1RD6S54GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2016",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVY VOLT WOULDN'T START, LESS THAN A YEAR OLD, CURRENT ON MAINTENANCE.  TOWED IT TO DEALER, THEY SAID THERE WERE SOME RECALLS - BUT COULDN'T TELL ME WHAT WAS WRONG.  GOT IT BACK AFTER 2 DAYS, WAS FINE - THEN ON 9/22/16 WOULDN'T START AGAIN - I WAS STRANDED IN THE DARK, GOT IT JUMP STARTED.  TOOK IT TO THE DEALER, SINCE IT WAS RUNNING FINE HE DIDN'T TAKE IT IN.  TOLD ME NEXT TIME IT HAPPENS TO GET IT TOWED IN.  WOULDN'T START AGAIN YESTERDAY,  UNRELIABLE CAR.  PLEASE INVESTIGATE.",
        "vin": "1G1RC6S5XGU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906933,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S AN ODD SITUATION WHEN I'M IN THE ELECTRIC MODE AND AM PASSING OVER A BUMPY BIT OF ROAD: THE VEHICLE ACCELERATES AUTOMATICALLY. THE PART THAT IS TROUBLING IS THAT THESE ARE TIMES WHEN THE DRIVER WOULD WANT TO SLOW DOWN. IT HAS HAPPENED TO ME MANY TIMES. I'VE BEEN LUCKY, SO FAR. BUT I HOPE THIS IS REMEDIED SOON.",
        "vin": "JN8AZO8W13W"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "09/08/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE  CONTROL WINDOW WAS BLANK AND I COULDN'T GET IT TO COME BACK AFTER RESTARTING THE CAR.  THE RADIO AND FUNCTIONS STILL WORKED, JUST COULDN'T SEE ANY OF THE FUNCTIONS TO OPERATE THEM.  THIS WAS WHEN THE VEHICLE WAS STARTED, AND DURING THE ENTIRE DRIVE ON CITY STREETS AND A HIGHWAY",
        "vin": "1G1RD6S51GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VOLT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING EAST ON HWY 80 IN VACAVILLE, CA, AT APPROXIMATELY 1:15 PM, I WAS LITERALLY BLINDED BY SUN FROM THE CHROME REFLECTION ON THE DASH BOARD.  BECAUSE OF THIS, I ALMOST REAR ENDED THE VEHICLE IN FRON OF ME AS I HAD DARK SPOTS IN MY VISION FROM THE REFLECTION.",
        "vin": ""
    }
]