[
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444626,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Chevrolet Sonic. The contact stated while driving 25 MPH, the vehicle began to stall inadvertently. The engine overheating warning light illuminated. The contact stated that she veered to the side of the road and turned off the vehicle. The contact's friend came on the scene and provided her with engine coolant, and she added the coolant to the vehicle. The contact continued to drive the vehicle. The vehicle was taken to an independent mechanic who diagnosed that the thermostat housing had melted and needed to be replaced. The contact stated that the vehicle was repaired; however, the failure reoccurred while driving. The vehicle was taken to an independent mechanic several times and the thermostat housing was replaced three times due to its plastic-based material. The contact stated that she was unable to drive the vehicle for more than an hour and a half without a reoccurrence of the failure. The vehicle was taken back to the independent mechanic who diagnosed that the head gasket had melted. The independent mechanic advised the contact to purchase a new vehicle like the engine compartment of the vehicle was poorly made. The dealer was not notified of the failure. The manufacturer was notified of the failure and offered to assist the contact with scheduling an appointment with the dealer for diagnosis. The vehicle was not repaired. The vehicle's approximate failure mileage was 38,000.",
        "vin": "1G1JE6SB2G4"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/10/2021",
        "dateOfIncident": "10/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443384,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle malfunctioned Driving on my way to work entering a large parking area connected stores. I saw a available parking spot in between 2 cars I drove in the spot lined up car and put my car in park completely stopped.I looked to my right then to my left to be sure I wasn't to close to the other two vehicles then I opened my drivers door to check if I was within the line.I was just on the line.As soon as I shut the door the doors locked the engine roared so loud I thought it was going to explode then the safety belt latched on so tight pulled me back at same time the car plummeted forward extreme acceleration into a brick building. Instantly the bags deployed as I halted forward  I put up my arms up panic knowing I was going into the bldg once impacted hit bldg I heard a loud screech sound.once hit the car instantly reversed  backwards at this same extreme speed I then was going backwards. I managed to step my foot on the break it stopped the car.  I was about 65 feet when it completely stopped in reverse. I opened the door and fled got got my belt off.The impact with bags was pain was excruciating did save my life. I don't know how I survived this accident. My car was in park gear ignition still on. This car completely malfunctioned.Previous engine light on for 3 to 4 day.  I need this investigated with the box  It will show reading I was in park .The insurance company will not provide this box data to me and Dealership is unreachable.",
        "vin": "1G1JC5SG1G4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/30/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello, I need you guys help. I got into a car wrecked which wasn’t my fault. The airbags they deployed and my child car seat was damage. I got a police report stating that the car accident wasn’t my fault and it’s the fault of a 16 year old. He merge straight into my Car and I have all these expeensives that I cannot pay for.",
        "vin": "1G1JA6SH2G4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAT DOESNT WORK. KEEPS BLOWING OUT COOL AIR. THIS PAST SUMMER THE AC WOULDN'T WORK. WHEN I TOOK IT TO THE DEALERSHIP THEY SAID IT WAS AN ELECTRICAL ISSUE BUT THEY FIXED IT. I BELIEVE THE TWO ISSUES ARE RELATED.",
        "vin": "1G1JC5SH0G4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384973,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN SIGNAL INDICATORS DO NOT MAKE SOUND WHEN ACTIVE",
        "vin": "1G1JC6SH6G4"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVERS SIDE SEAT HEATER STOPPED WORKING. I CLICK THE BUTTON, THE LIGHT COMES ON, AND THEN SHUTS RIGHT BACK OFF. I'VE TRIED TURNING THE CAR ON AND BACK OFF AND IT STILL DOES THE SAME THING.",
        "vin": "1G1JE6SB3G4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED SPUTTERING EVERY TIME I HAD TO PUT GAS IN IT THEN IT WOULDN'T CRANK AT ALL AND WE HAVE BEEN ABLE TO DETREMINE THAT THIS FUEL SYSTEM ISSUE HAS CREATED AN INABILITY TO KEEP THE CAR RUNNING AND EVERY TIME WE GET IT RUNNING IT REPEATEDLY CUTS OFF TILL WE REV IT UP MULTIPLE TIMES AND THEN IT TRIES TO CUT OFF EVERY TIME WE STOP AT A LIGHT.",
        "vin": "1G1JG6SB8G4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/13/2020",
        "dateOfIncident": "08/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11364059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG WARNING LIGHT KEEPS GOING ON AND OFF.  THIS HAS BEEN GOING ON FOR APPROX 2 MONTHS.",
        "vin": "1G1JC6SH2G4"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343257,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2016 CHEVY SONIC LT IN JANUARY OF 2020. IT HAS ONLY HAS 30,000 MILES ON IT AND HAS BEEN WELL MAINTAINED.     INITIALLY, I BELIEVED THAT THE COMPUTER WAS JUST SLOW. IN MARCH, 2020 I NOTICED THAT WHEN I WOULD TURN THE CAR ON THE RADIO/COMPUTER WOULD SOMETIMES TAKE SEVERAL MINUTES TO BOOT UP. THEN ONCE BOOTED, THE BACK-UP CAMERA LINES WOULD NOT SHOW UP. ONLY OCCASIONALLY WOULD THE GUIDING LINES APPEAR ON THE SCREEN.     THEN, A PROBLEM DEVELOPED WHERE AFTER I TURNED THE CAR OFF AND LOCKED THE DOORS, THE RADIO WOULD CONTINUE PLAYING UNTIL THE VEHICLE WAS RESTARTED OR THE BATTERY WAS DISCONNECTED. THIS FIRST OCCURRED IN MAY 2020 AND WOULD OCCUR PERIODICALLY OVER THE NEXT SEVERAL MONTHS.     IN JUNE 2020, THE RADIO WOULD RANDOMLY NOT BOOT WHEN STARTED OR BOOT EVEN MORE SLOWLY THAN USUAL. SOMETIMES I COULD DRIVE TEN OR TWENTY MINUTES BEFORE THE COMPUTER WOULD FINALLY TURN ON. OTHER TIMES THE COMPUTER WOULD NEVER TURN ON. YET AGAIN, THE ONLY SOLUTION WAS TO RESTART THE CAR OR DISCONNECT THE BATTERY.    ON AUGUST 1, 2020, THE RADIO WILL NOT TURN ON AT ALL, EVEN AFTER RESTARTING THE CAR OR RECONNECTING THE BATTERY. NOW THAT THE RADIO IS COMPLETELY NONOPERATIONAL, OTHER SYSTEMS HAVE BEEN EFFECTED, TOO. FOR EXAMPLE, THE BLINKERS DO NOT SIGNAL PROPERLY. ALTHOUGH THEY BLINK, I DO NOT RECEIVE A NOTIFICATION THAT THEY ARE ENGAGED (NO BLINKING SOUND). THE SEAT BELT, DOOR AJAR, AND KEY IN IGNITION WARNING DO NOT SOUND ANYMORE EITHER. ADDITIONALLY, THE COLLISION NOTIFICATION AND LANE RECOGNITION NO LONGER PRODUCE AN AUDIBLE WARNING. IT DOES NOT MATTER WHETHER THE CAR IS STATIONARY OR IN MOTION, THE RADIO AND ALL RELATED SOUND COMPONENTS DO NOT WORK AT ALL. I HAVE NOT FOUND ANY SOLUTION YET.    THERE HAVE BEEN RECALLS FOR PROBLEMS SUCH AS THESE FOR THIS VEHICLE, BUT NONE OF THEM ARE CURRENTLY OPEN.",
        "vin": "1G1JC5SB9G4"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET SONIC. THE CONTACT STATED WHILE DRIVING AT 45 MPH, THE VEHICLE LOSS MOTIVE POWER AND STALLED WITHOUT WARNING. THE CONTACT STATED THAT SEVERAL ATTEMPTS WERE NEEDED TO RESTART THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1G1JC6S8XG4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "02/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11340829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RAZOR SHARP PEELING CHROME FROM INTERIOR DOOR HANDLES CUTS FINGERS AND HANDS, SAFETY HAZARD TO A DRIVER AWAY FROM HOME OR NOT NEAR BANDAGES. COMMON GM PROBLEM FROM SONIC, CRUZE, MALIBU, TRAVERSE, EQUINOX, SILVERADOS. ALL GM MODELS",
        "vin": "1G1JC5SH2G4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339486,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS OFF RANDOMLY DURING STOP LIGHTS. I'VE RESEARCHED IT AND HAVE FOUND IT'S A KNOWN ISSUE WITH MY MODEL. WHEN IDLING IT WILL RANDOMLY SHUT OFF COMPLETELY AND WON'T TURN BACK ON FOR A FEW SECONDS TO MINUTES. IT WILL DO IT AT STOP SIGNS STOP LIGHTS. EVEN IN IM JUST PARKED.",
        "vin": "1G1JC5SH4G4"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "10/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EMISSIONS (EVAP) CODE. LOSING POWER, FEELS AS IF ENGINE IS SLIPPING/DRAGGING WHEN ACCELERATING. ENGINE LIGHT BLINKS & TRACTION CONTROL LIGHT ONLY WHEN REACHING HIGH RPMS.  *TR",
        "vin": "1G1JA5SH1G4"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328726,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATED TO START AFTER GETTING GAS. WHEN IT DOES FINALLY START IT SPUTTERS AND HAVE TO REV MOTOR SOME TO MAKE IT STOP. IDLES HIGH. AFTER GET STARTED AND START TO DRIVE IT IT'S OK, BUT WHEN STOPPED AT A LIGHT IT IDLES HIGHER.     I HAVE HAD THE PURGE VALVE REPLACED, BUT IT'S STILL DOING IT.",
        "vin": "1G1JC5SH2G4"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315791,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN HAVING TROUBLE WITH ACCELERATION AND JERKING WHEN STOPPED IN JULY 2019. TOOK VEHICLE TO A SHOP WHERE IT WAS SUGGESTED I REPLACE THE BATTERY AND THE OXYGEN SENSORS. BOTH WERE REPLACED. VEHICLE STILL CONTINUES TO JERK AND NOT PROPERLY ACCELERATE. VEHICLE DRIVES SMOOTH SO LONG AS THEIR IS A FULL TANK OF GAS AND ITS GOING A STEADY AT LEAST 40 MPH. WHEN THE GAS GETS BELOW HALF TANK, THE VEHICLE WILL CONTINUE WITH THE JERKING AND ACCELERATING ISSUE. VEHICLE ALSO HAS TO BE RESTARTED NUMEROUS TIMES AFTER GAS IS PUT IN.",
        "vin": "1G1JG6SB8G4"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY CAR IN OCTOBER OF 2018. IN JULY OF 2019, MY CHECK ENGINE LIGHT CAME ON, FOLLOWED SHORTLY AFTERWARD BY THE TEMPERATURE OVERHEAT GAUGE. TOOK MY CAR IN AND WAS TOLD THAT MY THERMOSTAT NEEDED REPLACED AND THAT THIS IS COMMON WITH MY MAKE/MODEL. REPLACED THE THERMOSTAT. IN JANUARY 2020, CHECK ENGINE LIGHT CAME ON AGAIN, WITH A PO599 CODE. TOOK IT TO LOCAL AUTO SHOP TO HAVE IT DIAGNOSED; THEY SAID THAT THE CHECK ENGINE LIGHT CAME ON WHEN STARTING THE CAR, SO LIKELY WASN'T AN OVERHEATING ISSUE. THEY THOUGHT IT WAS THE SENSORS/CIRCUITS. AFTER RUNNING DIAGNOSTIC CHECK, AGAIN SUGGESTED REPLACING THE THERMOSTAT. THIS IS NOW THE SECOND TIME THE THERMOSTAT HAS NEEDED REPLACED IN THE YEAR AND THREE MONTHS THAT I HAVE OWNED THE VEHICLE. WHEN AT JIFFY LUBE, I WAS TOLD THAT THEY HAD SEEN AT LEAST FOUR OTHER SONICS COME IN WITH THE SAME CHECK ENGINE CODE.",
        "vin": "1G1JC6SH1G4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281438,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET SONIC. THE CONTACT STATED THAT THE VALVE COVER GASKET BECAME DEFECTIVE, THE CHECK ENGINE WARNING INDICATOR PERSISTENTLY ILLUMINATED, AND THE TURBO ENGINE'S FINS WERE BENT. THE CONTACT TOOK THE VEHICLE TO TWO INDEPENDENT MECHANICS TO BE DIAGNOSED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "1G1JE5SB4G4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11278369,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 CHEVROLET SONIC. WHILE ATTEMPTING TO TURN ONTO A NEIGHBORHOOD STREET IN THE RAIN, THE VEHICLE HYDROPLANED AND BEGAN TO SLIDE. THE CONTACT CRASHED INTO THE FRONT END OF ANOTHER VEHICLE THAT WAS IDLING AT A STOP SIGN. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE HOOD AND FRONT DRIVER'S SIDE OF THE VEHICLE WERE DAMAGED. THE VEHICLE WAS TOWED TO A COLLISION SHOP BY THE CONTACT'S INSURANCE COMPANY. THE OTHER DRIVER SUSTAINED SMALL CUTS THAT DID NOT REQUIRE MEDICAL ATTENTION. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 97,131.",
        "vin": "1G1JC6SH0G4"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270721,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR ON MARCH 9,2019. IN MAY I TOOK IT TO THE DEALERSHIP [XXX] IN MOULTRIE, GEORGIA WHERE I PURCHASED THE CAR FROM AND NO ONE LOOKED AT IT, IT JUST SAT OUT THERE. WHEN I'M AT A TRAFFIC LIGHT TOO LONG MY CAR WILL CUT OFF OCCASIONALLY AND ALWAYS HESITATE WHEN ACCELERATING EVEN SOMETIMES WHEN I?M IN REVERSE. I GOT MY TRANSMISSION LOOKED AT AND NOTHING WAS WRONG WITH IT. ONE DAY AFTER I STOPPED AT THE STOP SIGN AND ACCELERATED MY CAR CUT OFF WHILE I WAS ALREADY IN DRIVE AND I ALMOST GOT HIT. I CALLED THE DEALERSHIP WHERE I GOT IT FROM AND TOLD THEM THAT  IT WAS CUTTING WHILE IN TRAFFIC AND HE SAID ALL HE COULD TELL ME WAS TO KEEP DRIVING IT AND HE DON'T REMEMBER SELLING ME NO CAR, WHEN I TOLD HIM HE DID AND HIS NAME IS EVEN ON MY PAPERWORK LISTED [XXX]. TOOK IT TO A LOCAL AUTO MECHANIC SHOP AND A FRIEND OF THE FAMILY MECHANIC SHOP AND NEITHER SHOPS COULD FIGURE OUT WHAT WAS WRONG. IN SEPTEMBER I CALLED THE CHEVROLET MANUFACTURING OFFICE AND THEY TOLD ME TO TAKE IT TO THE NEAREST CHEVROLET PLACE. THEY LOOKED AT AND COULDN?T FIND ANYTHING AND MY CHECK ENGINE LIGHT WASN'T COMING ON BUT THEY TEST DROVE IT AND SEEN EXACTLY WHAT I WAS TALKING ABOUT. THEY TRIED DOING AN INDUSTRIAL FLUSH AND IT DIDN'T WORK. THEY SUGGESTED MY ALTERNATOR BE REPLACED CAUSE IT WAS READING A 15, SERPENTINE BELT AND BELT TENSIONER BE REPLACED, I DID THAT AND TOOK  IT TO AN AUTO MECHANIC SHOP SINCE I DIDN'T HAVE A WARRANTY. THE PROBLEM ISN'T FIXED AND IT STILL JERKS AND CUTS OFF TO THIS DAY.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1G1JC5SH0G4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTS OFF AND CHECK ENGINE LIGHT COMES ON, WHEN IT IS BEING DRIVEN. ALWAYS WHEN WE HAVE HAD RAIN. WE HAVE TAKEN CAR TO DEALER AND THEY CANNOT FIND THE PROBLEM. ONCE WE PUT HEAT IN THE GAS TANK IT STARTS TO DRIVE UNTIL ANOTHER RAIN HITS.",
        "vin": "1G1JC5SG1G4"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245036,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET SONIC. WHILE DRIVING 15 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING. THE CONTACT ALSO MENTIONED THAT THE VEHICLE SHUT OFF WITHOUT WARNING WHILE AT A COMPLETE STOP. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHERE THEY DIAGNOSED THE VEHICLE AND REPLACED THE OXYGEN SENSOR; HOWEVER, THE FAILURE PERSISTED. THE CONTACT TOOK THE VEHICLE BACK TO THE INDEPENDENT MECHANIC ON NUMEROUS OCCASIONS AND HAD THE THERMOSTAT AND INTAKE MAIN GASKET SET REPLACED, AND AN ENGINE TUNE -UP; HOWEVER, THE FAILURE CONTINUED. THE MANUFACTURER AND DEALER WERE NOT NOTIFIED OF THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 78,456.",
        "vin": "1G1JC5SH0G4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2019",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS BOUGHT IN OCT OF 2015. IT DID NOT COME WITH A REAR CAMERA BACK UP SYSTEM, HOWEVER THE CENTER DISPLAY (RADIO & CONTROLS PANEL) STARTED DISPLAYING AN ERROR MESSAGE ABOUT THIS BACK UP SYSTEM. AT THE SAME TIME THE PHONE & RADIO CONTROLS LOCATED ON THE STEERING WHEEL ALSO STOPPED WORKING. WHEN BLUE TOOTHING A PHONE (HAVE TRIED WITH MORE THAN ONE TYPE) IT OFTEN DISCONNECTS & WHEN IT DOES CONNECT, IT DOESN'T FULLY CONNECT. BOTH THE STEERING WHEEL CONTROL & BLUE TOOTH PROBLEMS STARTED AT THE TIME THE REAR BACK UP ERROR BEGAN SHOWING UP.     THIS ERROR HAS BEEN DISPLAYING FOR MANY MONTHS & I NO LONGER HAVE A WARRANTY THAT WOULD COVER THIS EXPENSIVE REPAIR. THE DATE SELECTED IS AN ESTIMATION.",
        "vin": "1G1JC5SH5G4"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190460,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET SONIC. WHILE DRIVING APPROXIMATELY 20 MPH, THE VEHICLE JERKED, LOST POWER, AND THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO BARBER CHEVROLET (205-631-2669, LOCATED AT 90 BARBER BLVD, GARDENDALE, AL 35071) WHERE IT WAS DIAGNOSED THAT THE IGNITION COIL NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 75,200.",
        "vin": "1G1JC5SH9G4"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "05/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184599,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL .  ONE TIRE HAS ALREADY BEEN REPLACED AT THE OWNERS EXPENSE IN FEBRUARY 2019.. IT WAS DEFECTIVE AT THE TIME OF PURCHASE AND TAKEN BACK TO THE DEALERSHIP FOR REPLACEMENT BEFORE THE WARRANTY EXPIRED.  THE OTHER PROBLEM WAS ELECTRICAL, THE DRIVER SEAT WASN'T HEATING AND THE INFOTAINMENT CENTER  REAR CAMERA WAS BLURRING CAUSING A UNSAFE DRIVING CONDITION.. THE DASHBOARD WAS CLICKING OUT FOR A SECOND WHILE DRIVING ON A CITY STREET.",
        "vin": "1G1E5SB2417"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVROLET SONIC. CONSUMER WRITES IN REGARD TO DEFECTIVE DASHBOARD WIRING. CONSUMER BELIEVES IT CAN BE A MANUFACTURING DEFECT AND WOULD LIKE ASSISTANCE  TO RESOLVE SAFETY ISSUE AND REPAIR COST. *AS  *TR",
        "vin": "1G1JC5SH7G4"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON A STREET, POSSIBLY TWO MINUTES AFTER DEPARTING MY HOME, IS WHEN I'D REALIZED THE AIR BAG INDICATOR LIGHT WAS ILLUMINATED. EVERYTIME FOR THE NEXT THREE DAYS, THE WARNING LIGHT WOULD ILLUMINATE AS SOON AS THE CAR TURNED ON. IT FINALLY SHUT OFF AFTER I WENT OUT TO SHOP. IT WAS ILLUMINATED ON MY WAY TO THE SHOPS. I TURNED THE CAR OFF, SHOPPED AND WHEN I TURNED IT BACK ON, THE LIGHT DID NOT ILLUMINATE AND HAS NOT SINCE THEN. NOW, IT HAS BEEN AROUND TWO WEEKS SINCE IT TURNED OFF.",
        "vin": "1G1JC5SH4G4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- THE ENGINE LIGHT IS ON I HAVE TAKEN IT TO AUTO SHOP THEY COULD NOT FIND ANY WRONG TOOK IT TO A CHEVY DEALER THEY CANNOT FIND ANYTHING WRONG. BUT MY CAR SHAKES AND STALLS ON ME. IT'S VERY FRASTRATING SPENDING ON THE VECHILE AND ONE CAN FIND WHAT'S GOING ON.",
        "vin": "1G1JC5SH6G4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140045,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET SONIC. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE OVERHEATED, STALLED, AND COMPLETELY SHUT OFF. THE VEHICLE WAS TAKEN TO JEFF WYLER DIXIE CHEVROLET  (5340 DIXIE HWY, LOUISVILLE, KY 40216, (502) 448-2820) WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN A POWER TRAIN WARRANTY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 72,000.",
        "vin": "1G1JC5SH0G4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "10/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UPPER DASH PANEL (CLOSEST TO THE WINDSHIELD) HAS BEGUN TO MELT.  IT HAS AN OBVIOUSLY STICKY OR TACKY FEEL TO IT AT ALL TIMES.  THE STICKINESS IS MOST NOTICEABLE IN THE AFTERNOON AND EVENING ON WARM, SUNNY DAYS.  AFTER SITTING IN THE DARK ALL NIGHT LONG, THE STICKINESS IS LESS PROMINENT ALTHOUGH STILL NOTICEABLE.  THIS DASH PANEL PIECE HAS BEGUN TO \"SPARKLE\" AT NIGHT BECAUSE IT HAS HUNDREDS OF SMALL, MELTED SPOTS ALL OVER IT.    THE SAME MATERIAL USED FOR THIS DASH PANEL HAS ALSO BEEN USED FOR THE GLOVE BOX DRAWER, PART OF THE INTERIOR CENTER CONSOLE, AND SOME OF THE INTERIOR DOOR TRIM.  THE GLOVE BOX HAS A VERY FAINT STICKY FEELING AT TIMES; NONE OF THE OTHER AREAS HAVE SHOWN ANY OBVIOUS SIGNS OF MELTING.  THIS SEEMS LOGICAL BECAUSE NONE OF THESE OTHER AREAS RECEIVE DIRECT HEAT AND SUNLIGHT IN THE SAME WAY THE UPPER DASH PANEL DOES.    THIS ISSUE WAS FIRST NOTICED ON OCTOBER 4, 2018; HOWEVER, IT HAS PRESUMABLY BEEN AN ISSUE FOR AN EXTENDED PERIOD SINCE THE MELTING DOES NOT APPEAR TO HAVE TAKEN PLACE DUE TO A SINGLE EVENT.",
        "vin": "1G1JC6SH1G4"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "07/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11118152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 CHEVROLET SONIC. WHILE DRIVING AND MAKING A RIGHT TURN, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE. THE SIDE CURTAIN AIR BAG FAILED TO DEPLOY. THE DRIVER AND FRONT PASSENGER SUSTAINED HEAD, NECK, AND BACK INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO CARMAX (2550 ROOSEVELT BLVD, CLEARWATER, FL 33760, (727) 507-0790). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED CASE NUMBER: 900227. THE APPROXIMATE FAILURE MILEAGE WAS 58,000.",
        "vin": "1G1JC5SHXG4"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IN MOTION GOING DOWN THE HIGHWAY. STOPPED AT A REDLIGHT. CONTINUED QHEN LIGHT TURNED GREEN BUT NOT FAST AS THE NEXT LIGHT WAS TURNING RED. BRAKE FAILURE RESULTED IN A CAR ACCIDENT. UPON COLLISION THE AIR BAGS MALFUNCTIONED AND DID NOT DEPLOY. MANY OTHERS ARE EXPERIENCING THE SAME ISSUES WITH THE CHEVROLET SONIC STARTING FROM THE 2015 MODEL. GM WAS MADE AWARE OF THE ISSUE AND HAS YET TO FIX IT OR RECALL IT.",
        "vin": "1G1JC6SB9G4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "06/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SEAT AIRBAG INDICATOR SHOWS \"OFF\" WHEN A NORMAL SIZED ADULT IS SITTING IN THE SEAT.  THIS IS AN INTERMITTENT CONDITION I.E DOES NOT HAPPEN EVERY TIME..  MOVING IN THE SEAT, CONNECTING OR DISCONNECTING SEAT BELT, OPENING AND CLOSING PASSENGER DOOR DOES NOT CHANGE THE INDICATION.  INDICATOR REMAINS \"OFF\" AS CAR  IS DRIVEN.  BOTH DEALER AND CHEVY CORPORATE CUSTOMER SERVICE WERE CONTACTED WITHOUT A FIX.  THIS HAS HAPPENED SINCE CAR WAS NEW..  I HAVE A COUPLE OF VIDEOS OF THE OCCURRENCE, SHOWING ENGINE RUNNING, AIRBAG INDICATOR SHOWING OFF, NO SRS WARNING LIGHTS AND AN ADULT IN THE FRONT PASSENGER SEAT.  THIS CONDITION LEAVES THE FRONT SEAT PASSENGER AT HIGHER RISK FOR INJURY OR DEATH DURING AN ACCIDENT.",
        "vin": "1G1JC6SH9G4"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT SENSOR FOR THE AIR BAGS INTERMITTENLY TURNS THE AIR BAG ON FOR AN ADULT SITTING IN THE SEAT. MY WIFE WEIGHS 93 # AND SHOULD ACTIVATE THAT SENSOR BUT DOES NOT DO SO CONSISTENTLY. DEALER CLAIMS IT IS SET FOR 95 # BUT EVEN WHEN MY WIFE HOLDS AN 8# WEIGHT IN HER HAND AND SITS DOWN IT DOES NOT CONSISTENTLY ACTIVATE. THERE ARE A LOT OF COMPLAINTS ON THE INTERNET ABOUT THIS PROBLEM GOING BACK TO THE PREDECESSOR VEHICLE TO THE SONIC, THE AVEO, BUT CHEVROLET DOES NOTHING TO SOLVE OR RECOGNIZE THIS ISSUE. SOME OF THE COMPLAINTS ON THE INTERNET SHOW A PROBLEM WITH THIS SENSOR FOR OCCUPANTS CONSIDERABLY HEAVIER THAN MY WIFE. THIS OCCURS WHEN THE PASSENGER INITIALLY SITS DOWN IN THE SEAT.",
        "vin": "1G1JC6SH7G4"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/01/2017",
        "dateOfIncident": "09/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11051689,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET SONIC. WHILE PULLING INTO A PARKING SPOT, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE VEHICLE ACCELERATED. THE VEHICLE DROVE OVER A CONCRETE MEDIAN AND THROUGH BUSHES BEFORE COMING TO A COMPLETE STOP. THE CONTACT SUSTAINED A THUMB INJURY THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AUFFENBERG CHEVROLET BUICK GMC (830 VALLEY CREEK DR, FARMINGTON, MO 63640), BUT THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 32,847.",
        "vin": "1G1JA5SH7G4"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/10/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE ISSUES HAPPEN WHILE THE VEHICLE IS BOTH IN MOTION AND STILL.THE RIGHT INDICATOR LIGHT MALFUNCTIONS QUITE EXCESSIVELY. THE MALFUNCTION CAUSES THE REAR INDICATOR TO TURN OFF AND THE PEOPLE DRIVING BEHIND YOU CANNOT SEE YOU USING A TURN SIGNAL. ALSO THE SUSPENSION DOES NOT BRACE IMPACT OR  ADJUST TO DIFFERENT TERRAIN.",
        "vin": "1G1JE5SB2G4"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2017",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040715,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA RECALL",
        "vin": "1G1JE5SB9G4"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014248,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BACKING UP AND GOING FORWARD UP TO 25 MPH THE FRONT SUSPENSION WAS VERY NOISY. FRONT SWAY LINKS REPLACED BY DEALER UNDER WARRANTY.",
        "vin": "1G1JC6SH0G4"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993851,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CARS COMPUTER/PROGRAMMING IS REMOTELY CONTROLLED ,BRAKES TRANMISSION LIGHTS SUSPENSION DO NOTB PERFORM AS INTENDED BY MANUFACTURER.HACKING INVOLVED WHILE DRIVING STATIONARY FREEWAYS/CITY STREETS.",
        "vin": "1G1JE5SB1F4"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2017",
        "dateOfIncident": "04/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING SOUTH ON INTERSTATE 95 IN THE RIGHT LANE IN THE AREA OF MILE MARKER 7 IN SOUTH CAROLINA A PIECE OF FOREIGN DEBUS WAS RAN OVER BY THE CAR IN FROM OF ME. THE LARGE PIECE OF METAL BOUNCED OF THE ROAD  AND HIT THE FRONT BUMPER GRILL AND AIR CONDITIONING CONDENSER ( 24 INCH PIECE OF METAL IT APPEARED TO BE SOMETHING THAT WOULD HOLD A SEMI TRACK SPARE TIRE IN PLACE)  THE CAR I WAS BEHIND DIDN'T STOP TO ENSURE MY SAFETY HOWEVER THEY DID BRAKE AND CONTINUE ON THEIR JOURNEY.  I PULLED OFF AS SOON AS I COULD GET IN A SAFE PLACE AND I HAVE ATTACHED THE IMAGES OF THE DAMAGE AND THE ESTIMATE TO GET THE REPAIRS DONE.  MY DEDUCTIBLE IS $1000.00.  PLEASE FEEL FREE TO CALL OR  EMAIL FOR FURTHER INFORMATION.",
        "vin": "1G1JC6SH3G4"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PURCHASED NEW WITH LESS THAN 50 MILES ON IT.  THE VEHICLE SWAYS AND DRIFTS AT HIGHWAY SPEEDS.  IT MOVES LEFT AND RIGHT IN THE LANE. I DON'T FEEL SAFE IN THE VEHICLE.  I DON'T FEEL I AM IN CONTROL OF THE VEHICLE.  I NOTICE THIS AT SPEEDS OF ABOUT 45 MPH AND ABOVE.  I HAD IT INTO THE CHEVROLET DEALERSHIP AND THEY REPROGRAMMED THE CONTROL MODULE OF THE ELECTRIC STEERING BUT THE PROBLEM STILL PERSISTS.  GM HAS GIVEN ME NO SATISFACTION AND NO HELP WITH THIS MATTER.  I DON'T WANT TO DRIVE THIS VEHICLE AT HIGHWAY SPEEDS AGAIN UNTIL THIS IS FIXED.",
        "vin": "1G1JC5SB4G4"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/24/2016",
        "dateOfIncident": "05/02/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10869954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SONIC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVROLET SONIC.  CONSUMER WRITES IN REGARDS TO SIGNIFICANT RODENT DAMAGE TO ENGINE COMPARTMENT INSULATION CAUSES A MINOR FIRE.  *SMD",
        "vin": "1G1JB6SH7G4"
    }
]