[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/12/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11457981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The car was broadsided on Interstate 40 Westbound outside of Knoxville, TN on 3-12-22 by a Tractor Trailer and totaled. The airbags did not deploy allowing the driver to hit her head on the window of the vehicle causing her head trauma.  In Oct of 2021 The same vehicle hit a 200 pound dear head on at 65mph and destroyed the front end and the air bags did not deploy then either.",
        "vin": "1gnkvgkd4gj"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443502,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Replaced the transmission in 2018, transmission went out again in 2021.  Power steering also had to be replaced in 2021.  The initial transmission repair was covered under warranty but not the subsequent transmission nor the power steering were covered under warranty.  There are less than 95,000 miles on the car.",
        "vin": "1GNKVJKDXGJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/25/2021",
        "dateOfIncident": "11/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle has had 3 separate occurrences - January, October and November of 2021 - the vehicle suddenly losing its \"power\" by not accelerating over 40 mph, hard shifting to where it jerked uncontrollably. The dash board message center would say \"service stabilitrak\" \"service traction control\" \"traction control off\". The orange traction control light was also Illuminated on the dashboard. No check engine light was presented, and no codes were stored in the computer. 1s occurrence dealership changed battery, 2nd occurrence could not find an issue, customer refused vehicle back so dealership cleaned ABS tone rings. On all occurrences the customer was close to being rear ended on the major interstate due to losing sudden power. Dealerships are only able to \"guess\" on repair, due to no codes being stored in the computer. Many complaints for the same issue can be found in a Traverse Facebook group, on Google, and many other personal Traverse owners. There needs to be an open recall and investigation with this issue. None of these fixes are covered under the warranties, and customers must pay out of pocket as the dealership has it coded under \"maintenance\".",
        "vin": "1GNKRGKD3GJ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441126,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission went out on my way to work the vehicle shut off after I was stopped at a red light when it came time to move forward it bucked and shut off I finally made it to work then had it towed for repair",
        "vin": "1GNKVHKD6GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Chevrolet Traverse. The contact stated that while operating the vehicle, an abnormal moaning sound was present coming from the steering wheel while turning in either direction. The steering wheel had become stiff while turning. The cause of the failure was not yet determined. The local dealer and manufacturer were not yet notified. The contact indicated that the vehicle was previously serviced regarding a power steering failure. No further information was available. The failure mileage was 108,000.",
        "vin": "1GNKRGKD7GJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431142,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The car started getting a traction off and stability tracker n it would not run properly I was On the freeway and it happened almost caused an accident. Also it happens at random times.",
        "vin": "1GNKRGKD8GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Traction Control pops on my dash to service now, lose power and Van Bucks like missing and and speed cuts way down, very dangerous if you are in traffic, and only had 30,000 miles on Van when started, now i have 31,000",
        "vin": "1gnkrfed9gj"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The power steering pump went out on my 2016 Chevy Traverse which has 34,700 miles on it. At low RPMs the pump would intermittently fail and lock up the steering wheel. This means that when decelerating and attempting to avoid an accident my power steering could have failed causing me to be unable to avoid an otherwise avoidable accident. I was close to hitting another car in a parking lot when I was turning into a parking spot and the power steering failed, but I was able to slam on the brakes in time. I was able to bring it into a mechanic and get it fixed within two days. They were able to test the system and replicate the issues I was having. $1060.05 later I have a new OEM pump installed. The mechanic informed me that the pump he installed was a superseded part by GM. So GM knows it's a junk part and aren't using it anymore but don't care about the customers who bought the junk part originally. The bad pump has been disposed of by the mechanic. I paid for this out of pocket, and did not show this to the police, insurance, or manufacture. There were no warning lights or other indications that the steering was going out, I was simply driving home from work and noticed an intermittent lose of power steering on 6/2/21. I was able to get the vehicle home and fixed by the mechanic the next day 6/3/21.",
        "vin": "1GNKVGKD1GJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415613,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY 3 TO 6 MONTHS EITHER LEFT OR RIGHT LOW BEAM HEADLIGHTS (SILVERSTAR H11) ARE GOING OUT. THE AFFECTED SOCKET IS EXTREMELY HOT.  EITHER THERE IS A PROBLEM WITH THE QUALITY OF THE HEADLIGHTS OR THEIR IS AN ELECTRICAL ISSUE WITH THE SOCKET THAT KEEPS BURNING THESE BULBS OUT PREMATURELY.",
        "vin": "1GNKVGKD8GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:  2016 CHEVROLET TRAVERSE WITH 56,000 MILES   FEB. 2, 2021, I WAS RETURNING HOME FROM RUNNING ERRANDS , PULLED INTO THE DRIVEWAY AND PER MY NORMAL ROUTINE,  ROLLED JUST PAST THE GARAGE DOOR OPENING IN ORDER TO BACK INTO THE GARAGE.  WHEN I APPLIED THE BRAKE, THE CAR ACCELERATED INDEPENDENTLY TO FULL THROTTLE AND JUMPED ABOUT 10 OR 12 FEET, SIDESWIPED A TREE AT THE CURVE IN THE DRIVE AND TOOK OUT A 4X4 POST HOLDING MY BIRDFEEDER.   I CONTINUED APPLYING THE BRAKE BUT COULD NOT STOP THE CAR.  BY STEERING, I WAS ABLE TO MISS ANOTHER TREE AND DROVE INTO THE BACK YARD.  THE CAR WAS HEADED TOWARD THE BARN ABOUT  50 YARDS AWAY, BUT I WAS ABLE TO GET THE TRANSMISSION INTO PARK.  THE AIR BAGS DID NOT DEPLOY WHEN I HIT THE TREE, AND I WAS NOT INJURED.  AS THIS WAS ON PRIVATE PROPERTY WITH NO DAMAGE EXCEPT TO THE CAR, A POLICE REPORT WAS NOT FILED.  DID $12,000+  IN DAMAGES PLUS 4 WKS TO FIX.  THE CHEVY DEALER FROM WHOM THE CAR WAS PURCHASED SAID THEY WOULD HAVE SOMEONE FROM GM TO RUN A DIAGNOSTIC. THAT WAS 2 WKS AGO AND THEY STILL HAVE MY CAR BUT HAVE DONE NOTHING AS OF YET.",
        "vin": "1GNKRGKD3GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING STARTED TO BECOME NON-EXISTENT AT VERY LOW SPEEDS. THE WHEEL IS EXTREMELY DIFFICULT TO TURN WHEN COMING IN AND OUT OF PARKING SPACES OR TURNING AROUND PARKING LOTS OR TIGHT SPACES. THIS IS VERY DANGEROUS AS THE ONLY TIME THE PS CAN WORK IS TO SPEED UP WHICH IS IMPOSSIBLE WHEN MANEUVERING AROUND PARKING GARAGES. IT IS NOW A PERMANENT PROBLEM WITH MY 2016 TRAVERSE AND I NEED IT FIXED ASAP BUT I DON'T SEE ANY RECALL FOR IT. I SEE SEVERAL OTHER SIMILAR COMPLAINTS ON THE SAME 2016 CHEVY TRAVERSE OR WITHIN THE SAME YEAR MODEL. GM SHOULD ISSUE A RECALL FOR THIS ISSUE NOW BEFORE ANY SERIOUS DAMAGE OR INJURY OCCURS!",
        "vin": "1GNKRGKD3GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/11/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407524,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED, THEN I STARTED IT UP AND THREE ERROR MESSAGES WERE BLINKING: SERVICE TRACTION CONTROL, TRACTION CONTROL OFF, AND SERVICE STABILITY TRACTION. THE LIGHT WITH VEHICLE AND TIRE MARKS BEHIND IT WAS ON AS WELL. WHEN I STARTED TO DRIVE IT WOULD CUT IN AND OUT LIKE IT WAS GOING TO DIE. THE REAR INSTRUMENT PANEL FOR AC/HEAT ALSO GETS EXTREMELY HOT. THE VEHICLE ONLY HAS 52,000 MILES ON IT.",
        "vin": "1GNKRFED9GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407120,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS INFORMATION CENTER (DIC) IS SO DIM IT IS UNREADABLE DURING THE DAY.  THE OTHER FUNCTIONS OF THE PHOTOCELL (E.G. - DAYTIME RUNNING LIGHTS) FUNCTION FINE. THE LIGHT SWITCH FOR IT IS TURNED ALL THE WAY UP.  IT FUNCTIONS FINE AT NIGHT.  THEREFORE,DURING THE DAY  I AM NOT ABLE TO READ ANY WARNINGS ON IT, OR ANY OF THE OTHER INFORMATION, SUCH AS TIRE PRESSURE OR FUEL CONSUMPTION DATA.  DURING THE DAY WHEN IT IS MALFUNCTIONING, IF I COVER UP THE PHOTOCELL ON THE CENTER TOP OF THE DASH FOR 20-30 SECONDS, THE VEHICLE RESORTS TO NIGHT TIME SETTINGS, AND THE DIC IS LIT APPROPRIATELY FOR NIGHTTIME..  IF I THEN UNCOVER THE PHOTOCELL,  AFTER 20-30 SECONDS THE VEHICLE RESORTS BACK TO DAYTIME SETTINGS.  THE DIC THEN IS LIT NORMALLY FOR DAYTIME.  THIS NORMAL FUNCTIONING OF THE DIC WILL LAST 10 SECONDS SOMETIMES, OTHER TIMES FOR AN HOUR.  IT THEN ONCE AGAIN BECOMES SO DIM AS TO BE UNREADABLE.  (IT IS DIM, NOT BLANK).  MY CHEVY DEALER DOES NOT KNOW WHAT IS GOING ON, AND SAID THEY HAVE NO INFORMATION FROM GM.  THIS IS NOT A PROBLEM I HAVE ALONE, AS SEVERAL BLOGS DISCUSS THIS PROBLEM. FOR EXAMPLE - HTTPS://WWW.CARGURUS.COM/CARS/DISCUSSION-T51747_DS1014246.  ALL YOU HAVE TO DO IS SEARCH FOR: CHEVY TRAVERSE DRIVERS INFORMATION CENTER PROBLEMS.  THIS IS A SAFETY ISSUE.  WHAT IF MY TIRE PRESSURE IS STARTING TO RAPIDLY DECLINE AND I CANNOT SEE THAT?  WHAT IF I AM UNABLE TO SEE HOW MANY MILES I LEFT IN GAS?  CHEVY DOES NOT APPEAR TO ADMIT THERE IS A PROBLEM.     MY VEHICLE HAS ABOUT 96,000 MILES, AND I AM THE ORIGINAL OWNER.  IT HAS ONLY BEEN SERVICED BY A CHEVY DEALER. THERE ARE NO AFTER MARKET ACCESSORIES OR ALTERATIONS. THIS STARTED ABOUT A YEAR AGO, BUT SEEMS TO BE HAPPENING MORE OFTEN.  BLOGS INDICATE REPLACING THE INSTRUMENT CLUSTER FIXES THE PROBLEM, BUT NO WORD FROM CHEVY ON THAT.",
        "vin": "1GNKVJKD7GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405895,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY KEEPS DYING INSTALLED NEW BATTERY SAME THING CHEVY FOURM SAYS CABLE FROM BATTER TO ENGINE DEFECTIVE CAME OUT VEHIE BEEN STATIONARY TO START DEAD SAME THING AGAIN HAD TO HAVE CHEVY SERVICE JUMP START US FIRST TIME AN ENGINE HAS LOUD TICKING AND SLUGGISH AT LOW HEAT VEHICLE WAS PURCHASED CERTIFIED PRE OWNED HAVE PUT 3500 MIKE'S IN IT SINCE PURCHASE.",
        "vin": "1GNKRHKD5GJ"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398901,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING LOUD SOUNDS WHEN TURNING WHEEL AND IN MOTION   I'VE ONLY HAD THIS CAR FOR 4 MONTHS BOUGHT OF DEALERSHIP AND IT HAS MORE THAN 3 ISSUES RELATED TO THE POWER STEER",
        "vin": "1GNKVGKD9GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397768,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN A NEIGHBORHOOD ROAD AND CAME TO A STOP SIGN.  I PROCEEDED TO MAKE A LEFT TURN AND THE POWER STEERING NO LONGER WORKED.  MY TRAVERSE HAD 54K.  I TOOK IT TO A LOCAL REPAIR SHOP AND THEY REPLACED THE POWER STEERING PUMP, HIGH PRESSURE LINE, FLUSHED THE POWER STEERING SYSTEM AND HAD TO REPLACE THE SERPENTINE BELT BECAUSE FLUID GOT ALL OVER THE BELT.   I GOT THE SUV BACK AND IT STILL WASN'T RIGHT.  THE REPLACEMENT PUMP WAS ALSO BAD.",
        "vin": "1GNKVJKD3GJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "01/15/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY JAN.15, 2021 I DROVE TO MY SON'S HOUSE AND PARKED MY 2016 CHEVY TRAVERSE SUV OUTSIDE MY SON'S HOUSE AT APPROX.12PM. NO ONE WAS DRIVING THE CAR AND THE ENGINE WAS NOT RUNNING. AT ABOUT 6:45PM A CAR PASSING BY NOTICED A FIRE ON TOP OF THE HOOD ON THE DRIVER'S SIDE OF MY SUV. THE PERSON KNOCKED ON THE HOUSE DOOR TO LET US KNOW THAT THE CAR WAS ON FIRE. WE CALLED THE FIRE DEPT. THE FIRE DEPT. WAS ABLE TO PUT THE FIRE OUT WITH A FIRE EXTINGUISHER. THE FIREFIGHTER EXAMINED THE SCENE AND TOLD ME IT WAS CAUSED BY THE WIPER MOTOR. THE POLICE ALSO DID AN INVESTIGATION. EVIDENCE TECHNICIAN SAID HE DID NOT SEE ANYTHING SUSPICIOUS ABOUT THE FIRE. WE LOOKED ON LINE AND SAW THAT THE 2016 CHEVY TRAVERSE HAS A RECALL FOR WIPER MOTOR FIRES. WHEN I PUT IN MY VIN NUMBER THEY SAID MY CAR WAS NOT PART OF THE RECALL. I CALLED CHEVY AND THEY TOLD ME I HAD TO GO THROUGH MY INSURANCE. MY CAR HAD $3600.00 WORTH OF DAMAGE AND WAS TOWED TO GERBER COLLISION WHERE MY CAR WAS REPAIRED.",
        "vin": "1GNKRHKD3GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2021",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK WHEN ALL OF A SUDDEN I COULDN'T TURN MY STEERING WHEEL. THE POWER STEERING JUST GAVE OUT AND MY CAR ONLY HAS 49K MILES. IT IS NEARLY IMPOSSIBLE TO PULL IN AND OUT OF MY DRIVEWAY AND OTHER PLACES THAT REQUIRE A LOW SPEED TURN.",
        "vin": "1GNKVGKD2GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO HAVE A REBUILT TRANSMISSION PLACED IN VEHICLE 1 YEAR AGO AND SUBSEQUENT WORK DONE 6 MONTHS LATER ON THE \"NEW\" TRANSMISSION. NOW 6 MONTHS LATER IT BEGAN SLIPPING WHEN GOING FROM STOPPED THROUGH FIRST 2 GEARS, RPMS REV OVER 3. CALLED SOUTH CHARLOTTE CHEVY TO REPORT I WOULD BE BRINGING IT BACK IN. APPROXIMATELY 60000 MILES ON IT. I AM SICK OF IT!",
        "vin": "1GNKRFED0GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377467,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE IN FOR FACTORY REPAIR REGARDING SLIP IN GEAR SHIFTING AND UNSAFE VIBRATION BETWEEN 2ND AND 3RD GEAR. TORQUE CONVERTER WAS REPLACED AND STILL HAS SAME UNSAFE ISSUE.",
        "vin": "1GNKVJKD0GJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE VEHICLE HESITATED WHILE DRIVING AT VARIOUS SPEEDS WITH THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC ON THREE SEPARATE OCCASIONS AND DIAGNOSED WITH A FAULTY EVAPORATIVE EMISSIONS CONTROL UNIT. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED AND PERSISTED AFTER EACH REPAIR. THE CONTACT THEN CALLED THE MANUFACTURER WHO INFORMED HER TO TAKE THE VEHICLE TO AN AUTHORIZED DEALER FOR ASSISTANCE. THE VEHICLE WAS TAKEN TO BOB JOHNSON 390 CHEVROLET INC. (2780 LAKEVILLE RD, AVON, NY 144140) WHERE SIMILAR REPAIRS WERE PERFORMED ON THE VEHICLE HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS THEN TAKEN TO HOSELTON CHEVROLET (909 FAIRPORT RD, EAST ROCHESTER, NY 14445) WHERE THE CHECK ENGINE WARNING LIGHT WAS RESET HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "1GNKRFED2GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMAL DRIVING CONDITIONS, APPROXIMATELY 73737 MILES DRIVEN, POWER STEERING SUDDENLY STOPPED WORKING, POWER STEERING FAILED... QUICKLY... NOT GRADUALLY... SUDDENLY... TURNING INTO A PARKING SPOT AND STEERING WHEEL LOST ALL POWER TO STEERING WHEEL, HAD TO USE BOTH HANDS...",
        "vin": "1GNKVGKDXGJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11373736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN HWY 175, VEHICLES CHECK ENGINE LIGHT CAME ON WITH MESSAGE 'SERVICE STABILITRAK' FOLLOWED BY AN ABRUPT LOSS OF POWER.     HAPPENS REGULARLY AND WITHOUT WARNING.",
        "vin": "1GNKRGKD3GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363416,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. THE CONTACT STATED WHILE DRIVING 45 MPH, THE VEHICLE STARTED TO HESITATE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TRANSMISSION FLUID WAS FLUSHED. THE CONTACT STATED SHE CONTINUED TO EXPERIENCE THE FAILURE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER - PARKS CHEVROLET CHARLOTTE LOCATED AT 8530 IKEA BLVD, CHARLOTTE, NC 28262, (704) 317-6416, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "1GNKRFED4GJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AC COMPRESSOR LOCKED UP AND LOCKED MOTOR UP",
        "vin": "1GNKRHKD6GJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11349981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2016 TRAVERSE AFTER A CANCER TREATMENT HOME WHEN ALL OF A SUDDEN MSGS ON MY DASH STARTED APPEARIBG. SERVICE STABILITRAK, TRACTION CONTROL OFF. THE CAR STARTED SHUTTERING AND THE GUY BEHIND ME REAR ENDED ME WITH MY CHILDREN IN THE CAR. SINCE THEN I HAVE PUT 2 POWER STEERING PUMPS IN, AND HAD IT ST THE SHOP FOR SEVERAL TIMES THAT IT HAD SAID ABOUT SERVICIB SRABILITRAK. I HAVE READ OVER 300 HRS OF COMPLAINTS GAVING THE SAME ISSUE WITH THE STABILITRSK. I HAVE ALSO REPLACED SPEED SENSORS AND MODULES. THIS IS A TRASH VECHILE AND NO ONE FROM GM CARES OR RESPONDS. WHEN SOMEONE CHILD DOES MAYBE IT WILL GET THEIR ATTENTION. A CLASS ACTION LAWSUIT IS WHAT I PLAN ON PURSUING. THIS COULD HAVE BEEN MY CHILD. I HOPE SOMEONE READS THIS N CAN CARE ENOUGJ TO HELP. THE CAR HAS LESS THEN 65000 MILES",
        "vin": "1GNKVGKD4GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/10/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PERIODICALLY SEEMS TO GO OUT. IT IS WORSE AT LOW SPEEDS AND TRYING TO PARK. CHECKED POWER STEERING FLUID AND IT IS FINE. AT LOW RPMS IT IS ALMOST IMPOSSIBLE TO TURN THE WHEEL.  WHEN TURNING FROM ONE STREET INTO ANOTHER AT LOW SPEED FEARFUL OF STEERING GOING OUT AND CAUSING A CRASH AS CAR WILL NOT TURN SHORT. HAVE SEEN NUMEROUS CONCERNS ON THIS ISSUE WITH THIS MODEL AND EARLIER MODELS THAT HAVE HAD RECALLS. SOMETHING NEEDS TO BE DONE.",
        "vin": "1GNKVHKD7GJ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "06/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP CONNECTION ISSUE. PUMP KICKS IN AND OUT CAUSE STEERING WHEEL TO SUDDENLY STIFFEN. CAN BE VERY DANGEROUS IF IN TRAFFIC. SOME RECALL NEEDS TO TAKE ACTION TO SAVE LIVES ON THIS SERIOUS MATTER. NO RECALLS AS OF NOW  I WAS ON THE HIGHWAY WHEN I FELT A SUDDEN STIFFNESS IN THE STEERING WHEEL. GOT OFF AND CHECKED THE FLUID. IT WAS TOPPED OFF AND IT WAS EVEN HARDER TO MANEUVER WHEN VEHICLE IS STATIONED.  *TR",
        "vin": "1GNKVHKD4GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLIND SPOT DETECTION SYSTEM WARNING SENSORS HAVE FAILED AND WILL NOT WORK. THIS HAS CAUSED ME TO HAVE SEVERAL NEAR MISSIES IN DANGEROUS DRIVING SITUATIONS WITH OTHER VEHICLES. I FEEL UNSAFE DRIVING THIS VEHICLE AND DO NOT HAVE THE MONEY TO REPAIR IT.  *TR",
        "vin": "1GNKRHKD7GJ"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "05/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324187,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON AT 56K MILES. VEHICLE HAVING MISFIRE WHILE DRIVING, ROUGH IDLE WHILE SITTING AND SLUGGISH AT TIMES. MISFIRE AND ROUGH IDLE NOT HAPPENING ALL THE TIME. HAD GENERIC CODE CHECK DONE BEFORE I COULD GET INTO DEALERSHIP TO SEE WHAT I WAS LOOKING AT... MULTIPLE CODES WITH RUNNING LEAN AND 02 SENSOR. WAS ABLE TO GET INTO DEALER AFTER THE WEEKEND AND THEY DID DIAGNOSTIC. FOUND POWER STEERING GEAR INLET HOSE LEAKING ONTO O2 SENSOR (B1 S1) CAUSING THE WHOLE PROBLEM. NOT COVERED UNDER POWERTRAIN WARRANTY. I AM UNABLE TO AFFORD THE DEALERSHIP REPAIR COST AT THIS TIME AND HAVE BEEN SEEING WHERE OLDER MODELS HAVE HAD ISSUES WITH POWER STEERING PUMP FAILURE AND MORE RECENT MODELS HAVING LEAKS DUE TO HOSES BEING TOO CLOSE TO OTHER HOSES. SO I AM CONCERNED WITH REPLACING THE HOSE AND SENSOR AND HAVING THE SAME ISSUE OCCUR AGAIN.  *TR",
        "vin": "1GNKRGKD7GJ"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318084,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SWADDLES HEAVILY AFTER A CERTAIN SPEED TO THE POINT WHERE MY CHILDREN HAVE HIT THE SIDES OF THEIR HEADS WITH THE WINDOWS/DOORS.  MAKES A LOUD NOISE IN THE FRONT WHEN DRIVING AND TURNING, YOU CAN FEEL THE GRINDING NOISE VIBRATIONS ON THE BOTTOM OF FEET.",
        "vin": "1GNKRGKDXGJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION SYSTEM AND CROSS TRAFFIC WARNING SYSTEMS FAILED AT 58200 MILES ON 2016 TRAVERSE LTZ. WARNING MESSAGES APPEARED ON DIC TO HAVE THIS ISSUE SERVICED.  THE MESSAGES APPEARED  UPON STARTUP AND WHILE DRIVING.     DEALER INDICTED DETECTION MODULES AND WIRING HARNESS MUST BE REPLACED DUE TO WATER INTRUSION AND CORROSION IN THE MODULE WIRING CONNECTION.  HE INDICATED THIS WAS A WELL KNOWN GM ISSUE.  REPAIR COST IS  $1350.00 AND NOT COVERED BY WARRANTY.  HE INDICATED SOME EARLIER MODELS HAVE BEEN REIMBURSED FOR REPAIR BUT SO FAR THE 2016 TRAVERSE IS NOT ON THE LIST.  THIS IS AN IMPORTANT OPTIONAL SAFETY FEATURE THAT GM NEEDS TO RESOLVE ACROSS THE PRODUCT OFFERING.  THE DESIGN IS POOR WITH THE MODULE MOUNTED INSIDE THE REAR BUMPER COVER SUBJECT TO ROAD SALT, WATER AND DEBRIS AND A POORLY SEALED WIRING CONNECTION.",
        "vin": "1GNKVJKD5GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING AT SPEED - YOU CAN FEEL NOTICEABLE PLAY/LAG AS YOUR HOLDING THE STEERING WHEEL.  AT SLOWER SPEED, THE WHEEL BECOMES SLIGHTLY HEAVIER TO TURN BUT REVERTS BACK  AT TURN FROM COMPLETE STOP - WHEEL RETURN TO CENTER IS EXTREMELY DELAYED IF NONE AT ALL REQUIRING YOU TO BRING IT BACK TO CENTER.  WHEN PARKING - ALMOST IF NOT TOTAL LOSS OF POWERS STEERING.",
        "vin": "1GNKVJKD2GJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT INTO MY CAR, SPECIFICALLY IN THE SEAT BEHIND THE PASSENGER. I ALWAYS SIT HERE, BECAUSE I HAVE TO CARE FOR MY 8 MONTH OLD DAUGHTER AND MY 4 YEAR OLD SON. WHILE ON THE HIGHWAY IN THE BUSY LANES OF CALIFORNIA, MY SEATBELT CLIPS OFF THE LATCH. AT THIS POINT WE'RE ABOUT 2 HOURS AWAY FROM HOME, AND THERE'S HEAVY TRAFFIC. I TRY MULTIPLE TIMES TO PUT THE SEATBELT BACK INTO ITS PLACE BUT IT WILL NOT CLIP ON. I CANNOT HOP TO THE FRONT SEAT OR JUMP OVER TO THE BACK DUE TO HAVING OUR SEATS DOWN FOR EXTRA SPACE FOR ITEMS THAT WE HAD BOUGHT. ASIDE FROM THIS, WE'RE STUCK IN BUMPER TO BUMPER TRAFFIC. NOTHING DIFFERENTLY WAS DONE THIS DAY. THERE WAS NO PULLING OR PLAYING AROUND WITH THE SEATBELT, IT JUST STOPPED WORKING ON ITS OWN. I WAS SCARED FOR MY SAFETY. ASIDE FROM MY SAFETY BEING AT RISK, I GOT HAVE GOTTEN IN TROUBLE WITH LAW ENFORCEMENT FOR NOT WEARING A SEATBELT. I'M WRITING THIS TO BRING TO YOUR ATTENTION THAT SEATBELT NEED TO BE CHECKED AND TAKEN MORE SERIOUSLY. I HAVE NEVER SEEN SOMETHING LIKE THIS HAPPEN. THIS IS EXTREMELY SCARY AND DANGEROUS. THE SEATBELT ON A CAR SEAT COULD HAVE BEEN THE ONE TO CLIP OFF, AND A CAR SEAT COULD HAVE FLIPPED OVER CAUSING INJURIES OR A SCARED ON A MINOR. THIS HAS TO BE TAKEN IN CONSIDERATION AND VERY SERIOUS. A SEATBELT IS VERY IMPORTANT AND MANDATORY.",
        "vin": "1GNKRFED8GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287942,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2016 CHEVY TRAVERSE LT NEW FROM THE DEALER. IT HAS APPROX. 80K MILES THAT ARE MOSTLY \"HIGHWAY MILES\". I BROUGHT MY TRAVERSE INTO THE DEALER ON 12-9-19 FOR A BRAKE SERVICE AND ASK THAT THEY CHECK THE POWER STEERING WHICH HAS BEEN MAKING \"WINDING\" NOISES DURING VARIOUS TURNING RADIUSES. I WAS INFORMED BY THE DEALERSHIP OF A TSB REGARDING THE POWERING STEERING PUMP/LINE. APPARENTLY DUE TO A DESIGN FLAW BY GM, THE POWER STEERING HOSE AND A/C TOUCH AND DURING THE NORMAL OPERATION OF THE VEHICLE, RUB EACH OTHER. THIS IS KNOWN TO PRODUCE A HOLE IN THE POWER STEERING LINE CAUSING THE POWER STEERING FLUID TO LEAK. THIS HAS THE POTENTIAL TO CAUSE THE POWER STEERING PUMP TO FAIL. BECAUSE OF THE DESIGN FLAW, SIMPLY REPLACING THE HOSE WON'T ULTIMATELY FIX THE ISSUE. FURTHERMORE. IF THE POWER STEERING PUMP FAILS WHILE A DRIVER IS MAKING STEERING INPUTS, IT CREATES A HIGH PROBABLY THAT A CRASH CAN OCCUR RESULTING IN SERIOUS BODILY HARM OR DEATH TO THE DRIVER AND OTHERS.  I SPOKE TO GM CORP CUSTOMER SERVICE ON 12-9-19 AND WAS TOLD, THEY DO NOT SHOW TO HAVE A FIX AND BECAUSE THERE IS NO RECALL FOR THE ISSUE, THEY DO NOT PLAN TO ADDRESS IT. I DON'T KNOW HOW MANY LIVES IT TAKES TO INITIATE A RECALL, BUT I WOULD HOPE THAT AS A GOVERNING AGENCY, YOU WOULD NOT TAKE THIS ISSUE LIGHTLY. THANK YOU, [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GNKRGKD5GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "06/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MODULE THAT IS SUPPOSED TO BE FOR THE SIDE DETECTION ON BOTH SIDE MIRRORS DOES NOT WORK. WHEN I BROUGHT IT TO THE DEALERSHIP, THE MODULE HAD A SMALL SPACE THAT CONDENSATION COULD HAVE GOTTEN IN AND THE MODULE ACTUALLY ENDED UP BULGING. WHEN ASKED IF IT COULD BE REPLACED, THEY SAID THAT THE SPECIFIC PIECE NEEDED TO BE REPLACED IS NOT MADE BY GM ANY LONGER AND I WOULD NEED TO CONTACT GM, BUT IT COULD POSSIBLY BE A RECALL AT A LATER TIME. THE NOTIFICATION INSIDE THE CAR WENT OFF WHILE DRIVING. I CHECKED ALL SETTINGS TO MAKE SURE NOTHING WAS HIT BY ACCIDENT. EVERYTHING WAS THE WAY IT NEEDED TO BE. THE VEHICLE WAS BROUGHT IN THAT VERY NEXT WEEK TO BE CHECKED OUT AND THAT'S WHAT THEY TOLD ME ABOUT THE PIECE (WRITTEN ABOVE). SO I HAVE NO SIDE DETECTION ON A VEHICLE I JUST PURCHASED IN FEB 2019. I KNOW IT'S 3 YEARS OLD, BUT I SHOULD BE ABLE TO REPLACE A PIECE THAT I HAVE NO CONTROL OVER.",
        "vin": "1GNKVHKD3GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/12/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STALLS AS !ST GEAR JUMPS TO SECOND GEAR.",
        "vin": "1GNKRFED0GJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253374,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE EXPRESSWAY THE VEHICLES STABILITRAK LIGHT CAME ON, THERE WAS A LOSS OF POWER - WHICH COULD HAVE CAUSED AN CRASH AT HIGH SPEEDS.      THE STABILITRAK LIGHT HAS COME ON SEVERAL TIME NOW, THEN THE ABS LIGHT, THEN THE CHECK ENGINE LIGHT.  EACH TIME THE TRACTION CONTROL LIGHTS FLASH AND THEN THERE IS A LOSS OF VEHICLE POWER.      THIS COULD BE A VERY DANGEROUS ISSUE, IT IS FOR THIS REASON I AM REPORTING IT HERE.",
        "vin": "1GNKRFKD2GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD HAD THIS 2016 TRAVERSE AND IT HAS 64000 MILES.  IT HAS ON SEVERAL OCCASIONS FLASHED SERVICE TRACTION CONTROL/SERVICE STABILITRAC SYSTEM. IT HAPPENS OUTTA NOWHERE.  I'VE TAKEN IT IN SEVERAL TIMES ONLY TO BE TOLD THEY CAN'T FIND A CODE.  IT HAPPENS WHILE DRIVING DOWN THE ROAD WITHOUT WARNING CUTTING POWER TO THE ENGINE.  NO REASON FOR IT TO HAPPEN AND IT'S NOT FIXED. SEEMS TO BE A COMMON GM PROBLEM.  NEEDS TO BE FIXED. THIS HAPPENS WHILE DRIVING DOWN THE ROAD. ON ANY STREET.  THIS HAPPENED AGAIN TODAY AND HAS HAPPENED SEVERAL TIMES.",
        "vin": "1GNKRGKD7GJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "FORTERA HL (P)",
                "productYear": "9999",
                "size": "P235/60R18",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE EQUIPPED WITH  GOODYEAR FORTERA HL TIRES, SIZE: P255/65R18 (NA). THE CONTACT NOTICED THAT THE TIRE TREAD WAS CRACKING ON ALL FOUR TIRES. THE CONTACT SPOKE WITH THE TIRE MANUFACTURER AND RECEIVED A CASE NUMBER, BUT THEY HAD NOT CALLED BACK. JIM BARNARD CHEVROLET (7101 W BUFFALO RD, CHURCHVILLE, NY 14428, (585) 494-8151) WAS CONTACTED AND INFORMED THE CONTACT TO GO TO THE TIRE DEALER. THE VEHICLE FAILURE MILEAGE WAS 15,000. THE TIRE FAILURE MILEAGE WAS 15,000.  *TR *TT*JB    THE CONSUMER STATED THE FORTERA TIRES WERE RECALLED, BUT THE CONSUMER WAS NOT INCLUDED IN THE RECALL. *TR",
        "vin": "1GNKVGKD9GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "07/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242094,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING FROM CHICAGO TO COLORADO, APPROX 1000 MILES OF EXTENDED HIGHWAY DRIVING, I SLOWED DOWN TO TURN INTO THE GAS STATION AND MY POWER STEERING WENT OUT. SPECIFICALLY I HAD NO POWER STEERING WHEN BRAKING OR AT LOW SPEEDS WHEN RPMS WERE LESS THAN 2000. IN ORDER FOR THE POWER STEERING TO SOMEWHAT WORK I WOULD NEED TO ACCELERATE AT LOW GEAR TO RAISE RPMS.  I HAD MY FAMILY IN THE CAR AND COULD HAVE EASILY LOST CONTROL OF VEHICLE INJURING THE PASSENGERS IN THE CAR OR WORSE ANOTHER BYSTANDER OR DRIVER. THE CAR ONLY HAS 61000 MILES ON IT. GEARBOX FAILED , POWER STEERING PUMP FAILED, AND NEEDS HIGH PRESSURE STEERING HOSE. THIS IS A MAJOR SAFETY ISSUE AND A RECALL NEEDS TO BE PLACED. THIS IS A KNOWN ISSUE THAT HAS PLAGUED GM CARS , SPECIFICALLY THIS MODEL IN PAST.",
        "vin": "1GNKVJKD0GJ"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "05/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232481,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 CHEVY TRAVERSE CHECK ENGINE LIGHT CAME ON THEN IT STARTED BLINKING, WE BROUGHT IT TOO A CHEVY DEALER AND THEY TOLD US THE POWER STEERING PUMP WAS LEAKING AND THE FLUID RAN DOWN THE LINE AND DRIPPED IN TO THE SENSOR BOX AND SHORTED OUT ALL THE SENSORS. COSTING US OUT OF POCKET $2115.04.  THIS SHOULD NOT HAVE HAPPENED. THERE WERE NO SIGNS OF LEAKS OR SPOTS ON OUR DRIVEWAY OR WHERE THE CAR IS PARKED DURING THE DAY.  IF YOU LOOK UNDER THE HOOD OF THE TRAVERSE YOU SEE NOTHING. THERE WAS NO POSSIBLE WAY FOR ME TOO SEE THIS PROBLEM AND CATCH IT BEFORE THE DAMAGE WAS DONE. THERE FOR THIS SHOULD HAVE BEEN COVERED UNDER WARRANTY AND CHEVY BASICALLY TOLD ME TO BAD NOT COVERED.",
        "vin": "1GNKVGKD5GJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "07/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELTS IN THE 3RD ROW LOCK AND DO NOT RELEASE. MY SON WAS JUST STUCK IN THE CAR AND IT TOOK ALMOST AN HOUR FOR US TO GET HIM OUT BECAUSE OF THE SEATBELT. IT KEPT TIGHTENING WHEN WE TRIED TO GET IT OFF AND WOULDN'T RELEASE. THE VEHICLE WAS PARKED AND TURNED OFF.",
        "vin": "1GNKVHKD0GJ"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222030,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2016 TRAVERSE ON THE HIGHWAY, THE ENGINE LOST POWER AND I RECEIVED THE STABILITRAK WARNING, ALONG WITH THE ABS & CHECK ENGINE WARNING LIGHTS. I WAS ON THE INTERSTATE TRAVELLING ACROSS COUNTRY WHEN THE CAR BEGAN TO STUTTER, SHAKE AND WITH IMMEDIATE LOSS OF POWER, I STRUGGLED TO STEER OF THE MAIN LANES AND NARROWLY ESCAPING A LIFE-THREATENING CRASH.",
        "vin": "1GNKR8KD5GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH UNDER 30,000 MILES ON OUR VEHICLE, WE NEED A NEW POWER STEERING PUMP. THE POWER STEERING WILL STOP WORKING A VARIOUS TIMES. ALL UNDER THE SPEED FOR 20 MPH. THIS SEEMS SLIGHTLY HARMLESS BECAUSE OF THE LACK OF SPEED, BUT LET ME TELL YOU THE DANGERS. MY HUSBAND SEEMS TO HAVE NO ISSUES WHEN THE POWER STEER PUMP STOPS WORKING, BUT I HAVE ISSUES WITH IT. WHEN TRYING TO PARK I HAVE ALMOST HIT CAR PARKED BESIDE ME BECAUSE I CAN NOT CRANK ON THE WHEEL HARD ENOUGH. WHEN TRYING TO BACK OUT I ALMOST SIDE SWIPED CARS PARKED NEXT TO ME FOR THE SAME REASON. TODAY BECAUSE I COULD NOT CRANK THE STEERING WHEEL HARD ENOUGH. THIS CAUSED ME TO HIT THE CART CORAL AT OUR LOCAL MARKET. RESEARCHING WHAT THE ISSUE COULD BEEN, IN MANY FORUMS YOU SEE A CONSTANT FLOW OF POWER STEERING PUMP ISSUES IN MANY OF THE TRAVERSES WITH LESS THAN 30.000 MILES ON THEM. THIS IS SUCH A SAFETY ISSUE AND THERE SHOULD BE A RECALL. THERE HAS TO BE AN ISSUE WITH THE MANUFACTURED POWER STEERING PUMP.",
        "vin": "1GNKVGKD6GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING PUMP APPEARS TO INTERMITTENTLY FAIL AND CAUSES VERY DIFFICULT TURNING SITUATIONS.  IT IS UNPREDICTABLE TO KNOW WHEN THIS WILL HAPPEN AND THERE ARE TIMES WHEN THE CAR IS COMPLETELY FINE AND DRIVES BEAUTIFULLY AND THEN THERE ARE TIMES WHEN IT TAKES EVERY EFFORT TO TURN THE WHEEL.  THIS HAPPENED WITHOUT WARNING AND THERE WAS NOTHING ON THE DASH BOARD TO SIGNAL THAT A SYSTEM WAS FAILING.  IT PRIMARILY HAPPENS AT SPEEDS LESS THAN 25 MPH.",
        "vin": "1GNKVGKD6GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185827,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT POSTED HIGHWAY SPEED OF 65 M.P.H. A VIBRATION APPEARS. VIBRATION LASTED APPROXIMATELY 90 SECONDS AND BECAME HARSHER AND VEHICLE WAS GETTING UNDRIVEABLE AS TIME ELAPSED. AS VIBRATION INCREASED IN INTENSITY, I SLOWED DOWN TO ABOUT 15 M.P.H. TO MAINTAIN CONTROL. I EXITED THE HIGHWAY ONTO A COUNTY ROAD, CAME TO A COMPLETE STOP & PUT THE VEHICLE IN PARK. PUT THE VEHICLE IN REVERSE AND BACKED UP APPROXIMATELY 30 FEET. BROUGHT VEHICLE TO A COMPLETE STOP. PUT THE VEHICLE IN DRIVE AND DROVE THE REMAINDER OF THE WAY HOME, APPROXIMATELY 2 MILES. AFTER STOPPING, BACKING UP & CONTINUING IN DRIVE, THE HARSH VIBRATION HAS NOT RETURNED. THIS VEHICLE REACHED THE SERVICE LIMIT OF 2000 MILES ON 3/11/2019 AND WAS SERVICED FOR LUBE, OIL, FILTER ALONG WITH A CHECK FOR VIBRATION, NOTHING WAS FOUND.",
        "vin": "1NICHOLS2GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 75 ON A FREEWAY THE SERVICE STABILITRAK, SERVICE TRACTION CONTROL, AND CHECK ENGINE LIGHTS ALL CAME ON.  THE ENGINE POWER WAS REDUCED AND I COULDN'T GO OVER 40MPH ALL AT ONCE.  THE VEHICLE WAS LIMPED OFF THE FREEWAY WITHOUT ANY INCIDENT WITH ANOTHER VEHICLE, THANK GOD AND BROUGHT TO A MECHANIC.  HE SAID THAT HE HAS SEEN HUNDREDS OF THE SAME ISSUE OVER THE PAST FEW YEARS ON THE SAME VEHICLE AND OTHER CHEVROLET VEHICLES.  HE TOLD ME THAT THIS WILL HAPPEN TO DIAGNOSE A MORE GENERAL ISSUE THAT COULD BE WRONG WITH THE VEHICLE AND THAT IT COULD BE A NUMBER OF THINGS THAT NEED TO BE TESTED WITHOUT REPLACING HUNDREDS OR POTENTIALLY THOUSANDS OF DOLLARS WORTH OF PARTS.  IT COULD BE EVEN BE ONE OF A VARIETY OF SENSORS ON THE VEHICLE.  MY COMPLAINT IS THAT WITH SUCH A HIGH TECH COMPUTER ON THE VEHICLE, HOW IS IT THAT THERE IS NOT A SPECIFIC PROBLEM CODE OR LIGHT TO TELL YOU OR A MECHANIC WHAT IS ACTUALLY WRONG WITH THE VEHICLE. SECONDLY THAT A GENERAL CODE COMING UP ON A CAR SHOULD NOT BE POWERING THE ENGINE DOWN SO DRASTICALLY.  THAT COULD HAVE BEEN VERY DANGEROUS IF THERE WAS SOMEONE RIGHT BEHIND ME.  THIS IS A HAZARD WORTH A RECALL BEFORE SOMEONE IS INJURED OR KILLED BECAUSE OF IT.",
        "vin": "1GNKVJKD0GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON THE HIGHWAY THE SERVICE STABILITRACK LIGHT FLASHES ALONG WITH TRACTION CONTROL OFF AND ENGINE POWER REDUCED.  THE VEHICLE THEN SLOWS TO 25MPH.  THIS HAS HAPPENED SEVERAL TIMES AND HAS GONE AWAY AFTER I RESTART THE CAR.  THIS IS A SAFETY ISSUE AS I HAVE ALMOST BEEN REAR ENDED ON A BRIDGE WITH MY DAUGHTERS IN THE CAR.  I ENDED UP GETTING MY CAR TOWED TO THE DEALERSHIP YESTERDAY.  IF YOU RESEARCH THIS PROBLEM, IT IS A BIG ISSUE.  GM SHOULD BE MADE TO DO A RECALL FOR THIS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR, ON FOUR SEPARATE OCCASIONS, WHILE I'M EITHER DRIVING ON THE FREEWAY, OR LONG STRETCHES OF ROADS, HAS MALFUNCTIONED, STARTING WITH THE SERVICE STABILITRAK INDICATOR COMING ON, THEN TRACTION CONTROL OFF FUNCTION FLASHING, THEN THE ENGINE REDUCING SPEED UNTIL YOU'RE ABLE TO PULL OVER AND EVENTUALLY STOP BEFORE THE CAR CUTS OFF.  I HAVE TAKEN IT TO THE DEALER TWICE IN AN EFFORT FOR THEM TO TELL ME WHAT'S WRONG, AND EACH TIME, THEY EITHER DIDN'T KNOW, OR WERE UNSURE.  THE LAST TIME I TOOK IT, AFTER BEING INSTRUCTED TO MAKE SURE THE CHECK ENGINE LIGHT WAS ON, THEY STILL WERE UNABLE TO TELL ME PRECISELY WHAT WAS WRONG, AND THAT THEY CHANGED A RELAY, AND IF THAT WASN'T THE PROBLEM, THE WHOLE FUSE BOX NEEDED TO BE REPLACED.  I HAVE CALLED GM IN RESPONSE TO THIS, ASKING HOW ON EARTH WOULD A FUSE BOX NEED TO BE REPLACED ON A VEHICLE THAT'S ONLY THREE YEARS OLD WITH LESS THAN 100,000 MILES, BUT OF COURSE THEIR CUSTOMER SERVICE DEPARTMENT WASN'T HELPFUL IN THAT REGARD.  WHEN I FINALLY SPOKE TO THE DEALERSHIP AGAIN, THEY LET ME KNOW THAT THE PART WAS ON NATIONAL BACKORDER.  THAT INDICATES TO ME THAT THEIR IS A NATIONAL PROBLEM WITH EITHER THE CAR OR THE PART.  I CALLED GM AGAIN BUT WAS TOLD THAT IT IS NORMAL FOR A PART TO BE ON A NATIONAL BACKORDER.  I'M NOT BUYING IT, AND I BELIEVE THERE ARE MANY OWNERS WITH THE SAME PROBLEM, AND THEY WON'T WANT TO OWN THEIR PROBLEM, AND LEAVE THE VEHICLE OWNERS ON THE LINE TO PAY FOR REPAIRS FOR SOMETHING THAT'S CLEARLY DEFECTIVE.  PLEASE HOLD THEM ACCOUNTABLE!",
        "vin": "1GNKRGKD1GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH NO WARNING THE CHECK ENGINE LIGHT COMES IN, THE DASH FLASHES SERVICE STABILTRAK, TRACTION CONTROL OFF AND ENGINE POWER REDUCED. THE VEHICLE SLOWS DOWN TO 25 MPH AND IF YOU TRY TO SPEED UP IT SHUTTERS AND BUCKS. I HAVE TO PULL OVER AND RETURN IT OFF AND THEN WHEN TURNING IT BACK ON THE CHECK ENGINE LIGHT STAYS ON FOR ABOUT A DAY BUT OTHER WARNING LIGHTS ARE GONE. THIS HAS HAPPENED THREE TIMES AND I HAVE ALMOST BEEN HIT EVERY TIME, BECAUSE THE VEHICLE JUST SLOWS ITSELF DOWN TO 25 MPH WITH NO WARNING WHILE YOU ARE DRIVING.",
        "vin": "1GNKVGKD4GJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/25/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172202,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUR 2016 CHEVROLET TRAVERSE, WITHOUT WARNING, THE DASHBOARD FLASHED A WARNING THAT THE TRACTION CONTROL AND STABILITRAK NEEDED TO BE SERVICED. IT ALSO DISPLAYED THAT ENGINE POWER WAS REDUCED AND THE VEHICLE IMMEDIATELY DECELERATED TO 25 MPH. THE VEHICLE WAS TRAVELING AT OVER 70 MPH ON THE FREEWAY AND WE HAD TO TRY TO MAKE IT BACK OVER ONTO THE RIGHT HAND SHOULDER WITHOUT SOMEONE PLOWING INTO US. OVER THE LAST TWO DAYS, THIS HAS OCCURRED FOUR MORE TIMES FOR NO DISCERNABLE REASON. THIS ISSUE IS AN EXTREME SAFETY HAZARD AS IT CAN OCCUR AT ANY TIME, AT ANY SPEED AND THE VEHICLE IS IMMEDIATELY REDUCED TO 25 MPH. CHEVROLET IS HIGHLY NEGLIGENT IN ADDRESSING THIS PROBLEM. AS I BEGAN RESEARCHING THIS ISSUE, I'VE FOUND CASES OF THIS OCCURRING IN THE TRAVERSE AND EQUINOX MODELS AS EARLY AS 2011.",
        "vin": "1GNKVGKD2GJ"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2019",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS TRAVERSE BRAND NEW IN 2016. I NOW HAVE 51XXX MILES. I HAVE HAD TO REFILL THE TRANSMISSION 3 TIMES SINCE I'VE HAD IT. BUT ABSOLUTEY NO LEAKS. PRIOR TO THAT I WAS EXPERIENCING WEIRD TRANSMISSION SLIPPAGE AT OCWERD TIMES. ANOTHER QUIRK IS THAT SOMETIMES WHEN I PUT GAS IN MY VAR, THE HAND DOES NOT MOVE AT ALL UNTIL I DRIVE MAYBE 20 MILES BUT IT HAS ME WONDERING. KEEP IN MIND ALL THIS WEIRD BEHAVIOR WITH NO CHECK ENGINE LIGHT. THE VEHICLE RATTLES AT 1000 RPM. LIKE IT MIGHT BE A TIMING CHAIN. DOESNT ALWAYS GO IN TO GEAR. SHOWS FAULTY GAS GAUGE. I HAVE YET TO HEAR CLICKING NOISES AT SPEEDS ABOVE 20MPH (DONT KNOW WHAT THAT COULD BE)",
        "vin": "1GNKRFED0GJ"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR 2016 CHEVY TRAVERSE NEW AND NOW HAVE APPROX. 38K MILES ON IT. AFTER THE 1ST YEAR, WE BEGAN EXPERIENCING POWER LOSS ISSUES AND ENDED UP HAVING FUEL INJECTORS REPLACED IN MID-2017. SINCE THEN, WE'VE BEEN EXPERIENCING THE SAME ISSUE THAT HAS ALREADY BEEN REPORTED TO THE NHTSA BY OTHER OWNERS. PERIODICALLY, OUR \"SERVICE STABILITRAK\" WILL APPEAR ON THE DASH AND THE \"TRACTION CONTROL OFF\" WILL APPEAR, ALONG WITH THE \"CHECK ENGINE LIGHT\". WHEN THIS HAPPENS, THE VEHICLE RUNS EXTREMELY ROUGH AND VIOLENTLY SHAKES BACK AND FORTH. I'VE HAD THE VEHICLE INTO AUTONATION CHEVY IN BOTH GILBERT, AZ AND MESA, AZ FOR A TOTAL OF 5 TIMES SINCE MID-2017 FOR THIS ISSUE. I JUST PICKED IT UP A FEW DAYS AGO AFTER BEING IN THE SHOP FOR OVER 2 WEEKS. UNFORTUNATELY, NO REPAIRS WERE MADE AS NO CODES WERE FOUND/STORED IN THE COMPUTER AND THE MECHANIC WAS UNABLE TO REPLICATE THE ISSUE DURING THE 2 WEEK PERIOD. THIS IS CLEARLY A SAFETY ISSUE AND I'M A BIT SURPRISED NO RESOLUTION HAS BEEN MADE GIVEN THE COMPLAINTS REGARDING THIS ISSUE JUST IN 2018. THIS HAS OCCURRED WHILE DRIVING, WHILE IDLING AND WHILE WAITING TO TURN IN A BUSY INTERSECTION AND ALMOST LED TO AN ACCIDENT. I WILL BE TAKING THE VEHICLE BACK TO AUTONATION ONCE AGAIN TODAY. GM/CHEVY PLEASE REVIEW AND OFFER GUIDANCE AS TO WHAT'S GOING ON BEFORE FATALITIES OCCUR. THANK YOU.",
        "vin": "1GNKRFEDXGJ"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151043,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION, THE VEHICLE SLOWED AS THE CAR WAS TURNING RIGHT. THE NOISE THE CAR MADE WAS A GRINDING SOUND. IN ADDITION, THE CAR SEEMED AS IF I HAD MY FOOT ON THE GAS, WHICH I DID NOT. ONCE THE CAR WAS MOVING IN A STRAIGHT FORWARD DIRECTION AGAIN THE SOUND STOPPED. HOWEVER, AS SOON AS I TURNED INTO A SHARP LEFT CURVE THE VEHICLE PERFORMED THE SAME NOISE. ONCE I TOOK IT TO THE CHEVY DEALERSHIP THEY CONFIRMED IT WAS A POWER-STEERING FAILURE AND CALLED IN A \"911\" ISSUE. UNFORTUNATELY, THIS IS ONLY ONE OF MANY ISSUES WITH THE 2016 CHEVY TRAVERSE.",
        "vin": "1GNKVGKD8GJ"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/23/18, ABOUT 1-2 MILES AFTER EXITING HIGHWAY, I WAS DRIVING WHEN MY TRACTION CONTROL ON APPEARED ON MY DASHBOARD WITH ENGINE LIGHT ON, MY VEHICLE STARTED TO SHAKE LIKE IT WAS ABOUT TO DIE AND I COULD NOT ACCELERATE ANY MORE. I WENT FROM 40MPH TO 10-15MPH. I WAS TURNING LEFT AT A LIGHT AND HAD TO PULL IN TO A PARKING LOT AND VEHICLE STARTED SHAKING SO MUCH. IT WAS DIFFICULT TO MANEUVER THE TURNS.  THEN THE SHAKING JUST STOPPED. TURNED MY VEHICLE OFF AND BACK ON, TRACTION CONTROL AND ENGINE LIGHT DISAPPEARED LIKE NOTHING HAD HAPPENED. I DROVE BUT WOULD NOT ACCELERATE PAST 20 MPH.  TURNED VEHICLE OFF FOR A WHILE AND EVERYTHING WAS BACK TO NORMAL. ON 10/30/18, VEHICLE WAS IN MOTION AGAIN, TRAVELING 40 MPH, THEN TRACTION CONTROL CAME BACK ON WITH ENGINE LIGHT, I SLOWED DOWN TO 20 MPH AGAIN AND WAS ABLE TO PULL OVER BEFORE ENGINE STARTED TO SHAKE AND OR TURN. TURNED OFF THE ENGINE AGAIN,POWERED BACK ON AND IT DROVE LIKE NORMAL AGAIN. THIS HAS HAPPENED TWICE TO ME WITH MY CHILDREN IN MY VEHICLE. INCIDENT HAPPENED WHEN PAVEMENT WAS DRY, NO DEBRIS ON ROAD , THIS IS AN SAFETY ISSUE, AND I AM GRATEFUL IT DID NOT OCCUR ON THE HIGHWAY WHILE I WAS TRAVELING 60 MPH IN MORNING TRAFFIC. CONTACTED GM WHERE AFTER EXPLAINING MY ISSUE TO SUE AND SHE EVEN STATED IT WAS A SAFETY ISSUE.  DEALERSHIP STATED THAT THEY COULD RUN DIAGNOSTICS BUT IF NEITHER TRACTION CONTROL ON OR ENGINE LIGHT WAS ON, MAY NOT READ AS TO WHAT THE PROBLEM IS AND THEY COULD NOT GET ME IN UNTIL 11/2/18.",
        "vin": "1GNKRGKD9GJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/28/2018",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143532,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE CAPTAINS SEAT BELT IS STUCK AND DOES NOT HOLD LATCH IT JUST POPS OUT OF SEAT BELT.",
        "vin": "1GNKRJKD9GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/20/2018",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP FAILURE 32 MONTHS & 55,000 MILES AFTER NEW PURCHASE FROM DEALER. OUT OF WARRANTY DUE TO MILEAGE. COMPLETE POWER STEERING FAILURE OFTEN AT LOW SPEEDS OR WHEN STATIONARY. INTERMITTENT ISSUES DURING LARGER TURNS AT SPEED WHERE POWER STEERING WILL KICK IN HARDER OR NOT ENOUGH AT TIMES FELT MORE IN THE STEERING WHEEL THAN IN THE TURN ITSELF. INCREDIBLY DANGEROUS AND SHOULD NOT BE HAPPENING SO SOON OR AT ALL. DIAGNOSED BY MAVIS AFTER ISSUES WERE NOTICED WHILE DRIVING.",
        "vin": "1GNKVGKD7GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/06/2018",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138830,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS 70 DEGREES OUTSIDE AND RAINING. I WAS LEAVING A STORE, BACKED OUT OF MY PARKING SPOT AND DROVE TO THE END OF THE FIRST LANE, I STOPPED,  THEN AS I STARTED TO MOVE FORWARD AND TURN RIGHT, MY POWER STEERING DID NOT WORK ANYMORE. I WAS VERY HARD TO TURN AND MADE GROWLING NOISE. I COULDN'T MAKE THE RIGHT TURN. I STOPPED QUICKLY,  BACKED UP TO GET OUT OF LANE, AND STEERING BECAME VERY LOOSE IN REVERSE.  I STOPPED,  TRIED FORWARD AGAIN, AND IT DID IT AGAIN, VERY TIGHT STEERING, COULD NOT TURN ALL THE WAY TO MAKE THE TURN AND GROWLING.  I BACKED UP AND PARKED AND TURNED OFF VEHICLE, THEN STARTED AGAIN,  THEN IT WORKED FINE FOR THE TRIP HOME.",
        "vin": "1GNKVHKD3GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2018",
        "dateOfIncident": "08/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121646,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE METAL HOSE THAT CARRIES THE FREON FOR THE AC UNIT IS BEHIND ANOTHER HOSE WITH A METAL FEATURE ON IT THAT RUBBED A HOLE IN THE METAL HOSE WHICH CAUSED THE AIR CONDITIONING TO LEAK FREON SO UNABLE TO USE AIR CONDITIONING. THE CAR WAS IN MOTION WHEN THE AIR STOPPED WORKING.",
        "vin": "1GNKVHKD3GJ"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. WHILE DRIVING 70 MPH, THE VEHICLE HESITATED AND STALLED. IN ADDITION, THE ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS RESTARTED ON THE SECOND ATTEMPT. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE, BUT THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO LUCAS CHEVROLET (101 S JAMES CAMPBELL BLVD, COLUMBIA, TN 38401, (931) 398-5092) WHERE IT WAS DIAGNOSED THAT VAPORS BUILT UP IN THE FUEL FEED LINE AND THE FUEL PUMP NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 37,188.",
        "vin": "1GNKRGKD7GJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "07/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2016 AND IT'S NOT LEAKING FLUID BUT I HAVE HAD TO FILLL THE TRANSMISSION FLUID UP THREE TIMES SINCE I HAD IT AND I BOUGHT IT BRAND NEW IN 2016",
        "vin": "1GNKRFKD1GJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/18/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096646,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS LESS THEN 2 YEARS OLD WITH 31748 MILES. ALL 4 GOODYEAR FORTERA HL TIRES WERE SHOWING VISIBLE CRACKING AND DRY ROTTING  IN BETWEEN THE TREATS & ON SIDEWALLS.THERE WAS A RECALL ON THESE TIRES IN 2015 BUT  WE WERE TOLD OUR TIRES DON'T QUALIFY FOR REPLACEMENT. WE HAD THE TIRES REPLACED WITH AN OUT OF POCKET EXPENSE OF $411. GM REFUSED TO HELP US IN ANYWAY ALTHOUGH THIS IS CONSIDERED A SAFETY ISSUE BECAUSE THE SIDEWALL COULD BLOW OUT. I AM AWARE OF OTHERS THAT HAVE HAD THE SAME ISSUE AND WE'RE ALSO REFUSED HELP BY GM.",
        "vin": "1GNKRGKDXGJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "05/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092493,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER WHILE DRIVING. THIS HAPPENED LAST YEAR, SUPPOSEDLY FIXED, BUT HAD TO FIGHT WITH GM. WAS STILL UNDER WARRANTY. NOW RADIO IS SHOT SAID IT WOULD COST $1500 TO FIX. ELECTRICAL I WOULD ASSUME. FIGHTING WITH GM ONCE AGAIN.",
        "vin": "1GNKVFKD0GJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082490,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGED MY MOTOR OIL ON APRIL 1 ,2016 , I FOUND A CRACKED CROSS MEMBER DURING THE OIL CHANGE , I CONTACTED GENERAL AND VANDERGRIFF CHEVORLET",
        "vin": "1GNKRGKDXGJ"
    },
    {
        "components": "TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. WHILE DRIVING BETWEEN 35-60 MPH, THE \"TRACTION CONTROL OFF\" AND \"ENGINE POWER REDUCED\" WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO WEBB CHEVROLET PLAINFIELD (LOCATED AT 16140 S LINCOLN HWY, PLAINFIELD, IL 60586, (815) 556-2668) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT UNLESS THE CHECK ENGINE INDICATOR ILLUMINATED IN THEIR PRESENCE, THEY WOULD BE UNABLE TO PROVIDE A PROPER PROGNOSIS FOR THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: [XXX]. THE APPROXIMATE FAILURE MILEAGE WAS 64,865.     PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*JB",
        "vin": "1GNKRHKDXGJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "02/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081583,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/19/2018 WHILE ON A TRIP, OUR 2016 CHEVROLET TRAVERSE WITH 29,000 MILES ON IT HAD A CATASTROPHIC TRANSMISSION FAILURE WHILE MERGING ONTO INTERSTATE 40 AT SHAMROCK, TEXAS.   WE WERE ALMOST HIT BY A SEMI TRUCK AND BARLEY MISSED A FATAL ACCIDENT.   I HAD THE VEHICLE TOWED BY IRISH ROAD SERVICE TO THE CLOSEST CHEVROLET DEALER (WARE CHEVROLET BUICK) IN WHEELER, TEXAS.  THIS WAS APPROXIMATELY 16 MILES ($175) ' WHEN WE ARRIVED THERE I WAS TOLD BY THE SERVICE MANAGER THAT THEY WOULD NOT WORK ON THE CAR AND TO TOW IT SOMEWHERE ELSE.  I TALKED TO SERENA IN THE SERVICE DEPARTMENT AT AUTONATION CHEVROLET IN AMARILLO, TX AND SHE TOLD ME THEY WOULD NOT TOW THE CAR BUT WOULD WORK ON IT IF I GOT IT THERE.  . I HAD THE CAR TOWED APPROX. 100 MILES TO AUTONATION CHEVROLET ON FEBRUARY 20 ($575). PER THE DEALER IN AMARILLO THERE IS A BULLETIN OUT ON THIS TRANSMISSION FOR THE FAILURE OF THE 3-5-R CLUTCH PACK SO THIS IS A KNOWN DEFECT AND SHOULD HAVE BEEN A FIX DONE AS A RECALL INSTEAD OF WAITING UNTIL THE TRANSMISSION HAS A CATASTROPHIC FAILURE.  THIS IS EXACTLY THE PART REPLACED BY THIS DEALER PER THE INVOICE FROM THAT REPAIR.   I HAVE CONTACTED CHEVROLET 4 TIMES ASKING FOR REIMBURSEMENT OF COSTS FOR THE TOWING AND COSTS TO STAY IN AMARILLO.   TWO TIMES THEY CUT ME OFF - THE 3RD TIME ON 3/5/18 THEY TOLD ME TO WRITE A LETTER TO ROAD SIDE SERVICE TO REQUEST THE REIMBURSEMENT.   I DID THIS WITH COPIES OF ALL RECEIPTS ON 3-5-18.  I HAD NOT HEARD ANYTHING SO ON 3/27/18 I CALLED THE 1-800-243-8971 AGAIN AND TALKED TO SOFIA.  SHE TOLD ME THAT SINCE I DID NOT CALL THEM INITIALLY ON 2/19/18 TO HAVE THEM TOW THE CAR I WAS NOT ELIGIBLE FOR A REIMBURSEMENT.",
        "vin": "1GNKVGKD5GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "03/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILITRACK MESSAGE COMES ON AND REDUCED POWER FOR NO REASON. LOSES POWER INSTANTLY AND HAVE TO PULL OVER. TURNS BACK ON AND CHECK ENGINE LIGHT STILL ON, BUT CAN DRIVE AS NORMAL UNTIL I TURN IT OFF AND WHO KNOWS WHEN IT COMES BACK. SEVERAL TIMES HAS ACTED LIKE IT IS STUCK IN 4TH GEAR WHILE IN DRIVE. REVERSE IS OKAY.  OTHER TIMES IT HAS NOT STARTED, AT ALL.  I BROUGHT IT IN AND DEALERSHIP SAID IT WAS BATTERY.  REPLACED IT, THEN WORKED OK FOR COUPLE DAYS, THEN SAME PROBLEMS STARTED SHOWING BACK UP.  BROUGHT BACK IN AND CODE P2138 SHOWED UP INDICATING PEDAL POSITION SENSOR. I REPLACED PEDAL AND THE ISSUE OF REDUCED ENGINE POWER HAS NOT COME BACK YET (3 WEEKS). OTHER ISSUES HAVE RECENTLY SHOWN BACK UP (NOT STARTING SOMETIMES, STUCK IN 4TH GEAR).  I HAVE HAD THE CAR FOR JUST OVER A YEAR (BOUGHT IT FROM ENTERPRISE WITH 14,500 ON IT), AND NOW HAVE 71,000 MILES AND HAVING WAY TOO MANY PROBLEMS FOR IT BEING ALL HIGHWAY AND DRIVING IT EASY. TOO MANY OTHER PEOPLE WITH SAME PROBLEMS NOT TO HAVE IT FIXED/RECALLED BY CHEVY. I USED TO BE A CHEVY GUY, NOW MAY MOVE ELSEWHERE.....",
        "vin": "1GNKRHKD3GJ"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "02/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SIDE DETECTION MODULES WENT. THE DEALERSHIP COULD NOT GET ME IN FOR 3 WEEKS. 3 WEEKS LATER I HAVE NO ELECTRICAL POWER INCLUDING SPORADIC HEADLIGHTS, AND BLINKERS. I HAVE NO AIR BAGS. THE PARTS WERE ON BACK ORDER. NOW ITS BEEN 6 WEEKS NOW. I DECIDE TO CALL CHEVROLET CUSTOMER CARE. I WAS TOLD SINCE I AM OUT OF WARRANTY THEY CAN DO NOTHING FOR ME. THAT I SHOULD GO RENT A CAR OUT OF MY OWN POCKET TILL THE PARTS COME IN SOMEDAY. THEY DO NOT CARE IF I AM SAFE SINCE I HAVE NO WARRANTY?!?!?! THIS SIDE DETECTION MODULE IS A DANGER AND A SAFETY ISSUE AND SHOULD BE RECALLED AND CHEVROLET SHOULD BE OFFERING EVERYONE INVOLVED A RENT A CAR TILL THEY CAN FIX THE ISSUE. ITS A GREAT FEELING TO KNOW CHEVROLET DOESN'T CARE AT ALL ABOUT YOUR SAFETY!!!",
        "vin": "1GNKVJKD2GJ"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "FORTERA HL",
                "productYear": "9999",
                "size": "P255/65R18 109S",
                "type": "Tire"
            }
        ],
        "summary": "DURING A SCHEDULED MAINTENANCE AT MY DEALERSHIP, LOCATED IN CARROLLTON, OHIO THE REPAIR TECHNICIAN DISCOVERED THAT ALL FOUR GOODYEAR FORTURA HL SIZE 255/65R18 TIRES THAT WERE ORIGINAL ON MY VEHICLE, WERE CRACKING ON THE SIDEWALL NEAR THE TIRES BEAD.  I LEARNED THAT THIS PARTICULAR TIRE, THE SAME MAKE, MODEL, SIZE, AND DEFECT, WAS ON A RECALL FROM GOODYEAR. MY VEHICLE, A 2016 CHEVY TRAVERSE LT AWD WAS TAKEN TO THE LOCAL GOODYEAR DEALER.  THE DOT NUMBER ON MY TIRES IS 4BXMAROR OR DR. THE DEALER DETERMINED THAT MY TIRES WERE MANUFACTURED AFTER THE GOODYEAR RECALL HAD EXPIRED. SO THE ISSUE HERE IS THAT THE GOODYEAR TIRES  ON MY CAR ARE HAVING THE SAME DEFECTS AS THE EXPIRED RECALL  TIRES HAD. TO ME THAT MEANS THERE ARE MANY GOODYEAR TIRES THAT ARE DEFECTIVE DRIVING THE ROADS. THIS PRESENTS A SERIOUS SAFETY ISSUE DUE TO THESE DEFECTIVE TIRES BLOWING OUT AT OR NEAR THE CRACKING SIDEWALLS. THE MILES ON MY CAR WHEN THE DEFECT WAS DISCOVERED WAS 28,266. I ENDED UP PURCHASING A SET OF COOPER TIRES AND WAS CHARGED A PRO-RATED COST OF $362.95. IF I PURCHASED THE SAME GOODYEAR FORTERA HL TIRE, I WOULD HAVE PAID A PRO-RATED COST OF $608.00.I FELT AND STILL FEEL THAT GOODYEAR OWES ME A NEW SET OF TIRES AT NO COST DUE TO HAVING THE SAME DEFECTIVE TIRES AS THE EXPIRED RECALL TIRES.  I WROTE A LETTER TO THE GOODYEAR TIRE & RUBBER COMPANY CEO, WHO PASSED IT OFF TO THEIR CUSTOMER SERVICE OFFICE WHO OFFERED NO REMEDY OTHER THAN THE PRO-RATED COST. IN CLOSING, THE MAIN ISSUE HERE IS THAT THERE ARE CURRENTLY DEFECTIVE GOODYEAR FORTERA HL TIRES SIZE 255/65R18, THAT ARE BEING DRIVEN ON OUR ROADWAYS BY UNSUSPECTING CONSUMERS. THERE NEEDS TO BE AN IMMEDIATE TOTAL RECALL ON THESE TIRES TO PREVENT POTENTIAL LOSS OF LIFE.",
        "vin": "1GNKVGKD6GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. WHILE DRIVING 15-20 MPH, THE VEHICLE STALLED WITHOUT WARNING. ADDITIONALLY, ON SEVERAL OCCASIONS, THE CONTACT WAS UNABLE TO RESTART THE VEHICLE. THE CONTACT STATED THAT IT TOOK SEVERAL ATTEMPTS TO RESTART THE VEHICLE. THE VEHICLE WAS TAKEN TO SERRA CHEVROLET (28111 TELEGRAPH RD, SOUTHFIELD, MI 48034, (866) 722-6987) WHERE IT WAS DIAGNOSED THAT THE IGNITION KEY FAILED. THE CONTACT WAS PROVIDED NEW KEYS AND THE IGNITION WAS REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 200.",
        "vin": "1GNKVHKD9GJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071723,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "FORTERA HL",
                "productYear": "9999",
                "size": "P255/65R18 109S",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE EQUIPPED WITH GOODYEAR FORTERA HL TIRES, SIZE: P255/65R18 109S. WHILE THE VEHICLE WAS AT HOWIES TIRE & ALIGNMENT (13540 NW 7TH AVE, MIAMI, FL), THE CONTACT WAS INFORMED THAT ALL THE TIRES WERE DRY ROTTED AND THERE WAS TREAD SEPARATION. THE TIRES NEEDED TO BE REPLACED IMMEDIATELY. TROPICAL CHEVROLET (8880 BISCAYNE BLVD, MIAMI SHORES, FL) WAS CONTACTED, BUT THEIR LOCATION DID NOT HANDLE TIRE RELATED FAILURES. THE MANUFACTURER STATED THAT DUE TO THE DOT NUMBER NOT FALLING WITHIN THE RANGE, THE TIRES WERE NOT AFFECTED BY NHTSA CAMPAIGN NUMBER: 15T002000 (TIRES). THE VEHICLE AND TIRE FAILURE MILEAGE WAS APPROXIMATELY 32,070.",
        "vin": "1GNKRHKD7GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "02/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067256,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SERVICE STABILITY TRACK AND TRACTION CONTROL LIGHT STILL COMES ON ALL THE TIME.  I LOOSE SPEED AND THE CAR BUCKS.  BROUGHT TO CHEVY AND SAID THEY COULD SEE THAT I HAD A PROBLEM BUT DID NOT TELL THE ISSUE",
        "vin": "1GNKVJKD3GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2017",
        "dateOfIncident": "12/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT TURNED ON, ALONG WITH WARNINGS: SERVICE STABILITRAK AND ENGINE POWER REDUCED WHILE THE CAR WAS IN MOTION. PHYSICAL SPEED OF CAR WAS REDUCED TO 25 MPH AND COULD NOT ACCELERATE OVER THAT SPEED.",
        "vin": "1GNKVGKDXGJ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2017",
        "dateOfIncident": "12/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVY TRAVERSE ENGINE TRACTION CONTROL, STABILTRAK PROBLEM. ENGINE LIGHT CAME ON, DISPLAY STATED REDUCE SPEED TO 25 MPH AND THE ABOVE WARNING FLASHED ON THE DASH DISPLAY. THE CAR LOST ACCELERATION POWER. IT HAPPENED TWICE IN ABOUT A TWO WEEK PERIOD. THE FIRST TIME IT HAPPENED WAS ON 12/18/17, I STOPPED THE FIRST TIME AT A PARTS STORE TO GET THE CODE READINGS BUT THEY DID NOT HAVE THE EQUIPMENT TO READ THE CODES. THE SECOND TIME IT HAPPENED WAS ON 12/27/17, I STOPPED AT ANOTHER PARTS STORE AND THEY READ THE CODES WHICH CAME UP AS P2138. ENGINE LIGHT WAS OFF THE NEXT MORNING AND I TOOK IT INTO ADVANTAGE CHEVY IN BOLINGBROOK, IL. THEY MADE AN APPOINTMENT AND TOLD ME MOST LIKELY I NEED TO REPLACE THE ACCELERATOR PEDAL AND SENSOR, BUT UNTIL THEY CHECK IT OUT IT COULD BE SOMETHING ELSE TOO. I WISH I WOULD HAVE TAKEN PICTURES OF THE DISPLAY ALSO.",
        "vin": "1GNKRFED5GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CENTER CONSULE HAS A PLASTIC PIECE THAT BROKE OFF AND IT KEEPS POPPING UP AS I AM DRIVING. IT HAPPPEND TWO DAYS AGO WHILE I WAS DRIVING AND INTERFERRED WITH MY DRIVING WHEN  I TURNED AND IT HIT MY ARM AND IT ALMOST CAUSED ME AN ACCIDENT. ALTHOUGH I AM CAREFUL, ITS STILL KEEPS POPPING UP AND INTERFEERING WITH MY DRIVING. THE DEALERSHIP SAID IF I CAME IN 1 MONTH AGO, IT WOULD HAVE STILL BEEN COVERED ON MY 36,000 MILE WARRANTY, BUMPER TO BUMPER. I BELIEVE THIS HAS TO BE A DEFECT IN THE MATERIAL FOR IT TO BREAK IN LESS THAN 2 YEARS AND I DO NOT USE THE CENTER CONSULE MUCH.",
        "vin": "1GNKRHKD9GH"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "11/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR IN MARCH OF 2017 AND IT'S NOW NOVEMBER 2017  AND FOR AT LEAST A MONTH NOW MY CAR WILL BE FINE ONE MINUTE DRIVING DOWN THE ROAD  AND THEN IT FLASHES SERVICE STABLITRACK AND SERVICE TRACTION CONTROL WHILE DRIVING. IT LIKE JOLTS THE CAR AND MAKES IT DIFFICULT TO DRIVE. I HAVE READ ALL OVER THE INTERNET THAT THIS HAS BEEN A PROBLEM. AND I TOOK IT TO MY LOCAL DEALERSHIP AND THEY TOLD ME THEY COULD START BY FIXING THE STEERING POSITION SENSOR BUT IT WOULD BE AROUND $200Z WELL TO ME IF THIS IS A KNOWN ISSUE THERE NEEDS TO BE A RECALL I SHOULDN'T HAVE TO PAY FOR SOMETHING THAT IS CLEARLY AN ISSUE WITH THESE VEHICLES.",
        "vin": "1GNKRHKD4GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045839,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE AT 9,700 MILES AND AGAIN AT 23,080 MILES.",
        "vin": "1GNKRGKD7GJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "07/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035963,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STALLING HESITATION LACK OF PERFORMANCE IN HOT WEATHER CAUSED BY VAPOR BUILD IN FUEL LINE. THE DEALER CLEARED CODE TOLD TO USE 93 OCTANE GAS. THIS IS NOT A FIX MAKING THE VEHICLE UNSAFE TO DRIVE. THIS HAPPEN ON THE INTERSTATE DURING RUSH HOUR TRAFFIC.",
        "vin": "1GNKRGKD7GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 CHEVROLET TRAVERSE. CONSUMER WRITES IN REGARDS TO LOSS OF POWER WHILE DRIVING. *LD    THE CONSUMER STATED WHEN THE VEHICLE LOSES POWER THE DRIVER MUST TAP THE GAS PEDAL TO KEEP THE MOTOR RUNNING. THE ENGINE WARNING LIGHT ILLUMINATES. THE GAUGES BECOME ERRATIC INCLUDING THE OIL PRESSURE GAUGE. TAPPING THE GAS MADE THE VEHICLE ACT AS IF IT WERE FLOODING AND THEN IT WOULD SURGE. THE POWER STEERING WENT OUT MAKING THE VEHICLE DIFFICULT TO DRIVE. THE FAILURE TYPICALLY OCCURRED AFTER DRIVING FOR AN HOUR. THE FAILURE WAS INTERMITTENT.  THE DEALER COULD NOT DUPLICATE THE FAILURE. UPDATED 10/20/2017*JS",
        "vin": "1GNKRFKD7GJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "08/24/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019402,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DESPITE SHOWING OVER A QUARTER OF A TANK OF GAS, I RAN OUT OF GAS ON MY WAY TO WORK. I GOT THE VEHICLE INTO THE DEALERSHIP THE NEXT DAY 8/18/17 (STANLEY CHEVROLET, MCCORDSVILLE, IN). THEY REPLACED THE FUEL PUMP AT THAT TIME AND SAID THE PROBLEM WOULD BE SOLVED. THIS EVENING ON MY WAY HOME FROM WORK THE SAME THING HAPPENED. I AM NOW SITTING ON THE SIDE OF I-70 IN INDIANAPOLIS HOPING I AM NOT INJURED WHILE WAITING FOR AAA. PLEASE LOOK INTO THIS PROBLEM AS I HAVE ALREADY CALLED THE DEALERSHIP BACK AND THEY ARE SAYING THEY ARE UNAWARE OF ANY PROBLEMS THAT WOULD CAUSE THIS.",
        "vin": "1GNKVHKD8GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ABILITY CONCERN:CAR STOPS AND AFTER ACELERATION DOES NOT MOVE. AFTER PRESSING THE PEDAL HARD IT BEGINS TO ACERLERATE. THE DEALER  TRIED TO FIX IT TWICE BUT IT STILL HAD THE SAME PROBLEM..",
        "vin": "1GNKRHKD8GJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994552,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I ATTEMPTED TO BUCKLE THE DRIVER'S SIDE SEATBELT AND IT FAILED. IT APPEARS THAT THE SIDE ANCHORED TO THE CAR CAME APART AND THE BELT SEPARATED. THIS LEFT ONLY THE SHOULDER PORTION FUNCTIONAL WITHOUT THE USE OF THE LAP PORTION OF THE BELT. THE CAR WAS STATIONARY AND IN PARK.",
        "vin": "1GNKVGKD1GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2017",
        "dateOfIncident": "02/25/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956982,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JAN. 8,2016 WHILE DRIVING, MY CHECK ENGINE LIGHT CAME ON FOLLOWED BY A KNOCK IN THE MOTOR.  I PULLED OVER AND SHUT THE CAR OFF. I TOOK IT TO SHOTTENKIRK CHEVY IN QUINCY, IL WHERE THEY DIAGNOSED A COIL WAS BAD AT 11,993 MILES, BUT TOLD ME TO CONTINUE DRIVING THE CAR. THEY REPLACED THE COIL 2 DAYS LATER. THAT SAME NIGHT WE GOT IT BACK, WE TOOK IT BACK AND TOLD THEM WE WEREN'T SATISFIED. THEY KEPT IT 3 DAYS AND TOLD ME NOTHING WAS WRONG ON JAN. 16 WHEN WE PICKED IT BACK UP. ON JAN. 20 THE CHECK ENGINE LIGHT CAME ON AGAIN FOLLOWED BY AN EVEN LOUDER KNOCK. WE TOOK IT BACK JAN 21 AND RECEIVED A LOANER. THEY HAVE REPLACED MULTIPLE THINGS WITHIN THE MOTOR BUT IT STILL HASN'T FIXED THE PROBLEM. ON FEB. 25 WE WENT TO THE DEALERSHIP TO TRY TO TRADE FOR A NEW VEHICLE AND THEY DIDN'T WANT TO GIVE US WHAT OUR CAR WAS WORTH. AFTER TALKING WITH THE GM ON THE PHONE WE TOLD HIM WE WOULD CONTACT A LAWYER. HE REPLIED \"I'M CALLING THE LAW AND REPORTING THE TRUCK YOUR DRIVING STOLEN.\" WE RETURNED THE TRUCK THAT AFTERNOON BECAUSE WE CAN'T BE ACCUSED OF BEING A THIEF. WE NO LONGER HAVE A VEHICLE TO DRIVE;HOWEVER, I'M STILL PAYING A CAR PAYMENT AND INSURANCE. I BELIEVE WE PURCHASED A LEMON AND WOULD LIKE TO BE PAID OUT OF OUR LOAN FOR ALL THE TROUBLES WE HAVE HAD. I DO HAVE A VIDEO OF WHAT MY VEHICLE SOUNDS LIKE.",
        "vin": "1GNKRGKD4GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/24/2017",
        "dateOfIncident": "02/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A USED VEHICLE FROM ACADIANA MAZDA, LAFAYETTE LA. ABOUT A WEEK FROM HAVING IT THE EMERGENCY BRAKE LIGHT COMES ON. WE BRING IT IN, THEY SAY THEY CAN'T FIND ANYTHING WRONG SO WE TAKE IT BACK. THE NEXT WEEK, THE SALESMAN GIVES US A CALL AND SAYS THAT THEY NEED TO REPLACE THE WINDSHIELD, AFTER ASKING FOR A SALES TICKET FOR SEVERAL DAYS, THEY GIVE US A SALES TICKET FROM THE WEEK BEFORE THAT SAYS THAT THEY THINK THE VEHICLE HAS A WATER LEAK. (SERVICE TICKET IS ENCLOSED) I COME HOME THAT NIGHT BEFORE BRINGING IT IN AND I FIND RUST DRIPPING FROM THE EMERGENCY BRAKE, STANDING WATER UNDER MY FLOORING, RUST / CORROSION ALL OVER THE BOTTOM PARTS OF THE CAR. WHAT IS SUSPECTED BY THE CAR DEALERSHIP IS THAT THE WINDSHIELD WASN'T SEALED RIGHT AND WHEN IT WOULD RAIN IT WOULD COME IN FROM THE WINDSHIELD AND DRIP DOWN THROUGH THE EMERGENCY BRAKE. WE FIGURED THERE WERE 37 DAYS OF RAIN SINCE THEY HAD IT AND ALL OF THAT RAIN WAS GOING INTO THE VEHICLE. I WAS NOT INFORMED OF THIS PRIOR TO BUYING THE CAR. I TRIED TO RETURN IT BUT THEY REFUSED AND WANTED TO FIX IT. THAT WAS JUST SEALING THE WINDSHIELD, THE BRAKE SENSOR AND REPLACING THE FLOORING. I DID NOT FEEL THAT WAS GOOD ENOUGH. TO AVOID A LEGAL BATTLE AND CONCERNED FOR MY FAMILY'S SAFETY, I TRADED IT IN. I BELIEVE THERE MAY BE SOME ELECTRICAL ISSUES, AND OTHER CONCERNS WITH THE CAR THAT THEY WILL NOT FIX SO I AM REPORTING THIS FOR SOMEONE ELSE'S SAFETY. IT MAY ALSO HAVE BEEN FLOODED BUT THAT WASN'T DISCLOSED WHEN THE FIRST OWNER TRADED IT IN BUT THAT IS JUST SPECULATION. PLEASE INVESTIGATE.",
        "vin": "1GNKRFED0GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "01/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M JUST SURPRISED THAT THE WINDSHIELD WASHER PUMP FAILED AS THIS IS A BRAND NEW VEHICLE ACQUIRED IN MAY 2016.  IT HAD 10,500 MILES WHEN THE PUMP FAILED.  DEALER REPAIRED AND REPLACED AT NO COST (UNDER WARRANTY).  IT WAS DETERMINED THE WIRE WAS SHORTING OUT THE FUSE AND PUMP.  REPAIRED THE WIRE AND REPLACED THE WASHER PUMP AND FUSE.",
        "vin": "1GNKRGKD5GJ"
    },
    {
        "components": "AIR BAGS,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10940203,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "12/21/16 FIRST, I PULLED OUT OF DRIVEWAY AND THE VEHICLE WOULD ONLY GO ABOUT 1-2 MILES AN HOUR FOR SEVERAL BLOCKS...PULLED OVER AND PUT IN PARK AND REVVED THE ENGINE A LITTLE AND PULLED OUT AGAIN.  IT STILL WOULDN'T ACCELERATE AT FIRST, THEN GRADUALLY PICKED UP SPEED AND RODE THE REMAINDER WITHOUT INCIDENT. ON 12/22/16, ONE SECOND I WAS PARKING MY CAR IN FRONT OF THE STORE I WORK AT, AND WAS ALMOST COMPLETELY STOPPED WITH MY FOOT ON THE BRAKE, WHEN ALL OF A SUDDEN THE CAR LUNGED FORWARD INTO THE BRICK WALL OF THE BUILDING.  THE AIRBAG IN THE STEERING COLUMN DEPLOYED.  THE CAR BOUNCED BACK AND SHUT DOWN I THINK).  I REACHED UP AND TURNED THE KEY OFF & L OPENED THE DOOR & THE RADIATOR WAS LEAKING ONTO THE LOT.. MY KNEES WERE HURTING REALLY BAD, BOTH MY HANDS WERE SORE AND MY LEFT ARM.   THE CAR FRONT WAS ALL DAMAGED WITH PART OF THE FENDER ON THE SIDEWALK.  WE CALLED MY HUSBAND TO COME AND TAKE ME TO GET CHECKED OUT BECAUSE I THOUGHT I MIGHT HAVE CRACKED BOTH MY KNEECAPS. WE CONTACTED OUR INSURANCE COMPANY AND THEY TOLD US TO HAVE THE CAR TOWED TO OUR PREFERRED BODY SHOP, WHICH WE DID.  THE DR X-RAYED MY KNEES AND DETERMINED THEY WERE NOT BROKEN, JUST BADLY BRUISED.  ON DEC 26TH, I WENT BACK TO THE DR BECAUSE I STARTED HAVING SOME PAIN IN MY NECK/SHOULDER AND THEY DID NUMEROUS TESTS, FINDING WHAT THEY THOUGHT WAS A FRACTURE IN MY NECK.  I HAD TO WEAR A BRACE ON IT FOR A WEEK, THEN MORE TESTING DETERMINED THAT WHAT THEY SAW WAS ACTUALLY A PREVIOUS INJURY THAT HAD NEVER BEEN CAUGHT.  I NEED PHYSICAL THERAPY ON THE NECK ISSUE. I HAVE SINCE FOUND THAT THERE ARE SEVERAL COMPLAINTS OF THESE CARS SUDDENLY LURCHING FORWARD WHEN THE BRAKE IS APPLIED, OVER A SPAN OF 7 YEARS.  I AM NOT ONLY THANKFUL I WASN'T INJURED WORSE, BUT THAT THERE WASN'T A PERSON IN FRONT OF ME WHEN THIS HAPPENED.  I AM VERY CONCERNED THAT IT COULD HAPPEN AGAIN AND THE OUTCOME COULD BE MUCH WORSE.  *TR",
        "vin": "1GNKRFKD3GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/05/2017",
        "dateOfIncident": "01/05/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940003,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A SNOW STORM WHERE TEMPS WERE BETWEEN 22 AMD 30 DEGREES. I WAS OUT FOR 30 MIN TO 1 HOUR WHEN THE FRONT WINDOW FROZE AT THE BOTTOM. I HAD DEFROST ON THE ENTIRE TIME AND NOTHING I COULD DO WOULD UNFREEZE THE WINDOW.  THIS CAUSED THE WIPERS TO NOT FUNCTION APPROPRIATELY.  THE WIPERS LEFT WATER STREAKS BECAUSE THEY WERE SITTING ON ICE.  PRIOR TO COMING OUT MY CAR WAS COMPLETLY DRY BECAUSE IT WAS IN A GARAGE. NO PRE ICE CONDITIONS. THE STREAKS WHEN I WAS CONCERNED WERE IN MY VIEWING AREA AND I COULDNT SEE.",
        "vin": "1GNKVHKD8GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/03/2016",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929706,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UNEXPECTED NOTICE OF A SERVICE WARNING LIGHT THAT SUDDENLY APPEARED ON MY WIFE'S TRAVERSE AFTER DRIVING FOR 2 WEEKS.....  [XXX] AND I PURCHASED A DEMO TRAVERSE WITH 4000 MILES , AT A FT PIERCE CHEVROLET LOCATION RECENTLY...  WE WENT ON A TWO WEEK TRIP TO HAWAII AND RETURNED THIS PAST WEEK ,AS WE STARTED THE CAR , UPON OUR RETURN, MY WIFE EXCLAIMED ; I HAVE A WARNING AIRBAG NOTICE LIGHT ON....  SO I THOUGHT ! ,( MAYBE IT WAS THE FACT I HADN'T BUCKLED MY SEAT BELT YET, AS I ENTERED THE STARTED CAR, MAYBE MY SEAT WASN'T FUNCTION RIGHT OR SOMETHING).....   I HAD HER TURN OFF THE CAR AND RESTART IT.  CONTINUALLY , (THROUGHOUT THE DAY YESTERDAY), AS WE TRAVELED AROUND, DOING CHRISTMAS SHOPPING, THIS WARNING REAPPEARED EACH TIME WE STOPPED , GOT OUT TO SHOP AND RETURN TO START THE TRAVERSE..  WHEN I RETURNED HOME, I GOOGLE THE MEANING OF THIS WARNING, WHAT WAS IT CAUSES, WHAT IT ENTAILED / HOW TO REMEDY THIS WARNING AND MY STARTLED AND DISMAYED AS THE SEARCH RESULTS POPPED UP....  CHEVROLET WAS AWARE OF THE DESIGN DEFECT IN THE TRAVERSE VEHICLES, BUT DID NOT WARN US OR OTHER CONSUMERS PRIOR TO PURCHASING.  THE DEFECTIVE AIRBAGS CAUSES SAFETY CONCERNS AND DIMINISHES THE RESALE VALUE OF THIS VEHICLE ,THE DEFECTIVE AIRBAGS IN THE TRAVERSE MAY CAUSE UNSAFE DRIVING CONDITIONS AND FINANCIAL BURDEN TO US AS OWNERS. AS NOTED  IGNORING THE ACTIVE SERVICE AIR BAG WARNING LIGHT WILL EVENTUALLY RESULT IN THE NON-DEPLOYMENT OF THE SIDE IMPACT RESTRAINTS, WHICH INCLUDE DRIVER AND PASSENGER SEAT-MOUNTED SIDE AIR BAGS, FRONT CENTER AIR BAG (IF EQUIPPED), AND THE SEAT BELT PRE-TENSIONERS.  SEEMS THIS ISSUE HAS BEEN A RECURRING MODEL ISSUE SINCE 2010.. I'M NOT HAPPY AND HOPE THE DEALERSHIP IS ABLE TO REMEDY THIS ISSUE, FOR HER , IN A TIMELY MANNER , BUT I STILL NEEDED TO POST A NOTICE TO THIS SITE.....    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GNKRGKDXGJ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "10/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925869,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: 2016 CHEVY TRAVERSE : CONSUMER STATED DURING THE CAR ACCIDENT THE SEAT NELT AND SEAT BACK BROKE. *SS",
        "vin": "1GNKRGKD3GJ"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924945,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED A LOSS OF ACCELERATION AND EXPERIENCED A COMPLETE LOSS OF POWER. THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE SENSORS IN THE ACCELERATOR PEDAL NEEDED TO BE CHANGED. THE VEHICLE WAS REPAIRED HOWEVER THE SERVICE AIRBAG WARNING INDICATOR ILLUMINATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000.",
        "vin": "1GNKVFKD5GJ"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "10/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A RED LIGHT, FOOT ON THE BRAKE WHEN THE VEHICLE ACCELERATED JUMPING FROM 1000RPM TO 3000RPM, MULTIPLE TIMES IN A ROW. CAUSING MY CAR TO LUNGE FORWARD OVER AND OVER AGAIN. I CONTACTED THE DEALERSHIP IMMEDIATELY & WAS ASKED TO DRIVE MY CAR IN. I WAS HEADED TO A DESTINATION FIRST. WHEN I ARRIVED AT MY DESTINATION, I TURNED THE CAR OFF FOR APPROXIMATELY 5 MINUTES. WHEN I TURNED MY CAR BACK ON, THERE WAS A LOUD BANG NOISE, CAR SMELLED LIKE SOMETHING WAS ON FIRE & THE ACCELERATION DID NOT RETURN. WHAT DID HAPPEN WAS I NOW HAD NO AIR CONDITIONING. DEALERSHIP STATED IT WAS THE AC COMPRESSOR THAT WENT OUT AND CAUSED ALL THE ISSUES.",
        "vin": "1GNKRGKD8GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. WHILE DRIVING 30 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 4,000.",
        "vin": "1GNKRFKD8GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE LOST POWER. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD, TURNED OFF, AND RESTARTED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER WHO WAS UNABLE TO DUPLICATE OR DIAGNOSE THE FAILURE. THE CONTACT TOOK THE VEHICLE HOME, BUT THE FAILURE RECURRED A COUPLE OF DAYS LATER. THE VEHICLE WAS TOWED BACK TO THE DEALER WHO, AGAIN, WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT NOTHING COULD BE DONE WITHOUT A DUPLICATION OF THE FAILURE. THE CONTACT STATED THAT HE WOULD NOT DRIVE THE VEHICLE UNTIL THE FAILURE WAS DIAGNOSED. THE FAILURE MILEAGE WAS 1,600.",
        "vin": "1GNKRGKD9GJ"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "08/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907650,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTERPRISE RENTED ME THE CHEVY TRAVERSE. I EXPERIENCED THE PROBLEM WHEN I WAS BACKING OUT OF A PARKING AREA OFF A DIRT ROAD. I'D BEEN WAITING FOR THE CAR BEHIND ME TO BACK OUT SO THAT I COULD BACK OUT. THE CAR WAS STATIONARY, WEATHER SUNNY AND WARM, MIDDLE OF THE DAY. I TURNED ON THE IGNITION, HAD MY FOOT ON THE BRAKE, PUT IT INTO REVERSE AND NEXT THING I KNEW I WAS HURTLING BACKWARDS. IT FELT LIKE BEING SUCKED BACKWARD AND THERE WAS NOTHING I COULD DO TO STOP IT. I SMASHED INTO THE CAR BEHIND ME AND IT WAS TERRIFYING BOTH FOR ME AND, I'M SURE, FOR THE GUY BEHIND ME WHO SUDDENLY HAD THIS SUV CRASHING INTO THE FRONT OF HIS CAR. HE THOUGHT HIS CAR WAS TOTALED. THE INSURANCE COMPANIES ARE HANDLING IT, BUT I TOLD BOTH MY INSURANCE COMPANY AND ENTERPRISE THAT I THOUGHT THE TRAVERSE HAD SURGED. I DID EVENTUALLY DRIVE THE VEHICLE BACK HOME (AVOIDING REVERSE AS MUCH AS POSSIBLE), AND NOTICED WHEN THE CAR WAS IN CRUISE CONTROL MODE THAT SAME SURGE-FEELING IN DRIVE WHEN GOING UP A HILL--LIKE IT WAS GOING WAY TOO FAST. LATER, I SAW ONLINE A COMPLAINT OF A SIMILAR THING (REVERSE SURGE) HAPPENING WITH A 2009 TRAVERSE. I DON'T THINK THIS CAR SHOULD BE ON THE ROAD, AND THE PEOPLE HANDLING THE CLAIM FOR ENTERPRISE SAY THAT IT'S NOT (WHICH IS GOOD), BUT THEY JUST WARNED ME THAT IF THEIR INSPECTION DOESN'T SHOW A PROBLEM WITH THE VEHICLE, I COULD BE LIABLE FOR EXPENSES SINCE IT HAS BEEN PULLED FROM THEIR FLEET. AT THIS POINT, I'VE BEEN WAITING CLOSE TO A MONTH FOR THIS INSPECTION, AT WHICH I WAS TOLD I COULD BE PRESENT, TO BE SCHEDULED.    NOTES: I DON'T KNOW EXACTLY WHAT THE PROBLEM WAS SO I CHECKED EACH BOX THAT SEEMED LIKELY. ALSO, ONLY THE OTHER VEHICLE WAS TOWED.",
        "vin": "1GNKVHKD7GJ"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "06/24/2016",
        "dateOfIncident": "05/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 5,
        "odiNumber": 10876441,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 CHEVROLET TRAVERSE. WHILE DRIVING AT VARIOUS SPEEDS, THE CONTACT'S VEHICLE WAS REAR ENDED BY ANOTHER MOTORIST. AS A RESULT, THE FRONT AND THIRD ROW SEATS BECAME DETACHED. THE CONTACT WAS NOT SURE WHETHER OR NOT THE AIR BAGS DEPLOYED OR IF A POLICE REPORT WAS FILED. ALL FIVE OCCUPANTS WERE INJURED AND REQUIRED MEDICAL ATTENTION. THE PASSENGER IN THE THIRD ROW SEAT WAS INJURED SEVERELY WITH CERVICAL AND RIB FRACTURES AND BRAIN HEMORRHAGING. THE VEHICLE WAS TOWED FROM THE SCENE AND LATER DEEMED DESTROYED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN. ...UPDATED 08/01/16 *BF UPDATED 06/18/18*JB",
        "vin": "1GNKRHKD7GJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2016",
        "dateOfIncident": "11/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FAIL/DO NOT GET THE MPG AS INDICATED ON THE STICKER WHEN I PURCHASED THE VEHICLE IN NOVEMBER 2015. STICKER INDICATED MPG, 17 CITY, 24 HIGHWAY. GM USED THE SAME TACTIC AS VW TO SELL THE 2016 TRAVERSE. THEY ARE NOW SAYING OOPS. WE PRINTED OUT THE WRONG INFO ON THE WINDOW STICKER. I PURCHASED THE VEHICLE BASED ON THE MPG PRINTED ON THE WINDOW STICKER. NOW I AM TOLD YOU WILL NOT GET THAT MPG. I AM NOW BE CHEATED OUT OF 44 MILES PER TANK OF GAS. THIS WILL ADD A COSTLY EXPENSE TO ME OVER A 20 YEAR PERIOD. GM SHOULD PROVIDE WITH A TRAVERSE THAT GET THE MPG I CONTRACTED FOR WHEN I PURCHASED THE VEHICLE, 2016 TRAVERSE.",
        "vin": "1GNKRHKD7GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2016",
        "dateOfIncident": "12/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION SYSTEM - TURN BY TURN. PROVIDE DANGEROUISLY DIRECTION. INSTRUCT YOU TO MAKE TURN WHERE THERE IS NO STREET TO TURN ONTO, I.E., INSTRUCTS  YOU TO MAKE TURNS OFF A OVERPASS FROM A BRIDGE AND FALL DOWN ONTO THE INTERSTATE BELOW. THIS A SAFETY, DANGEROUS, HAZARDS, LIFE THREATENING COMPONENT IN THE 2016 CHEVROLET TRAVERSE, ESPECIALLY AT NIGHT. I HAVE TAKEN THE VEHICLE BACK TO THE DEALER, NO HELP! CALLED GM CUSTOMER SERVICE IN DETROIT=NO HELP. THIS NAV SYSTEM IS A DEADLY SAFETY HAZARD. THAT PROVIDE DEADLY INFORMATION TO THE DRIVER. THIS NEED TO BE CORRECTED ASAP - BY ISSUING A RECALL FOR 2016 CHEVY NAV SYSTEM. GM HAS BEEN SLOW TO FIX REPORTED SAFETY ISSUES WHICH HAS RESULTED IN DEATH/FATALITY.",
        "vin": "1GNKRHKD7GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "03/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, THE WAS JERKING AND DECELERATED INDEPENDENTLY BEFORE STALLING. THE VEHICLE WAS ABLE TO RESTART BUT THE FAILURE RECURRED. IN ADDITION, THE CONTACT MENTIONED THAT THE FUEL GAUGE IN THE INSTRUMENT PANEL FAILED TO INDICATE THE ACCURATE FUEL LEVEL. THE CONTACT FURTHER STATED THAT VARIOUS WARNING LIGHTS ILLUMINATED. THE VEHICLE TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION SYSTEM AND ENGINE HAD FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 800.",
        "vin": "1GNKRGKD8GJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/01/2016",
        "dateOfIncident": "02/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839313,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS ( 2/21/16 AND 2/28/16) WHILE DRIVING THE POWER CUT OUT COMPLETELY AND THE CAR STALLED.  I WAS UNABLE TO STEER THE VEHICLE OR STOP. THERE WERE NOT ANY WARNINGS OR NOTIFICATIONS SUCH AS THE CHECK ENGINE LIGHT.  THE DASHBOARD AND ALL OTHER LIGHTS/ INFORMATION WAS COMPLETELY DARK. THE FIRST OCCASION WAS ON A HIGHWAY GOING APPROXIMATELY 30 MILES PER HOUR AND THE SECOND WAS ON A CITY STREET APPROACHING A STOP SIGN.  CAUSE UNKNOWN.  I TOOK THE CAR TO THE DEALERSHIP AND THEY CLAIM THEY CANNOT FIND A CAUSE. I WAS ENCOURAGED TO TAKE THE CAR BE BECAUSE  THE CAUSE IS UNKNOWN.  I REFUSED BECAUSE OF THE SAFETY CONCERNS.",
        "vin": "1GNKVHKD2GJ"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE WINDOW EXPLODED.  WE WERE DRIVING ON AN OPEN RURAL HIGHWAY WITH NO VEHICLES NEAR US IN THE AFTERNOON.  THE WEATHER WAS ABOUT 75 DEGREES AND SUNNY.  ALL WINDOWS WERE UP AND THE A/C WAS ON.  WE HEARD AN EXPLOSION WHICH SOUNDED LIKE A TIRE BLOWING OUT AND THE PASSENGER SIDE FRONT DOOR WINDOW HAD BLOWN OUT.  WHEN WE PULLED TO THE SIDE OF THE ROAD, YOU COULD SEE THAT THE REMAINING PARTS OF THE WINDOW WERE ANGLED OUTWARD SLIGHTLY AS IF THERE HAD BEEN PRESSURE FROM INSIDE THE SUV PUSHING IT OUT.  FORTUNATELY, VERY LITTLE GLASS CAME INTO THE CAR AS IT WAS ALL BLOWN OUTWARD.  WE WERE DRIVING THE SPEED LIMIT ON CRUISE CONTROL (70MPH).  AS THERE WERE NO NEARBY VEHICLES OR PEOPLE ON THE SIDE OF THE ROAD, ROAD DEBRIS WAS NOT THE CAUSE OF THIS.  ALSO, A CLOSE REVIEW OF THE VEHICLE SHOW NO MARKS FROM ANY EXTERNAL DEBRIS.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V609000 (VISIBILITY); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT ALSO STATED THAT THE VEHICLE WAS AT THE DEALER FOR SIX WEEKS AWAITING REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1GNKVHKD3GJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781032,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 CHEVROLET TRAVERSE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V609000 (VISIBILITY) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1GNKRGKD2GJ"
    }
]