[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122201,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "COACHMEN",
                "productModel": "FREEDOM EXPRESS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT FRAME SECTION AND RIGHT REAR SUSPENSION MOUNTING BRACKET RIPPED COMPLETELY APART.  THE REST OF THE FRAME TWISTED AND THE WALLS/BODY BUCKLED.  2016 COACHMEN FREEDOM EXPRESS 229TBS (TRAVEL TRAILER).  LIPPERT FRAME.  A DEADLY OR CATASTROPHIC ACCIDENT COULD HAVE OCCURRED.  I NOTICED THE WHEELS WERE NOT TRACKING PROPERLY.  I CRAWLED AROUND UNDER THE TRAILER AND DISCOVERED THE FRAME AND AXLE/SUSPENSION MOUNTING BRACKET HAD RIPPED COMPLETELY APART. THE MOUNTING SECTION SPUN AROUND AND UPWARDS INTO THE TRAILER.  THE TIRES WERE RUBBING INTO THE WHEEL WELL.  IF I HADN'T NOTICED AND WE KEPT DRIVING MY FAMILY OR ANOTHER FAMILY COULD HAVE BEEN KILLED OR BADLY INJURED.  IT WAS FORTUNATE THAT THERE WAS STILL SOME DAY LIGHT LEFT WHEN I NOTICED THIS.  THE TRAILER WOULD HAVE COME APART ON THE HIGHWAY IF WE HAD CONTINUED DRIVING AT HIGHWAY SPEEDS.  THIS TRAILER IS LESS THAN THREE (3) YEARS OLD.  THIS HAS TO BE INDICATIVE OF UNSAFE MANUFACTURING.  FOREST RIVER, THEIR COMPANY COACHMEN AND LIPPERT ARE PRODUCING UNSAFE TRAVEL TRAILERS.  WE LITERALLY COULD HAVE HAD A BAD ACCIDENT IF I HADN'T NOTICED IN TIME.  MY INSURANCE COMPANY HAD TO TOTAL THE RV.",
        "vin": "5ZT2FEMB5GA"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083121,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "COACHMEN",
                "productModel": "FREEDOM EXPRESS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 COACHMAN FREEDOM EXPRESS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V782000 (EQUIPMENT). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER STATED THAT PARTS WERE UNAVAILABLE AND WAS NOT ABLE TO CONFIRM WHEN THEY WOULD BECOME AVAILABLE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    }
]