[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "08/22/2015",
        "fire": false,
        "manufacturer": "DS Corp - DBA Crossroads RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758968,
        "products": [
            {
                "manufacturer": "DS Corp - DBA Crossroads RV",
                "productMake": "CROSSROADS",
                "productModel": "SUNSET TRAIL",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A NEW 2016 CROSSROADS 240BI RECREATIONAL VEHICLE (RV)  FROM A DEALER IN VERMONT.THE SEWAGE TANK WAS HOOKED UP WRONG ALLOWING RAW SEWAGE TO SPILL OUT OF THE SEWAGE TANK AND INTO THE RV SHOWER AND ULTIMATELY ONTO THE GROUND OF A CAMPGROUND, STATE PARK OR HIGHWAY (DEPENDING ON THE LOCATION I WAS CAMPING.THE DEALER IS AWARE OF THE PROBLEM AND SCHEDULED THE REPAIR FOR ABOUT A MONTH AWAY, BUT INDICATED THAT IT WAS OK TO CONTINUE USING AND WAS NOT CONCERNED ABOUT THE RAW SEWAGE SPILLING. THE MANUFACTURER OF THE RV (CROSSROADS RV) ALSO AGREED THAT I CONTINUE USING THE RV EVEN THOUGH SEWAGE CONTAMINATION OCCURRED TO THE RV AND GROUND AND COULD OCCUR IN THE FUTURE.RV SEWAGE FROM A TOILET IS SUPPOSED TO GO INTO A SEALED BLACK TANK AND NOTHING ELSE IS PLUMBED TO IT, WHICH WOULD PREVENT CONTAMINATION FROM OTHER FIXTURES SUCH AS A SINK OR SHOWER.  IN MY CASE THE TOILET TANK WAS IMPROPERLY PLUMBED (BY ADMISSION OF THE MANUFACTURER), ALLOWING THE SEWAGE TO BACK UP INTO THE SHOWER AND OUT OF THE TRAILER WHILE TOWING. I FIRST LEARNED OF THE PROBLEM WHEN MY CHILDREN WERE TAKING A SHOWER AND THE THE TANK FILLED AND SEWAGE BACKED UP INTO THE SHOWER.  WHILE TOWING THE TRAILER RAW SEWAGE BACKED INTO THE SHOWER AND DRAINED ONTO THE ROAD AS WE WERE TOWING THE RV.  WHEN I SPOKE TO A TECHNICIAN FROM THE DEALER HE TOLD ME HE BELIEVED THIS WAS A MANUFACTURING MISTAKE MADE TO ALL OF THIS PARTICULAR MODEL IN THE PRODUCTION LINE.  HE TOLD ME THAT IF IT HAD A \"P\" TRAP IT SHOULD PREVENT OVERFLOW WHILE TOWING.  I TOOK A CHANCE AND HOPED HE WAS RIGHT AND TOWED IT HOME TO THE DEALER CLEAN OUT STATION.  WHEN I ARRIVED NEAR HOME I DISCOVERED RAW SEWAGE WAS LEAKING OUT OF THE RV FROM THE SHOWER PAN. I CONTACTED THE PRESIDENT OF CROSSROADS RV TO INFORM HIM OF THE PROBLEM AND HE HAD THE REGIONAL SALES MANAGER CALL ME TELLING ME THEY WOULD REPAIR THE DEFECT. I WOULD WELCOME ANY GUIDANCE.",
        "vin": "4V0TC2421GE"
    }
]