[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "02/27/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455058,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Check Engine light came on. Code states P0440 Evaporative Emission Systems. However, i looked to see if recall was issued for my vehicle and it states a recall was issued for this but not my vehicle vin number.",
        "vin": "1C4RDHAG0GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "01/25/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450926,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Dodge Durango. The contact stated that he discovered an oil leak in the engine after the check engine warning light illuminated. The contact had taken the vehicle to a dealer where they diagnosed the vehicle with a defective vapor canister purge valve and valve cover gasket. The vehicle was repaired; however, the oil leak failure persisted. The contact took the vehicle back to the dealer where the vehicle was then diagnosed with a defective motor mount; the service mechanic suggested both motor mounts be replaced. The manufacturer had yet to be notified of the failure. The vehicle had yet to be repaired and remained in the possession of the dealer. The failure mileage was approximately 124,000.",
        "vin": "1c4rdhag8gc"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443486,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The car will just turn off, requiring it be placed in park and restarted.",
        "vin": "1c4rdhdg4gc"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "11/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11439842,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Dodge Durango. The contact stated that his daughter was in the passenger seat when she activated the push start button and the vehicle rolled backward while in the park position. The contact's daughter got out of the vehicle midway while it was rolling backward and sustained scrapes to her knees and elbows. The vehicle crashed into the neighbor's garage door. The rear windshield was shattered, and the rear fender and liftgate were damaged. No medical attention was received. A police report was filed. The vehicle was towed to the dealer. The vehicle was not diagnosed or repaired. The vehicle remained at the dealer. The manufacturer was made aware of the failure and a case was opened. The manufacturer informed the contact that they would reach out in 4 days. The failure mileage was 77,800.",
        "vin": "1c4rdheg7gc"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/19/2021",
        "dateOfIncident": "09/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433548,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "3 malfunctions within a month time frame. The car will start and run normally. Then it will suddenly come to a halt because the engine will continue to run but the transmission knob will not be able to move, and the entire electrical panel lights up. Repeated attempts to use the push button start to unlock the transmission knob and be able to start car fail.  This has happened 2 of the 3 times on major roadways in traffic. PD was called for last incident. The car has been to the dealer 3 times, dealer is unable to replicate problem and unable to pull codes from computer every single time. Vehicle has been inspected by dealer every single time. No warning lights or lamp or messages have appeared prior to this issue.  The last incident - as described on major roadway - my children were in vehicle. This is a complete and dangerous issue, still not being addressed. The car had come to a light, stopped, the auto engine had kicked in, and when time to move, the entire panel lit up and transmission knob locked once again.",
        "vin": "1C4RDHEG5GC"
    },
    {
        "components": "ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433264,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My car showed all kinds of notices on the screen and was not turning on correctly and shaking while driving or standing. I took it to the dealer and was told my entire engine will have to be replaced due to oil sludge on the engine and this will cost be around $9000. I’ve been researching and it seems this tends to happen a lot to dodge car engines. My car has under 60,000 miles.",
        "vin": "1C4SDJCT8GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432375,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Portions of the rear LED taillight have shorted out due to water accumulation in the housing",
        "vin": "1C4SDJCT5GC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/18/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429563,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Very common cylinder 2 misfire. Replaced all spark plugs and the cylinder two ignition coil. Replaced upper and lower intake gasket seals, replaced the fuel injector. Still having issues with misfire. Wiring is all correct - pumps and valves are right. It must be a broken head and this is a known issue with previous years of Chrysler engines that have had recalls. This is an expensive fix and dangerous if not fixed. It is not fair to the consumer that Chrysler has still yet to fix such issues after prior years have been recalled, and yet they don’t recall the 2016 pentastar 3.6L. I am requesting this be looked into and recalled for I am one of many who are encountering this serious issue that will inevitably cause wrecks.",
        "vin": "1C4rdjdg2gc"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426712,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My wife was driving down the road when out of no where her headrest just deployed slamming into the back of her head. After examining the headrest it was clear that a plastic piece had deteriorated causing the headrest to release.",
        "vin": "1c4rdjag4gc"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425103,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Dodge Durango. The contact stated while driving at various speeds, he noticed that the driver’s side headlight would appear dim and would sometimes not illuminate. The contact was relating the failure to corrosion with the connector of the wire and the bulb. The contact stated no warning light was illuminated. The vehicle was not taken to a local dealer nor independent mechanic to be diagnosed. The vehicle was not repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 56,000.",
        "vin": "1C4RDJEG5GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414074,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ALTERNATOR HAS A MAJOR MALFUNCTION CAUSING A ALL SYSTEMS FAILURE. AFTER GOING TO MULTIPLE CERTIFIED DODGE MECHANICS THIS ISSUE IS STILL UNRESOLVED.",
        "vin": "1C4RDJDG6GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407254,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RACE TRACK LIGHTING TAKING IN WATER.  AFTER RESEARCHING THIS - LOOKS LIKE DURANGO MODELS 2014-20 ALL HAVE THIS PROBLEM.  DODGE DOES NOT TAKE RESPONSIBILITY FOR THIS- THIS IS HAPPENING TO THOUSAND AND THOUSANDS AND THOUSANDS OF PEOPLE.  DODGE TAKING ADVANTAGE OF THEIR CONSUMERS.  DODGE CONTINUALLY PUTS THIS FAULT PART ON THEIR DURANGOS.  THERE SHOULD BE A RECALL ON THIS PART- THEY SHOULD FIX THE PARTS AND THEY SHOULD FIX THE PROBLEM.  IS REALLY SAD THAT SO MANY ARE BEING TAKEN ADVANTAGE OF.  EVERYONE IN DODGE IS AWARE OF THIS- YET THEY WOULD RATHER MAKE MILLIONS AND MILLIONS OFF THEIR CONSUMERS.  IT IS UNACCEPTABLE!  PLEASE HELP. - I WORK HARD FOR MY MONEY I SHOULD NOT HAVE TO CONTINUALLY PAY OUT FOR A FAULTY PART THAT DODGE IS AWARE OF.",
        "vin": "1CARDJEG1GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403752,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURANGO STALLED IN MIDDLE OF INTERSECTION. UNABLE TO START AND VEHICLE WAS TOWED TO LOCAL MECHANIC. MECHANIC STATED THE ISSUES INVOLVES THE ALTERNATOR AND IT HAS AFFECTED THE BATTERY AND WE ARE STILL WAITING TO SEE IF THE PCM WAS AFFECTED. MECHANIC ADVISED ME THAT HE WORKED ON THE SAME YEAR CHRYSLER AND HAD THE SAME EXACT ISSUE, BUT THE ALTERNATOR IN THAT MODEL WAS RECALLED. I HAVE SEEN SEVERAL OTHER ALTERNATOR ISSUES SIMILAR TO MINE WHEN SEARCHING THE INTERNET AND AM WONDERING WHY HAVEN'T THESE ALTERNATORS BEEN RECALLED IF ANOTHER VEHICLE MADE BY CHRYSLER HAS A RECALL BUT THE DURANGO DOES NOT.     VEHICLE WAS DRIVING AT LOW SPEEDS UP TO AN INTERSECTION AND ONCE STOPPED, IT SHUT OFF. ORIGINALLY THOUGHT IT WAS THE AUTO START/STOP, BUT ENGINE DID NOT ENGAGE AND POWER STEERING WAS ALSO OUT. UNABLE TO START THERE AFTER.",
        "vin": "1C4RDJDG7GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396320,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHT THAT RUNS ACROSS THE BACK OF THE TRUCK (RAIL LIGHT) CUTS ON AN OFF DUE TO WATER THAT IS INSIDE THE LIGHT DUE TO O A MANUFACTURING PROBLEM. THE CASE THAT THE LIGHT IS IN HOLD MOISTURE. IT SHORT THE LIGHT OUT AND IT ALSO CAN START A FIRE. I ALMOST GOT HIT BY AN 18 WHEELER TRUCK AT NIGHT BECAUSE THE LIGHTS WENT OUT ON THE BACK WITH OUT ME KNOWING IT. MY 4 CHILDREN AND I COULD'VE DIED. PLEASE LOOK INTO THIS.  THERE ARE SEVERAL MODELS WITH THIS PROBLEM.",
        "vin": "1C4RDHAG9GC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "03/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 DURANGO LIFTGATE HAS WATER DAMAGE ON THE LEFT SIDE WITHIN 2 YEARS OF IT BEING PURCHASED BRAND NEW. I CALLED DODGE AND THEY ADVISED ME THAT THE CAR WAS OUT OF WARRANTY, BY LESS THAN 500 MILES.  I RECENTLY PURCHASED A 2019 DURANGO LIFTGATE FROM EBAY BECAUSE MOPAR HAS A NATIONWIDE SHORTAGE ON THIS ITEM AND WITHIN 60 DAYS IT HAPPENED AGAIN BUT THIS TIME ON THE RIGHT SIDE. MOPAR IS MANUFACTURING THIS LIFTGATE TO GAIN PROFIT, BECAUSE THEY KNOW THAT THIS WILL CONTINUE TO HAPPEN. THEY ARE NOT HELP TO CUSTOMER WHO ARE A VICTIM OF THEIR DEFECTIVE PRODUCT.",
        "vin": "1C4RDJDG4GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389362,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TRACK LIGHTING FOR RUNNING LIGHTS IS BURNING OUT DUE TO WATER INTRUSION. THE ENTIRE UNIT WILL FAIL FROM THE WATER. VERY COMMON ISSUE WITH THESE DODGES. NO POSSIBLE FIXES OTHER THAN REPLACING UNITS AND THE COST IS REALLY HIGH.",
        "vin": "1C4SDJCT9GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389248,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER HAS LEAKED INTO THE \"RACE TRACK LIGHTING\" ON THE LIFT GATE. THIS IS FROM NORMAL, EVERYDAY DRIVING USE AND CARE. THE LIFT GATE TAIL LIGHTS, AS WELL AS LICENSE PLATE LIGHTING NO LONGER FUNCTION. THIS MAKES MY VEHICLE DANGEROUS, AND ILLEGAL TO DRIVE AT NIGHT. I HAVE READ ON MULTIPLE DODGE DURANGO FORUMS THAT THIS IS A COMMON PROBLEM, AND ONE DODGE DEALER I SPOKE TO SAID THEY SEE THIS ALL THE TIME. THE PART ALONE TO FIX THE PROBLEM IS QUOTED AT $1000 BEFORE TAX. TO ME, IT IS CRAZY THAT IT COSTS THIS MUCH SIMPLY TO MAKE MY VEHICLE LEGAL AGAIN, ESPECIALLY WHEN IT IS A COMMON ISSUE ACCORDING TO MY RESEARCH. I FEEL THAT DODGE SHOULD ISSUE A RECALL, AS THIS IS A COMMON PROBLEM, IT'S A SAFETY, AND LEGAL ISSUE, AND IT IS SO EXPENSIVE TO FIX. I BOUGHT A NEWER VEHICLE TO NOT HAVE PROBLEMS, AND IT IS HARD TO BE ABLE TO AFFORD SUCH AN EXPENSIVE FIX WHEN ALL I AM TRYING TO DO IS MAKE MY VEHICLE LEGAL TO DRIVE AGAIN. DODGE NEEDS TO DO THE RIGHT THING, AND TAKE CARE OF THIS PROBLEM THAT HAS PLAGUED MANY OF ITS LOYAL CUSTOMERS.",
        "vin": "1C4RDJDG9GC"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388500,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK EXCELS WHILE AT A STOP LIGHT WHERE YOU MUST BREAK AGAIN.THE TRUCK THE EMERGENCY BREAK FORWARD AND REAR HAS ACTIVATED WHILE IN MOTION. I TOOK THIS TRUCK TO MEINEKA CAR CARE IN JOLIET IL FOR A TIRE AND BREAKS TO BE LOOKED AT WHILE THEY TEST DROVE THE TRUCKTHEY INSTANTLY SAID THE TRUCK WAS DANGEROUS BECAUSE IT TOOK OFF WHIE THE M ALSO DOING A TEST DRIVE . I HAVE COMPLAINED TO THE DEALERSHIP AND DODGE. I WAS PULLING IN THE DRIVEWAY AND PUT THE CAR IN DRIVE TO PULL INTO THE GARAGE AND IT JERKED HITTING TE GARAGE. TOOK THE TRUCK IN FOR A WHEEL ALIGNEMENT AND COULDNT DRIVE BACK WAS TOLD TO SEND CAR TO DEALERSHIP",
        "vin": "1C4SDJCT2GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387222,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A YEAR AGO, THE PASSENGER SIDE HEAD LIGHT STARTED MALFUNCTIONING. IT WOULD TURN ON AND THEN TURN OFF WITHOUT TRIGGERING A WARNING OR ANNOUNCEMENT OF THE OUTAGE. I REPLACED IT AT A COST OF ABOUT $400. NOW, THE DRIVER'S SIDE HEADLIGHT IS HAVING THE SAME FAILURE WITHOUT THERE BEING A WARNING OR ANNOUNCEMENT OF THE ISSUE AND I'M HAVING TO SPEND ANOTHER $400 TO GET IT REPLACED. IT IS CLEARLY A DEFECTIVE PART AND I'M FURIOUS THAT THESE LIGHTS ARE SO COSTLY TO REPLACE. I THOUGHT LEDS WERE SUPPOSED TO BE MUCH LONGER LASTING.     I DON'T WANT TO GET PULLED OVER FOR HAVING A HEADLIGHT OUT. DODGE NEEDS TO HAVE A RELIABLE AND SAFE PRODUCT. THIS IS SAFETY ISSUE.",
        "vin": "1C4SDJET3GC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "09/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366958,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2016 DODGE DURANGO LIMITED, MY CHECK ENGINE LIGHT CAME ON, THEN THE (ABS) LIGHT CAME ON AND THEN MY BATTERY LIGHT CAME ON. EVERY LIGHT ON THE DASH AND SYSTEM WARNING WAS LIT UP. THEN THEY STARTED FLICKERING AND THEN THE VEHICLE DIED RIGHT IN THE MIDDLE OF A BUSY CITY ROAD DURING PEAK TRAFFIC. I HAVE REPLACED THE BATTERIES THINKING THAT MAY HAVE SOMETHING TO DO WITH IT. I HAVE HAD THE ALTERNATOR CHECKED AND IT IS GOOD. I HAD TO GET IT TOWED TO MY HOUSE AND HAS BEEN SITTING EVER SENSE WITH NO POWER. I DON'T KNOW WHAT THE ISSUE IS, BUT FOR A CAR TO DIE IN THE MIDDLE OF THE ROAD DURING PEAK TRAFFIC IS COMPLETELY UNSAFE AND UNACCEPTABLE. PLUS I HAD ONLY HAD THE CAR FOR 2 MONTHS",
        "vin": "1C4RDHDG5GC"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367104,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE REVERSING TURNING THE STEERING WHEEL, THE LOWER CONTROL ARM BROKE CAUSING THE TIRE TO COME OFF AND CAUSING A COLLISION.",
        "vin": "1C4RDHAG7GC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362368,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TURNS OFF WHILE DRIVING. THE IGNITION BUTTON GOES TO ACC. THE CLUSTER BOARD THEN SAYS TO PRESS BRAKE AND PUT VEHICLE IN PARK. THIS IS HAPPENING MORE OFTEN IT WAS PERIODICALLY BUT NOW HAPPENING ON EVERY TRIP.",
        "vin": "1C4RDHDG5GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350163,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TAILLIGHTS HAVE A SHORTAGE WITH WATER IN IT AND MY TAILLIGHT ISN'T FLUSHED WITH THE BODY OF MY VEHICLE. GOT PULLED OVER BY LOUISIANA STATE POLICE BECAUSE OF LIGHT FLICKERING OFF AND ON.",
        "vin": "1C4SDHCTXGC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/25/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341403,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAME HOME AND PULLED INTO OUR DRIVEWAY.  I PUT OUR DODGE DURANGO 2016 IN PARK POSITION AND I THEN OPENED OUR GARAGE DOOR HALFWAY OPEN. I WALKED UNDER THE DOOR AND WENT INTO THE HOUSE TO GET MY WALLET OUT OF MY PANTS WHICH I WAS WEARING EARLIER. IT WAS A COUPLE MINUTES LATER WHEN MY WIFE AND I HEARD A BIG BANG. WE BOTH RAN OUT TO THE GARAGE AND SAW THE 2016 DODGE DURANGO SUV HALFWAY INTO THE GARAGE. THE GARAGE DOOR WAS STOPPING THE SUV FROM GAINING SPEED AND COMING INTO THE HOUSE. IT DAMAGE OUR GARAGE DOOR SIGNIFICANTLY AND PUT SCRATCHES ON OUR SUV HOOD AND WINDSHIELD. LUCKILY THE GARAGE DOOR STOPPED IT OTHERWISE IT WOULD'VE BROKEN DOWN THE WALL AND COULD'VE RAN OVER ONE OF OUR CHILDREN OR US OR DONE SO MUCH DAMAGE.  MY GARAGE DOOR IS DAMAGED IN OUR SUV IS SCRATCHED UP AND FORTUNATELY IT'S NOT OUR LIFE THAT WAS HURT.  AS FAR AS THE ENGINE IS CONCERNED WE HEAR A KNOCKING WHEN WE PRESS THE GAS AT FIRST. BETWEEN FIRST AND SECOND GEAR AS WELL.. SOUNDS LIKE A LIFTER OR SIMILAR IS GOING OR ARE BAD",
        "vin": "1C4RDHAG6GC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2020",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341406,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 06/2018 I CAME HOME AND PULLED INTO OUR DRIVEWAY.  I PUT OUR DODGE DURANGO 2016 WITH 21110 MILES IN THE PARK POSITION AND I THEN OPENED OUR GARAGE DOOR HALFWAY OPEN. I WALKED UNDER THE DOOR AND WENT INTO THE HOUSE TO GET MY WALLET OUT OF MY PANTS WHICH I WAS WEARING EARLIER. IT WAS A COUPLE MINUTES LATER WHEN MY WIFE AND I HEARD A BIG BANG. WE BOTH RAN OUT TO THE GARAGE AND SAW THE 2016 DODGE DURANGO SUV HALFWAY INTO THE GARAGE. THE GARAGE DOOR WAS STOPPING THE SUV FROM GAINING SPEED AND COMING INTO THE HOUSE. IT DAMAGE OUR GARAGE DOOR SIGNIFICANTLY AND PUT SCRATCHES ON OUR SUV HOOD AND WINDSHIELD. LUCKILY THE GARAGE DOOR STOPPED IT OTHERWISE IT WOULD'VE BROKEN DOWN THE WALL AND COULD'VE RAN OVER ONE OF OUR CHILDREN OR US OR DONE SO MUCH DAMAGE.  MY GARAGE DOOR IS DAMAGED IN OUR SUV IS SCRATCHED UP AND FORTUNATELY IT'S NOT OUR LIFE THAT WAS HURT. AS FAR AS THE ENGINE IS CONCERNED WITH YOU A KNOCKING WHEN WE PRESS THE GAS AT FIRST. BETWEEN FIRST AND SECOND GEAR. SOUND LIKE A LIFTER IS GOING OR ARE BAD",
        "vin": "1C4RDHAG6GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330207,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLED ON ME IN THE MIDDLE OF AN INTERSECTION. I ALMOST GOT HIT BY AN 18 WHEELER. IT WOULD NOT MOVE, ALL KINDS OF THINGS STARTED GOING OFF ON THE DASH AND CODES . WE HAD TO PULL THE GEAR SHIFT RELEASE TO GET IT IN N TO PUSH IT OUT OF THE ROAD. IT LOST ALL POWER AND WOULDN'T EVEN START HAD TO JUMP IT OFF AND REPLACED THE BATTERIES STILL NOTHING, ALTERNATOR AND EVERYTHING ELSE TESTED GOOD. NO IDEA WHAT'S GOING ON AND THE DEALERSHIP HAS BEEN NO HELP! I HAVEN'T EVEN HAD THIS CAR FOR 30 DAYS YET. I HAVE VIDEO I CAN SEND OF WHAT IT'S DOING.  *TR",
        "vin": "1C4RDHDGXGC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "04/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321781,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKS WHILE DRIVING, USUALLY MAKING A LEFT LANE CHANGE OR TURN. THIS OCCURS MULTIPLE TIMES EVEN ON SHORT TRIPS (LESS THAN 10 MILES). NO WARNING LIGHTS",
        "vin": "1CRSDHCT3GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/08/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320510,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE USED IN 2018, WITH LESS THAN 30K MILES ON IT.  IT CURRENTLY HAS AROUND 48K MILES ON IT, AND THE RACETRACK LED TAIL LIGHT BAR HAS WATER IN IT, CAUSING PART OF THE BAR TO GO OUT.  THERE ARE A TON OF PEOPLE WITH THIS SAME ISSUE - FCA NEEDS TO ADDRESS IT AND NOT EXPECT THEIR CUSTOMERS TO SHELL OUT AROUND $1200 TO FIX THEIR FAULTY DESIGN.",
        "vin": "1C4RDHAG7GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310583,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TAIL LIGHT THAT RUNS ALL THE WAY ACROSS ON THE BACK LEAKS.  I'VE ALREADY THIS REPLACED ONCE WHEN IT WAS STILL UNDER WARRANTY BECAUSE BUGS GOT IN THERE.  NOW THIS KEEPS MOISTURE, I CONSTANTLY HAVE TO FIND WAYS TO DRAIN THIS OR IT WOULD MAKE THE LIGHTS GO OUT.  I FEEL LIKE THIS IS UNACCEPTABLE,  BECAUSE IT SEEMS TO BE HAPPENING ON EVERY VEHICLE THAT HAS THESE LIGHTS.  I BOUGHT THIS VEHICLE BRAND NEW, I DIDN'T EXPECT AFTER ONLY A YEAR OF HAVING I WOULD COME ACROSS THIS PROBLEM.  THIS SHOULD BE A RECALL!",
        "vin": "1C4RDHAG6GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "12/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306668,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TAIL LIGHTS HAD MOISTURE IN THEM AFTER BUYING THE CAR. DEALER STATES DODGE WOULD NOT REPLACE THEM UNDER WARRANTY SO THE DEALER DRILLED HOLES TO HELP THE MOISTURE DRAIN. NOW THE REAR TAIL LIGHTS HAVE POOLING WATER IN THEN ABOUT A 1/4 OF THE LIGHT IS FILLED. REAR TAIL LIGHTS/BRAKE LIGHTS STILL WORK FOR NOW. LED RACETRACK LIGHTING THAT GOES ALL AROUND THE REAR LIGHTS IS BLOWING OUT DUE TO THE WATER GETTING INTO IT. PER THE DEALER DODGE WILL NOT REPLACE IT EVEN THOUGH IT'S A KNOWN DEFECT WITH THIS LIGHTING AND THE WATER GETTING INTO IT. I WILL HAVE TO PAY APPROXIMATELY $1200 TO HAVE IT REPLACED.",
        "vin": "1C4RDJDG8GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299757,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACETRACK LIGHTING ON THE BACK OF THE VEHICLE FILLED WITH WATER AND BURNED OUT SEVERAL LED LIGHTS. IT WAS STILL UNDER WARRANTY AND REPLACED AT NO CHARGE.  ONCE I WAS OVER 36,000 MILES, THE SAME THING HAPPENED WITH THE NEW PART THE DEALER INSTALLED. I CALLED DEALER SINCE 5 MONTHS LATER AFTER THE NEW INSTALLATION, THE SAME THING HAPPENED.  IT IS OBVIOUSLY A DEFECTIVE PART AND SHOULD BE REPLACED AT NO FEE.",
        "vin": "1C4RDJAG6GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298978,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "5TH TIME EVENT HAS OCCURRED.  AFTER EXTENDED DRIVING WHEN PULLING INTO A PARKING  SPOT THE VEHICLE WILL COMMENCE TO ACCELERATE.  ONLY BY AGGRESSIVELY APPLYING THE  BRAKE TO PREVENT THE VEHICLE FROM PLOWING AHEAD CAN I PLACE THE TRANSMISSION INTO PARK AND TURN OFF THE VEHICLE.  CHRYSLER PREVIOUSLY ACKNOWLEDGED CRUISE CONTROL PROBLEMS.  I THINK THE PROBLEM STILL EXISTS.  THIS IS A DANGEROUS VEHICLE.  PREVIOUS FILE NUMBER #10916715.",
        "vin": "1C4RDJEG4GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297917,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT A STOP LIGHT, THE ENGINE SHUT DOWN COMPLETELY. I HAD TO SHIFT TO PARK AND RESTART THE TRUCK, THEN SHIFT TO DRIVE. THIS HAPPENED AT LEAST TWICE.",
        "vin": "1C4RDJDG6GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297535,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LED RACE TRACK STYLE LIGHT BARS, WHICH ARE THE TAILLIGHTS FOR DODGE VEHICLES EQUIPPED WITH THEM, ARE DEFECTIVE IN DESIGN; SUCH THAT THEY ARE NOT SEALED PROPERLY TO PREVENT WATER INTRUSION. THE LED LIGHT BARS ALLOW WATER TO POOL IN THE BOTTOM OF THEM CAUSING THE LIGHTS TO GO OUT. NEEDLESS TO SAY, SINCE THIS IS THE TAILLIGHT SYSTEM FOR THE VEHICLE, IT POSES A GRAVE SAFETY RISK. ADDITIONALLY, DODGE DOES NOT CONSIDER 'SEALS' PART OF THEIR WARRANTY COVERAGE WHEN YOU TRY TO HAVE IT REPAIRED THROUGH THAT CHANNEL. I WOULD THINK DRIVING AROUND WITH DEFECTIVE WATER LEAKING AND SOON TO BE MALFUNCTIONING TAILLIGHTS WOULD BE A BIGGER SAFETY RISK IN THE EYES OF DODGE; HOWEVER, THEY SEEM TO THINK TELLING ME THEY CAN ORDER ME A NEW ONE FOR $1,200 WHEN IT LEFT THE FACTORY DEFECTIVE IN DESIGN IS AN APPROPRIATE REMEDY.",
        "vin": "1C4SDJCT5GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292538,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACETRACK LED LIGHTING ON THE BACK OF THE VEHICLE KEEPS BURNING OUT.  THE LIGHT ASSEMBLY HOLDS WATER AND IT JUST POOLS UP INSIDE THE PLASTIC ASSEMBLY, EVENTUALLY BURNING THE LED'S OUT.  HAVE HAD REPLACED WHILE UNDER WARRANTY, PROBLEM OCCURRED ALMOST IMMEDIATELY AGAIN.  NO LONGER UNDER WARRANTY, AND NOW RESPONSIBLE FOR THE REPAIR, DEALER KNOWS ITS AN ISSUE.",
        "vin": "1C4RDJDG9GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/31/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292246,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER SECTION OF REAR VEHICLE LIGHTING FAILED.  LEAVING INADEQUATE REAR LIGHTS.",
        "vin": "1C4RDJDG5GC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/08/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291825,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM THE STORE ON DEC 8TH 2019. WHEN I WENT TO MAKE A LEFT ONTO MY STREET, MY WHEEL LOCKED UP AND I HIT THE CURB AT A LOW RATE OF SPEED. A WARNING CAME ON THAT SAID \"POWER STEERING UNAVAILABLE\"  (SEE PICTURE)",
        "vin": "1C4RDHDGXGC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291639,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LED TAILLIGHTS KEEP GETTING WATER INSIDE THEM CAUSING THE LIGHTS TO SLOWLY GO OUT. THIS WILL CAUSE A SAFETY ISSUE OVER TIME. ALSO WILL CAUSE AN ACCIDENT. I FEEL THAT DODGE DIDN'T DO A GOOD JOB AT SEALING THE LIGHTS. BY LOOKING AT THE PICTURES YOU WILL SEE WHAT I MEAN BY THE WATER. I HAVE DRAINED THE WATER SEVERAL TIMES BY REMOVING A BOLT.",
        "vin": "1C4RDJDG4GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291663,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKS INTO AND POOLS IN REAR TAIL LIGHTS/BRAKE LIGHT CAUSING THEM TO FAIL. RESEARCH HAS FOUND THIS TO BE A COMMON PROBLEM.",
        "vin": "1C4SDHCT9GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288829,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE DRIVING 70 MPH, THE VEHICLE BEGAN TO LOSE POWER AND THE SERVICE POWER STEERING, SERVICE ELECTRIC STABILITY, AND CONTROL SERVICE AIR BAG WARNING INDICATORS ILLUMINATED. THE CONTACT VEERED TO THE SHOULDER OF THE ROAD AND THE VEHICLE SHUT OFF. THE CONTACT WAS ABLE TO PLACE THE GEAR IN PARK, BUT IT DID NOT RESUME NORMAL OPERATION. THE VEHICLE WAS TOWED TO MOSS MOTOR COMPANY (1000 S CEDAR AVE, SOUTH PITTSBURG, TN 37380, (423) 837-7114), BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE AND WERE STILL WORKING ON THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED CASE NUMBER: [XXX]. THE CONTACT MENTIONED THAT THE STABILITY CONTROL SYSTEM WAS UPDATED APPROXIMATELY A YEAR AGO AT THE SAME DEALER. THE FAILURE MILEAGE WAS APPROXIMATELY 105,000.*DT  CONSUMER STATED VEHICLE WAS CONSIDERED A LEMON.    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "1C4RDHDG1GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287049,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2016 DODGE DURANGO TO AN INDEPENDENT GARAGE (NO LONGER UNDER WARRANTY) BECAUSE THE BOOSTER DEVELOPED A VACUUM LEAK INSIDE UNDER THE DASH. AFTER REMOVAL, WE FOUND THE BOOSTER WAS FILLED WITH WATER. I FOUND A RECALL FOR EARLIER YEAR DODGE DURANGOS FROM 2011-2014 WITH A SIMILAR ISSUE (SAFETY RECALL T59 / NHTSA 17V-572), AND THE FIX WAS TO INSTALL A SHIELD TO PROTECT WATER FROM ENTERING. MY BOOSTER ALREADY HAD THIS SHIELD AND WAS INSTALLED CORRECTLY, YET IT STILL FILLED WITH WATER. I PURCHASED THIS VEHICLE USED IN AUGUST 2019, SO I HAVE NO SERVICE HISTORY AVAILABLE. IN ADDITION TO THE PICTURES, I ALSO TOOK A VIDEO SHOWING THE WATER, PLEASE SEE THIS LINK: HTTPS://YOUTU.BE/5BD3JWUNFE4",
        "vin": "1C4SDJCT7GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286562,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT RAINS WATER IS COLLECTING IN THE BACK TAILGATE LIGHT.  THERE NEEDS TO BE A RECALL TO FIX THIS PROBLEM.  APPARENTLY, I AM NOT THE ONLY ONE HAVING THIS PROBLEM.",
        "vin": "1C4RDHEG5GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286749,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACING TAILLIGHTS ARE NOT SEALED WELL ENOUGH. WATER IS GETTING INTO THE LIGHT. IT WILL CAUSE PART OF LIGHT TO GO OUT.",
        "vin": "1C4RDJDG8GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/01/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKS INTO THE RACETRACK LIGHTING AND POOLS CAUSING BURNOUT OF LED LIGHTING.   THIS RESULTS IN REDUCING VISIBILITY OF THE VEHICLE DUE LACK OF LIGHTING AT NIGHT.  THIS IS A COMMON ISSUE WITH MULTIPLE DODGE DURANGO'S.",
        "vin": "1C4RDJAG3GC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11281321,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 DODGE DURANGO. WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT FELL ASLEEP AND CRASHED INTO A  UTILITY POLE. THE VEHICLE NOSEDIVED INTO A DITCH. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUSTAINED A FRACTURED BACK. THE CONTACT'S WIFE SUSTAINED THIRD DEGREE BURNS TO THE RIGHT SIDE AND BACK. THE CONTACT'S SON SUSTAINED A WHIPLASH. EVERYONE RECEIVED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE POLICE TOWED THE VEHICLE TO AN UNKNOWN LOT. THE CONTACT'S INSURANCE COMPANY WAS CONTACTED, SENT OUT AN ADJUSTER, AND DEEMED THE VEHICLE A TOTAL LOSS. THE DEALER AND MANUFACTURER WERE MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 63,000.*DT*JB",
        "vin": "1C4RDJDG1GC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277369,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS HEADREST DRIVER SIDE TRIGGERED WHILE VEHICLE WAS EMPTY SITTING IN DRIVEWAY.  RETAINING CLIPS BROKEN AND DAMAGED.  IN PROCESS OF GETTING PLAZA DODGE IN ORANGEBURG SC TO LOOK AT THE PART AND MAKE RECOMMENDATIONS AND THEY ARE GOING TO CONTACT FCA.",
        "vin": "1C4RDJAG8GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2019",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269751,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING AT WALMART PARKING LOT PUT MY CAR ON REVERSE AND THE CAR ROLL FORWARD AND THE SHIFT KNOB WAS BLINKING. THEN PUT THE CAR IN PARK AND THEN REVERSE AND STILL BLINKING AND AT THE SECOND TIME WHEN I PUT IT ON REVERSE IT WORK. THAT THE SECOND TIME THAT SOMETHING LIKE THAT HAPPENED. FIRST AT A RED LIGHT ON A HILL CAR WAS ON DRIVE AND ROLL BACK AND THE SHIFT KNOB WAS BLINK. AND I DID THE SAME THING AT WHEN IT DIDNT GO ON REVERSE. I WHEN TO A DODGE DEALER PAY FOR A DIAGNOSTIC AND THEY DIDN'T FIND ANYTHING THE FIRST TIME THAT HAPPEN.",
        "vin": "1C4RDJAG1GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268023,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS WINTER WE HAD A LOT OF SNOW. AS THE SNOW MELTED, WATER GOT INTO THE TAILGATE LIGHT ASSEMBLY. NOW THE BOTTOM OF THE LIGHT WERE WATER HAS SETTLED IS OUT. I'VE NOTICED A LOT OF OTHER DURANGO'S. 2016 AND UP WITH THE SAME ISSUE. EITHER ON ONE SIDE OR BOTH LIKE MINES. WHEN I RAISE THE TAILGATE WATER DRAINS OUT BUT NOT COMPLETELY. THERE ARE NO VISIBLE CRACKS IN THE TAILGATE BACKUP LIGHT OR DAMAGE IN ANYWAY. I WAS CURIOUS TO SEE IF ANYONE ELSE HAS REPORTED THIS ISSUE. AS I SAID I NOTICED A LOT OF VEHICLES ON THE ROAD LIKE MINES, WITH THIS PROBLEM THE LIGHT HAS NOT GONE OUT BUT MAY CAUSE AN ELECTRICAL SHORT CREATING ANOTHER PROBLEM OR FAIL WHILE DRIVING RESULTING IN A UNWANTED TICKET. VEHICLE WAS STATIONARY AT THE TIME. AND WHEN I DROVE OFF MY HUSBAND SAW THE TOLD ME. ANY INFO ON WHAT CAUSED THIS WOULD BE HELPFUL. AS I AM NOT SURE IF THE SEALS FAILED TO KEEP THE WATER OR MOISTURE OUT.",
        "vin": "1C4RDJDG7GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257385,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CENTER TAIL LIGHT HOUSING LEAKED WATER INSIDE AND MADE THE LIGHTS TO SHORT OUT AND QUIT WORKING.",
        "vin": "1C4RDHDG3GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243436,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DOWNSHIFTING FROM 2ND TO 1ST GEAR, TRANSMISSION DOES NOT SHIFT SMOOTHLY.  EXHIBITS A JOLT FORWARD, ESPECIALLY WHEN COMING TO A FULL STOP.  ISSUE OBSERVED FOR SEVERAL MONTHS.  ISSUE WAS RAISED TO THE DODGE DEALERSHIP SERVICE TECHNICIANS OVER THE COURSE OF SEVERAL VISITS AFTER EXPERIENCE THE RECURRING ISSUE.  VEHICLE HAS BEEN IN SHOP FOR OVER 4 WEEKS, NO RESOLUTION. SERVICE REPS HAVE OBSERVED THE ISSUE AS WELL.  SERVICE TECHNICIAN REFERRED TO IT AS \"BUMP STOP\".   IT IS A CONSISTENTLY NOTICEABLE JOLT MOST TIMES WHEN DOWNSHIFTING TO 1ST GEAR, ESPECIALLY ON CITY STREETS WHEN APPROACHING A STOP SIGN OR RED LIGHT.THE TECHNICIANS CONTINUE TO TRY AND RESET THE COMPUTER PROGRAM AND RUN DIAGNOSTICS BUT NOTHING SEEMS TO BE RESOLVING THE ISSUE.",
        "vin": "1C4SDJCT4GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242907,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED WATER MADE ITS WAY INTO LED TAILLIGHT HOUSING AFTER OPENING LIFT GATE. WATER WAS VISIBLY DRAINING. VEHICLE WAS STATIONARY. AFTER DRAINING WATER BY REMOVING BOLT, THE LED HAS A ROUGHLY 6 INCH DARK SPOT WHERE THE WATER WAS RESTING. ITS A WIDESPREAD ISSUE WITH 2014+ DODGE DURANGOS AND REPLACEMEBT PARTS ARE $1,100.00. A RECALL SHOULD BE ISSUED FOR THIS ISSUE.",
        "vin": "1C4RDJDG9GC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232613,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR SMALL PANEL NEXT TO DOOR HANDLE CAME UNGLUED AND SNAPPED OFF ONTO VEHICLE BEHIND ME AND HIT VEHICLE BEHIND ME. THIS IS A FACTORY DEFECT ON GLUE AND SNAP IN INSERTION, AS PICTURE SHOWS, NOTHING ABRUPTED THIS PART, IT JUST FLEW OFF NEARLY HURTING SOMEONE. I WANT THIS PART REPLACED AS VEHICLE IS ONLY 2 AND A HALF YEARS OLD. PLEASE ADVISE NEXT STEPS .",
        "vin": "1C4RDHAG8GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229995,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HARD DOWNSHIFT FROM 2ND TO 1ST GEAR AND VEHICLE LURCHES FORWARD WHEN COMING TO A STOP AND FROM 4TH TO 5TH GEAR AT TIMES WHILE UP SHIFTS AT SLOW CRUISING SPEED IT FEELS LIKE IT'S BOGGING BEFORE SHIFTING UP TO 5TH. DOWNSHIFTING 5TH TO 4TH FEELS A CLUNK. BROUGHT IT TO THE DEALER 3 RIVER DODGE IN PITTSBURGH PA WHEN I 1ST BOUGHT IT THEY SAID ALL THE SOFTWARE WAS UP TO DATE AND NOTHING THEY CAN DO FOR ME. THIS SEEMS TO BE A ISSUE BUT I CANNOT GET A RESOLUTION FROM DEALER.I BOUGHT IT SEPTEMBER 27 2018 AND PROBLEM STILL THERE.",
        "vin": "1C4SDJCT4GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230002,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT MY DURANGO USED ON 09/27/2018 WITH 44,500 MILES AND ABOUT 20 DAYS LATER NOTICED WATER IN MY TAIL LIGHT. I CALLED THE DEALER AND THEY SAID THERE IS NO RECALL ON THIS ITEM AND I WOULD HAVE TO PAY FOR A NEW ONE EVEN THOUGH WATER IS GETTING INTO MY TAIL LIGHT THIS DOES NOT SOUND RIGHT NOW 10 MONTHS LATER AND MY RACETRACK LED LIGHT PANEL STOPPED WORKING THIS ITEM NEEDS RECALLED AND DODGE SHOULD BE REPLACING THEM AT NO CHARGE BECAUSE IT'S NOT NORMAL FOR IT TO HAPPEN",
        "vin": "1C4SDJCT4GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223166,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "'TAKATA RECALL' PROBLEM WHEN SHIFTING, THE CHECK ENGINE LIGHT AND IT SAID THAT THERE IS A PROBLEM WITH THE SENSOR. IT ALWAYS HAPPEN WHENEVER IM RUNNING IN FREEWAY. IT'S LIKE SHIFTING AND WHENEVER I PUT IT ON REVERSE I GET STUCK ON NEUTRAL WHENEVER I SWITCH IT TO DRIVE OR PARK I HAD TO TURN OFF THE CAR TO MAKE IT WORK AGAIN",
        "vin": "1C4RDJDG9GC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216963,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN WAITING 2 MONTHS FOR A SHOCK FOR A LEASED VEHICLE.",
        "vin": "1C4RDJAG4GC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11209345,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EDGE OF THE TAILLIGHTS WHEN THE BACK HATCH IS OPEN ARE EXTREMELY DANGEROUS. THEY ARE SHARP AND I HAVE SEVERELY CUT MYSELF MULTIPLE TIMES",
        "vin": "1C4SDHCT4GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208749,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS ELECTRICAL ISSUES BATTERY GETS WORN OUT AND AFTER BUYING 2 BATTERIES I DON'T KNOW WHAT ELSE COULD BE IT STALLS WHILE DRIVING NO MATTER THE SPEED IT'S REALLY DANGEROUS I'M SCARED TO DRIVE IT  MY WIFE WAS DRIVING IN THE FREEWAY AND IT STALLED ON HER ALMOST MADE HER CRASH IN THE HIGHWAY!!!!!THIS HAS HAPPENED 2 TIMES ALREADY WE ARE JUST NOT DRIVING IT AT ALL",
        "vin": "1C4RDHDG0GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205968,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 DODGE DURANGO. THE TAILGATE LIGHTS GETS WATER IN THEM EVERY TIME IS RAINS. THE BULBS BURN OUT AND YOU CAN'T REPLACE THE BULBS YOURSELF. THE ONLY WAY TO FIX THE ISSUE IS PAYING OVER A THOUSAND DOLLARS TO REPLACE THE WHOLE BACK LIGHT.",
        "vin": "1C4RDJDG6GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER POOLING INSIDE THE RACETRACK TAIL LIGHTS.",
        "vin": "1C4RDJDG2GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205534,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER POOLING INSIDE THE RACETRACK TAIL LIGHTS, CAUSING THE LIGHTS TO FAIL.",
        "vin": "1C4RDJDG2GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11202825,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE THE VEHICLE WAS ENGAGED IN PARK, IT ROLLED BACK AND CRASHED INTO A TREE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED. THE CONTACT SUSTAINED INJURIES WHILE RUNNING AFTER THE VEHICLE AND BRUISED BOTH KNEES. MEDICAL ATTENTION WAS NOT RECEIVED. THE VEHICLE WAS TAKEN TO TRINITY CHRYSLER DODGE JEEP RAM (1550 W SPRINGFIELD RD, TAYLORVILLE, IL 62568, (217) 824-3377) WHERE THE SHIFT KNOB WAS UPDATED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 40,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197076,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL THE PROBLEM WITH MY DURANGO IS THE SAME PROBLEM THAT HUNDREDS OF OTHER DURANGO OWNERS ARE HAVING, ITS THE RACE TRACK LIGHT AND THE POOR MANUFACTURING OF THEM. WATER SHOULDN'T BE ABLE TO GET IN TO THEM CAUSING THEM TO BURN OUT. THOSE LIGHT ARE A MAIN PART OF THE RUNNING LIGHTS IN THE DAY AND NIGHT.   HERE IN CANADA IT IS ILLEGAL TO NOT HAVE THEM ON AT NIGHT. THERE WOULD BE NO PROBLEMS IF THESE BULBS WERE ACCESSIBLE TO CHANGE, BUT THEIR NOT WHICH MAKES THEM A MANUFACTURED DEFECT. THE DEALER SHOULD BE RESPONSIBLE TO REPLACE OR REPAIR THE ISSUES AT THEIR OWN COST, NOT TELLING CUSTOMERS SORRY LIGHTS AREN'T COVERED UNDER WARRANTY",
        "vin": "1C4RDJDG7GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2019",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195508,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAUGHT STATE FARM AUTO TRYING TO REPLACE MY NEW PARTS WITH ACTUAL JUNKYARD PARTS .. THIS IS AFTER A THEFT IN MY DRIVEWAY OF TIRES AND WHEELS.",
        "vin": "1C4SDJCT5GC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194920,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE DRIVING VARIOUS SPEEDS, THE CONTACT HEARD A LOUD ABNORMAL NOISE COMING FROM THE REAR OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. COON RAPIDS CHRYSLER DODGE JEEP RAM (10541 WOODCREST DR NW, COON RAPIDS, MN 55433, (763) 290-1011) DIAGNOSED THAT THE REAR SHOCKS NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED BECAUSE THE PARTS WERE ON BACKORDER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "1C4RDJDG6GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "03/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS DODGE DURANGO IS A GARAGE KEPT VEHICLE THAT HAS HAD WATER LEAK INTO WHAT SHOULD BE A SEALED TAIL LIGHT BAR. THE WATER HAS DESTROYED THE BULBS AND MAKES THAT SIDE OF THE REAR OF THE VEHICLE LESS VISIBLE. THIS VEHICLE HAS NEVER BEEN  DAMAGED IN A COLLISION OR BACKED INTO ANYTHING. THERE IS NO RECALL ON THIS DEFECTIVE PART EVEN TOUGH I HAVE SEEN SEVERAL EXAMPLES OF THIS DEFECT ON VARYING YEARS OF THESE DURANGOS.",
        "vin": "1C4RDJDG6GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "02/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187369,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TAILLIGHT AND BRAKE LIGHT UNIT AT THE REAR OF THE VEHICLE FILLS UP WITH WATER FROM RAIN OR SNOW MELT AND CAUSES THE TAILLIGHT/BRAKE LIGHT TO MALFUNCTION AND ALSO STOP WORKING ALL TOGETHER.  THIS HAPPENS WHETHER THE VEHICLE IS SITTING IDLE OR IN MOTION.",
        "vin": "1C4RDJDG9GC"
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "02/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184797,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT OUT TO GET SOMETHING OUT OF THE CAR THAT HAS BEEN PARKED IN THE DRIVEWAY FOR A COUPLE OF DAYS, AFTER A RAIN EVENT AND NOTICED LIFTGATE TRACK LIGHTS GETS WATER INSIDE EVENTUALLY CAUSING AN ELECTRICAL SHORT IN THE RED LED'S IT'S A WHOLE ASSEMBLY WHICH INCLUDES LICENSE PLATE LIGHTS & BACKUP CAMERA, THE PART IS EXPENSIVE AND WARRANTY FOR THIS TYPE OF PART IS UP TO 36,000 MILES. ALSO THERE IS A SQUEAKING NOISE WITH THE SUSPENSION WHILE IN MOTION WHEN YOU GO DOWN OR UP ON A SLOPED AREA (ETC. TURNING IN OR OUT OF A GAS STATION ENTRANCE) DEALERS CANT FIGURE OUT WHY. THESES ARE POSSIBLE SAFETY ISSUES BUT UNKNOWN",
        "vin": "1C4RDHAGXGC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183410,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TAILLIGHT OR AS IT'S CALLED THE REAR RACETRACK LIGHT FILLS WITH WATER IN THE LOWER RIGHT AND LEFT CORNERS WHEN IT'S RAINING. THIS HAS CAUSED SOME ELECTRICAL ISSUES AND NOW SOME OF THE LED HAVE SHORTED. VISIBILITY OF MY REAR LIGHTS HAS DECREASED BECAUSE OF THE MOISTURE INSIDE THE TAILLIGHT.    ABOVE ISSUE CAN BE VERIFIED VIA THE FOLLOWING LINKS-    HTTPS://WWW.DODGEDURANGO.NET/FORUMS/DURANGO-DISCUSSIONS-2014/42937-POLL-WATER-TAIL-LIGHT-2014-A.HTML     HTTPS://WWW.CARCOMPLAINTS.COM/DODGE/DURANGO/2015/LIGHTS/EXTERIOR_LIGHTING.SHTML",
        "vin": "1C4SDJCT8GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183425,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE HEADLIGHT ASSEMBLY/RIGHT TURN SIGNAL AND DAY TIME RUNNING LIGHT (STRIP) BOTH \"BLINK\" WHEN RIGHT TURN SIGNAL IS USED. ISSUE LINKED TO WATER/MOISTURE FOUND IN A COMPARTMENT UNDER THE HOOD AND WAS ADDRESSED BY THE SERVICING DEALERSHIP FEBRUARY 2018 BY DISCONNECTING, CLEANING, AND REASSEMBLING THE MENTIONED COMPARTMENT AND ITS ASSOCIATED ELECTRICAL CONNECTIONS. AS OF FEBRUARY 2019, THE MENTIONED \"DUAL BLINKING\" RETURNED.",
        "vin": "1C4SDJCT8GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183572,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE ADD TO #11183410. LOST COMPLETE FUNCTIONALITY OF THE CENTER TRACK LIGHT ASSEMBLY TO INCLUDE REVERSE LIGHTS.  THIS IS NOW A SAFETY ISSUE!",
        "vin": "1C4SDJCT8GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183264,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS NOTED SHORTLY AFTER PURCHASING THE VEHICLE THAT THE CAR WILL SHIFT REALLY HARD WHEN DOWNSHIFTING FROM 2ND TO 1ST.  THE HARD SHIFT WILL SOMETIMES CAUSE A JERKING MOTION IN THE CAR.  THIS PROBLEM CONTINUES TODAY.  I HAVE TAKEN THE CARE MANY TIMES TO THE DEALERSHIP.  THEY HAVE TOLD ME EACH TIME THAT EITHER A SOFTWARE UPDATED WAS NEEDED OR THEY COULD NOT REPLICATE THE ISSUE.  PLEASE NOTE THE ISSUE IS NOT EVERY TIME.  THE PROBLEM DOES COME AND GO.  LAST FRIDAY, 2/15, THE CAR WOULD NOT GO INTO REVERSE.  I WOULD PUT THE CAR IN REVERSE AND IT WAS AS IF I WERE STILL IN PARK.  AFTER A FEW TRIES, I RESTARTED THE CAR AND IT WENT INTO REVERSE WITH NO PROBLEM.  THE NEXT DAY SATURDAY 2/16, AFTER I PLACED THE CAR IN PARK, I TOOK MY FOOT OFF THE BRAKE AND THE CAR LUNGED FORWARD AS IF IT WERE STILL IN GEAR.  I AGAIN RESTARTED THE CAR, THIS TIME A FEW TIMES, JUST TO SEE IF THE CAR WOULD DO IT AGAIN.  IT DID NOT.  YESTERDAY, THIS HAS HAPPENED BEFORE AND WAS TAKEN IN FOR SERVICE, A NOISE WOULD COME FROM THE SHIFTER KNOB AREA EACH TIME THE BRAKE WAS PRESSED.  THE KNOW HAS BEEN REPLACED ONCE BEFORE BY BOB BAKER DEALERSHIP.  ON TOP OF THESE ISSUE, THE ELECTRONICS HAVE GONE OUT ON THE DASHBOARD WHERE THE CLIMATE CONTROL, RADIO, ETC ARE LOCATED.  I HAVE AN APPOINTMENT TO TRY AND GET THIS ISSUES ADDRESS AT BOB BAKER DEALERSHIP.  I HAVE 20 PAGES OF SERVICE HISTORY ON THIS CAR, MOST OF IT ARE REGARDING THE VERY HARD DOWNSHIFTING.BELOW I WILL MARK THE DATE THE MOST RECENT ISSUE HAPPENED WITH THE CAR.  *TR",
        "vin": "1C4SDHCT7GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181235,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TAILLIGHT OR AS IT'S CALLED THE REAR 'RACETRACK' LIGHT FILLS WITH WATER WHEN IT'S RAINING. THIS HAS CAUSED SOME ELECTRIC ISSUES AND NOW SOME OF THE LED HAVE SHORTED. VISIBILITY OF MY REAR LIGHTS HAS DECREASED BECAUSE OF THE MOISTURE INSIDE THE TAILLIGHT, AND IT'S ONLY MATTER OF TIME BEFORE ALL OF THE REMAINING LED BULBS ARE SHORTED OUT AS WELL.",
        "vin": "1C4RDJDG3GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174612,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. THE CONTACT STATED THAT WATER ENTERED THE TAIL LIGHTS, WHICH CAUSED THE BULBS TO BURN OUT. THE DEALER (MOORE CHRYSLER INC, 1523 W 3RD AVE, WILLIAMSON, WV 25661) STATED THAT THE CONTACT WOULD HAVE TO PAY OUT OF POCKET TO HAVE THE LIGHTS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "1C4RDJDG0GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "01/22/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173255,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TAIL LIGHTS RACE TRACK LIGHT FILLS WITH WATER AND CAUSES ELECTRICAL ISSUES AND  TAIL LIGHTS TO GO OUT.",
        "vin": "1C4RDHAG7GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2019",
        "dateOfIncident": "01/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171061,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO DRIVE MY 2016 DURANGO THIS MORNING, CHECK ENGINE LIGHT WAS ON, AND THE CAR WOULD NOT GO INTO REVERSE. AFTER TURNING THE CAR ON AND OFF SEVERAL TIMES, AND LETTING IT WARM UP, IT WENT INTO REVERSE. TOOK IT TO AUTOZONE TO READ THE CODE (P1B14) AND FOR THE SECOND TIME WE HAVE A PROBLEM WITH THE PARK- REVERSE DIAL. COUPLE OF WEEKS AGO IT WAS PUT INTO PARK AND THE CAR DROVE FORWARD ON ITS OWN. I GUESS SOMEONE IS GOING TO HAVE TO GET INJURED BEFORE CHRYSLER GETS IT TOGETHER.",
        "vin": "_1C4RDHAG3G"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166228,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" I'VE HAD SEVERAL EXPERIENCES WITH MY 2016 DODGE DURANGO THAT WAS BOUGHT BRAND IN JUNE OR JULY 2016 WITH 23 MILES ON IT FROM A DODGE DEALERSHIP. A COUPLE MONTHS AFTER IT WAS BOUGHT, THE CAR CUT OFF WHILE DRIVING PRESENTING SIGNALS OF \"PULL OVER\", \"CHECK ENGINE\", \"POWER TRAIN\" AND MORE. THE SIGNALS WERE FLASHING NON STOP. ONCE I PULLED OVER, THE CAR WOULDN'T START OR MOVE SO I PUT IT IN PARK AND CONTACTED THE DEALERSHIP. MY CAR WAS TOWED TO THE DEALERSHIP AND THE DEALERSHIP STATED THAT THE REPAIRS LIED WITH THE COMPUTER CHIP(S). IT WAS A SIMPLE UPDATE NEEDED. MY HUSBAND AND I PAID FOR THAT. IN MARCH/APRIL OF 2017, WE EXPERIENCED OUR CAR ROLLING INTO THE NEIGHBORS YARD WHILE ON AND IN PARK. OUR HOME CAMERA TAPED ME GETTING OUT OF THE VEHICLE WHILE IN PARK (ACCORDING TO THE REAR LIGHTS) IN MY FRONT YARD ON THE GRASS AND THEN THE CAR MOVING FORWARD OF WHICH THE CAMERA STOPPED RECORDING AT THIS MOMENT. WHEN I WALKED BACK OUTSIDE TO MY CAR, IT WAS ROLLING ONTO THE NEIGHBORS' PROPERTY. I HAD TO RUN AND CATCH IT. IN THE LATER MONTHS OF 2017, THE GAS LEVER STOPPED WORKING. AFTER PUSHING THE GAS BUTTON, IT WOULDN'T OPEN AND STILL DOESN'T OPEN, SO WE HAVE TO OPEN THE GAS USING THE \"STRING\" OR PULLEY IN THE TRUNK SPACE OF THE DURANGO BY LIFTING THE LIFT GATE TO GET TO IT. IN DECEMBER 2018, THE CAR WOULDN'T START. DODGE TOWED IT TO THE NEAREST DEALERSHIP AND A NEW BATTERY WAS NEEDED ALONG WITH RECALL UPDATES. JANUARY 2019, THE VEHICLE'S DASHBOARD WENT OUT WITH NO LIGHTING OR ANYTHING SHOWING ALTHOUGH THE CAR WAS OPERABLE. IT IS CURRENTLY STILL IN THE SHOP WHILE MY FAMILY OF 5 IS OPERATING WITH ONE VEHICLE.",
        "vin": "1C4RDHAGXGC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING HAS GONE OUT. IT FULLY WENT OUT WHILE DRIVING INTO A PARKING LOT FROM A HIGHWAY EXIT. THE TRUCK STARTED MAKING SOUNDS AND WILL NOT TURN NOW. THE VEHICLE HAS ONLY 60,000 MILES. I HAVE SEEN WHERE OTHER DODGE AND RAM VEHICLES ARE HAVING SIMILAR ISSUES WHERE THE POWER STEERING HAS COMPLETELY GONE OUT AS MINE HAS. WITH THE ELECTRONIC STEERING SYSTEM EVERY TIME I TURN THE WHEEL YOU HEAR A SCREECHING AND ELECTRONIC OR BEING SOUND (AS IF AN ELECTRICAL DEVICE HAS FAILED). I STARTED TO NOTICE A DULL OR NUMB STEERING FEELING TO THE VEHICLE WHICH NOW HAS PROGRESSED INTO UNABLE TO USE ONE BIT. FIAT CHRYSLER HAS INFORMED ME THAT THIS IS NOT COVERED UNDER AN EXTENDED WARRANTY. WE READ THAT SIMILAR DODGE, CHRYSLER AND RAM VEHICLES IN OUR YEAR RANGE HAVE BEEN AFFECTED BY THIS AS WELL. IT'S NOT REALISTIC FOR SOMEONE WHOM IS STILL PAYING FOR A VEHICLE TO NOW BE REQUIRED TO PAY $3,000+ IN REPAIRS TO FIX THIS VEHICLE.",
        "vin": "1C4RDHDG3GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "12/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163449,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LIGHT BAR ACROSS BACK COLLECTS WATER (BAD SEALS). NOW HAS SHORTED OUT AND TAIL LIGHT BAR AND TAG LIGHTS DO NOT WORK. NOT COVERED UNDER MY EXTENDED WARRANTY",
        "vin": "1C4RDHDG5GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/18/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162324,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME TO A STOP TURNED THE KNOB TO PARK, AND WENT TO EXIT THE VEHICLE. THE CAR ROLLED FORWARD INTO THE CURB AND DENTED MY LICENSE PLATE . THE CAR APPARENTLY DID NOT GO INTO PARK, LIKE I HAD PUT IT. HAD THERE BEEN PEOPLE IN FRONT OF ME I WOULD HAVE HIT THEM!",
        "vin": "1C4RDHAG3GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE 3RD TIME THAT WHILE DRIVING MY ENGINE SHUT OFF! THE REPAIR SHOP \"FIXED\" THE ISSUE BUT THE DAY I DROVE HOME IT DIED AGAIN WHILE DRIVING AND I HAD IT TOWED TO DEALERSHIP SERVICE DEPARTMENT. THE REPAIR LASTED MAYBE 6 MONTHS? THE ENGINE DIED AGAIN WHILE DRIVING TO WORK. THE SERVICE EXTENDED WARRANTY IS GIVING ME THE RUN AROUND ABOUT PROVIDING A RENTAL AND COVERING THE REPAIRS. I CANNOT BE DRIVING A VEHICLE THAT SHUTS DOWN WHILE DRIVING! WHAT IF THIS HAPPENS WHILE GOING 70 MPH TO WORK IN AUSTIN?! I'M NOT WRECKING AND DIEING BECAUSE OF A LEMON CAR WITH SAFETY ISSUES",
        "vin": "1C4RDHAG8GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141165,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RACE TRACK LIGHT SYSTEM COLLECTING WATER INSIDE THE TAILLIGHT ASSEMBLY AND CAUSING LIGHTS NOT TO WORK",
        "vin": "1C4RDJDG4GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132181,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS GETTING IN TAIL LIGHT",
        "vin": "1C4RDHDG3GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131628,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE SHIFTED THE CAR INTO PARK. SHE EXITED THE VEHICLE AND LEFT THE ENGINE RUNNING WHILE SHE GOT OUT . WHEN SHE STEPPED AWAY FROM THE VEHICLE TO GET SOMETHING SHE NOTICED THE VEHICLE ROLLING BACKWARDS AND IT BACKED INTO A DUMPSTER. THE REAR WINDOW SHATTERED AND DAMAGE WAS DONE TO THE LIFT GATE.",
        "vin": "1C4RDHAG5GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114560,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE DRIVING 10 MPH, THE VEHICLE INTERMITTENTLY FELT LIKE IT WENT INTO ANOTHER GEAR AND ACCELERATED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO TETERBORO CHRYSLER JEEP DODGE RAM (469 US-46, LITTLE FERRY, NJ 07643, 201-440-0222), BUT THE FAILURE COULD NOT BE DUPLICATED OR DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 31,000.",
        "vin": "1C4SDJCT0GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/21/2018",
        "dateOfIncident": "04/26/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112859,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE ,WITH THE CRUISE CONTROL ENGAGED,TRAFFIC WAS SLOWING DOWN DUE TO ROAD REPAIR, I APPLIED MY BRAKES LIGHTLY TO DISENGAGE THE CRUISE CONTROL, BUT THE VEHICLE REMAINED IN A FORWARD THRUST. I WAS FAST APPROACHING A VEHICLE AHEAD OF ME, AND BEFORE I REALISED I WASNT GOING TO STOP WITH FURTHER APPLICATION OF MY BREAKS, I HIT THE VEHICLE IN FRONT OF ME RESULTING IN A NEAR FATAL COLISION. I WAS SAVED BY MY SEAT BELT AND THE AIR BAGS. I CAN ONLY ESTIMATE MY SPEED AT THE TIME OF COLLISION TO BE BETWEEN 40 OR 50 MPH, AS MY CRUISE CONTROL WAS SET AT 62 MPH *TT",
        "vin": "1C4RDHAG9GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2018",
        "dateOfIncident": "07/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109792,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK JUST SHUTS OFF WHILE DRIVING AND NOW IT WON'T EVEN START SO I AM OUT OF A CAR",
        "vin": "1C4RDJAG7GC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104146,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RATTLING NOISE COMING FROM DRIVER'S SIDE DASH AREA WHEN DRIVER ON HIGHWAY. WIND GUSTS MAKE IT SOUND LIKE THE AIR FILTER BOX IS RATTLING BUT IT'S NOT.",
        "vin": "1C4SDJCTXGC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/14/2018",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085083,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DECELERATING, AT APPROXIMATELY 25 MPH, EXPERIENCED A SEVERE  BUMP DURING DOWNSHIFT CAUSING DRIVER TO LOSE TEMPORARY  FOOT TO BRAKE PEDAL  CONTACT.  OCCURRED IN TRAFFIC  APPROACHING TRAFFIC LIGHT. MADE DEALER SERVICE  DEPARTMENT AWARE OF CONDITION. WHILE ROAD TESTING  WITH ADVISOR, I WAS TOLD CONDITION  NORMAL TO VEHICLE.  ATTEMPTED REPAIR WAS RE FLASH OF TRANSMISSION CONTROL MODULE. SLIGHT IMPROVEMENT WAS SHORT LIVED, NOW WORSE THAN PRIOR TO RE FLASH.",
        "vin": "1C4SDJCT9GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/13/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084900,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VISIBLE MOISTURE AND CONDENSATION INSIDE OF CENTER RACETRACK TAIL LIGHT ASSEMBLY HAS CAUSED LED TAIL LIGHTS TO FLICKER (SHORTING OUT). THIS IS A SAFETY ISSUE AS THE LED  TAIL LIGHTS ARE NECESSARY IN ORDER TO SEE THE REAR OF THE VEHICLE AT NIGHTTIME OR DARK DAYS.",
        "vin": "1C4SDJET9GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084704,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE A MESSAGE CAME UP ON THE CLUSTER \"START/STOP SYSTEM DISABLED.  SERVICE START/STOP SYSTEM\".  SHORTLY AFTER THERE WAS ANOTHER MESSAGE \"LOW BATTERY MODE.  SOME SYSTEMS FUNCTION REDUCED\".       I LOOKED AT THE SYSTEM HEALTH STATUS AND THE BATTERY VOLTAGE WAS AT 11.2 VOLTS.  WHILE DRIVING THE VOLTAGE CONTINUED TO DROP.  I CALLED THE DEALER AND THEY ASKED ME TO BRING THE VEHICLE IN TO CHECK DIAGNOSTICS.  WHILE DRIVING TO THE DEALER THE VOLTAGE CONTINUED TO DROP AND THE RADIO TURNED OFF AND WOULD NOT TURN BACK ON.  WHEN I ARRIVED AT THE DEALERSHIP THE VOLTAGE WAS AT ~10.1 VOLTS.      WHEN I PULLED THE VEHICLE INTO THE DEALERSHIP SERVICE BAY THE SERVICE WRITER CAME OVER AND WE AGREED TO NOT SHUT OFF THE VEHICLE AS WE WEREN'T SURE WHETHER IT WOULD RESTART GIVEN THE BATTERY VOLTAGE.  AS THE VEHICLE IDLED IN THE SERVICE BAY THE VOLTAGE CONTINUED TO DROP AND THE VOLTAGE WAS JUST OVER 9 VOLTS WHEN I GOT OUT OF THE VEHICLE.  THE VEHICLE WAS RUNNING AND WAS IN PARK.  PARKING BRAKE WAS NOT ENGAGED.      A DEALERSHIP EMPLOYEE GOT INTO THE VEHICLE AND WAS GOING TO MOVE IT BUT THE SERVICE WRITER ASKED HIM TO LEAVE IT WHERE IT WAS UNTIL THEY DETERMINED WHICH TECHNICIAN IT WOULD BE ASSIGNED TO.  THE DEALERSHIP EMPLOYEE TOLD ME THAT HE DID NOT MOVE THE VEHICLE AND DID NOT TAKE IT OUT OF PARK.      I WENT INTO THE WAITING ROOM INSIDE THE DEALERSHIP AND A FEW MINUTES LATER THE SERVICE MANAGER CAME OUT TO TELL ME THAT THERE WAS AN ISSUE WITH MY VEHICLE AND THAT IT DROVE INTO A WALL IN THE SERVICE BAY WITH NO ONE IN THE VEHICLE.  WHEN I WENT OUT INTO THE BAY THE RH FRONT WHEEL HAD CLIMBED A CURB AND THE VEHICLE HAD HIT A WALL.      FCA SPECIAL INVESTIGATION TEAM REVIEWED VEHICLE AND DETERMINED THAT THERE WAS NO MECHANICAL ISSUE WHICH WOULD CAUSE THE VEHICLE TO MOVE ON ITS OWN.  NO EXPLANATION WAS FOUND FOR LOW VOLTAGE CONDITION.  DEALERSHIP HAS VIDEO OF INCIDENT.",
        "vin": "1C4RDJDG8GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/05/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083370,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED WATER IN BOTH SIDES OF TAILLIGHT LENS OF TAILGATE. HAD TRUCK IN FOR OIL CHANGE AT DEALER AND SHOWED SVC MANAGER WATER. REPAIR TECH FOUND \"STRESS CRACK\" IN TAILLIGHT ASSEMBLY ALLLOWING WATER TO INFILTRATE TAILLLIGHT LENS. SVC MANAGER SAID \"STRESS CRACK\" COULD BE CAUSED BY CLOSING TAILGATE. THERE IS NO INDICATION OF PHYSICAL DAMAGE, IE.,AS IN TAILGATE BEING HIT OR IN AN ACCIDENT.",
        "vin": "1C4RDJAG7GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11081984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A STOP SIGN AND PUT VEHICLE IN PARK AND EXITED THE VEHICLE AND IT STARTED ROLLED BACKWARDS AND KNOCKED ME DOWN AND ROLLED OVER ME AND CAUSED A BROKEN ARM, 3 BROKEN RIBS AND A BAD BRUISE THAT NEEDED SURGERY AFTER IT DIDN'T DISSOLVE LIKE IT'S SUPPOSE TO.",
        "vin": "1C4RDJAG460"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/25/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081163,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS POOLING INTO THE TAIL LIGHTS. THE \"RACETRACK \" SECTION OF THE TAIL LIGHT IS NOW FLICKERING AND STAYING OFF. THE REPLACEMENT IS OVER $1000. THE \"RACETRACK\" TAIL LIGHT HAS TO BE REPLACED WHICH INCLUDES BACK UP CAMERA. YOU SHOULD BE ABLE TO PURCHASE THOSE COMPONENTS SEPARATELY. I SPENT A LOT OF MONEY FOR A VEHICLE THAT I BELIEVED WOULD BE DEPENDABLE AND NOT GIVE ME SUCH BIZARRE ISSUES. I DON'T KNOW IF THE WATER GETS IN WHILE RIDING DOWN THE ROAD OR WHILE STATIONARY",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080854,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER POOLING INSIDE OF CENTER RACETRACK TAIL LIGHT ASSEMBLY HAS CAUSED LED LIGHTS TO SHORT OUT.",
        "vin": "1C4RDJEG2GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076570,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/10/18 I PARKED MY CAR ON A HILL ALONG A CURBED  SIDEWALK  I PUT THE CAR IN PARK AND SHUT IT OFF AND EXITED AND LOCKED THE DOORS.  I WALKED TO A RESTAURANT AROUND THE CORNER FOR TAKE OUT WHEN I RETURNED 5 MINUTES LATER AND MY VEHICLE HAD ROLLED BACK ABOUT TEN FEET INTO ANOTHER VEHICLE THAT WAS PARKED ON THE STREET CAUSING DAMAGE TO THE REAR OF MY VEHICLE.  I HAD TO PRIOR EVENTS IN MY DRIVEWAY WHERE AFTER I PARKED MY CAR IN MY DRIVEWAY AND IN THE MORNING I FOUND THE CAR BACKED ED OUT INTO THE ROAD WAY.",
        "vin": "1C4SDJCT7GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071989,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER CONTINUES TO ENTER THE REAR RACE TRACK TAIL LIGHT AND IS NOT COVERED UNDER WARRANTY. ONCE THE WATER FILLS THE LIGHT THE LED GOES OUT AND MUST BE REPLACED FOR SAFETY (HAS NOT GONE OUT ON MINE YET). MY LIGHTS ARE SEALED AND THERE IS NO DAMAGE TO THEM YET THERE IS WATER ENTERING THE INSIDE OF THE LIGHTS. I AM UNABLE TO SEE IF THE WATER ENTERS THE LIGHTS DURING MOTION OR WHEN STATIONARY.",
        "vin": "1C4RDJDGXGC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065990,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HATCH TAIL/BACKUP LIGHT ASSY FULL OF WATER AND CRACKED",
        "vin": "1C4RDJEG3GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2018",
        "dateOfIncident": "01/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062546,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME I HAD AN ISSUE WITH MY CAR, MY HUSBAND AND I WERE DRIVING ON THE NJ TURNPIKE IN THE LEFT LANE, WITH CARS COMING UP BEHIND US OVER 85 MPH, AND THE CAR STOPPED ACCELERATING AND WE HAD TO PULL OVER AND THE CAR DIED. AFTER AN AWFUL MESS DODGE TOOK IT IN FOR REPAIRS ON THE RADIO AND ELECTRICAL ISSUES. THEY CALLED ME TO PICK IT UP AND AS I DROVE IT OUT OF THE DEALERSHIP THE SAME ISSUE WAS HAPPENING AND THE CAR ALMOST DIED AGAIN. NOW MY CAR SCREEN AND RADIO WILL NOT SHUT OFF EVEN WHEN THE CAR IS OFF. DODGE CAN'T SUPPLY ME WITH A RENTAL, AND MY HUSBAND IS IN THE MILITARY AND I AM PREGNANT. THEY WERE USELESS ON THE PHONE AND I AM TERRIFIED TO DRIVE IN MY VEHICLE!!",
        "vin": "1C4RDJEG5GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048023,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS 16 MONTHS OLD, LEASED FOR 3 YEARS. ELECTRICAL MALFUNCTIONS SUCH AS CAMERA NOT WORKING PROPERLY, LIGHTS NOT TURNING OFF INSIDE THE CAR, SOFTWARE IN THE CAR MALFUNCTIONING AND CREATING RANDOM ERROR MESSAGES ON THE SCREEN, AND TURN SIGNALS BURNING OUT WITHIN THE FIRST YEAR OF THE LIFE OF THE CAR HAPPENED VERY OFTEN. WERE REPORTED 2-3 TIMES TO THE SAME DEALERSHIP BUT NO RECORD WAS MADE FOR US AT THE DEALERSHIP, ALTHOUGH MECHANICS SHOWED US HOW TO MANUALLY RESET THE COMPUTER OURSELVES, SO WE DIDN'T HAVE TO KEEP COMING BACK IN FOR IT. THIS TIME THE CAR CAME TO A DEAD STOP A FEW SECONDS AFTER MAKING A LEFT TURN. WHEELS LOCKED UP AT ABOUT 20MPH SPEED. THE IMPACT OF THE STOP CAUSED ME AND MY TWO TODDLERS TO FLY FORWARD SINCE THE SEATBELTS DID NOT LOCK. MY 3 YEAR OLD WAS IN A CONVERTIBLE CAR SEAT, SHE SCOOT FORWARD A LITTLE BIT, BUT MY SON WAS IN A TODDLER BOOSTER AND FLEW FORWARD DOWN THE MIDDLE ISLE ALL THE WAY TO MY FRONT SEAT. ALL THE LIGHTS IN THE CAR FLASHED ON AND OFF REPEATEDLY. CAR WAS BEEPING FOR A GOOD 2-3 MINUTES STRAIGHT. NONE OF THE BUTTONS WORKED! DOORS WERE LOCKED AND WOULD NOT OPEN, THE WINDOWS LOCKED AND WOULD NOT REACT TO THE BUTTONS. TOOK ME A GOOD FEW MINUTES TO GET THE CAR BACK TO FUNCTIONING, AND I DROVE IT IMMEDIATELY DOWN THE STREET TO THE DEALERSHIP WHERE I GOT THIS CAR. AFTER 2 DAYS OF THE CAR BEING THERE,  WE WERE TOLD THAT THEY HAD FOUND NOTHING, REPLICATED NOTHING, AND THAT THE COMPUTER RECORDED NO CODES. WE CONTACTED DODGE CORPORATE, BUT WERE TOLD THAT NOTHING WILL BE DONE FOR US (BESIDES PAY THE 2 DAYS OF RENTAL CAR FEE WHILE THEY LOOKED AT OUR CAR). DODGE TOLD US CAR WAS \"FUNCTIONING AS DESIGNED\" ALTHOUGH THEY CAN NOT GUARANTEE ITS SAFE TO DRIVE, THEY DON'T SEE ANYTHING WRONG WITH IT. TOLD US THAT WE WOULD HAVE TO GO THROUGH THIS 2 MORE TIMES BEFORE THEY CAN OPEN A CLAIM AGAIN. REFUSED TO SWAP THE CAR OUT, TOLD US NOTHING THEY CAN DO.",
        "vin": "1C4RDJDG4GC"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040815,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY FOB MESSAGE KEY FOB HAS LEFT VEHICLE WHEN VEHICLE IS IN MOTION, DRIVING HIGHWAY, STOPPED AS WELL AS PARKED. AT TIMES UNABLE TO GET IN TO CAR. OTHER TIMES WHEN IN VEHICLE THE VEHICLE WILL NOT START.  ALSO, TRANSMISSION COMMAND IN DRIVE THE VEHICLE WILL NOT GO FORWARD AND IN REVERSE THE VEHICLE WILL NOT BACK UP AND WHEN IT DOES IT MAKE A NOISE.",
        "vin": "1C4RDJAG9GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025471,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BEEN DRIVING MY DURANGO FOR APPROXIMATELY 6 MONTHS.  ON 9/19 I WAS ON MY WAY TO DROP MY KIDS AT SCHOOL AS I NORMALLY DO IN THE MORNING.  TRAFFIC WAS EXTREMELY HEAVY LIKE USUAL, AND I WAS STUCK IN TRAFFIC ON 104 WESTBOUND.  MY SON HAD UNDONE HIS CAR SEAT LATCH SO SINCE I WAS STUCK IN TRAFFIC AND I COULD EASILY REACH HIM.  HIS SEAT IS TO THE BACK RIGHT OF ME IN THE MIDDLE ROW, AND ITS A MATTER OF JUST REACHING BACK WITH ONE ARM.   AFTER SECURING HIM (PUSHED THE CLIP BACK TOGETHER), THE TRAFFIC HAD MOVED FORWARD SO I WAS GOING TO MOVE UP.  I HIT THE ACCELERATOR, AND THE CAR DIDN'T MOVE, IT JUST REVVED.  I NOTICED THE CAR WAS IN NEUTRAL FOR SOME REASON, SO WITHOUT CONSIDERATION I MOVED IT TO DRIVE.  SINCE THE CAR WAS REVVING IT JUMPED FORWARD HITTING THE CAR IN FRONT OF ME.  IT WAS A MINOR ACCIDENT, THAT DIDN'T DO MUCH DAMAGE TO MY DURANGO, BUT A SMALL PART OF THE GRILL BROKE AND PUNCTURED MY RADIATOR.  MY PROBLEM WITH THE CAR IS THAT THE CAR SHOULD NOT HAVE BEEN IN NEUTRAL.  HAD THE CAR NOT BEEN IN NEUTRAL, I WOULDN'T HAVE HIT THE GAS MORE (AS I COULDN'T FIGURE OUT WHY IT WASN'T MOVING AT FIRST) AND THEN IT WOULDN'T HAVE REVVED AND WOULDN'T HAVE JUMPED.",
        "vin": "1C4RDJDGXGC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "08/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019434,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE PARKING THE VEHICLE, THE ELECTRONIC ROTARY CONTROL FAILED TO REVERSE THE VEHICLE AND, INSTEAD, IT INDEPENDENTLY SURGED FORWARD. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (BEST CHRYSLER DODGE JEEP RAM, 520 COLONY PL, PLYMOUTH, MA 02360), BUT WAS NOT DIAGNOSED OR REPAIRED. ON SEVERAL OCCASIONS, THE VEHICLE PROCEEDED TO ROLL AWAY AFTER THE GEAR SELECTOR WAS PLACED INTO PARK. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 25,000.",
        "vin": "1C4RDJDG2GC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "07/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010515,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE REVERSING TO HOOK BOAT TRAILER UP TO VEHICLE, VEHICLE TOOK OFF AT A HIGH RATE OF SPEED IN REVERS. HITTING THE BRAKES DID NOT HELP. THE VEHICLE SLAMMED INTO THE TRAILER WITH BOAT SITTING ON IT AND PUSHED INTO A TREE BEFORE THE VEHICLE WOULD STOP. FURTHERMORE, THIS VEHICLE HAS BEEN INTO THE DEALER'S 5 TIMES FOR HEADLINER ISSUES WHICH INCLUDED INTERIOR LIGHTS NOT WORKING, REAR AC VENTS NOT WORKING, PINCHED WIRES IN THE WIRING HARNESS AND AIRBAG LIGHTS ON.",
        "vin": "1C4SDJCT8GC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2017",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006483,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MAY BE A SCENARIO FOR THE ONGOING INVESTIGATION OF ROLLAWAY (NHTSA ACTION NUMBER: PE16014)  THE VEHICLE IN THIS SCENARIO WAS STATIONARY.   I FOLLOW THE NORMAL PROCEDURE FOR PARKING MY DURANGO BY (1)APPLYING PARKING BRAKE, (2)MOVING THE SHIFTER TO PARK, (3) TURN IGNITION OFF, AND THEN (4)EXITING THE VEHICLE.   TODAY, I BROUGHT MY VEHICLE TO STOP FOR PARKING, WHICH TRIGGERED THE STOP-START SYSTEM, TURNING THE ENGINE OFF. AT THIS TIME, BEFORE SHIFTING THE TRANSMISSION TO PARK, I OPENED THE DOOR OF THE VEHICLE. THIS ACTION OF OPENING DOOR MADE THE STOP-START SYSTEM UNAVAILABLE. AFTER THIS WHEN I LIFTED MY FOOT FROM THE BRAKE PEDAL, AND MOVED TRANSMISSION TO PARK (WITH PARK LIGHT LIT), MY THINKING WAS THAT THE VEHICLE WOULD START ITS ENGINE AS IT WOULD BE COMING OUT OF STOP-START SYSTEM. BUT, THIS DID NOT HAPPEN AS THE DRIVER DOOR WAS OPEN AND THE STOP-START SYSTEM WAS DISABLED. AT THIS TIME, WHEN I LIFTED MY FOOT OF THE BRAKE, THE CAR ADVANCED FORWARD WITH NO POWER. EVEN THEN THE ENGINE DID NOT START. THEN I TURNED THE CAR OFF AND TURNED IT BACK ON AND ALL WORKED FINE.   WHILE CHECKING THIS SCENARIO AGAIN, I TURNED THE CAR OFF WHILE THE STOP-START WAS DEACTIVATED. THE VEHICLE DID A POWERLESS ROLLING. I STARTED THE VEHICLE AGAIN AND ALL WORKED FINE.  IT SEEMS THAT THE OPENING OF THE DRIVER DOOR BEFORE THE VEHICLE EXITS THE STOP-START SYSTEM INITIATED ENGINE-OFF, CAUSES THE VEHICLE TO ENTER A STATE WHERE THINGS ARE NOT PREDICTABLE. MY EXPECTATION WAS THAT THE TAKING FOOT OFF THE BRAKE PEDAL OR CHANGING GEAR SHIFTER, WOULD MAKE THE ENGINE COME BACK TO LIFE. BUT THAT DID NOT HAPPEN.  I HOPE THAT THERE COULD BE SOLUTION FOR THIS ISSUE. I ALWAYS APPLY PARKING BRAKE SINCE THE TIME I HAVE LEARNED HOW TO DRIVE, AND THAT SURELY MUST BE HELPING ME HERE.",
        "vin": "1C4RDHEG0GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985673,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE THE GEAR SHIFTER WAS PLACED IN PARK, THE OWNER EXITED THE VEHICLE AND LEFT TWO OF THE OCCUPANTS INSIDE. THE VEHICLE ROLLED AWAY AND STRUCK ANOTHER PARKED VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE INSURANCE COMPANY'S COLLISION CENTER STATED THAT THEY DID NOT BELIEVE THE VEHICLE WAS SAFE TO DRIVE. THE MECHANIC FURTHER STATED THAT THEY DID NOT WANT TO SERVICE THE VEHICLE UNTIL AFTER CHRYSLER CONDUCTED AN INVESTIGATION. THE MANUFACTURER HAD NOT CALLED THE CONTACT BACK YET PER CASE NUMBER: 31602871. THE FAILURE MILEAGE WAS APPROXIMATELY 15,240.",
        "vin": "1C4RDHEG1GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972171,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TIME WATER HAS GOTTEN INTO A TAIL LIGHT. FIRST WAS THE DRIVERS SIDE WHICH HAS BEEN REPLACED. WHEN IT WAS REPLACED ONE OF THE MECHANICS DROPPED IT AND CHIPPED A CORNER AND HAVE YET TO ORDER A REPLACEMENT. ALSO, THE MIDDLE \"TRACK LIGHT\" IS STARTING TO FILL UP WITH WATER. RIDICULOUS FOR A $45,000 VEHICLE.",
        "vin": "1C4RDJDG8GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED THE 2016 DODGE DURANGO SINCE AUGUST OF 2016. IN THAT TIME, THERE HAVE BEEN TWO CASES WHERE I STOPPED THE CAR, THOUGHT I PUT IT IN PARK, THOUGHT I TURNED IT OFF, AND EXITED THE VEHICLE. WHEN I CAME BACK TO IT, I FOUND THAT IT WAS STILL RUNNING AND STILL IN DRIVE. THE ONLY REASON IT WASN'T MOVING WAS BECAUSE I ALWAYS SET THE PARKING BRAKE. I THINK THERE IS A SERIOUS DESIGN FLAW WITH THE TRANSMISSION ON THIS CAR. I HEARD THAT OTHER CHRYSLER CARS HAVE THIS KIND OF PROBLEM AND HAVE BEEN FIXED BY MAKING IT SO THAT THE CAR WILL TURN OFF IF THE DRIVER TAKES OFF THE SEATBELT AND EXITS THE CAR. THIS PROBLEM MOST RECENTLY HAPPENED TO ME YESTERDAY WHEN I WAS GOING TO PICK UP MY DAUGHTER AT SCHOOL. IF THE PARKING BREAK HAD FAILED, IT WOULD HAVE RUN OVER A BUNCH OF KIDS. THIS IS REALLY SCARY AND NEEDS AN IMMEDIATE FIX",
        "vin": "1C4RDHDG4GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/19/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967051,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ROLLAWAY DANGER---WE HAVE AN ATTACHED THREE CAR GARAGE AND I WAS PARKED IN THE LARGER 2 CAR SECTION CLOSER TO THE HOUSE.  IN EARLY AM ON A RECENT MORNING, WHEN BACKING OUT OF MY GARAGE, I REALIZED I HAD LEFT SOMETHING IN THE HOUSE. AFTER BACKING OUT, I PUT THE CAR IN PARK, UNBUCKLED MY SEATBELT AND OPENED THE DRIVER DOOR IN ORDER TO GO BACK INTO THE HOUSE.  AS I WAS EXITING THE VEHICLE, I NOTICED THAT THE CAR WAS STILL MOVING FORWARD. I JUMPED BACK INTO THE CAR AND QUICKLY HIT THE BRAKE IN ORDER TO STOP ITS ROLLING FORWARD. UNFORTUNATELY AS I HAD THROWN MYSELF BACK INTO THE SEAT! I WAS MISALIGNED TO THE CONTROLS AND I HIT THE GAS RATHER HARD WHICH CAUSED THE VEHICLE TO LUNGE FORWARD.  AS SOON AS I REALIZED WHAT HAPPENED, I SLAMMED ON THE BREAK BUT UNFORTUNATELY I STILL HIT THE GARAGE (THE SINGLE CAR GARAGE). I WAS AT AN ANGLE TO THE BUILDING WHICH CAUSED DAMAGE TO THE FRONT LEFT OF THE VEHICLE BUT ALSO TO THE RIGHT SIDE PASSENGER DOOR AND ATTACHED MIRROR.  AS WELL AS SOME DAMAGE TO THE GARAGE ALSO.   THIS WAS A VERY SCARY SITUATION FOR ME BUT THERE'S MORE.  MY HUSBAND WAS TAKING OUT THE GARBAGE THAT MORNING AND WAS WALKING ACROSSED THE GARAGE TOWARD THE GARBAGE CAN. HAD HE BEEN 10 PACES FURTHER IN HIS JOURNEY I VERY LIKELY WOULD HAVE HIT HIM OR EVEN PINNED HIM BETWEEN THE VEHICLE AND THE GARAGE CAUSING UNKNOWN HARM TO HIM BUT PERHAPS VERY SERIOUS.   TO BE HONEST, THIS VEHICLE SCARES THE CRAP OUTTA ME WHICH IS HORRIBLE CONSIDERING 6 MONTHS AGO I MADE A MAJOR INVESTMENT IN IT  I HAVE A PRISTINE DRIVING RECORD. WE CONTACTED DODGE AND WE'VE HAD SOMEONE INSPECT THE VEHICLE WITH A LETTER RESPONSE OF \"YOU DON'T KNOW HOW TO DRIVE\". GIVEN MY DRIVING RECORD, I WOULD ARGUE THAT I DO AND GIVEN THE KNOWN ISSUES WITH POSSIBLE ROLL AWAYON THESE VEHICLES I WOULD ASK THAT A FIX BE BROUGHT TO MARKET TO MAKE THESE VEHICLES SAFER!",
        "vin": "1C4RDHDG7GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/18/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966654,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FCW DOES NOT WORK AS EXPLAINED IN THE DODGE MANUAL. NO WARNING TO BRAKE OR BRAKE  JOLT OR STOP OF THE VEHICLE. ALL I GET FROM DODGE DEALERS 4 OF THEM IS WE CAN'T TEST THE SYSTEM AND YOU CAN RUN INTO THE CAR IN FRONT OF YOU. I HAVE IT SET ON THE MOST SET ON THE MOST SENSITIVE SETTING. THIS SYSTEM IS ACCORDING TO THE MANUAL WORK UNDER 25MPH TO 1MPH. THE ADAPTIVE CRUISE WORKS AS DESCRIBED. I CALLED THERE 1-800 NUMBER AND ALL I GET IS THE RUN AROUND AND THAT THEY CAN'T TEST IT. ITS EASY JUST DRIVE AND YOU WILL RUN INTO THE CAR IN FRONT OF YOU WITH NO WARNING AT ALL.    I HAD A 2012 DURANGO AND I TRADED IT IN FOR THIS FEATURE. PLEASE HELP ME",
        "vin": "1C4RDJEG2GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "02/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954479,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHEN THE VEHICLE WAS STARTED AND STILL IN THE PARK POSITION, IT ROLLED DOWN THE DRIVEWAY AND CRASHED INTO THE NEIGHBOR'S HOUSE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE MANUFACTURER SENT AN INVESTIGATOR WHO COULD NOT DUPLICATE THE FAILURE AND STATED THAT THE VEHICLE WAS FINE. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 18,000.",
        "vin": "1C4RDHDG3GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "01/02/2017",
        "dateOfIncident": "12/31/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939092,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS RUNNING AND IN PARK, ROLLED INTO ANOTHER PARKED VEHICLE ABOUT 5FT AWAY.  DAMAGE TO BOTH VEHICLES DUE TO IMPACT.  SEEMS TO HAVE SHIFTED OUT OF GEAR ON ITS OWN.",
        "vin": "1C4RDHAG8GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2016",
        "dateOfIncident": "07/16/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936697,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. AFTER DRIVING THE VEHICLE, SHIFTING INTO PARK, AND EXITING, THE CONTACT STATED THAT THE VEHICLE ROLLED FORWARD AND ALMOST CAUSED A CRASH. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 15,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/21/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936829,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2016 DURANGO RENTED FROM ENTERPRISE REPEATEDLY, INCREASINGLY BUT INTERMITTENTLY AND WITHOUT DRIVER INPUT, CHANGED GEAR, REVVED AND INDICATED ON THE SCREEN THAT THERE WERE ISSUES WITH \"KEY FOB NOT IN VEHICLE AND \"TIRES PRESSURE\".   AT FIRST THEIR WERE THREE VERY BRIEF INCIDENTS LASTING LESS THAN THREE SECONDS OVER A WEEK, OCCURRING AT IDLE AND WHEN ACCELERATING. LATER THE OCCURRENCES LASTED SOMETIMES OVER 20 SECONDS EACH AND HAPPENED SOMETIMES SEVERAL TIMES PER HOUR, INCREASINGLY WORSE. WHILE THERE WAS CLEARLY AN ISSUE WITH THE SHIFTER, THERE APPEARED TO BE ADDITIONAL OR RELATED ISSUES WITH THE ELECTRONIC BRAIN. RESETTING THE OPTIONS, LIKE SHUTTING OFF THE HILL CLIMB OPTION WHICH IT WAS SET ON BEFORE WE RENTED IT SEEMED TO HELP AT FIRST BUT DID NOT.  THIS WAS DANGEROUS AND DISTURBING.  FINALLY, THE CAR LURCHED OUT OF PARK AND HIT A WALL ON ITS OWN FROM A FEW FEET AWAY.    I HAVE PHOTOS AND WILL GIVE MORE INFORMATION.    THESE INCIDENTS OCCURRED AT VARIOUS TIMES, AND SEEMINGLY MORE IN THE RAIN AND FOG, THOUGH NOT EXCLUSIVELY. THEY OCCURRED ONCE WHEN LEAVING A STOPLIGHT AT A LOW SPEED TURNING LEFT, ON THE FREEWAY, ON STREETS AROUND 30/35 MPH AND AT IDLE AT FULL STOP.     MOST OCCURRENCES WERE WHILE DRIVING ON REGULAR CITY STREETS WHERE WE DID MOST OF THE DRIVING ON THAT TRIP IN SAN JOSE, MONTEREY AND CARMEL. THE WORST WAS RIGHT BEFORE THE PEBBLE BEACH CONCOURS D'ELEGANCE, AFTER I HAD DRIVEN NORTH FROM SAN DIEGO ON A CONTINUOUS FREEWAY DRIVE IN THE RAIN. IT MAY JUST BE A COINCIDENCE, BUT ALL THREE OF THE FIRST INSTANCES IN THE FIRST WEEK OF RENTAL OCCURRED AFTER AT LEAST AN HOUR DRIVE ON THE FREEWAY.   IN SAN JOSE, I IMMEDIATELY REQUESTED A REPLACEMENT  CAR BUT THEY HAD NONE.THE SECOND DRIVER IMMEDIATELY NOTICED ISSUES WITH THE CAR, BUT WE WERE TOLD THERE WERE NO OTHER CARS AVAILABLE.    I THINK EITHER THE COMPUTER CIRCUITS WERE CORRODED AND/OR DAMAGED OR DAMP.  *TR",
        "vin": "1C4RDHEG9FC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/20/2016",
        "dateOfIncident": "12/10/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10936594,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN PARK, ENGINE RUNNING, WHILE OWNER WAS PUMPING GAS AT THE STATION. WITH THE DRIVER'S DOOR AJAR, HE WAS STANDING OUTSIDE FOR SEVERAL MINUTES AND SUDDENLY THE VEHICLE TOOK OFF IN REVERSE. VEHICLE WAS IN PARK AND NOT MOVING FOR THE SEVERAL MINUTES WHILE PUMPING GAS. THE VEHICLE TOOK OFF, DRAGGED OWNER BY THE OPEN DOOR UNDER THE VEHICLE AND RAN HIS LEG OVER. CONTINUED MOVING UNTIL IT HIT A POLE. OWNER WAS HOSPITALIZED.  *TR",
        "vin": "1C4RDJEG5GC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10925961,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS AGO WE HAD A CAR ACCIDENT, IT WAS A FRONT IMPACT BETWEEN 40 AND 45 MPH, THE VEHICLE WAS A TOTAL LOSS BUT THE AIRBAG SYSTEM DIDN'T DEPLOY WITH THE IMPACT.",
        "vin": "1C4RDHAG9GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "10/18/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917680,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN NORTHERN NEW YORK. ON THE MORNING OF 10/18/2016, MY 11Y/O DAUGHTER BUCKLED HER 7Y/O SISTER IN THE BACK PASSENGER SEAT OF OUR 2016 DODGE DURANGO.  OUR 11 Y/O THEN ENTER THE FRONT PASSENGER SIDE AND SHUT THE DOOR.  THE DURANGO THEN POPPED OUT OF PARK AND ROLLED DOWN OUR STEEP DRIVEWAY WITH OUR TWO DAUGHTERS INSIDE.  MY 11 Y/O HAD ENOUGH SENSE TO JUMP TO THE DRIVERS SIDE AND HIT THE BRAKES.  THE VEHICLE WAS NOT RUNNING AND THE KEYS WERE NOT IN THE VEHICLE.  MY DAUGHTER COULD NOT STOP THE VEHICLE AND IT WENT PARTIALLY OVER A 25' EMBANKMENT, AS MY WIFE WAS WALKING OUT DOOR TO GET IN THE CAR.  MY KIDS WERE NOT INJURED AND I CREDIT MY DAUGHTER FOR THAT BY SLOWING DOWN THE VEHICLE.  THE LOCAL DEALERSHIP HAS BEEN GREAT AND IS BEHIND US 100% BUT DODGE HAS BEEN LESS THAN HELPFUL, AND MAKE IT SOUND LIKE THERE IS NOTHING THEY CAN DO.  I'M NOT SURE THEY UNDERSTAND HOW BAD THIS COULD HAVE BEEN.  AGAIN THE VEHICLE IS A 2016 DODGE DURANGO WITH THE ROTARY SHIFTING KNOB.  IT WAS NOT RUNNING, NO KEYS IN IT, AND NO ONE WAS IN THE DRIVERS SEAT. MY KIDS ARE TERRIFIED TO EVER GET IN THAT CAR AGAIN AND MY WIFE AND I WOULDN'T ANYWAY BECAUSE IT IS UNSAFE.  DODGE MAKES IT SOUND LIKE BECAUSE THE DEALERSHIP FOUND NO FAULT CODES THERE IS NOTHING THEY CAN OR WILL DO.  I CALL DODGE EVERYDAY AND I FEEL THEY DON'T UNDERSTAND THE SERIOUSNESS OF THIS COMPLAINT.",
        "vin": "1C4RDJDG3GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2016",
        "dateOfIncident": "10/09/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916715,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTONOMOUS ACCELERATION. THE VEHICLE WITHOUT DRIVER ASSIST ACCELERATED TWICE WHEN PULLING INTO PARKING SPOTS. IN BOTH CASES I WAS MAKING A LEFT TURN INTO A PARKING SPOT WHEN THE ACCELERATION COMMENCED. ONLY BY STANDING ON THE BRAKE WHILE AT SAME TIME PLACING THE VEHICLE IN PARK AND PRESSING ENGINE OFF BUTTON WAS I ABLE TO STOP VEHICLES FORWARD MOTION. THE DURANGO CAME CLOSE TO RAMMING PARKED CAR IN THE SPACE IN FRONT OF THE ONE I WAS PULLING INTO. DURANGO HAD APPROX. 3000 MILES ON ODOMETER WHEN THE 2 INCIDENTS OF ACCELERATION OCCURRED. THE INCIDENTS OCCURRED ON CONSECUTIVE DAYS, OCT 9 & 10, AFTER DRIVING THE VEHICLE APPROX. 6-8 HOURS STRAIGHT EACH DAY. PURCHASING DEALER WAS CONTACTED IMMEDIATELY TO INFORM IT'S SERVICE DEPARTMENT OF THE 2 INCIDENTS. VEHICLE WAS TAKEN TO AN OUT OF AREA DEALER ON THE MORNING FOLLOWING 1ST INCIDENT. THEY READ THE FAULT CODES AND INFORMED ME THAT NOTHING REGISTERED OTHER THAN THE ECM HAD BROKEN CONTACT. UPON THE OCCURRENCE OF 2ND INCIDENT WE CUT SHORT OUR TRIP AND RETURNED TO OUR HOME SO THAT WE COULD TAKE VEHICLE TO PURCHASING DEALER, SUBURBAN CHRYSLER IN FARMINGTON HILLS MICHIGAN.  AFTER TWO DAYS IN SERVICE THE REPORT THAT CAME BACK WAS NO PROBLEM FOUND.  MY CONCERN IS THAT THIS ACCELERATION COULD OCCUR DURING A MORE PROBLEMATIC SITUATION WHERE ABILITY TO CONTROL DURANGO WILL BE LIMITED WHICH COULD RESULT IN BODILY INJURY OR PROPERTY DAMAGE. LETTERS OF RECORD HAVE BEEN SENT TO [XXX], CEO DODGE, AND [XXX], SERVICE MGR AT SUBURBAN CHRYSLER IN FARMINGTON HILLS MI. I HAVE TAKEN PHOTOS OF BRAKE & GAS PEDDLES TO SHOW THERE RELATION TO A WEATHER TECH WHICH THE DEALER HAS SUGGESTED AS A POSSIBLE CAUSE FOR ACCELERATION.     CONSUMER STATES THERE WERE 2 MORE OCCURRENCES. DASH BOARD WENT COMPLETELY BLANK DURING LAST OCCURRENCE. CONSUMER BELIEVES FAILURE IS RELATED TO A CRUISE CONTROL RECALL.*DL    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR  *TR *JS",
        "vin": "1C4RDJEG4GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911253,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL ARBITRATION DATA TO NCDS:  1.DURANGO 2016 WAS PURCHASED ON 30 APRIL 2016 WITH THE FORWARD COLLISION WARNING SYSTEM (FCWS) WITH BRAKE ASSIST AS AN OPTION.  THIS AND THE ADAPTIVE CRUISE CONTROL (ACC) SYSTEM WAS APP $2K AS A SAFETY OPTION.   HTTP://WWW.DODGE.COM/EN/DURANGO/SAFETY_SECURITY/ .   THIS WEBSITE DESCRIBES THE FEATURE.  2.ATTACHED FILE CAPTURE 6 AND 7 DESCRIBE THE FEATURE: 'FCWS PROVIDES THE DRIVER THE OPPORTUNITY TO BE NOTIFIED VIA AUDIO OR VISUAL ALERT AND IF THE SITUATION MERITS, A LEVEL OF BRAKING TO HELP SLOW THE VEHICLE AND FINALLY IF THE FCWS EVENT BEGINS BELOW 26 MPH, THE SYSTEM MAY PROVIDE MAXIMUM OR PARTIAL BRAKING TO MITIGATE FORWARD COLLISION.' THIS INFORMATION IS FROM DOCUMENT DOWNLOADED FROM CORPORATE WEBSITE TITLED 2016 DURANGO OM 4TH.PDF PAGE 229 /230 DESCRIBING THE FEATURE.  3. I HAVE ATTEMPTED TO RESOLVE THIS ISSUE FOR OVER 6 WEEKS THROUGH THE CHRYSLER RESOLUTION CENTER CASE # 29403021 WORKING WITH PENNY @ 214-583-2188. SHE INFORMED ME THAT IF THE ACC SYSTEM IS WORKING THEN THE FCWS 'SHOULD' WORK BECAUSE THERE ARE NO ERROR CODES.  I HAVE TAKEN THIS VEHICLE TO BOTH LITHIA DODGE IN LAS CRUCES, NM AND SUNLAND DODGE IN EL PASO TX WHERE THE VEHICLE WAS PURCHASED. SERVICE REPRESENTATIVES FROM BOTH DEALERSHIPS TEST DROVE THE VEHICLE AND ENCOUNTERED SIMILAR SITUATIONS IN TRAFFIC CONSISTING OF POTENTIAL COLLISION WITH ANOTHER VEHICLE BUT THE SYSTEM NEVER PROVIDED AUDIO/VISUAL OR LIMITED BRAKING ASSISTANCE AS ADVERTISED. HOWEVER, CHRYSLER RESOLUTION'S POSITION IS THAT IF THERE ARE NO ERROR CODES, AND THE ACC WORKS, THEN THE SYSTEM 'MUST/SHOULD' BE WORKING.   THAT IS NOT THE CASE FOR FCWS.  ACC DOES WORK.    SINCE THEN:  1. ROAD DEMO CONDUCTED WITH VEHICLE AND SYSTEM DOESN'T WORK.,  2. ORIGINAL COST OF OPTION WAS REFUNDED.  3. PREFER FAULT BE FIXED AND WILL RETURN REBATE TO DEALER  4. FILES DOCUMENT THE HISTORY OF THIS PROBLEM.",
        "vin": "1C4RDHEG7GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/16/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907065,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE DRIVING 55 MPH, THE BRAKES ENGAGED WITHOUT WARNING AND ALMOST CAUSED A CRASH. THE VEHICLE FISHTAILED DOWN THE INTERSTATE AND SPUN AROUND IN THE DIRECTION OF ONCOMING TRAFFIC. THE CONTACT WAS ABLE TO PULL THE VEHICLE OVER TO THE SHOULDER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 2,000.",
        "vin": "1C4SDHCT1GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE DRIVING 10 MPH, THE VEHICLE INDEPENDENTLY ACCELERATED TO 35 MPH WITHOUT WARNING. IN ADDITION, THE RPMS REVVED AND THE INSTRUMENT PANEL ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 981. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903737,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE DRIVING 10 MPH, THERE WAS AN ABNORMAL RATTLING NOISE IN THE REAR OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE LOAD LEVELING SHOCKS NEEDED TO BE REPLACED. THE CONTACT WAS INFORMED THAT THE REMEDY PART WAS ON A NATIONAL BACK ORDER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 600. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "09/03/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10903739,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT CRUISING SPEED ON THE HIGHWAY, THE FRONT PASSENGER \"ACTIVE HEAD RESTRAINT\" DEPLOYED FOR NO REASON. NO IMPACT, NO LARGE BUMP OR POTHOLE...JUST RANDOM. IT HIT MY WIFE IN THE HEAD/NECK.",
        "vin": "1C4SDJCT0GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902022,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC START/STOP FEATURE FAILS TO RESTART THE ENGINE AFTER FOOT IS REMOVED FROM BRAKE.  THE ERROR MESSAGE APPEARS IN THE INFORMATION SYSTEM \"CYCLE SHIFT TO PARK THEN RECYCLE TO DRIVE\".  THE D FLASHES ON THE DASHBOARD  AND THE D ON THE GEAR SHIFT SELECTOR FLASHES. THIS NORMALLY HAPPENS AT A TRAFFIC LIGHT BUT MAY OCCUR DURING A SHORT STOP PRIOR TO TURNING OR MERGING ONTO A STREET.  THIS CAUSES A DANGEROUS PAUSE THAT COULD RESULT IN A REAR END COLLISION BY BEING HIT FROM BEHIND.  THERE IS A FUNCTION BUTTON TO DISABLE THE START/STOP FEATURE BUT THE DEFAULT POSITION ON ENGINE START IS ON.",
        "vin": "1C4RDHDG7GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898192,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER/TRANSMISSION ISSUES.  CAR BROKE DOWN AND COULD NOT PUT IN PARK BECAUSE THE COMPUTER THOUGHT MY SPEED WAS TOO HIGH EVEN THOUGH I WAS STANDING STILL.  ONCE THE CAR WAS TOWED TO THE DEALER IT MOVED FORWARD WHILE IT WAS IN PARK. (VIDEO EVIDENCE) IN A PREVIOUS INCIDENT THE CAR WAS PLACED IN PARK AND NOT TURNED OFF.  I EXITED THE VEHICLE WITH THE ENGINE STILL RUNNING.  THE CAR  IDLED FORWARD ON ITS OWN DAMAGING A GARAGE AND THE CAR ITSELF.   INITIALLY, I THOUGHT THIS WAS DUE TO ME NOT PUTTING THE CAR IN PARK BUT NOW I DON'T BELIEVE THIS WAS THE CASE.  I BELIEVED THE CAR TO BE IN PARK BUT THE ELECTRONIC TRANSMISSION CONTROL KEPT THE DID NOT RECOGNIZE THAT VEHICLE WAS IN PARK.",
        "vin": "1C4RDJEG5GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896226,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RENTAL CAR. CABLES FOR GPS AND PHONE WRAPPED AROUND ROTARY SHIFT CONTROL. WHEN THEY WERE MOVED WHILE AT STOP LIGHT, TRANSMISSION WENT FROM DRIVE TO REVERSE. WHEN FOOT WENT FROM BRAKE TO ACCELERATOR, CAR MOVED BACKWARDS RATHER THAN FORWARD. ROTARY CONTROL SHOULD BE HARDER TO MOVE, EVEN WHEN BRAKE IS APPLIED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895405,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V352000 (AIR BAGS); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE APPROXIMATE FAILURE MILEAGE WAS 58,000. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.",
        "vin": "1D4HD38NX6F"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884582,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASE, IMMEDIATELY WE STARTED HAVING PROBLEMS WITH HEADLIGHT NOT WORKING, THEN A REAR LIGHT AND BRAKE LIGHT NOT WORKING. TOOK IN FOR RECALL ON ANOTHER PART AND THEY DISCOVERED IT WAS THE ELECTRICAL, WHILE DRIVING AND SITTING AT LIGHTS. LIGHTS ON DASH, RADIO, HEADLIGHTS, ETC, NOT WORK PROPERLY OR ALL SUDDEN DECIDE NOT TO WORK AT ALL. WE'VE TAKEN IT BACK NOW 5 TIMES. MECHANIC SAYS THE WHOLE WIRING HARNESS IS BAD AND CANNOT BE REPAIRED, BUT CONTINUES TO SAY THEY CALLED CHRYSLER FOR PARTS TO TRY TO REPAIR. WHILE MY 83 YRS OLD DAD WHO BOUGHT THE CAR, LEFT SITTING AT THE DEALER FOR 4-5 HOURS EVERY TRIP AND NO RENTAL VEHICLE AVAILABLE FROM ENTERPRISE OR HERTZ. AFTER SITTING THERE 5 HOURS TODAY, WE HAD TO LEAVE VEHICLE. THIS TIME, WE ARE READY TO CALL ATTORNEY FOR LEMON LAW IN MISSOURI.",
        "vin": "1C4SDJCT1GC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/15/2016",
        "dateOfIncident": "02/24/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849836,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 DODGE DURANGO. WHILE DRIVING 55 MPH, THE CONTACT NOTICED THAT THE DRIVER SIDE DOOR WAS AJAR. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 12.",
        "vin": "1C4RDJDG1GC"
    }
]