[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "Evergreen Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870894,
        "products": [
            {
                "manufacturer": "Evergreen Recreational Vehicles, LLC",
                "productMake": "EVERGREEN",
                "productModel": "AMPED",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A RV TECH, WE USED TO SALE EVERGREEN, AMPED TRAILER.  THE ONAN GENS ARE NOT INSTALLED PROPERLY, NOT VENTED PROPERLY,THE ELECTRICAL WIRES ARE NOT RUN IN CONDUCT, CARBON MONOXIDE DETECTOR GOES OFF AFTER GENERATOR RUNS FOR A SHORT TIME, ON SOME MODELS THE EXHAUST PIPE IN RUN UNDER THE SLIDE OUT.  EVERGREEN WILL NOT DO ANYTHING TO REPAIR THE PROBLEM AND SOMEONE IS GOING TO END UP DEAD OR A HOLE FAMILY COULD END UP DEAD IF THEY FALL ASLEEP AND THE CARBON MONOXIDE DETECTOR IS INOP.   PLEASE TAKE A LOOK INTO THE INSTALL OF THE GENERATORS ON THE TRAILERS BEFORE SOMEONE IS SERIOUSLY INJURED. I HAVE SEEN THIUS ON EVERY TRAILER WE HAVE RECEIVED SENSE 2014 OR MAYBE EVEN LONGER.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/09/2015",
        "dateOfIncident": "07/08/2015",
        "fire": false,
        "manufacturer": "Evergreen Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732999,
        "products": [
            {
                "manufacturer": "Evergreen Recreational Vehicles, LLC",
                "productMake": "EVERGREEN",
                "productModel": "AMPED",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 EVERGREEN AMPED. WHILE DRIVING AT 55 MPH, THE TIRES ON THE PASSENGER SIDE DETACHED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE WHEEL STUDS FRACTURED AND CAUSED THE WHEELS TO DETACH FROM THE VEHICLE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 900.",
        "vin": "5ZWTMUE22G1"
    }
]