[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047087,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A GENERAL COMPLAINT AGAINST ALL NEW BLUE AND BRIGHTER HEADLIGHTS. THEY ARE A SAFETY HAZARD.  ESPECIALLY IN THE NEW F 150 AND SIMILAR BIG PICK UP TRUCKS  WHEN ONE IS BEHIND YOU, THEY ARE HIGHER THAN YOUR CAR AND IT IS LIKE SHINING A SPOTLIGHT IN YOUR CAR. WILL TEMPORALITY BLIND YOU. WHEN ONE COMES AT YOU EVEN WITH LOW BEAMS THEY ARE A SAFETY HAZARD. AT FIRST I THOUGHT IT WAS A AGE ISSUE. BUT FOUND OUT LAST WEEK AT EYE DOCTOR PEOPLE OF ALL AGES ARE COMPLAINING  WAS ALMOST IN ROAD RAGE OVER A LARGE PICKUP TRUCK THAT FOLLOWED  ME ON MY BUMPER WITH THOSE BRIGHT,  BRIGHT BLUE HEADLIGHTS. . WERE THEY EVEN STUDIED  BEFORE THE WERE APPROVED FOR USE. A CAR WAS AT AN INTERSECTION NEXT TO ME WITH A BLUE LIGHT TRUCK BEHIND HER. HER CAR WAS LIT UP LIKE A CHRISTMAS TREE. SHE HAD TO TURN HER REAR VIEW DOWNWARD TO BLOCK THE GLARE. DO NOT EVEN LOOK IN REAR VIEW MIRROR, WHICH MAGNIFYS THE LIGHTS AND MAKES THEM WORSE. IF YOU ARE AT AN INTERSECTION FACING ONE OF THESE CARS OR TRUCKS WITH NEW HEADLIGHTS, AND THE ROAD IS SLIGHTLY HIGHER THAN YOUR SIDE, YOU ALMOST WANT TO JUMP OUT OF YOUR CAR AND PUT YOUR HANDS AN SIDE OF CAR AND WAIT FOR A PAT DOWN. PLEASE CAN YOU LOOK  INTO THIS SITUATION. IT WILL ONLY GET WORSE AS MORE NEW CARD ARE COMING OUT WITH THESE NEW BRIGHTER ANNOYING UNSAFE LIGHTS,   THANK YOU",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993136,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "1. VEHICLE CLUNK AND LURCH FORWARD RIGHT BEFORE IT REACHES COMPLETE STOP.  2. WITH FULLY ALIGNED WHEELS, THE STEERING WHEEL CAN NOT BE CENTERED WHEN GOING STRAIGHT. VEHICLE WANDERS ON PERFECTLY LEVELED ROAD.",
        "vin": "1FTEW1EG7GF"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2017",
        "dateOfIncident": "08/09/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938984,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONICS ON THE DASH RESET, CAUSING THE RADIO TO MALFUNCTION AND OTHER RELATED ISSUES WITH DATE, TIME AND RADIO PROGRAMS, DIMMING CONTROLS, AND UNKNOWN OTHER ISSUES. THE DEALER RESETS, BUT I HAVE TOO KEEP RETURNING FOR CORRECTIONS. THIS MUST BE COMPLETED BY A THIRD PARTY. THIS IS NOT CORRECT AS I HAVE NO IDEA WHAT OTHER COMPONENTS ARE AFFECTED. BY THIS. THE DEALER SAYS THE DASHBOARD SYSTEMS MAY NEED TO BE EXCHANGED. WHY?",
        "vin": "1FTEX1C86GF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "12/13/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935146,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON SANTA FE BLVD IN DENVER CO. WAS COMING TO A RED LIGHT, PRESSED THE BRAKES  AND THEY WENT TO THE FLOOR, SWERVED INTO NEXT LANE WITH CARS FURTHER AWAY, AND AVOIDED A CRASH AS THE LIGHT CHANGED.. THIS IS A VERY HEAVY TRAFFIC AREA AND I AM  LUCKY TO NOT HAVE CAUSED A ACCIDENT INVOLVING SEVERAL CARS.. LAWSUIT APPROPRIATE !  *TR",
        "vin": "1FTEW1EGXGK"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "10/11/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915364,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT BRAKE FAILURE. BRAKES FEEL \"SPONGY\". CAR SLOWED SLIGHTLY, HOWEVER PEDAL WAS PRESSED TO THE FLOOR, WITH NO IMMEDIATE RESPONSE IN BRAKING.",
        "vin": "1FTEW1EG8GF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY TRUCK JUNE 18TH 2016.  AFTER THE FIRST COUPLE OF DAYS THE RADIO STARTED GOING OFF FOR PERIODS OF TIME.  THE RADIO WORK PROBABLY HALF OF THE TIME.  I FINALLY HAD TIME TO BRING IT IN AND FORD TELLS ME THEY ARE AWARE OF THE ISSUE, BUT DO NOT KNOW HOW TO FIX THIS YET.  A RADIO IS A EVERY DAY PART OF A TRUCK AND IS EXPECTED TO WORK.  UNDER AN IMPLIED WARRANTY IT SHOULD WORK.  THE WARRANTY OF MERCHANTABILITY IS IMPLIED, UNLESS EXPRESSLY DISCLAIMED BY NAME, OR THE SALE IS IDENTIFIED WITH THE PHRASE \"AS IS\" OR \"WITH ALL FAULTS.\" TO BE \"MERCHANTABLE\", THE GOODS MUST REASONABLY CONFORM TO AN ORDINARY BUYER'S EXPECTATIONS, I.E., THEY ARE WHAT THEY SAY THEY ARE.  THIS IS NOT HAPPENING AND THEY DON'T KNOW WHEN THEY WILL HAVE A FIX.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2016",
        "dateOfIncident": "04/27/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862311,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 F150 COMPANY VEHICLE SUDDENLY SLOWED TO A CRAWL, AND I HAD TO TOW IT TO THE DEALER.  THE DEALER SAYS THAT THE ELECTRONIC THROTTLE BODY (ETB) NEEDS TO BE REPLACED.  PROBLEM IS THE THERE WERE DOZENS OF OTHER VEHICLES IN THE DEALERSHIP WITH SAME PROBLEM, AND THE PART IS IN BACK ORDER.  THIS IS A BRAND NEW VEHICLE!!  IT WILL TAKE AT LEAST 2 WEEKS TO GET THE PART ACCORDING TO THE DEALER....WOW!!  I READ ONLINE THAT BACK IN 2012 SIMILAR PROBLEMS WERE INVESTIGATED BY NHTSA, AND FORD \"AGREED\" TO REPLACE THE PART ON 1.6MM VEHICLES, AND DECLARED THE PROBLEM SOLVED!!  I THINK THE PROBLEM IS FAR FROM SOLVED IF IT IS HAPPENING TO DOZENS OF NEW VEHICLES IN ONE DEALERSHIP!!  IMAGINE THE PROBLEM WHOLE COUNTRY WIDE AND/OR WORLD WIDE.  THE PROBLEM WAS NOT EVEN CALLED A RECALL IN 2012!  MY COMPANY NOW HAS TO RENT A VEHICLE UNTIL A REPLACEMENT PART IS SHIPPED.  THEY SAY 2 WEEKS, PROBABLY MORE TIME SINCE IT IS THEIR ESTIMATE!!  THIS ISSUE HAS TO BE INVESTIGATED.",
        "vin": ""
    },
    {
        "components": "STEERING,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/11/2016",
        "dateOfIncident": "04/03/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854768,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FORD E-150. THE CONTACT STATED THAT WHILE DRIVING AT CERTAIN SPEEDS, THE STEERING WHEEL AND THE ENTIRE FRONT DRIVER SIDE SEAT VIBRATED. THE VEHICLE WAS TAKEN TO THE DEALER BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6,500. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    }
]