[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "07/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Fleetwood Flair RV built on a 2016 Ford F53 Chassis. The contact stated that the dealer had repaired the seat belt bolts upon purchasing the RV; however, while her husband was driving approximately 55-65 MPH in the mountains with her in the front passenger’s side seat, the front driver's side seat belt detached from the wall while it was buckled. The contact's husband pulled to the side of the road. Upon inspecting the front passenger's side seat belt, the contact's husband noticed that it was also loosened. The RV was taken to the dealer and was being repaired. The manufacturer was notified of the failure and informed the contact that the dealer should contact them to obtain the schematic of the wall where the seat belts were supposed to be bolted. The failure mileage was approximately 24,000.",
        "vin": "1F64F5DY8G0"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "07/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113121,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FORD F-53. WHILE DRIVING IN A RAIN STORM, THE WINDSHIELD WIPERS FAILED TO OPERATE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO REPAIRED THE WINDSHIELD WIPERS, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THOR MOTOR COACH (701 COUNTY ROAD 15, ELKHART, IN 46516) WHERE THE CONTACT WAS NOT INFORMED OF A DIAGNOSIS; HOWEVER, THE VEHICLE WAS REPAIRED. THE CONTACT STATED THAT THE FAILURE PERSISTED. THE VEHICLE WAS THEN TAKEN TO CAMPING WORLD OF OAKWOOD (4696 SMITHSON BLVD, OAKWOOD, GA 30566, (888) 425-9114), BUT THEY WERE UNABLE TO DIAGNOSIS A FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 9,078.",
        "vin": "1F66F5DY2G0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "10/20/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088932,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW IN AUGUST, 2016.  ONE MONTH LATER WE DROVE OUR NEW MOTORHOME SOUTHWEST INTO NM AND AZ.  AT 2735 MILES ON THE ODOMETER IN CENTRAL NM WE GOT TWO BRAKE SYSTEM WARNING LIGHTS WHILE TRAVELING WEST ON I-40 AT 65 MPH.  WE STOPPED TO INSPECT SYSTEM.  FRONT BRAKE ROTORS WERE EXTREMELY HOT!  FRONT MASTER CYLINDER CHAMBER SPILLED OUT EXTREMELY HOT BRAKE FLUID!  I ADJUSTED IT'S LEVEL THEN CHECKED REAR CHAMBER.  IT WAS ABOUT 2' BELOW CORRECT LEVEL.  I FILLED TO CORRECT LEVEL.  FOR SEVERAL HOURS BEFORE THIS I NOTICED A VERY HARD BRAKE PEDAL WITH DECREASING BRAKE EFFICIENCY.  WE STOPPED IN ALBUQUERQUE, NM AND CONTACTED BOTH FORD DEALERS ADVERTISING RV/TRUCK SERVICE.  WE WOULD HAVE TO WAIT 7 WORKING DAYS JUST TO GET INTO THEIR SHOPS!  THEY DID SCAN OUR VEHICLE AND TURNED OFF THE WARNING LIGHTS.  THIS HAS REACCURED TWICE SINCE THEN.  OUR MOTORHOME CURRENTLY HAS 7785 MILES ON IT AND WE CAN'T TRUST THE BRAKES.  BEING IN THE CAR BUSINESS FOR OVER 50 YEARS MY GUESS IS THIS SYSTEM IS TRYING TO STOP OUR 18,000 POUNDS WITH FRONT BRAKES ONLY.  WE PULL A 2011 JEEP WRANGLER WITH IT.  THE JEEP HAS A FULLY FUNCTIONAL 'BRAKE BUDDY' ALWAYS INSTALLED AND OPERATING.",
        "vin": "1F66F5DY2G0"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/31/2017",
        "dateOfIncident": "05/27/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992385,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL TRANSFER SWITCH BUZZES AFTER ONE TO TWO HOURS OF PLUGGING IN. LOUDER AFTER MORE HOURS.   HYDRAULIC JACK PUMP REPLACED TWICE IN FIRST YEAR AND NEEDS REPAIR OR REPLACE AGAIN AFTER 13 MONTHS.",
        "vin": "1F66F5DY0G0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906754,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW.  TOOK HOME FROM DEALER AFTER CUSTOMER INSPECTION BUT BATTERIES WERE DEAD PREVENTING FULL OPERATION OF AMENITIES.  SIX DAYS AFTER BEING HOME, WE WERE GOING TO TAKE THE MOTORHOME ON A TRIP.  KITCHEN SLIDE WAS OPEN SINCE WE BROUGHT IT HOME.  TRY TO RETRACT KITCHEN SLIDE AND IT JAMMED.  PROBLEM IS THE ROOM SLIDE IS TOO BIG FOR THE OPENING IN THE WALL CAUSING UNIT TO BIND (ONE MOTOR WORKS, OTHER DOES NOT)  OVERLOADING AND BURNING OUT MOTORS.  ALSO, METAL SCREWS DRIVEN IN TO CHANNEL IN WALL GOING TO SLIDE MOTORS PENETRATED RED WIRE TO FRONT SLIDE MOTOR. MOTORHOME HAD 270 MILES ON IT WHEN BROUGHT HOME AND SLIDE JAMMED ON FIRST  CLOSING OPERATION BY CONSUMER/OWNER.  PROBLEM NOTED WHEN IN YARD AT HOME (STATIONARY) BUT DIAGNOSED AT DEALER.",
        "vin": "1F65F5DY1G0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905645,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES WHEN STARTING FROM A DEAD STOP THE ENGINE CUTS BACK TO IDLE, PAUSES THEN SPEEDS BACK TO NORMAL THEN GOES THRU THIS CYCLE TWO OR THREE TIMES BEFORE GETTING UP TO SPEED.. IT IS DANGEROUS WHEN PULLING OUT INTO TRAFFIC.",
        "vin": "1F65F5DEY3G"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893899,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ATWOOD HEATER COVER VENTS FACING INWARD CAUSING WATER TO SHORT CIRCUITS. COULD CAUSE FIRE AND BURN RV. WINDSHIELD WIPER SYSTEM ARMS FELL APART WHILE IN USE RENDERI G SYSTEM INOPERATIVE. THOR MOTORCOACH WILL NOT SEND PARTS AND THESE ARE KNOWN DEFECTS TO THEM. HAVE SUBMITTED PICTURES AND IGNORED.",
        "vin": "1F66F5DY8F0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/04/2016",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882452,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INOPERABLE TOW/HAUL MODE. 2016 FORD F53 STRIPPED CHASSIS FOR MOTORHOME CONSTRUCTION. NEWMAR BAY STAR SPORT 2705. THE TOW/HAUL MODE IS A MODE THAT ALLOWS UTILIZING ENGINE AND TRANSMISSION FOR VEHICLE DECELERATION, ESPECIALLY DOWN HILL. IF THE TOW/HAUL MODE IS OPERATING PROPERLY, THIS DYNAMIC BRAKING CAN EASE THE LOAD ON THE VEHICLE'S BRAKES. OVERHEATED BRAKES CAN RESULT IF THE TOW/HAUL IS INOPERABLE. OVERHEATED BRAKES IS MOST DEFINITELY A SAFETY ISSUE. THE TOW/HAUL MODE HAS BEEN MADE OPERATIONAL FROM A THIRD PARTY VENDOR, SO IT IS FIXABLE BY SOFTWARE ALONE. UNFORTUNATELY, THE 3RD PARTY COST IS IN THE RANGE OF $500. THIS IS AN ISSUE THAT THE OEM OF THE POWERTRAIN (FORD) CAN AND SHOULD FIX AS SOON AS POSSIBLE. IT HAS BEEN INOPERABLE SINCE THE DAY OF PURCHASE (1-15-2016).",
        "vin": "1F65F5DY7G0"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2016",
        "dateOfIncident": "02/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876692,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOW / HAUL MODE NOT WORKING CORRECTLY  ITS ON ALL THE TIME   COMING DOWN A GRADE IF YOU LET OFF THE GAS IT STARTS TO DO A HARD DOWNSHIFTING OF THE TRANSMISSION EVEN IF ITS NOT NECESSARY  ITS NOT THE  WAY IT WAS DESIGNED TO WORK THERE IS A BUTTON TO TURN ON OR OFF THAT DOES NOT FUNCTION.",
        "vin": "1F65F5DY1G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876020,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 THOR HURRICANE MOTOR HOME WITH THE FORD F53 18K CHASSIS HAS A TOW-HAUL MODE IN THE TRANSMISSION. ACCORDING TO ALL FORD PUBLICATIONS, INCLUDING THE OWNER'S MANUAL, WHEN IN THE TOW-HAUL MODE THE TRANSMISSION SHOULD DOWNSHIFT EACH TIME THE BRAKES ARE APPLIED. THIS DOES NOT HAPPEN ON MY UNIT AND NUMEROUS OTHER UNITS WITH THE 16K AND 18K GVWR CHASSIS. I BASE THIS ON NUMEROUS COMMENTS ON THE IRV2 FORUM. THIS IS A DANGEROUS CONDITION IN HILLY/MOUNTAINOUS TERRAIN WHERE LONG AND STEEP DOWN GRADES ARE ENCOUNTERED. WITHOUT THE ENGINE BRAKING SUPPOSED TO BE DELIVERED BY THE TOW-HAUL FUNCTION, ALL BRAKING MUST BE DONE BY THE SERVICE BRAKES. ON LONG GRADES THIS CAN RESULT IN OVERHEATED BRAKES THAT LOSE THEIR EFFECTIVENESS, CREATING A POTENTIALLY DANGEROUS SITUATION.",
        "vin": "1F65F5DY6G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874519,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 JAYCO ALANTE MOTORHOME ON A FORD F53 CHASSIS 16000 GVWR. WHEN OPERATING IN THE TOW/HAUL MODE, NO ENGINE BRAKING IS AVAILABLE AS DESCRIBED IN THE OWNERS MANUAL (PAGE 32, 33). THIS CAUSES A POTENTIALLY UNSAFE CONDITION IN ALL MODES OF TRAVEL, ESPECIALLY DESCENDING A HILL OR MOUNTAIN AS BRAKE OVERHEATING OR FAILURE OR FIRE COULD OCCUR. I HAVE READ OTHER SIMILAR REPORTS ON SEVERAL RV FORUMS TO INCLUDE IRV2.COM. FORD MOTOR COMPANY HAS TOLD OTHERS THAT THERE IS NOT A PROBLEM, BUT MY PREVIOUS TWO MOTORHOMES WITH SIMILAR ENGINE AND TRANSMISSION EQUIPMENT PERFORMED PERFECTLY AS ADVERTISED.THIS CONDITION SHOULD DEFINITELY BE ADDRESSED BY THE MANUFACTURER.",
        "vin": "1F64F5DY8G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/09/2016",
        "dateOfIncident": "05/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873425,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016ITASCA MOTORHOME ON A 2016 FORD F53 26000 POUND CHASSIS. THE FORD POWERTRAIN IS EQUIPPED WITH A TOW/HAUL SELECTOR. THE TOW/HAUL MODE IS USED FOR VARIOUS REASONS, ONE OF THEM IS THE CAPABILITY OF AUTOMATICALLY DOWN-SHIFTING WHEN DESCENDING STEEP GRADES AND DURING HARD-STOPS. THIS IS NOT THE CASE WITH MY 2016 POWERTRAIN, IT ACTS NO DIFFERENT WHEN IN TOW/HAUL OR NOT.THIS IS A DANGEROUS CONDITON ON DECENDING HILLS. BRAKES COULD FAIL DUE TO OVERHEATING.",
        "vin": "1F66F5DY6G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853054,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 THOR MOTORHOME ON A 2016 FORD F53 18000 POUND CHASSIS.  THE FORD POWERTRAIN IS EQUIPPED WITH A TOW/HAUL SELECTOR.  THE TOW/HAUL MODE IS USED FOR VARIOUS REASONS, ONE OF THEM IS THE CAPABILITY OF AUTOMATICALLY DOWN-SHIFTING WHEN DESCENDING STEEP GRADES AND DURING HARD-STOPS. THIS IS NOT THE CASE WITH MY 2016 POWERTRAIN, IT SIMPLY ISN'T WORKING AT ALL. NO DIFFERENCE BETWEEN NORMAL-MODE AND TOW/HAUL MODE.  THIS IS \"MAJOR\" SAFETY ISSUE WHEN DESCENDING GRADES OR PANIC STOPPING AS YOU HAVE ZERO \"ENGINE-BREAKING\". I HAVE DRIVEN MY NEW MOTORHOME ABOUT 1000 MILES SINCE PURCHASING IN FEBRUARY 2016.  WHEN EXITING OFF THE INTERSTATE FOR FUEL STOPS OR REST AREAS I HAD TO REALLY APPLY THE CHASSIS BRAKES MUCH HARDER THEN \"NORMAL\" DUE TO NO ENGINE-BREAKING.  THIS IS A DANGEROUS SITUATION AND ACCORDING TO SOCIAL MEDIA AS WELL AS OTHER PUBLIC FORUMS, IRV2, THOR FORUMS, ETC. THERE ARE NUMEROUS EARLY MODEL 2016 F53 FORD CHASSIS WITH THE SAME \"DANGEROUS\" ISSUE.",
        "vin": "1F65F5DY6G0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2016",
        "dateOfIncident": "09/20/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819990,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PAGE 32 OF THE OWNER'S MANUAL STATES IN PART, \"THE TOW HAUL FEATURE: PROVIDES ENGINE BRAKING IN ALL FORWARD GEARS, WHICH WILL SLOW YOUR VEHICLE AND ASSIST YOU IN CONTROLLING YOUR VEHICLE WHEN DESCENDING A GRADE.\"  I HAVE DESCENDED SEVERAL 8 PERCENT GRADES WITH THE TOW HAUL FEATURE OF MY TRANSMISSION ENGAGED AND HAD TO ENGAGE MY BRAKES EXCESSIVELY BECAUSE THE TRANSMISSION DID NOT DOWNSHIFT TO PROVIDE ENGINE BRAKING AS DESCRIBED.  THIS COULD LEAD TO BRAKE FAILURE OR PREMATURE BRAKE REPLACEMENT.  I HAVE TAKEN MY VEHICLE TO 2 AUTHORIZED FORD SERVICE SHOPS WITH THIS COMPLAINT WITHOUT RECEIVING ANY CORRECTIVE ACTION.  THE FEEDBACK I HAVE RECEIVED IS THAT FORD DENIES THERE IS A PROBLEM.  I HAVE SEEN SEVERAL SIMILAR COMPLAINTS INVOLVING THE 2016 FORD F53 MOTORHOME CHASSIS ON A OWNERS FORUM WEBSITE: WWW.IRV2.COM/FORUMS/53.  MY TESTIMONY IS POSTED UNDER HFBUNDY.  OTHER OWNERS DESCRIBING ISSUE WITH THE TOW FUNCTION INCLUDE SUPERLUCKY, STUART W, YELLOWBOAT, JHARRELL,  AND ED RZEPKA.  I PURCHASED THIS UNIT IN SEPTEMBER 2015.  ALSO, MY SERVICE ADVISER WHERE I PURCHASED MY MOTORHOME SAYS HE HAS HEARD OF ISSUES INVOLVING THE PERFORMANCE OF THE TOW HAUL MODE FOR THIS MODEL.",
        "vin": "1F65F5DY6G0"
    }
]