[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11364743,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "BERKSHIRE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WENT TO GET FOOD AND I STAYED IN MOTORHOME, I TRIED TO OPEN DOOR TO TAKE DOG FOR WALK BUT DOOR WOULD NOT OPEN. GOOGLED IT AND SAW MANY OTHERS HAD SAME PROBLEM, I AM DISABLED BUT WAS SOMEHOW ABLE TO CRAWL OUT WINDOW AFTER BEING TRAPPED INSIDE FOR OVER AN HOUR.NOW STUCK IN THE MIDDLE OF NOWHERE.",
        "vin": "1F65F5DY3F0"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192925,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "BERKSHIRE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER SIDE WHEELWELL LINER'S TWO SELF TAPPING SCREWS STRIPPED FROM BEING ATTACHED TO AN ALUMINUM FRAME. THE LINER ALSO HAD AN ALUMINUM TUBE ATTACHED TO THE LINER BUT WAS IN NO WAY SECURED TO THE VEHICLE'S FRAME EXCEPT FOR THE TWO SCREWS AND FOAM SELANT. THIS FAULTY SECURING OF THE LINER ALLOWED NORMAL WIND FROM DRIVING ON THE HIGHWAY TO STRIP THE TWO SCREWS FROM THE ALUMINUM FRAME AND SEALANT CAUSING THE LINER TO FLAP UNCONTROLLABLY UNDER THE FRAME AND IN THE WHEELWELL AREA.",
        "vin": "4UZFCHCY3GC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918946,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "BERKSHIRE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASING OUR FOREST RIVER BERKSHIRE XL ON AUGUST 1, 2016, I WAS FOLLOWING MY WIFE DURING THE DAY TIME, SHE NOTICED THE HEADLIGHTS DID NOT LOOK CORRECT. THIS WAS ACKNOWLEDGED BY DEALER.  THEIR SERVICE PERSONNEL WORKED ON CORRECTING THE HEADLIGHTS FOR 5 HOURS ON AUGUST 2, 2016. THE FOLLOWING NIGHT I COULD NOT SEE THE ROAD AND HAD TO CLOSELY FOLLOWED MY WIFE WHO WAS DRIVING OUR CAR TO THE RV PARK. I DID NOT DRIVE AT NIGHT UNTIL AFTER I TOOK THE UNIT TO THE FACTORY IN ELKHART, INDIANA ON AUGUST 24TH.  THE NIGHT AFTER I LEFT ELKHART ON AUGUST 26TH  I TESTED THE HEADLIGHTS FROM HIGH BEAMS TO LOW BEAM AND THEY WOULD TURN OFF COMPLETELY FOR ABOUT 10 SECONDS.  AGAIN I HAD TO NOT DRIVE AT NIGHT UNTIL I RETURNED TO FACTORY AGAIN ON SEPTEMBER 11TH. THEY TOLD ME THEY WERE WORKING ON A RECALL FOR THIS HEADLIGHT DESIGN. I'M TRYING TO HELP THEM ACHIEVE THIS BY REPORTING THIS HAZARDOUS DESIGN. WHEN YOU ARE DRIVING ON A HIGHWAY AT 65 MPH A LOT CAN HAPPEN IN 10 SECONDS. THIS IS A SAFETY ISSUE WITH  THIS HEADLIGHT THAT SHOULD BE RESOLVED.  *TR",
        "vin": "4UZAB2CY4GC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907538,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "BERKSHIRE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FOREST RIVER BERKSHIRE. WHILE DRIVING WITH THE LOW BEAM HEADLIGHTS ACTIVATED, THE LIGHTS WOULD NOT ILLUMINATE BRIGHT ENOUGH TO SEE THE ROAD. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 4,500.",
        "vin": "4UZFCHCY8GC"
    }
]