[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344279,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UNIT HAS CASTLE-ROCK 225/75/15 ORIGINAL TIRES INSTALLED ON UNIT. AUGUST OF 2019 WAS RETURNING HOME FROM A TRIP IN PANAMA CITY BEACH FLA, HAD A BLOWOUT IN DOTHAN ALA. DID NOT THINK OF A DEFECTIVE TIRE AT THE TIME AND JUST CONSIDERED IT BAD LUCK.I REPLACE THE BLOWN TIRE WITH THE NEW SPARE THAT CAME WITH THE UNIT AND HAD NEVER TOUCHED THE GROUND.SAME MAKE AND MODEL AND DROVE APPROXIMATELY 100 MILES HOME.HAD THE ORIGINAL SPARE MOUNTED ON THE ALLOY WHEEL TO MATCH ALL OTHER WHEELS AND NEW SPARE MOUNTED ON THE SPARE WHEEL. DID NOT USE AGAIN UNTIL AUGUST 4,2020. LEFT FOR TRIP AND DROVE APPROXIMATELY ON HWY 231 IN SEALE ALA JUST ANOTHER 100 MILES AND HAD ANOTHER BLOW THAT SEVERELY DAMAGED THE RV SKIRTING, UNDER CARRIAGE,ELECTRICAL WIRING AND WHEEL WELLS ON BOTH SIDES OF THE RV.I STARTED RESEARCH AND FOUND THE CASTLE ROCK TIRES ARE THE ROOT CAUSE OF THE PROBLEM. I HAD ALL TIRES REPLACE BEFORE HEADING BACK HOME AND THE TIRE DEALER INFORMED ME ALL ORIGINAL TIRE ON THE RV WERE ALL SEPARATING AND I WOULD NOT HAVE MADE IT HOME WITHOUT ANOTHER BLOW OUT . LINKS BELOW OF CASTLE ROCK TIRE SEPARATION.  HTTPS://WWW.NCCONSUMER.ORG/NEWS-ARTICLES/POTENTIAL-TIRE-DAMAGE-PROMPTS-RV-RECALL-FROM-FOREST-RIVER.HTML,HTTPS://WWW.FORESTRIVERFORUMS.COM/FORUMS/F30/CASTLEROCK-TIRE-FAILURE-WARRANTY-115943.HTML,HTTPS://WWW.IRV2.COM/FORUMS/F50/SO-CALLED-CHINA-BOMB-TIRES-368480-2.HTML. I DO HAVE TEH TIRES AND CAN SEND PICTURES OF DAMAGE IF NEEDED.",
        "vin": "4X4TSBC21GU"
    },
    {
        "components": "SUSPENSION,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230779,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEBRUARY 2016 WE PURCHASED A 2016 SALEM FOREST CAMPER.  WE ONLY PULL IT LESS THAN 6 TIMES A YEAR (LESS THAN 161 MILES EACH WAY).  WE WERE HAVING FLAT TIRES (BLOW OUTS) ON MOST TRIPS CAUSING DAMAGE UNDERNEATH AND DAMAGE ON BOTH SIDES.  PRIOR TO THE BLOW OUT THE CAMPER PULLS TO ONE SIDE MAKING IT DIFFICULT TO CONTROL, YOU HEAR A POP AND THEN LESS THAN A MINUTE YOU HAVE A TIRE THAT HAS PEELED ITSELF LIKE AN ONION.  IT APPEARS THAT THE CAMPER COMES DOWN ONTO THE TIRES.  THIS HAS HAPPENED EVERY YEAR WE HAVE PULLED IT.  THE LAST TIME WAS MAY 24, 2019.*DT *DT *DT  CONSUMER STATED TIRES WERE PURCHASED LAST YEAR. MANUFACTURER WAS CONTACTED. CAMPER IS CURRENTLY AT GANDER OUTDOORS OF ROANOKE,VA. *JB *DT *DT  VEHICLE IS BEING REPAIRED.*JB  COINSUMER STATED REPLACEMENT TIRES FAIL AS WELL. LIBBERT VERBALLY SAID THE SPRINGS WERE ALMOST FLAT AND THE BOLTS ARE ABOVE THE TIRES CAUSING THEM TO PEEL LIKE AN ONION. LIPPERT OF COURSE DIDN'T PUT ANYTHING IN WRITING PUT AUTHORIZED \"IN GOOD FAITH\" 2 NEW AXLE KITS WHICH INCLUDE THE SPRINGS. THEY ARE NOT COVERING INSULATION. SUBMITTED TO FOREST RIVER REGARDING THE BOLT. THERE WERE OBVIOUSLY SEVERAL ISSUES MAKING MY CAMPER UNSAFE TO PULL. *JB",
        "vin": "4X4TSMG26G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/03/2018",
        "dateOfIncident": "07/02/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105430,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KIDDE FIRE EXTINGUISHER PROVIDED BY THE MANUFACTURER WAS THE SUBJECT OF A RECALL DUE TO POTENTIAL FAILURE TO OPERATE.  THE RECALL ID REFERENCED BY THE MANUFACTURER IS 17V756.  IT APPEARS THAT KIDDE HAS REPORTED THE RECALL CORRECTIVE ACTIONS COMPLETE.  THEY ARE NOT.  I REPORTED MY VEHICLE (A TRAVEL TRAILER) TO KIDDE IN MARCH 2018 AND HAVE YET TO RECEIVE A REPLACEMENT FOR THE RECALLED EXTINGUISHER.  ON 2 JULY 2108 I WAS TOLD THAT THEY ARE NOT ABLE TO PROVIDE REPLACEMENT EXTINGUISHERS TO CUSTOMERS IN ALASKA, HAWAII, OR PUERTO RICO DUE TO SHIPPING RESTRICTIONS.  THE PRODUCT WAS SOLD IN A LOCALE THAT IS PART OF THE UNITED STATES BUT KIDDE IS UNWILLING TO PROVIDE SERVICE TO THE LOCALE WHERE THEIR PRODUCT WAS SOLD.",
        "vin": "4X4TSMU29GT"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/21/2018",
        "dateOfIncident": "04/14/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089216,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIQUID PROPANE (LP) LINE DOES NOT HAVE ENOUGH CLEARANCE CAUSING EXCESSIVE FRICTION ON METAL BAR RESULTING IN CREATING A HOLE IN THE GAS LINE. WHICH CAUSES A PROPANE LEAK AND POSSIBLY RESULTING INTO AN UNWANTED FIRE. CAMPER WAS IN A PARKED POSITION WHEN NOTICED. *TT  *TR",
        "vin": "4X4TSBF22GU"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "02/08/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080405,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FOREST RIVER SALEM CRUISE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V756000 (EQUIPMENT). THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. THE CONTACT WAS UNABLE TO HAVE THE RECALL REPAIR COMPLETED DUE TO THE MANUFACTURER NOT COMMUNICATING WITH THE CONTACT. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS CONTACTED AND COULD NOT CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4X4TRND24G9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002033,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FOREST RIVER SALEM. THE CONTACT STATED THAT THE REAR OUTDOOR KITCHEN DOOR FLAP LATCHING MECHANISM FAILED TO REMAIN SECURE. AS A RESULT, THE DOOR FLAP FELL DOWN AND STRUCK THE CONTACT'S WIFE IN THE HEAD. SHE WAS NOT INJURED. THE VEHICLE WAS TAKEN TO THE TOY HAULER LIQUIDATION DEALER, IN ROCKLIN, CA WHERE THE LATCH WAS REPLACED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,500.",
        "vin": "4X4TSBC20GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "05/12/2017",
        "fire": true,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986098,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL DEVICE CAUGHT FIRE AND CAUSED SIGNIFICANT DAMAGE TO THE RV.  HEAVY SMOKE AND DAMAGE TO ELECTRICAL WIRING",
        "vin": "4X4FSBE20GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883123,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW TRAVEL TRAILER WAS SOLD BY CAMPING WORLD WITH BIAS PLY AND RADIAL TIRES MIXED ON THE AXLES, WATER TANK WAS LEFT UNBOLTED FROM FRAME AND ELECTRICAL UNDER THE TRAILER WAS FIXED WITH WIRE NUTS.    THIS IS ALL A SERIOUS SAFETY DEFECTS, THAT COULD LEAD TO MAJOR PROBLEMS ON THE HIGHWAYS, PULLING THE TRAILER HOME IT HAD MAJOR SWAY PROBLEMS.  I DONT KNOW IF THE FOREST RIVER FACTORY BUILT IT THIS WAY OR CAMPING WORLD DID IT.",
        "vin": "4X4TSMG24G8"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/31/2016",
        "dateOfIncident": "05/29/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871527,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FOREST RIVER SALEM. THE CONTACT STATED THAT THE GREY WATER TANK DETACHED WHILE THE RV WAS IDLE. THE VEHICLE WAS NOT TAKEN TO AN INDEPENDENT MECHANIC OR DEALER TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    }
]