[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "11/07/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384455,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STRAP THAT HOLDS THE SEWER DRAIN PIPE BROKE. THIS IS A VERY COMMON PROBLEM AND THERE WAS A RECALL ISSUED FOR MODEL YEARS 2018 THROUGH 2020. I BELIEVE THE RECALL SHOULD BE EXPANDED. LUCKILY FOR ME, THIS HAPPENED CLOSE TO HOME SO IT DID NOT CAUSE DRAIN PIPE DAMAGE AND I WAS ABLE TO GET A TEMPORARY FIX TO MAKE IT THE REST OF THE WAY HOME.",
        "vin": "4X4TRPT16GL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "06/29/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888820,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "UNEXPECTED TIRE FAILURE; BLOWOUT OCCURRED THROUGH THE TREAD OF THE TIRE, INSTEAD OF SIDEWALL; SUSTAINED SIGNIFICANT DAMAGE TO THE PASSENGER SIDE OF VEHICLE, INCLUDING A LOST FENDER, BENT FRAMING, AND LOSS OF FLOORING MATERIAL. FENDER HAS BEEN REPLACED, FRAMING AND FLOORING MATERIAL HAS NOT BEEN REPLACED. THE BRAND NAME OF TIRE IS NOT LISTED AS AN OPTION WITHIN THE FOLLOWING CATEGORIES ON THE FOLLOWING PAGE (CASTLE ROCK ST). THESE TIRES WHICH WERE PURCHASED ON THE 2016 FORESTRIVER SALEM HEMISHPHERE LITE HAVE BEEN REPLACED DUE TO ALARMING REVIEWS, BEING REFERRED TO AS \"CHINABOMBS\", AND THE MANUFACTURING DATE BEING WITHIN THE LAST MONTHS OF 2014. WEIGHT RATINGS AND SPEED RATING BARELY MEET THE DOT STANDARD FOR THE GVWR OF   14, 020LBS. THE MANUFACTURE FOR \"CASTLE ROCK ST\" CAN NOT BE LOCATED ON THE INTERNET ONLY WHOLESALE DEALERS.",
        "vin": "4X4FSBN22GU"
    }
]