[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "This is a complaint update#498946. I made all the necessary repairs outlined and detailed on the diagnostic report issued by the dealership. I picked my vehicle up on Thursday evening. I got up at 6:00 on Friday March 18th and noticed my OnStar diagnostic report had come through at 12:00 am and stated there was a problem with my emissions/transmission. I immediately at 8:30 called GMC manufacturing and they told me to take the vehicle back and GMC manufacturing made me a 1:00 appointment for the same say while I was on the phone. I had to be at work at 12 noon so my husband took it there and came back and told me that my transmission was bad. The dealership offered to but my vehicle back fir $18,500 or pay for the repairs myself $3.909. I asked for assistance since this was the initial problem I took it in for and it has network weeks and I haven’t heard anything. This month is my 2 year anniversary of owning it. I informed the dealership about the Special Warranty coverage and they stated that this was not covered but I explained to them that the coverage is limited to 150,000 miles and that my vehicle only has 120,000 miles on it so I am confused and seeking clarification and explanation from a higher source and no one has contacted in 2 weeks.",
        "vin": "1GKKVTKD3GJ"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "12/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Low oil pressure warning,  engine shutoff. Vehicle was equipped with oil life monitoring. It was at 20%, when engine shutting down. Engine seized,  called tow truck. Towed to shop. The only report was to the dealership and the repair shop. Possible high oil consumption.   The warning was last minute,  barely had time to react.",
        "vin": "1GKKVTKDXGJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448756,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 GMC Acadia. The contact indicated while driving at various speeds the vehicle had experienced random jerking and hesitation. The vehicle was taken to an independent mechanic who diagnosed that the engine control module was faulty. The engine control module was replaced but the failure continued to occur. The vehicle was then taken to the local dealer who diagnosed that the rack and pinion and power steering pump were faulty and needed to be replaced. The vehicle was not yet repaired. The manufacturer was notified of the failure. The failure mileage was 70,000.",
        "vin": "1GKKVTKD3GJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/14/2021",
        "dateOfIncident": "08/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "This complaint is not just about this particular vehicle. It's about all vehicles. Seat belts only have one latch. If that latch is damaged in an accident you are trapped. Over 60% of the people killed in auto accidents were not wearing a seatbelt. Why? Because of the fear of being trapped. All first responders carry a seat belt cutter. There are a lot of seat belt cutters on the market today. That proves to me that a seat belt will trap you in a vehicle in its present design. In an accident the seat belt shoulder portion will tighten down. Under pressure, it will not release until you back off the pressure. Under certain circumstances you may not be able to back off the pressure which causes difficulty to release the belt. I have designed, manufactured, and installed a prototype of belt release in my vehicle. I call it my Designated Emergency Seatbelt Hinge. I have also filed for, and received a patent for my design. I believe all vehicles should have an D E S H installed. I don't understand why seat belts only have one release point.",
        "vin": "1GKKRRKDXGJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 GMC Acadia. The contact stated that the driver’s side seat control panel had detached from the seat without warning. The contact had initially taken the vehicle to a dealer where the seat panel was replaced out of pocket. Recently, the contact discovered that the same panel was fractured for the second time. The dealer was notified of the failure and the contact made another appointment with the same dealer for the same failure. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was approximately 50,000.",
        "vin": "1GKKRtKD3GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422190,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Multiple AC system failures - Rear evaporator core failed in summer 2020. Had the unit replaced at a the dealership. Nine months later the front evaporator core failed. From discussion with numerous mechanics these parts should not be failing. Vehicle has less than 40k miles on it and I am the original owner.",
        "vin": "1GKKVTKD3GJ"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING HOSE RUBBED/MELTED FROM BEING TOO CLOSE TO THE ENGINE FRAME.  HAD IT REPLACED IN 2019 BY DEALERSHIP.   NOW IT IS HAPPENING AGAIN IN 2021 AND DEALERSHIP SAYS THE BRACKET FOR THE ENGINE NEEDS TIGHTENED SO IT DOESN\u0092T KEEP OCCURRING.  IT WILL COST OVER $2000 TO GET THIS FIXED AGAIN. AIR BLOWS HOT AIR IN REAR AND PASSENGER SIDE AC VENTS AND DRIVER SIDE IS GETTING WARMER AS WELL.  AIR DOESN\u0092T NOT BLOW COLD WHEN STATIONARY OR WHILE DRIVING.",
        "vin": "1GKKRRKD9GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 GMC ACADIA DENALI THAT HAS A \"SERVICE SIDE DETECTION\" ERROR ON THE DIC.  CALLED IN THE GMC AND THERE IS A SPECIAL COVERAGE ADJUSTMENT #N172097060 ON THIS ISSUE.  IT IS SUPPOSED TO BE VALID FOR 6 YEARS / 80,000 MILES.  MY ACADIA HAS 41,000 ON IT.  WHEN GMC ENTERED MY VIN, IT DOESN'T SHOW UP AS BEING COVERED?? HOW CAN SOME BE COVERED AND SOME NOT IF THEY ALL SEEM TO HAVE THIS ISSUE?",
        "vin": "1GKKVTKD6GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405437,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. THE CONTACT STATED WHILE DRIVING AT LOW SPEEDS, THE STEERING WHEEL WAS DIFFICULT TO TURN. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE CONTACT CALLED MARVIN K. BROWN AUTO CENTER (1441 CAMINO DEL RIO S, SAN DIEGO, CA 92108, (619) 272-6867) HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED OR INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 43,000.",
        "vin": "1GKKRTKD0GJ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "02/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402713,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR PRESENTED WITH ISSUE 'PASSENGER PRESENCE MODULE MALFUNCTION CHECK CIRCUIT' THAT PER GMC SERVICE ADVISOR MAY AFFECT THE PROPER AIRBAG DEPLOYMENT DURING AN ACCIDENT. CAR ONLY HAS 35K MILES AND BARELY USED SINCE PURCHASED BACK IN 2015. NOW  THEY ARE NOT BEING COVERED FOR REPAIR/REPLACEMENT.",
        "vin": "1GKKRTKD6GJ"
    },
    {
        "components": "LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THE \"SIDE DETECTION SYSTEM\" FAIL TWICE IN 2 YEARS.  I SEE THERE IS AN OPEN RECALL (N172097060) FOR THIS ISSUE BUT THIS DOES NOT COME UP SAYING MY VEHICLE IS AFFECTED WHEN I SEARCH THE VIN.  I BELIEVE THERE IS MORE VEHICLES INCLUDED THAN THE 131,652 THEY IS CLAIMED IN THIS REPORT.",
        "vin": "1GKKVTKDXGJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390272,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 49000 MILES ON MY 2016 GMC ACADIA, MY CHECK ENGINE LIGHT CAME ON, I TOOK IT TO THE DEALERSHIP THE NEXT DAY AND THEY TOLD ME THAT I HAD TO REPLACE MY GAS PEDAL...I HAVE OWNED NUMEROUS OTHER VEHICLES AND NEVER ONCE HAD I HAVE REPLACE MY GAS PEDAL. THIS IS A HUGE SAFETY CONCERN BECAUSE ACCORDING TO THE SERVICE ADVISER IF NOT REPLACED IT MAY CAUSE MY VEHICLE TO ACCELERATE WITHOUT ME PRESSING ON THE PEDAL.",
        "vin": "1GKKVPKD2GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/24/2020",
        "dateOfIncident": "12/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384877,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED USING MORE GAS WHEN THE CHECK ENGINE LIGHT CAME ON   THE DEALER SAID IT WAS THE TORQUE CONVERTER AND IT IS LOCKING UP.IT COULD FAIL WHEN DRIVEN",
        "vin": "1GKKVPKD8GJ"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/16/2020",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SEAL BELT LATCH BROKE DUE TO AN \"INTERNAL FAILURE\".",
        "vin": "1GKKVPKDXGJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/30/2020",
        "dateOfIncident": "10/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AND I WENT TO TURN THE CORNER AS I SLOWED TO TURN THE CORNER THE STEERING WHEEL WOULDN'T TURN, I HAD TO HOT MY BRAKES BECAUSE IT SCARED ME THAT MY CAR WOULDN'T TURN, THE CARS BEHIND ME HAD TO GO AROUND ME, I THOUGHT I WAS ABOUT TO CAUSE A WRECK BECAUSE MY STEERING WHEEL WOULDN'T TURN. I FINALLY GOT IT TO TURN BUT IT WAS REALLY HARD. I WAS THANKFUL MY KIDS WERE NOT IN THE CAR. I TOOK MY CAR IN TO GET LOOKED AT AND THEY SAID I NEED A NEW STEERING RACK, I ONLY HAVE 60,000 MILES ON IT. THEY SAID REPAIRS ARE GOING TO COST $1,200 OR MORE. I CALLED 5 DIFFERENT REPAIR SHOPS AND THEY ALL SAID, THAT IT WAS COMMON ON THE GMC ACADIA AND OTHER GMC VEHICLES. THEY ALSO TOLD ME AT ONE TIME GMC HAD MORE RECALLS THEN THEY HAD VEHICLES ON THE ROAD. WISH I WOULD OF KNOWN THIS PRIOR TO BUYING.  COULDN'T IMAGINE WHAT IT WOULD OF BEEN LIKE TO LOSE IN OF MY OWN KIDS ARE SOMEONE ELSE FOR A VEHICLE PROBLEM THAT HAS BEEN KNOWN TO THE MAKERS BUT NOT EVERY PURCHASER.",
        "vin": "1GKKVRKD4GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AC WAS BLOWING HOT AT LESS THAN 42K MILES.  IT HAPPENED OUT OF THE BLUE WHEN I PUSHED THE AC BUTTON IT WOULD JUST BLINK, LIGHT WOULD TURN OFF AND IT WOULD BLOW HOT AIR.  THERE WAS NO WARNING OF A LEAK OR ANYTHING WRONG BEFORE THIS POINT.  THE DEALERSHIP FOUND THE ISSUE TO BE 'LEAK COMBINATION MANIFOLD LINE RUBBING AGAINST R/F BODY BEAM'.  IT WAS NECESSARY TO REPLACE A/C COMBINATION MANIFOLD IN ADDITION TO EVACUATING AND CHARGING THE AC COMBINATION LINES AND IT COST ALMOST $900 FOR THIS REPAIR.  I SHOULD HAVE LEAKING AC HOSES OR RUBBING AGAINST THE MANIFOLD WITH MILEAGE THIS LOW.",
        "vin": "1GKKVTKD3GJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/30/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352100,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER JUST SOPPED WORKING UNEXPECTEDLY.  WAS DRIVING AT NIGHT AND IT STARTED RAINING HARD AND WIPERS WOULD NOT MOVE. NO PREVIOUS ISSUE WITH SYSTEM.  NOTHING TO INDICATE A FAILURE WAS GOING TO OCCUR.",
        "vin": "1GKKRRKD6GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF POWER STEERING SYSTEM - AT LOW SPEEDS, POWER STEERING ASSISTANCE IS NOT ACTIVE. VERY DIFFICULT TO TURN STEERING WHEEL FROM A STOPPED POSITION OR MOVING AT LOW SPEED. THIS PRESENTS A SAFETY RISK IN THE ABILITY TO AVOID PEDESTRIANS, VEHICLES OR OTHER OBJECTS WHILE DRIVING AT SLOW SPEEDS, MOST NOTABLY PARKING LOTS.  CONDITION STARTED AROUND THE 50,000-MILE MARK. AFTER FURTHER EXAMINATION, FLUID APPEAR TO BE LEAKING FROM THE VEHICLE. HAD VEHICLE TAKEN TO GM-CERTIFIED DEALERSHIP FOR SERVICE, AND WAS ADVISED THAT THE POWER STEERING SYSTEM REQUIRED IMMEDIATE ATTENTION.    AFTER FURTHER RESEARCH THERE APPEARS TO BE CONCERNING HISTORY OF POWER-STEERING RELATED FAILURE ON THE GMC ACADIA. PRIOR MODEL YEARS (2007-2011) HAD THE WARRANTY EXTENDED ON THE SYSTEM UPWARDS OF 10 YEARS AND 150,000 MILES. IN ADDITION, A VARIETY OF TECHNICAL SERVICE BULLETINS HAVE BEEN ISSUED ON THE POWER STEERING SYSTEM OF THE 2016 GMC ACADIA. NHSTA DATABASE ALSO POINTS TO A NUMBER OF SIMILAR INCIDENTS, TYPICALLY OCCURRING AROUND THE 50,000 MILE RANGE. THIS INDICATES A LATENT MANUFACTURE DEFECT IN WHICH FURTHER ACTION MUST BE TAKEN TO ADDRESS THIS ONGOING SAFETY ISSUE.",
        "vin": "1GKKVRKD6GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342899,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. THE CONTACT STATED THAT THE TRANSMISSION WAS DEFECTIVE. THE CONTACT STATED THAT THE VEHICLE FAILED TO REVERSE OR GO FORWARD IN EITHER GEAR. THE CONTACT STATED THAT SEVERAL UNKNOWN WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS TOWED TO SANDOVAL BUICK GMC (300 N HAMILTON RD, WHITEHALL, OH 43213) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 200,000.",
        "vin": "1GKKVPKD3G1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331702,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 GMC ACADIA WAS BROUGHT IN FOR A BASIC CAR INSPECTION. THE CAR HAS 54,000 MILES. I WAS TOLD IT FAILED INSPECTION DUE TO THE LEAKING OF STEERING FLUID. I NEEDED A NEW GEAR ASSEMBLY. THE CAR HAD NO ISSUES PRIOR TO THIS AND I TAKE THE CAR REGULARLY TO GMC. FORTUNATELY, I DID NOT GET INTO AN ACCIDENT, BUT I DRIVE 60 MILES A DAY TO WORK AND THIS COULD HAVE BEEN MUCH WORSE. THE TOTAL COST TO HAVE IT FIXED WAS ALMOST $3,000. I DID NOT HAVE THE EXTENDED BUMPER TO BUMPER WARRANTY, SO I HAD TO PAY OUT OF POCKET.AFTER READING MANY COMPLAINTS ABOUT THIS SPECIFIC PROBLEM, I CALLED GMC CORPORATE TO MAKE AN OFFICIAL COMPLAINT WITH THEM. IF YOU OWN THIS CAR AND ARE ANYWHERE FROM 40-70K MILES, PLEASE HAVE THIS CHECKED OUT. I HAVE 2 SMALL CHILDREN AND I COULD HAVE EASILY CRASHED IF I DIDN'T HAVE MY CAR INSPECTED. THIS NEEDS TO BE A RECALL IMMEDIATELY. PEOPLE BUY THIS SPECIFIC CAR, BECAUSE THEY HAVE CHILDREN AND WANT A SAFE VEHICLE. THE FACT THAT THEY HAVE NOT RECALLED THIS ISSUE IS AWFUL. I LOVE AMERICAN CARS, BUT I AM LOSING FAITH IN THEM. PLEASE REPORT THIS PROBLEM, SO THAT MAYBE GMC WILL BE FORCED TO RECALL THE ISSUE AND SAVE LIVES.",
        "vin": "1GKKVTKD0GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/02/2020",
        "dateOfIncident": "05/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 GMC ACADIA SLT-1, 58,000 MILES. TOTAL LOSS OF POWER STEERING BACKING OUT OF A PARKING SPACE WITH NO PRIOR SYMPTOMS. THE CAR WOULD BARELY TURN AT LOW SPEEDS AND MADE A LOUD HOWLING NOISE WHEN WHEEL WAS TURNED. I TOOK THE VEHICLE TO THE DEALER AND THEY TELL ME I NEED THE POWER STEERING PUMP, RACK AND PINION AND ALL NEW HOSES. NO PRIOR WRECKS OR ISSUES. THIS IS RIDICULOUS TO BE HIT WITH A $4100 BILL WITH NO EXPLANATION OF WHY THIS COULD HAPPEN.  *TR",
        "vin": "1GKKVRKDXGJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/01/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326830,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GIVES OUT AT LOW SPEEDS. TOOK IT IN AND WAS TOLD IT'S A CRACKED POWER STEERING FLUID PUMP. $2700. CAR HAS 55,000 MILES AND HAS BEEN MAINTAINED BY DEALERSHIP.  *TR",
        "vin": "1GKKRRKD0GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2020",
        "dateOfIncident": "05/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324894,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SIDE DETECTION SYSTEM WARNING STARTED ALERTING ME A FEW WEEKS BACK. THIS NOW IS THE SECOND TIME THAT IT HAS AFFECTED ALL THE ELECTRONICS IN MY CAR. SENDING ME RANDOM ERROR MESSAGES AND AFFECTING THE CAR FROM OPERATING IN A SAFE CONDITION. CAR WOULD NOT START FOR 40 MIN. ONCE I FINALLY GOT IT STARTED, NONE OF THE GAUGES WORKED AND TURN SIGNALS WERE NOT GOING OFF IN THE CAR. LUCKILY I WAS CLOSE ENOUGH TO HOME, BUT THIS COULD BE A SERIOUS SAFETY ISSUE IF I WAS FAR FROM HOME. CAR WAS NOT IN MOTION AS I STARTED TO NOTICE ISSUES AND PULLED TO THE SIDE OF THE ROAD. NOTICED AS I WAS PULLING UP TO A STOP AND THE BRAKES WERE NOT WORKING CORRECTLY AND STARTED TO GET TRACTION NOTICES FROM THE SYSTEM IN THE CAR.",
        "vin": "1GKKVTKD9GJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321054,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AC MAKES NOISE UNDER HOOD AND DOES NOT GET COLD. MECHANIC SAID AC VERY LOW AND REAR EVAPORATOR IS LEAKING. VEHICLE ONLY HAS 31300 MILES. CHECKED ONLINE AND OTHERS HAVE HAD THE SAME ISSUE WITH THE ACADIA.  *TR",
        "vin": "1GKKRSKD9GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SEEMED TO HESITATE WHILE SHIFTING AND SLIP AT DIFFERENT SPEEDS.  TOOK TO JIM ELLIS MALL OF GA DEALER WHERE THEY DETERMINED THE TORQUE CONVERTER CLUTCH HAD FAILED CAUSING THE SHUTTER AT ALL SPEEDS.  DEALER INDICATED THE COMPLETE TRANSMISSION NEEDED TO BE REPLACED.  VEHICLE ONLY HAD 111,000 MILES AND ALL PREVENTIVE MAINTENANCE PROGRAMS WERE FOLLOWED INCLUDING TRANSMISSION FLUSH AT 65,000 MILES.  VEHICLE IS ONLY 4 YEARS OLD AND NEVER PULLED A TRAILER OR ABUSED IN ANY WAY.  SINCE THE NEW TRANSMISSION WAS INSTALLED, THE OWNER FEELS THE ORIGINAL TRANSMISSION EVER FELT RIGHT BUT CAN'T PROVE IT.",
        "vin": "1GKKRRKD6GJ"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315756,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRACTION WARNING SUDDENLY COMES ON THEN THE STABILITY SERVICE WARNING JUMPS ON....AUTOMATICALLY LOWERING MY SPEED WHILE I'M ON THE FREEWAY DRIVING.  WHEN I PULL OVER AND TURN THE CAR OFF THEN TURN IT BACK ON...THE LIGHT GOES AWAY.  THIS HAPPENED SEVERAL TIMES.  DEALERSHIP CAN NOT FIND ANYTHING WRONG.  IT HAPPENS WHEN I HIT A POT HOLE OR SPEED BUMP",
        "vin": "1GKKRNED0GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300633,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWERING STEERING PUMP STOPPED FUNCTIONING WHILE DRIVING, MAKING IT VERY HARD TO TURN THE WHEEL AT LOW SPEEDS, AS IF THERE IS NO POWER STEERING AT ALL. TOOK IT TO THE DEALERSHIP AND WAS TOLD IT'S A WEAR AND TEAR PROBLEM AND AFTER INVESTIGATING IT I NOTICED THEY HAVE RECALLED OVER 1 MILLION CARS FOR STEERING FAILURE.",
        "vin": "1GKKVRKD6GJ"
    },
    {
        "components": "STEERING,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296936,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT FOR DRIVER DOES NOT SECURE. GMC STATES NOT COVERED UNDER WARRANTY  LEEK IN POWER STEERING. KNOWN ISSUE WITH GMC AND NO RECALLS",
        "vin": "1GKKVPKD7GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296635,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 GMC ACADIA, WITH 30,000 MILES, WELL MAINTAINED.  SUDDENLY MY STEERING WHEEL IS LOCKED WHILE MAKING TURNS AT A LOW SPEED.   THIS WAS VERY SCARY AS MY WHEEL WAS COMPLETELY LOCKED AND I HAD KIDS IN MY CAR.  VEHICLES RUNNING GOOD WHEN AT HIGH SPEED. I HAVE SEEN SO MANY COMPLAIN WITH THE SAME MODEL AND SAME ISSUE, YET, GMC HAS NOT POSTED ANY RECALL ON THEIR VERY DANGEROUS ISSUE.",
        "vin": "1GKKRRKD5GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP  FAILURE OF FRONT SEAL   RESULTING IN RANDOM FAILURE OF POWER STEERING AT LOW SPEED, PARKING AND TURNS AT INTERSECTIONS ETC LEADING TO NEAR COLLISIONS. NO WARNING PRIOR TO FAILURES. 58,000 MILES",
        "vin": "1GKKVTKD6GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281120,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TAKEN IN FOR FAULTY CALIPER, THEN TOLD BY DEALERSHIP WE NEEDED TO FIX A LEAKING POWER STEERING LINE, WE PAID TO FIX BOTH.  TAKEN IN TODAY AND TOLD WE HAVE A LEAKING POWER STEERING GEAR. SAFETY ISSUE $2,065.  58,200 MILES.  COULD LOOSE POWER STEERING DUE TO MULTIPLE LEAKS.  HAVE NOT LOST STEERING YET. MUST GET FIXED.",
        "vin": "1GKKVRKD8GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE MAKES A CLUNK NOISE THAT COMES FROM THE BRAKES OR ABS. AFTER STARTING THE VEHICLE AND TAKING OFF I HEAR THE CLUNK AND FEEL IT ON THE BRAKE PEDAL. THIS HAPPENS EVERY DAY AND EVERY TIME YOU TAKE OF AFTER STARTING THE CAR. THE GM DEALER TOLD ME THEY KNOW THERE IS AN ISSUE/CONDITION THEY ARE AWARE OF BUT IT'S NOTHING TO WORRY ABOUT. THEY ISSUED A BULLETIN ON THIS CONDITION BUT I DON'T FEEL SAFE DRIVING A CAR THAT MAKES THAT NOISE EVERY TIME AFTER TAKING OFF IN THE ABS SYSTEM. THE CODE THEY GAVE ME IS PI1402A",
        "vin": "1GKKVTKD4GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256289,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DETECTION MODULES FAILED, DON'T WORK AND NOTIFY OF BLIND SPOTS",
        "vin": "1GKKVTKD9GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "09/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP FAILURE. WHILE DRIVING MY 2016 GMC ACADIA ON A TRIP OF ABOUT 350 MILES (MOSTLY HIGHWAY) EVERYTHING SEEMED TO BE WORKING FINE UNTIL NEAR THE END OF THE TRIP. AS I EXITED THE HIGHWAY AND STARTED SLOWING DOWN THE STEERING BECAME VERY STIFF AND BY THE TIME I CAME TO A STOP LIGHT I COULD NOT TURN THE STEERING WHEEL AT ALL. WHEN THE LIGHT TURNED GREEN I PRESSED THE GAS PEDAL AND AS THE RPM INCREASED THE POWER STEERING PUMP WORKED GOOD ENOUGH TO MAKE THE TURN AND GET ME HOME. LUCKILY I ONLY HAD ABOUT A MILE TO GO. I CHECKED THE FLUID AND IT WAS LOW SO I TOPPED IT OFF AND RAISED THE FRONT TIRES OFF THE GROUND IN ORDER TO TURN LOCK TO LOCK TO TRY TO GET ANY AIR OUT OF THE SYSTEM. AFTER LOWERING THE VEHICLE I TRIED TO DRIVE IT AND I STILL COULD NOT TURN THE STEERING WHEEL WITHOUT PRESSING THE GAS. AS I LOOKED FURTHER I NOTICED THAT THE HOSE THAT LEADS TO THE POWER STEERING PUMP HAS FLUID ALL OVER IT WHERE IT GOES THROUGH A GROMMET ATTACHED TO THE REAR OF THE ENGINE. THE GROMMET IN THE METAL BRACKET WAS FALLING APART AND THE HOSE APPEARS TO BE CHAFFING ON THE METAL BRACKET. THE LEAK IS VERY SMALL AND THERE'S NO TELLING HOW LONG IT HAS BEEN RUBBING THE BRACKET. THE VEHICLE IS OUT OF WARRANTY BUT ONLY HAS 50K MILES ON IT AND HAS NEVER BEEN WRECKED OR HAD ANY REPAIRS DONE THAT COULD HAVE CAUSED THIS. IT APPEARS TO BE AN IMPROPERLY INSTALLED BRACKET/GROMMET THAT CAUSED THE PROBLEM.",
        "vin": "1GKKRRKD6GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS A 2016 GMC ACADIA DENALI WITH AWD. THE POWER STEERING WAS VERY STIFF WHILE AT LOW SPEEDS WHEN THE WEATHER WAS COLD LAST WINTER. DURING THIS SPRING AND SUMMER THE STEERING CONTINUED TO GET WORSE AND NOW THERE IS NO POWER STEERING AT LOW SPEEDS AND LOW RPM.  THE VEHICLE JUST TURNED 39,000 MILES. THIS MAKES DRIVING VERY DANGEROUS WHILE MAKING TURNS AND TRYING TO PARK THE VEHICLE. THE VEHICLE IS NOW IN THE DEALERS SHOP AND THEY HAVE SAID THE POWER STEERING PUMP AND STEERING GEAR BOTH NEED TO BE REPLACED AS THE PUMP IS FAILING AND THE STEERING GEAR IS LEAKING INTERNALLY.",
        "vin": "1GKKVTKD0GJ"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "08/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY (8/31/2019), I NOTICED THAT THE AC IN MY 2016 ACADIA (ABOUT 79,000 MILES) WOULDN'T TURN ON. MY VEHICLE HAS TWO EVAPORATORS, ONE IN THE FRONT FOR THE FRONT AC, AND ONE IN THE REAR FOR THE REAR AC. THEY ARE CONNECTED BY AN ALUMINUM TUBE (GM PART #23199274). WHEN I TOOK THE VEHICLE INTO THE GMC DEALER, THEY SHOWED ME THAT A CONNECTOR ON THE POWER STEERING FLUID (PSF) LINE, WHICH RUNS BESIDE THIS ALUMINUM TUBE (SEE PHOTO 1), HAD RUBBED UP AGAINST THE ALUMINUM AND WORN A HOLE IN IT, ALLOWING ALL THE REFRIGERANT TO LEAK OUT (PHOTO 2). THERE IS SUPPOSED TO BE A LITTLE RUBBER PIECE THAT FITS OVER AND PROTECTS THE COOLANT LINE (YOU CAN SORT-OF SEE IT IN THE PICTURES), BUT THAT PIECE IS SMALL AND SLIDES DOWN, EXPOSING THE ALUMINUM TUBE. THE TECHNICIAN THEN TOLD/SHOWED ME HOW HE USUALLY BENDS OR MOVES THE PSF LINE SO THAT IT DOESN'T RUB AGAINST THE ALUMINUM COOLANT TUBE. THIS INDICATES THAT GM IS AWARE OF THE ISSUE AND HAS DONE NOTHING IN AN ATTEMPT TO FIX IT, EVEN THOUGH THIS INHERENT DESIGN FLAW ALLOWS THE ENTIRE COOLANT CHARGE TO LEAK INTO THE ATMOSPHERE. NEEDLESS TO SAY, SINCE REFRIGERANT IS NOT EXACTLY ENVIRONMENTALLY FRIENDLY, I FIND IT CONCERNING THAT GM IS APPARENTLY AWARE OF THIS ISSUE AND HASN'T TAKEN THE NECESSARY STEPS (LIKE A VOLUNTARY RECALL) TO FIX IT.  I CALLED THE GM CUSTOMER SERVICE LINE AND MADE THEM AWARE OF THE SITUATION, AND THEY SAID \"THERE IS NOTHING THEY CAN DO.\" I'M HOPING THIS COMPLAINT FORCES THEM TO RESOLVE THE ISSUE AND STOP LEAKING FULL REFRIGERANT CHARGES INTO THE ATMOSPHERE.    NOTE THAT THIS WOULD ALSO BE AN ISSUE IF THE SITUATION WERE REVERSED AND IT WAS THE AC COOLANT TUBE THAT CHAFED THROUGH THE PSF HOSE. IF THE PSF CONNECTOR WAS EVEN 1 CM OFF, THEN HYPOTHETICALLY THE COOLANT TUBE COULD RUB THROUGH THE PSF HOSE AND CAUSE A FAILURE OF THE POWER STEERING SYSTEM. IT IS ALSO DESIRABLE TO AVOID THIS AS WELL, FOR OBVIOUS REASONS.",
        "vin": "1GKKRRKD7GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN A COUPLE OF INSTANCES WHERE THE CAR JUST SHUTS OFF ONCE WHEN TURNING INTO A PARKING SPACE, AND ONCE WHILE SITTING AT A ROUNDABOUT AND THEN I HAVE TO PUT IT IN PARK AND THEN TURN IT BACK ON. IT SEEMS TO WORK FOR A WHILE AFTER THAT, BUT IT IS EXTREMELY FRUSTRATING FOR A CAR THAT IS NOT THAT OLD AND I JUST GOT IT.",
        "vin": "1GKKRRKDXGJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. THE CONTACT STATED THAT THE FRONT PASSENGER WINDOW WAS INOPERABLE. THE CONTACT MENTIONED THAT THE WINDOW WAS NOT ABLE TO BE CONTROLLED FROM THE DRIVER'S SIDE DOOR PANEL. THE VEHICLE WAS TAKEN TO POAGE CHEVROLET (851 W PEARCE BLVD, WENTZVILLE, MO 63385, (636) 327-6268) WHERE THE DRIVER'S SIDE WINDOW CONTROL WAS REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 33,000. *JB",
        "vin": "1GKKRPKD9GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245102,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING HAS COMPLETELY GONE OUT. CAR IS 3 YEARS OLD THIS SHOULDN'T HAPPEN",
        "vin": "1GKKRRKDXGJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/21/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KEY IS STUCK IN THE IGNITION AND WILL NOT RELEASE ON MY 2016 GMC ACADIA. THE BATTERY HAD TO BE REPLACED BECAUSE IT WAS COMPLETELY DRAINING MY ELECTRICAL SYSTEM. IT HAS BEEN DETERMINED THAT MY CAR IS NOT RECOGNIZING IT IS IN PARK TO RELEASE THE KEY. THE FLOOR SHIFTER NEEDS TO BE REPLACED ACCORDING TO MY GMC DEALERSHIP. THIS IS EXTREMELY DANGEROUS AS THE CAR COULD DRIFT AT ANY TIME, NOT TO MENTION THE STRAIN ON THE BATTERY.",
        "vin": "1GKKVRKDXGJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "'TAKATA RECALL' WHILE DRIVING THE VEHICLE IT WILL NOT SHIFT GEARS OR HAS A HARD SHIFT. THE VEHICLE STALLS OUT BEFORE WANTING TO ACTUALLY MOVE WHICH COULD RESULT IN FATAL ACCIDENTS. THE CAR IS NEARLY BRAND NEW WITH THESE TYPES OF ISSUES.",
        "vin": "1GKKRNED2GJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C COMPRESSOR LOCKED UP AND HAS BURNT THE BELT TO ALL PULLEYS.    WAS BEING DRIVEN DOWN HIGHWAY WHICH CAUSED POWER STEERING TO STOP MAKING EXTREMELY DIFFICULT TO STEER ALMOST IN A CRASH.",
        "vin": "1GKKVTKD7GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229649,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD, WE WENT TO MAKE A TURN. THE STEERING WHEEL WOULD WOULD NOT TURN. WE ACTUALLY HAD TO CROSS INTO ONCOMING TRAFFIC UP ON A SIDEWALK.  SINCE THEN IT HAS CONTINUED TO WORK AND THEN SUDDENLY STOP WORKING.",
        "vin": "1GKKRRKD1GJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. WHILE DRIVING 65 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN. AFTER THE FAILURE, THE CONTACT NOTICED MULTIPLE UNKNOWN WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT WAS ABLE TO PARK ON THE SIDE OF THE ROAD. THE VEHICLE WAS ABLE TO BE RESTARTED, BUT WAS LATER TOWED TO MARCHANT CHEVROLET (LOCATED AT 5700 SAVANNAH HWY, RAVENEL, SC 29470, (843) 722-8208). THE DEALER DIAGNOSED THAT THE SERPENTINE BELT, AIR COMPRESSOR, AND FREON NEEDED TO BE REPLACED. THE VEHICLE WAS CURRENTLY BEING REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 53,200.",
        "vin": "1GKKRRKD6GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT IS A SHAME THAT SOME OTHER OLDER CARS LIKE FORD RECEIVE INFOTAINMENT UPGRADE MODULES TO SUPPORT GOOGLE AND APPLE CAR PLAY AND GM DID NOTHING SO FAR",
        "vin": "2GKFLVE3XG6"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217820,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILS WHILE DRIVING DUE TO SUDDEN SUBSTANTIAL FLUID LEAKAGE. COMPLAINTS TO GM ARE UNRESOLCVED WHILE GM CONTINUES TO SELL FLAWED VEHICLES.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "05/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207481,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THE CARS' AIRBAGS DEPLOYED SPONTANEOUSLY, I WAS ON A SMALL STREET , GETTING OUT OF THE GYM'S BUILDING PARKING",
        "vin": "1GKKV9ED7GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207190,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE BLIND ZONE ALERT MESSAGE IS DISPLAYED ON THE DRIVER INSTRUMENT CLUSTER AND SIDE BLIND ZONE LIGHTS IN MIRRORS ARE ALWAYS ON.  CONDITION HAS BEEN INTERMITTENT SINCE ABOUT 50000 MILES AND NOW IS IN THE CONDITION PERMANENTLY RENDERING THIS SAFETY FEATURE USELESS.",
        "vin": "1GKKVRKDXGJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2019",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SCREEN MENTIONS THE STABILITRAK ISN'T WORKING AND THE TRUCK LOOSES POWER AND SHUTS OFF. THE TRANSMISSION ISN'T SHIFTING PROPERLY. THE TRUCK LOOSES POWER OUT OF NO WHERE AL SO SAYING THE TRACTION CONTROL ISN'T WORKING. IT HAPPENS ALL AT RANDOM TIMES.",
        "vin": "1GKKVRKD6GJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206619,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PARKED AND OFF WHEN THE LIFT GATE MALFUNCTIONED.  OPENED THE LIFTGATE USING THE BUTTON ON THE GATE, IT OPENED FULLY PAUSED OPEN, THEN SUDDENLY DROPPED 1/3 OF THE WAY CLOSED ON TOP OF MY HUSBAND, IT OPENED AGAIN AND THEN CLOSED QUICKLY ON IT'S OWN.  IT REPEATED THE SAME ACTION AGAIN WHEN WE TRIED OPENING.  AFTER WE TURNED OFF THE POWER LIFTGATE USING THE BUTTON IN THE DASH WE COULD OPEN THE LIFE HOWEVER WE HAD TO HOLD THE GATE UP, IT WOULD SLAM DOWN IF WE LET GO OF THE GATE.      THE LIFE GATE STRUTS WERE FOUND TO BE LEAKING AND REPAIRED.  IT IS THE EXACT SAME PROBLEM AS FOUND IN THE RECALLED 2010-2012 ACADIAS",
        "vin": "1GKKVRKD7GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206209,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. WHILE ACCELERATING FROM A STOP, THE VEHICLE STALLED AND SHOOK WITHOUT WARNING. THE VEHICLE WAS TAKEN TO KOEPP CHEVROLET (830-253-8000, LOCATED AT 13221 US-87, LA VERNIA, TX 78121) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "1GKKRPKD8GJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START NO INTER LIGHTS DEAD TOWED TO DEALER THEY FIXED IT ONCE I HAD BACK FOR ONE DAY IT HAPPENED AGIN NEEDS A SIDE DENTITION MODULE I HAVE BEEN WAITING FOR OVER 5 WEEKS AND NOTHING NO PARTS",
        "vin": "1GKKVTKD3GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE BLIND SPOT DETECTION MODULES NOT WORKING. THIS CREATES A SAFETY HAZARD IN GENERAL, BUT CAUSES AN ELECTRICAL SHORT INTERNALLY AND CAUSES OTHER ELECTRUCAL PARTS TO MALFUNCTION SUCH AS:  AIR BAGS  IGNITION  BLINKERS  REAR BACK UP CAMERA  FRONT CRASH DETECTION  THESE ARE ALL MAJOR SAFETY ISSUES THAT HAPPEN ON THE ROAD, IN MOTION FOR MY FAMILY IN THE CAR AND OTHERS ON THE ROAD. WE NEED TO GET IT FIXED BUT, PARTS ARE BACK ORDERED AND NOT AVAILABLE FOR ALMOST 6 MONTHS NOW. IT'S A $1200 REPAIR AND IS RE OCCURRING PROBLEM FROM WHAT THE DEALER HAS SAID.. THIS VEHICLE HAS BEEN IN SERVICE FOR JUST OVER 3 YEARS AND SHOULD BE SAFE TO DRIVE FOR A MUCH LONGER DURATION THAN THAT. THANKS",
        "vin": "1GKKVTKD7GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097886,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 GMC ALL WHEEL DRIVE BOTH FRONT WHEEL BEARING WENT OUT AT 26,000 MILES THERE SHOULD BE A RECALL ON THESE . THERE ARE REALLY BAD",
        "vin": "1GKKVNED4GJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "05/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CONCERN WITH ALL 4 OF MY TIRES ON MY 2016 GMC ACADIA. THESE TIRES WERE MANUFACTURED ON THE 10TH WEEK OF 2016. I PURCHASED MY TRUCK 4/12/2016. I HAVE TAKEN MY TRUCK TO GOOD YEAR SERVICE STATION AND GMC AS INSTRUCTED BY GM TO NO AVAIL. THEY ARE SAYING THAT THIS IS WEAR AN TEAR. ALL OF MY TIRES ARE DRY ROTTED. MY TRUCK IS ONLY 2 YEARS OLD AND HAS 22,509 MILES. THE LIFE EXPECTANCY FOR TIRE WEAR AND TEAR IS APPROXIMATELY 6 YEARS. I DO NOT AGREE WITH THIS OUTCOME BECAUSE MY FIANC HAS A CADILLAC ESCALADE 2015 WHICH HE PURCHASED IN 2014 AND HE DRIVES AND HAUL'S CAR AND HIS TIRES ARE IN BETTER CONDITION THEN MINE.  I  HAVE MY GRANDBABIES IN MY TRUCK AND NOW WORRY OF A TIRE BLOW OUT. IF I EXPERIENCE A BLOW OUT I WILL SUE BOTH GOOD YEAR AND GMC. I DON'T FEEL SAFE DRIVING IN MY TRUCK AND I DON'T FEEL THAT I SHOULD PAY OUT OF POCKET WHEN THESE TIRES ARE CLEARLY DEFECTIVE. THE BATCH PERVIOUS TO MY TIRE BATCH WERE RECALLED. WHO'S TO SAY THAT THESE TIRES ARE ALSO DEFECTIVE.  I HAVE ATTACHED PHOTO FOR VERIFICATION.   I AM ASHAMED OF GMC FOR NOT TAKING THIS SERIOUS AS I HAVE. IT JUST DOESN'T MAKE SENSE THAT IN JUST 2 TIRES ALL 4 OF MY TIRES ARE DRY ROTTED! THIS IS UNACCEPTABLE TO ME. ALL I WANTED WAS PEACE OF MIND AND THAT THEY WOULD REPLACE THESE TIRES.   THANK YOU FOR YOUR TIME. I HOPE THIS DOESN'T HAPPEN TO ANYONE ELSE.",
        "vin": "1GKKVPKD4GJ"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 8,
        "odiNumber": 11091687,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 5, 2018, MY FAMILY AND I (FRONT PASSENGER) WERE IN A HEAD ON COLLISION. UPON IMPACT MY SEAT'S LOCKING MECHANISM LOST CONTROL OF MY SEAT CAUSING ME TO BE THROWN FORWARD AND IMPACTING THE DASHBOARD, WHICH I BELIEVE CONTRIBUTED TO MY INJURY, FRACTURED L1 AND L2.",
        "vin": "1GKKRNED8GJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/28/2018",
        "dateOfIncident": "04/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "FORTERA HL",
                "productYear": "9999",
                "size": "P255/65R18 109S",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 2016 GMC ACADIA. IT HAS APPROXIMATELY 24,000 MILES, AND WAS PURCHASED NEW BY ME. THE FACTORY TIRES, GOODYEAR FORTERA HL EDITION, ARE EXHIBITING SIGNIFICANT CRACKING BETWEEN THE TREADS ALL AROUND EACH TIRE. THE TIRES HAVE BEEN PROPERLY MAINTAINED, HAVE EVEN TREAD WEAR, AND ADEQUATE TREAD DEPTH. THERE WAS A RECALL FOR THE SAME ISSUE IN 2015, BUT I WAS ADVISED BY GOODYEAR THAT MY MODEL YEAR IS NOT INCLUDED.",
        "vin": "1GKKVPKD0GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "01/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090311,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFES VEHICLE WHICH IS OUR FAMILY VEHICLE HAS HAD SEVERAL REOCCURRING ISSUES. WE HAVE BROUGHT THE VEHICLE TO THE DEALERSHIP SEVERAL TIMES AND HAVE NOT RESOLVED THE PROBLEM AS IT IS STILL ON GOING. THE PROBLEM DOES NOT HAPPEN ALL THE TIME BUT IS EXTREMELY SCARY. WHILE DRIVING THE VEHICLE WILL ALERT THAT YOU ARE ABOUT TO HAVE A COLLISION BUT THERE IS NOTHING IN FRONT OF YOU JUST A VEHICLE TO THE SIDE OF YOU AND WILL BREAK ON ITS OWN. THIS HAS HAPPENED NUMEROUS TIMES BUT THE DEALERSHIP HAS NOT BEEN ABLE TO REPLICATE THE PROBLEM. WE ALSO HAD SERVICE STABILITRAK, TRACTION CONTROL OFF AND THE SERVICE TRACTION CONTROL LIGHTS COME ON THE DASH WHILE DRIVING. WHEN THESE CAME ON THE VEHICLE STARTED TO SHAKE HORRIBLY AND THE RPM'S DROPPED TO UNDER 1000 WHILE STILL GOING 40 MPH. I HAVE ALSO HAD ON A FEW OCCASIONS THE BACKUP CAMERA SAY VEHICLE GUIDING LINES UNAVAILABLE  WHILE REVERSING AND WHILE DRIVING RANDOMLY THE VEHICLE WITH SAY PARK ASSIST OFF THEN DISAPPEAR AFTER SEVERAL MINUTES. JUST 2 WEEKS AGO I WENT TO START THE VEHICLE AND IT SAID SERVICE THEFT DETERRENT SYSTEM AND WOULD NOT START UNTIL I DISCONNECTED THE BATTERY AND WAITED A FEW MINUTES TO RECONNECT THE BATTERY AND RE-START THE VEHICLE. WE BROUGHT THE VEHICLE TO SHEEHAN GMC IN LIGHTHOUSE POINT FLORIDA 4 TIMES FOR THESE SPECIFIC ISSUES AND RECEIVED NO RESOLUTION. AFTER CONTACTING GMC WE RECEIVED NO ASSISTANCE UNTIL I FILED LEMON LAW WHICH THEN THEY SENT AN ENGINEER WHO STATED AFTER A 2 HOUR INSPECTION THERE WAS NO REPLICATION OF PROBLEMS AND VEHICLE IS OPERATING AS NORMAL. THIS VEHICLE IS A DEATH TRAP AND NOT SAFE TO DRIVE MY FAMILY IN. I WILL NOT PURCHASE ANOTHER GM PRODUCT.",
        "vin": "1GKKRRKD2GJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "08/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "FORTERA HL",
                "productYear": "9999",
                "size": "P255/65R18 109S",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA EQUIPPED WITH GOODYEAR FORTERA HL TIRES, SIZE: P255/6518 109S. WHILE THE VEHICLE WAS STATIONARY, THE CONTACT NOTICED THAT THE FRONT DRIVER'S TIRE, THE REAR DRIVER'S TIRE, AND THE REAR PASSENGER'S TIRE HAD ABNORMAL CRACKS IN THE TREAD NEAR THE WHEEL RIMS. THE CONTACT STATED THAT THE REAR DRIVER'S TIRE HAD A 1/2 INCH CRACK, THE REAR PASSENGER'S TIRE HAD A 2 INCH CRACK IN THE TREAD, AND THE FRONT DRIVER'S TIRE HAD TWO 1/2 INCH CRACKS IN THE TREAD. NORMAN GALE BUICK GMC OF CEDAR KNOLLS, NEW JERSEY WAS MADE AWARE OF THE FAILURE AND STATED THAT THE TIRES WERE OUT OF WARRANTY, BUT THAT THEY COULD BE PRO-RATED BASED UPON THE PERCENTAGE OF TIRE USAGE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 22,000.",
        "vin": "1GKKVPKD0GJ"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012385,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. THE CONTACT STATED THAT WHILE STOPPED AT A TRAFFIC LIGHT, THE VEHICLE BEGAN TO VIBRATE ABNORMALLY. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT FLASHED ON AND OFF AND THE SERVICE STABILA-TRAC WARNING LIGHT ILLUMINATED. THE CONTACT ALSO STATED THAT THE TRACTION CONTROL WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO FAULKNER BUICK GMC TREVOSE LOCATED AT 4427 E STREET RD, TREVOSE, PA 19053, PHONE NUMBER: (267) 984-4658, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THERE WAS AN O2 SENSOR FAILURE, ALONG WITH AN ECM MALFUNCTION, AND FUEL LEVEL SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED SEVERAL TIMES. THE MANUFACTURER WAS NOT CONTACTED AND MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 26,334.",
        "vin": "1GKKRNED4GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/17/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11000142,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA DENALI. WHILE THE DRIVER WAS PLACING THE KIDS IN THE CAR SEAT, WITH THE KEY REMOVED FROM THE IGNITION SWITCH AND THE GEAR SHIFTER IN PARK, A TICKING NOISE WAS HEARD. THE VEHICLE ROLLED AWAY AND CRASHED INTO A PILLAR. THE FUEL TANK RUPTURED AND CAUSED A FIRE. THE VEHICLE WAS TOWED TO A SAFE LOCATION. THE DRIVER SUFFERED MINOR INJURIES AND THE PASSENGERS WERE UNINJURED. THE DRIVER REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE MANUFACTURER AND THE DEALER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1GKKVTKD1GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2017",
        "dateOfIncident": "06/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993991,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS LETTER TO INFORM YOU OF AN INCIDENT WHICH OCCURRED ON SUNDAY JUNE 4, 2017 WHILE DRIVING MY GMC ACADIA. I WORK IN REAL ESTATE SALES AND AFTER SHOWING HOME SITES TO A POTENTIAL BUYER I RETURNED TO MY MODEL PARKING LOT. I PULLED INTO THE PARKING LOT AND WAS IN THE PROCESS OF PARKING THE CAR WHEN THE CAR SUDDENLY BEGAN REVVING. I WAS ONLY A FEW FEET AWAY FROM THE PARKING BLOCK AND I HAD MY FOOT ON THE BRAKE. I TRIED TO PUT THE CAR IN PARK BUT IT WOULD NOT MOVE. THE CAR KEPT REVVING AND JERKED FORWARD WITH SO MUCH FORCE THAT I WENT OVER THE PARKING BLOCK, THROUGH THE BUSHES AND THROUGH THE PVC FENCE. I HAD MY FOOT ON THE BRAKE THE ENTIRE TIME AND KEPT TRYING TO PUT THE CAR IN PARK. AFTER A FEW FEET BEYOND THE FENCE THE CAR FINALLY WENT INTO PARK AND I WAS ABLE TO STOP THE CAR. I AM COMPLETELY GRATEFUL THAT NO PEDESTRIANS WERE ON THE OTHER SIDE OF THE FENCE. AS I AM SURE YOU CAN IMAGINE I WAS TERRIFIED TO GET BACK INTO THE CAR. I CALLED MY HUSBAND AND HAD HIM BRING ME THE OTHER CAR SO I CAN FINISH OUT MY WORK DAY. THE ACADIA IS OUR FAMILY CAR AND THE CAR THAT TRANSPORTS OUR FOUR CHILDREN. MY HUSBAND TOOK THE CAR INTO  FERMAN DEALERSHIP, THE DEALERSHIP WHICH WE LEASED THE CAR FROM, AND THEY BLEW HIM OFF SAYING THAT I PROBABLY GOT CONFUSED BETWEEN THE BRAKE AND THE THROTTLE. I AM 41 YEARS OLD AND HAVE BEEN DRIVING SINCE I WAS 16 AND I CAN ASSURE YOU THAT I DID NOT GET CONFUSED AND I FIND IT COMPLETELY INSULTING THAT THEY EVEN SAID THAT.   IT DOES NOT SEEM THAT WE HAVE ANY LEGAL RECOURSE FOR BEING ABLE TO TERMINATE OUR LEASE DUE TO THIS, WHICH IS WHAT WE WOULD WANT. I WANT THIS INCIDENT REPORTED IN WRITING SHOULD GOD FORBID IT HAPPENS AGAIN AND THERE IS MORE DAMAGE THAN JUST TWO FENCE PANELS.",
        "vin": "1GKKRRKD6GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10945767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN PARK, SHUT OFF, KEYS ON FRONT SEAT WITH PURSE.  WENT TO SEAT BEHIND DRIVER TAKING ITEMS OUT AND WENT ABOUT DOOING MY ERRAND.  BOTH DOORS LEFT OPEN.  UPON RETURNING, NOTICEC VEHICLE ROLLING TOWARDS HIGHWAY.  TRIED TO CATCH IT WHEN SECOND DOOR KNOCKED ME DOWN AND REAR DRIVERS SIDE WHEEL WENT OVER MY FOOT.",
        "vin": "1GKKVRKD8GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "10/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN AIR VENT LOCATED NEXT TO ACCELERATOR WITH FINS SLANTED DOWNWARDS. SHOES SUCH AS TENNIS SHOES HANG UP ON THE VENT AS YOU TRY TO RELEASE THE ACCELERATOR. HAVE TO PULL YOUR FOOT OUT OF THE HANG UP WHICH CAUSES DELAYS AND DISTRACTIONS. DEALER SAYS NO KNOWN FIX AND THAT THIS IS NOT IDENTIFIED AS A PROBLEM BY GM.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "08/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908180,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. THE CONTACT STATED THAT THE BRAKES WERE NOT CONSISTENT AND MADE IT DIFFICULT TO STOP THE VEHICLE. WHILE AT A RED LIGHT, THE BRAKES FAILED WITHOUT WARNING. THE VEHICLE WAS TOWED TO A LOCAL DEALER WHO WAS UNABLE TO DUPLICATE THE FAILURE. THE FAILURE RECURRED AND THE VEHICLE WAS TOWED TO ANOTHER DEALER WHO WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE DEALER TO SEND THE VEHICLE HOME, IF THE FAILURE WAS NOT DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,036.",
        "vin": "1GKKRTKD5GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS THE VEHICLE HAS COMPLETELY SHUT-DOWN, WHILE SITTING STATIONARY IN TRAFFIC WITH THE BRAKES APPLIED (ONCE AT STOPLIGHT, ANOTHER TIME BACKING OUT FROM DRIVEWAY WITH BRAKE APPLIED PRIOR TO TRANSITIONING TO DRIVE) EACH OCCASION THE VEHICLE WAS RESTARTED WITH NO ISSUE OR WARNING LIGHTS. 1ST TIME TAKEN TO DEALER, NO \"CODES\" WERE FOUND AND WERE UNABLE TO RE-CREATE PROBLEM, AND SENT HOME. CURRENTLY AT DEALER FOR THE 2ND TIME AND STILL UNABLE TO RETRIEVE ERROR CODES OR RE-CREATE. CURRENTLY CONTACTING GM FOR ASSISTANCE. VEHICLE PURCHASED NEW IN DECEMBER 2016 FROM NORTH STAR GMC IN PENNSYLVANIA, AND CURRENTLY HAS LESS THAN 10K MILES.",
        "vin": "1GKKVRKD6GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10894132,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC ACADIA. THE GEAR SHIFTER WAS PLACED IN THE PARK POSITION AND THE CONTACT WALKED AWAY FROM THE VEHICLE. ON THE WAY BACK TO THE VEHICLE, THE CONTACT NOTICED IT ROLLED ONTO THE HIGHWAY ON ITS OWN. THE CONTACT RAN AFTER THE VEHICLE AND TRIED TO STOP IT, BUT IT RAN OVER HER RIGHT FOOT, CRUSHED IT, AND CRASHED INTO A UTILITY BOX. A POLICE REPORT WAS FILED AND THE CONTACT RECEIVED MEDICAL ATTENTION FOR HER FOOT. THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 14V092000 (POWER TRAIN). THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 4,000. UPDATED 06/21/17*LJ    *CN",
        "vin": "1GKKVRKD8GJ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883937,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 SLE GMC ACADIA CENTER GEAR SHIFTING COMPONENT LEVEL DOES NOT INDICATE WHAT GEAR THE VEHICLE IS CURRENTLY IN. P,R,N,D,L ALL REMAIN WHITE IN COLOR DESPITE BEING IN A DIFFERENT GEAR; AN IMPROVEMENT (PERHAPS A COLOR CHANGE TO THE CURRENT GEAR) IS NEEDED. GEAR INDICATION IS CURRENTLY LOCATED ON A 2 INCH BY 3 INCH SCREEN SCREEN ABOVE THE SPEEDOMETER IN THE INSTRUMENT CLUSTER. HOWEVER, THE STEERING WHEEL IS LOCATED WITHIN THE AVERAGE PERSONS FIELD OF VIEW OF THE INDICATION SCREEN, THUS MAKING THE INDICATION SCREEN USELESS UNTIL A MAJOR BODY ADJUSTMENT, UP OR DOWN, IS MADE. POOR INDICATION OF CURRENT GEAR AND THE SIZE OF GEAR INDICATION NEED TO BE DRASTICALLY IMPROVED TO PREVENT ACCIDENTAL GEAR SELECTION WHICH WOULD RESULT IN WRECKS AND LOST OF LIFE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/01/2016",
        "dateOfIncident": "05/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHROME TRIM AROUND THE VENTS ABOVE THE CENTER NAVIGATION SCREEN DISPLAY ARE MADE OF A MIRROR FINISH CHROME UNLIKE THE MATTE TRIM THAT SURROUNDS THE NAVIGATION SCREEN.  WHEN ONE IS DRIVING AND THE SUN IS APPROXIMATELY DIRECTLY OVERHEAD, THE SUN REFLECTS OFF THE CHROME TRIM AND DUE TO THE ANGLE OF THE TRIM, IS REFLECTS DIRECTLY INTO THE DRIVER'S EYES.  AS ONE CANNOT REALLY CHANGE ANYTHING WHILE DRIVING DURING THIS PERIOD TO BLOCK THE REFLECTION THE DRIVER IS CONSTANTLY BEEN DISTRACTED WITH THE SUN REFLECTION OF THE MIRROR LIKE TRIM THAT IS SHINNING IN THE DRIVER'S EYES.",
        "vin": "1GKKVRKD2GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/16/2016",
        "dateOfIncident": "04/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859860,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE LACK PROPER LOAD RESTRAINTS SO THAT OBJECTS PLACED IN THE CARGO AREA DO NOT FLY ALL OVER AND HURT PASSENGERS IN CASE OF SUDDEN STOP OR ACCIDENT. CARGO NETTING HAS VERY POOR SIDE ANCHORS AND LACKING FLOOR ANCHORS.",
        "vin": "1GKKRTKD2GJ"
    }
]