[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "10/02/2021",
        "fire": true,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435244,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Truck was parked for about 5-6 hours on yard and randomly catching fire and burns up , see similar year make and model had similar things happen and was recalled my truck was manufactured in the time period of the other recalls but I didn’t get a letter please advise",
        "vin": "3Akggld54gs"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/22/2021",
        "fire": true,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390543,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A FIRE INVESTIGATOR WITH ONONDAGA COUNTY FIRE INVESTIGATION UNIT.  RECENTLY I HAD TWO FIRES WITH SIMILAR VEHICLES BOTH WERE 2016 FREIGHTLINERS CASCADIA 125 BOTH WERE PARKED AND NOT RUNNING AT THE TIME OF THE FIRE EVENTS.  BOTH ORIGIN AND CAUSE INVESTIGATIONS APPEARED TO REVEAL A FAILURE/MALFUNCTION AT THE WHAT HAS BEEN DESCRIBED TO ME AS BEING THE POWER DISTRIBUTION MODULAR (PDM).  BOTH RESULTED IN THE VEHICLES BEING DESTROYED BY FIRE.*DT*JB*JB*JB*JB*JB",
        "vin": "3AKJGEDV4GD"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/27/2021",
        "fire": true,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390547,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A FIRE INVESTIGATOR WITH ONONDAGA COUNTY NY RECENTLY I HAD TWO SEPARATE FIRES IN SIMILAR VEHICLES (SEE NHTSA COMPLIANT # 11390543)  BOTH ORIGIN AND CAUSE INVESTIGATIONS REVEALED A MALFUNCTION/FAILURE IN WHAT HAS BEEN DESCRIBED TO ME AS A POWER DISTRIBUTION MODULAR (PDM) BOTH VEHICLES WERE TOTALLY DESTROYED BY THE RESULTING FIRE.  BOTH VEHICLES WERE PARKED AND NOT RUNNING AT THE TIME OF EVENT.*DT*JB*JB*JB*JB  CONSUMER BELIEVES THE MELTING SNOW WHICH ENTERED THE ELECTRIC COMPONENTS WAS CONTRIBUTING FACTOR THAT CAUSED THE FIRE.*JB",
        "vin": "1FUJGEBGXGL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289226,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 01/2019 THE ARM FROM MOTOR TO WIPER LINKAGE FAILED AND WIPERS STOPPED DURING A SNOW STORM ON I-79, OUTSIDE OF PITTSBURG, PA. WAS ABLE TO SAFELY GET TO AN EXIT OFF RAMP TO PARK AND INVESTIGATE THE ISSUE. REPLACED THE MOTOR AND LINKAGE AS RECOMMENDED TO REMEDY THE PROBLEM. NOW 11 MONTHS LATER, WIPERS STOP COMPLETELY FOR NO REASON AT ALL. WHEN I TURN THE WIPERS BACK OFF, THEN BACK ON, STILL NOTHING. IMMEDIATELY I PULL VEHICLE TO SHOULDER TO INVESTIGATE, BUT COULD FIND NOTHING WRONG. I RESTART VEHICLE AND TO MY SURPRISE THE WIPERS BEGIN TO WORK. THIS HAS HAPPENED TWICE IN TWO WEEKS, BOTH TIMES IN HEAVY RAIN. ONCE ON NEW YORK THRUWAY HEADING SOUTH JUST NORTH OF THE MAHWAH REST AREA AND THEN ON I-87, NORTHWAY AT EXIT 4. BOTH TIMES I WAS ABLE TO SUCCESSFULLY CORRECT THE ISSUE BY TURNING OFF THE TRUCK FOR A FEW MINUTES THEN RESTARTING. THE WIPERS BEGAN WORKING AGAIN AFTER THAT. VERY FORTUNATE TO BE ABLE TO MOVE VEHICLE TO SHOULDER TO INVESTIGATE BOTH TIMES. WIPERS ARE VERY IMPORTANT TO THE SAFE OPERATION OF A VEHICLE AND SHOULD BE TAKEN SERIOUSLY. THE MOTOR AND LINKAGE DOESN'T EVEN HAVE A YEAR FROM THE TIME IT WAS INSTALLED. EVERYTHING LOOKS GOOD ON LINKAGE, NOTHING BINDING OR CATCHING, ALSO FUSES ARE GOOD. ALL WIRING GOOD AS WELL.  THANK YOU",
        "vin": "1FUJGLD55GL"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "08/16/2016",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11003726,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FREIGHTLINER CASCADIA. WHILE DRIVING, THE CONTACT HEARD A LOUD BOOM NOISE BUT COULD NOT DETERMINE THE LOCATION OF THE NOISE. THE CONTACT STATED THAT THE VEHICLE INDEPENDENTLY DRIFTED TO THE LEFT AND THEN INDEPENDENTLY DRIFTED TO THE RIGHT. AS A RESULT, THE CONTACT LOST CONTROL OF THE STEERING WHEEL. THE VEHICLE SLAMMED INTO A GUARDRAIL AND BOUNCED INTO A WALL, WHICH DAMAGED THE FRONT DRIVER'S SIDE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED A HEAD INJURY AND BODY ACHES, WHICH REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN IMPOUND. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 15V613000 (STEERING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.  UPDATED 09/07/17*LJ    *CN",
        "vin": "1FUJGLDR4GL"
    },
    {
        "components": "STEERING,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983250,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE VEHICLE RECALLS THAT HAVE COSTED ME THOUSANDS  FROM EXCESSIVE OPERATING COST , AND HAVE BEEN ENDANGERING MY LIFE SINCE THE DAY I BOUGHT MY TRACTOR:-(",
        "vin": "1FUJGLD5XGL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883788,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "JAKE BRAKE HANDLE FALLS FROM OFF POSITION TO ON POSITION OVER BUMPS.   ON RT 81 NORTH CRUISE SET AT 60 HIT BUMP MAKE WENT FULL ON  THREW ME AGAINST SEATBELT. THANKFULLY DRY ROAD",
        "vin": "3AKJGLDR3HS"
    }
]