[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/07/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353591,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING AT 60 MPH ON HIGHWAY 87 NORTH OF GREAT FALLS MT. AT ABOUT 4:40 IN  THE AFTERNOON ON SEPTEMBER 4TH 2020, THE TREAD OF REAR TIRE ON THE DRIVERS SIDE OF MY 2016 FOREST RIVER TRAVEL TRAILER CAME APART FROM THE REST OF THE TIRE. AFTER GETTING THE TRAILER BACK UNDER CONTROL AND BROUGHT TO A SAFE STOP IT WAS NOTICED THAT SUBSTANTIAL DAMAGED WAS CAUSED TO THE TRIM SURROUNDING, ABOVE AND BEHIND THE TIRE, AS WELL AS DAMAGE TO THE TRAILERS PLUMBING THAT WAS BEHIND THE TIRE, ALONG WITH DAMAGE TO THE UNDERNEATH OF THE TRAILER INCLUDING THE WIRES FOR THE TRAILER BREAKS BEING TORN OUT FROM THE HUB. THE TREAD THAT CAME OFF THE TIRE ALONG WITH SOME OF THE BROKEN PLUMBING STRUCK THE CAR THAT WAS BEHIND US. LUCKILY AFTER TALKING WITH THE INDIVIDUAL, THE DAMAGE THAT THEIR CAR SUBSTAINED WAS MINIMAL. THEY WERE ALONG WITH MYSELF WAS GLAD THAT IT WAS A RENTAL AND THEY BOUGHT THE EXTRA INSURANCE.",
        "vin": "4X4TWDH27GA"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "12/09/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052081,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAILER WAS PURCHASED NEW AT BEST RV IN TURLOCK CA. IT'S STORED ON A DRY DRIVEWAY IN CA. NO EXTENDED EXPOSURE TO RAIN OR SNOW. THE NUTS ATTACHING THE BODY TO THE FRAME ARE COMPLETELY RUSTED AND DETERIORATING. THE BOLTS FOR THE SUSPENSION  ARE ALSO RUSTED. INCORRECT NUTS AND BOLTS WERE USED IN THE MANUFACTURING OF THE TRAILER AND ARE UNSAFE. IF THE NUTS FURTHER DETERIORAT THEN THERE IS A CHANCE THE BODY OF THE TRAILER WILL DETACH FROM THE FRAME. I HAVE SPOKE WITH THE DEALER AND MANUFACTURER AND BOTH SAY THE WARRANTY DOES NOT COVER RUST. BUT THE INCORRECT PARTS WERE USED ARE ARE CAUSING THE ISSUE.",
        "vin": "4X4TWDC28HE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/04/2017",
        "dateOfIncident": "01/29/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958596,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TOWING THE TRAILER THROUGH A CONSTRUCTION ZONE IN TUCSON AZ THE  RIGHT TOUNGE FRAME RAIL BENT. THERE WAS A SIGNIFICANT CHANGE FROM LANE TO LANE OF ABOUT 15 INCHES. THE TRAILER WAS TILTING WHILE THE TOW VEHICLE WAS LEVEL ON THE LOWER LANE GOING THROUGH THE CONSTRUCTION ZONE. *DT   CARFAX CANNOT PROCESS VIN.*JB",
        "vin": "4X4TWDC20GE"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "11/11/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950336,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE PROCEEDING SOUTH ON I-5 JUST SOUTH OF SAN CLEMENTE, CA, 55MPH IN SLOW (RT) LANE PULLING OUR 5TH WHEEL. TIRE (RT. RR OF TANDEM TRAILER) BLEW. I HEARD IT AND FELT IT RIGHT AWAY PULLED OVER TO SHOULDER AS QUICKLY AS I COULD SAFELY, IT TOOK ABOUT 200 YDS.  FOUND THAT TREAD HAD PARTIALLY BLOWN OFF AND WRAPPED ITSELF TIGHTLY AROUND THE AXLE BETWEEN THE LEAF SPRING BRACKET AND THE BRAKE SHOE PLATE CAUSING THE WHEEL TO BE UNABLE TO ROTATE AND DAMAGING THE RIM FROM DRAGGING ON THE PAVEMENT.  WE WERE ONLY 21 MILES FROM OUR HOME FROM WHICH WE BEGAN OUR TRIP.  I ALWAYS CHECK TIRE PRESSURE AT THE BEGINNING OF OUR TRIP ON TIRES OF THE TRAILER AND MY TOW VEHICLE TO INSURE THAT THEY ARE AT MAXIMUM CAPACITY.  THE INCIDENT OCCURED AT APPROXIMATELY NOON ON A CLEAR SUNNY DAY IN NOVEMBER, TEMP ABOUT 70 DEGREES.  BLOWOUT OCCURED IN THE MIDDLE OF THE TREAD AND NOT A SIDEWALL.",
        "vin": "4X4FWBE29GU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "11/27/2015",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862667,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 FOREST RIVER WILDWOOD. WHILE REVERSING INTO THE DRIVEWAY, THE REAR PASSENGER SIDE AXLE DETACHED AND FRACTURED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THERE WAS A DEFECT IN THE FRAME. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    }
]