[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120543,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 26 SEPTEMBER 2018, I ORDERED A SUSPENSION KIT FOR THIS TRAILER FROM WWW.ETRAILER.COM.  ORDER# 106838902.  THE KIT I ORDERED WAS A ROADMASTER SLIPPER SPRING KIT #RM-2570 WITH THE RM-2460 SHOCK ABSORBERS.  THIS EQUIPMENT IS FOR AN AXLE THAT IS RATED AT 7,000 LB, WHICH IS WHAT THE AXLES ON MY TRAILER ARE RATED FOR.  I INSTALLED THE KIT ON MY TRAILER.  AFTER INSTALLING THE SPRINGS I NOTICED A TAG ON ONE OF THE SPRINGS.  USING THE NUMBER FOUND ON THE TAG, E5226, I DID SOME RESEARCH ON THE INTERNET AND DISCOVERED THAT THE SPRING IS RATED FOR 3,000 LBS WHICH IS SUITABLE FOR AN AXLE THAT IS RATED FOR 6,000 LBS.  ROADMASTER IS THE MANUFACTURER OF THE SPRING KIT.  ETRAILER IS THE RETAILER SELLING THE KIT.  MY COMPLAINT IS THAT THE SPRINGS IN THE 7,000 LB KIT ARE ONLY SUITABLE FOR 6,000 LB AXLES.  PERSONS USING THE RM-2570 KIT MAY BUY THE KIT AND INSTALL IT THINKING THE EQUIPMENT THEY INSTALLED WAS SAFE.  BUT IN FACT, THE SPRINGS ARE UNDERRATED FOR THEIR INTENDED USE AND THIS COULD RESULT IN SPRING FAILURE AND AN ACCIDENT.  I HAVE NOTIFIED BOTH ROADMASTER AND ETRAILER, BUT IT'S AFTER HOURS AND I DON'T EXPECT TO HEAR BACK FROM THEM UNTIL THEIR OFFICES OPEN TOMORROW.",
        "vin": "573FS3826G1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955388,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2016 NEVER TOWED BY ME. TRAILER DELIVERED BY DEALER. ALL 4 BRAKES COVERED IN GREASE. WELL KNOWN PROBLEM. NO ACTION BY MANUFACTURE",
        "vin": "573FS4323G1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/04/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949530,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS 5TH WHEEL RV NEW IN APRIL OF 2016.  I HAVE TOWED IT APPROXIMATELY 800 MILES.  I FIGURE THAT BETWEEN DELIVERY FROM THE FACTORY TO THE DEALER IN RAYNHAM, MA AND MY PERSONAL USE THAT THERE IS ABOUT 1700 TOTAL MILES ON THIS RV. I HAVE BEEN MONITORING THE GRAND DESIGN OWNERS FORUM AND FREQUENTLY AN ISSUE WAS DISCUSSED ABOUT GREASE APPEARING ON THE BRAKE SHOES.  BEING I OWN ONE, I DECIDED TO INSPECT THIS AREA TO SEE IF GREASE WAS GETTING ON MY BRAKES.  I FOUND THAT THE GREASE FROM THE WHEEL BEARINGS WAS GETTING THROUGH THE REAR SEAL AND HAD STARTED SPREADING THROUGHOUT THE BRAKE SYSTEM.  GREASE ON THE BRAKES OF A 15,000 LB TOWED VEHICLE WILL HINDER THE ABILITY STOPPING, PARTICULARLY IN THE EVENT OF A SUDDEN OR EMERGENCY CONDITION.  THE COMPANY THAT MANUFACTURES THE AXEL AND ASSEMBLES THE COMPONENTS ASSOCIATED WITH THE GREASE AND BRAKES ARE LIPPERT.  WHEN I CONTACTED THE DEALER THAT I PURCHASED THE RV FROM THEY STATED THEY WERE AWARE OF THE ISSUE AND THAT GRAND DESIGN, RV MANUFACTURER ALONG WITH LIPPERT WERE VERY WILLING TO REPAIR THIS PROBLEM.  THE REAL ISSUE I FEEL IS THAT IF THIS IS A WELL-KNOWN PROBLEM, AND THE COMPANY IS WILLING TO FIX IT, IT IS VERY POSSIBLE THAT OWNERS RV'S WITH THE LIPPERT AXEL SYSTEM MAY NOT KNOW THERE IS A PENDING PROBLEM IF THEY DON'T HAVE FORUM ACCESS OR HAVE NOT BEEN NOTIFIED BY THE RV MANUFACTURER OF THIS PROBLEM.  WHAT DOES IT TAKE TO \"ENCOURAGE\" THE MANUFACTURER TO MAKE A SINCERE RECALL NOTIFICATION SO THERE DOES NOT HAVE TO HAVE A DEATH OR LAWSUIT INVOLVED.  I WAS NOT OTHERWISE INJURED BY THIS CONDITION, JUST INCONVENIENCED.",
        "vin": "573FS3625G1"
    }
]