[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/24/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458224,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 Denali 2500 Diesel - Loose steering, like many of the others complaining.  I only have 13,000 miles on the truck since I don't drive it during Ohio winters (salt) and use it to tow my 6500 lb boat.  Doesn't feel safe at all when towing.  The dealer explained both the pitman and idler arm were worn.  $1500 repair bill.  Very frustrating that GM doesn't cover this potential safety related issue regarding vehicle control/stability.  Several versions of Technical Service Bulletin's exist #PIT5501D as an example.",
        "vin": "1GT12UE82GF"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 GMC Sierra 2500. The contact stated while driving at an undisclosed speed four years ago, the steering wheel became significantly loose, causing the contact to lose control of the vehicle. There were no warning lights illuminated. The contact depressed the brake pedal and veered to the side of the road. The contact then continued to drive at slower speed and away from other vehicles. The vehicle was taken to the dealer and was repaired under Technical Service Bulletin Number: PIT 5501F; however, after the repair, the front-end of the vehicle and the steering wheel would wobble while depressing the brake pedal. Additionally, the contact stated that the steering wheel failure reoccurred several months ago while driving. Upon inspecting the vehicle, the contact removed the driver's side wheel cover and discovered that the brake fluid had been leaking inside the wheel well and underneath the floorboard under the steering column. The dealer and the manufacturer were not notified of the failure.  The vehicle was not diagnosed or repaired. The failure mileage was approximately 4,450.",
        "vin": "1GT12UE85GF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "11/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES MAKE A NOISE WHEN I BRAKE. I AM ONLY GOING ABOUT 25 MILES AND PRESS ON BRAKE THE BRAKES DON'T SEEM TO STOP RIGHT.  THERE'S A TICKING NOISE COMING FROM THE ENGINE OR BRAKES.",
        "vin": "1GT22TE88GZ"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "01/24/2022",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448788,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 GMC Sierra 1500. The contact stated that while driving at 20 MPH with the defroster engaged, she noticed smoke on the rear electric sliding glass window and smelled a burning odor. There were no warning lights illuminated. The contact veered to the side of the road, disengaged the defroster and the smoke gradually faded away. The contact continued to drive the vehicle. The contact notified the dealer of the failure and scheduled an appointment for diagnosis. The manufacturer was not notified of the failure. The vehicle was not diagnosed or repaired. The failure mileage was approximately 64,000.",
        "vin": "3GTU2MEC3GG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I keep getting a warning message \"service trailer brake system\". The warning may come on for a second or it may stay on for 10 to 15 minutes. It may do it once a month or 10 times in a 2 minute period. Whenever this happens I lose the electrical braking system on what I am towing. There is no set pattern or circumstance for when or how long it will happen. I was told if the alert is not on there is not a way to diagnose the problem and since I never know when it will happen I cannot schedule any type of diagnostic service.  It does seem to happen more often when it is raining but has happened in perfect weather too. The warning has occurred both when I am towing and when I am not. I've done searches for possible causes and it seems to be a common problem.  I regularly tow a 12,000 lb. fifth wheel RV with my family. I cannot afford to lose my ability to stop in a reasonable amount of time. I simply cannot do it when I lose my trailer braking system. The date below is the last incident.",
        "vin": "1GT12RE86GF"
    },
    {
        "components": "STEERING,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving down the road pulling a trailer The steering wheel started to get sloppy it got up to 3 to 4 inches of play in the steering wheel before the wheels return either way The adjustment screw locking nut and clip all came loose and backed out and caused a slap in the steering gearbox The truck became unsafe to drive I had to park the truck until the parts were ordered and the whole gearbox had to be replaced at a cost of over $1500. GM has service bulletins out there on this problem they all came from one assembly factory but they said they would not repair the truck it was under my expense",
        "vin": "1GT12UEG3GF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "07/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER SRA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "belt separation at highway speed Left Front tire",
        "vin": "1GT12UEG3GF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER SRA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "LT265/60R20 Belt separated from tire, second failure on truck in 2 weeks",
        "vin": "1GT12UEG3GF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/20/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER SR-A",
                "productYear": "9999",
                "size": "LT265/60R20 E",
                "type": "Tire"
            }
        ],
        "summary": "Tire tread bulged  from center line of tire tread to outside of tread  approximately 1 ft long.  I had been highway driving for about 4 hours at 70 mph.  Truck started vibrating and was becoming worse. I pulled over and found bulge in tire. I took it about 5 miles to Matlock Tire in Lenior City Tn. But by this time the tread was cracking and separating. I was able to get a used tire to bring vehicle home. The service person at Matlock Tire advised me to replace all the tires. If one did it they probably all are bad.The tires have been very well cared for. They have 7/32 tread  across all the tires. Very even ware. No dry rot. They had been rotated and inspected at McKenny Chevy in Gastonia NC  aweek earlier. I had just come through the mountains on route 40 and if the tire had let go it could have been catastrophic.      The DOT tire number is from one of the other tires on truck. Matlock Tire  kept bad tire. Attachment is invoice for repair and picture of one of other tires on truck.",
        "vin": "1gt12te85gf"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BOX ADJUSTMENT SCREW BACKED OUT CAUSING EXCESSIVE SLOP IN THE STEERING WHEEL. THIS IS A WELL DOCUMENTED PROBLEM WITH THESE TRUCKS WITH GM'S SOLUTION IS TO ADD LOCKTITE AND TORQUE NUT. I BELIEVE THAT THIS IS A TEMPORARY SOLUTION AND IT COULD BACKOUT AGAIN. SHOULD HAVE A MECHANICAL LOCK TO PREVENT IT FROM BACKING OUT.",
        "vin": "1GT22TE85GZ"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "04/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11321717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. THE CONTACT STATED WHILE HER HUSBAND WAS DRIVING APPROXIMATELY 50 MPH, A DEER RAN IN FRONT OF THE VEHICLE CAUSING EXTREME FRONT END DAMAGE. THE CONTACT STATED THAT THE DEER ENDED UP UNDER THE VEHICLE. THE AIR BAGS DID NOT DEPLOY HOWEVER, SMOKE OR POWDER WAS SEEN COMING FROM THE FRONT FLOOR BOARD AREA. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS NOT TOWED. THE CONTACT STATED AS THE FRONT SEAT PASSENGER SHE HIT THE DASHBOARD AND SUSTAINED INJURIES TO HER LEFT SIDE, SPECIFICALLY LEFT ARM, SHOULDER, AND JAW AREA. NO MEDICAL ATTENTION WAS NEEDED. THE CONTACT STATED THAT THE FRONT SEAT BELTS NO LONGER LATCHES DUE TO THE COLLISION. THE DEALERSHIP WAS NOT MADE AWARE OF THE FAILURE; HOWEVER, THE VEHICLE WAS TAKEN TO A COLLISION CENTER. THE VEHICLE HAD NOT BEEN REPAIRED OR FAILURE DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CASE REGARDING THE MATTER. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "1GT12UE86GF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319434,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING STATES TPMS NEEDS SERVICE. EVERYTHING WORKS OFF THIS SYSTEM, AIR PRESSURE, DOOR LOCKS, REMOTE START. NONE OF THESE FEATURES WORK NOW. MY SERVICE TECH SAYS THAT THE TIRE PRESSURE SENSORS ARE TRANSMITTING. NEW BATTERIES WERE INSTALLED IN THE KEY FOBS. FIRST TIME IT HAPPENED WAS WHEN I TRIED TO REMOTE START.",
        "vin": "1GT12REG5GF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297428,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. WHILE DRIVING AT HIGH SPEEDS, THERE WAS A LOT OF PLAY IN THE STEERING WHEEL. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO DAVE SMITH MOTORS (210 N DIVISION ST, KELLOGG, ID 83837) WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE OPERATED AS INTENDED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 43,000.",
        "vin": "1GT12TE82GF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288023,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STEERING IS VERY DANGEROUS. 4-8 INCH PLAY IN THE WHEEL LEFT AND RIGHT. YOU HAVE TO TURN THE WHEEL 4' EITHER WAY FOR IT TO RESPOND. THE DEALERSHIPS DON'T HAVE A FIX FOR THIS AND THERE ARE 1000 OF THREAD POSTS ON THIS ISSUE. THIS EXACT ISSUE. PEOPLE ARE GOING TO DIE IF THIS IS NOT FIXED PROPERLY AND RECALLED BY GM. THE DEALERSHIPS ARE PUTTING LOCTITE ON THE STEERING G BUT TO PREVENT IT FROM BACKING OUT BUT THIS DOES NOT LAST. IT HAPPENS AGAIN ONLY 1000S OF MILES LATER. GOING DOWN THE ROAD I ALMOST ENDED UP IN THE WOODS BECAUSE MY STEERING WOULD NOT RESPOND. NIGHTMARISH.",
        "vin": "1GT12UE8XGF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. WHEN THE BRAKE PEDAL WAS DEPRESSED, A VERY LOUD SQUEALING NOISE WAS HEARD. THE NOISE WAS SO LOUD THAT OTHER DRIVERS INFORMED THE CONTACT THAT THERE WAS AN ISSUE WITH HER BRAKES. THE NOISE BEGAN EVER SINCE THE VEHICLE WAS PURCHASED IN 2016. THE VEHICLE WAS TAKEN TO NICK ABRAHAM AUTO-MALL GMC (1115 E BROAD ST, ELYRIA, OH 44035) ON EIGHT OCCASIONS, BUT THEY WERE NOT ABLE TO REPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 9-563-9469535. THE APPROXIMATE FAILURE MILEAGE WAS 20,876. *BF *AS",
        "vin": "1GT12UE84GF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266351,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 GMC DENALI 2500 6.6L DURAMAX DIESEL. CONSUMER WRITES IN REGARD TO FAULTY CRANKSHAFT THAT CAUSED IRREPARABLE DAMAGE TO ENGINE. *AS  *JS",
        "vin": "1GT12UE86GF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241500,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 GMC SIERRA 2500 HD. CONSUMER WRITES IN REGARDS TO DEFECTIVE STEERING. *LD    THE CONSUMER STATED THE VEHICLE WAS REPAIRED UNDER THE INSTRUCTION OF A SERVICE BULLETIN. THE CONSUMER REQUESTED TO REIMBURSED FOR THE REPAIRS. *JS",
        "vin": "1GT12TE86GF"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/25/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222532,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEAT BELT RETRACTOR HAS STOPPED RETRACTING",
        "vin": "1GT12UE84GF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING HAS EXCESSIVE PLAY BEFORE TIRES RESPOND.  THIS HAS BEEN CASE SINCE A COUPLE THOUSAND MILES ON VEHICLE.  HARD TO KEEP TRAVELING IN STRAIGHT LINE.  ALWAYS HAVING TO CORRECT, ESPECIALLY WITH 17K FIFTH WHEEL IN TOW.",
        "vin": "1GT12TE84GF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BEEN INTO GMC DEALERSHIP SERVICE FACILITY FIVE TIMES, IN THE SPAN OF 3 MONTHS. ALL SERVICE/MAINTENANCE HAS FOCUSED ON LOOSE STEERING AND UN-COMMANDED VEHICLE PULL. ISSUE REOCCURS IMMEDIATELY FOLLOWING SERVICE. FIRST ISSUE WAS EXTREMELY NON-RESPONSIVE STEERING, WHERE I COULD MOVE THE STEERING WHEEL MULTIPLE INCHES IN EITHER DIRECTION WITH NO MOVEMENT OR REACTION FROM THE VEHICLE. COMPOUNDED WITH STEERING WHEEL HAD TO BE HELD OFF OF CENTER TO MAKE VEHICLE TRAVEL STRAIGHT. GMC DEALERSHIP SERVICE TECHNICIAN PERFORMED GM RECOMMENDED FIX, WHICH DID NOT RESOLVE THE ISSUE. RETURNED VEHICLE TO GMC DEALERSHIP SERVICE DEPARTMENT, WHERE THEY FOUND THE STEERING GEAR, STEERING BOX AND PITMAN ARM TO BE DAMAGED AND THUS REPLACED ALL ITEMS. THIS DID NOT FIX THE ISSUE. RETURNED THE VEHICLE TO THE SERVICE DEPARTMENT, WHERE THEY FOUND NOTHING WRONG, AND RELEASED THE VEHICLE BACK TO ME THE CONSUMER WITH THE PERSISTENT STEERING ISSUE. THE STEERING IS LOOSE. THE WHEEL CANTS TO THE RIGHT IF IT IS LET GO OF, AND WHEN RETURNED TO CENTER, THE VEHICLE PULLS TO THE LEFT. TOOK THE VEHICLE TO A DIFFERENT DEALER, AND ASKED THEM TO INSPECT THE STEERING AND SUSPENSION COMPONENTS. THE DEALERSHIP TEST DROVE THE VEHICLE, NOTICED THE RIGHT OFF CENTER CANT, ALONG WITH THE LEFT PULL, YET FOUND NOTHING VISUALLY WRONG WITH THE STEERING OR SUSPENSION. THEY ARE REFUSING TO FURTHER DIAGNOSE THE ISSUE AS THEY CLAIM THEIR VISUAL INSPECTION FOUND NOTHING WRONG, YET WHEN DRIVING THE VEHICLE THERE IS A NOTICEABLE STEERING ISSUE. 2016 GM HEAVY DUTY TRUCKS HAVE THIS AS A KNOWN ISSUE, YET GM HAS NOT ACKNOWLEDGED IT OR CREATED A SOLUTION. THIS IS A HIGHLY UNSAFE CONDITION, WHERE THE STEERING IS UNRESPONSIVE, AND VEERS THE VEHICLE IN UN-COMMANDED DIRECTIONS.",
        "vin": "1GT11UE8XGF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. WHILE DRIVING VARIOUS SPEEDS, THE BRAKE PEDAL WAS DIFFICULT TO DEPRESS. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED SUTTLE MOTORS (12525 JEFFERSON AVE, NEWPORT NEWS, VA 23602, (757) 886-1700) AND A SERVICE APPOINTMENT WAS SCHEDULED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 39,265. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. ON SEVERAL OCCASIONS, THE VEHICLE STALLED WITHOUT WARNING AT ANY RATE OF SPEED. MASTRIA BUICK GMC (1525 NEW STATE HWY, RAYNHAM, MA 02767, (508) 880-7000) WAS NOTIFIED OF THE FAILURE SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER NUMEROUS TIMES, BUT THEY COULD NOT DUPLICATE OR DIAGNOSE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE MATTER WOULD BE ESCALATED. THE CONTACT HAD NOT YET RECEIVED A RESPONSE FROM THE MANUFACTURER. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1GT12SEG8GF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT BEAM SHAKES CONSTANTLY WHILE DRIVING AT NIGHT. DEALER ADDRESSED ISSUE SEVERAL TIMES WITH NOTHING BEING ACCOMPLISHED AS THE LIGHTS HAVE CONTINUED TO SHAKE. HEADLIGHT BEAMS SHAKING IS VERY DISTRACTING DURING NIGHT DRIVING AND THE SHAKING IS QUITE UNSAFE AS YOU CANNOT MAINTAIN A CONSISTENT, UNDISTURBED BEAM OF LIGHT IN FRONT OF THE VEHICLE AT TIMES WHEN SAME IS ABSOLUTELY MANDATORY.",
        "vin": "1GT12UE85GF"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182586,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE SHUT DOWN AND I HAD THE ABS LIGHT STABILITY CONTROL LIGHT AND THE AIRBAG LIGHT AS WELL AS MORE THAT CAME ON. THE TRUCK WAS PICKED UP FROM THE DEALER AFTER THEY SAID IT WAS A WIRING ISSUE AND WAS. IT COVERED UNDER WARRANTY. THIS HAS HAPPEND 4 TIMES ALREADY AND BEEN AT THE DEALER 3 TIMES I HAD IT HAPPEN ON THE HIGHWAY. MOST OF THE TIME IT RESTARTS BUT NOW IT DON'T",
        "vin": "1GT12SEG8GF"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176487,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 5 DIFFERENT OCCASIONS THE POWER TO THE TRUCK CUTS OFF AND THE STEERING WHEEL LOCKS UP WHILE DRIVING.  ON THE DASH THE STABILILOCK LIGHT FLASHES.  THIS HAS HAPPENED TO ME WHILE TURNING TO GET ON A MAJOR HIGHWAY, WHILE DRIVING DOWN MAIN ROADS TRYING TO CHANGE LANES, AND THE LAST TIME I WAS TURNING INTO MY BANKS DRIVE THROUGH AND HAD TO SLAM ON BREAKS IN ORDER TO AVOID CRASHING INTO THE MEDIAN.  I TOOK THE VEHICLE BACK TO THE DEALERSHIP PATRIOT IN KILLEEN TEXAS AND THEY SAID THEY UPDATED THE SYSTEM AND FOUND NO ISSUES AND COULD NOT RECREATE THE ISSUE I SAID I WAS HAVING.  THIS MORNING ON MY WAY TO WORK, IT HAPPENED AGAIN.  THIS COULD BE DEADLY IF IT HAPPENS AGAIN.",
        "vin": "1GTR1LECXGZ"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CEILING AIR BAGS DEPLOYED. WITH OUT TRUCK BEING COMPROMISED. ALSO SURGING DOESN'T WANT TO STOP REVS AT 1000 RPM AND PUSHES EVEN WHEN BRAKED LEEPS FORWARD.",
        "vin": "1GT12TE81GF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "08/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. WHILE DRIVING AT LOW SPEEDS, THE BRAKES FAILED TO OPERATE WITHOUT WARNING. THE CONTACT HAD TO APPLY EXTRA FORCE TO DEPRESS THE BRAKE PEDAL. THE VEHICLE WAS TOWED TO PARKS MOTOR SALES INC. (919 NASHVILLE HWY, COLUMBIA, TN 38401, (931) 398-5090) WHERE THE CONTACT WAS INFORMED THAT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE CONTACT STATED THAT THE VEHICLE REMAINED AT THE DEALER WAITING TO BE SERVICED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 61,000.",
        "vin": "3GTU2PEC3GG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IS NOT TIGHT AND HAS A LOT OF SLOP BEFORE THE TIRES ACTUALLY TURN. GM DEALER IDENTIFIED A BAD STEERING BOX AND FOLLOWED TSB PIT5501F TO DETERMINE THERE IS A DEFECT.",
        "vin": "1GT12TE85GF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030763,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY, NOT UNDER AN OVERPASS OR NEAR OTHER CARS WHEN I HEARD A LOUD BANG. THIS NOISE SOUNDED LIKE A BOMB GOING OFF. I PULLED OVER AND LOOKED ON THE TOP OF THE TRUCK AND MY SUNROOF HAD EXPLODED. THERE WASN'T ANYTHING  AROUND TO EVEN HIT IT. FROM THE LOOKS OF THE BREAK THERE HAD BEEN AN INTERNAL PRESSURE AS THE GLASS WAS STRESSED OUTWARD. IF THE SUNROOF PROTECTOR WOULD HAVE BEEN OPEN THIS WHOLE EVENT COULD HAVE BEEN LIFE THREATENING.",
        "vin": "1GT12UE88GF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011827,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL VERY LOOSE, CAN MOVE 3-4 INCHES WITHOUT ANY STEERING TAKING PLACE.",
        "vin": "1GT12UE89GF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2017",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 7 WAY TRAILER PLUG ON THIS VEHICLE WILL NOT HOLD THE TRAILER PLUG FIRMLY, RESULTING IN THE PLUG COMING LOOSE DURING NORMAL DRIVING CONDITIONS. ONE OBVIOUS ISSUE IS THAT THE FLAP HOLDING THE PLUG IN IS UPSIDE DOWN FROM ANY OTHER CONFIGURATION I'VE SEEN, ALLOWING THE PLUG TO SAG.    THIS IS A SERIOUS SAFETY RISK AS I HAVE HAD SEVERAL INSTANCES WHERE LIGHTS AND EVEN THE TRAILER BRAKES HAVE STOPPED OPERATING WHILE IN TRANSIT  , AFTER I GAVE VERIFIED THAT THEY WORKED WHEN I STARTED OUT. I THEN AM A HAZARD TO MY FELLOW MOTORISTS AND MY FAMILY.    THIS TRAILER PLUG WORKED FLAWLESSLY WITH MY PREVIOUS TRUCK. GMS SOLUTIONS BLAME THE TRAILER OR PLUG, BUT GIVEN THE ORIENTATION OF THE PLUG AND THE NUMBER OF OWNERS THAT SEEM TO HAVE THIS ISSUE, I BELIEVE A BETTER SOLUTION SHOULD COME FROM THEM.",
        "vin": "1GT12UE88GF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION BETWEEN 65-80MPH.  DEALER HAS ROAD FORCE BALANCED TIRES TWICE WITH NO BETTER RESULTS.  FIRST TIME ONE TIRE WAS FOUND TO BE OUT OF SPEC THEN 2ND TIME, ALL FOUR ARE IN 'SPEC'.  I DON'T BELIEVE THIS IS A TIRE/WHEEL PROBLEM AS THE VIBRATION VARIES ON SMOOTH HIGHWAY - AT TIMES IT IS VERY SMOOTH THEN IT WILL START VIBRATING/BOUNCING.  VERY UNNERVING DRIVING AT THESE SPEEDS WITH A VIBRATION THAT FEELS LIKE A LOOSE WHEEL OR OTHER DRIVETRAIN PART.  MY SON HAD A 2015 MODEL HE BOUGHT NEW AND HE FINALLY SOLD IT DISCLOSING THE ISSUE (STILL UNDER WARRANTY) RATHER THAN CONTINUING TO WASTE TIME WITH GM.  PROBLEM HAS EXISTED SINCE I BOUGHT THE TRUCK NEW OCT. 2016.  2016 GMC SIERRA 2500HD DENALI 20\" FACTORY WHEELS.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/08/2017",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959592,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE HEADLIGHTS ARE HORRIBLE.  VERY HARD TO SEE ON A WET DARK NIGHT, COMPARED TO THE 2009 GMC SIERRA 2500.  COMPLAINED TO THE DEALER, FOUND A TSB FOR COMPUTER REFLASH TO TURN UP THE VOLTAGE TO THE BULB.  MILD DIFFERENCE, BUT STILL NOT VERY GOOD FOR A $50K VEHICLE.",
        "vin": "1GT22RE87GZ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. THE CONTACT STATED THAT THE STEERING HAD EXCESSIVE SLACK WHEN TURNING THE WHEEL. THE VEHICLE WAS TAKEN TO A DEALER WHO REPLACED THE PITMAN SHAFT AND PERFORMED FURTHER DIAGNOSTIC TESTING. THE MECHANIC DROVE THE VEHICLE AND THE FAILURE CONTINUED. THE CONTACT WAS WAITING ON A SOLUTION FROM THE MANUFACTURER. THE MANUFACTURER ISSUED FOUR TECHNICAL SERVICE BULLETINS, BUT NO RECALL YET TO ADDRESS THE REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 1,000.",
        "vin": "1GT12UE87GF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944039,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN GMC REFUSED TO FIX OUR AIRBAG RECALL BECAUSE WE DIDN'T BUY IT FROM THEM. THERE WAS A DISTURBANCE AFTER THE FACT. THEY NEW IS WARRANTIED WORK AND SENT US AWAY WITHOUT FIXING IT LEAVING US OPEN TO GETTING HURT.  *TR",
        "vin": "1GTT12TEG6G"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "11/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. WHILE DRIVING APPROXIMATELY 15 MPH, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL INJECTOR PUMP FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 11,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2016",
        "dateOfIncident": "11/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930245,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 GMC SIERRA 2500. THE CONTACT STATED THAT THERE WAS AN OIL LEAK AFTER SEEING A PUDDLE OF OIL UNDER THE VEHICLE. THE FAILURE OCCURRED WITHOUT WARNING. THE DEALER DIAGNOSED THAT THE TURBO WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE REMAINED AT THE DEALER WHERE IT WAS DIAGNOSED THAT THE OIL COOLER WAS DEFECTIVE. THE OIL COOLER WAS REPLACED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 4,400.",
        "vin": "1GT12SE80GF"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2016",
        "dateOfIncident": "10/26/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 45MPH IN THE LEFT LANE OF A MAJOR CITY THOROUGHFARE THE ENGINE QUIT RUNNING, POWER STEERING AND BRAKES DID  NOT WORK.  THE CHECK ENGINE LIGHT CAME ON WHEN THE ENGINE QUIT RUNNING.  I WAS ABLE TO GET THE VEHICLE STOPPED BUT THE ENGINE WOULD NOT START.  THE VEHICLE WAS TOWED TO THE DEALERSHIP WHERE I WAS TOLD THIS ISSUE WAS REPORTED IN ARKANSAS, LOUISIANA AND TENNESSEE.  THE DEALERSHIP REPORTED THAT SHARDS OF METAL WERE FOUND IN THE FUEL INJECTOR AND THE ENTIRE FUEL SYSTEM WOULD HAVE TO BE COMPLETELY REPLACED.  ADDITIONALLY I WAS TOLD THE PARTS ARE HARD TO GET.  THE VEHICLE WAS PURCHASED NEW AND WAS 7 MONTHS OLD AND HAD JUST OVER 7,000 MILES. THE VEHICLE IS STILL SITTING AT THE DEALERSHIP 10 DAYS LATER AND HAS NOT BEEN MOVED FROM WHERE IT WAS DELIVERED BY THE WRECKER SERVICE.  GM HAS BEEN NOTIFIED BUT NO RESPONSE FROM GM OR DEALERSHIP MANAGEMENT YET AS TO WHAT CAUSED THE ENGINE FAILURE.  I OCCASIONALLY TOW A FIFTH-WHEEL RV WITH THIS VEHICLE.  I NO LONGER FEEL SAFE DRIVING THE VEHICLE AND WOULD NOT CONSIDER PURCHASING ANOTHER UNTIL A DETERMINATION IS MADE ON EXACTLY WHAT WENT WRONG.",
        "vin": "1GT12SE83GF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "03/17/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898140,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REPORTING A CONDITION OF POOR ENGINEERING / PROTECTION REGARDING THE LOCATION OF THE TRANSMISSION OIL COOLER BEHIND THE FRONT BUMPER.  THERE IS AN OPENING FOR COOLING FROM RAM AIR THAT PROVIDES NO PROTECTION FROM DEBRIS, ROCKS, BIRDS, ETC FROM DAMAGING THE FINS AND/OR THE COOLER ITSELF.   IF AN EVENT OCCURS FROM ANY OR OTHER SITUATIONS ABOVE, IT WOULD BE POSSIBLE TO HAVE THE OIL LINES PUNCTURED  RESULTING IN CATASTROPHIC FAILURE OF THE TRANSMISSION DUE TO LOSS OF FLUID WITH LITTLE TO NO WARNING TO THE DRIVER.",
        "vin": "1GT12TE84GF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHAKES AND VIBRATES AT ANY SPEEDS ABOVE 75 MPH.",
        "vin": "3GTU2NEC3GG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2016",
        "dateOfIncident": "03/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY TRUCK, IT HAS HAD 3 ALERTS ON DASH FOR \"SERVICE STABILITRAK, POWER STEERING USE CAUTION AND TRAILER BRAKE.\" VEHICLE GAUGES ALL DROP TO ZERO WHILE OPERATING VEHICLE AND GO ON AND OFF. THE VEHICLE WHEN THIS OCCURS ALSO DISENGAGES FROM GEAR, VEHICLE IS AN AUTOMATIC. THEN ENGINE REVS UP WHEN IT SLIPS OUT OF GEAR AND GENERALLY GOES BACK IN GEAR AS GAUGES COME BACK ON. THE POWER STEERING SEEMS TO ALSO LOSE SOME POWER. WHEN THIS OCCURS, IF YOU DEPRESS THE GAS PEDAL, YOU DO NOT GET ANY MORE POWER. THIS IS TECHNICALLY THE 6TH OCCURRENCE. IT HAS BEEN BACK TO DEALER (GRIFFIN GMC OF MONROE, NC) AND COMPUTER CODES WERE CLEARED AND NOTHING REPORTED IE...TECHNICALLY FOUND THAT WOULD CAUSE THIS ISSUE PER THE DEALERSHIP AS UNABLE TO RE-PRODUCE THE CAUSE. I RETURNED THE TRUCK TODAY AFTER THIS 6TH OCCURRENCE DUE TO MY FEAR OF DRIVING THE VEHICLE WITH MY CHILDREN AND GETTING INVOLVED IN AN ACCIDENT. I HAVE VIDEO OF THIS LAST OCCURRENCE OF DASHBOARD GAUGES AND SHARED THEM WITH THE DEALERSHIP. FIRST OCCURRENCE PICTURES ARE FEB 29, 2016 AND SUNDAY, MARCH 20, 2016. VEHICLE HAS APPROXIMATELY 2000 MILES ON ODOMETER. ENTIRE TIME, VEHICLE HAS BEEN RUNNING ON LOCAL ROAD, EITHER AT STOP OR DRIVING BELOW 45MPH MOVING STRAIGHT AHEAD. I COULD NOT REPLICATE OR CAUSE THE ISSUE TO HAPPEN AGAIN ON PURPOSE, VERY RANDOM.",
        "vin": "1GT12UE87GF"
    }
]