[
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "04/29/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000265,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4/29/2017 I HAD ORDERED AN EXTENDED CLUTCH CABLE AND BRAKE CABLE FROM WARREN HARLEY DAVIDSON THROUGH HARLEY'S PARTS AND ACCESSORIES CATALOG. THE FIRST TIME THE PARTS WERE INCORRECT AND ALSO THE SECOND AND THIRD TIME ALSO. THE DEALERSHIP AND HARLEY DAVIDSON SAID THEIR SUPPLIER MAGNUM SHIELDING PRODUCES THE PARTS FOR THEM SO I CALLED MAGNUM SHIELDING AND THEY INSISTED THE PARTS WHERE CORRECT BUT THEY ARE NOT CORRECT. NOT ONLY ARE THESE PARTS NO WITHIN SPECIFICATIONS THEY CAN CAUSE AN ACCIDENT. I HAVE HAD THE BIKE TO THE DEALERSHIP TO REVIEW AND A REFERENCE NUMBER FROM HARLEY 3083158. MAGNUM SHIELDING HAS SENT AN EMAIL STATING THAT HARLEY AND THEIR ENGINEERS HAVE CONFIRMED THE PARTS CORRECT BUT A TWO YEAR OLD COULD TELL THEY ARE NOT. AND WHILE I AM FIGHTING WITH ALL THREE ENTITIES HARLEY DAVIDSON, MAGNUM SHIELDING AND WARREN HARLEY OF OHIO THIS HAS NO BEARING ON THE SAFETY FACTOR OR LACK THERE OF. THE CLUTCH CABLE THAT MAGNUM SHIELDING PRODUCES FOR HARLEY DAVIDSON PARTS & ACC. PLACES THE CLUTCH CABLE ADJUSTER ACROSS THE FRONT ABS UNIT BEHIND THE FRONT FENDER WHERE IT CANNOT BE PROPERLY SECURED AS THE ORIGINAL IS PLACED ON THE LEFT FRONT FRAME RAIL. THIS COULD CAUSE THE CABLE TO SNAG ONTO ABS UNIT WHILE TURNING CAUSING AN ACCIDENT. AS FOR THE FRONT BRAKE CABLE ADAPTER THAT IS BEING USED IT ALSO IS IN A PLACE WHERE IT COULD BE SNAGGED RENDERING THE FRONT BRAKES USELESS! I HAVE THE PICTURES AND TECHNICAL SPECIFICATIONS. SO FAR NO ONE HAS REIMBURSED ME FOR THE DEFECTIVE PARTS NOR WILL THEY RESPOND  TO MY SAFETY CONCERNS. IT APPEARS THAT THEY ARE ALL TRYING TO COVER THIS UP AND BLAME THE NEXT PERSON WHILE STEALING THE PUBLICS MONEY SELLING DEFECTIVE AND POTENTIALLY LIFE THREATENING PARTS. I HAVE EMAIL FROM MAGNUM SHIELDING THAT THEY HAVE SOLD 100 THOUSAND AND NO COMPLAINTS SOLD THESE TO HARLEY  AND  SUPPLIER  DRAG SPECIALTY AND  PRIVATE CUSTOMERS KNOWING THEY'RE FAULTY!",
        "vin": "1HD1BWV12GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852321,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A NEW 2016 HD SOFTAIL SLIM AND THE REAR BRAKE CYCLINDER WAS CRACKED BEFORE WE GOT IT HOME FROM THE DEALER. THIS COULD HAVE COST MY WIFE OR MYSELF OUR LIFE IF WE HADN'T NOTICE IT BEFORE WE WENT FOR A RIDE.",
        "vin": "1HD1JRV13GB"
    }
]