[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/03/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457627,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "honda has recall/extended warranty on 6cyl vehicles dating back as far as 2008, for cylinder misfires caused by bad piston rings. Recently had to have this done on my 2016 vehicle, but it wasn't covered under any recall or warranty. this is clearly an ongoing problem, and Honda should be paying for these repairs.",
        "vin": "5fnrl5h6xgb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456553,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Honda Odyssey. The contact stated that while driving at an undisclosed speed, the vehicle started to shake and vibrate and the check engine warning light flashed on and off before the vehicle decelerated and would not properly accelerate while depressing the accelerator pedal. The vehicle was later towed to the local dealer who diagnosed that the engine pistons had become out of alignment causing oil to leak onto the spark plugs. The vehicle was not yet repaired. The manufacturer was contacted but no assistance was offered. The failure mileage was 76,650.",
        "vin": "5FNRL5H38GB"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "03/06/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455673,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Honda Odyssey. The contact stated while driving 65 MPH, the Forward Collision Warning and Lane Departure Warning lights illuminated. Additionally, the check engine warning light started to blink and the vehicle started to shudder. The contact pulled off the highway and safely stopped and turned off the vehicle. When the vehicle was restarted, the vehicle was still shaking. The contact did not take the vehicle to the local dealer to be diagnosed or repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 117,000.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453798,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The piston rings are failing and causing a misfire. The dealer, honda care, and corporation have all said they are aware of this issue, but not willing to help the customer. Currently, my dealer has 6 cars with the same issue. All service men are stating, yes, we know exactly what the issue is when seeing the warning code.  The misfire caused my car to not fully accelerate on a major highway. The dealer has documented the issue. A bunch of warnings appeared when this happened. Honda corp said they will give me half the cost and again have stated they know about this issue.",
        "vin": "5fnrl5h61gb"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449934,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My husband was driving the car up a hill and coming to a stop light while slowing the car with the break the engine accelerated (you could hear it). He had to throw the car into neutral to get it to stop in time so as not to hit the car that was stopped in front of him at the stop light. This was not a \"hard stop\". He saw the red light and was breaking.  There were two other witnesses in the car. My husband drives with his right foot and never breaks with his left foot. Though the car was stopping the engine was racing and the car was accelerating despite having his foot on the break petal. Unexpected acceleration is what the dealership called it. No he didn't have both feet on both petals. The car was accelerating despite his foot on the break petal. The witness confirm the car was trying to stop but the engine was racing. We took the car into the dealership and they brought in the \"Honda Engineer\" who checked out the car and found nothing wrong. They found the floor mats were pinned into place and were not a factor. The dealership seems to want to blame this on \"driver error\" and deny that there is anything wrong with the vehicle. The service manage with his left foot indicated as if he was breaking with his left foot when explaining that they believe it wasn't mechanical. In other words, they are saying it was driver error (with their body language). I believe they are deny deny deny and not taking our concerns into account. I did a search of similar issues with Honda Odysse's and found that there are other reports of this type of \"unexpected acceleration\". Thank You.",
        "vin": "5FNRL5H48GB"
    },
    {
        "components": "ENGINE,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "12/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446540,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VCM causes excessive wear on piston rings leading to excessive oil burning, spark plug fouling, and misfiring cylinders. Condition displays flashing engine light and emission, FCW, and LDW warnings codes, disabling the FCW and LDW. Walker Honda (71303) technician, Cody Procell, stated he has dealt with this problem numerous times and was able to quote a near exact price of $4069. Repair total after $100 military discount was $3993. Previous generation Odyssey has been recalled for same issue.",
        "vin": "5FNRL5H98GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "01/05/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446386,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Van is stuttering at a low rate of speed 25 mph.  Car shakes and rattles.  Disappears with higher acceleration. Took it to local car repair shop who suggested Honda as it should be under warranty or recall. Spoke with Honda dealer who states no recall, but there was a TSB 17-044 service bulletin extending the warranty to 8 years or 80,000 miles whichever comes first. We were never notified of this extension and are now at 82,000 miles. Honda Customer Care said there is nothing they can do, but will assign a case manager who should contact us in a week. In the meantime I am adding more miles to the car.",
        "vin": "5FNRL5H66GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440629,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Honda Odyssey. The contact stated that while operating the vehicle, the check engine warning light would remain illuminated. The vehicle was taken to the local dealer who diagnosed that pistons #1 - #3 were faulty and the spark plugs needed to be replaced. The vehicle was not yet repaired. The manufacturer and local dealer were notified of the failure. The failure mileage was 83,000.",
        "vin": "5FNRL5H9XGB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437861,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "We purchased this 2016 Odyssey November 7, 2016.  On July 16, 2020 I had to take the car into the Honda dealer.  The vehicle jerked violently when I drive from a stop position to first, second and third gears. The dealer informed that it was due to defective brakes.  I paid them $1,500 for the repair but it continued to happen.  They informed that they could not duplicate the problems therefore can't fix it.  On April 17, 2021 I have been getting multiple warning lights (fcw, ldw, check engine) which occur with sluggish engine performance. The engine will misfire and not accelerate as it typically does or shudders/jitters trying to accelerate. Diagnostic tool shows P0301 for misfire in cylinder 1 and P0848 for trans fluid pressure switch faulty.  The dealer informed that we have defective piston rings which cause spark plugs misfire and foul. This will cost 5K and they will not guaranteed that it will fix it!  My engine problems seems to be similar to the class action suit as per case no. 3:12-cv-1377-si. Unfortunately, it would appear that the defective piston rings issue was not resolved. I'm concerned that any replacement will result in the same issue again with continued driving. Honda dealerships are aware of the issue and Honda offers us very minimal assistance on the repair. However, they should be fully liable for selling cars with defective design, especially after the prior case. When this issue occurred, it put my family in an unsafe condition because vehicle suddenly lost power and the engine began to stutter. At this point my vehicle is undrivable and this has contributed to financial burden in an already difficult year due to the pandemic. Honda should own this issue for the 2016 model year through full compensation on repairs.",
        "vin": "5FNRL5H6XGB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436304,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The torque converter is failing. When accelerating, the van will shudder and shake, usually between 25-30 mph and sometimes at 45mph. My vehicle is available for inspection.  When merging onto the highway, this problem occurred, slowing my acceration which almost caused me to be hit from behind.  I reported the problem to Honda. They are aware of the problem. Said I needed to bring my van in to have conputer reflashed and transmission flushed three times. The price to have complete is $481. I have 64k miles on my vehicle.  Honda's warranty was to 50k, and there are no recalls. No warning lights or messages came on prior to this happening. It began around 60k miles.",
        "vin": "5FNRL5H66GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "04/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Problems accelerating, the transmission slipping while accelerating. Possible torque converter locking up.    Taking to dealer soon. No warning lamps, messages yet.",
        "vin": "5FNRL5H34GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434287,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My spark plugs keep wearing out due to a piston ring issue.  The Honda dealers have informed my that after 100,000 I will need my piston rings replaced.  This is an issue with Honda Odysseys.  My vehicle idles hard and will not properly accelerate. It is a hazard on the roadway because I cannot accelerate as fast as I should and the vehicle loses engine power.",
        "vin": "5FNRL5H31GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "09/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433625,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Honda Odyssey. The contact stated while driving approximately 70 MPH, the vehicle jerked violently. The check engine warning light was flashing. The contact exited the highway. The contact called the local dealer and the vehicle was taken to be diagnosed. The contact was informed that the cylinder failed and the vehicle loss engine compression. The vehicle was not repaired. The manufacturer was contacted and informed the contact that the repair was not covered under warranty. The failure mileage was approximately 111,000.",
        "vin": "5FNRL5H38GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430729,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Honda Odyssey. The contact stated that the check engine warning light was illuminated. The vehicle was towed to a local dealer where it was diagnosed but not repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 87,178.",
        "vin": "5FNRL5H66GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "08/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427767,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The transmission keeps slipping between 20 to 65 mph.  The Dealer (Price Honda - Dover, DE) flushed the ATF system like the Service Bulletin 17-043 & 17-044.  The issue still keeps happening.  They said the Torque converted needs to be replaced but it is national backorder.  But since it is on backorder, They can not do anything about it.  They are saying the car is safe to drive and that driving it will not cause damage the transmission.  This seems very unlikely.",
        "vin": "5FNRL5H98GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Failure of computer module in my 2016 Odyssey caused the key safety systems to all fault. ABS, traction control, LDW, and other systems all went into fault after a light tap on the breaks at parking lot speeds (less than 10 mph). This van has under 30,000 miles on it and was purchased by me brand new.",
        "vin": "5FNRL5H64GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "05/31/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420134,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My family was recently faced with unnecessary added stress with what appears to be a design flaw in the child safety lock feature on my 2016 Honda Odyssey purchased in 2019 from Ed Napleton Honda in Illinois. I felt the need to bring my concerns to your attention as I’m concerned for not only my son’s safety, but any other families that could face a similar frightening situation. Last weekend, while I was driving the car on the interstate outside of Cedar Rapids, Iowa, despite having turned the child safety locks on, my seven year old was able to squeeze his finger in between the space of the door and the side panel to reach the child safety lock, flip the position to un- locked, and open the sliding door while I was driving 70mph. I was very fortunate that I was able to pull over and call for safety assistance; however, it goes without saying that this situation could’ve ended much differently.  Upon returning home, I took video of my older son being able to recreate the situation by manipulating the child safety lock from inside. I have this video if you want to see it.   I purchased what I believed to be a vehicle full of adequate safety features. Now, I’m extremely concerned with my ability (or lack thereof) to safely transport my son at this time knowing this design flaw exists. I urge you to escalate this issue for immediate recall consideration to avoid potentially dire consequences.",
        "vin": "5FNRL5H69GB"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420211,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "This car has a failure/malfunction that is well documented on the internet by other owners and is being willfully ignored by Honda.  The vehicle is available for inspection upon request.  It is a major safety concern.  In cool weather, there is no way to open the back hatch of this vehicle.  So if the only way to reach passengers trapped in the car was from the back hatch and the weather was cool there would be no way to open the hatch and no way for the passengers to get out or for help to reach them.  This failure occurred without warning and we did not detect it until we traveled from Florida to North Carolina where the weather is cooler.  The vehicle has not been inspected by Honda, the police, or insurance but we would happily have it inspected.  It has not been confirmed by the dealer.  We did ask the dealer to look into it but they could not find the problem because we are in Florida and the weather is warm.  Honda must know about the issue.  I reported it to them and it is all over the internet.  I am not the only person with this defect.",
        "vin": "5FNRL5H38GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419881,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving, the electric systems in the car completely turn off.  You lose all dashboard functions, including blinkers, speedometer, radio and information panel.  Car starts to slow and gas pedal does not seem to work.  Power steering also seems to stop working.  Car gradually slows.  Hazard lights do continue to work.  When you come to a full stop, car starts again and works fine.  The problem is extremely dangerous if driving of a freeway or other multi lane, higher speed road.   We experienced the problem almost immediately after purchasing the car (used, with 28K miles, from Paragon Honda in NY).  We bought the car back to the dealer and they replaced an electrical harness.  THe problem did not reoccur again for around 4 months (we only drive around 10K miles per year), when it happened again on a local road.  Recently, in April and May the problem occurred two more times, with the last occurrence nearly causing a serious accident as we were driving in the left lane on the LIE at around 60mph.  Getting the car to the shoulder with limited brake, steering and acceleration functions, and not having use of the blinker was extremely dangerous.  This is a very serious issue.  Bringing the car back to the dealer, but given the short duration of the initial fix, I fear there is a fundamental defect in the electric system.  Went online to a Honda Odyssey discussion board, and was surprised that there were a number of other similar complaints.  If this is a systemic problem, it is a big one.",
        "vin": "5FNRL5H31GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418403,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "On two previous occasions, while driving two different Honda Odyssey's I owned on major highways in the mountains of Colorado (Interstate or multi-lane highways which appear to meet interstate highway standards), at a time late in the day where, although summer, heat did not appear to be a factor, I suffered multiple occasions where my brakes would seem to be braking at a much lesser ability than I have been used to. In these instances, the harder the brake was applied, the reaction was almost causing me to lose control of the vehicles due to the extreme vibration/bouncing of the front end, as if both front tires were starting to bounce making it difficult to safely steer the vehicle and stay within my traffic lane. Upon returning home, once out of the more steep mountain driving, both braking and steering operated as expected. I talked to a couple of local garages in the mountains and a couple of Honda dealers locally. The Colorado garages didn't see any problems but said they have heard many such complaints from Honda owners. The local dealers back at home also found no obvious mechanical issues, but quietly confirmed hearing similar complaints and just chalked it up to Honda Van's. I am 70yoa and have never experienced the violent shaking I've had in my two Hondas making me to want to raise this issue to you. I feel a lessor experienced driver would have lost control at a high speed most probably resulting in serious injury or death, and with a high probability that such a loss at a steep grade and speed would easily involve multiple vehicles.",
        "vin": "5FNRL5H34GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2021",
        "dateOfIncident": "05/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418073,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My auto lights on dash keep flashing even though the car is off. This only happens every time I set car alarm and after couple minutes it starts to sound and all the dash board lights flicker car turns on it’s own. I open the front trunk and heard noise from fuse box. The Honda service tech said their is an issue in  the control unit. I had heard a recall about an issue on 2018-2020 cars but not my year. This has been the second time this issue comes up. First time the battery ran out of power so the Honda technician change battery after I only had the car less than 2 years. Then a new battery was instal. Since first time this happen I thought it would be battery again but was informed that it’s power control unit that’s causing this self control flickering on its own. I am concerned that while on road the car might suddenly stop and not function if this flickering happens.",
        "vin": "5FNRL5H36GB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412963,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT SLIDING DOOR UNLATCHED WHILE DRIVING AT THE SPEED OF 55 MILES PER HOUR.  THIS HAS HAPPENED TWICE ON MY CAR.",
        "vin": "5FNRL5H65GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "04/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408072,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SLIDING DOOR IS POPPING OPEN AFTER CLOSING",
        "vin": "5FNRL5H39GB"
    },
    {
        "components": "ENGINE,LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405911,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE BEEN GETTING MULTIPLE WARNING LIGHTS (FCW, LDW, CHECK ENGINE) WHICH OCCUR WITH SLUGGISH ENGINE PERFORMANCE. THE ENGINE WILL MISFIRE AND NOT ACCELERATE AS IT TYPICALLY DOES OR SHUDDERS/JITTERS TRYING TO ACCELERATE. DIAGNOSTIC TOOL SHOWS P0303 FOR MISFIRE IN CYLINDER 3. I CHANGED OUT THE SPARK PLUG WHICH WAS VERY FOULED (SAVED IT) AND THIS FIXED IT FOR A FEW WEEKS AND THEN IT RETURNED. CHANGED OUT ALL SPARK PLUGS BUT ISSUES AND CODE ARE BACK AGAIN AFTER A FEW WEEKS.",
        "vin": "5FNRL5H63GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2021",
        "dateOfIncident": "03/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405101,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION KEEPS SLIPPING. NOT TYPICAL FOR A CAR SO NEW. EVERYTIME WE ACCELERATE, IT SLIPS.",
        "vin": "5FNRL5H91GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404007,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN ISSUE WITH A SECOND ROW SEAT NOT LATCHING PROPERLY AND SLIDING WHILE DRIVING,  BUT WHEN I CHECK MY VIN IT DOESN'T SHOW ANY RECALLS OR REPAIRS NEEDED.  I KNOW THIS IS AN ISSUE WITH THE HONDA ODYSSEY. THE SEAT HAS STARTED TO BECOME HARDER TO SLIDE FORWARD TO GAIN ACCESS TO KIDS IN THE THIRD ROW WHEN TRYING TO GET OUT OF THE VAN.",
        "vin": "5FNRL5H65GB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400090,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO:  I HAVE A 2016 HONDA ODYSSEY I AM TRADING IN TODAY.  A FEW WEEKS AGO I WAS IN DRIVE WITH MY FOOT ON THE BREAK. THE ENGINE STARTED RACING AND MOVING THE VAN. I PUT THE TRANSMISSION INTO NEUTRAL AND IT RACED TO 4500 RPM. I PLACED IT IN PARK, IT RACED TO 5500 RPM AND WAS NOT STOPPING. I TURNED THE ENGINE OFF. THEN RESTARTED AND THE PROBLEM WAS GONE.    I WANT TO REPORT THIS TO YOUR AGENCY.    THANK YOU",
        "vin": "5FNLR5H60GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STATIONARY, THE C02ABLE FOR THE AUTOMATIC SLIDING DOOR SNAPPED ON THIS MINIVAN, AND ANOTHER I OWNED. THIS RENDERS THE DOOR INOPERATIVE, AND IS A SAFETY ISSUE SHOULD PASSENGERS BECOME TRAPPED INSIDE. THE DOOR EITHER WON'T OPEN, OR CANNOT BE OPENED MANUALLY BECAUSE THE REMAINING CABLE HOLDS IT SHUT. THE DIAMETER OF THE CABLE APPEARS INCREDIBLY SMALL, AND MUCH TOO WEAK TO ADEQUATELY OPERATE THE DOOR. REPLACEMENT CABLES CAN BE PURCHASED ONLINE THAT PURPORT TO HAVE TWICE THE TENSILE STRENGTH. HONDA CONTINUES TO USE DEFECTIVE CABLES AND SHOULD BE MADE TO CORRECT THIS, INSTEAD OF CHARGING CONSUMERS $1500 TO FIX THE DOORS.",
        "vin": "5FNRL5H66GB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389766,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WENT TO FILL UP THE GASOLINE IN VAN, IT WAS ALL LEAKED OUT. SHE CALLED  PLANO FIRE DEPARTMENT, HE PUT ABSORBANT ON THE GROUND AND TURN THE CAR ON, SHE CAME HOME WITH LITTLE OR NO GAS IN TANK.I CALLED NEXT DAY TO HONDA DEALER AND WAITING FOR THEIR RESPONSE,WAITING FOR THEIR CALL.",
        "vin": "5FNRL5H94GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/18/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389778,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON HEAVY BRAKING THE LEFT (DRIVER SIDE) SECOND ROW SEAT RECLINER COLLAPSED AND FOLDED OVER. SEAT NOW DOES NOT LOCK IN UPRIGHT POSITION.",
        "vin": "5FNRL5H63GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386781,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLDER WEATHER THE BACK LIFT HATCH WILL NOT OPEN OR YOU HAVE TO TRY AND WARM IT UP SOMEHOW. DURING WARM WEATHER IT WILL OPEN RIGHT AWAY BUT WHEN IT COLD YOU HAVE TO STAND THERE WITH YOUR HAND ON THE BUTTON FOR 5 MINS OR IT MAY NOT OPEN UP AT ALL. PRIOR YEAR MODELS HAD THIS SAME PROBLEM AND THERE IS A RECALL BUT NOT THIS YEAR. I TOOK IT IN AT THE START OF SPRING AND BEFORE MY EXTENDED WARRANTY WENT OUT AND TOLD THEM THE PROBLEM, THEY SAID THEY FIXED IT BUT REPLACED A LATCH. IT WORKED FINE BECAUSE IT WAS WARM WEATHER AND SUMMER CAME BUT THE FIRST COLD NIGHT IN SEPTEMBER IT WOULDN'T WORK. I WENT BACK IN AND BECAUSE IT HAD BEEN MONTHS AND SO MANY MILES THEY WOULDN'T FIX IT WHICH IS CRAZY CONSIDERING PREVIOUS MODELS HAD A RECALL AND THEY SHOULD HAVE REPLACED THAT PART AND NOT SOMETHING IT WASN'T.",
        "vin": "5FNRL5H38GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/06/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383360,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS STATIONARY.  THE SAME THING OCCURS IF THE VAN IS RUNNING OR NOT. THE REAR HATCH OPEN SWITCH DOES NOT WORK WHEN THE OUTSIDE TEMPERATURE IS COLD.  THE MINUTE THE OUTDOOR TEMPERATURE WARMS UP I CAN OPEN THE REAR HATCH.",
        "vin": "5FNRL5H46GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375510,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 HONDA ODYSSEY. CONSUMER WRITES IN REGARDS TO PAINT BUBBLING AND PEELING ON VEHICLE. *LD *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375271,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE PISTON RINGS ARE CAUSING SPARK PLUGS MISFIRE AND FOUL.  THE SCENARIO SEEMS TO BE SIMILAR TO THE CLASS ACTION SUIT AS PER CASE NO. 3:12-CV-1377-SI.  UNFORTUNATELY, IT WOULD APPEAR THAT THE DEFECTIVE PISTON RINGS ISSUE WAS NOT RESOLVED.  I'M CONCERNED THAT ANY REPLACEMENT WILL RESULT IN THE SAME ISSUE AGAIN WITH CONTINUED DRIVING.   HONDA DEALERSHIPS ARE AWARE OF THE ISSUE AND HONDA US OFFERS VERY MINIMAL ASSISTANCE ON THE REPAIR.  HOWEVER, THEY SHOULD BE FULLY LIABLE FOR SELLING CARS WITH DEFECTIVE DESIGN, ESPECIALLY AFTER THE PRIOR CASE.  WHEN THIS ISSUE OCCURRED, IT PUT MY FAMILY IS AN UNSAFE CONDITION BECAUSE VEHICLE SUDDENLY LOST POWER AND THE ENGINE BEGAN TO STUTTER.  AT THIS POINT MY VEHICLE IS UNDRIVABLE AND THIS HAS CONTRIBUTED TO FINANCIAL BURDEN IN AN ALREADY DIFFICULT YEAR DUE TO THE PANDEMIC.  HONDA SHOULD OWN THIS ISSUE FOR THE 2016 MODEL YEAR THROUGH FULL COMPENSATION ON REPAIRS.",
        "vin": "5RNRL5H68GB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A NEW 2016 HONDA ODYSSEY IN 2016.  I NOTICED MY SEAT BELT WAS STARTING TO FRAY IN LATE AUG 2020.  I CALLED 2 LOCAL HONDA DEALERS AND SPOKE TO SERVICE.  I ASKED ABOUT THE SEAT BELTH, I WAS TOLD NO RECALL, AND HONDA DOES NOT COVER THE MATERIAL.  IT IS COSMETIC.  I FAIL TO SEE HOW A FRAYING BELT IS COSMETIC.  THE MECHANIC WHO REPLACED THE BELT SYSTEM FET THAT THE BELT MAY NOT HOLD  IF THERE WAS A FRONT END COLLISION.  I ASKED HONDA TO REIMBURSE ME.  THEY DECLINED STATING THAT THE WEB MATERIAL OF THE BELT WAS NOT COVERED.   IT WAS A SAFETY HAZARD.  THE MECHANIC STATED HE HAD NEVER SEEN ANYTHING LIKE THIS.  I FEEL HONDA IS IGNORING THIS SINCE THIS MAY BE AN ISOLATED CASE.  IT IS CLEARLY A HAZARD, AND A DEFECTIVE BELT.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/25/2020",
        "dateOfIncident": "10/25/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366278,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED WITH TRANSMISSION JUDDERING AT 45,000 MILES. TOOK IT IN FOR A FIX AND IT GOT FLUSHED AND REPROGRAMMED UNDER WARRANTY. NOW AT 77,000 IT SLIPS IN AND OUT OF GEAR WITH A BANG AND A BIG JOLT. I WAS DRIVING AT A LOW RATE OF SPEED IN MY NEIGHBORHOOD.  TURNED ONTO MAIN ROAD AND TRIED TO ACCELERATE AND IT JUST SLIPPED INTO A LOWER GEAR WITH A BANG. NOT GOOD ACCELERATION. TURNED AROUND AND WENT HOME. SLIPPED IN AND OUT OF GEAR A LOW RATE OF SPEED. NOT SAFE TO DRIVE ON THE ROAD.",
        "vin": "5FNRL5H35GB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362292,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THERE WAS AN ABNORMAL CLICKING SOUND IN THE STEERING COLUMN WHILE TURNING THE STEERING WHEEL. THERE WAS NO WARNING LIGHT ILLUMINATED. THE CONTACT ALSO STATED THAT THE STEERING COLUMN SHOOK EACH TIME THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO UNIVERSITY HONDA (2150 NW 9TH ST, CORVALLIS, OR 97330) WHERE THE VEHICLE WAS DIAGNOSED WITH A DEFECTIVE STEERING COLUMN. THE MANUFACTURER HAD BEEN NOTIFIED OF THE FAILURE AND OFFERED NO ASSISTANCE. THE VEHICLE REMAINED IN THE POSSESSION OF THE DEALER AND WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 28,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351557,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE HAD EXPERIENCED HARD SHIFTING WHEN SWITCH GEARS. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (GERMAIN HONDA LOCATED AT 2601 S STATE ST, ANN ARBOR, MI 48104) WHO PERFORMED A TRANSMISSION SOFTWARE UPDATE BUT THE FAILURE CONTINUED TO OCCUR. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11350387,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRYING TO GET A MAJOR SAFETY ISSUE ESCALATED AS THE DEALERS (TOOK TO TWO DIFFERENT DEALERS) DON'T SEEM TO BELIEVE ME THAT THIS IS HAPPENING. I HAVE A 2016 HONDA ODYSSEY, BOUGHT USED. THE DRIVER SIDE POWER SLIDING DOOR RECENTLY STOPPED OPENING PROPERLY AND STOPS HALF WAY THROUGH OPENING ON OCCASION. THERE IS A FUNDAMENTAL PROGRAMMING ISSUE THAT BY-PASSES THE SAFETY PINCH POINT FEATURE WHEN THE DOOR FAILS TO OPEN AND THE DOOR AUTOMATICALLY STARTS TO CLOSE. THE DOOR STARTS TO CLOSE AND SMASHED MY WIFE BETWEEN THE DOOR AND THE FRAME OF THE VAN. THE PROGRAM SHOULD NOT BY-PASS THE PINCH POINT SAFETY FEATURE IF IT SEES A DOOR FAILURE TO OPEN ALARM. I TESTED THE PINCH POINT SAFETY FEATURE AND IT WORKS PERFECTLY WHEN THE DOOR OPENS AND CLOSES PROPERLY. MY VEHICLE IS NO LONGER UNDER WARRANTY, BUT THIS IS A BIG SAFETY CONCERN AS THAT COULD HAVE BEEN MY KIDS GETTING SMASHED. THE VEHICLE WAS STATIONARY AND MY WIFE WAS LOADING MY YOUNG KIDS IN TO THE VAN.",
        "vin": "5FNRL5H31GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "10/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PUCHASING MY CAR, THE TRANSMISSION STARTED SLIPPING ON A REGULAR BASIS. BETWEEN 5-40 MPH IT'S LIKE THE CAR DOESN'T KNOW HOW TO SHIFT GEARS AUTOMATICALLY AND JOLTS EVERY ADDITIONAL 5MPH OR SO. SEEMS VERY UNSTABLE. IT HAS BEEN A PROBLEM SINCE ABOUT 28K MILES. WE'RE AT 51K AND IT STILL DOES IT EVERY TIME WE DRIVE. THERE ARE NO DIAGNOSTIC CODES THAT SHOW UP (WE WENT TO SEVERAL DIFFERENT REPAIR PLACES) AND ARE TOLD IT'S IMPOSSIBLE TO DO ANYTHING ABOUT OTHER THAN REBUILD THE TRANSMISSION. THIS IS ABSOLUTELY NOT WHAT SHOULD HAPPEN ON A CAR AT LESS THAN 30K MILES.",
        "vin": "5FNRL5H38GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342101,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON BOTH OF THE SLIDING REAR DOORS, RUST HAS FORMED ON THE LOCKING MECHANISM AND BOLT THAT IS AFFIXED TO THE DOOR.  I AM VERY CONCERNED THAT THE RUST WILL MAKE THE DOOR NOT LOCK PROPERLY OR COME LOOSE DURING OPERATION.",
        "vin": "5FNRL5H41GB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "06/28/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331896,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, AN ABNORMALLY LOUD BOOMING SOUND WAS HEARD. AFTER STOPPING TO INSPECT THE VEHICLE, IT WAS DISCOVERED THAT THE GLASS SUNROOF HAD EXPLODED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER WILLIAMS HONDA LOCATED AT 2650 US HWY 31, TRAVERSE CITY MI 49684 WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.",
        "vin": "5FNRL5H67GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11326253,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE AUTOMATIC SLIDING PASSENGER VAN DOOR OPERATED IMPROPERLY - AS THE DOOR WAS MOVING BACKWARD TO OPEN, OUR 3 YEAR OLD GRANDDAUGHTER SLIPPED AND HER HEAD WAS LODGED BETWEEN THE INSIDE DOOR FRAME AND DOOR   THE DOOR LODGED HER HEAD AND STOPPED MOVING-BACKWARD,  TRAPPING HER HEAD, PLACING EXTREME PRESSURE ON HER SKULL.  WE COULD NOT GET THE DOOR TO RELEASE FOR SEVERAL MINUTES.  SHE WAS SCREAMING - CAUSING HER SIBLINGS MUCH TERROR AS WE WORKED TO FREE HER FROM THE ENTRAPMENT.  WE WERE VERY FORTUNATE THAT WE WERE ABLE TO GET HER RELEASED.  SHE WAS SEEN BY HER PEDIATRICIAN IMMEDIATELY AFTER HER GETTING HER OUT.  I WILL SEND PICTURES.  SHE IS LUCKY SHE DIDN'T GET HER SKULL CRUSHED OR LOSE AN EYE     WE REACHED OUT TO HONDA - THEIR RESPONSE WAS THE DOOR OPERATED AS IT SHOULD  WOW  WE HAVE BEEN OWNERS OF MANY HONDA'S AND BOTH OUR DAUGHTER AND WE OWN A ODYSSEY AS SHE HAD TRIPLETS IN 2016 AND WE BOTH FELT HONDA WAS A SAFE CHOICE  WE DO NOT WANT ANOTHER CHILD OR FAMILY TO EXPERIENCE THIS TRAUMA - NOR LOSE A CHILD BECAUSE OF IT.  ALL OUR GRANDKIDS HAVE BEEN TRAUMATIZED BY THIS INCIDENT - AS WAS OUR DAUGHTER - HER MOTHER AND I.  OUR DAUGHTER HAS SINCE TEASED IN THIS VAN. AGAIN WE BELIEVE THIS IS SERIOUS AND MEASURES SHOULD BE PUT IN PLACE TO PRECLUDE THIS  THE VEHICLE WAS OFF PARKED IN OUR DAUGHTERS DRIVEWAY   THE DOOR HAD MALFUNCTIONED ONCE BEFORE AND LOOKED AT BY HONDA DEALER.  HONDA CARS OF AIKEN, AIKEN SC *TR",
        "vin": "5FNRL5H95GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "04/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322555,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE DRIVING, AN AUDIBLE BEEPING ALARM INDICATED THAT A DOOR WAS AJAR, EVEN THOUGH ALL DOORS WERE CLOSED. THE CONTACT INDICATED THAT THE ALARM WAS CONSTANT AND WAS ONLY DEACTIVATED WHEN THE VEHICLE WAS NOT IN MOTION. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 28,000.",
        "vin": "5FNRL5H99GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321682,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN LOSS OF ENGINE POWER WHILE ATTEMPTING TO MERGE ON A HIGHWAY. FORTUNATELY I HAD A SHOULDER TO ESCAPE ONTO AS I COULD NOT MAKE IT UP TO HIGHWAY SPEED AND COULD NOT MERGE.   FOUND OUT AFTERWARDS THAT THE CAUSE WAS SPARK PLUG FOULING AS A BUILD UP OCCURS DURING ECO MODE AS OIL BYPASSES THE PISTON RINGS ON CYLINDERS EQUIPPED WITH THE HONDA VCM (VARIABLE CYLINDER MANAGEMENT) SYSTEM. THE BUILD UP CONTINUES UNTIL THE ENGINE BEGINS TO MISFIRE AND TRIGGERS THE CHECK ENGINE LIGHT AND THE ENGINE RUNS ROUGH, STUMBLES AND DRIVES IN 'LIMP ALONG' MODE.    THIS PROBLEM HAS OCCURRED MULTIPLE TIMES (FIRST OCCURRENCE 03/25/2019, LATEST OCCURRENCE 04/16/2020) AND MY LOCAL HONDA SERVICE CENTER HAS FOUND DIAGNOSTIC TROUBLE CODE P0302 INDICATING A MISFIRE CONDITION IN CYLINDER #2.   HONDA SERVICE PEOPLE CALL IT THE 'PISTON RING PROBLEM' AS IT IS A WELL KNOW MANUFACTURING DEFECT THAT HONDA DESCRIBES IN TSB 13-081 AND RESULTED IN A CLASS ACTION LAWSUIT (CASE NO. 3:12-CV-1377-SI) AGAINST HONDA. THE LAWSUIT WAS SETTLED IN 2014 AND ALL 2008 THRU 2013 HONDA ODYSSEY MODELS WERE COVERED AND GIVEN AN EXTENDED 8 YEAR UNLIMITED MILEAGE DRIVE TRAIN WARRANTY IN THE SETTLEMENT.    APPARENTLY THE DEFECT WAS NOT CORRECTED IN LATER MODELS AS MY 2016 HONDA ODYSSEY IS NOW EXHIBITING THE SAME EXACT SYMPTOMS. MY HONDA WAS 3 YEARS OLD AND HAD 69K MILES AT THE TIME OF THE FIRST OCCURRENCE. THE PROBLEM HAS REOCCURRED MULTIPLE TIMES AND YET HONDA HAS DECLINED TO COVER THE $3000 COST OF REPLACING THE PISTON RINGS (AS RECOMMENDED BY THE HONDA SERVICE CENTER) STATING THAT MY VEHICLE IS OUT OF WARRANTY AND MY VIN IS NOT COVERED BY THE SETTLEMENT.",
        "vin": "5FNRL5H6XGB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/18/2020",
        "dateOfIncident": "03/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318569,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 HONDA ODYSSEY. DRIVER SIDE SLIDING DOOR LATCHES FAILED TO OPERATE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE MADE A BEEPING NOISE AND THE DOOR LIGHT ILLUMINATED WHEN THE DOORS WERE NOT LATCHED. TOOK THE VEHICLE TO VIC BAILEY HONDA HONDA (500 E DANIEL MORGAN AVE, SPARTANBURG, SC 29302) WHERE IT WAS DIAGNOSED AS A SUN SENSOR DEFECT AND RETURNED TO OWNER. OWNER GOT VEHICLE HOME AND THE BEEPING OCCURRED AGAIN. OWNER TOOK VEHICLE BACK TO VIC BAILEY HONDA, AND WAS QUOTED AN ESTIMATE OF $700 FOR THE REPAIRS. THE MANUFACTURER WAS NEVER NOTIFIED BY VIC BAILEY HONDA, NOR DID VIC BAILEY HONDA OFFER TO NOTIFY MANUFACTURER EVEN WHEN ASKED TO DO SO BY THE OWNER, SO OWNER WILL FILE COMPLAINT TO MANUFACTURER. OWNER DISCOVERED NHTSA CAMPAIGN NUMBER: 18V795000 (LATCHES/LOCKS/LINKAGES) FOR THE 2018 HONDA ODYSSEY, WHICH IS LIKELY ASSOCIATED WITH THE 2016 ODYSSEY FAILURE.   THE BEEPING IS CONTINUOUS UNLESS THE AUTOMATIC BACK SLIDING DOOR SWITCH IS OFF.  BEEPING OCCURS WHEN IN REVERSE OR FORWARD, NOT WHEN STOPPED. DRIVER SLIDING DOOR CLOSED AND LOCK THEN REAR MOTOR WOULD UNLOCK. IT NEEDS A NEW LEFT SLIDE DOOR REAR MOTOR/LOCK ASSEMBLY.  TECH RECOMMENDS NEEDS LEFT REAR SLIDE DOOR LOCK ASSEMBLY. ASR REPLACED SLIDING DOOR REAR LATCH LOCK ASSEMBLY. INSTALLED NEW LEFT SLIDING DOOR REAR LATCH LOCK ASSEMBLY AND NOT THE DOOR SHOWS CLOSED. BEEPING IS NOT OCCURRING AT THIS TIME. THE VEHICLE HAS BEEN REPAIRED IN THE AMOUNT OF $700.76. THE FAILURE MILEAGE WAS 29,000 WHEN FIRST NOTICED, BUT NOW IS 57,000.",
        "vin": "5FNRL5H92GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318196,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE SLIDING DOORS OPEN SENSOR WILL GO OFF. THIS CREATES A MAJOR DISTRACTION WHILE DRIVING AS IT IS A CONSTANT BEEP TRYING TO ALERT YOU THAT YOUR DOORS ARE OPEN. OBVIOUSLY WHILE DRIVING, MY DOORS ARE CLOSED. THIS HAPPENS AT LEAST ONCE A WEEK IN WHICH I AM FORCED TO SHUT OFF THE POWER SLIDING DOORS.",
        "vin": "5FNRL5H31GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/12/2020",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317666,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT WHILE COMING TO A STOP AT A STOP SIGN, THE ENGINE REVVED UP DESPITE THE CONTACT'S FOOT BEING ON THE BRAKE PEDAL. THE CONTACT HAD TO PLACE THE VEHICLE INTO PARK AND TURNED OFF THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO GERALD JONES HONDA LOCATED AT (4022 WASHINGTON RD MARTINEZ GA 30907, (706)228-7000). THE MECHANIC WAS UNABLE TO DIAGNOSE OR PROVIDE THE CAUSE OF THE FAILURE. THE CONTACT STATED THAT THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC ON 3-11-20 WHO STATED THAT THE FAILURE MAY BE DUE TO A DEFECTIVE TRANSMISSION SENSOR. THE ECU WAS REPROGRAMMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 200. *LN*JB",
        "vin": "5FNRL5H25GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "06/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302981,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHAKES WHEN YOU PUSH ON THE GAS PEDAL",
        "vin": "5FNRL5H38GB"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291552,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT THE DRIVER AND PASSENGER SIDE SLIDING DOOR LATCHES FAILED TO OPERATE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE MADE A BEEPING NOISE AND THE DOOR LIGHT ILLUMINATED WHEN THE DOORS WERE NOT LATCHED. THE CONTACT TOOK THE VEHICLE TO COMMONWEALTH HONDA (6 COMMONWEALTH DR, LAWRENCE, MA 01841) WHERE IT WAS DIAGNOSED AND THE CONTACT WAS QUOTED AN ESTIMATE OF $1,400 FOR THE REPAIRS. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT FILED A COMPLAINT. THE MANUFACTURER AGREED TO PAY FOR 70% OF THE REPAIR. THE CONTACT DISCOVERED NHTSA CAMPAIGN NUMBER: 18V795000 (LATCHES/LOCKS/LINKAGES) FOR THE 2018 HONDA ODYSSEY, WHICH HE ASSOCIATED WITH HIS 2016 ODYSSEY FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 41,000.   *JS",
        "vin": "5FNRL5H40GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290706,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DOOR CAN NOT BE OPENED IN THE COLD WEATHER.  REAR DOOR CAN ONLY BE OPENED IN THE WARM WEATHER",
        "vin": "5FNRL5H46GB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11282240,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE DRIVING 65 MPH, THE VEHICLE CRASHED INTO A DEER. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES TO THE NECK AND BACK, BUT DID NOT RECEIVE MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A LOCAL BODY SHOP FOR REPAIRS TO THE FRONT END. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT IT WAS A MINOR CRASH AND THE AIR BAGS WERE NOT DESIGNED TO DEPLOY DURING MINOR CRASHES. THE FAILURE MILEAGE WAS APPROXIMATELY 25,000.",
        "vin": "5FNRL5H45GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279500,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIALLY NOTICED STARTING PROBLEM WHERE CAR WONT START.  THEN GOT A P060A CODE AND VSA LIGHT NOTICED LOW BATTERY AND HOOKED UP A BATTERY CHARGER.  I NOTICED A CLICKING SOUND LIKE THE STARTER WAS ENGAGING SEVERAL TIMES AND ALL THE CABIN LIGHTS WERE ON, ALL ON ITS OWN.  I HAVE NOTICED THE CABIN LIGHT WAS ON BEFORE WHEN I FIRST CAME TO THE CAR AND I SIMPLY THOUGHT THAT KIDS OPENED THE DOOR BEFORE ME.  NOW I AM SUSPICIOUS THAT THE CAR IS RUNNING THE STARTER AND TURNING ON THE CABIN LIGHT IS DRAINING THE BATTERY.  THIS ISSUE MIGHT OCCURRED EARLIER AS I HAD TO CHANGE THE BATTERY AFTER ABOUT 2 YRS. AFTER THE CAR WAS BOUGHT NEW.  THIS CAR IS EQUIPPED WITH PUSH BUTTON START.",
        "vin": "5FNRL5H65GB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269876,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO TURN RIGHT GETTING OFF THE HIGHWAY AND THE WHOLE PASSENGER SIDE AIRBAGS WENT OFF.  WAS JUST TURNING THE CORNER AND BOOM THE WHOLE SIDE, I HAD JUST STARTED TO MOVE SO WAS NOT EVEN GOING 10MPH.  DID NOT HIT ANYTHING JUST TURNING AT THE EXIT LIGHT.",
        "vin": "5FNRL5H60GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267796,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED IN PARKING LOT.    I UNLOCKED SIDE DOORS  AND PLACED MY PURSE WITH MY KEY FOB INSIDE AND STRAPPED ONE 4 YEAR OLD INTO ONE CAR SEAT IN PASSENGER MIDDLE SEAT AND THEN ANOTHER 4 YEAR OLD IN DRIVER'S SIDE MIDDLE SEAT CARSEAT.  I HIT THE DOOR CLOSE BUTTONS RESPECTIVELY.  I THEN WENT TO OPEN THE DRIVER'S SIDE DOOR TO ENTER AND THE DOOR WAS LOCKED.  I THEN TRIED THE SLIDER BEHIND ME AND THAT WAS LOCKED, TOO.  I WALKED AROUND ALL THE DOORS OF THE VAN AND ALL WERE LOCKED.  THE KEY AND THE PRESCHOOLERS WERE ALL IN THE CAR.  I COAXED ONE 4 YEAR OLD WHO COULD GET OUT OF HIS CAR SEAT TO CLIMB UP FRONT TO UNLOCK THE DOOR MANUALLY BUT UPON ME WATCHING THE DOOR WOULD NOT UNLOCK FROM THE INSIDE EITHER.  HER CHECKED THE PASSENGER DOOR WHICH ALSO WOULD NOT UNLOCK.  I ATTEMPTED TO GET HELP IN THE PARKING LOT FOR SOMEONE TO GO INTO THE STORE AND GET HELP BUT NO-ONE CAME.  THE 4 YEAR OLD ON THE OTHER SIDE OF THE GLASS WAS FRANTIC AS I KEPT TRYING TO OPEN ALL OF THE DOORS.  I FINALLY GOT HIM TO GET IN MY PURSE AND WAS TRYING TO HELP HIM, THROUGH THE GLASS, TO UNLOCK THE PHONE TO CALL 911 WHEN THE CAR ALARM ENACTED AND ALTHOUGH MY CAR DOOR STILL WOULDN'T OPEN THE OTHER 4 YEAR OLD MANAGED TO MANUALLY DISENGAGE THE LOCK ON THE DRIVER'S SIDE SLIDING DOOR TO ENABLE ME TO CLIMB THROUGH AND START THE CAR.  NO HELP CAME AND I'M JUST GRATEFUL THEY WERE NOT YOUNGER AND I WASN'T HOTTER OUTSIDE.  THE 4 YEAR OLDS WERE TERRIFIED.  I SPOKE WITH HONDA SERVICE ON THE PHONE AND THE EMPLOYEE SAID IT DIDN'T SOUND ELECTRICAL OR MECHANICAL AND FELT NO NEED FOR ME TO BRING MY VEHICLE IN.",
        "vin": "5FNRL5H67GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267009,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY AFTER CHANGING ENGINE OIL AT HONDA DEALERSHOP LAST WEEK MONDAY, THERE WAS FLICKERING ON DASH BOARD AFTER TURNING THE POWER OFF. THE SYMPTOM WAS GETTING WORSE AND ON SUNDAY AND MONDAY (YESTERDAY), THE CAR HORN HONKING ITSELF. AND YESTERDAY, THE DASH BOARD POWER COULDN'T BE TURNED OFF WHEN I TURNED THE POWER SWITCH OFF (ENGINE OFF LUCKILY) AND THE FLICKERING GOT WORSE LAST NIGHT. SO, I DID UNPLUG THE BATTERY WITH A WORRY OF FULLY DRAINED BATTERY OVERNIGHT. TODAY MORNING, I PLUG THE BATTERY BACK AND GET THE SAME ISSUE, AND LUCKILY IGNITE THE ENGINE AND WENT TO DEALER SHOP AGAIN. THEY DID DIAGNOSIS AND SAID KEYLESS ACCESS CONTROL UNIT NEEDS TO BE REPLACED. HERE IS THE SUMMARY OF THE SYMPTOMS:  LAST WEEK FLICKERING DASH BOARD WITH FCW SYSTEM FAILED. AND HONKING ITSELF WITH KEEPING FLICKERING. YESTERDAY, I SAW ERROR MESSAGE OF \"KEYLESS SYSTEM ERROR\". AND I WENT TO DEALERSHOP IN THIS MORNING. HERE IS MY SPECULATION: DURING OIL CHANGE, THERE WAS OIL SPILLING, WHICH CAUSES SHORTING OF CIRCUITRY (OR TECHNICIAN ACCIDENTLY HIT SOME PARTS INSIDE). IT CAUSES FREQUENT ON/OFF OF ELECTRONIC SYSTEM, ENDING UP BREAKING THE KEYLESS ACCESS CONTROL UNIT. THE DEALER DIDN'T SAY ANYTHING, BUT CHARGED ME TO REPLACE THE PARTS SINCE MY CAR IS OUT OF WARRANTY.",
        "vin": "5FNRL5H6XGB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265466,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS HESITANT WHEN ACCELERATING AND JOLTS WHEN SHIFTING AND DOWN SHIFTING. I HAD MY VEHICLE SERVICED FOR A SERPENTINE BELT AND I WAS TOLD THE TIMING BELT TENSIONER WAS LEAKING SO THAT HAD TO BE CHANGED ALSO. EVERYTHING WAS 'CHECKED OUT' BY A CERTIFIED HONDA SPECIALIST AND THEY DIDN'T FEEL THE ISSUE. IT'S BECOMING WORSE.",
        "vin": "5FNRL5H67GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11259070,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING LEFT TURN ACCELERATED AFTER PRESSING THE BRAKE.   THIS HAPPENED ON A CITY STREET.",
        "vin": "5FNRL5H69GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255260,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 12TH 2019, AROUND 11PM I WAS DRIVING APPROX 45MPH ON A ROAD WITH NO OTHER CARS IN SIGHT. IT WAS ONE OF THE HOTTEST DAYS OF THE YEAR WITH THE HEAT INDEX THAT DAY OVER 100 DEGREES F. WHILE I WAS DRIVING THERE WAS A LOUD EXPLOSION ABOVE MY HEAD. AFTER RECOVERING FROM THE SHOCK, I LOOKED UP AND DISCOVERED THAT THE SUNROOF HAD SHATTERED COMPLETELY (STILL TOGETHER). I PULLED OVER. THERE WAS NO HOLES OR NICKS BUT A LARGE OUTWARD PROTRUSION AS IF THE IT EXPLODED OUTWARD FROM THE INTERIOR OF THE CAR. AS I DROVE IT HOME SOME OF THE TOP PIECES OF THE CRACK EVENTUALLY BROKE AWAY FORMING A HOLE. THE NEXT MORNING I TOOK IT INTO THE HONDA DEALERSHIP AND THEY DIDN'T EVEN LOOK AT IT BUT JUST CLAIMED THAT A ROCK MUST HAVE HIT IT. THEY TOLD ME THE LARGE UPWARD PROTRUSION WAS CAUSED MY DRIVING WIND AFTER THE CRACK HAD HAPPENED (BUT I PULLED OVER INSTANTLY). THIS SEEMS INCREDIBLY DANGEROUS AND I AM SAD THAT THE DEALER WON'T EVEN AKNOWLEDGE THE POSSIBILITY OF A DEFECT IN THE SUNROOF GLASS.",
        "vin": "5FNRL5H95GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246458,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT BOTH THE REAR DRIVER AND PASSENGER SIDE SLIDING DOORS FAILED TO FUNCTION PROPERLY. WHEN PRESSING THE AUTOMATIC BUTTON TO CLOSE THE DOORS, THE DOORS REVERSED INSTEAD OF MOVING FORWARD TO CLOSE. THE CONTACT STATED THAT THE DOORS COULD ONLY CLOSE MANUALLY. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE PARTS THAT NEEDED TO BE REPLACED WERE UNKNOWN. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 24,000.",
        "vin": "5FNRL5H60GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2019",
        "dateOfIncident": "08/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246288,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL OR FUEL LEAK FOUND AFTER DRIVING VEHICLE.  WONDERING IS IT RELATED TO SAFETY#16V41700. AS WELL AS EXCESSIVE RUST ON LATCH/MUFFLER, PARKS OF THE ENGINE.",
        "vin": "5FNRL5H6XGB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245438,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT THE SECOND ROW DRIVER'S SIDE SEAT WOULD NO LONGER LATCH INTO THE FORWARD POSITION, WHICH CAUSED THE BACK SUPPORT TO BECOME LOOSE. THE VEHICLE WAS TAKEN TO GWINNETT PLACE HONDA (3325 SATELLITE BLVD, DULUTH, GA 30096, 678-534-2208) WHERE IT WAS DIAGNOSED THAT THE FRAME WAS DAMAGED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 09804235. THE MANUFACTURER STATED THAT THEY WOULD PROVIDE GOODWILL ASSISTANCE FOR THE REPAIR; HOWEVER, THE CONTACT WOULD HAVE TO PAY A SMALL FEE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 36,000. *TT *TR",
        "vin": "5FNRL5H97GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222046,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED IN CAR WHILE PARKED IN A GARAGE.",
        "vin": "5FNRL5H9XGB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221953,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN JUDDERS PERIODICALLY AT SPEEDS BELOW 50MPH.  THE JUDDERING IS BAD ENOUGH TO BE A SAFETY ISSUE. THE TORQUE CONVERTER SOFTWARE HAS BEEN UPDATED AND TRANSMISSION FLUID FLUSHED MULTIPLE TIMES WITHOUT SOLVING THE ISSUE. THE TRANSMISSION SHIFTS ERRATICALLY AND JERKS THE VAN RENDERING IT UNSTABLE. MULTIPLE CUSTOMERS HAVE REPORTED THE SAME ISSUE WITH THIS MODEL.",
        "vin": "5FNRL5H98GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195830,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT THE WALK-IN RELEASE LEVER TO THE SECOND ROW OUTBOARD SEAT WOULD NOT REMAIN IN THE LOCK POSITION. THE CONTACT HAD TO MANUALLY LOCK THE SEAT IN ORDER FOR IT TO REMAIN IN POSITION. THE VEHICLE WAS TAKEN TO HONDA OF SANTA MARIA (XXX), BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE FAIILURE MILEAGE WAS APPROXIMATELY 56,442.  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5FNRL5H65GB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/27/2019",
        "dateOfIncident": "03/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191936,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INNER TIRE ROD UNTHREADED FROM THE OUTER TIRE ROD IN THE FROM PASSENGER TIRE AND LOCKED MY RIGHT TIRE DISABLING THE CAR",
        "vin": "5FNRL5H4XGB"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186768,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 38000 MILES, MY STEERING WHEEL BEGAN TO MAKE A CLICKING/POPPING SOUND WHEN TURNING AT A VERY SLOW SPEED, I TOOK IT IN AND THE DEALER/SERVICE CENTER SAID THERE WAS A SERVICE BULLETIN, BUT IT WASN'T A SAFETY HAZARD, ALSO SAID THE VAN HAD A SIMILAR ISSUE WITH STRUTS (SAFETY BULLETIN ISSUED FOR THOSE AS WELL).  EXTREMELY DISAPPOINTED THAT A VEHICLE WITH THIS LOW MILES AND SUCH A GOOD REPUTATION FOR QUALITY WOULD HAVE SUCH ISSUES AND I FIND IT HARD TO BELIEVE HOW THE STEERING AND STRUTS ARE NOT A SAFETY ISSUE.  PRIOR TO THESE ISSUES, MY RACK AND PINION STARTED LEAKING, WHICH IS UNHEARD OF AT 35000 MILES.",
        "vin": "5FNRL5H34GB"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182736,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE SLIDING DOOR OPENS UP AUTOMATICALLY AS THE CAR IS IN MOTION.  THE VAN IS SET TO LOCK ALL DOORS WHEN TAKEN OUT OF PARK.  THE VAN DOESN'T GO INTO PARK THUS ALLOWING THE SLIDING DOOR TO OPEN.  THIS IS THE SECOND ROW OF THE VAN WHERE MY CHILDREN SIT.  WHEN IT HAS OPENED, ON ITS OWN, MY CHILD HAS BEEN SITTING THERE.  THE DEALERSHIP CAN'T FIGURE OUT WHAT IS CAUSING THE DOOR TO OPEN OR WHY THE DOORS DON'T LOCK.  *TR",
        "vin": "5FNRL5H93GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176267,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING OUR 2016 HONDA ODYSSEY ON THE FREEWAY ON 8 FEBRUARY 2019, THE SUNROOF GLASS EXPLODED LEAVING A HOLE ABOUT 6 INCHES FRONT-TO-BACK BY ABOUT 9 INCHES SIDE-TO-SIDE.  AT THE TIME OF THE EVENT, THE INTERIOR PANEL WAS OPEN TO LET IN THE SUNLIGHT SO IT WAS QUITE LOUD WHEN THE GLASS EXPLODED.  I DO NOT BELIEVE THE GLASS WAS HIT BY A ROCK OR OTHER DEBRIS.  THERE WERE NO CARS OR TRUCKS CLOSE AHEAD OF ME AND I HAD NOT GONE UNDER AN OVERPASS. ALSO THE REMAINING BROKEN GLASS AROUND THE HOLE WAS BOWED OUTWARD.  MY SENSE IS THAT THIS IS A STRESS-RELATED FAILURE - PERHAPS TRIGGERED BY THE DIFFERENCE BETWEEN OUTSIDE AND INSIDE TEMPERATURES. AT THE TIME OF THE EVENT, THE OUTSIDE TEMPERATURE HERE IN CASTLE ROCK, CO WAS 19 DEG F AND THE SUN WAS SHINING. THE INSIDE TEMPERATURE WAS ABOUT 67 DEG F.  OUR DEALER, KUNI HONDA, SAID THAT BECAUSE THE VAN HAD PAST THE 36-MONTH MARK IN DECEMBER (ABOUT 5 WEEKS EARLIER) THAT THEY WOULD NOT COVER THE REPAIR UNDER WARRANTY.  THE SERVICE MANAGER TOLD ME THE REPAIR WOULD COST $997.02.",
        "vin": "5FNRL5H60GB"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "06/19/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165609,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. EACH TIME THE VEHICLE WAS DRIVEN, IT PULLED TO THE LEFT. THE FAILURE OCCURRED NUMEROUS TIMES. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO DCH HONDA OF NANUET (10 NY-304, NANUET, NY 10954, (845) 367-4380) WHERE A WHEEL ALIGNMENT, TIRE BALANCE, AND AIR PRESSURE CHECK WERE COMPLETED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THEY RE-TESTED THE WHEEL ALIGNMENT AND TEST DROVE THE VEHICLE, BUT COULD NOT DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 09153138. THE APPROXIMATE FAILURE MILEAGE WAS 26,142. *BF  CONSUMER STATED FRONT-END WHEEL ALIGNMENT ALL FOUR WHEELS WERE DONE AND ALL 4 WHEELS WHERE BALANCED BY A DEALER ON SAT. 11/18/18 VEHICLE STILL HAD PROBLEMS TOOK IT TO ANOTHER DEALER SOLVED THE PROBLEM.*JB",
        "vin": "5FNRL5H91GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/31/2018",
        "dateOfIncident": "11/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164241,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  MY HONDA ODYSSEY IS A 2016 MODEL. I TOOK IT TO THE DEALER WHEN I DISCOVERED THE WIRES WERE BROKEN TO THE SLIDING ELECTRIC DOOR. I WAS TOLD IT WOULD BE  $1500 TO FIX. I INQUIRED ABOUT THIS BECAUSE A MINI VAN IS BUILT TO ALLOW THE DOORS TO EASILY BE OPENED AND CLOSED. THE DEALERSHIP SAID THAT THEY HAD SEEN MANY COMPLAINTS ABOUT THE DOOR REGARDING THIS MODEL.THEY TURNED OFF THE DOOR, SO THAT I COULDN'T OPEN IT.  I TOLD THEM I WOULD CALL HONDA HEADQUARTERS AND THEY SAID NOTHING COULD BE DONE.  I ESSENTIALLLY HAD TO TURN OFF THE ABILITY TO AUTOMATICALLY OPEN THE DOOR WHEN A STOP IS MADE  OTHERWISE A LOUD BEEP WOULD EMIT. THIS IS VERY UNSAFE BEACUSE I AM HARD OF HEARING. WHEN IT IS TIME TO GET OUT OF THE CAR I TURN THE AUTOMATIC BACK ON, SO THAT THE KIDS CAN EASILY EXIT FROM ONE DOOR. I OPEN THE LEFT DOOR MANUALLY WHICH IS VERY HARD. I LIVE ON A HILL, SO I OPEN THE DOOR AND LET KIDS IN BUT THE DOOR SLAMS SHUT! HOW UNSAFE IS THAT, A DOOR SLAMS INTO A CHILD BECAUSE I LIVE ON A HILL AND AM FORCED TO USE THE  MANUAL  SETTING. NOBODY GOT HURT, BUT SOMEONE COULD HAVE. A FEW DAYS LATER, I WAS WITH MY FAMILY AND WE WERE ALL IN THE CAR, THE DOORS WERE IN THE MANUAL SETTING AND THD DOOR DIDN'T CLOSE ALL THE WAY. I AM  IN MOTION AND THE DOOR OPENS. LUCKILY EVERYBODY WAS SECURED IN THEIR SEATBELTS, BUT WE WERE JUST GETTING MOVING. WOULD IF MY CHILD WAS UNBUCKLED AND THE DOOR OPENED? MY KID WOULD FLY OUT! HOW UNSAFE! THIS NEEDS TO BE FIXED!!!!",
        "vin": "5FNRL5H67GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163572,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR LIFT GATE IS IMPOSSIBLE TO OPEN IN COLD WEATHER FOR OUR 2016 HONDA ODYSSEY EX.  THERE IS ONLY ONE MECHANISM TO OPEN THE REAR LIFT GATE - A PHYSICAL BUTTON ON THE REAR LIFT GATE.  WHEN TEMPERATURES DIP INTO 30 OR 40 DEGREES F, THE LIFT GATE WILL NOT OPEN.  HONDA RELEASED A SERVICE BULLETIN (16-063; APRIL 11 2018) INDICATING THAT THIS IS A KNOWN PROBLEM AFFECTING ALL ODYSSEYS BETWEEN 2011-2017 (AND ALL CRVS BETWEEN 2012-2016).  UNFORTUNATELY, WE ARE OUT OF WARRANTY AND ARE FACING AN EXPENSIVE REPAIR.  GIVEN THE NUMBER OF VEHICLES AFFECTED, WE WOULD EXPECT HONDA TO ISSUE A RECALL RATHER THAN A SERVICE BULLETIN.  THIS IS DEFINITELY A HASSLE, ESPECIALLY WHEN ATTEMPTING TO LOAD ANYTHING INTO THE TRUNK, AND COULD REPRESENT A SIGNIFICANT SAFETY ISSUE IN THE EVENT OF A CRASH WHEN OTHER DOORS ARE INOPERATIVE.",
        "vin": "5FNRL5H47GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162081,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC SLIDING DOOR WOULD NOT CLOSE. WHEN ATTEMPTING TO MANUALLY CLOSE, DOOR COMPLETELY FEEL OFF TOP TRACK AND CAME OUT OF MIDDLE PANEL CAUSING SIGNIFICANT DAMAGE TO BODY OF CARMEL VEHICLE WAS NOT MOVING AND WAS PARKED IN A PARKING LOT",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154209,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M VIEWING SAFETY RECALL: POWER SLIDING DOOR REAR LATCHES (SERVICE BULLETIN 18-128) AND BELIEVE THAT THE SAME REAR LATCH FAILURE IS OCCURRING WITH THIS EARLIER MODEL YEAR VERSION. THE BULLETIN WAS RELEASED RECENTLY FOR 2018 AND 2019 ODYSSEY'S. DAYS AGO MY VAN'S LEFT REAR POWER SLIDING DOOR WOULD NOT LATCH CLOSED. THE VEHICLE WAS STATIONARY. THE PRELIMINARY DIAGNOSIS AT THE DEALERSHIP WAS THE REAR LATCH COMPONENT 'WEARS OUT.' BASED ON THIS RECENT BULLETIN I BELIEVE THE RECALL SHOULD BE EXPANDED TO INCLUDE OLDER MODELS AS THE FAILURE TO LATCH CONDITIONS ON THE NEWER MODELS AND OLDER MODEL IN MY CASE ARE IDENTICAL AND THE SAME COMPONENT IS AT FAULT. THIS IS A MAJOR SAFETY ISSUE AS THESE DOORS ARE NOT FULLY MECHANICALLY LATCHING CLOSED.",
        "vin": "5FNRL5H31GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "01/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144212,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS RANDOMLY SLIPPING GOING 30 TO 40 MILES IN TRAFFIC.  ISSUE STARTED AROUND 15K MILES, CURRENT MILES IS 30K MILES. SINCE THEN, WE HAVE HAD THIS EVENT FOR ABOUT 12 TIMES IN THE LIFETIME WE HAVE OWNED THIS NEW VEHICLE. WE HAVE TAKE OUR VEHICLE TO SURPRISE HONDA DEALER BUT UNABLE TO DUPLICATE ISSUE AND DO ANYTHING. DURING THIS EVENT, VEHICLE WILL SHAKE, MAKE NOISE AND STALL.  WE HAVE TO GO TO THE SIDE OF THE ROAD AND RESTART ENGINE.  LATELY, WE HAVE TO RESTART ENGINE 3 TIMES IN ORDER TO RESET ISSUE.  WE FEEL THERE IS A HIGHLY SAFETY CONCERN WITH OUR VEHICLE ISSUE SINCE IT STALL BETWEEN TRAFFIC.",
        "vin": "5FNRL5H27GB"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139139,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BRAKING ON THE FREEWAY DRIVING AT 65 MPH.  WHEN I BRAKED THE STEERING SHAKES.  THE CAR IS ALMOST 3 YEARS OLD WITH ONLY ABOUT 23,000 MILES ON IT.  I WILL TAKE TO DEALER TO GET IT INSPECTED.",
        "vin": "5FNRL5H67GB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2018",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130759,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY CAR TO A STOP AT A VERY BUSY INTERSECTION LEADING TO A FOUR LANE ROAD AND THE CAR WANTED TO LUNGE FORWARD. I HAD TO ALMOST STAND ON THE BREAK TO STOP THE CAR AND THE ENGINE ROARED. I TURNED IT OFF. I THEN STARTED THE ENGINE AGAIN AND IT DID THE SAME THING. I WAITED A FEW MINUTES AND STARTED IT AGAIN. THIS TIME IT WAS OK. I HAD THIS HAPPEN LAST YEAR AND TOOK IT IN TO HONDA. THEY COULD FIND NO PROBLEM. THIS COULD CAUSE A CAR TO GO INTO TRAFFIC IF THE DRIVER WAS NOT PAYING ATTENTION.",
        "vin": "5FNRL5H25GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129630,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD REST IS TILTED TO FAR FORWARD AND IS VISIBLY COMING OUT OF THE BACK OF THE SEAT. THE FORWARD TILT CAUSES NECK AND LOWER BACK PAIN. IT ALSO PUTS THE DRIVER AT RISK FOR A \"HANGMAN'S FRACTURE\" OF THE NECK DURING AN ACCIDENT. DEALER SAID IT'S NOT COVERED UNDER WARRANTY AND TO CONTACT AMERICAN HONDA.",
        "vin": "5FNRL5H61GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129633,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT SPEEDS HIGHER THAN 50MPH THE MOMENT THE BRAKE IS APPLIED THE STEERING WHEEL AND WHOLE VEHICLE SHAKES. THE VEHICLE STARTED DOING THAT AFTER JUST BEING DRIVEN LESS THAN 12,000 MILES IT CURRENTLY HAS 17,890 MILES.",
        "vin": "5FNRL5H63GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "08/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121892,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM STARTS WHEN SHIFTING FROM FIRST GEAR TO SECOND GEAR WHILE DRIVING AND WHILE SLOWING DOWN TO A FULL STOP. THE VAN JOLTS/  JERK. I WENT TO KUNI HONDA CENTENNIAL, CO. WHERE THEY VISUALLY INSPECTED AND TWO DIFFERENT TECHS TEST DROVE WITHOUT EXPERIENCING THE JOLTING. THE DRIVE HOME WAS WITHOUT INCIDENT. THE NEXT MORNING MY WIFE EXPERIENCED THE SAME JOLTING / JERKING ON UPSHIFT AND DOWNSHIFT. THIS PROBLEM IS SCARY SPECIALLY WHEN YOUR DRIVING ALONG THE FREEWAY AND STARTS JERKING. THE SAFETY OF THE PEOPLE INSIDE THE VAN IS NOW UNSAFE AND IN QUESTION.  HELP!!!  THE DEALERSHIPS DON'T KNOW THE SOLUTION SO WE'RE ALL DEPENDENT ON HONDA MANUFACTURING ENGINEERS TO CREATE AND DISTRIBUTE A SERVICE BULLETIN NOW BEFORE SOMEONE GETS HURT!  MILEAGE OF FIRST INCIDENT: 25,440",
        "vin": "5FNRL5H93GB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11120732,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SLOWLY DRIVING OVER A SET OF UNDULATIONS IN A BUSINESS PARKING LOT, THE VAN CAME DOWN ON ONE OF THE UNDULATIONS AND DEPLOYED THE PASSENGER SIDE AIR CURTAINS AND PASSENGER SEAT AIRBAGS. THIS IS A VMI CONVERTED MOBILITY VAN. BECAUSE THE VAN IS LOWER TO THE GROUND AND HEAVIER, IT DID DAMAGE TO THE BOTTOM OF THE VAN. BECAUSE OF THE LOW SPEED OF TRAVEL, AND THE NATURE OF THE VAN COMING DOWN ON THE UNDULATIONS (NOT SIDE IMPACT) THE AIRBAGS SEEMED TO HAVE DEPLOYED WITHOUT CAUSE. I AM CONCERNED THAT IF WE ARE DRIVING AND HIT A POTHOLE, THE AIRBAGS MAY DEPLOY. MY WIFE IS A PARAPLEGIC AND SHE WOULD BE TRAPPED IN THE VAN BECAUSE THE RAMP WILL NOT DEPLOY.",
        "vin": "5FNRL5H65GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114135,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM STARTS WHEN I'M SHIFTING FROM FIRST GEAR TO SECOND GEAR WHILE DRIVING AND WHILE SLOWING DOWN TO A FULL STOP. THE VAN STARTS JERKING, SPECIALLY IN UPHILL. I WENT TO HONDA BUENA PARK AND THEY REPLACE THE PRESSURE SWITCH UNDER WARRANTY. I PICKED UP THE VAN AND AFTER 1 DAY THE PROBLEM STARTS AGAIN. THIS PROBLEM IS SCARY SPECIALLY WHEN YOUR DRIVING ALONG THE FREEWAY AND STARTS JERKING. THE SAFETY OF THE PEOPLE INSIDE THE VAN IS NOW UNSAFE.",
        "vin": "5FNRL5H68GB"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2018",
        "dateOfIncident": "05/28/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111320,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WORKMANSHIP BY HONDA SERVICE AND REPAIR CAUSED CONSEQUENTIAL DAMAGE TO MY ODYSSEY 2016 CAR, WITH LESS THAN 32K MILES FOR NOW.  VEHICLE WAS TIMELY SERVICED /REPAIRED BY FIESTA HONDA 6 TIMES IN LESS THAN 1.7 YEARS. REGISTERED A CASE WITH AMERICAN HONDA TO OFFER COMPLETE REPAIR, EXTENDED BUMPER TO BUMPER WARRANTY AND OUT OF THE POCKET EXPENSES. AMERICAN HONDA AND FIESTA HONDA REFUSED TO TAKE CARE OF THE EXTENDED WARRANTY AND OUT OF THE POCKET EXPENSES AND THEY HAVE COVERED UP THE CASE AND THEIR MISTAKES, THROUGH JUST BLAME GAME. PER DAVID HONDA FRISCO,  WHO CHECKED THE VEHICLE INITIALLY -\"'CYLINDER BLOCK ASSEMBLY: P3400/P3497 VALVE PAUSE STUCK OFF. CHECKED FOR LOW OIL AND OIL LEVEL WAS OVER FULL. ALSO FOUND BURNT OIL/SLUDGE STUCK ALL OVER DIP STICK. REMOVED VALVE COVERS AND REAR SPOOL VALVE ASSEMBLY AND FOUND OIL PASSAGE IN SPOOL. ASSEMBLY CLOGGED DUE TO NEGLIGENCE. OIL IS VERY DIRTY DUE TO OIL NOT BEING CHANGED CONSISTENTLY .' , WHEN THE ENGINE LIGHT ON MAY LAST WEEK, I BROUGHT IT TO DAVID HONDA FRISCO, FROM FRISCO, FIESTA HONDA HONDA TOWED THE VEHICLE TO SAN ANTONIO AND MANIPULATED THE CASE BY AMERICAN HONDA AND FIESTA HONDA. AMERICAN HONDA CASE MANAGER WAS VERY RUDE AND ARROGANT HANDLING THE CASE. AMERICAN HONDA AND FIESTA HONDA IS NOT EXPLAINING WHAT THEY HAVE DONE TO THE VEHICLE, THEY JUST SAY READY TO PICK UP. PROBABLY A MIRACLE HAPPENED TO THIS VEHICLE, HOW CAN WE TRUST THIS VEHICLE, FIESTA HONDA AND AMERICAN HONDA.",
        "vin": "5FNRL5H68GB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/24/2018",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103622,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK WINDSHIELD EXPLODED FOR NO REASON.  THE CAR WAS PARKED AND NOT STRUCK BY ANY OBJECTS.  POLICE INVESTIGATED AND FIRST POINTED OUT THAT IT LOOKS LIKE IT EXPLODED OUTWARD, FROM THE INSIDE RATHER THAN BEING HIT.  TWO HOLES WHERE GLASS FELL OUTSIDE THE VEHICLE, BUT IT IS CLEARLY BOWING OUTWARD",
        "vin": "5FNRL5H63GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103029,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STATIONARY IN SLIGHT INCLINE DRIVEWAY, OPENING DOOR ON DRIVER SIDE PASSENGER IT BEEPS LIKE SOMETHING IS IN WAY THEN CLOSES.  HAPPENS EVERYDAY THAT I DRIVE IT.   IT HAS ALMOST CRUSHED MY KIDS LEG A FEW TIMES.  IT DOES NOT STOP UNLESS IT HITS SOMETHING HARD LIKE YOU.  I HAVE BROUGHT IT TO 2 HONDA DEALERSHIPS 4 TIMES AND ALSO CONTACTED HONDA CORPORATE AND IT IS STILL NOT FIXED.",
        "vin": "5FNRL5H68GB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "05/31/2018",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099847,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "PRIMACY MXV4 TL",
                "productYear": "9999",
                "size": "235/60/R16",
                "type": "Tire"
            }
        ],
        "summary": "BLOWOUT ON THE SIDEWALL WITH 6 EVENLY SPACED CIRCULAR HOLES WHILE DRIVING ON KANSAS TURNPIKE.",
        "vin": "5FNRL5H99GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "04/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097058,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE STALLED AND ALL THE WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS ABLE TO RESTART AND FUNCTIONED NORMALLY. THE VEHICLE WAS TAKEN TO DELLA HONDA (702 NY-3, PLATTSBURGH, NY 1290 (518) 563-7686), BUT WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE TECHNICIAN INFORMED THE CONTACT THAT THE IGNITION HARNESS NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 17,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2018",
        "dateOfIncident": "10/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096665,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPLODING SUNROOF.  I WAS DRIVING TO WORK EARLY ONE MORNING AND I HEARD A LOUD BANG/POP THEN IMMEDIATELY HEARD AIR AS IF MY SUNROOF WAS OPEN.  I VERY CAREFULLY OPENED MY SLIDER AND SAW THAT MY SUNROOF HAD A HUGE HOLE IN IT.  THANK GOODNESS THE GLASS WAS ON THE SLIDER BECAUSE HAD THE SLIDER BEEN OPEN- THE GLASS WOULD HAVE SHATTERED EVERYWHERE AND HIT MY THREE CHILDREN.  I TOOK IT TO HONDA AND NOTHING WAS COVERED.  I HAD TO PAY OUT OF POCKET TO COVER THIS WHEN I DID NOTHING TO THE CAR.  IT SOUNDED LIKE A GUNSHOT.  I WAS DRIVING ON THE CROSSTOWN TOP DECK IN TAMPA FLORIDA WITH NOTHING AROUND WHEN I HEARD THE LOUD BANG.  THERE WAS NOTHING THAT COULD HAVE HIT MY CAR IN THAT DIRECTION AS HONDA SAID THAT WAS WHAT HAD TO HAVE HAPPENED BECAUSE THEY HAD NEVER HEARD OF THIS BEFORE.",
        "vin": "5FNRL5H97GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091067,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE THE VEHICLE WAS STATIONARY, THE REAR PASSENGER SIDE SLIDING DOOR CLOSED ABRUPTLY ON ITS OWN, AND DID NOT RECOGNIZE THAT THE CONTACT WAS EXITING THE VEHICLE. THE CONTACT STATED THAT THE SLIDING DOOR KNOCKED HER ONTO THE GROUND. THERE WERE NO INJURIES. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 16,029.",
        "vin": "5FNRL5H69GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089092,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RE RECALL 17V-725 - YOU AND AMERICAN HONDA SENT A LETTER IN APRIL 2018 STATING THE FIX WAS READY AND SHOULD ONLY TAKE (APPROXIMATELY) 30 MINUTES. WE CONTACTED GERALD JONES HONDA IN EVANS, GA AND MADE AN APPOINTMENT, AT WHICH TIME WE WERE TOLD TO EXPECT MORE LIKE 1.5-2 HOURS. WE THEN CALLED AMERICAN HONDA AT (888) 234-2138 TO COMPLAIN THAT WE WERE QUOTED 2 HOURS FOR A 30-MINUTE FIX. AMERICAN SAID THAT A CASE MANAGER LOOKED AT MY QUESTION, CONTACTED GERALD JONES AND WAS TOLD IT WOULD BE MORE LIKE 1-1.5 HOURS SO AMERICAN WOULD NOT TELL LOCAL GERALD JONES TO DO IT FASTER OR TO MAKE A LOANER VEHICLE AVAILABLE; AMERICAN HONDA BASICALLY SAID THEY DON'T HAVE TO OVERSEE THE EFFECTIVENESS OF SERVICE BY INDEPENDENT LOCAL DEALERS IN ACCOMPLISHING THE RECALL YOU BOTH SAID SHOULD TAKE ONLY 30 MINUTES. WE ARRIVED TO APPOINTMENT EARLY AND HAD TICKET SUBMITTED EVEN BEFORE APPOINTMENT TIME. MY WIFE AND KID THEN JUST SAT IN WAITING ROOM FOR 1.5 HOURS WITH NOBODY GIVING ANY UPDATES UNTIL SOMEONE ASKED IF EVERYONE WAS OK TO WHICH MY WIFE RESPONDED THAT SHE WANTED AN UPDATED ON OUR VAN. 15 MINUTES LATER, THAT PERSON STILL HADN'T RETURNED WITH AN UPDATE SO MY WIFE WENT OUT TO SERVICE AREA TO GET HER OWN UPDATE. IT'S FINALLY DONE AS OF ALMOST 2 HOURS AFTER APPOINTMENT TIME, BUT NEEDS SOME FINAL PAPERWORK. SHE IS THEN ESCORTED 1/2 WAY TO VAN AND SHOWN WHERE IT IS. SHE ARRIVES AT VAN WITH KID IN TOW ONLY TO LEARN FOR THE FIRST TIME THAT THE TWO CHILD CAR SEATS HAVE BEEN REMOVED AND LEFT IN THE TRUNK. NOBODY GAVE A HEADS UP. NOBODY OFFERED TO GIVE HER ASSISTANCE TO GET THE CAR SEAT INSTALLED WHILE ALSO WRANGLING THE TODDLER. SO, IN SUM, IS IT APPROPRIATE FOR GERALD JONES HONDA IN EVANS, GA TO MAKE A RECALL CUSTOMER SIT AROUND WAITING FOR MORE THAN 2 HOURS BEFORE FINALLY DRIVING OFF FOR A RECALL THAT NHTSA AND AMERICAN HONDA REPRESENTED IN THEIR APRIL 2018 LETTER SHOULD ONLY TAKE 30 MINUTES? NO",
        "vin": "5FNRL5H66GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089126,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER (RUSTY WALLIS HONDA IN DALLAS, TEXAS, 214-348-7500) FOR REPAIRS ON THE SECOND ROW SEATS. THE DEALER STATED THAT THERE WAS A SOFTWARE UPDATE REQUIRED FOR THE VEHICLE. THE CONTACT STATED THAT THE UPDATE WAS PERFORMED; HOWEVER, WHEN REVERSING AND THE SLIDING DOOR WAS OPEN, THE WARNING CHIME WOULD NOT SOUND OR THE SOUND WAS VERY LOW. THE CONTACT RETURNED TO THE DEALER TO ATTEMPT TO REPROGRAM THE WARNING CHIME AND WAS INFORMED BY THE SERVICE AGENT THAT THE CHIME WAS NOT ADJUSTABLE, IT WAS PERFORMING AS DESIGNED, AND IT COULD NOT GET ANY LOUDER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "5FNRL5H69GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/18/2018",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089129,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 HONDA ODYSSEY. WHILE DRIVING 45 MPH, THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO A TELEPHONE POLE. THE VEHICLE CAUGHT ON FIRE. THE AIR BAGS DEPLOYED. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED AND THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE VEHICLE WAS TOWED TO A TOW LOT WHERE IT WAS DEEMED A TOTAL LOSS. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 16V417000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE CONTACT DID NOT RECEIVE A RECALL LETTER. THE FAILURE MILEAGE WAS 21,700. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/16/2018",
        "dateOfIncident": "04/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088329,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS AN RECALL, RECALL NUMBER 17V-725, BUT THE DEALER OR MANUFACTURER CLEARLY DIDN'T MENTION WHEN THEY WILL ASK US TO GET THE VEHICLE INTO THE LOCAL DEALER FOR REPAIR. WE DIDN'T EVEN RECEIVE ANY PHONE CALL FROM LOCAL DEALER ASKING US TO COME IN AND GET THE VEHICLE REPAIRED.",
        "vin": "5FNRL5H63GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "02/21/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076913,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE SENSOR ON HONDA ODYSSEY WORKS ERRATICALLY. IT CAUSED AN ACCIDENT FOR ME AS THE SENOR NEVER WORKED EVEN THOUGH MY CAR REAR ENDED ANOTHER VEHICLE",
        "vin": "5FNRL5H96GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "02/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071584,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"   I HAVE NOT HEARD FROM THE DEALER ABOUT THE STATUS. 2ND ROW SEATS DO BECOME LOOSE EASILY, WITHOUT DIFFICULTY OR MUCH EFFORT, SPECIFICALLY WHEN GOING TO THE 3RD ROW ACCESS.",
        "vin": "5FNRL5H37GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066071,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V725000 (SEATS). THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE HONDA DEALER (DON JACOBS HONDA, 2699 REGENCY RD, LEXINGTON, KY 40503, (859) 276-5555) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  *TR",
        "vin": "5FNRL5H63GB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065374,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "(1)VEHICLE PROPULSION TEMPORARY SHUTS DOWN WHEN STARTING FROM A STOPPED CONDITION.  THIS HAPPENS AS PULLING ACROSS TRAFFIC, MAKING LEFT TURNS, ETC.  THIS COULD CAUSE A SERIOUS T-BONE ACCIDENT.    (2)PROBLEM IS RANDOM AND OCCURS WITHOUT WARNING.    (3)THIS SHUT DOWN PROBLEM HAS OCCURRED NUMEROUS TIMES IN LESS THAN 8,000 MILES.  (4)VEHICLE HAS BEEN PREVIOUSLY  RETURNED TO JEFF WYLER DIXIE HIGHWAY HONDA DEALERSHIP FOR FIRMWARE, ETC. FIX.  (5)THEY HAVE NOT FIXED THIS PROBLEM.  IT HAS AGAIN OCCURRING.  MOST RECENTLY ON 1/26/2018.  IT WAS SEVERE ENOUGH THAT A SIDE COLLISION ACCIDENT COULD HAVE OCCURRED IN HEAVIER TRAFFIC.  WE WERE PULLING ACROSS FOUR(4) LANE  TRAFFIC AT AN INTERSECTION WITHOUT A STOP LIGHT WHEN THE LOSS OF POWER HAPPENED.  AGAIN, THE ENGINE SEEMS TO JUST QUICKLY SHUT DOWN AND YOU QUICKLY WONDER IF IT WILL RUN BEFORE VEHICLE WILL AGAIN ACCELERATE. A PREVIOUS INCIDENT CAUSED ME TO START TO DIRECT CAR TO OUT OF TRAFFIC AREA AT END OF MEDIAN WHILE MAKING A LEFT TURN ACROSS TRAFFIC AT INTERSECTION AFTER ACCELERATION STOPPED DUE TO ENGINE, ETC SHUTTING DOWN.  (6)DOCUMENTING THIS IN HOPES OF HONDA INC. DEALERSHIP, JEFF WYLER DIXIE HIGHWAY HONDA WILL PERMANENTLY FIX THIS PROBLEM BEFORE A SERIOUS ACCIDENT OCCURS.  (7)THIS PROBLEM AND INFORMATION IS ALSO BEING DOCUMENTED IN CASE A SERIOUS ACCIDENT DOES HAPPEN AND CAN PROVIDE MYSELF OR ESTATE SURVIVORS WITH DOCUMENTATION TO SUE THE PRINCIPALS INVOLVED.",
        "vin": "5FNRL5H44GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "01/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063648,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HONDA ODDESEY 2016 MODEL HAVE  ISSUE WITH THE BATTERY CAPACITY, THIS BATTERY IS NOT A NUFF STRONG TO HOLD ANY SYSTEM RANING FOR MORE THEN 5 MINUTS,IN THIS CASE YOU WILL NOT BE AVAILABLE TO START YOUR ENGEEN AGAIN.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063032,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V725000 (SEATS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (RACINE HONDA, 9501 WASHINGTON AVE, RACINE, WI 53406) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5FNRL5H48GB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "10/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062363,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A LOT OF NOISE",
        "vin": "5FNRL5H93GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062401,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V725000 (SEATS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (RICHFIELD BLOOMINGTON HONDA, 501 W 77TH ST, RICHFIELD, MN 55423) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5FNRL5H96GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061268,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH 6 YEAR OLD IN 2ND ROW SEAT IN HER CAR SEAT, HAD TO SLAM ON BRAKES TO AVOID COLLISION TO HAVE THE SEAT (HONDA SEAT) UNLATCH FROM FLOOR AND FLING HER INSIDE OF HER CAR SEAT (CHILD SEAT) FACE FIRST INTO THE BACK OF THE PASSENGER SEAT. ONCE STOPPED AND REMOVED HER AND I PUSHED THE SEAT BACK DOWN HARD, HEARD IT CLICK AND THEN RELEASED AND DID AGAIN, PULLED ON IT SEVERAL TIMES AND SEEMED SECURE. 3 DAYS GO BY, AND NOW MY SON IS IN THAT SEAT. WE WERE DRIVING HOME YESTERDAY AND AGAIN, SOMEONE CUT ME OFF WITHOUT MUCH STOPPING DISTANCE AND SLAMMED ON MY BRAKES YET AGAIN. THIS TIME HE WAS FLUNG FACE FIRST INTO THE BACK OF THE PASSENGER SEAT, AND HITTING THE TOP OF HIS HEAD ON THE METAL PART OF THE HEAD REST THAT WAS PULLED UP. BOTH RESULTED IN SCREAMING, CRYING, PAIN, AND BEING FRIGHTENED TO BE IN THAT SEAT. THIS IS NOT OKAY. BOTH INCIDENTS WERE ON CITY ROADS IN SOUTH FLORIDA DURING DRY WEATHER.",
        "vin": "5FNRL5H65GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057388,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE SLIDING DOOR CONSISTENTLY FAILS TO CLOSE. IT WILL START TO CLOSE, AND THEN HESITATE AND STOP AS IF SOMETHING WERE IN THE DOOR TO STOP IT, WHEN NOTHING IS. WE TYPICALLY HAVE TO TURN THE POWER OFF AND CLOSE IT MANUALLY TO MAKE IT SHUT. ALSO, WHEN PUTTING THE VAN INTO REVERSE, THE BACKUP CAMERA SCREEN OFTEN GOES BLACK, AND THE ONLY WAY TO GET OFF OF THE BLACK SCREEN IS TO SHUT THE VAN OFF COMPLETELY AND RESTART IT. WHEN USING THE AUTO-UP FEATURE ON THE FRONT DRIVER WINDOW, THE WINDOW WILL SOMETIMES GO BACK DOWN AS SOON AS YOU LET GO OF THE BUTTON. YOU HAVE TO HOLD THE BUTTON UNTIL IT COMPLETELY CLOSES. WHEN YOU HAVE THE REAR ENTERTAINMENT GOING THROUGH THE MAIN SPEAKERS AND YOU ATTEMPT TO CHANGE THE VOLUME WITH THE STEERING WHEEL CONTROLS, IT'LL ACTUALLY CHANGE THE SOURCE THAT THE SOUND IS COMING FROM. I THINK I'VE LISTED EVERYTHING, BUT THEY'RE ALL ELECTRICAL PROBLEMS OBVIOUSLY. ALL OF THEM EXCEPT FOR VOLUME ISSUE HAPPEN RANDOMLY. THE VOLUME PROBLEM HAPPENS EVERY SINGLE TIME. ALL OF THIS HAPPENS WHETHER THE VAN IS IN MOTION OR STATIONARY.",
        "vin": "5FNRL5H99GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "11/27/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11055881,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT THE SECOND ROW SEATS TIPPED FORWARD WHILE BRAKING WITH NO WARNING. AS A RESULT, A CHILD PASSENGER SUSTAINED MINOR PAIN AND BRUISING, WHICH REQUIRED MEDICAL TREATMENT. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V725000 (SEATS), BUT THE CONTACT WAS NOT NOTIFIED. THE DEALER HAD NOT BEEN CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS WAITING TO DETERMINE WHEN THE REMEDY AND PART WOULD BE SUPPLIED TO THE DEALER. THE APPROXIMATE FAILURE MILEAGE WAS 5,700.",
        "vin": "5FNRL5H68GB"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054898,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"",
        "vin": "5FNRL5H68GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054721,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT IN THE SECOND ROW BEHIND THE DRIVER SIDE, TIPPED FORWARD AFTER A STOP.  MY 4 Y/O WAS IN HIS CAR SEAT AT THE TIME.  EXITED A GARAGE, TURNED RIGHT ONTO THE LOCAL STREET, STOPPED AT THE LIGHT ON THE CORNER.  MY SON, WHILE STILL IN HIS CAR SEAT, TILTED FORWARD ONTO THE BACK OF MY DRIVER SIDE SEAT. IT WAS A TRAUMATIC EXPERIENCE. THERE WASN'T ENOUGH PRESSURE AND THAT MUST BE WHY THE SEAT BELT DIDN'T LOCK. GLAD I WASN'T ON THE HIGHWAY.",
        "vin": "5FNRL5H43GB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2017",
        "dateOfIncident": "09/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051749,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE DRIVING BETWEEN 15-20 MPH AND ACCELERATING, THE TRANSMISSION SHIFTED FROM FIRST TO SECOND GEAR. THE VEHICLE ALSO LUNGED FORWARD. THE CONTACT STATED THAT THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO HONDA MALL OF GEORGIA (3699 BUFORD DR, BUFORD, GA 30519, (678) 805-8003) TO BE DIAGNOSED ON FOUR DIFFERENT OCCASIONS. DURING THE FIRST AND SECOND DIAGNOSTIC TESTS, THE MECHANIC WAS UNABLE TO REPRODUCE THE FAILURE OR RETRIEVE A FAULT CODE. DURING THE THIRD DIAGNOSTIC TEST, THE  CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, TWO DAYS LATER, THE FAILURE RECURRED. THE VEHICLE WAS THEN TAKEN BACK TO THE DEALER FOR A FOURTH TIME TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION FLUID WAS DRAINED AND THERE WAS EVIDENCE OF METAL SHAVINGS IN THE TORQUE CONVERTER AND TRANSMISSION FLUID. ADDITIONALLY, THE CONTACT WAS INFORMED THAT THE TCM MODULE ALSO NEEDED TO BE UPDATED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 34,000.",
        "vin": "5FNRL5H96GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033449,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I PURCHASED A NEW HONDA ODYSSEY 2016, ON JANUARY 18 OF 2017. IN SAN JOSE, CA. WHEN I FIRST RECEIVED MY NEW HONDA, I NOTICED THAT THE FLOOR CARPETING WAS NOT FINISHED AT THE EDGES AND STARTED UNRAVELING SOON AFTER. THEN AFTER SEVERAL WEEKS (FIRST WEEK OF FEBRUARY 2017) THE BACKUP CAMERA SCREEN BEGAN TO DEGRADE.  THE SCREEN HAS WHAT LOOKS LIKE BURNED SPOTS THAT RADIATE INTO DISCOLORATION OF MIXED COLORS OF BLUE, RED, GREEN, ORANGE, PURPLE AND COVERS HALF OF THE SCREEN.  IN MANY INSTANCES THE SCREEN IS UN-VIEWABLE, OTHER TIMES, THE DEFECT IS JUST A FEW SPOTS THAT WILL EXPAND TO HALF OF THE SCREEN.  NONETHELESS, IT IS A DEFECT IN THE DISPLAY.  SINCE MY HONDA HAS A BACKUP CAMERA FOR SAFETY, THIS IS A SAFETY ISSUE.  I HAVE LET HONDA LEADERSHIP KNOW MULTIPLE TIMES OF THE PROBLEM THROUGH MULTIPLE CHANNELS OF SUPPORT.  IF THE HONDA SCREEN GOES OUT WHILE I'M BACKING UP AND SOMEONE IS INJURED, HONDA WILL BE COMPLICIT AS THEY WERE NOTIFIED OF THE SAFETY DEFECT. BY THE SECOND WEEK OF MAY, THE MIDDLE DOOR HANDLE PAINT BEGAN FLAKING OFF WITHOUT ANY PHYSICAL DAMAGE, AND CONTINUES TO FLAKE AWAY MORE.  I HAVE SPOKEN WITH TWO HONDA CASE MANAGERS.  IT SEEMS THAT THEY BELIEVE THEIR JOB IS TO CONVINCE ME THAT HONDA PRODUCES SUB QUALITY CARS, WHICH I AM RELUCTANT TO BELIEVE DUE TO MY PREVIOUS EXPERIENCE WITH MY ACCORD, AND THAT THE DEFECTS REPRESENT NORMAL HONDA QUALITY.  WHAT I HAVE BEEN TOLD BY CASE MANAGERS IS THE FOLLOWING: THE CARPET NOT BEING FINISHED AND UNRAVELING IS A STANDARD FEATURE OF THE ODYSSEY. THE BACKUP CAMERA SCREEN DEFECT IS NORMAL FOR THE ODYSSEY.  I HAVE RECEIVED MULTIPLE EXCUSES AS TO WHY THE CAMERA IS DEFECTIVE AND HOW IT IS NORMAL FOR THE ODYSSEY TO HAVE THIS DEFECT OF NOT BEING ABLE TO SEE THE FULL SCREEN.  NONE OF THE EXCUSES THAT HAVE BEEN GIVEN ARE THE SAME.  EVERYONE TELLS ME A DIFFERENT EXCUSE OF WHY I CAN'T SEE THE SCREEN, AND WHY IT'S NORMAL.",
        "vin": "5FNRL5H68GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "08/30/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020519,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "YOU SEARCHED FOR: IF 2016 ODYSSEY'S ELECTRONIC DOOR LOCKS ARE DAMAGED (DUE TO FLOOD OR FIRE), HOW DOES ONE OPEN THE DOORS TO ESCAPE?     NO LUCK, YOUR SEARCH RETURNED NO RESULTS.(FROM HONDA'S SAFETY QUESTIONS, WEB SITE.)",
        "vin": "5FNRL5H63GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "08/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016148,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASE A 2016 HONDA ODYSSEY.  UPON ARRIVING HOME, I PULLED INTO MY DRIVEWAY EXTREMELY SLOW.  I WAS PUTTING THE BRAKE ON.  THE CAR WAS NOT IN MOTION. WHEN I MOVED THE CAR FROM DRIVE TO PARK THE CAR ACCELERATED ON ITS OWN.  IT HIT THE SIDE OF MY HOUSE DISLODGING FOURTEEN BRICKS. THE AIRBAG WAS DEPLOYED. I HAVE BLACK AND BLUES AND THE RESIDUE FROM THE AIRBAG BURNED MY FINGER. THE VEHICLE IS BEING EVALUATED BY THE HONDA DEALERSHIP I LEASED IT FROM.",
        "vin": "5FNRL5H39GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11015470,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING A RIGHT HAND TURN THE TRUCK IN FRONT OF MY STOPPED STUDDENLY, SO I DID TOO.  WHEN I STOPPED, THE CAPTAIN CHAIR ON THE SECOND ROW BEHIND THE DRIVER SEAT RELEASED THROWING MY 2 YEAR OLD INTO THE BACK OF THE DRIVER SEAT. BESIDES HITTING HIS NOSE PRETTY HARD THERE ARE NO OTHER INJURIES. WE ARE A BIT NERVOUS TO DRIVE OUR VAN AS THE CAPTAIN SEAT SHOULD STAY PUT. WHEN I CALLED THE DEALER, THEY CONFIRMED THAT MY VIN IS NOT PART OF THE CURRENT RECALL FOR THIS PROBLEM. I DID NOT GET ANY PICTURES OF THE ACTUAL SEAT TIPPED FORWARD AS MY TOP PIRORITY WAS TO GET MY SON INTO PROPER UPRIGHT POSITION, BUT I DID GET SOME PICTURES OF THE AFTERMATH.",
        "vin": "5FNRL5H94GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11005133,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 HONDA ODYSSEY ROLLED AWAY SPONTANEOUSLY WHILE SHIFTED TO PARK ON A LOW INCLINE DRIVEWAY AND SEVERELY TRAUMATIZED MY WIFE'S FOOT WITH THE FRONT DRIVER'S SIDE TIRE AS SHE STRUGGLED TO PUSH THE EMERGENCY BRAKE TO STOP THE CAR WHILE OUR DAUGHTER WAS IN HER CAR SEAT. A BYSTANDER CAME IN AND HAD TO SHIFT THE CAR TO DRIVE IN ORDER TO GET IT OFF OF MY WIFE'S FOOT. DURING THE ORDEAL, SHE SUSTAINED A HEAVY SPRAIN/STRAIN TO HER RIGHT ANKLE/FOOT, MULTIPLE SCRAPED, BRUISES, AND ROAD RASH ACROSS HER LEGS, ARMS AND BACK. IF ANYONE WOULD HAVE BEEN BEHIND THE CAR AT THE TIME OF ROLL AWAY, THEY COULD HAVE BEEN KILLED. ATTACHED ARE PICTURES OF HER ANKLE/FOOT AS WELL AS A POLICE REPORT WHICH SOLIDIFIES MY CLAIM.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995339,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A CITY STREET AND BRAKED HARD TO AVOID ANOTHER CAR AND THE SECOND ROW SEAT FLIPPED FORWARD. MY CHILD, WHO WAS IN HIS CARSEAT, HIT HIS HEAD ON THE FRONT ROW, PASSENGER SEAT.",
        "vin": "5FNRL5H64GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "05/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985080,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE PULLING INTO THE DRIVEWAY AND DEPRESSING THE BRAKE PEDAL, THE VEHICLE ACCELERATED WHEN THE GEAR WAS SHIFTED FROM DRIVE INTO PARK. THE VEHICLE CRASHED INTO THE GARAGE. THE CONTACT WAS NOT INJURED. THE CONTACT CALLED THE DEALER AND WAS INFORMED THAT SHE WOULD NEED TO PAY TO HAVE THE VEHICLE DIAGNOSED. THE CONTACT HAD THE VEHICLE TOWED TO AN INDEPENDENT MECHANIC, BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO CALL HER LOCAL DEALER. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/02/2017",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983115,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 HONDA ODYSSEY. THE CONTACT STATED THAT THE SEATS FAILED TO MOVE BACK AND FORTH. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS KEPT FOR TWO DAYS. THE DEALER STATED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V933000 (SEATS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE FAILURE. THE CONTACT CALLED THE MANUFACTURER, BUT THERE WAS NO RESPONSE. THE FAILURE MILEAGE WAS 9,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/23/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10979992,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY THREE YEAR OLD GRAND DAUGHTER WAS BUCKLED INTO CAR SEAT IN SECOND ROW PASSENGER SIDE. THE FRONT PASSENGER SEAT WAS MOVED ALL THE WAY FORWARD TO ALLOW EASY EXIT FOR HER AND HER BOOK BAG.  I STOPPED SUDDENLY FOR A YELLOW LIGHT. THE SEAT MY GRAND DAUGHTER WAS IN FLEW FORWARD AND LANDED HER FACE ON THE SEAT IN FRONT OF HER.  SHE WAS SCREAMING, I HAD TO LEAN OVER AND PUSH HER SEAT BACK INTO PLACE.  I WAS DRIVING BETWEEN 35-45 MPH.  AT FIRST IN MY MIND I THOUGHT IT WAS JUST THE CAR SEAT BUT KNEW IN WAS WELL STRAPPED DOWN, I WAS SHOCKED TO SEE THE WHOLE SEAT LEANING FORWARD.  SHE HAS A FEW BRUISES ON HER FACE.  I DROVE TO THE HONDA DEALER TO EXPLAIN IT TO THEM.  I WILL BE DROPPING THE CAR BACK OFF THERE TONIGHT WHEN MY HUSBAND CAN DRIVE US HOME.",
        "vin": "5FNRL5H95GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/18/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979164,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, DASHBOARD, RADIO, REAR AND SIDE CAMERA SHUT OFF AND THEN, A FEW SECONDS TO 30 MINUTES LATER, GO BACK ON. THIS HAPPENS CONSISTENTLY WHEN DRIVING. I'VE BROUGHT IT TO THE HONDA DEALERSHIP 3 TIMES TO DATE (CAR STAYED AT DEALERSHIP FOR A WEEK EACH TIME), AND THE PROBLEM PERSISTS.",
        "vin": "5FNRL5H36GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970293,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD AN ACCIDENT, FRONT DRIVER SIDE IMPACT, AIR BAGS INFLATED, PASSENGER SIDE NOT DAMAGED BUT ELECTRIC SIDE DOOR LOCKED AND DON'T OPENED, PASSENGER SIDE ALSO ELECTRIC AND DIDN'T WORK, MY KIDS JUMPED TO FRONT TO GO OUT, SEVERAL PEOPLE HELPED TRYING TO OPEN DOOR, FINALLY DOOR WAS OPENED BUT NOW IS NOT WORKING, I WAS ON RED LIGHT THEN LIGHT CHANGED TO GREEN, STARTED DRIVING, A MEDIUM SUV HIT CAR ON MY LEFT AND ALSO MINE, I WAS SCARE BECAUSE SMOG (FROM AIRBAGS) WAS INSIDE MINIVAN, NO WAY TO GO OUT ON MY SIDE, ONLY AVAILABLE OPTION WAS PASSENGER DOOR O SIDE SLIDING DOOR, BUT SLIDING DOOR WAS NOT RESPONDING,  A NIGHTMARE, THANKS GOD WE ARE OK.",
        "vin": "5FNRL5H60GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/23/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967997,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE DRIVING 45 MPH, THE VEHICLE WOULD RAPIDLY ACCELERATE WITHOUT WARNING. IN ADDITION, THE VEHICLE WOULD ABNORMALLY ACCELERATE WHEN THE BRAKE PEDAL WAS DEPRESSED. THE CONTACT HAD TO APPLY EXTREME FORCE TO THE BRAKE PEDAL IN ORDER TO STOP. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THERE WAS NO FAILURE WITH THE VEHICLE. THE FAILURE RECURRED SEVERAL OTHER TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 812.",
        "vin": "5FNRL5H67GB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING INTO MY DRIVEWAY I COULD NOT STOP I PRESSED THE BRAKES DOWN TO THE FLOOR BUT NOTHING STOPPED ONLY BY HITTING OUR AIR CONDITIONER AVOIDING OUR HOME.  THERE WAS STILL BRAKE FLUID BUT THINKING IT WAS THE CYLINDER, NO INDICATION OR LIGHT CAME ON THAT ANYTHING WAS WRONG.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2017",
        "dateOfIncident": "03/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959067,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC WINDOWS, SUN ROOF, BACK DOOR OPEN BY THEMSELVES, AND STAY OPEN; HAPPENED SEVERAL NIGHTS.  EXTREME DANGER EXISTS IF DRIVING. NIGHT PHOTOS OF WINDOWS, ETC. OPENING NOT AVAILABLE.  THIS HAS HAPPENED SEVERAL TIMES WHILE PARKED AT OUR HOUSE:  ONCE ON THE FLAT ROAD IN FRONT OF OUR HOUSE AND TWO TIMES ON OUR HOMES HILLSIDE PARKING (VAN FACING UPWARD SLIGHTLY).  IN PARK, THE WINDOWS AND DOORS OF ALL OF OUR CARS ARE ALWAYS CLOSED AS WE LIVE ON THE COAST AND THERE'S NO TELLING WHEN IT GOING TO RAIN.",
        "vin": "5FNRL5H99GB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "02/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954556,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE DRIVING 70 MPH, THE DRIVER AND PASSENGER SIDE WINDOWS MALFUNCTIONED. THE CONTACT STATED THAT THE WINDOWS CONTINUED TO ROLL UP AND DOWN ON THEIR OWN. THE DEALER LUBRICATED THE WINDOWS, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "5FNRL5H42GB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/10/2017",
        "dateOfIncident": "02/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953802,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW 2016 HONDA ODYSSEY WITH CONTINENTAL CONTIPROCONTACTS P235/65/R17 THAT CAME ON THE VEHICLE WHEN PURCHASED. I HAVE 14,537 MILE ON THEM WHEN PASSENGER REAR TIRE COMPLETELY BLEW OUT BOTH INNER AND OUTER SIDE WALLS GOING APPROX. 35MPH ON CITY STREET WITH 64 DEGREE OUTSIDE AIR TEMP. I HAVE NEVER SEEN A TIRE DO SUCH A THING. I WOULD NEVER USE THESE TIRES AGAIN. I FEEL THAT THESE TIRES JEOPARDIZE MY FAMILIES SAFETY. THE ISSUE IS NOT HONDA IT WITH CONTINENTAL AS THEY DID NOT STAND BEHIND THEIR PRODUCT STATING THAT I DIDN'T HAVE ROAD HAZARD INSURANCE WHICH IS A SCAM IN ITS SELF. TELL ME WHY I NEED TO PURCHASE ADDITIONAL INSURANCE BECAUSE THEY MANUFACTURE POOR QUALITY PRODUCTS. I HAVE NEVER HAD PROBLEMS IN MY 30 YEARS OF DRIVING WILL STAY WITH MICHELIN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2017",
        "dateOfIncident": "12/30/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949348,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW 2016 HONDA ODYSSEY VAN IN MD IN DECEMBER 2016.  150 MILES INTO OUR TRIP HOME TO NC, JUST AFTER WASHINGTON DC, WE HIT STOP AND GO TRAFFIC ON I-95.  THE TRANSMISSION STARTED MAKING CLUNKING SOUND AND SHUDDERING WHEN TRYING TO GO FROM 1ST TO 2ND (MULTIPLE TIMES).  YOU FELT VAN WAS GOING TO BREAK AND THAT YOU HAD NO ACCELERATION.  PULLED OFF TO SIDE OF ROAD AND TURNED OFF CAR ? NOTHING WAS NOTICEABLE.  WENT TO NEAREST DEALER THAT WAS 5 MILES AWAY. TOLD THIS CAN BE NORMAL, AS VAN COMPUTER NEEDS TO LEARN DRIVING HABITS.  LEFT DEALERSHIP, TRAFFIC WAS AGAIN STOP AND GO.  WITHIN 5 MILES HAD SAME NOISE AND SHUDDERING, BUT THIS TIME GOT CHECK ENGINE LIGHT AND FLASHING \"D\" ON DASH. REPEATED AGAIN FOR 3RD TIME ON RETURN TO SAME DEALER.  THEY EXAMINED CAR FOR 2 HOURS.  CHECK ENGINE CODE WAS: P0796 - A/T CLUTCH PRESSURE CONTROL SOLENOID VALVE C STUCK OFF.  HOWEVER SINCE CODE DID NOT RETURN AFTER RESETTING, THEY COULD NOT FIX IT UNDER WARRANTY.  WE CONSIDERED VAN UNSAFE TO DRIVE (REGARDLESS OF 4 HOUR TRIP REMAINING).  WITH NO CHOICE OTHER THAN DRIVING UNSAFE CAR, WE TRADED IT IN AND SUFFERED SIGNIFICANT DEPRECIATION FOR CAR WE OWNED APPROXIMATELY 5 HOURS & 157 MILES.  SEARCHES ONLINE AND IN THE NHTSA DATABASE REVEAL THIS IS NOT AN ISOLATED ISSUE FOR THIS MODEL, AND HONDA HIDES BEHIND ?NOT ABLE TO REPRODUCE? AFTER TURNING CAR OFF AND RESETTING THE CHECK ENGINE LIGHT.  *TR",
        "vin": "5FNRL5H49GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/30/2016",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10938818,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. WHILE DRIVING 35 MPH, THE MIDDLE ROW PASSENGER SEAT UNEXPECTEDLY SHIFTED FORWARD, WHICH CAUSED THE PASSENGER'S HEAD TO HIT THE FRONT PASSENGER SEAT. THE CONTACT NOTICED THAT THE FAILURE WAS SIMILAR TO NHTSA CAMPAIGN NUMBER: 16V933000 (SEATS); HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 18,000.",
        "vin": "5FNRL5H61GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "11/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926149,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN MOTION ABOUT 50 MILES AN HOUR. WINDOW ON THE SECOND ROW OF THE PASSENGER SIDE WAS COMPLETELY ROLLUP UP. ALL OF A SUDDEN, THE WINDOW EXPLODED AND SHATTERED. LUCKILY MY TODDLER WAS NOT HARMED. DAMAGES PAINT ON THE OUTSIDE.",
        "vin": "5FNRL5H6XGB"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/27/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919241,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEATBELT IN THE MIDDLE ROW DRIVER SIDE HAS RIPPED/SHREDDED THREE TIMES IN THE THREE MONTHS THAT I HAVE OWNED THE CAR I HAVE HAD A CAR SEAT INSTALLED IN THIS SEAT BUT THE RIP IS HIGH UP ON THE BELT AND NO WHERE NEAR THE CAR SEAT ITSELF. THE FIRST TIME IT HAPPENS THE VEHICLE WAS IN MOTION AND I HAD ONE OF MY CHILDREN STRAPPED IN AND THE BELT TORE IN HALF WHILE IT WAS BEING USED DRIVING ON A CITY STREET.  *TR",
        "vin": "5FNRL5H96GB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/16/2016",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907230,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HONDA ODYSSEY. AFTER SHIFTING INTO REVERSE, THE STEERING WHEEL SUDDENLY FAILED TO TURN IN EITHER DIRECTION. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 700.",
        "vin": "5FNRL5H24GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898722,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S HEAD RESTRAINT CAUSES SIGNIFICANT NECK AND BACK PAIN BECAUSE THE RESTRAINT PUSHES MY HEAD FORWARD SO THAT MY CHIN TILTS DOWN TOWARD MY CHEST. THIS ALSO MAKES IT DIFFICULT TO LOOK STRAIGHT AHEAD AT THE ROAD. I HAVE TRIED ALL VERTICAL POSITIONS OF THE HEAD RESTRAINT. I HAVE TRIED ADJUSTING THE LUMBAR SUPPORT. I HAVE TRIED ADDING A NECK SUPPORT PILLOW. NOTHING HAS WORKED. THE OWNER'S GUIDE SAYS, \"THE CENTER OF THE BACK OF THE OCCUPANT'S HEAD SHOULD REST AGAINST THE CENTER OF THE RESTRAINT. THE TOPS OF THE OCCUPANT'S EARS SHOULD BE LEVEL WITH THE CENTER HEIGHT OF THE RESTRAINT\" (PAGE 42). I AM UNABLE TO SIT WITH THE RESTRAINT IN THE RECOMMENDED POSITION (OR ANY POSITION) WITHOUT SIGNIFICANT NECK AND BACK PAIN AND WITHOUT DIFFICULTY LOOKING FORWARD. THE OWNER'S MANUAL GOES ON TO GIVE THE FOLLOWING WARNING: \"IMPROPERLY POSITIONING HEAD RESTRAINTS REDUCES THEIR EFFECTIVENESS AND INCREASES THE LIKELIHOOD OF SERIOUS INJURY IN A CRASH.\" THEREFORE, I DO NOT FEEL SAFE ADJUSTING THE RESTRAINT IN ANY OTHER UNRECOMMENDED POSITION. ADDITIONALLY, THE OWNER'S GUIDE GIVES INSTRUCTIONS FOR THE HEAD RESTRAINTS TO OPERATE AS DESIGNED: \"FOR A HEAD RESTRAINT SYSTEM TO WORK PROPERLY: ' DO NOT HANG ANY ITEMS ON THE HEAD RESTRAINTS, OR FROM THE RESTRAINT LEGS. ' DO NOT PLACE ANY OBJECT BETWEEN AN OCCUPANT AND THE SEAT-BACK. ' INSTALL EACH RESTRAINT IN ITS PROPER LOCATION\" (PAGE 43). THEREFORE, PLACING ANY PILLOWS BEHIND THE DRIVER'S BACK OR NECK IS CONSIDERED UNSAFE. THE OWNER'S GUIDE GIVES ANOTHER WARNING, \"SITTING IMPROPERLY OR OUT OF POSITION CAN RESULT IN SERIOUS INJURY OR DEATH IN A CRASH. ALWAYS SIT UPRIGHT, WELL BACK IN THE SEAT, WITH YOUR FEET ON THE FLOOR\" (PAGE 42). I AM UNABLE TO SIT \"WELL BACK IN THE SEAT\" BECAUSE THE RESTRAINT PUSHES MY HEAD, NECK AND SHOULDERS FORWARD.",
        "vin": "5FNRL5H9XGB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896762,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 HONDA ODYSSEY.  CONSUMER WRITES IN REGARDS TO PUSH-BUTTON START/KEY LACKS ADEQUATE VOLUME TO NOTIFY CONSUMER WHEN VEHICLE IS STILL RUNNING.  VEHICLE NEEDS AN AUTOMATIC SHUT-OFF AFTER A CERTAIN LENGTH OF TIME.  *SMD",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "08/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895017,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE STARTED HEARING A THUNKING NOISE WHILE IN MOTION COMING FROM THE LEFT FRONT WHEEL. WE TOOK IT TO THE DEALERSHIP WHERE IT WAS DISCOVERED THE FACTORY FORGOT OR NEGLECTED TO TIGHTEN THE LEFT FRONT AXLE NUT CAUSING THE AXEL TO COME LOOSE. IF THIS HAD HAPPENED AT HIGHWAY SPEEDS, THE DEALER TOLD US IT COULD EASILY HAVE CAUSED A VERY SERIOUS ACCIDENT. THIS IS A SERIOUS PROBLEM THAT MAY AFFECT OTHER VEHICLES.",
        "vin": "5FNRL5H33GB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/25/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888494,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE TIME OF THE ACCIDENT (06/22/2016), I HAD ONLY OWNED THIS 2016 HONDA ODYSSEY FOR A MONTH (DIDN'T EVEN HAVE PLATES ON IT YET). I DROPPED OFF A PASSENGER AT THE FRONT OF THE DINER AND DROVE SLOWLY EAST THROUGH THE PARKING LOT. THE LOT IS NARROW, CROWDED, AND BUSY, WHICH IS WHY I DID NOT HAVE MY FOOT ON THE ACCELERATOR AT ANY TIME. INSTEAD, MY FOOT WAS ON THE BRAKE REGULATING A VERY SLOW, CREEPING SPEED. I DECIDED TO PARK IN A STALL THAT FACED WEST WHICH MEANT I NEEDED TO MAKE A MODERATELY WIDE, HARD, RIGHT U-TURN. THERE ARE SHORT SECURITY POLES AT THE HEAD OF THESE STALLS TO PROTECT DINERS INSIDE. THE VEHICLE WAS ABOUT 150 INTO THE TURN, ABOUT FIVE FEET AWAY FROM THE POLE WHEN IT SUDDENLY SURGED AND ACCELERATED ON ITS OWN. I WAS CONFUSED BECAUSE I WAS VERY AWARE THAT MY FOOT WAS ON THE BRAKE PEDAL. I STEPPED DOWN ON IT, BUT IT WAS TOO LATE. THE VAN SURGED INTO THE REST OF THE TURN AND SLAMMED INTO THE PARKING POLE LEAVING A DEEP DENT IN THE FRONT BUMPER. BECAUSE I FELT UNSAFE DRIVING IT, IT WAS TOWED TO THE DEALERSHIP'S SERVICE CENTER. THE NEXT DAY, AFTER CHECKING THE CAR'S COMPUTER, HONDA FOUND NO FAULT CODES SO COULD OFFER NO REASSURANCES THAT THIS WOULD NOT HAPPEN AGAIN. I SUBMITTED THE REPAIR OF THE BUMPER TO MY INSURANCE COMPANY SO THAT THERE IS RECORD OF THIS EVENT.",
        "vin": "5FNRL5H61GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/24/2016",
        "dateOfIncident": "07/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888011,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADREST (OR MORE ACCURATELY, \"HEAD RESTRAINT\") OF THE DRIVER'S SEAT FORCES MY HEAD TO TILT FORWARD IN MY NORMAL SITTING POSITION.    I AM 6' 2\" AND LIKE TO PRACTICE GOOD POSTURE BY SITTING UPRIGHT AND STRAIGHT.  WHILE SITTING WITH MY BACK STRAIGHT, AND NOT RECLINING THE SEAT, MY NECK MUST BEND FORWARD ABOUT 15 DEGREES TO CONFORM TO THE HEADREST.    ANY BUMPS IN THE ROAD RESULT IN THE HEADREST TAPPING AND PUSHING THE BACK OF MY HEAD.  I FEEL LIKE A BOBBLE-HEAD! THIS CAUSES ME CONSTANT IRRITATION AND DISTRACTS ME FROM DRIVING.    TO COMPENSATE FOR THIS AWKWARD HEADREST DESIGN, I MUST RECLINE MY SEAT BACKWARD FURTHER THAN I FIND COMFORTABLE, OR SLOUCH, WHICH IS ALSO UNCOMFORTABLE.    I HAVE HEARD MANY TALL AND SHORT PEOPLE COMPLAIN OF THIS SAME ISSUE, FOR THIS VEHICLE AND MANY OTHER NEW MODELS OF VARIOUS BRANDS.  AN ADJUSTABLE ANGLE ON THE HEADREST WOULD BE EXCELLENT.    ALTERNATIVELY, OFFERING A CHOICE OF HEADRESTS WITH VARIOUS ANGLES WOULD BE ACCEPTABLE.  THE STANDARD HEADREST SEEMS TO BE ANGLED FORWARD APPROXIMATELY 25 DEGREES.  HOW ABOUT OFFERING ADDITIONAL HEADREST THAT HAVE LESS OF AN ANGLE, LIKE 20, 15, 10 AND 5 DEGREES?",
        "vin": "5FNRL5H37GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885688,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED INTENSE BACK PAIN AFTER DRIVING MY 2016 HONDA ODYSSEY FOR ABOUT 8 HOURS (STOPPING ABOUT EVERY 1 1/2 HOURS FOR A BREAK)   MY BACK COMPLETELY GAVE OUT AND FELL TO THE GROUND WHEN I TRIED TO STAND UP AFTER PICKING UP SOME TRASH FROM BEHIND THE FRONT SEAT.  I WAS IN INTENSE PAIN AND WAS INCAPACITATED FOR A WEEK.  I WENT TO A DOCTOR WHO X-RAYED MY BACK, BUT FOUND NO PROBLEMS WITH MY DISCS.  I DROVE MY ODYSSEY TODAY FOR TWO TRIPS OF 1 1/2 HOURS EACH AND I COULD  NOT FIND ANY SEAT POSITION WHERE MY BACK DID NOT HURT.",
        "vin": "5FNRL5H61GB"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884644,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THIRD ROW HEAD RESTRAINTS, WHEN THE SEATS ARE IN USE, NEED TO BE ALL THE WAY UP.  BECAUSE THEY ARE SO TALL AND WIDE, EACH RESTRAINT COVERS APPROXIMATELY 1/5 OF THE REAR WINDOW, CAUSING A LARGE BLIND SPOT.  THIS IS AN ACCIDENT WAITING TO HAPPEN.",
        "vin": "5FNRL5H62GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861715,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POTENTIAL ISSUE IS IN THE DESIGN/PROGRAMING OF THE CAR STEREO CAUSING AN UNEXPECTED SWITCH BETWEEN AUDIO SOURCES. THE VEHICLE HAS AN OPTION TO PLAY THE REAR AUDIO OR FRONT AUDIO SOURCE THROUGH THE CAR SPEAKERS.  WHEN THE VEHICLE IS PLAYING THE REAR AUDIO THROUGH THE SPEAKERS AND THE DRIVER SWITCHES THE I-MID DISPLAY TO THE 'DISPLAY INFO' MODE, THROUGH THE STEERING WHEEL CONTROL OR THROUGH THE AUDIO/PHONE/NAVIGATION BUTTONS, THE AUDIOS SOURCE IS AUTOMATICALLY CHANGED TO THE FRONT AUDIO SOURCE. THIS SUDDEN CHANGE HAS THE ABILITY TO DISTRACT THE DRIVER IN TWO WAYS.  THE UNREQUESTED CHANGE OF MODE CAN CAUSE THE DRIVER TO SCRAMBLE TO TURN OFF OR CHANGE THE AUDIO AND ALSO CREATE A SUDDEN INCREASE IN VOLUME.  THE SUDDEN INCREASE IN VOLUME DOESN'T COME DIRECTLY FROM THE VEHICLE BUT FROM THE VOLUME DIFFERENCES THAT EXIST THROUGH THE DIFFERENT INPUTS.  FOR EXAMPLE THE DVD AUDIO IS QUITTER THAN XM RADIO AND THE AUX INPUTS CAN HAVE VARYING LEVELS OF OUTPUT BASED ON THE DEVICE HOOKED UP TO THEM.  I EXPERIENCED THIS ISSUE WHILE I WAS DRIVING ON THE HIGHWAY WHILE MY KIDS WERE WATCHING A DISNEY MOVIE IN THE BACK AND IT AUTOMATICALLY SWITCHED TO XM RADIO WHEN I WANTED TO LOOK AT THE VEHICLE INFORMATION (MPG) TO DETERMINE IF I NEEDED TO STOP FOR GAS BEFORE ARRIVING AT MY DESTINATION.",
        "vin": "5FNRL5H36GB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2016",
        "dateOfIncident": "01/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824275,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING COMPLETELY WENT OUT IN LESS THAN 24 HOURS AFTER PURCHASING VEHICLE WITH 14 MILES ON IT.  VEHICLE LOST FLUID AGAIN AND STARTED MAKING ODD NOISES A LITTLE OVER 24 HOURS AFTER THE POWER STEERING PUMP AND FLUID REPLACED. HONDA TECHNICAL REPORTED DEFECT IS EXTENSIVE AND FLUID HAS BEEN SPRAYING ALL OVER THE ENGINE AND HAS COMPROMISED THE FIREWALL AND THE FLUID OVER THE INTERIOR OF THE VEHICLE.  VAN IS STILL IN THE SHOP WAITING FOR ISSUE TO BE FIXED (2/4/16).",
        "vin": "5FNRL5H6XGB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2016",
        "dateOfIncident": "01/31/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823361,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HI,    I BELIEVE THAT THERE ARE TWO DEFECTS FOR ODYSSEY 2016  1. LOW GAS WARNING INDICATOR IS TOO HARD TO GET NOTICED   2. NO AUDIBLE NOISE WHEN RUNNING LOW ON GAS.    IT IS VERY DANGEROUS THAT IF RUNNING OUT OF GAS ON THE ROAD. SUDDENLY LOSE OF POWER IS VERY DANGEROUS, VERY EASY TO GET THE CAR CRASH ON THE ROAD.   AND IT HAPPENED TO ME TODAY. THANKS GOD,  IT HAPPENED WHEN I'M ON A LOCAL ROAD NOT THE FREE WAY.  BUT I HOPE IT NEVER HAPPENED AGAIN TO ALL OTHER ODYSSEY OWNER IN THE FUTURE. THAT'S THE REASON I FILED THIS CASE.    FUEL LEVEL METER/LOW GAS INDICATOR IS ON THE RIGHT BOTTOM OF THE INSTRUMENT BOARD. BUT THE LIGHT IS MOSTLY BLOCKED BY THE WHEEL WITH THE WAY I SIT SO I HARDLY EVER TELL WHEN I'M RUNNING ON EMPTY. (SEE THE ATTACHED PICTURE).     AND THERE IS NO AUDIBLE NOISE WHEN YOUR RUNNING LOW ON GAS. THERE IS NO WAY THAT THE DRIVER CAN GET WARNING IS HE ALREADY ON THE WAY TO DANGER.    I KNOW THE DRIVER SHOULD CHECK THE GAS BEFORE MOVING THE VEHICLE. BUT ALL THE CAR I DROVE BEFORE HAVE SOUND ALARM/BEEP TO REMIND ME EVERY TIME WHEN I MOVE THE CAR, AND ALSO THE LOW FUEL WARNING LIGHT IS IN THE CENTER OF THE BOARD. IT VERY EASY TO GET THE NOTICE OF THE SITUATION OF LOW GAS. BUT ODYSSEY 2016 PLACED THE GAS INDICATE IN THE PLACE THAT HARDLY TO SEE.   EVEN VEHICLES IN THE 80S HAD THAT FEATURE. DON'T KNOW WHY EVEN VEHICLES IN 2016 LOSE  THIS VERY IMPORTANT SAFETY RELATED FEATURE.",
        "vin": "5FNRL5H61GB"
    }
]