[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300906,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICHLE IN MAY 2019, SINCE MY PURCHASE, I HAVE TWO MAJOR TIRE BLOW OUTS ON MAJOR HIGHWAYS WHICH COULD HAD CAUSED ME AND MY FAMILY MY LIFE. THIS OCCURRED TWICE ON DIFFERENT OCCASIONS. EACH TIME, MY TIRES SPLIT AND MY RIM COMPLETED RUPTURED CASES GREAT DAMAGE TO MY CARE. THE COLLISION COMPANY WHO FIXED MY VEHICLE BOTH TIMES ASKED ME WHAT I HIT THINKING I WAS IN AN ACCIDENT. I WAS ADVISED THAT MY RIMS SHOULD NOT HAVE CAUSED THE GREAT DAMAGE THAT IT DID. I AM NOT SURE IF THIS ISSUE WAS EVER REPORTED, BUT I AM SCARED TO DRIVE MY CAR. PLEASE LET ME KNOW IF THERE IS ANYTHING THAT YOU CAN DO TO HELP ME. THANK YOU",
        "vin": "SAJBD4BV9GC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/26/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010854,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 JAGUAR XF. WHILE DRIVING APPROXIMATELY 3 MPH AND TURNING THE VEHICLE TO THE LEFT, IT DRASTICALLY VEERED TO THE LEFT AND ACCELERATED AT THE SAME TIME. THE VEHICLE'S CENTER FRONT END CRASHED INTO A BRICK COLUMN, WHICH CAUSED THE VEHICLE TO STOP. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED. THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO THE AUTO NATION COLLISION OF JAGUAR BODY SHOP WHERE THE VEHICLE'S FRONT END WAS REPAIRED. THE CONTACT CALLED THE AUTO NATION JAGUAR DEALER, BUT THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED CASE NUMBER: PA17437216. THE MANUFACTURER STATED THAT THE CONTACT DID NOT QUALIFY FOR A BUY BACK. THE APPROXIMATE FAILURE MILEAGE WAS 10,500.",
        "vin": "SAJBD4BV0GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/02/2017",
        "dateOfIncident": "12/30/2016",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939086,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED ACCELERATING WHILE STOPPED AT A TRAFFIC LIGHT. THE BRAKES HAD TO BE APPLIED HARDER AND HARDER TO KEEP IT FROM GOING INTO THE INTERSECTION, THE BRAKES WERE APPLIED SO HARD THAT THE BACK WHEELS WERE SPINNING. A WARNING WAS FLASHED ON THE DASH BUT WENT OFF IMMEDIATELY ALL THAT WAS SEEN WAS AN \"A\", AT THAT POINT THE AUTO STOP/START BUTTON WAS DISENGAGED AND THE ACCELERATION STOPPED. THE VEHICLE WAS ON A CITY STREET IN DOWNTOWN ORLANDO.",
        "vin": "SAJBD4BVXGC"
    }
]