[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2022",
        "dateOfIncident": "02/18/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459440,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "While going highway speed (75mph) I suddenly had a simultaneous check engine light, oil pressure light, and charge system light all come on. Then the engine stalled, I heard a loud bang, and then once I pulled over immediately, there was oil leaking out of the car.   I was 40+ miles from home, and the nearest Hyundai dealer, and had to get towed back to the dealership. They suspected a known issue with the engine rods and once they inspected it a few days later they confirmed there was a hole in the block. It is a known issue that Hyundai has given a warranty extension on and they replaced the engine and intake manifold, per the service invoice.   I believe a known potential engine failure such as this should be cause for a recall. I was going 75mph when this happened. I could have lost control of the vehicle and crashed. I also could have had my small child with me and been trying to deal with getting help on the side of a highway with a toddler who doesn’t understand to stay away from the roadway. I am thankful all was well but engine stalls when the manufacturer knows there is a defect is putting peoples’ lives at risk.",
        "vin": "5xyzt3lb0gg"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "04/01/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459233,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 HYUNDAI SANTA FE . CONSUMER WRITES IN REGARDS TO MALFUNCTIONING THROTTLE.  THE CONSUMER STATED THE VEHICLE'S ACCELERATOR PEDAL WAS DEPRESSED BUT, THE VEHICLE WOULD NOT ACCELERATE. THE VEHICLE BEGAN KNOCKING AND STALLED. ATTEMPTS WERE MADE TO REPAIR THE VEHICLE BUT, THE FAILURE RECURRED. ON SEPERATE OCCASIONS THE CHECK ENGINE LIGHT WAS ILLUMINATED. THE CONSUMER REQUESTED AN INVESTIGATION INTO THE VEHICLE'S FAILURES.",
        "vin": "99999999999"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457005,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Hyundai Santa Fe. The contact stated that there was a delay response in the Back Over Prevention camera at lower temperatures during winter the months. The contact stated that the camera would operate as designed in warmer temperatures or once the vehicle was fully warmed up. The vehicle was taken to several independent mechanics who informed the contact that they could not replicate the failure. The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed or repaired. The failure mileage was approximately 60,000.",
        "vin": "KM8SR4HF3GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "12/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453959,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving car would slow speed unexpectedly. In addition to this issue the heat in the car stopped working. After having several system flushes and parts replaced by our mechanic we took it to the dealership for evaluation and was advised the car has complete engine failure. No check engine light ever came on!! Was advised by dealership that several complaints have been made about this particular engine but no recalls have been made. The transmission for this car was already replaced less than a month after purchasing at 66,000+ miles due to a defect, and it has been continuous issues since then. Car has been regularly maintained and despite these preventative maintenance steps the engine still failed. Hyundai I am sure is aware of these engine issues and should address them immediately. Consumer would like to add that after speaking with the salvage yard about a replacement engine the gentleman advised that he received 1000+ inquires for a engine for this make and model year.",
        "vin": "KM8SM4HF5GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453356,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle died while driving.  No warning lights on at all.  Dealer states that I have engine damage just by listening to it.  Same issue is under recall for the santa fe sport engines but I am told that this will not be covered.  This could have been an accident if I had been driving on a highway or a high traffic area.",
        "vin": "Km8smdhf4gu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452495,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Hyundai Santa Fe. The contact stated that while driving at 60 MPH, an abnormal knocking noise had emitted from the engine. As the contact began to pull over, the vehicle stalled without warning. The contact was able to pull over and upon inspection of the vehicle saw that large pieces of the engine had scattered over the highway. Due to the failure, the contact had the vehicle towed to the dealer where a diagnostic was performed; it was later determined that the engine rod had punctured the engine block causing the engine failure. The manufacturer had yet to be notified of the failure. The contact was given an estimate for the repair. The vehicle had yet to be repaired. The failure mileage was approximately 120,000.",
        "vin": "km8sr4hf3gu"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2022",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451662,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on I-64 (eastbound), east of Richmond, VA heading home to Virginia Beach, VA.  I noticed a knocking sound, intermittent at first, but becoming more prevalent and much louder.  By the time I got home, the engine knocking was horrible.  I looked under the car, and saw some oil around the oil pan, but there was still sufficient oil in the engine (halfway between the MIN/MAX marks on the dipstick.  At no time, before during, or since was there any warning lamps lit on the dash, nor were there any codes that could be pulled indicating an issue.  We had the car towed to Hall Hyundai in Chesapeake, VA (that's where we bought it), and they said the engine was full of metal and needed to be replaced.  They did not say exactly what failed in the engine, but my suspicion is one of the pistons had a catastrophic failure.  That was on 11 DEC.  The engine has since been replaced with a remanufactured engine, but we still do not have our car back.  After the initial repair, we noticed a puddle of oil on our garage floor.  The car is back at the dealership and they've found 3 separate leaks so far.  In reading of similar engine failures with our year range of Hyundai Santa Fe, we were fortunate.  Our failure could have led to an immediate engine failure, engine fire, or worse that could have caused a serious accident since I was travelling on the highway.  My concern is that Hyundai to date has dismissed this as nothing more than a fluke, and since we're beyond the terms of the warranty, not their problem.  That couldn't be further from the truth.  This is a BIG problem since the component that failed in our 3.3L V6 is the same component that forced a recall of their 2.4L 4-cyclinder that is common in their Santa Fe Sport model.  I guarantee you that they use the same process, materials, etc. in the pistons for both, and this warrants a recall for our model/engine type just like the 2.4L recall.",
        "vin": "KM8SMDHF9GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "02/08/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450993,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Car is consuming oil, not leaking. Mechanic stated that some Hyundai models with similar engines are having their engines recalled. It is sometimes 2 quarts low between a 4000 mile check and the 5000 mile oil change. no light indicates that it's low.",
        "vin": "KM8SMDHF5GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451027,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 Santa Fe - While driving on interstate all warning lights came on - antilock brake, check engine, electronic power steering, vehicle grade, outside temp blinking blank. Took to reliable shop and they said it was right front speed sensor, had that replaced still all warning lights on. Engine code that caused the lights was P2159 (Vehicle Speed Sensor B range performance) I took the car to Jim Click dealership in Green Valley they had the car for 7 days said they finally figured out that it had wires that were shorted that fed back to modules and they would have to do an overlay of these wires, so they would run new wires in the area that was bad, we got the car back after repairs and it is all working now, the car only has 86 k miles and has never been in an accident all wiring in the vehicle look still brand new. I read online of this same year of car has problems due to engine fires and suggest to park car away from anything in case it does catch fire, the article also talks about it starts with the antilock brake control module that can cause an electrical short. I am wandering if this is going to happen again because they repaired shorted wiring but did nothing to replace any bad control modules that may be causing fires in these vehicles. These repairs cost me over 700 dollars in which I think should be under warranty, But the real scary thing is I don't want to be driving down the road and have this car go up in flames. The article on the internet I read was written by Tom Krisher AP Auto Writer he also states that Kia is also also included with this problem.",
        "vin": "5XYZU3LB2GG"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451036,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The clockspring of hyundai steering wheels does not work and goes bad. This is a known problem within hyundais. A bad clock spring leaves without cruise control, a functioning horn, or most importantly, a functioning airbag. You would be unable to alert an inattentive driver and the airbag may not deploy in the event of a collision  Problem is confirmed by dealership. No warning lamps or messages occur from the issue. You only know when your buttons or horns don't work.",
        "vin": "5xyzt3lb3gg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445754,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "On September 15, 2021 while driving the Santa Fe engine just stopped in the middle of an intersection , was able to coast to the side of the road. Vehicle has fuel, showed no issues prior. Tow truck driver attempted to jumpstart the vehicle with no avail, was towed to the local Hyundai dealer ship who had it for one week to finally tell me that the motor was blown and needs a new long motor for $15,399.00 USD. Had a second automotive shop check out the vehicle and was told the same diagnosis, motor was blown needs to be replaced, and that Hyundai no longer is manufacturing the long engine the this Santa Fe takes. I was also informed that this wasn't the first Satna Fe that they have diagnosed with this problem, both the Sport model and the same model I currently have. Neither the Hyundai dealership or the dealership where I purchased this vehicle one year ago, will help me. I am aware that Hyundai has recalled the Sport model for engine problems, but the model I own.",
        "vin": "KM8SM4HF2GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "11/26/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445203,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was stolen.Car was send to body shop for repairs.Car was started at body shop after battery was replaced.Car was driven out of shop after repairs.After going less than 1000feet car shut down.Tried to start Hyundia and smoke poured out from up hood.It looked as if car was going to burst into flames.I did not raise hood and smoke died down.Wrecker returned car to body shop.They checked car and engine was completely locked up.Geico sented car to Thornton Road Hyundai Lithia Springs,Georgia for engine replacement.",
        "vin": "5xyzwdla3GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445234,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "We purchased the vehicle in December 2017 with 30,753 miles and the engine seized in July 2021 with 79,896 miles. When we purchased the vehicle, we were told that Hyundai's warrantee would only be 50% of the original owner warrantee which means it would expire at 60,000 miles. We submitted a claim with Hyundai in July 2021 (Case#: 18480584) but Hyundai refused to stand behind the vehicle and we decided not to spend the estimated $12,000 to repair the engine. We sold the vehicle to a junk yard for $1,500 in August 2021. My personal opinion is that Hyundai should stand behind every vehicle they manufacture throughout the life of the vehicle. The full warrantee should transfer from owner to owner and not be shortened.",
        "vin": "KM8SMDHF5GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441570,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "This vehicle is burning close to 2qts of oil within 1000 miles. There is no warning that the engine is low on oil which could cause the engine to seize at any time. Hyundai has us go through the oil consumption test and acknowledged it was a problem but denied the claim because the car was on the second owner. The third-party warranty company refused to help unless it was a total engine failure.",
        "vin": "5XYZT3LB6GG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440671,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving and all of a sudden heard a rough rattling sound coming from the engine. Hyundai didn’t have time for me, so I had it towed to a local mechanic. Diagnostic: timing chain done but also knocking of the engine. Oil consumption causing this and new engine required. Had it towed to Hyundai a couple weeks later. Same diagnoses- new engine required for engine knocking and failure of internal timing components. Hyundai confirmed the engine oil consumption is bad.",
        "vin": "KM8SM4HFXGU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438306,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine failed while driving in traffic almost causing an accident. Had it towed to dealership. I was informed there was a recall for engine failure but dealership is telling me that manufacturer has denied the recall saying it has already been taken care of which is false. I also found out that when I bought the vehicle from a licensed dealer in 2018, that ownership was never transferred. The dealership is also telling me that the vehicle is still listed in another company name which is why I never received any recall information. Now I am stuck with a financed vehicle with several recalls that the dealership and manufacturer are refusing to honor.",
        "vin": "5xyzt3lb3gg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438071,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Check engine light went on in 4/2021. Brought to local mechanic and states that it is an evaporator issue. Claims I didn't close gas cap tight enough. He reset code, closes gas cap and no check engine light. I bring it back after filling up my tank again tells me that it is because I don't close it tight enough. I oil change in 4/2021 and ask to check the code again. He claims may be a small leak and that I can drive it. I bring it back in late June early July for another oil change and light is on again. He claims small leak and it is fine to drive. I pick it up and he has car for a week to do oil change in Sept and to double check the check engine light and he says he fixed it with a new sensor for the evaporator. Light goes back on two days later. Take it to another mechanic who replaces his work and claims not good electric work. Another day of driving and check engine light is on. Bring it back to mechanic states no oil and that he puts 4.5 cans of oil into car and that the engine needs to be replaced. I am meticulous with cars. I ALWAYS get my oil changed every 3-5K miles. There is no way that I drove this car too hard or didn't have an oil leak. I park in the same spot at home and work every day - no leaks. It did not blow oil either. Please advise.",
        "vin": "5XYZUDLB1GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "10/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437689,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "vehicle went in for state inspection repairs 10/20/21 w/dtc code p0453 included.vehicle was returned 10/21/21 after inspection and engine seized down the road from dealership.no loaner car recieved had to take shuttle. seized at 86000 miles. car prior was burning up engine oil abnormally & would hesitate when trying to take off from a stop or regular driving. small knocking noise heard  as well at times .regularly maintenced and had ecm #953 update 05/22/2019 waiting to hear back from irwin hyundai in nh",
        "vin": "5XYZUDLB5GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437479,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My son was on the expressway and vehicle started to slow down and would not accelerate. The check engine light came on. He pulled over and the engine died and would not restart. I had the car towed to a vehicle repair place and they found that the engine had thrown a rod and needs to be replaced. Vehicle has been well maintained and was in good shape. It was just purchased used from a dealer 05/03/21.",
        "vin": "5XYZTDLB4GG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434053,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I own a 2016 Hyundai Santa Fe,. Back in May of 2021, my children and I were driving home from the beach. The engine in the car began making a strange knocking sound halfway through the trip, but the engine light did not illuminate. We thankfully made it home safely. I had my local mechanic take a look at the car and he said that the knocking sound is considered the death knell of any engine. I was shocked. How could a well-maintained 5 year old car's engine need to be replaced? I called Hyundai and they advised me to bring the car to a dealership for a service manager to diagnose and call them after three days to submit a claim. For our own safety I had the car towed to the local dealership, they serviced and diagnosed as a knocking sound coming from the bearings.  The engine failed during examination. I have been submitting, resubmitting, and escalating claims since.  The claims manager in corporate rejected my claim because the test they perform to diagnose the engine as defective requires that the engine be running. This is obviously a circular argument created to reject claims. I have since read court documents for the class actions suits describing the issues that Hyundai so far refuses to acknowledge and address (other than through updates and recalls that don't resolve the root of the problem) regarding their manufacturing and design defects that lead to premature engine wear and damage. The manufacturing process leaves metal debris (also known as swarf) in the engines and/or poorly machined engine components resulting in metal on metal contact in the rotating assembly of the engine leading to catastrophic engine failure. Hyundai is with full knowledge of the issues (all of these problems have been reported to the NHTSA for many years now) marketing, selling and distributing under false and fraudulent pretenses their cars to the general public. This is unjust, unsafe, unlawful and fraudulent.  This is not right and can no longer go on. Something must be done.",
        "vin": "KM8SRDHF6GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433642,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The problem with my purchased Hyundai is that it's not giving a warning message for the oil or over heating. The engine continues to gather a lot of gunk. Also, there is a recall on these specific models and I was notified by a class action law suit.  HyundaiThetaEngineSettlement.com. The car has a chance of exploding. I did not agree with the terms of the class action suit. It was only offering compensation if I was already injured, or having to commit conspiracy with a crime of lemon law and consumer rights, and possible murder. These SUV's were built in 2016 and had enough time to be taken off the market. I purchased my vehicle last year 2020.",
        "vin": "5XYZT3LBXGG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430945,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Recently I Viewed a low oil light on the dash board, turned motor off waited 30 min checked oil the level it was correct, called the local   Hyundai dealer (Miami lakes Hyundai) they told me since I was the 2nd owner my vehicle has 60 months factory warranty and my car has 70 months since purchased, I asked if there was an engine recall they said no for that model year, SORRY. I took my vehicle to an independent auto shop they concluded that at 180 degrees Fahrenheit engine running temperature I had between 8 to 9 Lbs. of oil pressure at idle and that it should be a least 25 Lbs.  The Auto shop informed me that the cause was excessive bearing wear that was causing my low oil pressure light. I found that to be very implausible because of the low mileage 42000 miles with oil services done every (3000) miles not 4000 or 5000 miles as recommended by the factory specs, The shop also told me that 2.4 Ltr. had that defect so did a little searching and found Hyundai 2.4 ltr. Theta engine with a massive recall except my model year. hoping someone in NHTSA can point me in the right direction.",
        "vin": "5xyzt3lb2gg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427914,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON START UP ENGINE IS VERY LOUD, CONTINUES TO BE LOUD AND DEALER SAYS IT IS JUST ENGINE NORMAL ENGINE NOISE",
        "vin": "KM8SNDHFXGU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427330,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear driver-side passenger door will not open from inside or outside of vehicle. Automatic locks on door clicks from lock/unlock but it will not open.  I have two small children in car seats in the back and is a major safety risk since the door will not open.  The vehicle was not inspected by anyone since I just discovered this issue trying to get my daughter out of the car.  There were no issues, warnings, or messages prior to failure. Issue became aware to me when trying to get my daughter out of the vehicle on Sunday 8/1/21.   I googled my issue and discovered others (Hyundai owners) with same issue.",
        "vin": "5XYZUDLB2GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427315,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "3 systems have failed within my two years of ownership.  The biggest fault ....and this is what you guys need to know!!!!!!! ATTENTION NEEDED.  DECEMBER 2020, I was put in total danger and others ️. After months of telling the dealer that the engine was idling really rough - like a shaking - and revving weirdly at times of acceleration. They continued to tell me there was nothing wrong with it and made me seem like I was the crazy one. Fast-forwarding to December 2020, I started to now hear this metal clacking noise from the engine. Made a 3rd appointment at the dealer that was a week out - but never MADE IT. Because few days before it, I was going out to a friend's and clacking started to get even louder - as LOUD could hear in the cabin. THEN as about to get onto highway on-ramp WITH NO WARNING- no check engine light - no notice whatsoever - engine rpm spiked loudly and a very loud pop followed - and engine totally ceased. Lost total engine propulsion - vehicle rolled to a stop and then all lights and sounds started going off with check engine light NOW FLASHING. HAD TO have HYUNDAI towed to the dealer - in which \"there was an engine rod bearing failure - which caused the engine to cease. Dealer took days to even get it seen and wouldn't give a loaner till deemed a fault under \"warranty\" which clearly was with there 10 yr - 100,000 mile warranty - which makes sense because there poorly made/crafted engine designs that involve the GDI ENGINES_ which have been known to fail prematurely - CAUSE FIRES _ and has even killed people. They aren't fixing the engine design they simply are putting the same KIND IN>>> and putting a system that detects engine knocking. THAT DOESNT FIX THE PROBLEM - and they KNOW THAT. There was no recall on my car or got anything in mail regarding engine dangers.  Further Hyundai would not give me any paperwork regarding the repair besides an engine assembly - a replacement that all. I readily asked for more info and they wouldn't give it.",
        "vin": "5XYZTDLB6GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2021",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423049,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Hyundai Santa Fe. The contact stated while driving 45 mph, the vehicle began to stall and then ceased. The contact stated no warning light was illuminated. The contact stated she was able to restart the vehicle but continued to experience the failure. The contact stated she was able to drive at a slow speed to her residence but started to smell fumes. The contact stated the check engine warning light was illuminated. The contact towed the vehicle to an independent mechanic and who was unable to service the vehicle due to a fuel leak. The contact called and notified the local dealer of the failure. The vehicle was not diagnosed nor repaired. The manufacturer had not been informed of the failure. The failure mileage was 75,622.",
        "vin": "KM8SR4HF3GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422389,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My engine stalled on the highway with no warning lights or symptoms. I've owned it for 6mo. It had regular recorded maintenance and showed no issue. Then as I was driving home from work, the car seized up and jerked to a full stop at previously 65mph. Inspection by dealership revealed that my engine blew at 70,800 miles. With no warning. No symptoms. Hyundai will not pay for repairs, $9000 on top of the $14000 I still owe. This car put me in an unexpected dangerous situation!! Every other year of this make and model has been recalled. Please recall the 2016, it is not safe!",
        "vin": "KM8SM4HF9GU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2021",
        "dateOfIncident": "06/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421946,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Drive The car on the Highway and seemed like I was losing power and a few minutes later I heard a knocking on the engine",
        "vin": "5xyzudlb2gg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419718,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "vehicle stalled and locked up was not able to push breaks or turn steering dealer advised me engine was stalled and needed to be replaced, was known in my model, this was why this vehicle and year had an extended warranty unto 200K miles. The engine was replaced and the vehicle is still not running correctly. When accelerating to turn on on highway, it seems stalled and doesn't move, returning to dealer tomorrow after being w/o a vehicle 3 weeks. It is not coming up on your recall notices and am concerned this is a safety issue.",
        "vin": "5xyzw4la6gg"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419316,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The car was sitting in the driveway waiting to be started up. When the car was started, there was a knocking sound from the engine.  I turned the car off and checked the oil.  The oil was down about 2 quarts, so I decided to change the oil since we were goin on a trip. I changed the oil and the knocking sound did not go away so we took it to a dealer.  We change the oil every 5-7 thousand miles and reset the service button.  The car is at the dealer and I have not heard a word from them.",
        "vin": "KM8SM4HF9GU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/19/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418573,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The ABS, traction control, and another light are illuminated. Upon investigating online this is a known issue with these cars. No recall has been issued. My car is available for inspection.",
        "vin": "KM8SR4HF4GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418196,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving home from work, Car jerked me forward and stopped at 60mph. Engine promptly shut off. Turned key over and put car into neutral to get it off of the highway.  Herrnstein Hyundai of Chillicothe told me that my Nu Engine had blown and i need a total replacement. No warnings or dash lights came on. Hyundai states they wont help despite the recall to be posted on June 25th.",
        "vin": "KM8SM4HF9GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414405,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT MY ENGINE REPAIRED, BUT THE TEST DRIVE SHOWED A SENSOR FOR THE OIL VALVE? THING.  HYUNDAI WAS SUPPOSED TO OVERNIGHT IT AS OF FRIDAY 4/23.  MY CAR IS STILL NOT DONE.  I AM NOT COMPLAINNG ABOUT THE DEALERSHIP, BUT THE PART AND HOW THEY TAKE SO LONG.  MY CAR HAS BEEN IN THE SHOP SINCE 3/20/2021.  I HAVE HAD NO CAR SINCE THEN.  I AM IN SALES AND A SINGLE MOM.  I HAVE BEEN USING MY BOYFRIEND'S TRUCK, BUT I CANT DO THAT FOREVER.  CAN YOU PLEASE LOOK INTO WHY HYUNDAI ISNT QUICK WITH DELIVERING PARTS?  IM BEYOND FRUSTRATED.  HYUNDAI MOTOR COMPANY WILL NEVER BE A COMPANY I PURCHASE FROM EVER AGAIN.  THANK YOU FOR YOUR HELP. [XXX] [XXX]  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "KM8SRDHF3GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412882,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS 2016 HYUNDAI SANTA FE SPORT WITH 133,000 MILES.  I HAVE DOCUMENTED PROOF OF REGULAR MAINTENANCE.  VEHICLE WAS GETTING 32-33 MPG.  ENGINE SUDDENLY STARTED KNOCKING AND DIED WITHIN A FEW MILES.  REPAIR SHOP SAID HYUNDAI EXTENDED WARRANTY FROM 100,000 TO 120,000 FOR THIS ISSUE.   MY CAR HAS 133,000 AND IS NOT INCLUDED IN THE 2011 TO 2014 RECALLS.  ENGINE WAS REPLACED WITH REBUILT HYANDAI ENGINE.  IMMEDIATELY ISSUES STARTING OCCURRING SUCH AS UNEXPECTED ACCELERATION, AND NOW IT WON'T ACCELERATE TO 55 MPH.  THERE IS NO POWER AND THE NEW ENGINE IS KNOCKING.  AT NEARLY $8,000 OUT OF MY POCKET I AM AGAIN WITHOUT A VEHICLE FOR WEEKS ON END.  I AM AN ESSENTIAL WORKER WITH A NEWBORN CHILD AND I CANNOT RISK A BREAK DOWN WHILE ENROUTE THE 37 MILES ONE WAY TO WORK OR AT ANY OTHER LOCATION.  ANOTHER ACQUAINTANCE HAS A 2016 SONATA AND HER ENGINE IS ALSO MAKING A KNOCKING SOUND.  PLEASE INCLUDE THE NEWER MODELS ON THE ENGINE RECALL AS THEY ARE DOING THE SAME.  PLEASE ADVISE WHAT RECOURSE I HAVE FOR A RELIABLE VEHICLE.  I SHOULD HAVE BEEN ABLE TO GET ANOTHER 150,000 MILES AT LEAST OUT OF MY SANTA FE AND IT COULD DIE A NORMAL DEATH AS OPPOSED TO A QUICK DEATH DUE TO ENGINE FAILURE.     THE VEHICLE WAS OPERATING ON THE HIGHWAY WHEN THE ENGINE FAILURE AND OTHER ENGINE ISSUES HAVE OCCURRED.",
        "vin": "5XYZTDLB2GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2021",
        "dateOfIncident": "04/10/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407847,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR 45 MILES AN HOUR ON SATURDAY APRIL 10TH, AROUND 5:40PM IN THE CURB LANE.  THE CAR COMPLETELY DIED UNEXPECTEDLY. I MANAGED TO COAST TO A SMALL PARKING LOT OFF OF A BUSY STREET. I HAD THE CAR TOWED AND ASSESSED BY INDEPENDENT MECHANIC ON THE FOLLOWING MONDAY.  THEY DETERMINED THAT THE ENGINE HAD BEEN COMPLETELY SEIZED, BUT THEY PERFORMED NO REPAIR.  THE NEXT SCHEDULED CAR SERVICE WAS 86600 MILES, AND AT THE TIME OF THE INCIDENT, THE CAR HAD ~84K MILES NOT LONG AFTER ITS SERVICE AT ~83K MILES.  PLEASE NOTE THAT DURING THE LAST 12 MONTHS OF PANDEMIC, THE CAR GETS TAKEN OUT TO THE GROCERY STORE, A MILE A WAY, ONCE A WEEK OR TO A LOCAL BUSINESS NO MORE THE 8 MILES FROM THE HOUSE VERY OCCASIONALLY.  SO THIS VEHICLE DOES NOT SEE HEAVY USAGE.  HYUNDAI USA INDICATED THAT I SHOULD HAVE THIS CAR TOWED TO ONE OF THE DEALERSHIPS FOR ASSESSMENT, BUT HAVE ALSO DETERMINED THAT THIS VEHICLE IS COVERED BY AN EXTENDED WARRANTY OF 10 YEARS/120,000 MILES FROM ORIGINAL FIRST USE.  THE CASE NUMBER WITH HYUNDAI USA IS 18154048.",
        "vin": "5XYZU3LB4GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406265,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST OCCURANCE THE CHECK ENGINE LIGHT STARTED FLASHING, ENGINE WENT INTO \"SAFE MODE\" AND ACCELERATION DECREASED DRAMATICALLY. DEALERSHIP PUSHED A \"UPDATE\" TO THE COMPUTER AND \"FIXED\" IT. ISSUE HAS HAPPENED AGAIN AND NOW DEALERSHIP IS SAYING THAT THE ENGINE KNOCK SENSOR IS MESSED UP.",
        "vin": "5XYZTDLB5GG"
    },
    {
        "components": "ENGINE,LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404814,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE, I NOTICED A TAPPING NOISE THAT SOUNDED LIKE A FLAP HITTING THE CAR.  I NEEDED GAS, SO GOT OFF AT THE NEXT EXIT.  WHILE EXITING THE INTERSTATE, THE NOISE GOT LOUDER AND THE CAR DIDN'T WANT TO ACCELERATE.  I PULLED INTO THE GAS STATION.  AS I ENTERED THE PARKING SPOT, THE CAR DIED.  (IT HAD BURNED OIL IN THE PAST.  I HAVE HAD AN ENGINE CAM REPLACED IN AUG/SEPT 2019).  I CHECKED THE OIL.  NO OIL!  SO, I RAN AND BOUGHT 5 QUARTS OF OIL AND PUT THEM IN THE ENGINE.    I STARTED THE CAR AND IT DIDN'T WANT TO IDLE, BUT FINALLY DID AFTER A MINUTE.  I ROLLED DOWN MY WINDOW AND THE CAR NOISE WAS MULTIPLE CLANGING SOUNDS.  IT WAS AS LOUD AS A BAD MUFFLER.  I SHUT OFF THE CAR AND CALLED  MY BOYFRIEND. HE SAID IT SOUNDED LIKE MY ENGINE BLEW.     I CALLED MCGRATHS IN HIAWATHA, IOWA AND HAD THE CAR TOWED THERE.   I AM 6000 MILES OVER MY 100,000 MILE WARRANTY.  I AM TOLD THAT HYUNDAI WON'T COVER THIS ISSUE.  HOWEVER, WHAT HAPPENED TO MY CAR SOUNDED EXACTLY LIKE THE PROBLEM WITH THE HYUNDAI 4 CYLINDER ENGINE TROUBLES THAT WERE RECALLED IN 2018.  HYUNDAI KNEW I WAS HAVING ENGINE ISSUES IN 2019, AND WOULD ONLY REPLACE THE CAM.  I FEEL THAT MY ENGINE SHOULD BE COVERED BY HYUNDAI.  CURRENTLY, MY CAR IS IN THE SHOP AND I HAVE NO VEHICLE TO DRIVE.  THE DEALERSHIP IS GOING TO ASK HYUNDAI FOR A \"GOOD WILL\" PERCENTAGE TO REPAIR THE VEHICLE.  HOWEVER, THIS IS NO GUARANTEE.  I AM OVER THE IOWA LEMON LAW LIMIT FOR MILEAGE AND YEARS.  I FEEL THAT SINCE THERE WERE ENGINE ISSUES WITH OTHER ENGINES HYUNDAI MADE, THAT THEY KNEW I WAS HAVING THE SAME ISSUES AND WOULDN'T REPAIR IT CORRECTLY.  I NEED TO HAVE SOMEONE CHECK INTO THIS.  I DON'T KNOW WHAT ELSE TO DO.  I AM PREPARED TO GET A LAWYER.  MY VEHICLE WAS NOT RECALLED EVER.",
        "vin": "KM8SRDHF3GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/04/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403967,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BEING DRIVEN ON AN INTERSTATE, WHEN THE ENGINE STARTED KNOCKING AND THEN QUIT.  CAR HAD TO BE TOWED AND LEFT AT A DEALER TO HAVE THE ENGINE REPLACED.  THE DRIVER THEN HAD TO RENT A VEHICLE TO COMPLETE HIS TRIP OUT OF STATE.",
        "vin": "5XYZU3LA0GG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395552,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVIGATION SYSTEM WON'T LOAD- WHEN THE VEHICLE IS STARTED, THE NAVIGATION SYSTEM (SCREEN SAYS BLUELINK)- STARTS THE PROCESS OF LOADING- WITH A LOADING BAR BELOW THE WORDS \"BLUELINK'. , AT ENGINE START- WHEN LOADING, THAT BAR  MOVES FROM LEFT TO RIGHT. ONCE THE SYSTEM IS LOADED, THE NAVIGATION SCREEN COMES ON. THE PROBLEM:  THE LOADING PROCESS STOPPED LOADING AT APPROX. 60,000 MILES -THE NAVIGATION SCREEN IS STUCK IN THE \"LOADING\" SCREEN. MECHANIC DID A HARD RESET, DID NOT WORK. THE SYSTEM IS STALLED, AND HAS NEVER LOADED SINCE THEN.  CAN NOT SEE THE NAVIGATION SCREEN, NOR THE RADIO PRESETS, BLUE TOOTH, STEREO SPEAKER SETTINGS, CAN'T GET TO ANY OF THESE SETTINGS OR OPTIONS.",
        "vin": "5XYZW4LA8GG"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383182,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED WITH THE ENGINE RUNNING TO BE WARMED UP. THE VEHICLE STARTED TO SHAKE AND ENGINE LIGHT CAME ON.  THIS WAS NOT THE FIRST TIME THIS HAPPENED. THE FIRST TIME IT HAPPENED I WAS STOPPED AT A TRAFFIC LIGHT, WHEN I TRIED TO MOVE THE VEHICLE IT WONT GO ANYTHING OVER 15MILES PER HOUR. TOOK THE VEHICLE TO THE SHOP AND WAS TOLD  THE THROTTLE BODY WAS DAMAGE.",
        "vin": "KM8SM4HF0GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372984,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR COMPLETELY DIED WHILE DRIVING DOWN THE ROAD. COULDN'T ACCELERATE, SERIOUSLY BAD SMELL, AND VIOLENT SHAKING COMPLETELY OUT OF THE BLUE AT 68,000 MILES. DEALERSHIP SAYS ENGINE NEEDS REPLACED AND WILL COST US $7,000.",
        "vin": "KM8SR4HF1GU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/27/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361384,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SENSOR COMES ON AND OFF SPORADICALLY FOR MY ABS AND TRACTION CONTROL. I BELIEVE THERE IS A SHORT AS THE LIGHTS COME ON MORE OFTEN ON HUMID DAYS. I HAVE HEARD THIS COULD CAUSE SPONTANEOUS COMBUSTION  OF THE VEHICLE GIVEN THE LOCATION  OF THE SENSOR. I TRANSPORT  4 YOUNG GRANDCHILDREN IN THIS VEHICLE AND WE ARE NOW AFRAID OF DYING IN A CAR FIRE. THE DEALER WANTS A FORTUNE TO REPLACE THIS SENSOR. GIVEN OTHER YEAR SANTE FE SUV HAVE BEEN RECALLED FOR THIS ISSUE I WOULD LIKE THE 2016 MODELS RECALLED AS WELL. THIS HAS BEEN ONGOING FOR A FEW WEEKS NOW. COMES ON WHEN I START VEHICLE ON HUMID DAYS. GOES OFF ON DRY DAYS.THE  DEALER SAID HE WILL REPORT THAT I COULD NOT AFFORD THE REPAIR AND IF I DO GET A FIRE FROM IT THE INSURANCE COMPANY WILL NOT COVER IT AS I WAS INFORMED OF THE PROBLEM. SOUNDS LIKE BLACKMAIL TO ME.",
        "vin": "5XYZT3LB0GG"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "09/07/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355609,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAUGHT FIRE SPONTANEOUSLY AT A PARKING LOT. CAR WAS JUST SERVICED AND INSPECTED A MONTH PRIOR AT THE HYUNDAI DEALER WHERE I PURCHASED IT AND HAD NO PROBLEMS REPORTED. CAR WAS PARKED AT THE TIME OF THE INCIDENT. FROM THE INITIAL REPORT FROM THE FIRE DEPARTMENT THE CAUSE OF THE FIRE WAS A MECHANICAL ISSUE. THE VEHICLE WAS A TOTAL LOSS.",
        "vin": "5XYZU3LBXGG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "07/19/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355086,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV STOPPED COMPLETELY IN THE MIDDLE OF FREE WAY. ALL THE LIGHTS IN THE BOARD TURN ON AND HAD TO GET IT TOWED. WAS TOLD IT WAS THE ENGINE WHICH I THINK IT'S I'MPOSIBLE BEING A FOUR YEAR OLD CAR.",
        "vin": "5XYZTDLB9GG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354909,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE OIL SENSOR LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE CONTACT STATED THAT TWO MONTHS LATER, THAT THE ENGINE LEAKED OIL AND FAILED TO RETAIN ENGINE OIL. THE CONTACT CALLED THE HYUNDAI OF BECKLEY DEALER LOCATED AT 3921 ROBERT C BYRD DR, BECKLEY, WV 25801, (304)-254-8220, AND SCHEDULED AN APPOINTMENT. THE CONTACT INQUIRED ABOUT AN UNKNOWN OIL LEAK RECALL AND WAS INFORMED THAT THE VEHICLE WAS NOT SUBJECTED TO A RECALL. THE MANUFACTURER WAS CALLED BUT, NO ONE ANSWERED THE PHONE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 94,000.",
        "vin": "KM8SMDHF6GU"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354811,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ABOUT 65 MPH ON THE HIGHWAY ALL OF THE WARNING LIGHTS (ENGINE, OIL, ETC...) CAME ON AT THE SAME TIME AND THE CAR JUST SHUT DOWN AND LOST POWER STEERING. LUCKILY I WAS ABLE TO PULL OVER WITHOUT ANY PROBLEMS. THE VEHICLE WOULDNT START. IT JUST MAD A CLICK WHEN TURNING THE KEY. ALL OF THE LIGHTS WORK IN THE VEHICLE. THE VEHICLE HAS ABOUT 82,000 MILES",
        "vin": "5XYZTDLB5GG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "08/23/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354449,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING TO A STOP WITH THE BRAKES APPLIED, THE RPMS JUMP TO 4,000 AND THE VEHICLE SURGES FORWARD.  THE VEHICLE STOPPED AFTER PUTTING IT IN NEUTRAL.  THIS HAPPENED ON 8/23/20 AND OTHER TIMES.  DEALER COULD NOT REPLICATE AND DENIED ANY KNOWLEDGE OF THE PROBLEM.",
        "vin": "5XYZW4LA3GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351258,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE 80 APPLIED BREAK AS TRAFFIC IN FRONT OF MY WAS SLOWING DOWN. CAR CONTINUED TO SLOW DOWN FAILED TO ACCELERATE. PULLED OFF INTERSTATE CALLED ROAD SIDE ASSISTANCE. CAR WAS TOWED 160 TO THE NEAREST DEALERSHIP. HAD TO RENT A CAR TO FOLLOW MY CAR TO DEALERSHIP ADVISES BY RSA THAT I COULD NOT RIDE WITH TOW DRIVER. ADVISED BY BY SERVICE MANGER THE NEXT DAY THAT CAR IS NOT DRIVEABLE,  ENGINE NEEDS TO BE  REPLACED. ADVISED THAT ADDITIONAL DIAGNOSTIC IS NEEDED TO SUBMIT FOR APPROVAL TO  DETERMINE IF ENGINE WILL BE COVERED UNDER WARRANTY. STUCK IN CHEYENNE, WY OVER 1K  MILES AWAY FROM. DEALER CAN'T  OFFER ME A LOANER TOO FAR HOME AND CAN'T OFFER A RENTAL  THAT CAN BE DRIVEN OUT OF STATE. FORCED TO FIND OTHER MEANS TO GET HOME. RECEIVE EMAIL AND HAVE A LETTER IN THE MAIL TODAY VEHICLE IDENTIFIED AS BEING INCLUDED IN CLASS ACTION SETTLEMENT FOR ENGINE FAILURE. SO NOW HERE I SIT AND WAIT NOT SURE IF REPAIR WILL BE COVERED AND WITHOUT A VEHICLE.",
        "vin": "5XYZWDLA6GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348442,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR TO THE LOCAL HYUNDAI SERVICE CENTER 8/4/2020 DUE TO THE CHECK ENGINE LIGHT BEING ON.  NO OTHER SYMPTOMS.  I WAS TOLD THE LIGHT CAME ON DUE TO COMPLETE ENGINE FAILURE.  NO OTHER INFORMATION PROVIDED.  I'M CURRENTLY WAITING TO HEAR IF THE REPAIR WILL BE COVERED BY MY EXTENDED WARRANTY OF IF I WILL BE FACED WITH THE $17K REPAIR.  VEHICLE IS ONLY 4 YEARS OLD AND HAS REQUIRED SERVICING EVERY YEAR SINCE I PURCHASED IT (CPO).",
        "vin": "KM8SRDHF9GU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344087,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I STOP AT TRAFFIC LIGHT THE CAR HAS VIBRATION I CAN FELL IT WHILE I STEP ON THE BREAK I TOOK IT 2 HYUNDAI THEY ADVISE ME IS NORMAL.",
        "vin": "5XYZT3LB9GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339815,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING. DASH BOARD LIGHTS FLICKERED, CAR SHUT OFF, (LUCKILY NOT WHILE ON THE HIGHWAY) WHEN TRYING TO START THE CAR, ENGINE WOULD NOT TURN OVER. HAZARD LIGHTS DID WORK.TOWED TO DEALERSHIP. HYUNDAI ASSESSED AND CLAIMED AN ENGINE RECALL. IT'S BEEN A MONTH. BUT HYUNDAI DID REPLACE THE ENGINE ALONE WITH ADDITIONAL PART.",
        "vin": "5XYZTDLB4GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2020",
        "dateOfIncident": "02/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308534,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 HYUNDAI SANTA FE SHUT DOWN WHILE DRIVING ON A HIGHWAY AND WOULD NOT RESTART. IT IS IN A GARAGE NOW AND THEY ARE TRYING TO DIAGNOSE THE PROBLEM.",
        "vin": "5XYZTDLB4GG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300746,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY 2016 HYUNDAI  SANTA FE SERVICED BY HYUNDAI FOR A TIRE CHANGE AND OIL CHANGE ALONG WITH THE RECALL UPDATE ON JAN 17, PRIOR TO GOING FROM ST LOUIS MO TO WICHITA KS. I AM A TRAVELING NURSE, MY CONTRACT WAS STARTING MONDAY THE 20TH. I WAS ADVISED THE RECALL WAS A SYSTEM UPDATE FOR IMPROPERLY WORKING SENSORS. MY MOTOR BLEW 2 HOURS INTO MY TRIP ON JAN 18TH WHILE DRIVING ON THE HIGHWAY. I HEARD A LOUD POPPING NOISE AND FELT IT AS WELL. MY VEHICLE IMMEDIATELY STARTED TO SMOKE. I PULLED OVER TO THE SIDE OF THE ROAD, OIL WAS POURING OUT THE VEHICLE. IT WAS 30 DEGREES AND IM STUCK ON A 2 LANE HIGHWAY. I WAS TOWED TO THE CLOSEST DEALER, WHERE I WAS INFORMED THEY WOULD NOT BE ABLE TO GET A RENTAL VEHICLE SINCE THE RENTAL LOCATION WAS CLOSED FOR THE DAY. I COULD NOT GET A LOANER VEHICLE DUE TO THE AMOUNT OF MILES I HAD TO DRIVE. MY ONLY OPTION WOULD BE TO PURCHASE A NEW VEHICLE. I WAS STRESSED AND VERY OVERWHELMED, THINKING ABOUT MY NEED TO GET TO WICHITA KS AND UPSET THAT MY VEHICLE THAT WAS JUST SERVICED BY HYNDAI HAD BLOWN UP ON THE HIGHWAY. WITHIN AN HOUR OF LEAVING THE DEALERSHIP, FINALLY HAVING A MOMENT ALONE, WITHOUT A SALESMAN IN MY FACE, I REALIZED THIS WAS A MISTAKE. I CALLED BACK TO RETURN THE VEHICLE BUT MY SALESMAN WAS GONE FOR THE DAY AND THE DEALERSHIP WAS CLOSING. I TEXT MY SALESMAN ON SUNDAY ADVISING THAT I WANT TO RETURN THE NEW VEHICLE AND JUST GET THE RENTAL CAR AND MY VEHICLE FIXED, AS HYUNDAI ROADSIDE HAD PROMISED. ON MONDAY JAN 20TH I WAS ADVISED THEY WOULD NOT REVERSE THIS SALE AND I COULD NOT GET MY VEHICLE BACK. NOW I'M STUCK IN A VEHICLE I DO NOT TRUST WITH A HIGHER PAYMENT,  HIGHER INSURANCE PREMIUM,  FEELING COMPLETELY TAKEN ADVANTAGE OF. I DO NOT TRUST THE HYUNDAI BRAND. SEVERAL INJURIES HAVE OCCURRED TO OTHERS DUE TO THEIR LACK OF HONESTY. THERE ARE MANY POSTS ONLINE ABOUT HYUNDAI'S POOR BUSINESS PRACTICES. THE RECALL IS CALLED A CAMPAIGN.",
        "vin": "5XYZTDLB7GG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289929,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT NIGHT THERE IS A BLACK SHADOW ON THE WINDSHIELD MAKING IT IMPOSSIBLE TO SEE. IT IS NOT FIXED BY REAIMING LIGHTS. IT IS WORSE AS YOU HIT BUMPS IN THE RODE. IT MAKES IT IMPOSSIBLE TO DRIVE AT NIGHT! I WAS DRIVING IN MY SUBDIVISION AND COULD NOT SEE A WOMAN WALKING.",
        "vin": "5XYZU3LB5GG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279932,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE GONE BAD AND NEEDS REPLACED. WHILE DRIVING LOST POWER, LATER TO FIND FROM DEALERSHIP THAT ENGINE WAS NO LONGER GOOD. THIS THOUGH VEHICLE IS 3 YEARS OLD. WAS LATER TOLD THAT ENGINE HAD RECALL WHICH I WAS NEVER MADE AWARE.",
        "vin": "5XYZUDLB3GG"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271554,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. WHEN THE VEHICLE WAS STARTED, THE AIR BAG INDICATOR ILLUMINATED AND REMAINED LIT. THE VEHICLE WAS TAKEN TO DANBURY HYUNDAI (203-730-4700, LOCATED AT 102 FEDERAL ROAD, DANBURY, CT 06810) WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE WAS OUT OF WARRANTY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.",
        "vin": "5XYZUDLB1GG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "09/16/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269221,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 30 MPH, A LOUD SNAPPING NOISE WAS HEARD. THE VEHICLE WAS TAKEN TO UNIVERSAL HYUNDAI (321-418-6386, LOCATED AT 12801 S ORANGE BLOSSOM TRL, ORLANDO, FL 32837) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE VEHICLE REMAINED AT THE DEALER'S FOR THE PAST MONTH. THE CONTACT WAS INFORMED THAT THE PART WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VEHICLE WAS OVER TWO YEARS OLD AND WOULD NOT BE ENTITLED TO THE LEMON LAW CONSIDERATION; THEREFORE, THEY COULD NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 46,000.",
        "vin": "5XYZU3LB2GG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "08/25/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255432,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE HIT HEAD ON BY A LARGE PICKUP TRUCK. WE SUSTAINED A LOT OF DAMAGE FROM THIS HEAD-ON COLLISION. WE WERE TRAVELING AROUND 10 MILES AN HOUR BUT THE OTHER CAR WAS GOING AT LEAST 20 MILES AN HOUR. THE AIRBAGS NEVER DEPLOYED DESPITE BEING HIT HEAD ON AND SUFFERING A LOT OF DAMAGE UPON IMPACT. WE WERE SLOWING DOWN FOR A STOP SIGN. THE OTHER CAR TURNED INTO OUR LANE AND WAS ACCELERATING TOWARDS US.",
        "vin": "5XYZW4LA8GG"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245918,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 27, 2019 DRIVING ON A COUNTY ROAD AT 50 MPH IN DRY AND SUNNY CONDITIONS, THE AIRBAG LIGHT ILLUMINATED AS WELL AS THE PASSENGER SEATBELT LIGHT. THE NEXT MORNING I SCHEDULED SERVICE RIGHT AWAY. I STARTED MY CAR TO GO TO SCHWARTZ MAZDA IN SHREWSBURY NJ ON 7/27/19 FOR SERVICE THRU MY PURCHASED EXTENDED WARRANTY. AT THAT TIME, NEITHER THE AIRBAG OR SEATBELT LIGHTS WERE ON, BUT NERVOUS FOR MINE AND MY FAMILY'S SAFETY, I BROUGHT THE CAR ANYWAY. I WAS INFORMED BY JARROD IN THE SERVICE DEPARTMENT THAT THEY RESET MY COMPUTER AND TO LET HIM KNOW IF THE LIGHT(S) CAME BACK ON. THE AIRBAG LIGHT CAME ON BRIEFLY ON AUGUST 11TH WHILE DRIVING ON A RESIDENTIAL ROAD GOING 35 MPH ON A DRY AND SUNNY DAY.  I TURNED OFF THE VEHICLE TO PARK AND THEN RESTARTED MY CAR TO RETURN HOME. THE LIGHT WAS NOT ON. MONDAY AUGUST 19TH WHILE TRAVELING ON A COUNTY ROAD AT 45 MPH IN RAINY WET DRIVING CONDITIONS AIRBAG LIGHT CAME ON ACCOMPANIED BY THE FLASHING PASSENGER SEAT BELT LIGHT AGAIN. MADE AN APPT FOR SERVICE ON  TUESDAY, AUGUST 20TH WITH ONCE AGAIN, SCHWARTZ MAZDA IN SHREWSBURY NJ WHERE I PURCHASED THE VEHICLE IN MAY OF 2018. BOTH LIGHTS WERE ON UPON MY ARRIVAL IN SUNNY AND DRY DRIVING CONDITIONS. THEIR CODE READER PRODUCED THE CODE \"PASSENGER MAT SENSOR\" AND I WAS INFORMED THEY WOULD HAVE TO SEND IT TO CIRCLE HYUNDAI IN SHREWSBURY FOR FURTHER DIAGNOSIS. I RECEIVED A CALL FROM JARROD AT SCHWARTZ MAZDA AT 11 AM ON THURSDAY AUGUST 22 WITH NEWS THAT MY REPAIR WAS NOT COVERED UNDER MY PURCHASED EXTENDED WARRANTY AND THAT THE REPAIRS WOULD COST ALMOST $600.   I AM FEARFUL FOR MY FAMILY'S SAFETY AND THE RESOURCES I HAVE REACHED OUT TO HAVE BEEN USELESS AND UNACCOMODATING.  WHY IS NO ONE CONCERNED FOR THE SAFETY OF AIRBAGS THAT WILL NOT INFLATE IN THE EVENT OF EMERGENCY? PLEASE CONTACT ME WITH A COURSE OF ACTION I CAN TAKE TO REPAIR THIS VEHICLE AND KEEP MY FAMILY SAFE.",
        "vin": "KM8SM4HF7GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244040,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSFER CASE IS FAILING AT 61,000 MILE, A LOT OF NOSE AND VIBRATION. TRANSFER CASE CAN COME LOOSE OR CAUSE FAILURE TO THE DRIVE SHAFT AND MAYBE EVEN POSSIBLE COMPONENTS TO COME OFF WHILE DRIVING.",
        "vin": "KM8SNDHF9GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228560,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE, I PRESSED THE GAS PEDAL AND THE VEHICLE WOULD NOT ACCELERATE. THE MOTOR WAS RUNNING AND THE VEHICLE SEEMED TO HAVE SOME PULL ON IT'S OWN BUT CLEARLY ANYTIME THE GAS PEDAL WAS PRESSED THERE WAS NO ACCELERATION. IT WAS DIAGNOSED AS A DEFAULT IN THE THROTTLE BODY.",
        "vin": "KM8SM4HF7GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205772,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILED AT 63,000 MILES WHILE DRIVING ON INTERSTATE. HYUNDAI BLAMES IT ON SLUDGE IN OIL PAN. WITH OUT SERVICE RECEIPTS WILL NOT WARRANTY ENGINE. SERVICED ENGINE MYSELF AND DIDN'T SAVE CASH RECEIPTS.",
        "vin": "KM8SMDHF7GU"
    },
    {
        "components": "SUSPENSION,SEAT BELTS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205882,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, THE SEAT BELT IS GETTING STOCKED AND TIGHT DURING DRIVING ALSO DOESN'T RECLINE WHEN TAKING IT OFF STILL HANGING, THE FUEL EVAPORATES FROM THE FUEL TANK AND DOESN'T GIVE ANY MILEAGE AS DESCRIBED WHEN DRIVING FEEL EVERY LITTLE THING ON THE ROAD INCLUDING SMALL ROCKS.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205497,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE HESITATED AND JERKED. ALSO, WHILE ACCELERATING FROM A STOP SIGN, THE VEHICLE FELT AS IF IT DOWNSHIFTED. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE FAILURE WAS NORMAL. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO TAKE THE VEHICLE TO A DEALER. THE DEALER WAS NOT CALLED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": "KM8SMDHF0GU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196892,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A SURGING ISSUE. WHEN I COME TO A TRAFFIC LIGHT STOP IT ACTS LIKE IT'S GOING TO DIE I CAN FELL MY FOOT ON THE PEDAL ALSO THE RPM IS DROP . TOOK IT TO DEALER AND ADVISE ME THEY CAN'T TEST IT WITH OUT NO CHECK ENGINE LIGHT ON AND  IT CONTINUES TO PERFORM THE SAME ALSO I REPLACE THE SPARK PLUG AND COIL WAS BURN BAD AND RUST SILL HAVE SAME ISSUE LOOK LIKE ISSUE WITH FUEL OR IDLE.",
        "vin": "5XYZT3LB9GG"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11186984,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS AT A COMPLETE STOP IN A DRIVEWAY. THE CAR WAS STILL RUNNING BECAUSE I WAS GETTING OUT OF THE CAR TO GET THE MAIL.  I PUT THE CAR IN PARK AND WENT TO GET OUT OF THE VEHICLE. AS I GOT OUT THE VEHICLE STARTED GOING IN REVERSE AND PULLED ME UNDERNEATH THE CAR AND THE VEHICLE RAN OVER ME. I'M NOT SURE IF THE TRANSMISSION SLIPPED OUT OF PARK TO REVERSE ON ITS OWN OR IF THE SHIFTER WASN'T ACTUALLY PLACED IN PARK.  I THOUGHT THE VEHICLE COULD SENSE IF NO ONE WAS IN THE DRIVERS SEAT AND AUTOMATICALLY PUT THE CAR INTO PARK OR NEUTRAL. THE HEATED SEATS AND AIRBAG WON'T TURN ON UNLESS IT SENSE WEIGHT IN THE SEAT.",
        "vin": "5XYZUDLB8GG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2018",
        "dateOfIncident": "09/19/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152826,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS PEELING OFF IN SOME AREAS AND THE CAR IS GETTING RUST SPOTS.",
        "vin": "KM8SM4HF5FU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "10/04/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133382,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I COME OUT OF SLOW TURNS OR SLOW DOWN THEN ACCELERATE ON THE HIGHWAY, MY VEHICLE DOES A 1 TO 2 SECOND HESITATION. DURING THIS HESITATION, THE ENGINE IS REVVING BUT THE THE VEHICLE WON'T ACCELERATE. WHEN I COME OFF THE GAS THEN REPRESS IT COMES BACK TO NORMAL.",
        "vin": "5XYZ0DLB3GG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "07/05/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129562,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONING CONDENSOR ON MY HYUNDAI 2016 SANTA FE WAS DAMAGED BY ROAD DEBRIS THAT APPARENTLY CAME THROUGH THE FRONT GRILL OF MY CAR AND HAD TO BE REPLACED. HOW CAN ROAD DEBRIS DAMAGED MY AIR CONDENSOR? SHOULDN'T ALL INTERNAL ENGINE COMPONENTS OF A CAR BE PROTECTED FROM THIS TYPE OF DAMAGE? THIS CONCERNS ME BECAUSE WHAT OTHER ENGINE COMPONENTS COULD BE DAMAGED BY THE GRILL NOT PROPERLY COVERING THE OTHER VITAL ENGINE PARTS. I HAVE HEARD THAT THIS IS A DESIGN FLAW WITH MY VEHICLE.",
        "vin": "5XYZU3LB1GG"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119365,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR NEW IN PUERTO RICO.  AFTER HURRICANE MARIA I MOVED TO FLORIDA.  I TRIED TO GET MY CAR SERVICE FOR TWO RECALLS HERE IN FLORIDA.  THEY TRIED TO GET IN CONTACT WITH PUERTO RICO IN ORDER TO GET PAID FOR THE REPAIRS.  I ALSO CALLED THEM AND THEY TOLD ME TO WRITE THEM A LETTER ASKING TO REGISTER THE CAR HERE.  THEY HAVE NOT ANSWER ANY OF MY FOUR REQUEST.  WHAT CAN WE DO?",
        "vin": "5XYZU3LA9GG"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "07/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118629,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AIRBAG LIGHT ON AND MY SUV HAS BEEN IN 0 ACIDDENTS, THE AC AIR STATES IT'S ON BUT DOESN'T BLOW ANY AIR AT ALL! IT ONLY HAS 69640K MILES, KNOCKING SOUND WHEN I AM ON PARK OR HAVE THE BRAKE ON WHILE AT RED LIGHT OR STOP SIGN!",
        "vin": "KM8SR4HF6GU"
    },
    {
        "components": "SUSPENSION,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2018",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105332,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL:(#141),(#163),PLUS REAR & FRONT END SUSPENSION OUT OF LINE. BROUGHT BRAND NEW TIRES AND STILL VIBRATION FRONT AND REAR.",
        "vin": "5XYZU3LB6GG"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11103563,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY WE COULD NOT UNDO THE SEATBELT THAT OUR 6 YEAR OLD GRANDSON WAS STRAPPED IN. THE MORE TRIED TO EXTEND IT TO RELEASE THE TENSION THE TIGHTER IT BECAME. MY GRANDSON WAS BEING CRUSHED AND WAS SCREAMING. THE VEHICLE WAS NOT RUNNING AND WAS PARKED IN THE DRIVEWAY. I HAD TO RUN INTO THE GARAGE AND GET A PAIR OF SCISSORS AND CUT THE SEATBELT TO GET HIM OUT. TO REPLACE THE SEATBELT IS GOING TO COST OVER $400 AND THE DEALER WILL NOT PAY FOR IT AS THEY SAID IT WAS OUR FAULT.",
        "vin": "KM8SRDHF1GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2018",
        "dateOfIncident": "02/04/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066898,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF EXPLODED. I WAS DRIVING AND HEARD A LOUD NOISE THAT SEEMED TO COME FROM ABOVE. MY KIDS WERE BUCKLED IN THE BACK SEATS AND MY SON ASKED ME \"WHAT WAS THAT DADDY\"? HE THEN LOOKED UP AND NOTICED PIERCINGS IN THE UNDERNEATH SHEATH THAT LEADS TO THE SUNROOF VIEW. IT COULD NOT ROLL BACK FULLY. THERE WAS ALSO MOISTURE APPEARING THRU THE SHEATH OF THE ROOF.  WHEN I GOT HOME AND GOT MY WIFE AND KIDS OUT. I LOOKED AND NOTICED A GAPING HOLE IN THE ROOF. I THEN REALIZED THE BACK PANEL WAS COMPLETELY SHATTERED WITH GLASS WEDGED ON THE SHEATH. WHICH IS A GOOD THING BECAUSE THE GLASS COULD HAVE DROPPED ON MY KIDS. MY WIFE AND I HAD TO COVER IT UP WITH CARDBOARD AND BLACK BAGS WHILE IN THE RAIN. I AM GOING BACK TO STAR HYUNDAI DEALERS TO REPORT THE PROBLEM AS IT'S SUNDAY 2/4 AND THEY ARE CLOSED.",
        "vin": "KM8SRDHF9GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2017",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056221,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONE ON HIGHWAY, SUNROOF SPONTANEOUSLY EXPLODED. I WAS DRIVING ROUGHLY 100 KM / HE. THERE WAS NOTHING OVERHEAD OR VEHICLES AHEAD THAT WOULD CAUSE SOMETHING TO BREAK IT.  THE INCIDENT WAS EXTREMELY LOUD, ALL THE GLASS FEEL OVER ME CAUSING A HUGE SAFETY CONCERN AS IT WAS AT HIGHWAY SPEEDS.   THE SUNROOF IS A PANORAMIC SO IT WAS A HUGE AMOUNT OF GLASS.    HYUNDAI WAS NOTIFIED NUMEROUS TIMES. THEY WOULD NOT ACKNOWLEDGE THIS HAD HAPPENED BEFORE, INSISTED SOMETHING HIT IT. HYUNDAI ALSO WOULD NOT COVER THE COST OF REPLACEMENT.",
        "vin": "5XYZUDLB1GG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2017",
        "dateOfIncident": "09/26/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033285,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 HYUNDAI SANTA FE SPORT. OVER THE LAST 3 MONTHS I'VE HAD 2 OCCASIONS (BOTH ON HIGHWAYS) WHEN THE ENGINE SHUT OFF WHILE DRIVING. THE LATEST OCCURRED THIS MORNING (9/26/2017) DURING RUSH HOUR. I WAS FORTUNATE IN THAT I HAD ENOUGH MOMENTUM TO NAVIGATE THE DEAD CAR ACROSS A LANE OF TRAFFIC TO THE SIDE. ON BOTH OCCASION, I WAS ABLE TO TURN THE KEY TO THE START POSITION, PUT THE CAR IN PARK AND START IT UP, LIKE NOTHING HAD OCCURRED.    SINCE THE LAST OCCURANCE I HAVE SUBMITTED A CASE WITH HYUNDAI AND HAVE TAKEN THE CAR INTO A LOCAL DEALERSHIP TO LOOK INTO THE ISSUE.  THE DEALERSHIP COULD NOT REPRODUCE THE ISSUE.  THAT WAS ON 9/28.  OUTSIDE OF AN EMAIL STATING THEY WOULD BE REACHING BACK OJT TO ME, I HAVEN'T HEARD ANYTHING.      THE CAR HAS LESS THAN 32K MILES, SO THIS IS AN ISSUE.",
        "vin": "5XYZU3LB8GG"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020108,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SEAT BELT AUDIBLE ALARM NOTIFICATION WHEN THE BELT IS NOT BUCKLED WITH PASSENGER IN THE SEAT. SEE VIDEO WEB SITE  HTTP://WWW.RECALLMASTERS.COM/NO-SEAT-BELT-WARNING-FOR-SOME-HYUNDAI-SANTA-FE-VEHICLES-VIDEO/",
        "vin": "KM8SRDHF8GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985104,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE PARKING LIGHT COMES ON, DOWNHILL ASSIST COMES ON AND THE TRACTION CONTROL GOES OFF, THEN THE SPEEDOMETER GOES FROM THE CURRANT SPEED TO ZERO THEN FLUTTERS BACK TO THE CORRECT SPEED, THEN REPEATS. THIS HAS HAPPENED AT SPEEDS FROM 25 MPH TO 70 MPH. DEALER SAYS THEY CAN'T FIND OUT WHAT IS WRONG.",
        "vin": "KM8SM4HF5GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "11/03/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970358,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR 16 MONTHS AGO, THE GAS GAUGE STOPPED WORKING, I TOOK THE CAR TO LESTER GLENN HYUNDAI IN TOMS RIVER, NJ WHERE I BOUGHT IT. I USE THIS CAR AND COVER 5 STATES AS A TERRITORY MANAGER, THE WARRANTY EXPIRED 10,000 MILES AGO, THEY SAID THEY WILL TALK TO HYUNDAI TO SEE IF THEY WILL COVER PART. I FEEL AFTER 1 YEAR THIS PART SHOULD NEVER HAVE FAILED. I OWNED 3 HYUNDAI'S AND NEVER HAD THIS PROBLEM BEFORE. THIS PART SHOULD HAVE LASTED THE LIFE OF THE CAR.",
        "vin": "5XYZU3LB5GG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943804,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE STOPPED AT STOP SIGN , CAR WOULD NOT RESPOND TO ACCELERATOR PEDAL , 1 BLOCK FROM HOME WAS ABLE TO IDLE CAR INTO DRIVE WAY. I GOT INTO CAR TO SEE WHAT WAS GOING ON FOUND SAME PROBLEM. I SHUT CAR OFF AND RESTARTED AND ACCELERATOR STARTED WORKING , PULLED INTO GARAGE AND CALLED HYUNDAI TO GET TOWED TO DEALER CAR NOT SAFE TO DRIVE.",
        "vin": "KM8SR4HF1GU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "12/04/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929964,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE PANARAMA SUNROOF EXPLODED ON MY 2016 SANTA FE WHILE  TRAVELING ON INTERSTATE 81 @ 70 MPH IN PENNSYLVANIA YESTERDAY COVERING MY WIFE AND I WITH SHARDES OF GLASS. I UNDERSTAND THERE HAS BEEN OTHER INCIDENTS OF THIS NATURE POSTED ON GOOGLE. I CALLED THE DEALER AND GOT THE TYPICAL RUN AROUND. I DID NOT PASS UNDER ANY OVER PASSES AND TRAFFIC WAS NON EXISTENT.",
        "vin": "KM8SRDHF3GU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928522,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A. WIPER HEATERS, AS LISTED ON THE WINDOW INVOICE ARE NON-EXISTANT. I HAD SEVERAL FREEZE-UPS LAST WINTER CAUSING ME TO STOP THE CAR AND CLEAR THE BLADES MANUALLY, EVEN THOUGH THE FRONT DEFROST BUTTON WAS DEPRESSED. DEALER SAID IT WAS OPERATING AS IT SHOULD. (?? - I DISAGREE)   B. DURING THE SUMMER I WAS GETTING MOISTURE ON THE INSIDE OF THE WINDSHIELD AND FRONT SIDE WINDOWS. I DISCOVERED A SOPPING WET FRONT PASSENGER FLOOR WHICH  THE DEALER ATTRIBUTED TO SPIDERWEBS IN THE  A/C CONDENSER DISCHARGE TUBE WHICH THEY \"CLEANED\" FOR NON WARRANTY $69 PRICE-POINT . WATER APPEARED ON CABIN FIREWALL / CONSOLE YESTERDAY,  AS 'DEFROST /BLADE DEICER' ACTIVATES A/C; AND A CIRCLE OF EVENTS BEGINS AGAIN. THE PROBLEM REQUIRES DEFROST TO FUNCTION  WHICH CAUSES MORE MOISTURE AND THE WIPERS STILL DO NOT HEAT UP (THE WINDSHIELD UNDER THE BLADES SEEMS TO GET WARM BUT NOT ENOUGH TO KEEP SNOW/ICE FROM THE EXCESSIVE BUILD-UP AND IT'S RESTRICTING AIR INTAKE AT THE PORTS UNDER THE REAR EDGE OF THE HOOD). VISIBILITY IS PROBLEM-MATIC IN THIS CAR'S MALFUNCTION AND DESIGN. THIS 2016 SANTAFE SPORT IS ONE YEAR OLD LAST WEEK.",
        "vin": "5XYZU3LBXGG"
    },
    {
        "components": "SEAT BELTS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "09/03/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10904763,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lotus Cars Limited",
                "productMake": "SEAT BELT ASSEMBLY",
                "productModel": "SEAT BELT ASSEMBLY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2016 HYUNDAI SANTE FE INVOLVED IN A NEAR HEAD ON COLLISION. COMBINED TOTAL SPEED OF IMPACT APPROXIMATELY 80 MPH. TWO OCCUPANTS BOTH WEARING SEATBELTS AT TIME OF CRASH. DRIVER SIDE AND PASSENGER SIDE AIRBAGS DEPLOYED DURING CRASH. PASSENGER SHOULDER HARNESS FAILED (LOCKING MECHANISM DID NOT LOCK) RESULTING IN PASSENGER HEAD IMPACT WITH WIND SHIELD CAUSING SIGNIFICANT DEFORMATION OF WIND SHIELD AND HEAD INJURY TO THE PASSENGER. LAP BELT RESTRAINT PREVENTED PASSENGER FROM SIGNIFICANTLY WORSE INJURY. PHOTOS ARE AVAILABLE.  *TR",
        "vin": "5XYZW4LA4GG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "06/28/1016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10877133,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2016 SANTA FE SPORT AT CARMAX 8000 MILES AND WHEN I FILLED THE TANK THE FIRST TIME I COULD ONLY FILL ABOUT 13 GAL, I DROVE IN TOWN ABOUT 280 MILES. FILLED NOW A FEW TIMES AND ONLY CAN FILL ABOUT 13 GAL EACH TIME. IT SHOWS AS FULL, HOWEVER THE TANK IS A 17 GAL TANK. ALSO WHEN FILL THE GAUGE SHOWS I SHOULD GET ABOUT 380 MILES BUT I ONLY GET ABOUT 280.  I HAVE SEEN ON OTHER FORUMS THIS SEEMS TO BE A PROBLEM WITH EVEN 2015 VEHICLES AS WELL.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "01/10/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862584,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 50 MPH IN THE SNOW, THE CONTACT ACTIVATED THE FRONT WINDSHIELD WIPERS. SNOW BEGAN TO ACCUMULATE AT THE BASE OF THE WINDSHIELD WIPERS, WHICH PREVENTED THE WINDSHIELD WIPERS FROM GOING DOWN. AS A RESULT, THE WIPERS BECAME INOPERABLE. THE FAILURE RECURRED THREE TIMES. THE DEALER DIAGNOSED THAT THE WINDSHIELD WIPERS WERE FUNCTIONING AS DESIGNED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "KM8SRDHF3GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853568,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SUNROOF ON MY 2016 SANTA FE I BOUGHT IN JAN 2016 THAT HAS APPROX. 8000 MILES, EXPLODED ON THE WAY TO WORK WHILE DRIVING ON THE INTERSTATE. IT SOUNDED LIKE A GUN SHOT IN MY RIGHT EAR, THEN GLASS BEGAN TO FALL ON MY HEAD AND THROUGHOUT THE CAR - I'M SURE THE MAJORITY OF IT WAS SUCKED OUT AND ONTO THE INTERSTATE. (I HAD THE SUN SHADE INSIDE OPENED SO MY CHILD COULD WATCH THE RAIN ON THE RIDE TO THE BABYSITTERS.)I FOUND OTHERS WITH THE SAME PROBLEM WHEN I GOOGLED IT. CAR WAS TOWED TO DEALERSHIP AND ISSUE WOULD BE COVERED UNDER WARRANTY I WAS TOLD, I WAS GIVEN A LOANER WHILE IT WAS FIXED. NO OTHER VEHICLES IN FRONT OF OR BEHIND ME WITHIN 4 CAR LENGTHS AT LEAST. I DID NOT PASS UNDER AN OVERPASS. IT WAS RAINING THAT DAY (OF COURSE - THAT'S MY LUCK) WHEN I GOT TO WORK I CLOSED THE SUN SHADE ON THE INSIDE AS BEST AS I COULD WITH ALL THE GLASS THAT WAS IN THE TRACK, AND TAPED GARBAGE BAGS OVER IT TO PRESERVE THE INSIDE. I WENT TO DEALERSHIP LATER TO TAKE ADDITIONAL PICTURES AND YOU CAN TELL THE GLASS WAS BLOW OUTWARDS. THERE WAS EVEN CHIPS IN THE PAINT THROUGH THE CLEAR COAT FROM WHEN GLASS FLEW. I'M THANKFUL I WAS THE ONLY ONE IN THE CAR AT THE TIME, BUT MY CHILD'S CAR SEAT IS FULL OF GLASS REMAINS. I WASN'T HURT - ONLY A FEW CUTS FROM GLASS THAT WAS IN MY JACKET POCKET AND IN MY CLOTHES. I AM STILL AT A LOSS AS TO WHAT HAPPENED, HOW AND WHY - UNKNOWN. AND SO FAR THE DEALERSHIP HAS NOT COMMUNICATED ANYTHING TO ME, BUT I HOPE THEY MAKE IT RIGHT.",
        "vin": "5XYZW4LA5GG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852291,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUV 2016 COME EQUIPPED WITH CONTINENTAL 235/55 R19 TIERS, THE SUV HAS ONLY 3400 MILES ON IT SINCE PURCHASE, I LOST TWO TIERS ON A BLOW OUT AT LOW SPEED 35 TO 40 MPH, SIDE WALLS FAILED, (IT WAS ON A STREET) I VISUALLY INSPECTED THE TIRES MYSELF AND AGREED WITH THE TIRE DISTRIBUTOR.",
        "vin": "5XYZW4LAXGG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "06/30/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850507,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S STEERING REQUIRES CONSTANT CORRECTION. VEHICLE WILL NOT TRACK STRAIGHT. VERY DIFFICULT TO KEEP VEHICLE IN A LANE, SOMETIMES ALMOST IMPOSSIBLE. NOT A PROBLEM FOR IN-TOWN DRIVING, BUT A MAJOR PROBLEM ON HIGHWAYS. PROBLEM GETS EXPONENTIALLY WORSE AS SPEEDS INCREASE, ESPECIALLY ON I-45 AND I-130 IN CENTRAL TEXAS WHERE SPEEDS ARE 80+. WINDY CONDITIONS MAGNIFY THE PROBLEM. VEHICLE IS ESSENTIALLY WEAVING DOWN THE ROAD. VERY DANGEROUS SINCE VEHICLE IS ALWAYS HEADING TOWARD CENTERLINE OR SHOULDER. THERE IS SOMETHING SERIOUSLY WRONG WITH THE DESIGN OF THE STEERING ON THIS VEHICLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "02/24/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838069,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE WAS PARKED,WHEN SHIFTING INTO REVERSE, THE TRANSMISSION WENT INTO DRIVE.  IT WOULD NOT GO INTO REVERSE.  THE ONLY WAY TO RESET IT WAS TO TURN OFF ENGINE AND RESTART THE ENGINE.",
        "vin": "5XYZUDLBXGG"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820369,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. THE CONTACT STATED THAT WATER LEAKED THROUGH THE WINDSHIELD ONTO THE DASHBOARD OF THE VEHICLE. IN ADDITION, IN COLD TEMPERATURES, ICE ACCUMULATED INSIDE THE WINDSHIELD. ON HOT AND HUMID DAYS, CONDENSATION WAS VISIBLE INSIDE THE WINDSHIELD OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE WAS UNABLE TO BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 900.....UPDATED 02/10/16 *BF  ...VIDEO AVAILABLE     *CN",
        "vin": "5XYZWDLA4GG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2015",
        "dateOfIncident": "12/09/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809600,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PANORAMIC SUNROOF SPONTANEOUSLY SHATTERED WHILE DRIVING AT NIGHT ON THE HIGHWAY AT ABOUT 70MPH - THE SOUND WAS LIKE A GUNSHOT INSIDE THE CAR - THIS IS A SANTA FE SPORT 2016 MODEL THAT I BOUGHT ON JULY 5 2015",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/23/2015",
        "dateOfIncident": "09/19/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785665,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. WHILE DRIVING AT VARIOUS SPEEDS, THERE WAS AN ABNORMAL NOISE COMING FROM THE REAR PASSENGER SIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHO STATED THAT ALL THE SCREWS IN THE REAR PASSENGER SIDE SEAT NEEDED TO BE TIGHTENED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 17.",
        "vin": "5XYZUDLB1GG"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779741,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 HYUNDAI SANTA FE. WHILE DRIVING AT APPROXIMATELY 40 MPH, THE SUN ROOF EXPLODED. THE CONTACT HAD TWO MINORS SEATED IN THE REAR AND GLASS PARTICLES FELL ON THEM; HOWEVER, THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED, BUT THE REPAIRS WERE UNKNOWN. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 4,500.",
        "vin": "5XYZU3LB5GG"
    }
]