[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "03/29/2018",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099066,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "NINJA ZX-10R",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KAWASAKI NINJA ZX-10R. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V089000 (POWER TRAIN); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO XTREME MACHINES (700 NJ-33, MILLSTONE, NJ 08535, (732) 786-9696), BUT THE PART WAS UNAVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JKAZXCS14GA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "03/14/2018",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079494,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "NINJA ZX-10R",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTORCYCLE DEALER WHERE I PURCHASED THE VEHICLE FROM WAS UNABLE TO PROPERLY INSTALL THE \"RECALL KIT\" PROVIDED BY THE MANUFACTURE.  PER THE RECALL, SPECIFIC TRANSMISSION GEARS WERE TO BE REPLACED WITH GEARS FABRICATED USING A STRONGER MATERIAL.    THIS RECALL REPAIR PROCESS WAS COMPLETED, AND UPON DELIVERY OF THE REPAIRED VEHICLE AND IMMEDIATE SUBSEQUENT TEST RIDE ON A STRAIGHT LINE CITY STREET BY THE OWNER IT WAS DETERMINED THAT THE REPAIR WAS FOULED.  THE TRANSMISSION FAILED TO SHIFT PROPERLY LEAVING THE TRANSMISSION \"IN BETWEEN\" GEARS, RESULTING IN A FALSE NEUTRAL THROUGH GEARS 2, 3, 4, AND 5 (6TH GEAR WAS NOT TESTED).    VIDEO OF THE TEST RIDE IS AVAILABLE UPON REQUEST.",
        "vin": "JKAZXCS14GA"
    }
]