[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064968,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KEYSTONE OUTBACK. WHILE THE VEHICLE WAS UNDERGOING A MANDATORY INSPECTION, THE CONTACT WAS INFORMED THAT THERE WAS A DIP IN THE ROOF NEAR THE AIR CONDITIONING UNIT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED ORE REPAIRED. THE MANUFACTURER WAS NOTIFIED AND OPENED CASE NUMBER: [XXX]. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 1,694. *TT      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4YDT27624GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "09/10/2015",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872847,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYSTONE RV AND DUTCHMAN RV OF GOSHEN, IN ARE MANUFACTURING DEFECTIVE UNITS AND REFUSE TO REPLACE THE EXTERIOR SIDE PANELS OF THE UNIT WHICH ARE CRACKING IN HALF.  THE RV HAS 5 CRACKS IN THE FRP AND GELCOAT OF THE UNIT CAUSING THE BODY OF THE UNIT TO CRACK APART. THE MORE WE HAUL IT DOWN THE ROAD THE MORE CRACKS APPEAR. THE PROBLEM IS THAT THE LUAN PANELS, WHICH WERE INSTALLED BY THE FACTORY WERE NOT INSTALLED PROPERLY LEAVING AN INCH GAP BETWEEN EACH ONE THEREFORE THE FRP HAS NOTHING TO ADHERE TO, CAUSING THE UNIT TO CRACK APART ON BOTH SIDES. THE GEL COAT IS CRACKED AS WELL AS THE FRP ON THE EXTERIOR, WHO KNOWS WHAT IS HAPPENING TO THE INTERIOR. I HAVE BEEN TALKING TO THE WARRANTY COMPANY SINCE SEPTEMBER 2015 WITH NO HELP FROM THEM JUST GETTING THE RUN AROUND. THE WARRANTY COMPANY WANTS TO REPAIR THE UNIT, WHICH HAS BEEN PREVIOUSLY REPAIRED AND THE REPAIR DID NOT WORK. THE SIDE PANELS NEED TO BE REPLACED. WE WERE DEFINITELY SOLD A DEFECTIVE UNIT AND SOMEONE KNOWS WE WERE AS REPAIRS WERE ALREADY DONE AND NOTHING WAS DIVULGED TO US. WE BOUGHT THIS UNIT IN JUNE OF 2015 AND WE WERE TOLD IT WAS BRAND NEW.  IT IS JUST A MATTER OF TIME BEFORE THIS UNIT CRACKS APART ON THE HIGHWAY AND CAUSES AN ACCIDENT. IT IS LITERALLY CRACKING IN HALF ON BOTH SIDES OF THE UNIT. THERE ARE 5 CRACKS IN ALL.",
        "vin": "GB450304"
    }
]