[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458426,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I have already repaired the paint job on the hood if the van since then it's falling off in random places.",
        "vin": "KNDMC5C12G6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455171,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the road and my van made a horrible noise and stopped moving. I was able to coast to a right turn lane to get out of traffic where I realized all of the oil was on the ground under my van. After towing it to the dealer they confirmed that a rod went through the oil pan for no apparent reason. They confirmed that there was oil in the van as it was all over the engine. The check engine light never came on and the van was running perfectly fine until this happened.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2022",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454730,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Kia Sedona. The contact stated while driving 35 MPH, there was an abnormal rattling sound coming from the engine. There was no warning light illuminated. The vehicle was taken to an independent mechanic and was then towed the following day to the dealer. The contact was informed by the mechanic that gasoline was leaking into the and mixing with the engine oil. Additionally, the plastic piece around the timing belt was cracked. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 60,000.",
        "vin": "KNDMB5C1XG6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/19/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453788,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving I smelled a burning odor.  Then my heat started blowing cold air.  I immediately went to a car shop and when they opened the hood, there was white smoke.  After getting 3 separate opinions, all agreed that the engine was fried and needs to be replaced.  There were no warning signs, lights, etc... and this could have been a very dangerous situation if I had driven it much further because the engine could have seized up (with my 4 young kids in the car), or even possibly caught fire.",
        "vin": "KNDMB5C16G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452946,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "we received notice for safety recall that the tail lights and turn signal lights could fail and they needed to change something to do with computer.we took it in and left with lights working and 3days later they stopped working again.Kia is refusing to fix it on the recall but it is the same issue.",
        "vin": "KNDMC5C13G6"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452442,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Lower brake lights not functioning. Fuse is fine (swapped with good fuse, no change). Bulbs are fine (replaced with new anyway). Top brake light bar is fine. Only L and R rear brake lights not coming on. Dealer in Anchorage, Alaska confirmed all. No warning lamps came on. Car operates fine otherwise.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/31/2022",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449510,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The Airbag seat sensor has malfunctioned.  Took the vehicle to the Kia Dealer and they advised it was a 1200.00 part plus 300 plus for labor. This started months ago and the dealer stated it was covered and they \"ordered\" the part. They then stated my extended warranty would cover it only to be told it doesn't cover these items.  When I took the vehicle back to the dealer they said it was not covered. The airbag light is intermittent when it comes on. I am afraid this will cause a problem if I am involved in an accident. This started around 70k miles.",
        "vin": "kndmc5c15g6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449171,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Oil sending unit failed after 100k miles.  Had it not been a quick trip, I could have easily ran it dry and stalled the motor.  No warning was given.  There are many reports of this happening with other models and years of Kia V6's.",
        "vin": "KNDMB5C11G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446461,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Our Kia Sedona van was stolen on the overnight hours of 10/18/2021 from our driveway.  This has been a rampant issue in our area because, it seems, certain model year Kia vehicles have a vulnerability that makes it easy to steal in just a few minutes.  Because of this theft, we were without a secondary vehicle until 11/8/2021 and we had to pay out of pocket for a rental during much of that time (once we realized we couldn't get by with just one vehicle).  In order to minimize our losses, we purchased a used vehicle with similar mileage and year, but we were still out over $1500 and many hours of our time to deal with all of the issues that arose because of this.  These particular vehicles NEED to be recalled and retrofitted with some sort of security, as thousands of families have had to deal with similar issues as us.",
        "vin": "KNDMB5C14G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/08/2021",
        "dateOfIncident": "11/09/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443162,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Kia Sedona. The contact stated while driving at various speeds, the headlights would turn off without warning. The contact was able to restart the vehicle and the headlights regained functionality however, shortly thereafter the vehicle lost headlight functionality again. The contact stated no warning light was illuminated. The vehicle was not taken to a local dealer to be inspected. The manufacturer was not informed of the failure. The failure mileage was approximately 136,758.",
        "vin": "KNDMB5C14G6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442938,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The airbag light would come on and go off randomly while driving. We took it to the dealer several times. I believe repairs were made twice and within days it happened again. The other times it was taken into the dealer, the problem could not be replicated as the light would randomly come on/blink. The airbag light stays on all the time now. I've been told it is dangerous to drive the vehicle while the light is on because the airbags will not deploy should the vehicle get in an accident. The passenger side seatbelt like blinks constantly now whether there is a passenger in the front seat or not. I've been told by Kia that the warranty has expired and any cost associated with the repair of the airbag and seatbelt sensor will be our responsibility. This was an ongoing problem well before the warranty expired.",
        "vin": "KNDMB5C17G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441559,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear passenger sliding door will open and close on it's own while moving and the only way to close completely is to close from the outside while pushing it closed.  When using the button in the back it will close then open right up again and make a loud noise.  The button above the windshield in from will cause it to close then open back up too while making a loud noise.  It has to be closed from the outside by pushing on the door.  There is nothing obstructing the door either. This VIN number was not part of the recall according to the nhtsa website. This has been ongoing for years, so there is no specific dates",
        "vin": "KNDMC5C13G6"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "09/28/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436724,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "On September 28, 2021 we found out the hard way that our minivan's gear shift could be moved from the parked position to reverse, neutral and forward without having the car turned on and without needing to have a foot pressed on the break. While the car was parked (off) on our home's driveway, my three year old and his brother were in the car getting ready to drive to school and my wife was at the door of our house waiting for our other son to come out. In the interim our three year old son got his hands on the shifter and without much effort was able to move the shifter out if the parked position. As a result the van rolled down the driveway with two of my children in it. The vehicle ended up on the street where there was incoming traffic. If it weren't because the car hit the fence, other cars would probably not have stopped and it could have been a worse incident. I've reported incident to Kia on 9/29/21 and was referred to the corporate department. To date 10/14/21 we have yet to get a resolution from Kia and address the incident. They assigned a representative who has yet to provide any concrete guidance and support. My car is not road safe to drive and now I'm left without a family car and traumatized children from this event. I've tested moving the shift gear myself and indeed it moves without having the car on or pressing the break. There were no warning lamps in the car to alert of an issue. The car is at an autoshop pending Kia's inspection but Kia has yet to inspect the vehicle or provide any guidance other than we may need to take the car to a dealership to check something. Autoshop will not touch the car until Kia's tech inspects it. My auto insurance company's adjuster has documented shift gear issue when conducting visual inspection of damages to the car.",
        "vin": "KNDMC5C11G6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432304,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My husband took the car for an oil change and the mechanic said he heard a noise in the engine.  They did the oil change and advised to have it checked out.  On the way home, while driving, the car stalled, thankfully in the neighborhood and not on the highway.  An issue with the battery or oil change were suspected.  We had the car towed to Kia who confirmed that there was no issue with the oil change, the location used for the oil change had done everything correctly.  Also, the battery was good.  They said the engine seized but could not say why, that we would have to pay them $900 to take the engine apart to find the issue.  After research, the very same issues are found with several other Kia and Hyundai models, for example, Kia Sorento.  I would like to report this, as it is extremely dangerous to stall in traffic.  Also, we still owe $8,000 on the car, we bough it used in February 2020.  The car has 118k miles.",
        "vin": "KNDMB5C15G6"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427537,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The mud flaps on both front wheels they are starting to pop out and they rub against the tire i hear it really loud when I turn.",
        "vin": "KNDMB5C11G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427538,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "There are two issues I believe both are connected.   Number 1. Sometimes when I put on the left blinker either nothing happens at all or the wrong blinker (right side) will go on instead of the left.   Number 2. Sometimes when I put on my left blinker the headlights will turn off. It can be really scary when this happens on a dark highway at night.",
        "vin": "KNDMB5C11G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/22/2021",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425932,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The problem is the multi function switch. In the AUTO mode, the head lights go off randomly. This is a super dangerous at night. Also, when the left turn signal is activated, sometimes the flasher doesn't work and you have to jiggle it or turn it off and on again and sometimes the right flasher goes on. The dealer service could not confirm the problem and did nothing. These problems happen at random times and have been ongoing for about 18 months.",
        "vin": "KNDMB5C14G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424914,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Malfunctioning indicator stalk/switch. Left blinker either won't function or will cause right blinker to indicate. Dangerous because creates confusion to other drivers and is a distraction.",
        "vin": "KNDMC5C17G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424602,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The passenger-side door from day one of purchasing the kia sedon LX doesn't shut properly. When using the button to close the door, the door will shut and then slightly ajar. The car dash will then tell me that not all doors are secure. I have contacted KIA several times. They have replaced the motor first and this didn't fix the issue so they replaced the latches. This also didn't fix the issue. Unless I turn off the power doors and manually shut the doors myself the problem still persists.",
        "vin": "KNDMB5C18G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423537,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Frequently, the turn signal will blink on the right when the turn signal switch is set to the left.  This is a safety concern for myself and other drivers as they will expect the vehicle to go to the right when it is actually going to the left.  I had this repaired at a dealership.  This had been an issue for about a year, when I finally had it repaired.",
        "vin": "KNDMB5C18G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422815,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Kia Sedona. The contact stated while driving at low speeds, while stopped at a traffic light, the vehicle stalled without warning. The vehicle was taken to the local dealer to be diagnosed. The contact was informed that the battery post shim needed to be replaced. The vehicle was repaired however, the failure recurred. The manufacturer was notified of the failure. The failure mileage was approximately 150,000.",
        "vin": "KNDMA5C1XG6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421640,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Door grinds and will not shut properly. Gadgets say it’s shut but then once driving it beeps and does not turn off until you stop. So I do not know whether it is actually shut or not.   Many forums say this is a known issue with Kia cars.",
        "vin": "Kndmc5c10g6"
    },
    {
        "components": "ENGINE,FIRERELATED",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/16/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421653,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2016 Kia Sedona. The contact stated that while driving at an undisclosed speed, he felt the vehicle was bumping and thought there was a flat tire. The ESP fault and low tire pressure warning lights were illuminated. The contact pulled over and turned off the vehicle to check the rear passenger tire. While the contact was on the phone with roadside assistance, he noticed there was smoke coming from under the hood then there were flames coming from under the hood. A police report was filed. No medical attention was received. The contact was unaware if the fire department extinguished the fire since he got transported by a bystander to her residence nearby. The vehicle was towed to a towing lot. The manufacturer was made aware of the failure. The failure mileage was 32,000.",
        "vin": " KNDMC5C1XG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "05/27/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Kia Sedona. The contact stated that while driving at approximately 55 mph and while making a left turn, the vehicle made slight contact with a second vehicle. While viewing the second vehicle's video dashcam it was discovered that the driver's side rear signal light did not illuminate. Upon inspection, the contact discovered that water had leaked into the rear light housing and the bulb was submerged in water causing the bulb to become inoperable. The cause of the failure was not determined. The manufacturer was notified of the failure. The local dealer was not contacted. During the crash, no injuries were reported and a police report was taken at the scene. The VIN was not available. The failure mileage was 104,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412939,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN LIGHTS AND STICK SIGNALS MOST THE TIME DO NOT WORK APPROPRIATELY I TURN ON TO THE LEFT AND THE RIGHT SIDE COME ON SOME TIMES NOTHING HAPPENS SOME TIMES I TRY TO USE TO DE LEFT AND THE FOURTH WAY HAZARD COME ON. I REALLY SCARE TO HAVE A CRASH BECAUSE I SEND THE WRONG SIGNAL OR GET A TICKET",
        "vin": "KNDMB5C18G6"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2021",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408604,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SLIDING DOOR DOES NOT CLOSE COMPLETELY. MUST PUSH ON BACK SIDE FOR IT TO CLOSE. BLINKERS DON'T WORK PROPERLY. PUT ON LEFT BLINKER AND RIGHT BLINKER TURNS ON. OCCASIONALLY IT WILL WORK CORRECTLY. I HAD THE DOOR RECALL FIXED AND THE SERVICE PERSON THOUGHT IT WOULD FIX ALL THE PROBLEMS BUT IT DID NOT. THEN A FEW MONTHS LATER THE BRAKE LIGHTS STOPPED WORKING. ONLY THE TOP BRAKE LIGHT WORKS ON THE WINDOW.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405459,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT TURN SIGNAL FAILS TO ACTIVATE.  LEFT TURN SIGNAL ACTIVES RIGHT TURN INDICATOR.  LEFT TURN SIGNAL STARTS TO ACTIVATE THEN FAILS.  THIS IS VERY DANGEROUS IN HEAVY DRIVING CONDITIONS WITH NOT BEING ABLE TO INDICATE TURNING INTENTION.  VEHICLE IN MOTION, ALL SPEEDS.  VEHICLE STOPPED STATIONARY.  ALL DRIVING CONDITIONS.  ONGOING.  STARTED 18 MONTHS AGO, INTERMITTENTLY.  NOW PERMANENT.",
        "vin": "KNDMB5C17G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404698,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 1917 THE POWER SLIDING DOORS STOPPED WORKING CORRECTLY. THE DOORS MAKE A LOUD SCREACHING SOUND WHEN CLOSING WHEN STOPPED. & IN MOTION. DOORS DO NOT CLOSE AND LOCK COMPLETELY AND HAVE TO BE CLOSE BY PUSHING IN THE BACK WHERE AND FRAM MEETS. GOT A RECALL ON SLIDING DOORS. WENT 3/22/21 AND ALL THAT WAS DONE WAS TO REPROGRAM THE COMPUTER. THIS DIDN T FIX THE PROBLEM AT ALL. CALL KIA AND WAS TOLD , HAVE TO FIX ON OWN. DID CALL ABOUT ISSUE IN 2017 TOLD IT WOULD COST OVER $1000.00,  COULDN'T AFFORD. ALSO ASKED ABOUT WHY AIR BAG LIGHT COMES ON AND STAYS ON AND THAT THE GAS DOOR BUTTON DOESN T OPEN. HAVE TO GET OUT AND HIT GAS DOOR TO OPEN. THOUGHT THAT 100000 WARRENTY WAS TO COVER ANYTHING BUMPER TO BUMPER. WHY PAY THE EXTRA FOR NOTHING.",
        "vin": "KNDMB5C16G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403482,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SIGNALING LEFT SOMETIMES THE RIGHT BLINKER COMES ON IF AT ALL. TO MAKE IT SIGNAL LEFT YOU HAVE TO PUSH THE LEVER HARD DOWN TO GO LEFT. THERE ARE TIMES WHEN THE SIGNAL WILL GO FAST THEN NORMAL. THIS ALL HAPPENS WHEN COMING TO A TURN OR STATIONARY. IN ALL WEATHER. THIS HAS BEEN HAPPENING SINCE OCTOBER 2020.",
        "vin": "KNDMC5C10G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403486,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT TIMES WHEN DRIVING WITH HEADLIGHTS ON THE DRIVERSIDE TAILLIGHT WILL GO OUT AND WILL CAUSE THE MIDDLE AND PASSENGER BRAKE LIGHT TO STAY ON. IF I TURN THE HEADLIGHTS OFF THE MIDDLE AND PASSENGER TAILLIGHTS WORK ONLY WHEN PRESSING THE BRAKE PEDDLE.I HAVE REMOVED THE TAIL LIGHT AND CHECKED IT FOR BEING BURNED OUT, CORROSION OR BEING LOOSE AND IT IS FINE. I PUT THE BULB BACK IN AND THE DRIVERS SIDE TAILLIGHT WORKS FINE AND THE BRAKE LIGHTS WORK AS NORMAL. THIS HAPPENED A SECOND TIME AND I CHECKED THE BULB. AGAIN NOTHING WAS WRONG WITH IT. I CHANGED THE BULB WITH A NEW ONE. THIS IS ACTUALLY THE SECOND NEW BULB IN THAT SOCKET. THIS HAPPENS WHILE DRIVING OR STANDING STILL WHILE HEADLIGHTS AND TAIL LIGHTS ARE ON. THIS STARTED HAPPENING IN DECEMBER 2020. IT IS WORRISOME AS YOU ARE DRIVING WITH NO BRAKE LIGHTS WORKING IF YOU HAVE YOUR HEADLIGHTS ON WHEN IT RAINS DURING THE DAY OR WHILE DRIVING AT NIGHT AND THE ONLY WAY YOU WILL KNOW IT'S HAPPENING IS IF YOU HAPPEN TO GET OUT OF YOUR CAR WHILE THE HEADLIGHTS ARE TURNED ON.",
        "vin": "KNDMC5C10G6"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388384,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER SIDE AIRBAG SENSOR IS MALFUNCTIONING.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "12/25/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384972,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU USE YOUR BLINKERS TO CHANGE LANES AT NIGHT THE HEADLIGHTS GO OFF TILL I MOVE THE BLINKER NOB BACK TO THE MIDDLE   THIS HAPPENS WHEN YOU ARE GOING DOWN THE ROAD AND IS DANGEROUS NEEDS TO RECALLED ASAP BEFORE SOMEONE GET HURT",
        "vin": "KNDMB5C19G6"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/22/2020",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384632,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 2 YEARS AGO, I BEGAN EXPERIENCING OCCASIONAL TIMES WHEN I WOULD TURN ON THE LEFT TURN SIGNAL AND THE RIGHT TURN SIGNAL WOULD COME ON. THE FIRST FEW TIMES IT HAPPENED, I THOUGHT I MUST'VE TURNED ON THE WRONG SIGNAL AS IT HAPPENED INFREQUENTLY. NOW IT OCCURS OFTEN, WHERE ENGAGING THE LEFT TURN SIGNAL IS VERY UNPREDICTABLE, WITH IT SOMETIMES TURNING ON THE LEFT SIGNAL, SOMETIMES THE RIGHT SIGNAL, SWITCHING BACK AND FORTH BETWEEN THE SIGNALS, OR NO SIGNAL ENGAGING. WHEN ENGAGING THE LEFT TURN SIGNAL AND COMPLETING A LEFT TURN, WHEN THE SIGNAL DISENGAGES, THE RIGHT SIGNAL WILL TURN ON AND FLASH SEVERAL TIMES WITHOUT TURNING ON THE RIGHT SIGNAL. THIS MAKES FOR DANGEROUS LANE CHANGING AND TURNING AS IT IS DIFFICULT TO MAKE SURE THE RIGHT SIGNAL TURNS ON. ADDITIONALLY, THE PASSENGER AIR BAG LIGHT COMES ON FREQUENTLY WHEN AN ADULT IS SEATED IN THE PASSENGER SEAT, AS IF THE VEHICLE THINKS A CHILD IS SEATED IN THE PASSENGER SEAT AND THE AIR BAG WOULD NOT DEPLOY IN A CRASH. I BROUGHT THE VEHICLE TO KIA TO HAVE THEM FIX THIS, BUT THEY SAID THE VEHICLE WAS OUT OF WARRANTY EVEN THOUGH IT WAS 3 YEARS OLD, AND WANTED HUNDREDS OF DOLLARS TO EVEN LOOK AT IT, NOT INCLUDING FIXING THE PROBLEM. I HAVE SEEN SEVERAL OTHER COMPLAINTS REGARDING THE TURN SIGNALS IN THIS MAKE/MODEL AND YEAR, PARTICULARLY WITH THE LEFT TURN SIGNAL. HERE IS A LINK TO A YOUTUBE VIDEO OF ANOTHER KIA WITH THE SAME PROBLEM: HTTPS://YOUTU.BE/IDXLNMXMHQY  HERE IS A LINK TO A PAGE WHERE OTHERS HAVE COMPLAINED OF THE SAME PROBLEM: HTTPS://WWW.CARPROBLEMZOO.COM/KIAMOTOR/SEDONA/TURN-SIGNAL-PROBLEMS.PHP  THIS IS AN ONGOING PROBLEM.",
        "vin": "KNDMA5C17G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378631,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WHEN I USE MY TURN SIGNALS THE HEADLIGHTS WILL EITHER FLASH HIGH BEAMS OR COMPLETELY GO OUT THEN BACK ON.   ALSO MY DRIVER'S SIDE SLIDING DOOR DOESN'T SHUT COMPLETELY WITH THE POWER DOOR OPTION THIS JUST STARTED AROUND THE 100K MILE MARK.",
        "vin": "KNDMB5C12G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377600,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DAYTIME AND HEADLIGHTS LIGHTS WILL TURN OFF RANDOMLY. (STARTED AROUND THE 100K MILEAGE).    WHEN STATIONARY, THE SLIDING DOORS DO NOT SHUT CORRECTLY.  1ST THE DRIVER'S SIDE DOOR BEGINS RATTLING LIKE CHANGE IS INSIDE THE DOOR. 2ND THEN THE DOOR BEGINS TAKING 2 TURNS TO CLOSE, AND THEN IT IS HIT OR MISS WHEN CLOSING. THE DOOR CLOSURE BUTTON WILL OCCASIONALLY NOT WORK, REGARDLESS OF WHETHER THE CAR IS OFF AND PARKED. (STARTED AROUND THE 45000 MILEAGE).    THE DRIVER'S SIDE SEAT BELT CONNECTOR OCCASIONALLY INDICATES A FAULT ERROR. ALSO THE PASSENGER SIDE SEAT BELT INDICATOR WILL TURN ON WHEN 5 POUNDS OR LESS IS IN THE PASSENGER SEAT. (STARTED AROUND THE 100K MILEAGE).    MY BIGGEST CONCERN: SINCE I BELIEVE THE SIDE DOORS ARE FATAL ACCIDENTS WAITING TO HAPPEN, I HAVE MY KIDS SIT IN THE 3RD ROW. ONLY ADULTS ARE ALLOWED TO SIT IN MY PASSENGER CAPTAIN CHAIRS.     THE BLIND SPOT WARNING DOES NOT WORK CONSISTENTLY.",
        "vin": "KNDMC5C14G6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2020",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365719,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SEDONA. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE FAILED TO ACCELERATE WITH AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED AND DETERMINED THAT THE ENGINE MOUNTS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. RIVERCHASE KIA (2200 US-31, PELHAM, AL 35124, (205)987-6518) WAS CONTACTED HOWEVER, INDICATED TO THE CONTACT THAT THE DEALER WOULD NOT HONOR WARRANTY REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT UNDER RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 88,000.",
        "vin": "KNDMB5C12G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/12/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354533,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING TURN SIGNAL SOME TIMES IT DOESN'T TURN ON AND YOU HAVE TO PUSH THE STALK DOWN AGAIN TO TURN IT ON. OR SOMETIMES IT FLASHES FAST THAN TURNS BACK TO NORMAL. THIS HAPPENS AT COMING TO INTERSECTION MOVING OR STANDING STILL. ALSO NOTICED WATER IS ENTERING BOTH HOUSING FOR REAR LIGHTS. BUT THAT SHOULDN'T INTERFERE WITH ACTIVATING THE BLINKERS. MAYBE JUST THE REAR NOT THE WHOLE SYSTEM.",
        "vin": "KNDMC5C10G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353744,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN AN UNLIT ROAD BY HAROLD PARKER STATE FOREST, IN MASSACHUSETTS.  MY LOW BEAM HEAD LIGHTS SUDDENLY WENT OUT ( STOPPED WORKING ) AND NEVER CAME BACK ON. I USED MY HIGH BEAMS TO MAKE MY WAY HOME, MUCH TO THE DISMAY OF ON COMING TRAFFIC. I WENT TO THE LOCAL AUTO PARTS STORE THINK THAT THE BULBS BURNT OUT, BUT THAT IS NOT THE CASE. I TESTED THE FUSE AND RELAY AND EVERYTHING SEEMS FIND, SO NOW I AM MAKING AN APPOINTMENT WITH THE LOCAL KIA DEALER TO INVESTIGATE.  MY WIFE INFORMED ME THAT IS HAD HAPPENED TO HER EARLIER THE SAME WEEK, BUT SHE THOUGHT IT WAS JUST HER EYES. THIS WAS A MAJOR PROBLEM GIVEN THE TIME OF NIGHT, THE INABILITY TO SEE WITHOUT BLINDING ON COMING TRAFFIC. I DID SOME LOOKING INTO THIS MATTER AND FOUND A LOT OF THE SAME COMPLAINTS ON THE WEB. PLEASE LOOK INTO THIS MATTER BEFORE SOMEONE GET INJURED OR WORSE, KILLED.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351752,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE SLIDER DOOR HAS OPENED WHILE DRIVING, ENOUGH TO TURN ON INTERIOR LIGHTS AND CAN HEAR WIND NOISE TOWARD BACK OF DOOR.  DASH INDICATION ALSO SHOWS OPEN.",
        "vin": "KNDMC5C10G6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348694,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BEFORE STARTING THE CAR. THE SLIDING DRIVERS SIDE DOOR CONTINUOUSLY WILL MAKE A GRINDING SOUND WHEN CLOSING AND THEN NOT LATCH. AFTER THIS THE ONLY WAY TO OPEN THE DOOR IS WITH THE BUTTON ON THE CEILING. I AM NOT ABLE TO OPEN THE DOOR MANUALLY. IT NOW HAPPENS EVERYTIME I CLOSE THE DOOR. I CAN SUBMIT A VIDEO.",
        "vin": "KNDMB5C11G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344068,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER SLIDING DOORS WON'T LATCH AND ITS MOSTLY THE DRIVER SIDE. IT HAPPENS WHETHER WE ARE DRIVING OR PARKED.",
        "vin": "KNDMB5C1XG6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342930,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNAL INDICATOR RANDOMLY FAILS TO ACTIVE THE LEFT TURN SIGNAL.  WHEN SIGNALING RIGHT IT ALWAYS WORKS, WHEN SIGNALING LEFT IT IS HIT OR MISS.    IT HAS BECOME MORE OFTEN OVER THE LAST YEAR.    THIS CREATES PROBLEM WHEN I SIGNAL LEFT AND START TO MOVE THEN REALIZE THE LEFT SIGNAL DID NOT COME ON I HAVE HAD TO JERK BACK INTO LANE TO AVOID ACCIDENT.",
        "vin": "KNDMC5C1XG6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343028,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FEMALE PLUG ON THE AC PIGTAIL SWITCH THAT WORKS THE FRONT A/C FAN WAS DEFECTIVE.  I REPLACED THE PLUG AND THE PIGTAIL.  I THINK YOU NEED TO KNOW THAT THE FEMALE PLUG WAS SHORTED OUT AND BURNED. IT WAS LIKE THIS WHEN I PURCHASED THE VEHICLE 07072020.  THE UNSAFE CONDITION WAS THE BURNED FEMALE PLUG WHICH COULD HAVE  RESULTED IN A DASH FIRE.",
        "vin": "KNDMB5C16G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341108,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE AUTOMATIC SLIDING DOOR MOTOR SEEMS TO BE FAILING AND WILL NOT LATCH COMPLETELY WHICH CAUSES THE DOOR NOT TO CLOSE ALL THE WAY.",
        "vin": "KNDMB5C19G6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "07/17/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341109,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE DOOR DOES NOT CLOSE ALL THE WAY AND MAKES A LOUD NOISE. WE BROUGHT IT IN FOR THIS BEFORE ABOUT 3 MONTHIS AGO AND IT STARTED DOING THE SAME THING AGAIN. I HAVE READ MANY COMPLAINTS ABOUT THIS. THE DOOR IS NOT OVER USED. NOW THE VEHICLE HAS 43000 MILES ON IT AND IT IS OUT OF WARRANTY.  WE HAVE 4 CHILDREN AND ARE AFRAID FOR THEIR SAFTEY WITH A DOOR THAT DOES NOT CLOSE ALL THE WAY. I FEEL IF IT WAS FIXED RIGHT THE FIRST TIME THERE WOULDN'T BE A REOCCURRING ISSUE. THANK YOU.",
        "vin": "KNDMB5C15G6"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338848,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT IS ON, HAD PLUGS REPLACED AND INJECTOR 6 REPLACED THE CODES READ P0278 AND P0306. P0278 STILL COMES ON. THE SLIDING DOORS DO NOT LATCH, HAVE TO GET OUT OF THE VAN AND CLOSE THEM. IT ONLY HAS 83,500 MILES, ALSO LEFT TURN SIGNAL DOESN'T WORK PROPERLY.",
        "vin": "KNDMB5C18G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338191,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS. FLICKR AND ONE WILL GO OUT AND SOMETIMES THE OTHER WILL GO OUT AND HAVE GONE OUT TOGETHER WHILE DRIVING WITH OUT ANY WARNING. AFTER LOOKING THIS ISSUE UP ONLINE IT APPEARS THAT THERE ARE MANY OTHER 2016 KIA SEDONA'S HAVING EXACT SAME ISSUE ALONG WITH OTHER KIA MAKE AND MODELSAFTER LOOKING THIS ISSUE UP ONLINE IT APPEARS THAT THERE ARE MANY OTHER 2016 KIA SEDONA'S HAVING EXACT SAME ISSUE ALONG WITH OTHER KIA MAKE AND MODEL. I WOULD HAVE ALSO COVERED THIS STORY YET THERE HAS BEEN NO RECALLS I HAVE CALLED MY LOCAL KIA DEALER THEY HAVE ALSO HAD CUSTOMERS DEAL WITH THIS ISSUE.I HAVE CALLED MY LOCAL KIA DEALER THEY HAVE ALSO HAD CUSTOMERS DEAL WITH THIS ISSUE AND I CONTACTED KIA MANUFACTURED YESTERDAY FOR THEM TO TELL ME THEY HAVE NO RECALL AT THIS TIME THEY ARE NOT THE ONES THAT INITIATES RECALLED THAT GOES THROUGH NHTSA SO HERE I AM. THIS IS MOST DEFINITELY A SAFETY ISSUE AND NEEDS TO BE RESOLVED. I CAN'T BELIEVE PEOPLE HAVE BEEN HAVING THIS ISSUE FOR OVER TWO YEARS AND THERE STILL IS NO RECALL.I CAN'T BELIEVE PEOPLE HAVE BEEN HAVING THIS ISSUE FOR OVER TWO YEARS AND THERE STILL IS NO RECALL.  HERE IS LINKS TO SOME OF THE PEOPLE HAVING THE SAME ISSUES.     HTTPS://WWW.CARPROBLEMZOO.COM/KIAMOTOR/SEDONA/HEADLIGHTS-PROBLEMS.PHP    HTTPS://WWW.WCPO.COM/MONEY/CONSUMER/DONT-WASTE-YOUR-MONEY/SOME-KIA-OWNERS-REPORT-HAUNTED-HEADLIGHTS",
        "vin": "KNDMC5C12G6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323642,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WASN'T GETTING MUCH POWER THEN CAR STOPPED IN THE MIDDLE OF THE STREET I HAD THIS ISSUE PREVIOUSLY AND KIA SAID IT WAS MY FAULT AND I DIDN'T PUT OIL WOULD NOT REPAIR SO I FIXED MYSELF NOW THE SAME EXACT THING IS HAPPENING.  *TR",
        "vin": "KNDMB5C16G6"
    },
    {
        "components": "STRUCTURE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "06/13/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322039,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE CAUGHT ON FIRE WHILE PARKED IN THE DRIVEWAY AND BURNED TO THE GROUND. WE CONTACTED KIA MOTORS REGARDING THIS. IT TOOK THEM WEEKS BEFORE THEY SENT OUT A REPRESENTATIVE TO INSPECT THE VEHICLE. UPON INCEPTION OF THE VEHICLE THEY SIMPLY DENIED THAT THE ENGINE FIRE WAS CAUSED BY FAULTY PARTS AND DECLINED RESPONSIBLY FOR THE IT!",
        "vin": "KNDMB5C1XG6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319125,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT TURN SIGNAL MALFUNCTIONS. WHEN TURNING ON THE LEFT TURN SIGNAL, IT INTERMITTENTLY TURNS ON THE RIGHT TURN SIGNAL, TURNS ON THE RIGHT TURN SIGNAL, THEN SWITCHES TO THE LEFT TURN SIGNAL, OR DOES NOT TURN ON ANY TURN SIGNAL. ALSO, WHEN SOMEONE WEIGHING AROUND 175 OR LESS SITS IN THE PASSENGER SEAT, THE AIRBAG LIGHT TURNS ON, AS IF THE PERSON IS A CHILD AND THE AIRBAGS WON'T DEPLOY IN CASE OF AN ACCIDENT.",
        "vin": "KNDMA5C17G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2020",
        "dateOfIncident": "03/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318868,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT MY HEADLIGHTS WILL OFTEN FLICKER OFF FOR ONE TO THREE SECONDS WHEN I'M EITHER ACTIVATING THE TURN SIGNAL (EITHER RIGHT OR LEFT) OR ATTEMPTING TO TURN ON MY HIGH BEAMS. I ALWAYS DRIVE WITH THE HEADLIGHTS IN \"AUTO\", SO I HAVE NOT EXPERIENCED THE ISSUE WITH ANY OTHER SETTING.",
        "vin": "KNDMB5C12G6"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317332,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE GOTTEN TIRE ROTATIONS REGULARLY.  DEALER TOLD ME AFTER THIS ROTATION, THAT THERE WAS CUPPING ON THESE TIRES.  THEY ONLY HAVE 23487 MILES ON THEM. MAINTAINANCE WAS DONE AND INFLATION KEPT AT BOOK LEVEL. DEALER SAYS TIRE MANUFACTURER IS LIABLE FOR WARRANTY. TIRE MANUFACTURER SYS DEALER NEEDS TO FILE CLAIM AND THAT THE CUPPING IS NOT SAFETY ISSUE AND WON'T HONOR THE WARRANTY. THESE ARE THE ORIGINAL TIRES FROM WHEN WE BOUGHT THE CAR NEW.  MANUFATURER IS HANKOOK. TIRE IS DYNAPRO HP2 RA33 BW. SKU1011758 PART# UHK18 23560BW. THEY OBVIOUSLY HAVE A MANUFACTURING DEFECT TO HAVE THIS HAPPENING AT SUCH LOW MILEAGE.IT WAS NOT OWNER NEGLECT!",
        "vin": "KNDMC5C10G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310975,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 SEDONA DRIVER SIDE PUSH BUTTON SLIDING DOOR WILL NOT LATCH PROPERLY ON ITS OWN. IT MAKES AN AWFUL NOISE AND THE BACK OF THE DOOR DOESN'T LATCH; WHICH CAUSES THE DOOR TO NOT LOCK ALSO. THIS POSES A VARIETY OF SAFETY ISSUES. I HAVE ALSO HAD THE DOOR SENSORS RESET/PROGRAMMED FOR THE RECALL THAT WAS FOR THE DOOR NOT RETURNING IF OBSTRUCTED; HOWEVER I HAVE PERSONALLY GOTTEN CAUGHT IN THE DOOR AND IT'S STILL NOT RETRACTING AS IT SHOULD IN MY OPINION. IF A CHILD WAS IN FACT THE ONE WITH THEIR HANDS, LEGS, FEET ECT IN THE PATH OF THE DOOR THE DOOR IS NOT GOING TO STOP AND RETRACT LIKE IT IS SUPPOSED TO. THE DOOR HAS ACTED THIS WAY FOR A LONG TIME. SINCE ABOUT 40,000 MILES.",
        "vin": "KNDMB5C17G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302928,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACTIVATING TURN SIGNALS THE HEADLIGHTS GO OUT.  THIS SEEMS TO HAPPEN ONLY WHEN HEADLIGHTS ARE SET AUTO.  RETURNING THE TURN SIGNAL STALK BACK TO THE NEUTRAL POSITION SEEMS TO CORRECT THIS AND ALSO MOVING THE SWITCH FROM AUTO TO ON.  THE HEADLIGHTS GO OUT WHILE DRIVING ON CITY STREETS AND HIGHWAYS, AND WHILE STATIONARY ON THE CITY STREETS OR IN PARKING LOTS.  SINCE I AM THE PRIMARY DRIVER I AM FAMILIAR WITH THE PROBLEM BUT WHEN MY WIFE DRIVES THE VAN I REMIND HER ABOUT THE PROBLEM IN CASE IT SHOULD HAPPEN TO HER.  MY DAUGHTER WILL BE DRIVING SOON AND A YOUNG DRIVER MAY NOT KNOW WHAT TO DO WHEN THE HEADLIGHTS GO AND THEY MAY PANIC CAUSING A PROBLEM.  JUST TONIGHT I FOUND THAT WHEN THE PARKING LIGHTS WERE PUT ON THE DRIVERS FRONT LIGHT FLICKERS AND THEN GOES OUT.  I REPEATED THIS PROCESS FOR SEVERAL CYCLES AND IT DID IT EVERY TIME.  THIS IS SOMETHING NEW THAT I WAS NOT AWARE OF UNTIL TONIGHT",
        "vin": "KNDMB5C1XG6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292182,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SLIDING DOOR MOTOR DOES NOT CLOSE THE DOOR PROPERLY. THIS IS NOT A WARRANTY ISSUE ONLY A SAFETY ISSUE NOT COVERED BY KIA. THE PROPER CLOSING OF THE SIDE DOOR IS NOT THEIR CONCERN.",
        "vin": "KNDMB5C16G6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288547,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2016 KIA SEDONA LX.  VEHICLE IS STATIONARY. I BEGAN HAVING PROBLEMS WITH THE DRIVER'S SIDE SLIDING DOOR NOT LATCHING WHEN CLOSING A FEW MONTHS AGO. THE THING IS, I RARELY EVER USE THAT SIDE FOR LOADING OR UNLOADING.  MORE TIMES THAN NOT I USE THE PASSENGER SIDE (CURB SIDE) DOOR. WHEN THE DOOR IS ATTEMPTING TO LATCH, IT MAKES A VERY WEIRD SOUND LIKE IT IS GROANING. IT CLOSES, BUT DOES NOT LATCH PROPERLY. ACCORDING TO THE DASHBOARD, THE DOOR IS STILL OPEN. I TOOK IT TO THE ORIGINAL DEALER AND THEY SAID I NEED TO REPLACE THE MOTOR AND CABLE AT A COST OF OVER $700. I'VE ALSO HAD A FUEL INJECTOR GO BAD $580. THESE SITUATIONS MAKE ME WONDER ABOUT YOUR \"RELIABILITY\" STATEMENTS. I FOUND A TECHNICAL SERVICE BULLETIN (SA-210) RELATING TO SEDONAS, 2015~2016 MODEL YEARS, GROUP BOD, NUMBER 116, DATED NOVEMBER, 2015. IT DESCRIBES WHAT TO DO TO CORRECT \"A VEHICLE WHICH MAY EXHIBIT AN INOPERATIVE POWER SLIDING DOOR.\" MY VAN, ACCORDING TO THE VIN, FALLS WITHIN THE DATES THAT ARE MENTIONED IN THE BULLETIN (1/6/15 - 7/6/15). TO ME, THIS SEEMS LIKE THE BULLETIN PERTAINS TO MY VEHICLE. THE PSD IS DEFINITELY NOT OPERATING CORRECTLY. SINCE IT IS NOT OPERATING CORRECTLY IN TOTAL, I SUBMIT THEREFORE, THAT THE LATCH IS INOPERABLE.",
        "vin": "KNDMB5C17G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287682,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FLICKERING HEADLIGHTS AT NIGHT. SOMETIMES THEY GO OUT AND THEN COME BACK ON",
        "vin": "KNDMB5C18G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280353,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIRECTIONALS FILL WITH RAIN WATER AND STOP FUNCTIONING.",
        "vin": "KNDMB5C1XG6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277518,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 KIA SEDONA AND SOMETIMES WHILE DRIVING AT NIGHT EITHER ON THE FREEWAY OR CITY STREET MY HEADLIGHTS FLICKER OFF AND ON, SOMETIMES THEY WON'T TURN BACK ON UNTIL I TURN THE LIGHTS SWITCH. IT STARTED 2 YEARS AGO BUT NOW IT HAS BEEN HAPPENING MORE FREQUENTLY. ALSO, WHILE MY VAN IS PARKED AND THE ENGINE IS OFF THE HEADLIGHTS ARE TURNING ON BY THEMSELVES. I KEEP MY SWITCH ON AUTO. I MAKE SURE MY LIGHTS TURN OFF BEFORE LEAVING THE VAN BUT THEN I COME BACK AND THEY ARE ON.  THIS IS THE SECOND TIME IT HAS DONE THAT.  I HAVE TO CARRY A BATTERY CHARGER NOW JUST IN CASE I WON'T BE ABLE TO START MY VAN.",
        "vin": "KNDMB5C15G6"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277054,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "10-26-19 DRIVING ON HWY AT 60 MPH ON SAT. NIGHT AND I COULD TELL THE CAR HAD LOST POWER TO THE ENGINE.  COASTED TO AN EMPTY PARKING LOT.  TRIED TO CRANK.  IT WOULD CRANK AND THEN DIE. LIGHTS STILL WORKED.  THERE WAS A STRONG SMELL OF GASOLINE WHEN TRYING TO CRANK.      HAD TO HAVE IT TOWED 60 MILES TO HOME. TRIED TO CRANK THE FOLLOWING DAY AND SMOKE BILLOWED OUT OF THE EXHAUST. GASOLINE SMELL EXTREMELY STRONG.",
        "vin": "KNDMC5C15G6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270102,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS - THE SENSOR LIGHT KEEPS COMING ON AT RANDOM TIMES, THEN WILL TURN OFF FOR A FEW SECONDS, THEN COME BACK ON. THERE IS NOT ONE CERTAIN THING THAT CAUSES THIS (IE BUMPS, BREAKING, ACCELERATION, ETC). NOT SURE IF THIS IS A BAD SENSOR ISSUE OR WHAT IT COULD BE.     SEATBELTS - FRONT PASSENGER SIDE SEATBELT WILL 'LOCK' INTO PLACE WHILE DRIVING (LIKE AFTER YOU WOULD STOP SUDDENLY), AND THE ONLY WAY TO UNDO IT, IS TO RELEASE THE SEATBELT.",
        "vin": "KNDMA5C13G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/20/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269601,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR VEHICLE HAS THE ELECTRONIC STABILITY LIGHT, ABS, LIGHT ON. IT OVER HEATS IF SITTING STILL. THE COOLING FAN IS NOT WORKING REPLACED THE FUSE RELAY. FOR THE COOLING FAN, STILL NO COOLING FAN. CONSTANTLY FILLING THE COOLANT. IT SEEMS TO BE ELECTRICAL BUT I DECIDED TO WAIT FOR A PRO TO SEE IF IT IS RECALL RELATED. WHEN THE LIGHT FIRST CAME ON WHILE THE VAN WAS IN MOTION 55 MPH, THE LIGHTS CAME ON AND WENT OFF THREE TIMES FOR STAYING ON. \" ABS,ELECTRONIC STABILITY CONTROL, THIS IS WHEN THE OVERHEATING PROBLEM STARTED WHILE IDLING.",
        "vin": "KNDMB5C12G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266163,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NEEDED TO HAVE THE SLIDING PASSENGER DOOR MOTORS REPLACED (ONCE IN 2018, CURRENTLY WORKING ON IT A SECOND TIME 2019) AS THE DOORS WOULD NOT FULLY LATCH.  THEY WOULD CLOSE INTO POSITION IN THE FRONT LATCH BUT WOULD NOT PULL COMPLETELY SHUT IN THE BACK PART OF THE DOOR.  ONCE THE DOOR IS PUSHED SHUT, IT STAYS SHUT, BUT YOU NEED TO PUSH IT TO CLOSE IT.    I HAVE A VIDEO BUT I CANNOT UPLOAD IT.",
        "vin": "KNDMC5C1XG6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244322,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER MOTORIZED SLIDING DOOR DOES NOT ALWAY LATCH CLOSED.  THERE IS A SERVICE ADVISORY TO REPAIR BUT NO RECALL. VEHICLE FAILING TO LATCH COULD CAUSE THE DOOR TO OPEN WHILE IN MOTION.",
        "vin": "KNDMB5C14G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "01/12/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231418,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIGNAL LIGHTS DOES NOT ALWAYS WORK WHEN THEY TURNED ON. IN SOME INSTANCES IF I TURN SIGNAL ON TO GO RIGHT, LEFT SIGNAL LIGHT COMES ON. HEADLIGHTS CAN ALSO TURN OFF UPON TURNING ON SIGNAL LIGHTS. I BELIEVE THIS IS A SAFETY ISSUE",
        "vin": "KNDMA5C14G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/11/2019",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219299,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SEDONA. THE CONTACT STATED THAT THERE WAS AN INTERNAL ELECTRICAL FAILURE AND THE REAR DOORS UNLOCKED WITHOUT WARNING. IN ADDITION, THE BRAKE LIGHTS ILLUMINATED AND THE RADIO SHORTED IN AND OUT. CENTURY KIA OF TAMPA (4340 W HILLSBOROUGH AVE, TAMPA, FL 33614, (844) 757-2536) WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS WAITING FOR A RESPONSE TO RECEIVE AN APPOINTMENT FOR DIAGNOSTIC TESTING AND REPAIR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KNDMB5C16G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/07/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208880,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS USING MY BLUETOOTH AND MY RADIO AND BLUE TOOTH STOPPED WORKING. IT SHUT OFF AND WOULD NOT TURN BACK ON. WHEN I TRIED TALKING THE PEOPLE ON THE PHONE COULD NOT HEAR ME AND I COULD NOT HEAR THEM. WHEN I SHUT OFF THE BLUETOOTH THE PERSON COULD HEAR ME AND I COULD HEAR THEM.  IF I SHUT OFF THE CAR AND TURNED IT BACK ON IT STILL WOULDN'T WORK. AFTER ABOUT 20 MINUTES IT STARTED WORKING LIKE IT SHOULD AGAIN. THIS HAS HAPPENED TWICE.",
        "vin": "KNDMB5C14G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208005,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A PROBLEM THAT HAPPENS EVERYDAY, AND AT NIGHT. TWO THINGS, ONE THE TURN SIGNALS DO NOT ENGAGE, YOU'LL PUSH THE STALK UP/DOWN TO INDICATE A LEFT OR RIGHT-HAND TURN, AND THE EXTERNAL SIGNALS DO NOT LIGHT. EITHER TURNING THE STEERING WHEEL OR PUSHING THE TURN SIGNAL STALK BACK TO THE CENTER POSITION AND THEN PUSHING THE STALK BACK TO THE DESIRED LEFT/RIGHT INDICATOR. ALSO AT NIGHT, THE HEADLIGHTS WILL TURN OFF BY THEMSELVES. YOU USUAULLY HAVE TO RAPIDLY WORK THE HEADLIGHT SWITCH ON THE END OF THE TURN SIGNAL STALK TO GET THEM TO TURN BACK ON. THIS IS HIGHLY DANGEROUS AT NIGHT, AND KIA REFUSES TO REPAIR THE VEHICLE.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207823,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THERE WAS A SPONTANEOUS EXPLOSION FROM UNDER THE HOOD ACCOMPANIED BY A GUSH OF OIL FROM UNDER THE CAR.   THE CAR DID NOT CATCH FIRE BUT THERE WERE SPARKS.  THE OIL THAT SPILLED FROM UNDER THE CAR CAUSED THE CAR TO SLIP OUT OF CONTROL.",
        "vin": "KNDME5C17G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192645,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS BACK I STARTED HAVING ISSUES WITH THE CHARGING SYSTEM. I WAS BEING TOLD IT WAS THE ALTERNATOR. I REPLACED THE ALTERNATOR TWICE AND BATTERY TWICE. MY VEHICLE IS NOW IN THE SHOP AND THEY ARE TELLING ME IT'S THE PCM COMPUTER. THEY GOT A PCM AND REPLACED IT CHARGED AND WORKED FINE RIGHT AFTER BUT THE NEXT DAY IT CONTINUED TO HAVE CHARGING ISSUES. THERE HAVING TO RE ORDER ANOTHER NEW PCM. THERE IS A MAJOR PROBLEM WITH MY CAR. WE ARE FIXING THE PROBLEMS THAT ARE SHOWING UP AS BEING WRONG AND IT IS NOT WORKING. THIS SHOULD BE A RECALL ISSUE.. THERE'S MORE GOING ON HERE. EXATREMLY UNHAPPY BEING THIS CAR IS ONLY 3 YEARS OLD (PROBLEM STARTED IN JANUARY)",
        "vin": "KNDMA5C18G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192536,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MULTIMEDIA DISPLAY STOPPED PROJECTING. IT WOULDN'T ALLOW ME TO SEE THE BACKUP CAMERA WHEN IN REVERSE. RESTARTING DIDN'T FIX THE ISSUE AND IT WAS DIAGNOSED BY KIA AS A FAULTY SYSTEM. WARRANTY ONLY COVERED IT UNTIL 36,000 MILES AND I'M AT 44,000. IT'S UNSAFE TO NOT BE ABLE TO SEE BEHIND ME DUE TO THE LARGE STATURE OF MY VEHICLE. ALSO COULDN'T CONTROL BLUETOOTH OR PHONE CONNECTION TO ALLOW ME CONTACT TO SAFETY PERSONNEL UNLESS I WAS UNSAFE BY USING MY PHONE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191318,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH OF THE SLIDING DOORS ON MY 2016 KIA SEDONA DO NOT CLOSE COMPLETELY WHEN USED IN AUTOMATIC MODE. THEY DO NOT LATCH PROPERLY AND THE \"DOOR OPEN\" LIGHT AS WELL AS ALL INTERIOR LIGHTS REMAINS ON. I HAVE TO PHYSICALLY PUSH THE DOOR SHUT IN ORDER FOR IT TO LATCH. THE DOOR ALSO MAKES A LOUD NOISE WHEN ATTEMPTING TO CLOSE. THIS OCCURS WHEN STATIONARY AND ON ANY TYPE OF GROUND (FLAT, HILL, ETC) ONE DOOR WAS REPAIRED BY THE DEALER BUT THE SECOND DOOR STARTED HAVING THIS ISSUE AFTER THE WARRANTY EXPIRED, UNFORTUNATELY.",
        "vin": "KNDMB5C10G6"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183514,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED BRAND NEW A 2016 KIA SEDONA FROM THE DEALERSHIP. WITHIN THE 2 YEARS WE OWNED IT WE HAD TO TAKE IT INTO THE DEALERSHIP FOUR TIMES BECAUSE THE AIRBAG LIGHT WOULD COME ON AND STAY ON, OR WOULD FLICKER OFF AND ONE AS I WAS DRIVING DOWN THE ROAD. THEY FOUND IT TO BE AN ISSUE WITH THE PASSENGER AIRBAG.  THEY REPAIRED IT THE FIRST THREE TIMES AND THE LIGHT WOULD STAY OFF FOR A WHILE. THE FOURTH TIME WE TOOK IT IN THEY SAID THEY WERE GOING TO TRY REPLACING THE WHOLE SEAT TO SEE IF THAT HELPED. WE DECIDED THAT WE DIDN'T WANT TO RISK IT HAPPENING AGAIN AS THE VAN WAS LESS THAN 2,000 MILES FROM BEING OUT OF WARRANTY.     SO, WE TRADED IT IN FOR A 2018 KIA SEDONA WHICH NOW, AT 1400 MILES, HAS THE SAME ISSUE! WE HAVE ALREADY TAKEN IT IN TWICE TO THE HAVE ISSUE REPAIRED. WHAT ARE THE ODDS OF HAVING THE EXACT SAME ISSUE?",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179990,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT HEADLIGHTS AND TAIL LIGHTS ALL GO OUT FOR A MINUTE AND THEN THEY COME BACK ON. THIS COULD HAPPEN 1-3 TIMES OF DRIVING.",
        "vin": "KNDMB5C10G6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179991,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY ONCE IN A WHILE THE LEFT TURN SIGNAL WILL NOT WORK. YOU MOVE THE STEERING WHEEL LEFT AND RIGHT LIGKE YOU ARE TURNING AND IT WILL WORK. OR HEADLIGHTS WILL GO OUT WHEN YOU TURN ON YOUR LEFT TURN SIGNAL AT NIGHT TIME AND WHEN THE TURN SIGNAL GOES OFF THE HEADLIGHTS AND TAIL LIGHTS WILL COME BACK ON. VERY HIGHLY UNSAFE WHILE DRIVING. ALSO WHEN DRIVING AT NIGHT THE HEADLIGHTS ARE VERY DIM. THEY DO NOT SHINE OUT FAR ENOUGH EXSPECIALLY AT HIGHWAY SPEEDS. THEY ARE POINTING DOWN TO EARLY. TRIED ADJUSTING NO HELP. ALSO TRIED LES HEADLIGHTS HELPED A LITTLE BUT NOTHING TO REALLY SATISFY THE SAFETY OF MY FAMILY WHILE TRAVELING.",
        "vin": "KNDMB5C10G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173048,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 KIA SEDONA LX IS HAVING ISSUES WITH THE SLIDING DOORS NOT CLOSING ALL THE WAY. THE DRIVER SIDE SLIDING DOOR WAS WORKED ON WHEN WE BOUGHT IT BUT IT HAS REVERTED TO NOT LOCKING ONCE CLOSED EVERY TIME WE CLOSE IT. THE PASSENGER SLIDING DOOR IS STILL RANDOM. IT'S ONLY WHEN WE HAVE THEM OPENING/CLOSING WITH THE POWER OPTION. WHEN THE POWER OPTION IS TURNED OFF AND WE MANUALLY OPEN/SHUT THE DOORS, THEY DO LATCH AND THERE IS NO ISSUE.",
        "vin": "KNDMB5C11G6"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/01/2018",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144702,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SEDONA. THE CONTACT STATED THAT THE PASSENGER'S SIDE SLIDING DOOR FAILS TO LATCH AND LOCK. THE CONTACT MENTIONED THAT WHILE DRIVING AT 40 MPH, THE DOOR AJAR WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO KING KIA (953 N FREDERICK AVE, GAITHERSBURG, MD 20879 (301) 948-3333) WHERE THE CONTACT WAS INFORMED THAT THE DOOR LATCH WAS NOT BINDING AND THE SLIDING DOOR WAS REPROGRAMMED. THE CONTACT STATED THAT AFTER THE REPAIR THE FAILURE REOCCURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 39,000.",
        "vin": "KNDMB5C16G6"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "09/26/2017",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129664,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING GOING WESTBOUND ON HIGHWAY 84 IN PENNSYLVANIA AND HIT A DEER GOING 65MPH. I PULLED OVER TO THE SIDE OF THE HIGHWAY. I WALKED OUT TO THE MILE MARKER AND  WHEN I TURNED AROUND MY CAR WAS ON FULLY ENGULFED IN FLAMES. EVENTUALLY MY CAR BLEW UP AND I LOST EVERYTHING.",
        "vin": "KNDMB5C12G6"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129079,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER SEAT BELT IN THE MIDDLE BACK ROW WHICH PULLS DOWN FROM THE ROOF OF THE VEHICLE FAILED WHEN MAKING A QUICK STOP TO AVOID AN ACCIDENT DUE TO ANOTHER CAR IMPROPERLY CHANGING LANES INTO OUR LANE. SPEED OF TRAVEL WAS 45MPH ON THE STRAIGHT AWAY ON A CITY STREET. THE PASSENGER'S HEAD WAS AIMING FOR THE CENTER CONSOLE AND WAS BUFFERED BY THE PASSENGER EXTENDING HIS HANDS TO NOT HIT THE CENTER CONSOLE. THE SEAT BELT APPEARS TO BE WORKING NOW, BUT WE CANNOT BE SURE THAT IT WILL CONTINUE TO FUNCTION PROPERLY OR IF THE OTHERS MAY ALSO WORK INTERMITTENTLY IN THE FUTURE.",
        "vin": "KNDMB5C14G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11115430,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SEDONA. THE CONTACT TOOK THE VEHICLE TO DUTCH MILLER KIA OF CHARLESTON (335 MACCORKLE AVENUE SW, SOUTH CHARLESTON, WV 25303) TO BE SERVICED PER NHTSA CAMPAIGN NUMBER: 18V338000 (STRUCTURE, ELECTRICAL SYSTEM), BUT THE CONTACT STATED THAT THE REMEDY FAILED. THE CONTACT STATED THAT THE POWER SLIDING DOOR DID NOT AUTO-REVERSE AND CRUSHED THE CONTACT'S UPPER ARM. MEDICAL ATTENTION WAS REQUIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE WAS OPENED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 54,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "07/07/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110969,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SEDONA EQUIPPED WITH KUMHO CRUGEN TIRES, SIZE: 235/65R17 (NA). WHEN THE VEHICLE WAS TAKEN TO JENKINS KIA OF OCALA (2305 SW COLLEGE RD, OCALA, FL 34471, (352) 414-4553) FOR AN ALIGNMENT, THE CONTACT WAS INFORMED THAT THE BELTS WERE SEPARATING FROM THE THREAD ON ALL THE TIRES. THE TIRES WERE CHANGED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE DOT NUMBER WAS UNKNOWN. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 19,500.",
        "vin": "KNDMB5C12G6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/05/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11109707,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN ONGOING INCIDENT AND ISSUE. THE MOTOR ON THE SLIDING DOORS IS NOT HIGH QUALITY AND GOES OUT VERY QUICKLY. IN MY CASE IN LESS THAN 2 YEARS, IN OTHER CASES I HAVE READ ONLINE SOME ARE IN LESS THAN A YEAR. WHEN THE MOTOR IS GOING OUT, THE DOORS WILL MAKE A LOUD NOISE UPON CLOSING AND APPEAR CLOSED. HOWEVER THEY ARE NOT PROPERLY LATCHED AND THEREFORE NOT PROPERLY SECURING THE PASSENGERS INSIDE.",
        "vin": "KNDMB5C14G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103952,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SLIDING DOORS MAKE LOUD GRINDING NOISES WHEN CLOSEING AND OPENING. IN ADDITION THE POWER SLIDING DOORS CONTINUED TO CLOSE ON ME WHILE I WAS TRYING TO PUSH IT BACK OPEN. CAR WAS PARKED IN THE DRIVEWAY AND OFF, MY FRONT PASSENGER PRESSED THE OVERHEAD PSD BUTTON BEFORE HE REALIZED THE KIDS HADN'T FINISHED CLIMBING OUT.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2018",
        "dateOfIncident": "04/02/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103652,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA HAS HAD A MINIMAL OF 9 ATTEMPTS TO RECTIFY MY BLINKERS NOT WORKING AND WHEN WORKING, THEY DID SO INCORRECTLY. THE DOORS WERE ALSO OPENING WITHOUT COMMAND AND SOMETIMES THE OPEN DOOR LIGHT INDICATES THE DOORS ARE OPEN WHEN NOT. THEY HAVE NOT BEEN ABLE TO FIX THIS. THEY HAVE MADE IT CLEAR THEY WISH TO CONTINUE TO DO THIS AND KIA EXECUTIVES LEAD MECHANIC IS IN AGREEMENT WITH ME THEY SHOULD HAVE RECALLED THIS VEHICLE AFTER THE FIRST TIME IT HAPPENED. THE DOORS OPEN WHEN MOVING AND NOT MOVING. I HAVE PLENTY OF VIDEO RECORDINGS TO VERIFY.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103557,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN SLIDING DOORS DO NOT CLOSE PROPERLY.    WHEN DRIVING, THE DOOR AJAR ALERT WILL LIGHT UP ON THE DASHBOARD.   WE HAVE TO STOP THE CAR AND PUSH ON THE DOORS TO GET THEM TO CLOSE COMPLETELY.  THE DOORS MAKE A LOUD GROANING SOUND WHEN THEY ARE CLOSING AND DO NOT CLOSE ALL THE WAY.   THE DOORS WILL RE-OPEN EVEN AFTER YOU HAVE ATTEMPTED TO CLOSE THE DOOR.",
        "vin": "KNDMC5C10G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2018",
        "dateOfIncident": "12/12/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100310,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER SLIDING DOORS HAVE CRUSHED ME TO THE POINT OF BRUSING MY RIBS. THEY DID NOT  RETRACT WITH ME IN THE DOORWAY. SLIDING POWER DOORS FAIL TO RETRACT WHEN PRESSURE IS APPLIED AND SOMETIMES SPONTANEOUSLY CLOSE WITHOUT BUTTONS PUSHED OR HANDLES BEING TOUCHED (VEHICLE WAS SOLD TO US WITH DOCUMENTED DOOR NOISE ISSUES THAT WAS UNDISCLOSED TO US)  DOORS WILL ALSO ALERT THAT THEY ARE OPEN WHILE DRIVING. DOORS CAN NOT BE OPENED UNLESS VAN IS IN PARK. WE HAVE HAD TO PULL OVER ON THE INTERSTATE PUT VAN IN PARK OPEN AND RECLOSE DOORS TO GET THE ALARM TO TURN OFF. ALL INTERMITTEN ISSUES THAT CANNOT BE DUPLICATED BUT HIGHLY UNSAFE",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052308,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON AN INTERSTATE HIGHWAY AT NIGHT WHEN SUDDENLY THE DASHBOARD LIGHTS WENT OUT.  AFTER A FEW SECONDS, THE HEADLIGHTS WENT OUT AS WELL.  THIS WAS DEFINITELY A LIFE-THREATENING SITUATION!  IT HAPPENED ON A 2200 MILE TRIP AND NECESSITATED CHANGING PLANS, MOTEL RESERVATIONS, AND ARRIVING LATE AT THE DESTINATION, BECAUSE... IT WAS THE WEEKEND (NO SERVICE AVAILABLE) AND WE HAD TO DRIVE ONLY IN DAYLIGHT HOURS.  TAKING IT TO A KIA DEALER ASAP, BUT AM EXPECTING AN \"WE CAN'T FIND ANYTHING WRONG BECAUSE IT'S AN INTERMITTENT PROBLEM.\" RESPONSE.",
        "vin": "KNDMB5C12G6"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "11/16/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046496,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO MY DRIVEWAY GOING BETWEEN  5-10 MPH I APPLIED THE BRAKE AND THE VEHICLE LUNGED FORWARD INTO MY GARAGE DOOR WHICH WAS CLOSED AND DAMAGED ANOTHER CAR PARKED IN THE GARAGE.  IF THE OTHER CAR WAS NOT THERE TO STOP IT I MAY HAVE BEEN KILLED. I REPORTED THIS TO KIA AND THE INVESTIGATION ONLY SHOWED A  BLOWN FUSE WHEN THEY CONNECTED IT TO THE TESTER.  THERE ARE TWO OTHER ACCIDENTS THAT I KNOW OF WITH SIMILAR CIRCUMSTANCES, PLEASE CHECK INTO THIS BEFORE SOMEONE IS KILLED OR LOSES  MONEY DUE TO SOMETHING THAT WAS NOT THEIR FAULT.  BY THE WAY I WAS TURNING RIGHT INTO MY DRIVEWAY AND MY HUSBAND WAS BACKING OUT IN HIS CAR WHEN THIS TOOK PLACE AND HE SAW THE WHOLE THING.",
        "vin": "KNDMB5C18G6"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045567,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SEDONA. THE CONTACT STATED THAT THE SUN ROOF SPONTANEOUSLY SHATTERED WHILE DRIVING 65 MPH. THE FAILURE OCCURRED WITHOUT WARNING. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO JEFFREY KIA (30900 GRATIOT AVE, ROSEVILLE, MI), BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 26,000. *BF  UPDATED 8/13/18*JB",
        "vin": "KNDME5C19G6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "05/25/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034238,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT COMES ON AND OFF FREQUENTLY WITH NO EXPLANATION AS TO WHY. THE PASSENGER SEAT BELT LIGHT BLINKS ON AND OFF WITH NO PASSENGER AND NOTHING IN THE SEAT. THIS HAPPENS WHILE DRIVING THE VEHICLE OR AT START UP OF THE VEHICLE THE LIGHTS MAY STAY ON. I FEAR THAT IF NEEDED MY AIRBAGS MAY NOT DEPLOY PROPERLY.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004680,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A KIA SEDONA 2016 HAVE ABOUT 20000 I AM THE SECOND OWNER I WAS TAKED TO THE SERVICE TO THE SAME DEALER WHERE I BOUGHT AND THE TECHNICIAN TALK ME THEM WILL GO TO CHECK THE BRAKE SYSTEM AND IAGREE, LATTER THE SAME DAY HE CALL ME AND TALK ME ABOUT SOME VIBRATION IN THE STEERING WELL I READY KNOW ABOUT  SO HE TALK ME THE ROTORS HAVE TO BE RESURFACED FOR REAL THIS VEHICLE ONLY HAVE 20000 MILES HE EXPLAINS TO ME ME ABOUT THE WEIGHT AND THE SIZE BUT I NEVER HAVE THIS DONE BEFORE IN ANY CAR I BEEN DRIVING OR OWNED IN MY ENTIRE LIFE I JUST LIKE TO KNOW IS KIA USE THE RIGHT QUALITY OF THE MATERIAL FOR THIS TYPE OF VEHICLE THANKS FOR YOU ATTENTION",
        "vin": "KNDMBSC18G1"
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/08/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11001982,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RENTED A CAR FROM THE AIRPORT IN DENVER AND IT WAS THE LAST 4 CARS ON THERE LOT. I WAS DRIVING THE CAR LOST IN DENVER CAR WAS PULLING TO THE CENTER OF THE CARON BOTH SIDES. I SAID THERE IS SOMETHING WRONG WITH THIS CAR. I WAS LOOKING FOR STREET SIGNS ABOUT 20 MPH AND THE CAR TOOK OFF AND HIT 2 CARS THE AIR BAGS WENT OFF I LET GO OF STREEING WHEEL AND THE CAR WAS TOWED TO THE SALVAGE LOT IN 20 DAYS RENTAL PLACE NEVER CONTACTED ME PUT MONEY BACK IN MY ACCT AND NEVER GAVE ME MY THINGS IN TRAVEL. NOW I HAVE TO GET A LAWYER TO DEFEND ME. AND I AM BLESS I HAVE A BROKEN SCREW IN MY FUSION AND I COULD OF BEEN PARALYZED THIS CAR SHOULD NOT BE ON THE ROAD.",
        "vin": "DONT KNOW"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "03/24/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985423,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SEDONA. WHILE ATTEMPTING TO START THE VEHICLE, THE KEY FAILED TO TURN IN THE IGNITION. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO THE DEALER. THE CONTACT ALSO STATED THAT THE REAR HATCH WAS DIFFICULT TO OPEN AFTER BEING UNLOCKED WITH THE KEY FOB. THE VEHICLE WAS TAKEN TO A DEALER, BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 9,960.",
        "vin": "KNDMB5C13G6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971056,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ENGINE WILL RANDOMLY SHUT OFF WHILE DRIVING, CAUSING COMPLETE POWER FAILURE, INCLUDING POWER STEERING. IT HAS HAPPENED 7 TIMES IN 5 MONTHS. IT HAS HAPPENED FOUR TIMES WHILE SLOWING TO A STOP, TWICE WHILE EASING THROUGH A DRIVE THRU, AND ONCE WHILE GOING 30MPH DOWN A MAIN CITY STREET.",
        "vin": "KNDMC5C15G6"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2017",
        "dateOfIncident": "02/16/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969569,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PERSISTENT PROBLEM THAT WE HAVE HAD WITH OUR VEHICLE IS THE ENGINE SHUTS DOWN WHILE DRIVING, CAUSING A SERIOUS SAFETY HAZARD.  THE SAFETY HAZARD IS SERIOUS IN THAT, WHILE THE VEHICLE IS IN MOTION, POWER STEERING SHUTS OFF AND THE BRAKES ARE SLOW TO WORK.    EACH OCCURRENCE HAS HAPPENED WHEN THE VEHICLE IS IN DRIVE AND MOVING AT A SPEED OF APPROXIMATELY 20-25 MPH.  THIS HAS HAPPENED 3 TIMES:           - JANUARY 29,2017           - JANUARY 30, 2017           - FEBRUARY 16, 2017  THE CIRCUMSTANCES IN EACH INSTANCE INCLUDED DRIVING AND MAINTAINING APPROXIMATELY 20-25 MPH.  OTHER FACTORS ARE UNKNOWN.    FORTUNATELY, IN EACH INSTANCE, I WAS ABLE TO PULL SAFELY TO THE SIDE OF THE ROAD AND ASSESS THE VEHICLE.  THE FIRST TWO OCCURRENCES, I PUSHED THE START BUTTON AND IT WAS EVIDENT THE VEHICLE STARTING SYSTEM WAS ACTING UNUSUAL AS IT TRIED STARTING.  THE VEHICLE EVENTUALLY STARTED AND I WAS ABLE TO CONTINUE DRIVING.  THE THIRD OCCURRENCE ON FEBRUARY 16, 2017, I TOOK KIA'S ADVICE AND DID NOT ATTEMPT TO START THE VEHICLE AND CONTACTED KIA ROADSIDE SERVICE.      THE SECOND EVENT OCCURRED THE NEXT DAY ON JANUARY 30, 2016 UNDER SIMILAR CIRCUMSTANCES.  AGAIN I WAS ABLE TO PULL OVER WITHOUT THE POWER STEERING SYSTEM FUNCTIONING PROPERLY TO A SAFE AREA AND RE-START THE VEHICLE WITH THE SAME UNCOMMON SOUNDS FROM THE STARTING SYSTEM.   I CALLED JOE MYERS KIA IN HOUSTON, TEXAS AND EXPLAINED THE OCCURRENCES.  ON JANUARY 31, I DROVE THE VEHICLE TO JOE MYERS KIA FOR TROUBLESHOOTING AND REPAIR OF THE VEHICLE.      THE VEHICLE HAS BEEN TO THE DEALERSHIP TWO TIMES TO ADDRESS THE SAFETY DEFECT.  THE FIRST TIME WAS JANUARY 24, 2017 FOR 8 DAYS.  THE SERVICE DEPARTMENT COULD NOT DUPLICATE THE CONCERN.  THE NEXT TIME, IT WAS TOWED ON FEBRUARY 16, 2017 AND IT STAYED THERE FOR 41 DAYS.  KIA DID INSTALL A FLIGHT RECORDER TO RECORD ALL SYSTEMS THE SECOND TIME THE VEHICLE WAS BROUGHT IN.",
        "vin": "KNDMC5C18G6"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937169,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2ND ROW CENTER SEAT BELT IS DEFECTIVE AND CAN NOT HOLD AN OCCUPANT.     THE CENTER SEAT BELT HAD NEVER BEEN USED BEFORE TODAY - THE BUCKLES WERE STILL WRAPPED IN BLUE PLASTIC FROM THE FACTORY. UPON ATTEMPTED FIRST USE, THE SMALLER LATCHPLATE WOULD NOT GO INTO THE SMALLER BUCKLE. THE WHITE RELEASE BUTTON ON THE SMALLER BUCKLE WAS DEPRESSED INWARDS - WHICH IT SHOULD NOT HAVE BEEN. THE SMALLER LATCHPLATE WOULD GO INTO THE BUCKLE AND GIVE A FALSE LATCH AND THEN AT EVEN A LITTLE BIT OF PULLING ON THE BELT THE LATCHPLATE WOULD COME OUT OF THE BUCKLE.     NOTE: BECAUSE THIS SHOULDER BELT COMES FROM THE ROOF THERE ARE 2 BUCKLES AND 2 LATCHPLATES. THE DEFECT WAS WITH THE SMALLER LATCHPLATE THAT WOULD NOT LATCH PROPERLY INTO THE SMALLER BUCKLE.",
        "vin": "KNDMC5C11G6"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/27/2016",
        "dateOfIncident": "11/10/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928088,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING WHEN THIS INCIDENT OCCURRED. WHILE IN HEAVY TRAFFIC, SHE HAD COME TO A STOP. AFTER STOPPING THEN RESUMING A VERY SLOW SPEED (5 MPH OR LESS), WHILE HER FOOT WAS ON THE BRAKE PEDAL, THE VEHICLE LUNGED FORWARD IN TO THE VEHICLE IN FRONT OF HER, CAUSING SIGNIFICANT FRONT-END DAMAGE AND AIR BAG DEPLOYMENT. A FEW WEEKS PRIOR TO THIS, I WAS IN THE VEHICLE IN MY FRONT YARD AT A STAND STILL, ENGINE RUNNING AND TRANSMISSION IN DRIVE BECAUSE I WAS GOING TO BE MOVING IT SLIGHTLY, AND IT SUDDENLY LUNGED FORWARD WHILE MY FOOT WAS ON THE BRAKE. AT THE TIME I THOUGHT I HAD DONE SOMETHING WRONG, BUT NOW WITH A SIMILAR THING HAPPENING WITH A DIFFERENT DRIVER, AND SUCH EXTREME DAMAGE, THERE MUST BE A BIGGER PROBLEM.  *TR",
        "vin": "KNDMB5C15G6"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927129,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE LEASE FROM NEMET KIA STARTED IN JUNE 2016 THE EXTERIOR OF WINDSHIELD HAS HAD A FILM THAT SMEARS THE WINDOW AND OBSTRUCTS DRIVER VIEW IN THE RAIN.  WHEN DRY THE WINDOW IS CLEAR BUT IN THE RAIN THE FILM BECOMES AN ISSUE. THERE WASN'T MUCH RAIN DURING THE SUMMER SO I DEALT WITH IT HOPING IT WOULD WEAR OFF THROUGH REGULAR USE OF THE WIPERS. I HAVE ALSO CLEANED THE GLASS NUMEROUS TIMES WITH NEGATIVE RESULTS.    WHEN THE CAR CAME IN FOR THE FIRST SERVICE IN SEPT. 2016 THE TECH TRIED TO REMOVE THE FILM BUT THEY COULD NOT ADDRESS IT PROPERLY (NOTED ON WORK RECEIPT) AND THE FILM IS STILL THERE. DURING THE HEAVY RAINS OF THE LAST FEW DAYS THE CAR IS VERY DIFFICULT TO DRIVE DUE TO THE SMEARED WINDSHIELD.  THE PROBLEM GETS WORSE WHEN DRIVING AT NIGHT IN THE RAIN.    KIA DEALER KEPT CAR FROM OCTOBER 11-14 2016 AND ATTEMPTED TO CLEAN WINDOW AND VERIFIED THE PROBLEM REQUIRED REPLACEMENT OF WINDSHIELD.      AS OF NOVEMBER 21, 2016 THE WINDSHIELD HAS YET TO BE REPLACED. KIA AND DEALER KEEP PUSHING BACK REPLACEMENT DATE AND THE CAR IS UNSAFE TO DRIVE.     KIA HAS BEEN CONTACTED AND THEY ASSIGNED THE ISSUE CASE #K3296615.",
        "vin": "KNDMC5C1XG6"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/12/2016",
        "dateOfIncident": "11/11/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925601,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 70 MPH WITH CRUISE CONTROL ON, EXPERIENCED LOUD \"BUMP\" ON SMOOTH HIGHWAY SURFACE WITH SUDDEN AND TOTAL LOSS OF ENGINE SPEED. PUT VEHICLE IN NEUTRAL AND WAS ABLE TO RESTART ENGINE. CRUISE CONTROL WAS NOT WORKING AT THAT TIME. CRUISE CONTROL WAS OPERATIVE LATER IN THE DAY AFTER ENGINE STOP AND RESTART. TOOK VEHICLE NEXT DAY TO DEALER. DEALER SAID THEY COULD FIND NOTHING WRONG WITH VEHICLE.",
        "vin": "KNDMA5C13G6"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "09/05/2016",
        "dateOfIncident": "09/19/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 2,
        "numberOfInjuries": 0,
        "odiNumber": 10903653,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTHER AND HER FRIEND WERE DRIVING APPROX. 35 MILES PER HOUR WHEN THE RIGHT REAR WHEEL WENT OFF THE ROAD CAUSING THEM TO GO INTO THE FRYING PAN RIVER IN BASALT, CO. THERE WAS APPROX. 42.1 DEGREE SLOPE. MY MOTHER WAS THE PASSENGER. WE RETRIEVED HER PICTURES AND VIDEO. SHE WAS VIDEO TAPING WITH HER CELL PHONE  AT THE TIME OF THE ACCIDENT. THE PASSENGER WINDOW WAS DOWN. SHE SAID, \"OH [XXX]\", AND APPEARED TO REACH TO REMOVE HER SEATBELT. THEY WENT INTO THE RIVER. THEY WERE FOUND AT 4:30 PM WITH CAR SUBMERGED IN WATER AND BOTH DROWNED. NO DAMAGE TO THE CAR. THE SIDE AIRBAGS HAD GONE OFF AND THE FRONT WINDOWS WERE UP WITH THE AIRBAGS STICKING OUT WHEN THEY WERE FOUND. THE FRONT AIRBAGS DID NOT GO OFF. MY CONCERN IS THAT MY MOM KNEW SHE WOULD GET OUT BUT WHEN SHE TOOK A DEEP BREATH THE AIRBAGS KNOCKED HER AIR OUT. AND WE KNOW THE WINDOWS WERE DOWN BUT WENT UP. IF THE ELECTRICAL SHORTED OUT FROM BEING UNDER WATER, WHY DID THE WINDOWS GO UP AND NOT STAY WHERE THEY WERE, WHICH WAS OPEN. ALSO, THE DRIVERS SEAT MOVED FORWARD AFTER GOING INTO THE WATER. AND WE QUESTION IF AIRBAGS WENT OFF TO EARLY. BOTH THE AIR BAGS DEPLOYING AND WINDOWS GOING UP IMPEDED MY MOM GETTING OUT. THE POLICE REPORT SEEMS TO QUESTION WHY THE AIRBAGS WENT OFF ALSO. THERE WAS A REPORT THAT ANOTHER KIA SEDONA WAS DRIVING DOWN THE FREEWAY AND ALL THE DOORS FLEW OPEN. I'M WORRIED THAT WE WILL START SEEING MORE AND MORE ELECTRICAL PROBLEMS WITH KIA.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNDMB5C11G6"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "08/06/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896348,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FILLING THE GAS TANK TO FULL. STARTING THE CAR AND DRIVING IT, THE RPM'S FLUCTUATE DRASTICALLY, AND THE CAR \"BUCKS\" AT ANY SPEED (NO PARTICULAR SPEED, OBSERVED AT A STOP, ACCELERATING, CRUISE CONTROL, 45 MPH). ONCE THE GAS LEVEL IS LESS THAN FULL - AROUND 7/8 OF A TANK, THE VAN SEEMS TO DRIVE OK. THIS HAS HAPPENED ON 2 OCCASIONS. (2 FILL UPS TO FULL, 1 ADDITIONAL FILL UP TO 7/8 OF A TANK HAD NO ISSUE). THE SECOND FILL UP WAS THE WORST - THE CAR COMPLETELY SHUT OFF WHILE MAKING A TURN AT AN INTERSECTION. HAPPENED AGAIN THE SAME DAY, FROM A STOP, ACCELERATING TO TURN THE CAR SHUT OFF.",
        "vin": "KNDMB5C10G6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894257,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS ARE MANUFACTURED TO A SPECIFICATION THAT GIVES VERY LIMITED LENGTH OF VISIBILITY MAKING FAST HIGHWAY DRIVING AT NIGHT VERY DANGEROUS. DEALERSHIP SAID IT WAS NORMAL, MANUFACTURER IS LOOKING INTO IT. SIMPLY PUT THEY ARE BY DEGREES POINTED DOWNWARD TOO EARLY AND THIS PROVIDES VERY LIMITED VISIBILITY AND VERY LIMITED REACTION TIME IN THE EVENT OF A DEER OR OTHER ROAD HAZARD - FORCING YOU TO USE HIGH BEAMS AT ALL TIMES AT HIGHWAY SPEED AT NIGHT TO ENSURE REASONABLE VISIBILITY",
        "vin": "KNDME5C18G6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876584,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON IIHS WEBSITE IT MENTIONS THAT KIA REPROGRAMMED THE AUTO LOCK FEATURE SO THAT THE DOORS WOULD STAY CLOSED IN A CRASH AND REDUCE INTRUSION. HOWEVER IF SOMEONE IS DROPPED IF THE LOCK IS DISENGAGED WHILE THE ENGINE IS RUNNING, PERHAPS WHILE DROPPING OFF A PASSENGER, THE DOOR DOES NOT LOCK AGAIN WHEN DRIVING. THIS COULD DEFEAT THE PURPOSE OF THE AUTO LOCK FEATURE.",
        "vin": "KNDMB5C1XG6"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "03/05/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854452,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SEAT BELT UNLATCHES AND RETRACTS WHEN OBJECT ACCIDENTALLY SLID OFF CONSOLE BETWEEN FRONT SEATS AND FELL ONTO SEATBELT LOCKING MECHANISM. THIS OCCURRED DURING A LEFTWARD TURN. REPRODUCIBLE BY DROPPING CELL PHONE ONTO MECHANISM.",
        "vin": "KNDMC5C10G6"
    }
]