[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2022",
        "dateOfIncident": "02/18/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454124,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Kia Sportage. The contact stated while driving approximately 55 MPH, there was a knocking sound coming from the vehicle. The contact stated that the vehicle started losing motive power, without warning. The contact pulled over to the side of the roadway. The contact checked and became aware that there was no oil in the engine. The contact was unable to restart the vehicle. The vehicle was towed to an independent mechanic and diagnosed with engine failure. The vehicle was not repaired. The dealer and manufacturer were contacted and the contact was informed that an unnamed recall repair was not performed and no assistance would be provided. The failure mileage was 90,000.",
        "vin": "KNDPBCAC6G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452792,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on interstate and with no sound or warning light my car just shut off. Lucky I was able to get it off the side of the road. Tired to restart the car it would not start the engine was locked up. Had it towed home. Sent kia a email they said take it to my local Kia dealership to get it kia certified on what's wrong with it. Did so Kia said it was a turned or spun rod bearing. But denied to fix it because the knock sensor was not installed if I don't get a letter or a recall on it how was I suppose to know. As I done some research I see it's a very big problem with kia 2.4 l engines if it was a safety issue why was I not aware until this happened to my car. As its happened to many and lucky mine just smoked a little and did not catch fire.",
        "vin": "Kndpbcac4g7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2022",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452081,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN TOWN WHEN ALL OF A SUDDEN MY CAR STOPPED ,I GOT MY CAR TOWED TO MY HUSBANDS BUSINESS AND AFTER THAT I TOWED IT TO THE KIA DEALERSHIP ,WHERE I WAS TOLD MY CAR DID NOT HAVE A RECALL DESPITE THE RECALLS ON THIS VEHICLE AND UPON READING MORE INTO IT I SEE THAT IT DOES HAVE A RECALLS ON ENGINE FAILURE,mY CAR STOPPED ON A VERY BUSY ROAD AS WELL, WITH CARS FLYING BY ME ON A 6 LANE ROAD.tHERE WAS NO WARNING LIGHTS ON AS WELL AS ANY OTHER LIGHTS UNTIL THIS HAPPENED",
        "vin": "KNDPB3AC0G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451540,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's daughter owns a 2016 Kia Sportage. The contact stated that while his daughter was driving at an undisclosed speed, there was a knocking sound, and the vehicle lost motive power. The vehicle was towed to the dealer and diagnosed with engine failure. The contact was informed that the engine needed to be replaced. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure and informed the contact that there was a service campaign for the knock sensor mailed to the contact's daughter's residence; however, the contact's daughter had not received the service campaign notification. The manufacturer declined the engine replacement. The failure mileage was approximately 137,000.",
        "vin": "KNDPB3AC8G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451387,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "On 12/2/21 I was driving down 52 towards Lexington in the fast lane going about 66 MPH with my child in the back seat in her car seat when I noticed my 2016 Kia Sportage would not accelerate and suddenly went down to around 20 MPH resulting in more than one almost collisions to try to get off the highway. I then heard a loud knocking noise and my vehicle would not go over 15 MPH. There was not a single light on my dashboard that came on to alert me of the situation. I had the car towed to the auto shop I use until I could contact KIA. Bob King Kia (where I bought this one new as well as two other cars previously) said I had to have it towed there and have a diagnostic ($130) completed before they could help me. on 1/4/22 I had it towed there. This was a SCAM as they told me my engine failure was due to a recall that was not completed that I was never notified about and they would nor KIA would cover anything. Brian(Service Manager) there offered to reach out to his KIA sales manager to see if he could get an exception. To my knowledge this never took place according to two other individuals and I was lied to. When he reached out on 1/24/22 to let me know it was a NO he also told me my car was broken into on 1/18/22 and I was not notified of this prior. So now I have a 2016 Kia Sportage that I still owe money on that wont run and a broken window I had to put a claim on my insurance for that even as of 2/10/22 has yet to be fixed. It is sad though that they offered to give me $500 for my car that I owe about $5000.00 on or I could trade it in on another KIA and they would pay my car off. It is all a sales gimmick and people are taken advantage of.",
        "vin": "kndpb3ac8g7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "12/19/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446486,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine stopped completely while on the highway with my family",
        "vin": "KNDPB3AC3G7"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2021",
        "dateOfIncident": "07/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445377,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "the car was bought certified used from Galpin Kia which is no longer in business. That location closed down. I had gone 2 times with the same issue and they refused to look under the car & mechanic basically said chill out it’s fine.  Sent me to galpin Ford to which I talked to 2 employees and In tears expressed my fear and concern yet was told to relax and nothing was wrong .took to Kia  new location 2 times was told to come back and 3rd I refused to leave till it was looked at.  Mechanic said it was not in good shape and rep told me to not drive unless a emergency & would email me that night which was Saturday what  labor it needed and prices  and I’ve yet to hear back I followed up twice since and still no response ..the fact I was told not to drive & it mechanic stated to rep in Spanish, basically something with wheels and tires being eaten away while driving also a ball bearing cracked and they asked if I had receipts as it could be a lemon.. I try to keep all my conversations via chat or email for this very reason i also have emails I’ve communicated with corporate about the situation to which I had no response and most of the repairs that I got were at certified  kia service stations. It needed alignment 4-6 within 6 months. Car pulling badly and needed tires changed or alignment each time. Car feels like it’s gonna fall apart and at times the wheel kinda tightens up and I feel i don’t have control. I’ve been dealing with this over a year and no one has even bothered to check after my constant emails, calls voicing my concern & fear of driving. It sits in garage since while trying to get Kia to do something, pandemic hit and coincidentally the warranty conveniently expired. Please help",
        "vin": "KNDPB3AC4G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439858,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Kia Sportage. The contact stated that while his wife was driving 35 MPH, she heard abnormal loud knocking sounds coming from the engine. There were no warning lights illuminated. The contact's wife was able to continue to drive the vehicle. The contact stated that while he was taking the vehicle to the dealer the following day, the vehicle inadvertently stalled. There were no warning lights illuminated. The contact was unable to restart the vehicle after several attempts. The vehicle was towed to the dealer who diagnosed that the engine needed to be replaced. The dealer also informed the contact that they could not repair the vehicle under NHTSA Campaign Number: 18V907000 (Fuel System, Gasoline, Engine) because he had not taken the vehicle to their location before the engine failed. The manufacturer was not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 91,000.",
        "vin": "KNDPB3AC4G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422751,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I own a 2016 Kia Sportage which is still new. I've owned it for 2-3 years had about 32k miles on the vehicle when I purchased it in 2018. I currently have 50k miles now, I follow-up with dealership on my Oil Changes without having any issues. One day out of the blue it started making a knocking sound coming from engine, I contacted the Dealership they couldn't figure it out stating it was a known issue from the Back Rear seats locking latch not holding steady. I explained that it sounds like it's coming from front side of the vehicle in the engine. They advised me that I am okay so I took their word for it. Followed up on a routine Oil Service Change and again I advised the dealership to look into the knocking sound due to concerns that it doesn't seem right. My engine service lamps have never turned on but the sound has been a concern but once more the mechanic and service writer at the dealership assured me that their is nothing wrong explaining to me, it's just the A/C Ventilation Shutters underneath the front end of the vehicle it suddenly disabled itself and it's flapping when the vehicle is in motion making the knocking sound. I was in shock with what was said but they are the experts. Late 2020 just months later I arrive at the Dealership for my Oil Change was told by Service Writer that I have to perform their 30k Milestone Oil Service: Repl Engine Oil / Filter Inspection which cost $400 - $415. I was amazed that it cost so much but I went right ahead and told dealership let's do it. Halfway into 2021 the vehicles knocking sound that I've been questioning and complaining about started making a loud scary sound out of no where. I wouldn't operate or drive the vehicle. I contacted Dealership immediately but they are charging me for Engine Repair, probably have to buy a new engine cost in thousands. Impossible to be my fault I've questioned problems but was given no help. Found Engine Recalls 2016 Kia Sportage Vehicles received no assistance. Help me.",
        "vin": "KNDPB3AC6G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "03/19/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404008,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGAN MAKING A RATTLING NOISE IN THE ENGINE THEN IMMEDIATELY STOPPED RUNNING WHILE I WAS DRIVING. LUCKILY I WAS ON A COUNTY ROAD AND COASTED IN TO A DRIVEWAY. I HAD THE CAR TOWED TO MY HOUSE WHERE IT STILL RESIDES AND FEARING IT IS A ROD BEARING FAILURE IN THE MOTOR.",
        "vin": "KNDPB3AC7G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "01/27/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402767,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER WINDOWS ON RIGHT AND LEFT ARE NOT WORKING RIGHT",
        "vin": "KNDPBCAC2G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402588,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 12 2021 I WAS ON I-4 EAST TOWARD DAYTONA BEACH ABOUT 70 MILES PER HOUR AND ALL OF THE SUDDEN THE ENGINE STAHL. I WAS ABLE TO MOVE TO THE SHOULDER OF THE ROAD. THE TOW TRUCK DRIVER JUMPED THE BATTERY 3 TIMES AND THE ENGINE DIDN'T START,TOOK IT TO THE DEALER KEPT THE CAR OVERNIGHT DID ALL NECESSARY CHECKS EVERYTHING LOOKS FINE NO PROBLEM WITH THE BATTERY OR ANY OTHER THING.. THE NEXT DAY THE CAR START AS NORMAL, THEY DID A TEST DRIVE AND EVERYTHING WAS OK AS IF NOTHING HAD HAPPENED. I WENT AND TOOK THE CAR HOME AND AS OF THIS MOMENT IT SEEMS TO BE OK. MY BIG CONCERN NOW IS WHAT IF IT HAPPENS AGAIN WHILE DRIVING IN THE HIGHWAY. IT CAN CAUSE AN ACCIDENT RISKING MINE AND MY FAMILY LIVES.  IS THERE ANYTHING I CAN DO???",
        "vin": "KNDPB3AC0G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398664,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE OIL LIGHT KEPT FLASHING. A LOUD NOISE UNDER MY HOOD AND CAR WAS PULLING. CAR WAS UP TO DATE AND SERVICED 1/21.",
        "vin": "KNDPB3AC5G7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378542,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR JUST SHUTDOWN ON ME DOING 75 IN A 70. MILEAGE WAS NOT HIGH AND MAINTENANCE WASN'T NEED ACCORDING TO THE DASHBOARD. CAR WAS GREAT THEN JUST OUT OF NOWHERE SHUTDOWN DUE TO FAULTY ENGINE THEY KEEP SAYING.*JB",
        "vin": "KNDPB3AC7G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2020",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342820,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE NIGHT I WAS DRIVING MY CAR AND MY CAR ALL THE SUDDEN JUST QUIT GOING SO I TOOK IT TO THE KIA DEALERSHIP AND THEY TOLD ME WHEN THEY PUT IT ON THE COMPUTER THAT IT NEEDED A MOTOR MIND YOU THIS CAR ONLY HAS 60,000 MILES ON IT SO I SAID OKAY THEY WERE GOING TO REPLACE THE MOTOR BUT THEN THEY SAID THAT I NEVER DID AN OIL CHANGE WITH THEM WHICH WAS A LIE BUT I DIDN'T HAVE MY RECEIPTS SO THEY WOULDN'T REPLACE MY MOTOR PLUS THERE'S TWO OTHER RECALLS ON THIS BESIDES THE MOTOR THE FUEL LINE AND THE AIRBAGS",
        "vin": "KNDPCCAC2G7"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331986,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM STARTED A COUPLE OF MONTHS AFTER PURCHASING MY CAR, EVERYTIME WE WOULD GO GET A OIL CHANGE THE SERVICE FACILITY WOULD TELL US THAT OUR OIL WAS LOW AND WE DIDN'T SEE HOW WHEN WE WOULD HA E IT CHANGED REGULARLY SO WE WAS LOOSING OIL AND DIDN'T KNOW WHERE BACK IT WAS LEAKING ON THE GROUND AND IT WASN'T VISIBLE WHEN YOU WOULD LOOK UNDER THE HOOD SHE WE TOOK IT TO KIA AND THEY STATED THAT THEY DIDN'T SEE ANYTHING WRONG, IF THE PROBLEM CONTINUE TO BRING IT BACK AND THEY WOULD DO A DIAGNOSTIC ON THE VEHICLE TO GET TO THE PROBLEM SO I CALLED KIA CORPORATE OFFICE THEY TOLD BE THAT THEY WOULD WRITE OUT A INCIDENT REPORT AND TAKE IT TO KIA I INFORMED THEM THAT I DID THAT AND CORPORATE BASICALLY  SAID TO FOLLOW THE SHOP RECOMMENDATIONS CAUSE MY VEHICLE DIDN'T HAVE A ACTIVE RECALL ON IT  SO I REACHED OUT TO NHTSA TO REPORT THE ISSUES I HAVE HAD AND TO ALSO LET SOMEONE ELSE NO I HAVE HAD ISSUES THE VEHICLE WAS HAVING AND  NOT EVEN A MONTH LATER THE CAR STARTED JERKING AND BROUGHT IT BACK TO KIA AND THEN  AGAIN SAID THAT IT WASN'T NOTHING THEY CAN DO IT WASN'T A RECALL ON THE VEHICLE SO LAST WEEK I WAS DRIVING THE VEHICLE ON MY WAY TO WORK THE CAR STALLED AND COMPLETELY DIED IN THE MIDDLE OF THE HIGHWAY STOPPING TRAFFIC I HAD HELP SAFELY GET IT TO THE SIDE OF THE ROAD AND IT WOULDN'T CRANK SO I HAD TO HAVE IT TOWED HOME THEN CALLED KIA AND SPOKE TO A SERVICE AND  THEY STATED THERE  WAS A BULLETIN OUT FOR MY VEHICLE, I WAS TOLD IT WAS THE CAMSHAFT, TIMING AND SOMETHING TO DO WITH THE OIL CANISTER, I DON'T SEE WHY THE VEHICLE HAVEN'T BEEN RECALLED IF THEY KNOW THERE ARE ISSUES WITH THEM THIS IS A 2016 VEHICLE IT IS FAIRLY NEW AND IT HAS SO MAY ISSUES.  *TR",
        "vin": "KNDPB3AC8G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/14/2020",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328816,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HI,  WITH THE WINDOWS CLOSED AND THE A/C ON, THE OUTSIDE ODORS,  GET IN TO THE VEHICLE INTERIOR. I KEEP THE AIR INTAKE CONTROL BUTTON ON. THE DEALER CHANGED THE AIR FILTERS. THAT HAPPEN WHILE I DRIVING CLOSE TO OTHER VEHICLES. THIS HAPPEN ALL TIME.*DT",
        "vin": "KNDPC3AC6G7"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2019",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289135,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE OF THE CAR JUST DIED ON ME WHEN I WAS TURNING RIGHT AT THE INTERSECTION. UNKNOWN  CAUSE WHY THE ENGINE JUST DIED ON ME. I TRIED STARTING IT, AND IT WOULD START AND DIE AGAIN. IF I START THE CAR AND STEP ON THE GAS, THE ENGINE DOES NOT DIE BUT ONCE I RELEASE FROM THE GAS, THE ENGINE DIES AND I SMELL A STRONG GAS ODOR.",
        "vin": "KNDPBCAC0G7"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/24/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286404,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE HERD A LOUD POP NOISE OUT SIDE 7 AM  SUNDAY LOOK OUT SIDE DID NOT SEE ANY PROBLEM.  WE WERE GETTING READY TO LEAVE FOR CHURCH WENT TO WARM UP CAR AND I NOTICED SOME GLASS  AND FOUND THAT THE PANORAMIC GLASS WAS SHATTERED. CAR IS KEPT UNDER  CAR PORT.. I AM AWARE THAT SOME OF THESE CARS HAVE WINDOWS EXPLODE",
        "vin": "KNDPC3AC5G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "01/26/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276987,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2016 KIA SPORTAGE AND IN JANUARY 2019 ON A TRIP TO A NEARBY TOWN THE CAR ENGINE STARTED TO CATCH. AT THIS TIME THE CAR ONLY HAD ABOUT 29,000 MILES ON IT AND HAD THE OIL CHANGED ABOUT 4 WEEKS PRIOR. MY HUSBAND CHECKED THE ALL THE FLUIDS AND FOUND THE CAR HAD VERY LITTLE OIL IN IT. WE WERE SURPRISED SINCE NO WARNING LIGHTS EVER CAME ON AND WE HAD JUST CHANGE THE OIL. HE PUT OIL IN IT AND WATCHED IT AND AGAIN 2 WEEKS LATER THERE WAS VERY LITTLE OIL IN THE CAR. I TOOK IT TO THE DEALER AND EXPLAIN ALL OF THIS. THEY TOOK A PICTURE  OF THE INSIDE OF MY MOTOR  AND SAID IT WAS LIKE SLUDGE  THEN PUT IT ALL BACK TOGETHER  AND  BLAMED EVERYTHING ON US VOIDED THE WARRANTY . THE CAR CANNOT BE DRIVEN OVER ABOUT 45MPH.  UPON FURTHER RESEARCH I FOUND THAT THERE WAS AN OIL DELIVERY SYSTEM PROBLEM THAT CAUSES EXCESSIVE WEAR ON THIS MOTOR THAT KIA IS REFUSING TO DEAL WITH IT. AFTER REVIEWING THIS RESEARCH I WAS AFRAID TO DRIVE IT BECAUSE BECAUSE THERE WERE REPORTS THAT THE ENGINE SEIZES AND CATCHES ON FIRE.",
        "vin": "KNDPB3ACXG7"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/27/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258484,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ENTERING A PARKING SPACE ON POINTS OF ROCK ROAD IN BREWSTER,  A QUIET STREET NEAR THE BEACH  AND THE CAR PROCEEDED UP AN EMBANKMENT,DID NOT RESPOND TO BRAKING AND PROCEEDED TO ROLL OVER ONTO THE ROOF OF THE CAR ABD DID NOT SHUT OFF UNTIL I PUSHED THE BUTTON TO TURN OFF THE CAR SEVERAL TIMES",
        "vin": "KNDPCCACXG7"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "08/27/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253432,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WOULDN'T RUN RIGHT WE TOOK IT IN THEY SAID IT WAS THE CRAN SENSOR CHARGED 900 TO FIX IT. THEN THAT DIDN'T WORK NOW IT IS THE ENGINE HARNESS AND THEY WANT 3400 TO FIX IT. IF I SAY FIX IT WHAT WILL BE NEXT.  THEY DON'T WANT OT REPAIR IT JUST REPLACE",
        "vin": "KNDPB3AC7G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246583,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "P1326 GLOW RELAY STUCK ON",
        "vin": "KNDPBCAC3G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "04/23/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223185,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE SALES MAN AT A BETTER WAY WHOLESALE AUTOS INC423 RUBBER AVENAUGATUCKCT06770 REFUSED TO SHOW THE CAR FAX AND STATED THAT IT WAS CLEAN ONLY HAVING OIL CHANGES LISTED. YESTERDAY KIA MECHANIC STATED THE CAR IS NOT TO BE DRIVEN SINCE IT IS A DEATHTRAP AND THE BACK END CAN FALL OFF AT ANY TIME. CALLED THE DEALER 5 TIMES, SPOKE WITH 10 PEOPLE WITHOUT GETTING A HOLD OF TJ SALES MGR.",
        "vin": "KNDPBCAC9G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209271,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 KIA SPORTAGE BEGAN EMITTING LIGHT SMOKE OUT OF THE EXHAUST. WE BECAME CONCERNED AND ASKED OUT DEALER TO LOOK INTO THINGS. THE DEALERSHIP SAID THEY NEEDED TO DO TESTS (THIS CONSISTED OF FILLING THE OIL UP AND ASKING US TO DRIVE 1500MILES) WE DID AS THEY ASKED AND PITHING 700MILE THE ENGINE STARTED TO MAKE CLACKING NOISES AND ON 2 OCCASIONS LOST POWER. WE RETURNED THE CAR TO THE DEALERSHIP STATING OUR CONCERNS, THEY WANTED TO REPEAT THE TEST BUT WE REFUSED TO DRIVE THE CAR. THE DEALERSHIPS COMMUNICATION WAS VERY POOR, NEVER REPLYING TO OUR CALLS OR EMAILS SO WE DECIDED TO CONTACT CONSUMER AFFAIRS. THE FIRST CALL WAS GREAT, VERY SUPPORTIVE AND INFORMATIVE. SAID THEY WOULD HELP AND WE WOULD BE TOTALLY COVERED. THIS IS AS GOOD AS THINGS GOT, CONSUMER AFFAIRS PROCEEDED TO REPEAT THE SAME POOR COMMUNICATION AS THE DEALERSHIP SHOWED AND NOT REPLY TO CALL AND IF THEY DID TAKE A CALL SAID WE NEEDED TO SPEAK TO OUR CASE WORKED WHO WAS NEVER IN WORK THAT DAY. FINALLY THE DEALERSHIP SAID THAT THE ENGINE HAD SLUDGE IN THE ENGINE AND IT WOULD NEED A COMPLETE REPLACEMENT (THIS IS A 3 YEARLY CAR WITH 60,000 MILES) KIA REFUSED TO HONER THE WARRANTY AS WE DIDN'T HAVE ENOUGH SERVICE RECORDS (NEVER STATING WHAT WAS ENOUGH) AND NOW WE ARE IN THE PROCESS OF APPEALING AND CONSUMER AFFAIRS AND THE DEALERSHIP ARE REPEATING THE LACK OF COMMUNICATION WITH US.",
        "vin": "KNDPBCAC3G7"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208679,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HESITATED OR CHOKED WHEN ACCELERATING TO CHANGE LANES AND A CLOUDY FUME EMITTED FROM THE REAR. THIS HAS HAPPENED 5 TIMES IN THE SPAN OF 2 WEEKS, BOTH ON FREEWAY AND SURFACE STREETS. SEVERAL TIMES CAME VERY CLOSE TO GETTING REAR ENDED.",
        "vin": "KNDPB3ACXG7"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11196924,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 24TH 2019 AT 7:45 P.M. I WAS INVOLVED IN A HEAD-ON COLLISION THAT RESULTS IN MY CAR BEING PUSHED ACROSS THE STREETS AND HITTING THE CURB ON THE OTHER SIDE OF THE STREET CAUSING MY VEHICLE TO BE COMPLETELY TOTALED NONE OF MY AIRBAGS DEPLOYED WHICH CAUSED ME TO HIT EVERYTHING ON THE INSIDE OF MY VEHICLE I WAS INJURED I HAD A CERVICAL SPRAIN A CONCUSSION I ALSO HAD NERVE DAMAGE TO THE RIGHT SIDE OF MY BODY I ALSO HAD A BULGING DISC IN THE TOP OF MY NECK AND IN THE LOWER PART OF MY BACK THE SEAT BELTS DID NOT HOLD ME IN PLACE WE WERE GOING 35 MILES PER HOUR IN MOTION I CONTACTED THE MANUFACTURER OF KIA THEY CAME TO READ THE DATA FROM MY VEHICLE'S BLACK BOX AND I WAS TOLD THAT THE VEHICLE WAS NOT HIT WITH ENOUGH FORCE FOR THE AIRBAGS TO DEPLOY HOWEVER THE VEHICLE THAT HIT ME WAS A 2002 MUSTANG IN ALL OF THEIR AIRBAGS DEPLOYED",
        "vin": "KNDPC3AC4G7"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "04/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196527,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I'M GOING DOWN THE ROAD IT JUST FADES OUT, NO WARNING OR CHUGGING,I HAVE TO MOVE TO THE SIDE OF THE ROAD AND TURN THE CAR OFF AND RESTART IT, THEN IT'S OK(?) SO TO SPEAK..IT'S ONLY HAPPENED TWICE AND I WAS ON A BACK ROAD HOME BOTH TIMES. BUT WHAT IF I'M ON THE FREEWAY AND TRYING TO PASS A SEMI AND IT DOES THIS, I COULD BE KILLED OR INJURED...WHAT COULD POSSIBLE BE GOING ON? THANK YOU FOR YOUR TIME ON THIS MATTER...(XXXXX)    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "KNDPBCAC4G7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183330,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXTERIOR LIGHTING IS NOT GOOD AT ALL. SINCE I'VE HAD THE VEHICLE, GOING ON 4 YEARS, I STILL SWITCH THE LIGHTS OFF THEN ON BECAUSE I CAN'T SEEM TO SEE IN FRONT OF ME. IT'S ESPECIALLY BAD WHEN DRIVING IN THE DARK WHILE RAINING. I'VE TRIED TO GET BRIGHTER HEADLIGHTS BUT THEY ARE VERY COSTLY AND ALMOST IMPOSSIBLE TO OBTAIN THEM ANYWAY. POOR EXTERIOR LIGHTING.",
        "vin": "KNDPB3AC4G7"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "12/28/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11180068,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 KIA SPORTAGE. WHILE THE CONTACT'S SON WAS MAKING A RIGHT TURN AT 5 MPH, HE LOST CONTROL OF THE VEHICLE. THE STEERING SEIZED, WHICH CAUSED THE VEHICLE TO CRASH INTO A TREE AND BURST INTO FLAMES. IT WAS UNKNOWN IF THE AIR BAGS DEPLOYED. THE CONTACT'S SON SUFFERED A CONCUSSION AND SOUGHT MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE VEHICLE WAS DEEMED TOTALED BY THE CONTACT'S INSURANCE COMPANY. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE AND VIN WERE UNKNOWN. *TT*JB",
        "vin": "KNDPCCAC3G7"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11173110,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER, WAS INVOLVED IN AN ACCIDENT ON 1/29/19 AT 7:45AM. SHE  WAS STOPPED AND A TRUCK HIT HER FROM BEHIND AND SHE HIT THE VEHICLE IN FRONT OF HER. THE AIR BAGS DID NOT GO OFF AND SHE HIT HER HEAD ON WHEEL, AND WINDSHIELD. HER SON WHO WAS IN BACK IN HIS CAR SEAT, ALSO HIT HIS HEAD. THEY BOTH SUSTAINED SEVERE CONCUSSIONS, BLACK EYES, HEAD ACHES, WHIP LASH. THE SEAT BELT DID NOT HOLD EITHER OF THEM IN PLACE NOR DID THE AIR BAGS GO OFF.",
        "vin": "KNDPB3AC5G7"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/21/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171342,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SPORTAGE. WHILE DRIVING VARIOUS, THE VEHICLE NEEDED AN EXCESSIVE AMOUNT OF TIME TO COME TO A COMPLETE STOP WHEN THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO DUTCH MILLER KIA OF CHARLESTON (335 MACCORKLE AVE SW, SOUTH CHARLESTON, WV 25303, (855) 739-5369) WHERE IT WAS DIAGNOSED THAT THE REAR BRAKE PADS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 23,000. *TT  CONSUMER STATED REAR BRAKE CALIPERS FAILED.*JB",
        "vin": "KNDPBCAC9G7"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "10/03/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11166418,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG CAME OUT BUT DID NOT INFLATE IN HEAD ON COLLISION SEAT BELT DID NOT RESTRAIN 40 MPH HEAD ON IN MOTION",
        "vin": "KNDPB3AC5G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132388,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9/28/2018 WHILE DRIVING ON THE HIGHWAY MY SUNROOF IN MY 2016 KIA SPORTAGE EXPLODED . THERE WAS NO REASON FOR THIS TO OCCUR.",
        "vin": "KNDPCCAC9G7"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122233,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 60MPH ON HIGHWAY 225 WHEN THE OIL LIGHT FLASHED ON THEN OFF AND THEN I HAD NO CONTROL OF THE CAR. THE WHOLE CAR SHUT DOWN AND I WAS ABLE TO COAST TO AN EXIT AND INTO A BUSINESS (DONUT TIME) IN PASADENA, TX. THE BRAKES WERE NOT WORKING. I THOUGHT I WAS GOING TO CRASH INTO THE BUSINESS. I STOPPED SHORT OF BEING IN AN ACTUAL PARKING SPOT. I WAS FORTUNATE THERE WERE NO OTHER CARS AROUND THIS TIME. A LADY WHO WORKED THERE CAME OUT AND ASKED WHAT WAS GOING BECAUSE SHE COULD SEE I DID NOT STOP OR HAVE CONTROL.    I HAD THE CAR TOWED TO KIA AND TURNED IN MY SERVICE RECORDS. THEY CLAIM IT WAS NOT MAINTENANCED AND HAD SLUDGE AND TO TALK TO MY MECHANIC. I COULD HAVE DIED AND THEY  ARE BLAMING ME FOR THEIR DEFECT. I AM STILL UNDER WARRANTY WITH 50441 MILES. AFTER LOOKING IT UP, I SAW OTHERS BEING DENIED AS WELL WITH THE SAME ISSUE. MY CAR HAS THE THETA II ENGINE AND THERE IS A CLASS ACTION IN PROGRESS.     I FELT THAT I SHOULD SHARE MY SITUATION AND HELP IN ANYWAY BECAUSE IT IS UNSAFE.",
        "vin": "KNDPC3AC3G7"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "06/23/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105067,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I WERE DRIVING OUR 2016 KIA SPORTAGE THAT WE HAD BOUGHT ON 05/23/2018 (JUST MADE THE FIRST PAYMENT THE DAY BEFORE) TO MYRTLE BEACH SC, WE HEARD A POP, I LOST FUNCTION TO THE GAS, PULLED TO THE SIDE OF THE ROAD AND POPPED THE HOOD TO FIND FIRE FLAMES COMING FROM THE ENGINE. WE GRABBED WHAT WE COULD OUT OF OUR CAR AND RAN AS FAR AWAY AS WE COULD. IT WASN'T EVEN 2 MINUTES LATER AND THE WHOLE CAR WAS IN FLAMES AND EVERYTHING WAS DESTROYED. ALL THAT WAS LEFT WAS THE FRAME OF THE CAR. WE JUST GOT MARRIED IN OCTOBER OF 2017, THIS WAS OUR FIRST MARRIED PURCHASE AND WAS SUPPOSE TO BE OUR FAMILY CAR AND WE WATCHED IT BURN TO THE GROUND IN FRONT OF US. WE ALSO LOST A LOT OF VALUABLES IN THE FIRE.",
        "vin": "KNDPB3AC1G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061318,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED ON I10 FREEWAY AT 65 MPH CAR BEHIND GOT GLASS FRAGMENTS",
        "vin": "KNDPC3AC3G7"
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "09/03/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11043829,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPT 3 2017 I WAS INVLOVED IN AN ACCIDENT IN WHICH MY DRIVER SIDE AIR BAG DEPLOYED LEAVING ME WITH SEVERE BRUISES ON ABDOMAN AND BURN MARKS ON MY LEFT FOREARM. I WENT TO HOPSPITAL AND HAD AN ULTRASOUND DONE. OUR CAR WAS TOTALLED AND WANTED TO MAKE SURE THAT I AM GOING TO NOT HAVE ANY FURTHER MEDICAL ISSUES I HAVE POLICE REPORTS AND MEDICAL REPORT TO BACK THIS UP.  [XXX]      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "KNDPCCAC9G7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "09/15/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039736,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SPORTAGE. ON SEVERAL OCCASIONS, WHILE DRIVING, THE VEHICLE STALLED AND LOST POWER WITHOUT WARNING. THE VEHICLE WAS TAKEN TO JIM BUTLER KIA (722 LONG RD CROSSING DR, CHESTERFIELD, MO 63005 (636) 256-9600) AND THE TECHNICIAN STATED THAT THE FAILURE WAS A KIA MANUFACTURING ENGINEERING ISSUE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT THE CONTACT HAD NOT RECEIVED A CALL BACK. THE APPROXIMATE FAILURE MILEAGE WAS 16,000.",
        "vin": "KNDPB3AC6G7"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035826,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 KIA SPORTAGE WHEN I PULL OUT IN TRAFFIC IT HESITATES WHEN I PUSH THE GAS ITS LIKE WE HAVE NO GAS.IT DOESNT DO IT ALL THE TIME BUT WHEN IT DOES IT THAT WILL SCARE THE KRAP OUT OF YOU ESPECIALY WHEN ONCOMING TRAFFIC IS COMING AT YOU.YOU ASK WHEN IT HAPPENED WELL IT HAS HAPPENED NUMEROUS TIMES IF NOT FIXED THIS COULD RESULT IN A LAW SUIT",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "08/19/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031540,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT BACK EXHIBITS MOVEMENT WHEN IT IS IN A LOCKED POSITION.  WHILE DRIVING AND WITH THE SEAT BELT FASTEN, CAN FEEL THE SEAT BACK MOVE SLIGHTLY FORWARD DURING BRAKING OR WHILE BRAKING GOING DOWNHILL.  WHILE DRIVING ON A FLAT ROAD SURFACE, CANNOT FEEL SEAT BACK MOVEMENT.  UPON NOTICING MOVEMENT, TRIED PHYSICALLY TO MOVE SEAT BACK (WHILE NOT SITTING IN THE SEAT) AND THE SEAT BACK DOES EXHIBIT MOVEMENT WHILE MOVING THE SEAT IN A ROCKING SIDE TO SIDE (LEFT TO RIGHT) MOTION, BUT CANNOT FEEL MOVEMENT WHEN MOVING THE SEAT IN A ROCKING (FRONT TO BACK) MOTION.  WHILE THE PASSENGER SEAT EXHIBITS A SLIGHT MOVEMENT JUST LIKE THE DRIVER'S SEAT, THE MOVEMENT IS MORE NOTICEABLE WITH THE DRIVER'S SEAT. TOOK THE VEHICLE TO A KIA DEALERSHIP SERVICE DPT. AND WAS TOLD THE MOVEMENT WAS NORMAL AND THERE WERE NO ISSUES WITH THE SEATS. VEHICLE WAS PURCHASED USED AND ISSUE FIRST NOTICED WITHIN A MONTH OF PURCHASE.",
        "vin": "KNDPBCAC5G7"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993194,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIGNAL LIGHTS: WHILE MERGING ONTO FREEWAY/CHANGING LANES, NEAR REAR END COLLISIONS AND SIDE SWIPES HAVE OCCURRED NUMEROUS OF TIMES. I HAVE CONTRIBUTED THE INCIDENTS TO THE LOCATION OF THE SIGNAL LIGHTS ON BOTH FRONT AND REAR.  REAR SIGNAL LIGHTS ARE NOT POSITIONED IN TRADITIONAL LOCATION (I.E. CONJUNCTION WITH BRAKE LIGHTS). INSTEAD, REAR SIGNALS ARE LOCATED ON THE BUMPER FAR BELOW BRAKE LIGHTS. THESE LIGHTS ARE STRIPS NOT STANDARD SIZE AND, THEREBY, POSSIBLY NOT SEEN BY  DRIVERS WHO ARE USED TO SEEING THEM IN TRADITIONAL LOCALS ON OTHER VEHICLES.  ADDITIONALLY, THE FRONT SIGNAL LIGHTS ARE LOCATED IMMEDIATELY ADJACENT TO THE GRILL. AS THIS KIA MODEL HAS NO SIGNAL INDICATORS TO THE OUTERMOST PORTION OF THE VEHICLE I.E. SIDE MOUNTED MIRRORS WITH SIGNALS, OTHER MOTORISTS HAVE NO INDICATION THAT A LANE CHANGE/TURN IS COMMENCING.  PHOTOS PROVIDED SHOW VIEW FROM A TOYOTA WHICH HAS A LOW PROFILE. ONE PHOTO IS FROM THE KIA SPORTAGE 2016 WHICH HAS A HIGHER PROFILE IN REGARDS TO THE NORMAL LINE OF  SIGHT TO TRADITIONAL SIGNAL LIGHT LOCATIONS.  I HAVE RETURNED TO THE KIA DEALERSHIP AND CONTACTED SEVERAL OTHERS AND WE WERE ALL AMAZED TO LEARN THAT ALL KIA SPORTAGE MODELS OF THIS YEAR SHARE THIS UNIQUE CHARACTERISTIC.   OTHER MODELS HAVE SIGNAL LIGHTS IN TRADITIONAL LOCALS AND INCLUDE SIGNALS MOUNTED ON THE SIDE VIEW MIRRORS ALERTING MOTORISTS WITHOUT OBSCURITY THAT A LANE CHANGE/TURN IS IMMINENT.  WE PURCHASED THIS VEHICLE IN MARCH THIS YEAR AND MY WIFE AND I HAVE EXPERIENCED COUNTLESS OF NEAR MISSES. FINALLY, I DECIDED TO CHECK TO SEE IF MY SIGNALS WERE WORKING PROPERLY AND THAT IS WHEN I DISCOVERED THE UNIQUE CHARACTERISTIC OF THIS KIA MODEL.  I DID CONTACT KIA AND THEY SAID THAT THEY WOULD PASS IT ON TO THEIR DESIGN TEAM.  CASE NUMBER IS 12346548.  NOW THAT MY WIFE AND I ARE AWARE WE TAKE EXTREME CAUTION, BUT LESS EXPERIENCED MOTORISTS ARE STILL AT RISK.  THANK YOU.",
        "vin": "KNDPBCAC5G7"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "04/18/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983332,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING ISSUES WITH MY ENGINE DYING/STALLING RANDOMLY WHILE DRIVING WITH THE CAR IN MOTION AND SLOWING DOWN WITH NO SIGNS OR INDICATIONS OF AN ISSUE ATLEAST 6 TIMES SINCE HAVING THE VEHICLE WHICH I HAVEN'T HAD FOR A YEAR YET. TWO TIMES I WAS ALMOST INVOLVED IN AN ACCIDENT WHEN THIS PROBLEM OCCURRED, I HAD TAKEN THE CAR TO THE SERVICE CENTER AND WAS TOLD \"COULD NOT VERIFY CUSTOMERS CONCERN SCANNED WITH KIDS NO CODES FOUND TEST DROVE VEHICLE AND VEHICLE DROVE AND SOUNDED FINE AT THIS TIME WITH NO ISSUES RECOMMEND HAVING TOWED NEXT TIME IT STALLS\" AND THAT IT COULD BE ANYTHING AND THE CAR COULD BE THERE FOR HOURS, MY FEAR IS THEY WILL JUST REPLACE RANDOM PARTS THEY THINK COULD BE THE ISSUE AND IT WILL STILL OCCUR AND NEXT TIME I COULD BE INVOLVED IN A SERIOUS ACCIDENT, I DO NOT FEEL SAFE IN THIS VEHICLE SO I HAD TO PURCHASE A NEW ONE THE SAME DAY AS THE SALESMAN MOVED THE CAR OVER TO MY NEW ONE I HAD STALLED ON HIM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2017",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965902,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 KIA SPORTAGE. WHILE DRIVING 10 MPH, THE VEHICLE HESITATED AND FAILED TO BACKPEDAL FOR 2-3 SECONDS. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT A CERTAIN COMPONENT FAILED AND NEEDED TO BE REPLACED. THE CONTACT DID NOT KNOW THE EXACT COMPONENT. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 19,000.",
        "vin": "KNDPC3AC0G7"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872433,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MORNING I WAS BACKING OUT OF MY DRIVEWAY WHEN ALL OF A SUDDEN I HEARD A LOUD BANG. I GOT OUT TO LOOK, ASSUMING IT WAS A TIRE. UPON LOOKING OVER THE VEHICLE I COULD NOT SEE ANY ISSUES BUT DID NOTICE A CRACKLING SOUND. WHEN I LOOKED ON THE TOP OF THE CAR THE REAR SECTION OF THE PANORAMIC SUNROOF WAS SHATTERED IN EACH CORNER AND WHEN I LOOKED CLOSER I NOTICED IN THE CENTER IT WAS CRACKED AS WELL BUT WAS STILL BEING HELD TOGETHER. I DECIDED THAT I NEEDED TO TAKE THE CAR STRAIGHT TO THE DEALERSHIP (70 MILES AWAY). BY TIME I GOT THERE THE BACK PORTION OF THE SUNROOF LOOKED EVEN WORSE AND WAS STARTING TO CAVE IN. THE SERVICE MANAGER STATED HE HAD NEVER SEEN THIS HAPPEN BEFORE AND THAT I NEEDED TO GET IN CONTACT WITH MY INSURANCE AS THEY WOULD MORE THAN LIKELY NOT COVER THIS UNDER MY WARRANTY OR EVEN MY EXTENDED WARRANTY THAT I HAD PURCHASED. KEEP IN MIND I BOUGHT THIS ONLY 36 DAYS AGO, BRAND NEW OFF THE LOT. THE SERVICE MANAGER CLAIMED HE SAW A CHUNK OF METAL IN THAT PORTION OF THE SUNROOF AND CLAIMED THAT OBVIOUSLY SOMETHING HAD HIT IT. HOWEVER, AS I POINTED OUT TO HIM, THAT WAS NOT METAL AT ALL BUT SIMPLY A CHUNK OF GLASS AT A DIFFERENT ANGLE FROM THE GLASS SLOWLY FALLING INWARD. THE CURRENT MILEAGE ON MY CAR IS 6,500 MILES. I HAVE ATTACHED 4 IMAGES. 3 ARE OF WHEN IT INITIALLY HAPPENED AND THE LAST ONE IS WHAT IT LOOKED LIKE WHEN I GOT IT TO THE DEALERSHIP.",
        "vin": "KNDPC3A64G7"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "01/02/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850519,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL WHEN PULLING OUT INTO TRAFFIC THE GAS PETAL SOMETIMES DOESN'T WORK. THIS IS A VERY UNSAFE CONDITION, BECAUSE OF ON COMING TRAFFIC.",
        "vin": "KNDPB3AC4G7"
    }
]