[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451061,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Around the middle of the month of January of 2022, I discovered that my 2016 Lexus RX350 has massive oil leak from timing chain cover. Thompson Lexus dealership confirmed this oil leak. This leak not just happened, but it has happened long ago at least 6 months prior to the time that I discovered based on old oil dirty debris deposits and paints popped out and rusted caused by prolong oil on the frame. The reason that did not detect the oil leak right away was that I have almost not used the car at all for the past two years due to Covid situation. Second, I have parked my car on my lawn, so that could not see oil drops. Third, I put my trust on Lexus and Toyota products, so I have not inspected for oil leak periodically. This oil leak has soaked many parts of the engine, frame, electrical connections, and possibly other moving parts such pulleys and belts. This can potentially create smoke or fire hazard and belt and pulley slippery which can lead to accidents. At the time of the oil leak, my car was under 54,000 miles and under 6 years, so it was still under powertrain warranty with is 6 years and 70,000 miles. I have contacted Lexus several times regarding this matter. I told them about location of the oil leak and when oil started leaking, my car was still under powertrain warranty but Lexus refused to pay for the timing cover repair. After doing research on RX350 from timing chain cover, I have found out that a lot of Lexus RX350 has developed oil leak from timing chain cover since year 2009 or 2010 model to 2016 year model. Some RX350 developed timing chain cover oil leak from a few thousand miles of first use to 38,000 miles. Lexus was aware of the problem, but completely ignored and failed address the problem and issue a recall.",
        "vin": "2T2BZMCA3GC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437699,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The sunroof exploded while driving at freeway speeds with no apparent reason. Temperature was 75 degrees outside.",
        "vin": "2T2ZZMCA1GC"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/17/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437100,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "ECOPIA H/L 422 PLUS",
                "productYear": "9999",
                "size": "235/55R20",
                "type": "Tire"
            }
        ],
        "summary": "I brought my vehicle in for damage sustained due to flooding from hurricane Ida. I was told that part of the damage was to 3 tires. I was later informed that the tires need to be replaced due to wear & tear. This vehicle had 18,969 miles of local driving at the time. I’ve never heard of tires being “worn out” on a vehicle purchased brand new with such low mileage. There has to be some kind of defect!",
        "vin": "2T2BZMCA9GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431656,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "“low braking power” message",
        "vin": "2T2ZZMCA8GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/31/2021",
        "dateOfIncident": "04/29/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419107,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "On April 29 while travelling on I185 toward Columbus, GA I heard a loud noise followed by the sound of crumbled glass. When I could find a safe place to pull over, I looked and discovered that my moonroof had shattered. Had the curtain under the moonroof had not been drawn, I would have been hit with the shattered glass, probably resulting in my loss of control over the vehicle at interstate speed, resulting in a serious accident or death. I returned immediately to my dealership, Hennessy Lexus in Duluth, Georgia. They contacted the Lexus regional manager, who denied Lexus' responsibility for the failure. I did, (and needed to) have the moonroof repaired by the dealership. I also contacted Lexus Corporate office by phone, and sent them by email a copy of photos of the broken moonroof and the invoice for the repair. They passed my inquiry down to the regional manager (again) who again denied Lexus responsibility for the failure. The failure occurred in fair weather on a highway with very little traffic, trees or overpasses, and there was no reason to believe that any outside forces caused the failure. I feel that this potentially dangerous failure is a result of poor manufacture or design.",
        "vin": "2t2zzmca8gc"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406705,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KNOCKING SOUND COMING FROM THE ENGINE AT ~50K MILES. TOOK IT TO A LEXUS SERVICE CENTER AND WAS INFORMED THAT THE SOUND WAS FROM A FAILING BRAKE VACUUM PUMP. IF NOT ADDRESSED, THE FAILING PUMP COULD MAKE BRAKING THE VEHICLE EXTREMELY DIFFICULT AND POTENTIALLY CAUSE AN ACCIDENT. THE 2017 RX350S HAVE A RECALL FOR THIS EXACT ISSUE BUT NOTHING FOR THE 2016 RX350S. DISAPPOINTED THAT A VEHICLE THAT HAS BEEN DILIGENTLY MAINTAINED WITH ONLY ~50K MILES IS ALREADY HAVING ISSUES WITH FAILING PARTS THAT COULD CAUSE A SERIOUS ACCIDENT.",
        "vin": "2T2BZMCA8GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404010,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN HIGHWAY AND HEARD A LOUD EXPLOSION. I WAS VERY SHAKEN UP.  IT WAS A SCARY EXPERIENCE.  I WAS TRAVELING 220 CROSS LAKE BRIDGE AND AT TIME COULD NOT PULL OVER. I KEPT HEARING CRUNCHING NOISE ABOVE ME. I OPENED SUNROOF INSIDE COVER AND THAT'S WHEN I NOTICED THE SUNROOF WAS SHATTERED AND IT WAS WHAT HAD EXPLODED.",
        "vin": "2T2ZZMCA7GC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397341,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KELLY EDGE A/S TIRES WENT BALD AFTER 6100 MILES OF LIGHT CITY DRIVING.",
        "vin": "2T2BZMCA4GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389298,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RODENT DAMAGE TO THE ELECTRICAL WIRING HARNESS OF MY 2016 LEXUS RX 350 CAUSED BY LEXUS USING A SOY BASE COVERING ON THE WIRES THAT ATTRACT RODENTS. LEXUS TAKES NO RESPONSIBILITY FOR THE REPAIR THAT COST THOUSANDS OF DOLLARS. NOT TO MENTION A SAFETY ISSUE. THIS IS A COMMON PROBLEM BASE ON ALL THE CLASS ACTION LAW SUITS AND SHOULD LED TO A RECALL",
        "vin": "2T2BZMCAXGC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376944,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF SPONTANEOUSLY SHATTERED",
        "vin": "2T2BZMCA8GC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373770,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS STALLING AND SPUTTERING AFTER DRIVING LESS THAN 0.1 MILE ON A CITY STREET. AFTER CONTACTING THE LEXUS DEALERSHIP REGARDING THE ISSUE, WE HAD THE VEHICLE TOWED INTO THE LEXUS DEALERSHIP. AFTER RUNNING A DIAGNOSTIC CHECK, THEY DETERMINED THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE HAS 51,701 MILES ON IT. THE TOWING CHARGE WAS $101, AND THE REPAIRS WERE $808.96.    APPROXIMATELY A MONTH LATER, I SAW THAT TOYOTA AND LEXUS WERE RECALLING VARIOUS MODELS AND YEARS WITH A SIMILAR ISSUE THAT WE EXPERIENCED. ALTHOUGH THE 2016 RX350 IS NOT CURRENTLY INCLUDED, I CONTACTED LEXUS BECAUSE THE COINCIDENCE WAS TOO MUCH TO IGNORE. LEXUS ADVISED THAT OUR VEHICLE IS NOT CURRENTLY INCLUDED IN RECALL NHTSA 20V012000.",
        "vin": "2T2BZMCA7GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360842,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPORTED THE SPEEDOMETER ISSUE TO LEXUS CHANTILLY, VA WHEN I DROVE ON HIGHWAY FROM VA TO IN,  THE LEXUS SPEEDOMETER SHOWS 83, AND MY WAZE SHOWS 75.  ITS 8 MPH DIFFERENCE.  I ALSO HAVE NOTICED OF THE MPH DIFFERENCE BETWEEN 6 TO 8 MPH.  LEXUS SAID, I REQUIRED TO PAY FOR THE REPAIR, WHEN THIS SPEEDOMETER IS DEFECTED BY LEXUS DESIGN.  IT HAS DO NOTHING WITH PERSONAL WEAR, ETC.  I DROVE OTHER HONDA PILOT, AND THE SPEEDOMETER SHOWED CORRECTLY AGAINST THE TRAFFIC PATTERN, AND WAZE APP, BUT THE 2016 LEXUS DOESNT SHOW THE CORRECT BASED ON TRAFFIC FLOW, AND WAZE APP.  THE TRAVEL FROM LEESBURG, VA TO INDIAOPOLIS, IN SHOULD BE 547, BUT ENDED AT 601 MILES.  IM OK IF ITS JUST FEW MILES DIFFERENCES, BUT 50 MILES PER EVERY 500 MILES IS HUGE, 5% ERROR.  I THINK ITS BECAUSE OF SPEEDOMETER AND IMPACT ERROR ACTUAL MILES.  I WENT TO LEXUS CHANTILLY, VA TO PERFORM RECALL FOR OTHER THING, DOOR HANDLE, BUT THEY SAID, WONT LOOK AT SPEEDOMETER ISSUE, UNLESS I PAY FOR IT.  THEN I CALLED LEXUS CORPORATION TO OPEN THE CASE, AND THE LEXUS CASE MANAGER WONT HONOR OR FIX MY ISSUE.  THIS IS SERIOUS SAFETY ISSUE, AND SHOULD BE COVERED BY LEXUS DUE TO THEIR DEFECTIVE ISSUE.  I HAVE 4 PHOTOS TO ATTACH.. CAN YOU ASSIST ME TO CONTACT LEXUS TO FIX BASED ON PHOTOS.  THANK YOU...  I CAN BE REACHED VIA [XXX] - [XXX].  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2T2BZMCA1GC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11341947,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A BROADSIDE COLLISION CAUSING DAMAGE TO FRONT LEFT OF THE CAR, INJURY TO THE DRIVER   WITH FORCE OF THE COLLISION, AIR BAG DIDN'T DEPLOY.",
        "vin": "2T2ZZMCA0GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "04/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340199,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF SPONTANEOUSLY EXPLODED.  I WAS DRIVING ABOUT 45MPH ON MY WAY TO WORK DURING A RAINSTORM AROUND 6:30AM ON APRIL 23 2020, WHEN I SUDDENLY HEARD A VERY LOUD BANG.  I LOOKED UP TO SEE THAT MY SUNROOF HAD BURST AND THERE WERE GLASS FRAGMENTS RAINING ON MY HEAD.  I CLOSED THE VISOR TO PREVENT MORE GLASS AND PRECIPITATION FROM FALLING INTO THE VEHICLE, AND PULLED UNDER AN AWNING TO ASSESS THE DAMAGE.  THE GLASS HAD BURST OUTWARD (PICTURES ATTACHED), AND THERE WERE NO DENTS OR CHIPS ON THE OUTSIDE OF THE VEHICLE INDICATING THAT IT COULD HAVE BEEN STRUCK BY SOMETHING.  OTHER THAN THE SHATTERED GLASS, THERE WAS NO DEBRIS ON THE INSIDE OF THE VEHICLE.  ADDITIONALLY, AT THE TIME THE GLASS BURST, MY VEHICLE WAS THE ONLY CAR ON THE ROAD WITHIN SEVERAL HUNDRED METERS, SO THIS COULD NOT HAVE RESULTED FROM ANY SORT OF ROAD DEBRIS KICKED UP BY ANOTHER VEHICLE.  I SUFFERED MINOR CUTS TO MY ARMS AND HEAD, BUT DID NOT HAVE ANY MAJOR INJURIES.  MY RX350 HAD FEWER THAN 24K MILES ON IT AND WAS 3  YEARS OLD, SO IT SHOULD HAVE BEEN COVERED UNDER BASIC WARRANTY.  LEXUS ULTIMATELY DENIED ANY SORT OF MANUFACTURER DEFECT, AND DID NOT HONOR THE WARRANTY.  I HAD THE VEHICLE REPAIRED AT A LEXUS DEALERSHIP FOR $1,465.",
        "vin": "2T2BZMCA8GC"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/22/2020",
        "dateOfIncident": "02/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325590,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO BRIGHT HEAD LIGHT SYSTEM DEACTIVATES/REACTIVATES INDISCRIMINATELY, MOST FREQUENTLY A FEW MINUTES AFTER DEPARTING IN THE MORNING (STILL DARK). LACK OF PROPER BRIGHT LIGHT CONTROL WHILE DRIVING AT NIGHT GREATLY REDUCES VISIBILITY MAKING THIS A SAFETY ISSUE. I HAVE PROVIDED VIDEO EVIDENCE TO LEXUS DEALER DEMONSTRATING THE PROBLEM WHO CONSULTED WITH CORPORATE LEXUS; LEXUS CLAIMS THAT THEY FOUND MY VEHICLE TO BE WITHIN LEXUS SPECIFICATIONS AND HAS REFUSED TO FURTHER INVESTIGATE NOR REPAIR. INFORMATION POSTED ON THE INTERNET BY NUMEROUS LEXUS RX-350 OWNERS REPORTED THE SAME PROBLEM - ONE SUGGESTING THAT PROPER CLEANING OF THE CAMERA LENS FIXED THE PROBLEM; I PROVIDED THE EVIDENCE TO LEXUS AND LEXUS REFUSED TO ATTEMPT THIS SOLUTION. FOLLOWING IS LEXUS GUEST EXPERIENCE CENTER RESPONSE;    DEAR MR.:    THANK YOU FOR CONTACTING THE LEXUS GUEST EXPERIENCE CENTER.  THE ENTIRE LEXUS ORGANIZATION IS DEDICATED TO PROVIDING LEXUS CUSTOMERS WITH SUPERIOR SERVICE.   IN CIRCUMSTANCES THAT REQUIRE OUR ATTENTION, WE ARE INTERESTED IN ASSISTING IN THE RESOLUTION PROCESS.  AS YOU REQUESTED, WE ARE RESPONDING IN WRITING.      YOUR 2016 RX 350, VEHICLE IDENTIFICATION NUMBER XX, WAS INSPECTED BY LEXUS OF XX, AND FOUND TO BE WITHIN LEXUS SPECIFICATIONS.  WE APOLOGIZE THE VEHICLE HAS NOT MET YOUR EXPECTATIONS.  PLEASE BE ASSURED THAT LEXUS HAS DOCUMENTED YOUR DISSATISFACTION FOR PRODUCT IMPROVEMENT CONSIDERATION.                                                                                                                                  SINCERELY,    XX  CASE MANAGER, EASTERN AREA  LEXUS GUEST EXPERIENCE CENTER    THIS IS MY THIRD LEXUS AND MAY BE MY LAST!",
        "vin": "2T2BZMCAXGC"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "03/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHAKES WHEN BRAKING.    STEERING WHEEL ALSO SHAKES WHEN BRAKING.",
        "vin": "2T2ZZMCA4GC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318810,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION FROM STOP IS BUMPY AND SOMETIMES CUTS OUT WHILE TURNING ON A CITY STREET.",
        "vin": "2T2ZZMCA0GC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316239,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALMOST BEEN T-BONED FOUR TIMES IN 2 MONTHS SINCE I BOUGHT THIS VEHICLE DUE TO IT RANDOMLY STALLING BRIEFLY WHILE TURNING. OCCASIONALLY I LOSE POWER WHILE GOING UPHILL, AND I HAVE HAD SEVERAL INSTANCES OF MY VEHICLE 'JUMPING' OR SURGING. IT HAPPENS WHILE I AM DRIVING, BUT THE MAJORITY IF THE TIME I HAVE NOTICED IT, IT HAPPENS WHEN I AM TURNING OR ACCELERATING. I HAVE NOT HAD ANY LIGHTS ON THE DASHBOARD COME ON, BUT I HAVE HAS THIS ISSUE SINCE DAY ONE OF BUYING THE VEHICLE AND WHEN I SAW THE RECALL THAT WAS EXPANDED TODAY ON TOYOTA AND LEXUS VEHICLES FOR A FAULTY FUEL PUMP, I STARTED READING ABOUT IT AND IT SOUNDS LIKE EXACTLY WHAT MY ISSUE IS. THE RECALL COVERS 2017-2019 AND MY CAR IS A 2016, BUT I BELIEVE IT SHOULD BE INCLUDED AS WELL.",
        "vin": "2T2BZMCA3GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING ON THE HIGHWAY AROUND 3:30 PM CST, MY VEHICLE SUNROOF JUST EXPLODED AND THE GLASS SHATTERED. THERE WERE NO VEHICLES IN THE FRONT FOR AT LEAST 150 METERS.I WAS ON MY WAY TO THE AIRPORT. THE WIND NOISE WAS LOUD AND ALSO I HAD BOOKED THE PARKING OUTSIDE (NON-COVERED) SO I HAD TO GO BACK HOME AND TAKE MY WIFE'S CAR. IN THIS PROCESS, I ALMOST MISSED THE FLIGHT. AS PER THE WEATHER REPORT IT WAS GOING TO RAIN THE NEXT 3 DAYS SO I KNEW I COULDN'T PARK THE CAR OUTSIDE WITH THE BROKEN SUNROOF WHICH WOULD CAUSE FURTHER DAMAGE. FORTUNATELY, THE SUNROOF WAS CLOSED SO WHEN THE GLASS SHATTERED IT DIDN'T COME INSIDE AND DIDN'T HURT ME. I AM NOT SURE WHAT WOULD HAVE HAPPENED IF IT WAS OPEN?",
        "vin": "2T2ZZMCA9GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286702,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPLACING BATTERY, THE GPS, AUDIO SYSTEM, HEAT CONTROLS, (ENTIRE DISPLAY IS BLANK)  THE DEALER SAID THEY DON'T KNOW WHAT HAPPENED.  THERE ARE NUMEROUS IDENTICAL COMPLAINTS ON-LINE HAVING THE SAME ISSUE..",
        "vin": "2T2BZMCA0GC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286508,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER WIPER WAS MAKING A LOUD KNOCKING SOUND AND HITTING THE HOOD.  LEARNED THAT THE ARM WAS BENT, CAUSING THE WIPER TO HIT THE INTERIOR OF THE HOOD AND HAS CAUSED PAINT TO RUB OFF ON THE HOOD.",
        "vin": "2T2BZMCA4GC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11257368,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 LEXUS RX350. WHILE ACCELERATING FROM A STOP SIGN AT APPROXIMATELY 10 MPH, ANOTHER VEHICLE CRASHED INTO THE DRIVER'S SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT WAS TRANSPORTED TO THE EMERGENCY ROOM WHERE A CAT SCAN WAS COMPLETED, WHICH SHOWED A LARGE HEMATOMA ON THE CONTACT'S HEAD. THE CONTACT ALSO MENTIONED THAT HE TOOK BLOOD THINNER MEDICATION AND LATER HIS ENTIRE FACE TURNED BLACK AND BLUE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A BODY SHOP WHERE IT WAS DIAGNOSED AS A TOTAL LOSS BY THE INSURANCE COMPANY. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THROUGH RESEARCH, THE CONTACT FOUND NHTSA CAMPAIGN NUMBER: 18V085000 (AIR BAGS); HOWEVER, THE VIN WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000. *TT  *AS",
        "vin": "2T2ZZMCA1GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228543,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY TO START AT THE BEGINNING OF THE DAY, I STEP ON AND BREAK AND PRESS THE IGNITION BUTTON, THE CAR WON'T START AND WOULD GIVE  ME A LOW BREAK POWER LIGHT MESSAGE. IT WILL EVENTUALLY START AFTER ABOUT 5 OR 6 TRIES. I ONLY HAD THE CAR SINCE NOVEMBER 2018 AND IT ALREADY HAPPENED TO ME LIKE 8 TIMES.",
        "vin": "2T2ZZMCA2GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182678,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK A CAR FOR LEASE FROM LEXUS. THE FIRST WEEK, WE REALIZED THE BRAKES WEREN'T WORKING WELL. WE TOOK THE CAR TO THE SHOP AND THEY SAID NOTHING WAS WRONG. THEN, A COUPLE OF MONTHS LATER IT HAPPENED AGAIN AND THEY SAID THE SAME THING. LAST WEEK, AFTER 2 YEARS, I WAS DRIVING AND SO WAS MY DAUGHTER ( TWO DIFFERENT TIMES ) AND WE COULDN'T BREAK THE CAR. THE CAR DROVE RIGHT PAST THE INTERSECTION ON A RED LIGHT. THANK GOD THERE WAS NO PEDESTRIANS OR VEHICLES AT THAT SECOND. WE BROUGHT IT TO ALEXUS AND THEY TESTED THE BRAKES AND SAW A PROBLEM WITH THE BRAKES. THE PRESSURE WAS LOW AND THE METAL WAS SCRAPING. THEY ASKED FOR A LARGE SUM AND SAID WE NEVER COMPLAINED BEFORE.",
        "vin": "2T2BZMCA5GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154099,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POOR BRAKING, DANGEROUSLY AT TIMES. ALSO HAS TO HOLD GAS NOZZLE ALMOST ALL THE TIME WHILE FILLING UP OR THE GAS WILL SHUT OFF EVEN THE TANK IS NOT FULL",
        "vin": "2T2ZZMCA2GC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "09/19/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON MY WAY IN CAR FROM HOME (BRIDGEWATER NJ) WITH MY DAUGHTER TO DROP HER FOR VOLLEYBALL PRACTICE IN HILLSBOROUGH NJ. ABOUT IN 7-10 MINS DRIVE, MY DAUGHTER AND I SMELLED SMOKE COMING FROM THE AC VENT AND ALSO NOTICED SMOKE FROM THE FRONT HOOD. I IMMEDIATELY PULLED THE CAR TO THE SHOULDER. THERE WERE NO SIGNS OF ALERT INDICATION ON THE DASHBOARD. I TURNED THE ENGINE OFF AND TURNED ON THE HAZARD LIGHTS. WHEN I GOT OFF THE CAR, I IMMEDIATELY OPENED THE FRONT HOOD AND SAW THE FIRE BETWEEN RADIATOR AND ENGINE CYLINDER BLOCK. I IMMEDIATELY CALLED 911. MY DAUGHTER CALLED HER MOM SAYING OUR CAR IS ON FIRE. MY WIFE SUGGESTED MY DAUGHTER TO VIDEO TAPE THIS. WHILE MY DAUGHTER WAS VIDEO TAPPING THIS EVENT, THE 911 RESPONDER SUGGESTED WE GET IN A SAFE DISTANCE FROM THE CAR AND THAT THE FIRE RESPONDERS ARE ON THEIR WAY TO THIS INCIDENT. WE IMMEDIATELY GOT TO A SAFE DISTANCE. WITHIN 5 MINUTES FROM THE CALL, THE FIRE CHIEF ARRIVED AND BLOCKED THE TRAFFIC. BY THIS TIME, THE FIRE SPREAD TO THE DRIVER AND PASSENGER AREA. WE HEARD THE AIRBAGS AND TIRES EXPLODING. THE FIRE TRUCKS CAME AND THE FIRE FIGHTERS STARTED TO EXTINGUISH THE FIRE WITH WATER & FOAM. THE CAR HAD COMPLETELY BURNED TO TOTAL LOSS.   PLEASE NOTE MY DAUGHTER, 14 YEAR OLD AND I ARE IN COMPLETE SHOCK AND TRAUMATIZED WITH THIS HORRIFIC INCIDENT. MY DAUGHTER IS HAVING NIGHTMARES FROM THIS AND WE ARE SCARED WITH THIS EVENT.",
        "vin": "2T2BZMCA6GC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "05/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114970,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR EXPERIENCED AN UNINTENDED ACCELERATION AT THE TOP OF MY DRIVEWAY WHILE BEING PUT INTO PARK. THE CAR TOOK OFF AND HIT THE CENTER POSTS OF THE TWO CAR GARAGE AND ONLY STOPPED BECAUSE IT WAS CAUGHT ON THE SUPPORTS IN THE FOUNDATION.  WE HAD EXPERIENCED THIS SUDDEN UNINTENDED ACCELERATION SEVERAL TIMES DURING THE FIRST YEAR WE OWN THE CAR WHEN WE WERE GETTING ONTO THE HIGHWAY. WE DID REPORT IT WHEN WE BROUGHT THE CAR IN FOR A SERVICE, THEY WERE AWARE OF THE COMPLAINT BUT AT THAT TIME THERE WAS NO REMEDY FOR THE COMPUTER SLASH TRANSMISSION ISSUE. I WAS PARKING THE CAR AT THE TOP OF THE DRIVEWAY, MY FOOT WAS GOING ON TO THE BREAK AND THE CAR UNINTENTIONALLY ACCELERATED AND FLEW THROUGH THE AIR INTO THE CENTER POST OF A 2 CAR GARAGE. I LUCKILY WAS NOT PHYSICALLY INJURED BUT WAS EMOTIONALLY DISTRAUGHT. IT TOOK DOWN BOTH GARAGE DOORS AND THE CENTER PILLAR ALL OF WHICH HAD TO BE REBUILT AND REPLACED.",
        "vin": "2T2BZMCA1GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104009,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. AIRBAGS ON PASSENGER SIDE ALL DEPLOYED WITH ZERO IMPACT TO THE VEHICLE. A TRUCK WAS DRIVING 5 MPH NEXT TO ME WHEN HE HAD A BLOWOUT AND THE LOUD NOISE CAUSED THE AIRBAGS TO DEPLOY.",
        "vin": "2T2BZMCA6GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "09/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099067,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 LEXUS RX350. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE JERKED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO LEXUS OF LAS VEGAS (6600 W. SAHARA AVE, LAS VEGAS, NV, 702-942-6600), BUT THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND REFERENCED TSB NUMBER: L-SB-0109-17 TO THE DEALER. THE TECHNICIAN RESETTLED THE TRANSMISSION ACCORDING TO THE TSB INSTRUCTIONS. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 500.",
        "vin": "JTJBZMCA8G2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/18/2018",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096764,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION HAS THREE SETTINGS. IN ANY OF THEM, START UP OFTEN RESULTS IN ERRATIC SHIFTING, ROUGH ACCELERATION AND SOMETIMES ABRUPT LURCHING FORWARD. THIS HAS RESULTED IN ALARMING SHIFTING AND ACCELERATION. THE SHIFTING FROM ONE GEAR TO THE NEXR IS NOT SMOOTH NOR CONTRIBUTES TO SAFE START-UP IN MY OPINION - AND I AM OVER 80 AND HAVE DRIVEN MANY CARS AND TRUCKS - WORST SHIFTING IN MY EXPERIENCE AND IS DANGEROUS. DEALER SAYS IS NORMAL.",
        "vin": "2T2BZMCA2GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090870,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST PROBLEM WITH ELECTRICAL WAS WHEN THE NAVIGATION SCREEN WENT COMPLETELY BLANK WHILE DRIVING DURING BROAD DAYLIGHT. DON'T KNOW THE DATE OF THIS INCIDENT.  THOUGHT IT WAS A REBOOT BY ENFORM.  THOUGHT NOTHING ABOUT IT.  ON 12/21/2017, CHECK ELECTRIC BRAKE WARNING LIGHT CAME ON WHEN I STARTED MY CAR IN THE MORNING AFTER IT HAD BEEN SITTING ALL NIGHT. TOOK INTO THE DEALER.   DEALER COULD NOT FIND ANY PROBLEM WITH IT OR ANY ERROR CODES INDICATING ANY PROBLEM. THEY RESET THE ERROR LIGHT.  ON 4/23/2018, I STOPPED FOR A STOP SIGN AT ABOUT 12:30 PM, NOTHING HAPPENED WHEN I TRIED TO ACCELERATE AT WHICH POINT I NOTICED I HAD NO LIGHTS ON ANYWHERE ON MY CAR.  IT WAS DEAD.     I WAS STUCK IN THE MIDDLE OF THE ROAD AND WAS UNABLE START IT AFTER A COUPLE OF TRIES.  CALLED FOR EMERGENCY SERVICE, LET LEXUS DEALER KNOW MY CAR WAS GOING TO BE TOWED TO THEM, AND SAT FOR ABOUT 15 MINUTES WHEN A GENTLEMAN CAME ALONG BEFORE EMERGENCY SERVICE REP GOT THERE. HE WAS ABLE TO START THE VEHICLE.  TOOK TO DEALER AND WAS TOLD AFTER 4 DAYS THAT THEY COULD NOT RECREATE THE PROBLEM. AM NOW DRIVING IT, BUT AFRAID SOMETHING ELSE MAY HAPPEN.",
        "vin": "2T2ZZMCAXGC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "04/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LEXUS MADE AN FSPORT PACKAGE FOR THE LEXUS RX350 WHICH THEY HAVE CREATED A SPORT SEAT DESIGN THAT I HAVE NO ISSUE FOR THE PASSENGER SEAT, BUT THE DRIVER SEAT ON THE LEFT HAND SIDE WHERE MY THIGH IS I GET A SHARP PAIN ON MY LEG AFTER SITTING ON THE SEAT FOR 15 MINUTES. I HAVE GONE TO LEXUS AND COMPLAINT ABOUT THE ISSUE WHICH THEY ADMITTED I AM NOT THE ONLY ONE WHO HAS COMPLAINT ABOUT THE SEAT ISSUE, BUT HAVE YET DONE ANYTHING TO RESOLVE THE PAIN I AM EXPERIENCING.",
        "vin": "2T2BZMCA8GC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075591,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER WIPER WAS STREAKING; ASSUMED THE BLADE NEEDED REPLACING.  INSTEAD, LEARNED THAT THE ARM WAS BENT, CAUSING THE WIPER TO HIT THE INTERIOR OF THE HOOD AND HAS CAUSED PAINT TO RUB OFF ON THE HOOD. OUR LEXUS IS ONLY TAKEN THROUGH A TOUCH LESS CAR WASH OR THE ONE AT THE LEXUS DEALERSHIP. THE PASSENGER WIPER IS IMPOSSIBLE TO LIFT GIVEN ITS TUCKED POSITION. I DO NOT SEE HOW THIS COULD HAVE HAPPENED BY REMOVING SNOW FROM THE WINDSHIELD.",
        "vin": "2T2BZMCA5GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "01/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPLODING SUNROOF ON NEW CAR, I WAS LEAVING FOR WORK AROUND 6:30 AM JANUARY 2018 TO GO TO WORK. AS I WAS STARTING MY CAR AND PUTTING THE CAR IN REVERSE I HEARD A LOUD SHATTER. I IMMEDIATELY AND CAREFULLY OPENED THE VISOR BETWEEN ME AND THE SUNROOF IT WAS COMPLETELY SHATTERED. SMALL FRAGMENTS OF GLASS WERE POURING INTO MY CAR. I WAS NOT EVEN DRIVING AT A HIGH SPEED SO THERE WAS NO POSSIBLE WAY A ROCK OR ANOTHER OBJECT CAME INTO CONTACT WITH THE WINDOW. THE CAR STILL HAS PAPER TAGS ON THE VEHICLE.  I CALLED MY INSURANCE AND HAD TO FILE A CLAIM. COST WAS $1200 TO REPAIR AT THE LEXUS DEALERSHIP. I JUST DROPED IT OFF TODAY. NOBODY COULD GIVE ME ANY ANSWERED. APPARENTLY I AM NOT THE ONLY ONE, SINCE I HAVE FOUND THIS PAGE THERE ARE 3 MORE SUNROOF EXPLOSIONS OUT OF THE TOTAL OF 29 COMPLAINTS AS OF NOW.   I AS WELL FILED A POLICE FOR INSURANCE PURPOSES.",
        "vin": "2T2ZZMCAXGC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058438,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2016 LEXUS RX 350 EXITING THE HIGHWAY WHEN I HEARD A LOUD BOOM.  IT WAS LOUD LIKE A SHOTGUN.  WE DIDN'T SEE OR FEEL ANYTHING HIT THE CAR, BUT THE NOISE WAS LOUD AND SCARY.  SINCE THERE WAS NO OBVIOUS EVIDENCE OF ANYTHING, I CAREFULLY OPENED MY VISOR FOR MY SUNROOF TO SEE THAT MY SUNROOF HAD SHATTERED.  IT JUST EXPLODED.  NOTHING HIT IT OR FELL ON IT.  THE SUNROOF WAS CONVEX LIKE IT EXPLODED AND NOT CONCAVE LIKE SOMETHING HAD FALLEN ON IT.",
        "vin": "2T2BZMCA8GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/22/2017",
        "dateOfIncident": "12/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11056148,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 LEXUS RX350. WHILE ATTEMPTING TO APPLY THE BRAKES, THE VEHICLE FAILED TO STOP. AS A RESULT, THE CONTACT REAR ENDED ANOTHER VEHICLE. ALL THE AIR BAGS DEPLOYED. THE VEHICLE WAS TOWED AND COULD NOT BE DRIVEN. THE CONTACT DID NOT KNOW IF THE VEHICLE WAS DESTROYED. A POLICE REPORT WAS FILED. THE CONTACT RECEIVED INJURIES TO THE LEGS, CHEST, AND BACK. MEDICAL ATTENTION WAS REQUIRED. THE CONTACT CALLED LEXUS OF TOWSON (1040 YORK ROAD, TOWSON, MD 21204; 410-769-9400) WHO INFORMED THE CONTACT THAT THEY WERE NOT FAMILIAR WITH THE VEHICLE HAVING THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 18,000.",
        "vin": "JTJBZMCA4G2"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11055748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO ACCIDENT / OTHER DRIVER FAULT- 20 + MILES PER HOUR IN MOTION FRONT END COLLISION/ IMPACT . FRAME DAMAGE TO BOTH SIDES OF SUV.  TOTAL 3 PASSENGERS. NO AIRBAGS DEPLOYED ON FRONT DRIVER. NO AIRBAGS DEPLOYED AT ALL.",
        "vin": "2T2ZZMCA8GC"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/11/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045283,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS MAKING A LEFT TURN ON TO A BRIDGE, THE CAR PULLED THE RIGHT A LITTLE, I PULLED TO THE LEFT  A LITTLE TO STRAIGHTENED IT BACK UP APPLYING THE BRAKES, THE CAR WOULD NOT STOP. THERE WAS A LINE OF CARS AT THE RED LIGHT, I CONTINUED APPLYING THE BRAKES, THE CAR WOULD NOT STOP AND WAS PICKING UP SPEED.  I PULLED TO THE LEFT TO AVOID ALL THE CARS.  CAR STILL WOULD NOT STOP INSPITE OF PRESSING MY FOOT HARD ON THE BRAKE.  THE CAR CONTINUED MOVING WENT ACROSS A LARGE STREET, STILL TURNING THE CAR TO THE LEFT TO AVOID OTHER CARS.  THE CAR WENT ON TO A GAS STATION LOT.  I CONTINUED TURNING TO AVOID THE GAS PUMPS, STILL MY FOOT ON THE BRAKE.  THE CAR KEPT GOING AND STOPPED WHEN IT HIT A POLE  ON THE GAS STATION LOT.  THE AIR BAGS NEVER DEPLOYED.  THE BRAKES WOULD NOT WORK.  THE CAR WENT OUT OF CONTROL.    THE CONSUMER STATED THE POWER STEERING FAILED WHILE DRIVING. THE BRAKES COULD NOT BE DEPRESSED, THEY FELT AS IF THE CONSUMER WAS STEPPING ON A BRICK. THE VEHICLE CONTINUED TO ACCELERATE. THE CONSUMER STATED THERE WAS A RECALL FOR OTHER MODELS WITH THE SAME DEFECT, BUT THIS VEHICLE WAS NOT INCLUDED. *JS",
        "vin": "2T2BZMCA7GC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/25/2017",
        "dateOfIncident": "08/25/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MAIN WIPER ARM THE EXTENDS TO COVER MORE GLASS AREA (IN OTHER WORDS, THE RIGHT WIPER) BENT, CAUSING THE WIPER TO HIT THE HOOD. OUR LEXUS ISN'T TAKEN THROUGH A CAR WASH, AND THE DEALERSHIP WANTED TO BLAME IT ON SNOW, BUT LAST WINTER WE DIDN'T HAVE SNOW. THIS HAPPENED IN THE MIDDLE OF SUMMER. IT HAS CAUSED PAINT TO RUB OFF ON THE HOOD AND MAKES A BANG EVERY TIME IT HITS THE HOOD.",
        "vin": "2T2ZZMCA5GC"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/05/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013044,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT OTHER CAR I PRESS BREAK . BRAKE NOT WORK AIR BAG NOT COME OUT, PRECOLUATION  NOT WORK.",
        "vin": "2T2BZMCA7GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "07/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006310,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MOLD AND MILDEW CAR SMELLS WHOLE INTERIOR NEEDS REPLACEMENT",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000793,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS HESITATION WHEN DRIVING. CAR RATED FOR UNLEADED NOT PREMIUM AND SHOULD HAVE NOT TO DRIVE CAR IN SPORT MODE ALL THE TIME",
        "vin": "2T2BZMCA0GC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/04/2017",
        "dateOfIncident": "06/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993107,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING RIGHT INTO DRIVEWAY COMING DOWN A HILL, THE RIGHT REAR TIRE COMES OFF THE GROUND. ATTACHED PHOTO IS FROM VIDEO CLIP THAT SHOWS THE RIGHT TIRE COMING TO A COMPETE STOP DUE TO THE BRAKES BEING APPLIED IN THE TURN. RIGHT REAR TIRE EVENTUALLY CONTACTS THE DRIVEWAY AND ROLLS AGAIN.",
        "vin": "2T2ZZMCA4GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "05/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984346,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-10 EAST CLOSE TO THE TX-LA BORDER, ON PAVEMENT THAT WAS EVEN, ALTHOUGH NOT WITHOUT SOME OCCASIONAL ROUGHNESS. TRAFFIC WAS HEAVY AND MOVING AROUND 65 MPH. IT WAS 67 DEGREES AND CLOUDY. I HAD BEEN ON THE ROAD FOR ABOUT 3 HOURS, WHEN MY FRIEND AND I HEARD A LOUD CRACK.  IT SOUNDED AS IF SOMETHING HIT GLASS, BUT WE SAW NO FLYING OBJECTS AND THE SOUND WAS SINGULAR; NO ADDITIONAL OR RESIDUAL SOUNDS. WE BOTH JUMPED AND STARTED LOOKING TO SEE IF THE WINDSHIELD WAS DAMAGED BUT DID NOT SEE ANY DAMAGE. LATER WHEN WE STOPPED FOR GAS WE WASHED THE WINDSHIELDS AND DID ANOTHER LOOK, INCLUDING LOOKING FOR PAINT DAMAGE. WE FOUND NOTHING. WE CONTINUED DRIVING TO OUR DESTINATION. THE NEXT MORNING WHEN WE GOT IN THE CAR AND SHUT THE DOOR, WE HEARD GLASS FALLING. I STOOD ON THE OPEN DOOR AND SAW THAT THERE WERE TWO SMALL HOLES IN THE SUNROOF AND THE ENTIRE SUNROOF WAS SHATTERED. THE COBWEB EFFECT WAS 100%, AND EXTENDED TO EVERY SQUARE INCH OF THE GLASS, ALL THE WAY AROUND THE PERIMETER. I CALLED THE LEXUS DEALERSHIP NEAREST ME; AND I CALLED OUR INSURANCE PROVIDER TO START A CLAIM.  GIVEN I WAS SOME DISTANCE FROM HOME, IT WAS LATE FRIDAY, AND NO ONE COULD GET THE GLASS, I HAD A LOCAL AUTOMOTIVE REPAIR SHOP (THE LOCAL AREA CONTRACT FOR OUR INSURANCE COMPANY) COLLISION WRAP  THE ROOF SO I COULD DRIVE HOME, AVOID FLINGING GLASS ON TRAFFIC, AND BE PROTECTED IN CASE OF RAIN. MY HUSBAND NOTIFIED THE DEALERSHIP WHERE WE LEASED THE VEHICLE AND MADE AN APPOINTMENT (WE GO TOMORROW).  NO ONE FROM THE TWO DEALERSHIPS OR THE INSURANCE COMPANY MENTIONED THAT SUNROOFS ON LEXUS/TOYOTA HAVE BEEN KNOWN TO SPONTANEOUSLY \"POP\" SINCE 2010.  THE CAUSE OF THIS RISK MUST BE DEFECTIVE DESIGN AND/OR GLASS; THE SUNROOF MATERIALS BEING USED ARE EVIDENTLY UNABLE TO TAKE THE PRESSURE AND ABSORB THE SHOCK. THE ROOF'S MOST VULNERABLE PART IS EXPLODING AS A RESULT. 2016 MODEL; DRIVEN 6 MOS; >6000 MI.",
        "vin": "2T2ZZMCA2GC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/18/2017",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979064,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WILL GIVE YOU A BRIEF DESCRIPTION AS TO WHAT OCCURRED.  I ENTERED OUR GARAGE FOR THE PURPOSE OF BACKING THE LEXUS OUT OF THE GARAGE SO WE COULD LOAD NEWLY PURCHASED PATIO FURNITURE INTO THE GARAGE.  I ENTERED THE LEXUS, APPLIED THE BRAKE PEDDLE TO START THE AUTOMOBILE.  ONCE THE AUTO WAS STARTED, KEEPING MY FOOT ON THE BRAKE TO ALLOW MY SHIFTING, I MOVE THE SHIFT LEVER FROM PARK TO REVERSE AND TO MY SURPRISE, THE CAR BEGAN MOVING WITH NEVER REMOVING MY FOOT FROM THE BRAKE.  IT IS A VERY TIGHT SQUEEZE BACKING OUT OF OUR GARAGE SO WHEN THE CAR STARTED MOVING, I PRESSED MORE FIRMLY ON THE BRAKE TO SLOW THE PROGRESS AND THERE WAS NO RESPONSE.  I PRESSED ON THE BRAKE HARDER AND WHEN IT KEPT CONTINUING TO NOT RESPOND, I TRIED TO LOCATE THE EMERGENCY BRAKING SYSTEM BY PUSHING WITH MY LEFT FOOT ON THE FLOOR TRYING TO ENGAGE IT.  THE WHOLE INCIDENT LASTED ONLY A COUPLE OF SECONDS CAUSING THE COLLISION TO OCCUR.      THIS WAS REPORTED TO HARTFORD INSURANCE COMPANY AUTO CLAIM # PA0016731644 WHOSE ULTIMATE CONCLUSION WAS AS FOLLOWS: \"UPON FURTHER INVESTIGATION WE DETERMINED....THE TOYOTA MOTOR COMPANY TO BE THE RESPONSIBLE PARTY.\"    MY LAST COMMUNICATION WITH TOYOTA MOTOR NORTH AMERICA WAS WITH CARLOS GARCIA IN THE LEGAL CLAIMS DEPARTMENT DATED FEBRUARY 10TH, 2017, COPY ATTACHED ALSO ATTACHED IS MY CORRESPONDENCE OF MAY 11, 2016    THE BOTTOM LINE IS TOYOTA HAS NOT CONDUCTED AN IN-DEPTH INVESTIGATION OF A SIGNIFICANT FAILURE IN THE DESIGN/MANUFACTURE OF THEIR AUTOMOBILE.  THEY ARE TOTALLY RELYING ON HEARSAY EVIDENCE WHICH IS THIRD HAND AND FALSE, HOPING THIS WILL ALL GO AWAY.  I MADE MY AUTOMOBILE AVAILABLE TO THEM AS WELL AS MYSELF AND OTHERS WHO WITNESSED THE EVENT.  THIS COULD HAVE BEEN A INNOCENT CHILD THAT WAS DAMAGED, RATHER THAN ANOTHER VEHICLE.  I HAVE SIGNIFICANT ADDITIONAL INFORMATION AVAILABLE FOR YOU, IF REQUESTED. THANK YOU FOR YOUR CONCERN.",
        "vin": "2T2BZMCA6GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2017",
        "dateOfIncident": "02/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967087,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY TO ACCELERATE FROM A STOP, A LOUD GROAN CAN BE HEARD FROM SOMEWHERE IN THE POWERTRAIN.  THERE IS ALSO A VIBRATION WHICH APPEARS TO BE COMING FROM THE TRANSMISSION AREA OF THE VEHICLE.  IN ADDITION, WHEN TRAVELLING AT HIGHWAYS SPEEDS, DURING THE ACCELERATION PROCESS, A DELAY OCCURS FROM THE TIME I STEP ON THE GAS PEDDLE UNTIL THE VEHICLE ACCELERATES.  THE HESITATION IS APPROXIMATELY 1-2 SECONDS.",
        "vin": "2T2ZZMCAXGC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2017",
        "dateOfIncident": "02/24/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960239,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING ALL OF LANE KEEP ASSIST, LANE CENTER, AND CRUISE CONTROL, THE VEHICLE STEERS SHARPLY TO THE RIGHT AND WILL PULL OUT OF THE EXISTING LANE INTO THE LANE TO THE RIGHT.  MOST NOTICEABLE AT SPEEDS ABOVE 40MPH.  PROBLEM HAS HAPPENED SINCE THE VEHICLE WAS NEW, BUT SEEMS MORE PRONOUNCED BECAUSE I DO MORE HIGHWAY DRIVING NOW WITH CRUISE CONTROL.  DEALER AND FACTORY REPS CONSIDER THIS BEHAVIOR NORMAL, YET A LOANER CAR OF THE SAME MODEL DID NOT EXHIBIT THIS SYMPTOM.",
        "vin": "2T2ZZMCA6GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955071,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'M DRIVING, THE PHONE CONTACTS ARE GREYED OUT, LOCKING ME FROM ACCESSING THEM TO MAKE A CALL. I CAN MAKE A CALL USING THE VOICE COMMAND, BUT THAT IS LIMITED SINCE I DON'T REMEMBER ALL MY CONTACT NAMES OFF THE TOP OF MY HEAD. CALLED LEXUS AND THEY SAY THAT IS A SAFETY FEATURE. HOWEVER, IF SCROLLING THROUGH CONTACTS IS A SAFETY THING, THEN WHY CAN I ACCESS MY FAVORITE CONTACTS AND SCROLL THROUGH RECENT CALLS? THIS DISTRACTS THE DRIVER IN MAKING A PHONE CALL BY \"ENCOURAGING\" HER TO MANUALLY DIAL THE NUMBER OFF THE PHONE DIALPAD. YES, THAT'S ILLEGAL AND NOT SAFE. HENCE THIS POST.",
        "vin": "2T2BZMCA9GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "02/11/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954465,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 LEXUS RX350. WHILE EXITING THE HIGHWAY AT APPROXIMATELY 10 MPH, THE BRAKE PEDAL TRAVELED TO THE FLOOR, BUT FAILED TO STOP THE VEHICLE. THE CONTACT CRASHED INTO THE REAR OF THE PRECEDING VEHICLE. THE CONTACT PULLED THE VEHICLE TO THE SIDE OF THE ROAD AND TURNED OFF THE VEHICLE. THE AIR BAGS FAILED TO DEPLOY AND THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED FOR THE HIGHWAY PATROL. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS DAMAGED, BUT NOT DESTROYED. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "2T2ZZMCA4GC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "12/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945662,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE NOTICED A SQUEAKING NOISE WHILE TURNING THE WHEEL WHILE IN MOTION ON 12/19/16 AND WE TOLD THE DEALER RAY CATENA OF NJ AND THEY TOOK THE CAR TO THEIR SHOP AND TOLD US THEY FOUND THE PROBLEM WITH THE WHEEL AND IT WAS FIXED. ON 1/16/17 WE NOTICED THE NOISE AGAIN WHEN WE TURN THE WHEEL  AND WE THINK IT IS UNSAFE TO DRIVE THE CAR.  WE ASKED THE DEALER TO REPLACE IT.  VIN YOUR EMAIL HAS BEEN SUBMITTED. A MEMBER OF OUR SUPPORT TEAM WILL GET BACK TO YOU SOON. USE THIS REFERENCE NUMBER FOR FOLLOW-UP:    #[XXX]      [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2016",
        "dateOfIncident": "11/26/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929600,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A STOP LIGHT THE CAR ALL OF A SUDDEN WOULD NO LONGER ACCELERATE YET THE CAR WAS IN DRIVE.  I TOOK IT TO THE DEALERSHIP AND THEY CAN NOT REPLICATE AND SO I AM STILL DRIVING THE VEHICLE.  HOPING IT WILL NOT HAPPEN WHILE DRIVING.  *TR",
        "vin": "2T2BZMCA6GC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928872,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 LEXUS RX350. THE CONTACT STATED THAT THE STEERING WHEEL WOULD LOCK WITHOUT WARNING AND THE VEHICLE WOULD PULL TO THE RIGHT. THE POWER STEERING WARNING INDICATOR ILLUMINATED. THE DEALER WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 26,000. UPDATED 01/26/2017*CT   CARFAX CANNOT PROCESS VIN UPDATED 7/12/18*JB *TR",
        "vin": "2T2BZMCA26G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926604,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VIBRATION FELT STANDING STILL AND WORSENS AS ACCELERATION SLOWLY STARTS FORWARD. CONTINUES ALSO AT SLIGHT ACCELERATION AT HIGHER SPEEDS JUST TO MAINTAIN SPEED LIMIT. VIBRATION CAN BE FELT IN STEERING WHEEL, ACCELERATOR PEDAL, GEAR SHIFT AND AT SPECIFIC START UP SPEEDS THE ENTIRE VEHICLE. THIS DOES NOT CHANGE WHEN DRIVING ON DIFFERENT SURFACES OR ROADWAYS. VIBRATION HAS BEEN NOTED AND EXPERIENCED ALSO BY DEALERSHIP TECHNICAL PERSONNEL WITH NO REMEDY. THIS PROBLEM HAS EXISTING SINCE PURCHASING VEHICLE IN JAN 2016 AND DEALERSHIP COMPLAINT AT 997 MILES ON VEHICLE.",
        "vin": "2T2HK31U99C"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914208,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 RX MODELS EQUIPPED WITH THE HEADS-UP DISPLAY HAVE AN ISSUE WITH THE OEM WINDSHIELD SHOWING A SECOND IMAGE OF BRIGHT LIGHTS AT NIGHT. THIS OCCURS FOR STREETLIGHTS, STOPLIGHTS, LED TAIL LIGHTS, AND EVEN INCANDESCENT TAIL LIGHTS. THE DOUBLE IMAGE IS CLEAR AND DISTINCT APPROXIMATELY 1/4\" BELOW THE ORIGINAL IMAGE AT 100 FEET AHEAD OF THE BRIGHT OBJECT AND IT SLOWLY MOVES TO JOIN THE ORIGINAL IMAGE AS YOU APPROACH THE BRIGHT OBJECT. WHEN DRIVING AT NIGHT, THIS GIVES A PARALLAX EFFECT AND IS DISTRACTING. DUE TO A CHIP IN THE WINDSHIELD, THE OEM WINDSHIELD WAS REPLACED WITH ANOTHER OEM WINDSHIELD THAT ALSO DEMONSTRATED THE SAME ISSUE. OTHER 2016 RX MODELS AT THE DEALER EXHIBITED THE SAME EFFECT. NOTHING CAN BE DONE AT THIS TIME FROM THE DEALER AND THE DISTRICT MANAGER.",
        "vin": "2T2BZMCA9GC"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SEATS",
        "crash": true,
        "dateComplaintFiled": "10/02/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 30-35 MILES PER HOUR I HIT A MINI VAN FROM BEHIND IN STOP AND GO TRAFFIC. MY LEXUS AT THIS POINT HAD 2500 MILES WAS 3 MONTHS OLD AND I WAS DRIVING ALONE WITH NO PASSENGERS. WHEN I HIT THE OTHER VEHICLE EVERY AIRBAG (AROUND 12) DEPLOYED WHICH IN CONJUCTION WITH SEEMINGLY MINOR EXTERIOR DAMAGE RESULTED IN THIS BRAND NEW CAR BEING TOTALLED.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2016",
        "dateOfIncident": "03/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895528,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 RX350 IS A NEW PLATFORM.  THE PASSENGER SIDE CAR PASSING INDICATOR DOES NOT ALWAYS INDICATE A CAR IN THE \"BLIND SPOT\".  AFTER DRIVING THE CAR FOR A FEW MONTHS, I NOTIFIED MY LOCAL LEXUS DEALER. MY SALESMAN AND I DROVE MY VEHICLE FOR A TEST RUN AND THE PROBLEM CONSISTENTLY AROSE.  THE SALESMAN SAID THAT THIS WAS A NEW EXPERIENCE FOR HIM IN A LEXUS VEHICLE WITH THIS FEATURE.  LEXUS HAD A TEAM INSPECT THE VEHICLE.  LEXUS SAID THAT THE LACK OF THE PASSING INDICATOR TO SEE ALL VEHICLES IN THE BLIND SPOT WAS NORMAL FOR THE 2016 LEXUS RX 350. I HAVE DRIVEN THE CAR FOR 8 MONTHS.  I FIRST NOTICED THE APPARENT MALFUNCTION DRIVING BACK TO PA FROM FL.  I BELIEVE THAT THE CAR PASSING INDICATOR SYSTEM USES RELATIVE DIFFERENCES OF SPEED BETWEEN MY CAR AND THE CAR BEING PASSED TO ACTIVATE THE FEATURE.  FOR EXAMPLE, THE INDICATOR LIGHT WILL NOT GO ON WHILE I PASS A CAR A  MUCH GREATER SPEED THAN THE CAR BEING PASSED.  I WOULD GUESS THE DIFFERENCE MAY BE 20 MPH OR SO.  HOWEVER, IF I PASS A CAR SLOWLY OR AT A LOW DIFFERENCE OF SPEED, THE CAR PASSING INDICATOR LIGHT FUNCTIONS AS ONE WOULD EXPECT.  OF INTEREST IS THAT MY WIFE HAS A 2013 LEXUS RS350 WITH A CAR PASSING INDICATOR SYSTEM AND HER CAR WILL ALWAYS INDICATE A CAR IN THE BLIND SPOT REGARDLESS OF HOW FAST THE RS350 PASSES ANOTHER VEHICLE.  THE LACK OF INDICATING A VEHICLE IN THE RIGHT BLIND SPOT AT ALL TIMES IN MY VEHICLE IS DANGEROUS.  THIS SAFETY FEATURE  HAS POOR DESIGN.  THE 2016 WAS JUST INTRODUCED IN LATE 2015.  LEXUS KNOWS ABOUT THIS PROBLEM AND CALLS IT A NORMAL FUNCTION. I HAVE NOT YET RECEIVED AN ADEQUATE EXPLANATION FROM LEXUS WHY THE CAR PASSING INDICATOR SYSTEM IN THE 2016 RX350 WAS DESIGNED THIS WAY PURPOSELY.  I BELIEVE THAT THIS ISSUE IS A SERIOUS FLAW.  I HAVE ENCLOSED TWO DOCUMENTS I HAVE RECEIVED FROM LEXUS.  I DID NOT ASK FOR PROTECTION UNDER THE LEMON LAW.",
        "vin": "2T2BZMCA1GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892295,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 LEXUS 350 RX WAS IN THE GARAGE. I NEEDED TO MOVE THE CAR FORWARD SO I PUT IT IN DRIVE. AS SOON AS I RELEASED THE BRAKE, THE CAR SHOT FORWARD WITH GREAT SPEED (UNINTENDED ACCELERATION). THE CAR CRASHED INTO SOME BICYCLES AND  SHELVES AS I APPLIED THE BRAKES TO STOP THE VEHICLE. I IMMEDIATELY CALLED LEXUS OF TAMPA BAY AND THEY CAME OUT TO PICK IT UP. THAT WAS ALMOST 8 WEEKS AND NOTHING HAS BEEN RESOLVED.",
        "vin": "2T2ZZMCA7GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2016",
        "dateOfIncident": "07/08/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883713,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF LEAK IN HEAVY RAIN.  LEAKED THROUGH AREA AROUND DRIVERS BLUETOOTH MICROPHONE.  SERVICE DEPARTMENT ADVISED THIS WAS THE SECOND VEHICLE BROUGHT IN FOR THIS PROBLEM.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2016",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876512,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 LEXUS RX350. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16VV053000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T2ZZMCA0GC"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876244,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 LEXUS RX350. THE CONTACT STATED THAT THE VEHICLE'S BLIND SPOT MONITORING SYSTEM INTERMITTENTLY DID NOT FUNCTION ON THE PASSENGER SIDE WHILE DRIVING ON THE FREEWAY. WHEN THE FAILURE OCCURRED, THE INSTRUMENT PANEL WENT BLANK AND THE ELECTRICAL SYSTEM DID NOT FUNCTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE DIAGNOSTIC RESULTS WERE UNDETERMINED. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS APPROXIMATELY 1,200.",
        "vin": "2T2ZZMCAXGC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872445,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I UNDERSTAND THAT MY CAR HAS A POSSIBLE PROBLEM WITH THE TAKATA AIR BAG AND I WANT THEM REPLACED BEFORE A DEATH OCCURS.",
        "vin": "2T2ZZMCA7GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/23/2016",
        "dateOfIncident": "04/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW CAR.  ON FREEWAY MIDDLE LANE IN RUSH HOUR AND LOST THROTTLE.  LUCKILYI ABLE TO GET OFF FREEWAY AND CALLED TOW TRUCK AND WENT TO DEALER.  TOLD IT IS THROTTLE.  2 MONTH OLD CAR AND 1500 MILES.  I AM SCARED IT SUDDENLY STOPPED WORKING AND AM GLAD I DID NOT MEET AN ACCIDENT BUT SCARED ABOUT THIS ESPECIALLY AS NEW CAR.  THIS IS SAFETY HAZARD.  CAR ERRORS ON PANEL WHEN IT FAILED SAID;  ENGINE, THROTTLE, TRANSMISSION, AWD AND SAFETY ERROR",
        "vin": "JTJBZMCAXG2"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2016",
        "dateOfIncident": "01/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840149,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX350",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" THERE IS SOME SOUND FROM THE CAR WHEN EVER I TURN ON MY AIR CONDITIONER AND WHEN I FILED A CASE THEY ARE SAYING ITS DESIGN CHARACTERISTIC, WHERE AS THERE IS NO SUCH IN THEIR PREVIOUS DESIGNS OR OTHER MODELS AND ITS VERY IRRITATING AND DISTURBING WHILE DRIVING THE CAR WHICH MAKES ME TO DISTURB A LOT",
        "vin": "2T2BZMCA3GC"
    }
]