[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "05/14/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Panoramic sunroof shattered and it’s broken in pieces now; No longer just shattered I am on the phone with a George Hilliker from the Newark CarMax now. To my dismay there is nothing that can be done since this is not a mechanical defect.  So at this point I am going to definitely cancel the extended CarMax care that I did sign up for him to help offset my cost for my deductible to deal with this damage. I would regret not turning around and returning the car on May 4 just because I heard the sound and had no idea what the consequences of that would turn into. I will also convey this in the survey request that I have received from Carmax. Taking this up any further would only cause me more frustration and money, But at this juncture I will definitely speak with a lawyer to see what my options are that way sinceI am now stuck with this vehicle. Granted had I known it had started breaking the glass on the third I would’ve returned it at any Carmax between Colorado and Delaware.",
        "vin": "2LMHJ5AT7GB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350664,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 LINCOLN MKT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V072000 (SUSPENSION) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. NEITHER THE MANUFACTURER NOR A DEALER WERE MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2LMHJ5AT3GB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231718,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A TURN ONTO HIGHWAY MY ELECTRIC POWER STEERING COMPLETELY WENT OUT WITH CARS TURNING NEXT TO ME. IT YANKED THE WHEEL OUT OF MY HAND ALMOST CAUSING A CRASH. THEN A WINDOW APPEARS IN LY CAR SAYING YOUR STEERING HAS FAILED PULL OVER SAFELY . LITTLE LATE FOR THAT. AFTER GETTING CAR TO DEALER AND WAITING I SEARCHED AND FOUND ELECTRIC STEERING RECALL FROM 2015 SOME 400K CARS. THE SAME YEAR MINE WAS BUILT. DEALER SAYS NO BUT ITS THE SAME EXACT PROBLEM.",
        "vin": "2LMHJ5FKXGB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11180980,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED THIS CAR FOR LESS THAN A YEAR AND THE MOONROOF HAS SHATTERED ON ME TWICE ALREADY. THE FRONT ONE TO BE EXACT, BOTH TIMES IT WAS RAINING BUT NORMAL RAIN, I LIVE IN NORTHEN CALIFORNIA. NO OBJECTS HIT MY CAR AND NO ACCIDENT. IT SOUNDS LIKE A LOUD GUNSHOT NEAR YOU AND ITS VERY SCARY I ALMOST CAUSED AN ACCIDENT BECAUSE I SWERVED TO NEXT LANE DUE TO BEING SCARED OF THE LOUD NOISE. FIRST TIME I WAS ON MY WAY TO RENO AND I HAD TO KEEP GOING BUT IT WAS HELL AND ONE OF THE WORST EXPERIENCE OF MY LIFE. PART OF THE GLASS FLEW OFF WITHIN MINUTES OF ME DRIVING SO RAIN GOT INTO MY CAR. I HAD TO TAPE A TARP DOWN WITH GORILLA TAPE TO GET TO A SAFE DESTINATION. THERE WAS GLASS INSIDE THE CAR AND MY LITTLE BROTHER GOT CUT ON HIS ARM, THIS GLASS IS THICK AND HEAVY! THE SECOND TIME WAS 8 MONTHS AFTER I HAD IT REPAIRED. RAINING AGAIN BUT THIS TIME I WAS AT A  STOP LIGHT WHEN I HEARD THE GUNSHOT NOISE AND I IMMEDIATELY KNEW WHAT HAPPENED. I WAS SCARED BUT SO VERY UPSET THAT IT HAPPENED AGAIN JUST MONTHS APART. IT'S VERY UPSETTING THAT LINCOLN HAS NOT RECOGNIZED THIS AS A DEFECT ON THIS VEHICLE. I HAVE READ NUMEROUS BLOGS AS ON HERE THE SAME COMPLAINT FROM PEOPLE ALL OVER THE US THAT THIS HAS HAPPENED TO. IT'S SO UNSAFE TO DRIVE AND UPSETTING BECAUSE I REALLY LOVE THE VEHICLE OTHER THAN THAT HUGE DEFECT. ON TOP OF THAT THIS REPAIR IS COSTLY, GLASS ALONE IS $1400-1600 WITHOUT LABOR IN MY AREA. I HOPE THAT LINCOLN WILL SOON TAKE RESPONSIBILITY AND I PLAN TO KEEP FIGHTING THIS FIGHT AS I HAVE A FEELING THIS WILL CONTINUE TO HAPPEN. I FEEL SO UNSAFE DRIVING THIS VEHICLE NOW. I REALLY HOPE MORE PEOPLE COMPLAIN AND SPEAK UP.",
        "vin": "2LMHJ5NK7GB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11104438,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW SPONTANEOUSLY SHATTERED. DAYLIGHT HOURS, APPROXIMATELY 70 DEGREES FAHRENHEIT, DRY WEATHER CONDITIONS, PARKED IN SHADED AREA. DRIVER WALKED TO VEHICLE, SAT IN DRIVER SEAT, CLOSED DRIVER-SIDE DOOR, AND STARTED VEHICLE UNEVENTFULLY. LESS THAN ONE MINUTE LATER THE REAR WINDOW SPONTANEOUSLY SHATTERED. DRIVER CUT LEFT HAND ON BROKEN GLASS WHEN ATTEMPTING TO RETRIEVE PERSONAL BELONGINGS IN THE REAR COMPARTMENT.",
        "vin": "2LMHJ5AT3GB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2018",
        "dateOfIncident": "02/28/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075972,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON A HIGHWAY, THE MOONROOF ON MY VEHICLE EXPLODED (SOUNDED LIKE A .38 GOING OFF).  I IMMEDIATELY PULLED OVER TO SEE WHAT HAD HAPPENED (THINKING MAYBE IT WAS A BLOWN TIRE) ONLY TO FIND THAT THE MOONROOF HAD COMPLETELY SHATTERED (SEE ATTACHED PICTURES).  I HAD TWO OTHER PEOPLE IN MY VEHICLE AT THE TIME.  FORD KNOWS THAT THIS IS A FLAW AND WON'T RECALL THESE VEHICLES IN WHICH I BELIEVE SHOULD BE MANDATORY AS IT IS A HIGHLY DANGEROUS SAFETY ISSUE.",
        "vin": "2LMHJ5NK2GB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072330,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKT",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOONROOF SHATTERED WITH NO REASON AS I WAS PULL FROM MY DRIVEWAY. OUTSIDE TEMPERATURE 28 DEGREES NOT EVEN COLD FOR A CHICAGO. I WAS DRIVING NO MORE THAN 15 MILES AND NO HARD BRAKES OR BUMPS JUST SUDDENLY CRACKED ALL OVER.",
        "vin": "2LMHJ5NK4GB"
    }
]