[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266171,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD AND THE CHECK BRAKES LIGHT CAME ON SIMULTANEOUSLY WITH A LOW BRAKE FLUID WARNING.  I WENT TO PUSH THE BRAKES AND THE PEDAL WENT ALL THE WAY TO THE FLOOR.  LUCKILY, I WAS DRIVING SLOW ENOUGH IN A LOW TRAFFIC AREA THAT I WAS ABLE TO BRING THE VEHICLE SAFELY TO A STOP.  THERE WERE NO SIGNS OF A BRAKE FLUID LEAK AND THE VEHICLE RECEIVED REGULAR SERVICE (OIL, FLUIDS, TIRE ROTATION ETC.) LESS THAN A MONTH PRIOR AT A FORD DEALERSHIP.  WE HAD THE VEHICLE TOWED TO THE SAME FORD DEALERSHIP WHERE WE PAID OVER $900 FOR A NEW MASTER CYLINDER AND BRAKE BOOSTER.  THE $900 BILL HURT, BUT THIS COULD HAVE BEEN MUCH WORSE.  THROUGH ADDITIONAL RESEARCH, THIS APPEARS TO BE A COMMON PROBLEM AMONG F-150S AND EXPEDITIONS (SAME PARTS) AND SOMEBODY IS GOING TO GET KILLED IF THE PROBLEM IS NOT ADDRESSED.",
        "vin": "5LMJJ3HTXGE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE LOW BRAKE FLUID LIGHT ILLUMINATED AND CHECK BRAKE FLUID WARNING ALERTED ME, AS I WAS LOOKING FOR A PLACE TO PULL OVER THE BRAKE PEDAL WENT TO THE FLOOR BOARD AND NO BRAKES WERE PRESENT. I HAD TO APPLY THE EMERGENCY BRAKE TO STOP THE VEHICLE. AFTER STOPPING I OPENED THE HOOD TO CHECK THE BRAKE FLUID LEVEL AND IT WAS COMPLETELY EMPTY. NO VISIBLE SIGNS OF A LEAK UNDER VEHICLE OR INSIDE ENGINE BAY. IT APPEARS TO BE A TOTAL FAILURE OF THE MASTER CYLINDER AND BRAKE BOOSTER AS NOTED IN HUNDREDS OF OTHER COMPLAINTS ON THIS FORD LINCOLN BRAKE SYSTEM.",
        "vin": "5LMJJ3HT7GE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233887,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT LOSS OF POWER AND/OR AN ILLUMINATED POWERTRAIN MALFUNCTION.     VEHICLE STALLS DUE TO FAULTY THROTTLE BODY ACTUATOR.  FORD/LINCOLN IS WELL AWARE OF THIS ISSUE AND HAS ISSUED A FIELD SERVICE ACTION BULLETIN FOR THIS CONDITION (16B32).       HTTPS://FORD.OEMDTC.COM/2593/INTERMITTENT-LOSS-OF-POWER-ANDOR-AN-ILLUMINATED-POWERTRAIN-MALFUNCTION-WRENCH-LAMP-WITH-DTCS-P2111-P2112-ANDOR-P2119-2015-2016-FORD-LINCOLN    THE VEHICLE LOSES ALL POWER CREATING AN EXTREMELY UNSAFE CONDITION.  STALLS WHEN ACCELERATING, LOSING ALL POWER FORCING VEHICLE OPERATOR TO STOP - TURN OFF ENGINE AND HOPE IT ACCELERATES UPON RESTARTING.  THIS NEEDS TO BE ELEVATED TO A FORD RECALL FOR IMPACTED VEHICLES AND ALL COSTS COVERED BY FORD/LINCOLN.  ABSOLUTELY UNACCEPTABLE.      I HAVE HAD MY VEHICLE STALL WHEN PULLING OUT FROM A STOP SIGN INTO TRAFFIC, ON THE HIGHWAY WHEN ATTEMPTING TO ACCELERATE TO PASS TRAFFIC AND ON CITY STREETS DURING NORMAL DRIVING.  EACH TIME THIS OCCURRED THERE WAS A VERY SIGNIFICANT CHANCE FOR SOMETHING REALLY BAD TO HAPPEN... NOT SURE HOW I ESCAPED DRIVING THIS UNSAFE VEHICLE UNSCATHED.",
        "vin": "5LMJJ3JT2GE"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "12/10/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934922,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING APPROXIMATELY 65 MPH ON HIGHWAY 18 IN YAMHILL COUNTY, OREGON ON A CURVED SECTION OF THE ROAD THE SUNROOF SPONTANEOUSLY EXPLODED.  THERE WERE NO VEHICLES NEAR ME AND THERE WAS NOTHING OVERHEAD.  WE FOUND NO ROCKS IN THE VEHICLE AND FROM THE ATTACHED PICTURES IT IS CLEAR THAT THE GLASS BROKE IN AN OUTWARD/UPWARD DIRECTION.  THE INTERIOR TEMPERATURE OF THE CABIN WAS ABOUT 74 AND THE HEATER FAN WAS RUNNING AT NEAR MAXIMUM.  OUTSIDE TEMPERATURE WAS APPROXIMATELY 36 DEGREES FAHRENHEIT.  *TR",
        "vin": "5LMJJ3JT1GE"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/10/2016",
        "dateOfIncident": "12/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845919,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT BELT DOES NOT CHIME WHEN NOT CONNECTED. NO AIR BAG INDICATOR FOR PASSENGER SIDE. I QUESTIONED FORD MOTORS AND WAS TOLD THAT THERE IS NONE FOR PASSENGER SIDE. THIS UPDATE HAS NOT BEEN DONE IN THE NAVIGATOR YET. IS THIS POSSIBLE ??????  COULD SOMEONE ACTUALLY SIT IN THE FRONT PASSENGER SEAT AND NOT BE REMINDED TO FASTEN THERE SEAT BELT?????. I TESTED THIS FROM 0 TO 30 MILES AN HOUR.  SINCERELY,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5LMJJ2HT9GE"
    }
]