[
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443205,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Since 2019 there have been several instances with my vehicle where someone has been able to knock the power offline thereby disabling it.  It happened in five locations - a storage location in Olive BranchN MS, a former address in Memphis, TN (4330 Angarath Dr), a restaurant (Sonic) in Greenville, MS and twice in Greenville, MS both at a local park (Hardee Park).  I never received any recall notices during this time regarding my vehicle ref a problem with the internal lighting for the odometer / gas meter, for the alarm system, for the battery, chasis - the frame shakes - I even reported feeling something when I first bought it back in Nov of 2015, and the door locks on the driver side stated losing the notification of being locked so I have to walk back to check and have found out that some additional delay is happening causing it not to lock properly so I open and close it to get it to lock.  I have received any notifications for issues with locks, power, or the suspension (chasis).  My car has been stole from the dealership in Memphis near the Germantown TN area, from storage and then from the parking lot of my current address in Greenville MS.  I reported all of this to local management and I told the prior people that had the dealership that something had happened to my car and they joked around trying to make a joke out of it.  I called the prior service manager and a Mazda dealer in Atlanta when it was knocked offline in 2019 and was told it was an issue they could not resolve over the phone but told me to try a couple of things to see it would start.  I finally heard back from the one in Memphis who agreed and I got it to start after sitting in that park almost stranded.  They did it again yesterday but it would not start even after I know I spent almost $200 on a new battery after it shutdown at a local restaurant and it would not start after an electrical spark hut the car and shocked my leg.  The car is only 5 years old; it shouldn't have these problems.",
        "vin": "JM1NDAC71G0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416144,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AND I HEARD A LOUD CRACKING NOISE. I STOPPED AT A GAS STATION TO CHECK AND SAW THAT THE UPPER MOLDING PART OF THE CAR HAD BROKEN OFF.",
        "vin": "JM1NDAD72G0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386764,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SPIDER CRACKING ON CENTER DISPLAY MAZDA SERVICE BULLETIN R018/18. SINCE VEHICLE IS OUT OF WARRANTY WILL NOT REPAIR EVEN THOUGH IT WAS A NOTED MFG DEFECT.  SHOULD BE A SAFETY ISSUE AS SCREEN WILL BECOME ON READABLE AND SAFETY IS A 5 YR WARRANTY ADV NO.   MAZDA SHOULD OF NOTIFIED OWNERS OF THIS ISSUE DID NOT.",
        "vin": "JM1NDAD79G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366246,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER STOPPED WORKING. AC COMPRESSOR HOSE CRACKED. SHOP SAID THIS IS HAPPENING SO MUCH, TO THIS YEAR/ MODEL, THAT THEY KEEP THE PART IN STOCK.",
        "vin": "JM1NDAD7XG0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366245,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING, MOST OF THE TIME THE BLIND SPOT SENSOR DOES NOT TURN ON (SOUND AND LIGHT). IT CAN GO DAYS WITHOUT TURNING ON AT ALL THEN ALL OF A SUDDEN IT WORKS 1 OR 2 TIMES.",
        "vin": "JM1NDAD7XG0"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365631,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISORS ON FIRST GENERATION ND MX-5 SUBJECT TO CATASTROPHIC FAILURE, LEADING TO DANGEROUS DRIVING CONDITIONS. I WAS AT HIGHWAY SPEED WHEN THE DRIVER'S SIDE VISOR FAILED ON MY CAR. THE VISOR WOULD NO LONGER STAY IN POSITION. IT JUST HUNG AT THE BOTTOMMOST POSITION. AS A TALL DRIVER I FIRST SCRUNCHED DOWN IN THE SEAT IN ORDER TO SEE PROPERLY OUT THE WINDSHIELD. EVENTUALLY I HELD THE SAGGING VISOR UP WITH MY LEFT HAND AND STEERED/SHIFTED WITH MY RIGHT HAND. NOT IDEAL AND DEFINITELY NOT PERFECTLY SAFE.    ONLINE FORUMS INDICATE THIS IS A WIDESPREAD PROBLEM WITH FIRST GENERATION NDS.THOUGH THE SUN VISORS IN MY 2016 ND HAVE BEEN USED SPARINGLY, BOTH DRIVER AND PASSENGER SIDE VISORS HAVE FAILED IN THE SAME PLACE: AT THE HINGE NEAR THE DOME LIGHT. THE REPLACEMENT PART IS NEARLY $300, NOT INCLUDING INSTALLATION. THE PART WAS QUICKLY REDESIGNED BY MAZDA BUT OWNERS OF EARLY VINS ARE OUT OF LUCK.",
        "vin": "JM1NDAB71G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "04/16/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321333,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "6 SPEED MANUAL TRANSMISSION, VEHICLE STATIONARY AND DOESN'T WANT TO GO INTO 1ST GEAR AND YOU SOMETIMES MUST SHOVE IT IN, INTERMITTENT ISSUE. ALSO A TON OF GEAR WHINE UNDER MODERATE THROTTLE IN 3RD AND 4TH GEAR. FAILURE MILEAGE IS 41,118 MILES. FAILURE OF THE TRANSMISSION IN GEAR AT SPEED COULD RESULT IN A CATASTROPHIC ACCIDENT DUE TO LOSS OF FORWARD PROPULSION. MAZDA HAS RELEASED A TSB ON THIS REF IS R083/16B AND 05-007/16 YET ARE BASICALLY TELLING ME IT'S UP TO THE NHTSA TO RECALL IT OR THERE'S NOTHING THEY WILL DO UNTIL IT COMPLETELY GRENADES AND POTENTIALLY CAUSES AN ACCIDENT.     THIS IS NOT A SMALL ISSUE AFFECTING A SMALL BATCH OF CARS, THIS IS A FAIRLY WIDESPREAD ISSUE AFFECTING A LARGE SPAN IN PRODUCTION. FROM INTERNAL SOURCES I'VE LEARNED MAZDA IS ON THE FOURTH SEPARATE REVISION OF THE 6 SPEED MANUAL TRANSMISSION IN THE 4TH GENERATION MX-5 AND EVEN SOME 3RD REVISION TRANSMISSIONS HAVE SHOWN WEAKNESS. IN SHORT, THE 6 SPEED MANUAL TRANSMISSION WAS NOT DESIGNED FOR THE 2.0L ENGINE IN THE U.S MODEL, INSTEAD WAS ONLY INTENDED TO BE USED WITH THE LESS TORQUEY 1.5L IN THE EUROPEAN AND JAPANESE MODEL. MAZDA USA PUSHED FOR THE 2.0L LAST MINUTE IN PRODUCTION FOR MORE POWER IN THE U.S MARKET DESPITE NOT HAVING A SUITABLE MANUAL TRANSMISSION AVAILABLE. THE DIFFERENCE IN MANUFACTURING TOLERANCES HAS LED TO SEVERAL INSTANCES OF COMPLETE GEAR FAILURE IN STOCK COMPLETELY UNMODIFIED CARS AND IS AN ACCEPTED DESIGN FLAW BY MAZDA AND WHY THEY HAVE HAD SO MANY COMPLETE TRANSMISSION OVERHAULS IN A SHORT SPAN. IN SHORT EVERY MANUAL MX-5 THAT WAS PRODUCED BEFORE SEPTEMBER 6TH 2016 HAS A TRANSMISSION THAT'S A TICKING TIME BOMB. MINE IS SEPTEMBER 2015 PRODUCTION DATE. I STRONGLY BELIEVE THIS TSB SHOULD BE REFERENCED AND THESE TRANSMISSION RECALLED. A WEIRD COINCIDENCE IS THIS VERY CAR ALSO HAD AN AUTOMATIC TRANSMISSION RECALL. I HAVE ATTACHED THE REFERENCED TSB BELOW. PLEASE RECALL.  *TR",
        "vin": "JM1NDAD78G0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315608,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE TIRES ARE THE ORIGINAL TIRES THAT CAME ON MY CAR WHICH WAS PURCHASED IN SEPTEMBER OF 2016.  WHEN I WAS ROTATING THESE TIRES FOR THE SECOND TIME IN 6138 MILES I NOTICED THAT THESE TIRES WERE SPLITTING OPEN IN THE GROOVES THAT RUN AROUND THE CIRCUMFERENCE OF THE TIRE.  I AM AFRAID TO DRIVE THIS CAR FOR FEAR OF A BLOWOUT IN ONE OR MORE TIRES.  THESE BRIGESTONE POTENZA S001 TIRES SHOULD BE WATCHED CLOSELY  IF THEY ARE SPLITTING OPEN WITH ONLY 6138 MILES AND 3 1/2 YEARS OF USE.  I FEEL THAT THESE ARE VERY UNSAFE TIRES.",
        "vin": "JM1NDAD72G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/13/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289267,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MAZDA MX-5. WHILE DRIVING APPROXIMATELY 10 MPH ACROSS AN INTERSECTION, THE VEHICLE DECELERATED. THERE WERE NO WARNING INDICATORS ILLUMINATED. ANOTHER VEHICLE TRAVELING ACROSS THE INTERSECTION COLIDED WITH THE REAR PASSENGER SIDE OF THE CONTACT'S VEHICLE. POLICE REPORT NUMBER: 2019643494 WAS FILED. THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOWED TO A BODY SHOP AND REPAIRED. THE MANUFACTURER AND DEALER WERE NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 49,000.",
        "vin": "JM1NDAB76G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287640,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A PUBLIC 2-LANE ROAD AND UPSHIFTING INTO 3RD GEAR AT ABOUT 6,500 RPM MY TRANSMISSION FAILED. I IMMEDIATELY SLOWED FROM ABOUT 65 MPH AND COASTED TO A STOP.  I WAS LUCKY THAT THERE WAS A JUST ADEQUATE SHOULDER, AND I WAS ABLE TO AVOID BEING REAR-ENDED BY FASTER TRAFFIC.  I PULLED AS FAR TO THE RIGHT AS I COULD, STILL WITHING 4 FEET OF THE PAVEMENT. I DETERMINED THAT I COULD STILL DRIVE IN 1ST GEAR AND, DRIVING ONLY ON THE SHOULDER, DROVE THE CAR TO A WIDER, SAFER SPOT. A FRIEND CAME BY LATER WITH HIS TRUCK AND TRAILER TO TAKE MY CAR TO MY HOME. I THEREUPON HAD IT TOWED TO A MAZDA DEALER THE NEXT DAY. THE DEALER DIAGNOSED A MANUAL TRANSMISSION FAILURE, 3RD GEAR SPECIFICALLY, AND TOLD ME I WAS LUCKY THE GEARBOX DIDN'T SIEZE AND CAUSE A LACK OF CONTROL.  THEY REPLACED THE ENTIRE TRANSMISSION AT NO COST TO ME.",
        "vin": "JM1NDAD70G0"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2019",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210051,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN THE 2016 MX-5 ND GT WITH MANUAL TRANSMISSION AND IT HAS ABOUT 35,000 ISH MILES ON IT, BUT IT'S STARTING TO HAVE TRANSMISSION AND GEAR SHIFT PROBLEMS.   1) THE CAR HAS ISSUES WITH ACCELERATION DELAY FROM GEAR 1 & 2, THE TORQUE, HP, NONE OF IT FEEL THE SAME AS WHEN I BOUGHT IT.   2) THE CAR WILL START HAVING RATTLING NOISE ISSUES COMING FROM UNDER THE HOOD, I SUSPECT FROM THE HEAT SHIELD WHICH IS MADE FROM THIN ALUMINUM MATERIAL. ALSO RATTLING FROM INSIDE, ALL THE PLASTIC PARTS FROM WITHIN THE CABIN, SEAT, DASHBOARD, ETC 3) THE GEAR BOX IS NOT SMOOTH AND SOMETIMES WOULD HAVE HARD TIME SHIFTING. IN MY CASE, I HAVE ISSUES FROM 5 TO 6. I LITERALLY HAVE TO GIVE IT 1 OR 2 SEC DELAY AFTER SHIFTING HALF WAY SO THAT IT WILL EASE ITSELF IN.  ALSO SHIFTING FROM 1ST TO 2ND GEAR, THE TRANSMISSION JERKS  4.) WHEN MOVING OR TURNING FROM STATIONARY, THE CAR MAKES GRINDING NOISE FROM UNDER THE CAR",
        "vin": "JM1NDAD79G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/14/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208153,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS MADE OF WEAK GRADE MATERIALS AND RUNNING AT HIGH TEMPS CAUSING THE TRANSMISSION TO FAIL RANDOMLY WHILE DRIVING. I AM ON MY SECOND TRANSMISSION AND MAZDA FAILS TO HELP OR ADDRESS THE CONCERN. THE PROBLEM HAS BEEN PROVEN BY MANY SHOPS AT THIS POINT AND MOST IMPORTANTLY BY A MAZDA ENGINEER ON A YOUTUBE VIDEO. THIS MAZDA ENGINEER SPECIFICALLY STATES THAT WEAK TOLERANCES ARE CAUSING MANUAL TRANSMISSIONS TO SHEAR TEETH UNDER LOAD. BOTH TIMES MY TRANSMISSIONS PARTS EXPLODED I WAS AT SPEED. THE FIRST TIME WAS ON A CITY STREET, THE SECOND TIME WAS ON A VERY BUSY HIGHWAY DURING RUSH HOUR. THE FIRST TIME, NO GEARS WERE USABLE AND I HAD TO BE TOWED HOME AFTER COASTING MY CAR TO A STOP IN NEUTRAL. THE SECOND TIME I COULD ONLY USE 4TH GEAR AND HAD TO LIMP HOME.",
        "vin": "JM1NDAD77G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206038,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SPONTANEOUSLY JUMPS OUT OF 4TH GEAR INTO NEUTRAL AT HIGHWAYS SPEED.    THIS WILL TYPICALLY HAPPEN ON A MODERATELY STEEP DOWNWARD GRADE (E.G. CALIFORNIA HIGHYWAY 17 BETWEEN SUGARLOAF ROAD AND GLENWOOD CUTOFF HEADING TOWARDS SAN JOSE, OR THE CURVE KNOWN AS THE \"VALLEY SURPRISE\" JUST PAST SUMMIT ROAD AND HIGHWAY 17 INTERSECTION) AS THE VEHICLE SLOWS AND ENGINE BRAKING KICKS IN.    STEPS TO REPRODUCE:  PLACE VEHICLE IN 4TH GEAR.  DRIVE AT APPROXIMATELY 60 MILES PER HOUR.   ON DOWNHILL GRADE BACK OFF ACCELERATOR  AS ENGINE BRAKING BEGINS THE VEHICLE SPONTANEOUSLY JUMPS INTO NEUTRAL.    THIS HAPPENS REPEATEDLY AND REPRODUCIBLY. VEHICLE IS UNDER MAZDA WARRANTY.    DATE IS JUST AN INDICATION. THE FAULT OCCURS DAILY.",
        "vin": "JM1NDAD71G0"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/24/2018",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163300,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS SHAKE. MIRROR COVERS ON VISORS BROKE, NEVER EVEN USED MIRRORS. BURNS OIL.",
        "vin": "JM1NDAD7XG0"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099285,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IN MOTION, WHILE DRIVING THE CAR THE RED KEY LIGHT ON THE ENGINE START BUTTON STARTED FLASHING.  WHEN WE GOT HOME THE CAR WOULD NOT TURN OFF.  ALSO COULDN'T SHIFT THE CAR.  FINALLY GOT THE CAR TO TURN OFF AND WHEN WE STARTED THE CAR AGAIN THE CHECK ENGINE LIGHT CAME ON. CAR DEALERSHIP FOUND SEVERAL CODES STORED, BUT COULD NOT FIND THE PROBLEM.  BELIEVE THIS IS A SERIOUS SAFETY ISSUE WITH RED WARNING LIGHTS START FLASHING WHEN DRIVING, CAR WOULD NOT TURN OFF AND WE COULD NOT SHIFT THE CAR.",
        "vin": "JM1NDAC70G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040460,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT MONITORING SYSTEM WOULD DISENGAGE  ( COME OFF) WHEN YOU ARE DRIVING WHILE ANOTHER VEHICLE IS WITHIN RANGE ( CLOSE ON YOUR LEFT OR RIGHT SIDE.  NO LIGHT INDICATES ON DASH THAT THE SYSTEM IS OFF NOR ANY WARNING OR BEEPS IS HEARD IF YOU ACTIVATE YOU CHANGE LANE SIGNALS.  THIS HAS HAPPEN RANDOMLY AT LEAST THREE TIMES ALL SIMILAR.  EVEN IF YOU DEPRESS AND RELEASE  THE SWITCH FOR THIS FEATURE WHILE DRIVING ( TO TURN IT OFF OR ON) IT DOES NOT REACTIVATE THIS FEATURE NOR IS THEIR ANY INDICATION IN THE DASHBOARD.  AFTER STOPPING AND TURNING OFF THE IGNITION AND RESTARTING THE CAR THEN THIS FEATURE IS ACTIVATED.. SO FAR THIS HAS HAPPENED ON BOTH A BUSY CITY HIGHWAY AND SECONDARY ROADS.WHILE VEHICLE IS IN MOTION.  THIS MATTER HAS BEEN REPORTED TO MAZDA USA  AND THE DEALER GARDEN CITY MAZDA IN NY STATE.LAST INSTANT WAS 10/21/17.",
        "vin": "JM1NDAD74G0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040251,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNERS MANUAL (ATTACHED) DOES NOT MENTION THE FOAM FILTERS LOCATED BENEATH THE PLASTIC FILTERS (PHOTO ATTACHED). COMPLAINT IS THAT THE FOAM FILTERS DO NOT DRY, AND BECOME CAKED WITH BLACK MOLD. IN THE ATTACHED PHOTO, THE FOAM FILTERS HAVE BEEN SOAKED WITH BLEACH TO KILL THE MOLD, AND WASHED TO CLEAN OUT THE  MOLD \"SCALE\". IN ADDITION TO THE POTENTIAL HEALTH HAZARD TO OCCUPANTS OF THE VEHICLE, CLOGGED WITH MOLD FILTERS CAN PREVENT PROPER OPERATION OF THE DRAINS, RESULTING IN FLOODING OF THE CAR INTERIOR, AND RUST. WATER EXPOSURE CAN BE FROM CAR WASHING AS WELL A RAIN, BOTH BEING ROUTINE EXPOSURES.",
        "vin": "JM1NDAC73G0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/15/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978670,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON THE HOOD OF MY MIATA IS FULL OF CHIPS AND I HAVE ONLY 941 MILES ON THE ODOMETER.  I HAVE OWNED 6 CARS PRIOR TO THIS ONE, I HAVE NEVER SEEN ANYTHING LIKE AND THIS MIATA IS MY SECOND CAR USED MOSTLY ON WEEKENDS.  THANK YOU FOR YOUR TIME.  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JM1NDAB70G0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/15/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966190,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FALSE POSITIVE WARNING LIGHT ON TIRE PRESSURE MONITORING SYSTEM. LOW PRESSURE INDICATOR LIGHT COMES ON EVEN THOUGH TIRES ARE EQUAL AND NORMAL PRESSURE. THIS FALSE POSITIVE WARNING COMES ON FREQUENTLY AND RENDERS THE TPMS INEFFECTIVE.  LOW TIRE PRESSURE LIGHT CAME ON DURING NORMAL DRIVING ONLY 125 MILES AFTER BEING RESET AFTER LAST OCCASION.  BOTH TIMES RESET WAS DONE AT THE MAZDA DEALERSHIP.",
        "vin": "JM1NDAC79G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "12/21/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937172,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS STATIONARY, IN NEUTRAL WITH THE PARKING BRAKE IN PLACE WHEN I HEARD A LOUD BANG AND THEN THE NEXT DAY, THE TRANSMISSION WAS MAKING AN UNUSUAL WHINING NOISE IN THIRD GEAR WHILE DRIVING ON THE CITY AND IN THE HIGHWAY (DURING TRAFFIC) AT AROUND 30-35 MPH. THIS LED ME TO SUSPECT THAT THE TRANSMISSION IS HAVING ISSUES AND BROUGHT IT TO THE DEALER A FEW DAYS LATER. EVEN THOUGH THE LOUD BANG COULDN'T BE REPLICATED, THE WHINING NOISE WAS STILL THERE AND SURELY ENOUGH THE TRANSMISSION WAS ACTING FUNNY.    AFTER SOME RESEARCH I FOUND THAT THE 2016 MAZDA MX-5 IS NOTORIOUS FOR EATING UP SECOND AND THIRD GEAR AND MAZDA HASN'T REALLY CONSIDERED PUTTING OUT A RECALL. THEY HAVE TO PUT A RECALL OUT, THEY NEED TO FIX THESE CARS BECAUSE THERE ARE REPORTS OF CARS WITH TRANSMISSIONS FAILING WHILE IN NEUTRAL OR WHEN DRIVING IN GEARS OUTSIDE OF SECOND THE THIRD (THE TWO GEARS THAT LIKE TO SELF DESTRUCT).  *TR",
        "vin": "JM1NDAC78G0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/13/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10927258,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A CAR ACCIDENT ON 13 NOV 2016 WHEREBY THE VEHICLE ROLLED SEVERAL TIMES DOWN A STEEP INCLINE. NONE OF THE AIRBAGS WERE DEPLOYED. MY SPINAL CORD WAS FRACTURED AND MY SKULL CRACKED.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/09/2016",
        "dateOfIncident": "11/05/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925207,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING FROM A TRAFFIC LIGHT THE TRANSMISSION STOPPED WORKING AND I LOST ACCELERATION IN A BUSY ROAD. THIS IS THE SECOND TIME THIS HAS HAPPENED IN A BUSY INTERSECTION.",
        "vin": "JM1NDAD76G0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919013,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BROUGHT THE MX-5 INTO THE DEALER FOR THE 5K OIL CHANGE AND CHECKUP WITH A COMPLAINT THAT THE INNER LINER COMES UNSNAPPED AND PARTIALLY BLOCKS VISIBILITY OF THE REAR WINDOW WHEN YOU PUT THE TOP DOWN AND LATER PUT IT UP. MAZDA SERVICE DID NOT MAKE NOTE OF THIS IN THE SERVICE AND DIDN'T FIX IT. I ASKED THE SERVICE ADVISOR ABOUT IT WHO THEN BROUGHT THE CAR BACK IN AND A TECH \"FIXED\" IT IN A FEW MINUTES. WHEN I GOT HOME'.SAME THING. ONCE YOU PUT THE TOP DOWN AND THEN LATER PUT IT UP THE INNER LINER UNSNAPS AND HANGS DOWN PARTIALLY BLOCKING YOUR REAR VIEW. I JUST BOOKED THE 10K OIL CHANGE AND RECEIVED NOTICE (EMAIL) BACK FROM MAZDA NOTING THE OIL CHANGE BUT NOT THE REAR WINDOW ISSUE, ONLY A NOTE SAYING CHECK SERVICE OTHER.  THIS IS NOT AN UNCOMMON ISSUE. I HAVE FOUND SITES ON THE WEB INDICATING OTHERS HAVE THE SAME ISSUE. IT SEEMS THERE MAY BE A TSB # 001166 (NOT SURE IF IT'S USA OR UK) RELATED TO THIS ISSUE WITH PARTS REPLACED : N247-R1-280 PROTECTOR-TOP, LH 1 LH AND N247-R1-230 PROTECTOR-TOP, RH 1 RH.  IF THERE IS A TSB FOR THIS WHY ISN'T IT LISTED ON ANY FORMAL MAZDA SITES AND WHY IS THE MAZDA DEALER IGNORING IT? I EMAILED THE MAZDA DEALER BACK TO ASK THAT MY SPECIFIC COMPLAINT BE ADDED TO THE SERVICE NOTES. I DON'T WANT TO PAY FOR A NEW ROOF WHEN THE WARRANTY RUNS OUT AT 36K MILES !!!!",
        "vin": "JM1NDAD77G0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "07/03/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884455,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MX-5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING MY TRANSMISSION GEARS HAVE DISINTEGRATED TWICE LEAVING CAR WITH NO WAY TO USE POWER. ONCE WAS A SIDE STREET, OTHER TIME I WAS MAKING A LEFT TURN IN AN INTERSECTION.",
        "vin": "JM1NDAD76G0"
    }
]