[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457624,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mazda Mazda6. The contact stated that while starting the vehicle, the security indicator light was continuously flashing. The vehicle was taken to a local mechanic and diagnosed as a security indicator light failure. The vehicle was repaired; however, the failure recurred. The manufacturer was notified of the failure. The approximate failure mileage was 110,000.",
        "vin": "JM1GJ1U59G1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452282,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mazda Mazda6. The contact stated while driving approximately 65 MPH, the vehicle lost motive power. The contact pulled over but was unable to restart the vehicle. The vehicle was towed to an independent mechanic to be diagnosed. The contact was informed that the engine needed to be replaced. The vehicle was not repaired. The manufacturer was informed of the failure and informed the contact that the vehicle was not under warranty. The failure mileage was approximately 80,000.",
        "vin": "JM1GJ1V54G1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431247,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle infotainment system in this 2016 Mazda 6 no longer works and has what is called a rolling reboot.  This seems a common problem with Mazda's based on a service alert SA-011/20 as well as a TSB 09-020/18. When broken I can't use the hands free to make or receive calls, nor can I modify preferences, service warnings, use the radio  etc.  The car is out of warranty and the part known as a connectivity master unit (CMU) is over $1000 including tax.  I think Mazda should at least provide a replacement part for this very common problem, which effects many models.",
        "vin": "JM1GJ1V56G1"
    },
    {
        "components": "STRUCTURE,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408557,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAK IN TRUNK AREA LEADING TO ABOUT A 2-INCH PUDDLE OF WATER ACCUMULATION INSIDE THE TRUNK AT THE LOCATION OF THE SPARE TIRE AREA. ISSUE WAS NOTICED ON APRIL 16, 2021.      THE WATER ACCUMULATED ON TOP AND AT THE BOTTOM OF THE SPARE TIRE. THE PARTS OF THE VEHICLE ARE BEGINNING TO BE NEGATIVELY AFFECTED --MOLD, ETC. THERE WERE ITEMS STORED AROUND THE SPARE TIRE 'E.G. FLAT TIRE REPAIR KIT, EMERGENCY BLANKET, ETC. THAT DEVELOPED MOLD DUE TO THE ACCUMULATED WATER AND WERE THROWN AWAY UPON INSPECTION.    IN ADDITION TO THE SPARE TIRE AREA ACCUMULATING SEVERAL INCHES OF WATER, THE SPARE THE COVER (I.E.PLASTIC HONEYCOMB TYPE THAT SITS DIRECTLY ON TOP OF THE SPARE TIRE) IS AFFECTED WITH THE EVAPORATION/CONDENSATION OF THE ACCUMULATED WATER.  ALL OTHER PARTS OF THE TRUNK AND VEHICLE ARE WERE NOT WET TO THE TOUCH. THE SOURCE OF THE WATER IS UNKNOWN.  AND IT WAS NOT A USER ERROR TYPE OF ISSUE 'THE VEHICLE HAS BEEN STORED WITH ALL WINDOWS, DOORS, TRUNK, AND HOOD CLOSED.      CONCERN IS THAT THE ACCUMULATION OF WATER WILL LEAD TO THE DEVELOPMENT OF MOLD INSIDE THE VEHICLE AND AN UNHEALTHY ENVIRONMENT FOR THE DRIVER AND PASSENGERS OCCUPYING THE CAR. ADDITIONALLY, IT WILL LEAD TO VEHICLE CORROSION SINCE THE AREA WHERE THE WATER ACCUMULATES IS NOT INTENDED TO BE CONSISTENTLY HOLDING WATER.      ATTACHED ARE SEVERAL PHOTOS SHOWING THE AFFECTED AREA. NOTE THAT THE PHOTOS ONLY SHOW THE ACCUMULATED WATER THAT WAS UNDERNEATH THE SPARE TIRE AFTER THE WATER ACCUMULATED ON TOP OF THE SPARE TIRE (INNER SECTION OF THE SPARE TIRE METAL WHEEL WHICH LAYS UP WHEN STORED IN THE VEHICLE'S TRUNK), CLOSE TO 2-INCHES WORTH, WAS REMOVED ALONG WITH THE SPARE TIRE ITSELF. I DID NOT THINK OF TAKING PHOTOS OF THE ISSUE UNTIL AFTER I REMOVED THE SPARE TIRE AND THE ACCUMULATED WATER.    PLEASE LOOK INTO THE MATTER AND CONSIDER ISSUING A RECALL THAT WOULD ALLOW MAZDA TO CORRECT THE PROBLEM.THANK YOU.",
        "vin": "JM1GJ1W58G1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372586,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY PARKING BREAK LIGHT RANDOMLY COMES ON IT WHEN DRIVING. IF I ATTEMPT TO ENGAGE PARKING BRAKE IN ORDER FOR ME TO DISENGAGE IT REQUIRES THAT I PUT MY SEATBELT ON AND HAVE DOORS LOCK THEN PUT CAR IN DRIVE TO TAKE BREAK OFF. BUT LIGHT STILL REMAINS ON.",
        "vin": "JM1GJ1V59G1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "08/22/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352930,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY INFOTAINMENT UNIT IS IN A CONSTANT REBOOT.  I CANNOT ACCESS MY CAR SETTINGS OR RADIO OR BLUETOOTH, AND THE REAR VIEW CAMERA IS NOT WORKING EVERY TIME.  IT WAS FINE AND THEN IT WASNT.  I TOOK IT TO THE DEALER AND THEY TOLD ME IT WOULD BE 1500 DOLLARS.  I SEE A LOT OF PEOPLE WITH THIS PROBLEM IN MY RESEARCH.  I THINK THIS SHOULD BE A RECALL BECAUSE IT IS A SAFETY ISSUE SINCE I CANNOT ACCESS MY CAR SETTINGS, MY CAMERA IS NOT WORKING AND MY ALERT FOR WHEN SOMEONE IS BEHIND ME IS ALSO NOT WORKING.  I HAVE A VIDEO OF THE REBOOT.  IT IS ALSO VERY DISTRACTING TO BE DRIVING WITH A COMPUTER THAT IS CONSTANTLY REBOOTING.  THE SYSTEM IS REBOOTING WHEN THE CAR IS ON, WHILE DRIVING AND WHILE SITTING STILL. I REACHED OUT TO MAZDA WHO SAID IT IS NOT A RECALL YET BUT IF I PAID FOR THE FIX AND THEY DID CALL A RECALL I WOULD GET REIMBURSED.  A 1500 DOLLAR FIX FOR RADIO IS RIDICULOUS AND A CAR THAT IS ONLY 4 YEARS OLD.  THE COMPUTER MALFUNCTIONED IS MY ONLY GUESS AND THEY SHOULD HAVE TO REPLACE IT SINCE IT IS A SAFETY ISSUE AND MULTIPLE PEOPLE ARE HAVING THE SAME ISSUE.   PLEASE HELP.  I HAVE A SAFETY INSPECTION DUE AT THE END OF THIS MONTH AND IM NOT SURE IT WILL PASS.",
        "vin": "JM1GJ1T5XG1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343827,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOUCHSCREEN DISPLAY HAS SO MANY CRACKS THAT KEEP APPEARING.",
        "vin": "JM1GJ1V50G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343512,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BRAKING TO A STOP AFTER DECELLERATING, DRIVING ORIGINALLY ABOUT 45 MPH. TRAFFIC WAS STOPPED IN FRONT OF ME.  I WAS IN MOTION ON A HIGHWAY, GOING STRAIGHT AHEAD.  MY CAR SLOWED BUT RESISTED STOPPING. I PRESSED ON THE BRAKE PEDAL HARDER UNTIL I CAME TO A COMPLETE STOP. MY  RIGHT FOOT WAS ENTIRELY ON THE BRAKE, AS I ONLY USE MY RIGHT FOOT TO OPERATE THE PEDALS. THE ENGINE WAS REVVING  LIKE IT WAS ACCELLERATING. THE CAR WAS IN DRIVE. NO WARNING LIGHTS CAME ON THE DASH. THE ENGINE  CONTINUED TO REV HIGHER IN INTENSITY. I PUT THE CAR INTO PARK, AND THE ENGINE REVVED MUCH HIGHER. I PUSHED THE  START/STOP BUTTON TO TURN OFF THE CAR. THE WARNING LIGHTS CAME ON THE DASH. I WAS ABLE TO ROLL DOWN THE POWER  WINDOW EVEN THOUGH THE CAR WAS TURNED OFF. I TRIED TO RESTART THE CAR AFTER ABOUT A MINUTE. THE STARTER  ENGAGED, BUT THE CAR DID NOT START. I TRIED TWICE AGAIN AND IT DID THE SAME THING. I TRIED A FOURTH TIME AND IT  REACTED AS IF THE BATTERY WAS ALMOST DEAD, SOME SOUND BUT NO MOVEMENT. I COULDN'T PUT THE CAR IN NEUTRAL  TO HAVE THE ATTENDING POLICE OFFICER PUSH IT OUT OF THE LANE OF TRAFFIC, AND WE NOTICED THE EMERGENCY BRAKE WAS  ENGAGED. I DID NOT ENGAGE THE EMERGENCY BRAKE MYSELF! MY HUSBAND ARRIVED, AND HE AND THE OFFICER WERE  ABLE TO PUT THE CAR IN NEUTRAL, HOWEVER, THEY WERE UNABLE TO DISENGAGE THE EMERGENCY BRAKE. THE CAR HAD TO  BE LOADED ONTO A ROLL-OFF WRECKER TO BE TAKEN TO THE DEALERSHIP.",
        "vin": "JM1GJ1V50G1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341696,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MAZDA MAZDA6. THE CONTACT STATED THAT THE ELECTRONIC PARKING BRAKE FAILED. THE CONTACT STATED THAT HE WAS NOT ABLE TO DISENGAGE THE PARKING BRAKE. THE PARKING BRAKE LIGHT WAS ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER NOR AN INDEPENDENT MECHANIC FOR A DIAGNOSTIC TEST. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": "JM1GJ1U52G1"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/19/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321545,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUSPENSION FEELS LOOSE, LIKE THE STEERING IS NOT IN SYNC WITH THE WHEELS WHEN TURNING LEFT. OCCASIONAL RATTLE AFTER CONSECUTIVE SMALL BUMPS IN THE ROAD AND A SLIGHT VIBRATION AROUND 60 MPH. I HAVE ALL NEW TIRES, A WHEEL ALIGNMENT, AND AN INSPECTION BY TWO SEPERATE MAZDA DEALERS( PUGI MAZDA IN IL, & MAZDA OF JACKSON MS) BOTH SAY THEY SEE NOTHING WRONG.",
        "vin": "JM1GJ1U5XG1"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/20/2020",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11318837,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 MAZDA M6. THE CONTACT STATED THAT WHILE DRIVING ABOUT 20 MPH IN THE SNOW, THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE LOST ALL POWERS AS THE STEERING FAILED. THE VEHICLE SLIDE AND REAR-END THE VEHICLE IN FRONT. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE PASSENGER SIDE DOOR AIR BAG WAS THE ONLY AIR BAG THAT DEPLOYED. THE CONTACT STATED THAT THE VEHICLE FAILED TO RESTART AFTER THE INCIDENT. THE CONTACT ALSO STATED THAT THE PARKING BRAKE WAS ENGAGED AND FAILED TO DISENGAGE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A LOWER BACK AND NECK INJURIES THAT REQUIRED MEDICAL ATTENTION.  THE VEHICLE WAS TOWED TO A TOW YARD WHERE THE VEHICLE WAS DEEMED A TOTAL LOSS HOWEVER, THE CONTACT HAS RETAINED THE VEHICLE. THE CONTACT CALLED CONTINENTAL (4800 OLD SEWARD HIGHWAY, ANCHORAGE, AK 99503) AND WAS TOLD THAT THERE WAS NO RECALL. THE MANUFACTURER WAS CALLED BUT NO ONE ANSWERED THE PHONE. THE FAILURE MILEAGE WAS APPROXIMATELY 54,900.",
        "vin": "JM1GJ1V55G1"
    },
    {
        "components": "STEERING,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11299671,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS IN AN ACCIDENT WHICH RESULTED IN A LOCKUP OF VEHICLE AND SIDE COLLISION WITH BATTERY FAILURE",
        "vin": "JM1GJ1V55G1"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299751,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE FREEWAY IN THE RAIN AND THE WINDSHIELD WIPERS QUIT FUNCTIONING. I PULLED OVER AND CHECKED THE FUSES FINDING BOTH FUSES AFFECTING THE WIPERS WERE IN WORKING ORDER. WHILE PULLED OVER, I ALSO NOTICED MY HEADLIGHTS WERE NO LONGER ON. I CHECKED THE FUSES RELATED TO THE HEADLIGHTS AND THESE WERE ALSO IN WORKING ORDER. AS I WAS NOT IN A GOOD LOCATION TO LEAVE MY CAR FOR ANY PERIOD OF TIME, I DROVE MY CAR A FEW MORE MILES DOWN THE ROAD. DURING THIS TIME, THE WARNING FOR THE \"SMART BREAKING SYSTEM FAILURE\" ALSO CAME ON.     I WAS ABLE TO GET MY VEHICLE INTO THE DEALERSHIP AND THEY HAVE DIAGNOSED THE PROBLEM AS A FAILURE OF THE FRONT BODY CONTROL MODULE. I NOTICED THERE IS AN ACTIVE RECALL ON THE 2016 MAZDA 3 FOR THE VERY SAME ISSUE. I ASKED THE DEALER ABOUT THIS AND THEY SAID MY VEHICLE IS NOT AFFECTED BY THIS RECALL. BASED ON THE SYMPTOMS MY CAR HAS, AND BEING THE SAME YEAR AS CARS AFFECTED, I WOULD STRONGLY DISAGREE.",
        "vin": "JM1GJ1W50G1"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11299774,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG A HIGHWAY (LEFT SIDE OF ROAD) I CRASHED INTO LARGE BOULDERS OF CONCRETE SCATTERED ALONG THE ROAD THAT WAS CAUSED BY A PREVIOUS ACCIDENT. TRAVELING AT 60 MPH MY VEHICLE LAUNCHED OFF THE GROUND SLAMMING BACK DOWN ON ALL FOUR TIRES. MY VEHICLE THEN SPUN OUT OF CONTROL CRASHING TO THE SIDE GUARD RAIL IMPACTING THE SIDE OF THE VEHICLE 2X'S (RIGHT SIDE OF ROAD) RESULTING IN DISABLING DAMAGE TO MY VEHICLE. TO MY SURPRISE THE AIRBAGS DID NOT DEPLOY (PARTICULARLY MY SIDE AIRBAGS). LATER I LEARNED THAT MAZDA (MANUFACTURE) REPORTED A RECALL FOR MY VEHICLE RELATING TO A POTENTIAL MALFUNCTION OF SIDE AIRBAGS. UPON MY DISCOVERY I LEARNED THAT MAZDA HAD LEARNED OF THE DEFECT AROUND AUGUST 2019, BUT HAD NOT ISSUED A RECALL NOTICE ON THEIR WEBSITE UNTIL JANUARY 1ST 2020.  MY ACCIDENT TOOK PLACE DEC 4TH 2019, AND I SHOULD ALSO ADD THAT AS OF YET MAZDA STILL HAS NOT MADE ANY DIRECT ATTEMPTS (EMAIL, MAIL, PHONE) TO NOTIFY ME OF THE POTENTIAL HAZARD.     HAD IT NOT BEEN FOR MY OWN INQUIRIES I STILL MAY HAVE NOT KNOWN THAT THERE WAS A SAFETY ISSUE WITHIN MY VEHICLE ESPECIALLY WHEN I NEEDED IT THE MOST.     I DON'T WANT TO COME OFF AS BEING DRAMATIC BUT THAT ACCIDENT I WAS INVOLVED IN COULD OF COST MY WIFE AND I OUR LIVES. FOR THAT REASON I AM SEEKING TO RETRIEVE THE EVENT DATA RECORDS (EDR) OF MY VEHICLE SO THAT I MAY DETERMINE IF THE AIRBAGS FAILED TO DEPLOY AS NOTED AS A POTENTIAL HAZARD OR IF THE IMPACT AND DAMAGES WHERE SIMPLY NOT SUBSTANTIAL ENOUGH TO CAUSE THE AIRBAGS TO DEPLOY.    I ASKED MY INSURANCE COMPANY IF THEY COULD ASSIST ME IN GATHERING THAT DATA WHICH THEY FIRST CLAIMED TO BE POSSIBLE, BUT SHORTLY AFTER I WAS INFORMED THAT THEY DID NOT HAVE THE SOPHISTICATION TO DO SO, HENCE FORWARDING ME TO THIS WEBSITE.      PLEASE ADVISE ON HOW I MAY RETRIEVE THAT INFORMATION, ANY HELP WOULD BE GREATLY APPRECIATED. THANK YOU.",
        "vin": "JM1GJ1W59G1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299095,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SIGNALS ON THE CAR ARE ALWAYS INCORRECT AND THE WIRING FOR BLUETOOTH AND USB DOES NOT ALWAYS WORK",
        "vin": "JM1GJ1V59G1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279819,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MAZDA 6 MODEL IS EQUIPPED WITH A VIDEO DISPLAY SCREEN MOUNTED ON THE DASHBOARD THAT OPERATES THE RADIO, COMMUNICATION, AND MOST IMPORTANTLY, THE VIEW PROJECTED BY THE REAR VIEW CAMERA. UPON IGNITION, THE SCREEN OPERATES FOR ABOUT 30 SECONDS AND THEN GOES DARK AND SHUTS DOWN. THE REAR VIEW SAFETY FEATURE IS DISABLED THEREBY JEOPARDIZING PUBLIC SAFETY. THE SCREEN SHUTS DOWN WHETHER THE VEHICLE IS MOVING OR STATIONERY, ON THE STREET OR IN THE GARAGE. I NOTIFIED THE MAZDA CUSTOMER EXPERIENCE CENTER, BY LETTER, OF THE PROBLEM, BUT GOT NO ANSWER.",
        "vin": "JM1GJ1U52G1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/23/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271621,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUNK NOISE DRIVING ON CITY STREET, ON DRIVER'S SIDE WHEN WHEELS ARE FULLY TURNED TO THE LEFT AND WHEN CAR IS STATIONARY AND RIGHT BEFORE ACCELERATING. SERVICE ADVISOR FROM THE REPAIR SHOP INFORMED ME NOT TO DRIVE THE CAR BECAUSE IT IS NOT SAFE AND MAY CAUSE AN ACCIDENT. THE MANUFACTURER WARRANTY IS NO LONGER EFFECTIVE AND IT EXPIRED 2018. THE INVOICE TOTAL IS $901.25, PARTS COST IS $83.34 LABOR OF $809.99 + TAX. CALLED MAZDA'S 800 NUMBER AND INFORMED IF MANUFACTURER DEFECT IS MY RECOURSE WITH NO AVAIL.   I AM REACHING OUT TO NHTSB IF OTHER  MAZDA OWNERS HAVE ENCOUNTER THE SAME PROBLEM AND AVOID FUTURE COSTLY EXPENSE FOR SENIOR CITIZENS.  I FEEL THAT SINCE IT IS A MANUFACTURER'S DEFECT, AS ATTESTED TO BY THE SERVICE ADVISOR AND MAZDA HOTLINE REPRESENTATIVE, THE LEAST THEY COULD DO IS COVER THE EXPENSE SINCE OUR CURRENT MILEAGE IS SO LOW (21,589 MILES FOR 4 YEARS).  WE HOPE THAT WE CAN BE ASSISTED WITH THIS DILEMMA AS IT RELATES TO SAFETY AND COST.     INVOICE IS ATTACHED   THANK YOU FOR YOU ASSISTANCE.",
        "vin": "JM1GJ1V57G1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221345,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 28000 MILES ON MY CAR OVER THE PAST 2 AND A HALF YEARS, WHAT STARTED WITH A PERSISTENT LOW TIRE PRESSURE INDICATION THAT NONE OF THE DEALERSHIPS OR TIRE SHOPS RECOGNIZED AS A MAJOR ISSUE (SIMPLY POINTED OUT THAT AS WEATHER CHANGES THE SENSORS MAY DETECT LOW PRESSURE) HAS TURNED INTO THE TIRES SYSTEMATICALLY BEING WORN AND BLOWN OUT BEFORE THEIR LIFE EXPECTANCY.. RINGS ARE FORMING AROUND THE ENTIRE CIRCUMFERENCE OF THE TIRE AND CAUSING A LARGE CIRCULAR RIP THROUGH THE TIRE ON THE OUTER WALL. SO FAR MY FRONT DRIVER TIRE WAS BLOWN OUT FROM A SMALL POTHOLE WHICH UNDERSTANDABLY CAUSED THE TIRE WALL TO COMPLETELY RIP AND NEEDED COMPLETE REPLACEMENT. NOT EVEN 2 WEEKS LATER MY REAR DRIVER TIRE GAVE OUT WHILE IN THE PARKING LOT AND STATIONARY, MY PASSENGER SIDE TIRES ARE SHOWING A SIMILAR RING PATTERN (IT IS VERY FAINT AND DIFFICULT TO CAPTURE ON A PICTURE) THAT LEADS ME TO BELIEVE THERE COULD BE A DEFECT IN THE STOCK TIRES INCLUDED WITH MY CAR. PHOTO OF MOST RECENT TIRE BLOWOUT ATTACHED FOR VISUAL OF THE WEAR PATTERN ON THE TIRE. THIS OCCURED AT APPROX 28000 MILES ON THE CAR WITH STOCK TIRES AND REGULAR MAINTENANCE",
        "vin": "JM1GJ1V55G1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11205955,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "\"DRIVER SEAT ALIGNMENT\" AFTER DRIVING FOR ANY PERIOD OF TIME DRIVERS LEFT LEGS BEGINS TO FEEL DISCOMFORT OR STRESS TO THE OUTSIDE OF LEFT KNEE DUE TO SEAT BEING ANGLED LEFT. PRESSURE FROM LEFT FOOTREST  AND WHEEL WALL FORCES DRIVER TO RETRACT LEG AND PLANT INTO FLOOR CLOSER TO THE SEAT. THIS IS CONSISTENT WITH EVERY TIME I HAVE DRIVEN ALSO IT WAS CONFIRM BY A MAZDA SALES ASSOCIATE.",
        "vin": "JM1GJ1U5XG1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183733,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "1 RECALL FRONT PASSENGER SEAT. SHORT CIRCUIT, MULTIPLE WARNING/INDICATOR LIGHTS",
        "vin": "JM1GJ1V57G1"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180236,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VARIOUS SOFTWARE CONTROL FEATURES TRANSIENTLY STOP WORKING. THE NAVIGATION SYSTEM HAS FAILED TO COME ON SEVERAL TIMES. THE KEY FOB STOPS WORKING AND THEN WORKS AGAIN.THE PROBLEMS ARE ALWAYS TRANSIENT AND THEN START WORKING AGAIN. THE WORST THING THAT HAPPENED WAS THE FRONT SENSOR FAILED TO WORK AND A SMALL POLE WAS HIT AND DID DAMAGE TO THE FRONT FENDER.",
        "vin": "JM1GJ1W5XG1"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161979,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MAZDA 6. IN TEMPERATURES BELOW 45 DEGREES, THE EMERGENCY BRAKE INDICATOR WOULD REMAIN ILLUMINATED AFTER STARTING THE VEHICLE. ALSO, WHILE DRIVING, THE EMERGENCY BRAKE INDICATOR WOULD SOMETIMES ILLUMINATE. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE LOCAL DEALER (MATT CASTRUCCI MAZDA, 3013 MALL PARK DR, DAYTON, OH) AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162009,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MAZDA 6. WHILE DRIVING 55 MPH, THE CRUISE CONTROL ENGAGED AND WOULD NOT TURN OFF. LESTER RAINES MAZDA (5035 MACCORKLE AVE SW, SOUTH CHARLESTON, WV 25309, (304) 768-1251) INFORMED THE CONTACT TO DISCONNECT THE NEGATIVE BATTERY TERMINAL TO RESET THE COMPUTER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 65,000. *DT  CONSUMER STATED WHILE DRIVING AT 55MPH CRUISE CONTROL WAS ENGAGED BUT CRUISE CONTROL MALFUNCTIONED. ONLY WHEN THE BRAKE PEDAL DEPRESSED DID IT CANCEL. *JB",
        "vin": "JM1GJ1V56G1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "04/06/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151808,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN SHOWING RED CHECK ENGINE LIGHT RANDOMLY FOR THE LST 3 MONTHS. IT LASTS 24 - 48 HRS, SOMETIMES AFTER OIL CHANGE. DEALER SAID NOTHING TO WORRY ABOUT, BUT I FINALLY TOOK IT TO AUTOZONE WHO SAID CODE WAS STORED AS MISFIRE ON CYLINDER 4. DEALER IS LOOKING AT IT NOW, BUT ALWAYS DISMISSED IT BEFORE. NOW THAT I KNOW IT HAS TO DUE WITH A CYLINDER - WHY DIDN'T THEY INVESTIGATE FURTHER? OF COURSE MY CAR IS ABOUT 2 MONTHS OUT OF WARRANTY AND 17OO MILES AS OF TODAY.",
        "vin": "JM1GJ1V51G1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/19/2018",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120936,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA CORPORATION NOTIFIED ME OF AIRBAG/SEAT BELT SENSOR DEFECT.I TOOK THE CAR TO SHORELINE MAZDA, AURORA, CO TO REMEDY THE PROBLEM.   THE SHORELINE MAZDA SERVICE DEPARTMENT HAS NOT REMEDIED THE PROBLEM. I'M RETURNING THE AUTOMOBILE FOR THE 5TH TIME. ATTACHED ARE THE WORK ORDERS. THE LAST VISIT ON 06/22/2018,  THE SERVICE DEPARTMENT REPRESENTATIVE, FRAN (XXXX). STATED THE SERVICE DEPARTMENT CONTACTED  MAZDA TECHINCAL SUPPORT REGARDING THE FAULTY SENSOR BLINKING CONTINUOUSLY WHILE IN MOTION. ALSO WHEN THE AUTOMOBILE IS STATIONARY. OR APPEARS WHILE DRIVING ON THE HIGHWAYS. (FRAN) SAID THE TECHNICIANS DIDN'T KNOW WHAT TO DO. IT WAS SUGGESTED BY MAZDA TECHINCAL SUPPORT TO UNPLUG OR DISCONNECT THE FROM THE HARNESS. IT WAS FOUND THAT THE SENSOR HAD NOT BEEN CONNECTED. THE TECHNICIANS DID SO AND THE SENSOR  WARNING WAS NOT FLASHING ON THE DASHBOARD.  AFTER THE LAST VISIT AND 2 1/2 WEEKS LATER. THE SEAT BELT SENSOR CONTINUES TO FLASH AND BLINK.      PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JM1GJ1V58G1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/18/2018",
        "dateOfIncident": "08/03/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120794,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATED UNASSISTED AND THE BRAKES DID NOT STOP IT . MOUNTED A CONCRETE DIVIDER AND SLAMMED INTO ANOTHER CAR. VEHICLE WAS GOING ABOUT 5MPH PULLING OUT OF PARKING SPACE AND TURNING ONTO EXIT DRIVEWAY.",
        "vin": "JM1GJ1U5XG1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "06/04/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063673,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 MAZDA 6 WOULD JUST RANDOMLY ENRAGED E-BRAKE WITHOUT YOU ENGAGING IT AND WOULD NOT RELEASE, PARKING BRAKE AND BRAKE LIGHTS ARE ON. MAZDA SAID CONTROL MODULE WAS MALFUNCTIONING. MAZDA(BAKERSFIELD)REFUSES TO FIX IT AS ERROR CODES WOULDN'T SHOW UP WHEN DIAGNOSING IT. CAR WAS FIRST DIAGNOSED IN FLORIDA WHERE IT ORIGINALLY HAPPENED AND THAT WAS THE FINDING CONTROL MODULE MALFUNCTIONING.",
        "vin": "JM1GJ1V52G1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055928,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE NOW THE ELECTRONIC EMERGENCY BREAK SEEMS TO HAVE DISENGAGED RANDOMLY MINUTES AFTER I WALKED AWAY FROM THE VEHICLE",
        "vin": "JM1GJ1V59G1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/13/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054395,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END CREAK SOUND UNDER 25 MPH OVER. EXACTLY LIKE THE 1 OTHER COMPLAINT I JUST READ... SIMILIAR VIN# 'S TOO. I.E. WHEN TURNING AND GOING STRAIGHT WHILE ENTERING A SLOPED  ENTRY OF DRIVEWAY OR OTHER ENTRY ACCESS SIMILAR. OR GOING OVER A SPEED BUMP SLOWLY. THERE IS A CRICKING SOUND. ALMOST AS IF SOMETHING IS BROKEN OR MISSING IN FRONT END. MY CAR HAS ONLY 15000 MILES ON IT! DEALER HAS 1 MASTER TECH. PARTS TOOK 3 WEEKS TO ARRIVE AFTER THEY TOLD ME 4 BUSINESS DAYS.",
        "vin": "JM1GJ1U59G1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "07/27/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010951,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PRESSING THE START/STOP BUTTON, THE IGNITION DOES NOT TURN OFF ALTHOUGH THE SHIFT LEVER IS IN \"P\" POSITION AND THE \"ENGINE\" SHUTS OFF NORMALLY, THE IGNITION STAYS ON (IN ACCESSORY MODE).",
        "vin": "JM1GJ1W53E1"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004665,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS SERIOUS PROBLEMS. I HAVE APPROACHED MAZDA WITH NUMEROUS SERVICE COMPLAINTS AND THEY REFUSE TO FIX. THE CAR GETS TERRIBLE GAS MILEAGE NOT THE FACTORY STATED 42 MPG WHICH WAS SOLD ON THE MSRP BUT MORE LIKE 22. THE SUSPENSION DRIVES TERRIBLE MAKES NOISES, THE CAR \"CREAKS\" WHEN GOING OVER THINGS AND IS NOT STABLE AT FREEWAY SPEEDS. THE CAR ALSO SWAYS FORM LEFT TO RIGHT ON THE FREEWAY AND IS EXTREMELY SLOW TO STOP. IT IS DANGEROUS AND MAZDA WILL NOT FIX. I EVEN HAVE A VOICEMAIL FORM MAZDA CORPORATE STATING THEN REFUSE TO FIX THESE PROBLEMS. I HAVE HAD TO HIRED A LAWYER TO DECLARE THE CAR A LEMON. MAZDA ALSO REFUSED TO SERVICE THE CAR FOR OIL CHANGES, TIRE ROTATION, ETC. I HAVE ALSO FILED A CLAIM WITH MAZDA CORPORATE ALONG WITH THE NUMEROUS TIMES IN AND OUT OF THE SHOP YET THEY STILL REFUSE AND ARE UNWILLING TO SERVICE/FIX THE SAFETY ISSUES ON MY CAR. ALSO, THE HEATED SEATS, BOTH FRONT AND PASSENGER, HAVE NOT BEEN ABLE TO BE FIXED SINCE THE DAY I PURCHASED THE CAR (I HAVE NOW HAD THE CAR APPROX 14 MONTHS). AS OF TODAY 7/11/2017, THIS PROBLEM THAT HAS BEEN GOING ON SINCE I BOUGHT THE CAR EARLY 2016 HAS NOT BEEN RESOLVED. PLEASE HELP!",
        "vin": "JM1GJ1W53G1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/29/2017",
        "dateOfIncident": "04/16/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992041,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR ON 4/16/2017 AND GOING THROUGH A TOLL BOOTH ON THE PA TURNPIKE THE CAR SUDDENLY PULLED TO ONE SIDE AND THE AIR ALERT WENT OFF. I PULLED OVER IMMEDIATELY AND FOUND THE FRONT LEFT TIRE WAS FLAT. AS I WAS CHANGING THE TIRED I FOUND THAT THE SIDEWALLS ON THE OUTER AND INNER ASPECT HAD COMPLETELY SEPARATED FROM THE TREADS. THE TIRE SIDEWALLS COMPLETELY DISINTEGRATED AROUND THE ENTIRE CIRCUMFERENCE ON BOTH SIDEWALLS. ALMOST LIKE A RETREADED TIRE DOES. THIS IS A COMPLETE TIRE FAILURE AT 9,100 MILES AND DRIVING SLOWLY THROUGH A TOLL BOOTH. IF THIS HAD HAPPENED AT A HIGH RATE OF SPEED I PROBABLY WOULD HAVE LOST TOTAL CONTROL OF MY CAR. SEE PHOTOS ATTACHED.",
        "vin": "JM1GJ1V56G1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991035,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CREAKING OF SUSPENSION SYSTEM. THE CARS MILEAGE IS 7500. IT IS A CREAKING SOUND THAT IS FROM THE FRONT END. I NOTICED IT WHEN TURNING IN AND OUT OF DRIVEWAYS. I CAN REPLICATE IT EVERY DAY AND IT HAS BEEN HAPPENING SINCE I PURCHASED THE CAR.",
        "vin": "JM1GJ1W57G1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "01/11/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983207,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 MAZDA 6 HAD A SUNROOF THAT EXPLODED ON JAN 11, 2017 WHILE DRIVING. IT SOUNDED LIKE A GUNSHOT AND I ALMOST WRECKED. IT EXPLODED UPWARD AND OUT OF THE VEHICLE ALTHOUGH WE HAD A LOT OF GLASS THAT RAINED BACK IN ON US AND THE INSIDE OF HER CAR. THE VEHICLE WAS ONLY 8 MONTHS OLD. MAZDA REPLACED THE SUNROOF OUT OF \"GOOD WILL\" (AS THEY PUT IT)  HER VEHICLE IS NOT THE FIRST VEHICLE TO DO THIS - GOOGLE IT! THEY ARE REFUSING TO REPAIR THE LEATHER SEATS THAT THE GLASS GOT EMBEDDED IN AND RIPPED AND ARE REFUSING TO FIX THE PAINT WHERE THE GLASS FLEW OUT AND TOOK A CHUNK OF PAINT OFF THE ROOF AND THE TRUNK OF THE VEHICLE. WE HAVE BEEN TRYING TO WORK THROUGH THIS WITH THEM SINCE JANUARY. I HAVE BEEN ON THE PHONE WITH CORPORATE MAZDA WHO IN TURN HAVE BEEN TRYING TO GET PASSPORT MAZDA ON THE PHONE FOR 2 WEEKS TO GET THEIR SIDE OF THE STORY. THE HAVE NOT MADE A CONNECTION WITH CORPORATE IN OVER TWO WEEKS. ISN'T THAT LIKE IGNORING YOUR BOSS? BESIDES THE FACT THAT MAZDA WILL NOT STAND BEHIND THEIR PRODUCT AND QUALITY ONE OF MY DAUGHTER FIRST \"ADULT PURCHASES\" HAS NOT TURNED OUT TO BE A DISHEARTENING EXPERIENCE. THEY HAVE NOT HEARD THE LAST FROM US AS WE STAND UP FOR WHAT IS RIGHT! DO NOT PURCHASE A MAZDA AS THEIR CUSTOMER SERVICE IS LESS THEN SATISFACTORY AND WE PURCHASED NOT ONE BUT TWO MAZDA'S ON THE SAME DAY!  --",
        "vin": "JM1GJ1W51G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/20/2017",
        "dateOfIncident": "03/05/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967288,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SMART CITY BREAKS MALFUNCTION. A BREAKING SYSTEM THAT IS ONLY SUPPOSED TO WORK WHEN GOING UNDER 20MPH, APPLIED WHEN I WAS GOING 65-70 DOWN A FREEWAY. CHECK ENGINE LIGHT CAME ON, CAR STARTED APPLYING BREAKS, THEN SLAMMED ON BREAKS. DRIVERS FOOT STILL ON GAS PEDDLE, HAPPENED WITHIN SECONDS.",
        "vin": "JM1GJ1T5XG1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "10/02/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957998,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MAZDA MAZDA6. THE CONTACT STATED THAT THE CRUISE CONTROL WOULD NOT CEASE TO FUNCTION AND WHEN ATTEMPTING TO DISENGAGE IT THE VEHICLE WOULD INCREASE IN SPEED. THE FAILURE OCCURRED WITHOUT WARNING. THE FAILURE OCCURRED SIX TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE CRUISE CONTROL BUTTONS NEEDED TO REPLACED. THE VEHICLE WAS REPAIRED HOWEVER THE FAILURE RECURRED. THE FAILURE MILEAGE WAS APPROXIMATELY 34,000.",
        "vin": "JM1GJ1W57G1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "02/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956039,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, THE WHEEL CYLINDER BECAME TOTALLY DETACHED FROM THE WHEEL FACE CAUSING THE CAR TO JERK UNCONTROLLABLY AND DIFFICULT TO STEER. IMMEDIATELY PULLED TO SHOULDER FOR SAFETY. THERE IS NO DAMAGE TO FACE OF RIM BUT THE WHEEL CYLINDER THAT MOUNTS THE TIRE IS TOTALLY DETACHED FROM THE WHEEL FACE. VEHICLE PURCHASED NEW IN MAY HAS 30000 MILES ON IT.",
        "vin": "JM1GJ1V52G1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2017",
        "dateOfIncident": "01/25/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949692,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SOMETIMES HAS A DELAY BETWEEN GOING FROM REVERSE INTO DRIVE. DURING THE DELAY, THE ENGINE REVS UP AND THEN IT LURCHES FORWARD. THIS SEEMS TO BE HAPPENING MORE FREQUENTLY WITH A LONGER TIME BEFORE THE ENGINE ENGAGES. THIS ALSO OCCURRED AFTER STOPPING AT A STOP SIGN (AND STAYING IN DRIVE THE ENTIRE TIME.)  THE CAR HAS ~12,000 MILES ON IT BUT THIS HAS BEEN HAPPENING SOON AFTER I PURCHASED IT BRAND NEW FROM THE DEALER WITH LESS THAN 10 MILES ON THE ODOMETER.",
        "vin": "JM1GJ1V59G1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "11/17/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928242,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 9000 MILES MY 2016 MAZDA 6 GRAND TOURING WITH TECH PKG. AUTOMATIC IS HAVING TRANSMISSION DELAYS.  WHEN THE CAR STOP AND THE GEAR LEVER MOVED INTO NEUTRAL(N), REVERSE (R), AND PARK (P) THEN BACK TO DRIVE (D).  IT HAS A 4-5 SECONDS DELAY BEFORE THE GEARBOX BEING ENGAGED.  ALSO AT 60+ MPH CRUISING ON FREEWAYS, WHEN STEP DEEPER INTO THE GAS PEDAL TO INCREASE SPEED FOR OVERTAKE THE TRANSMISSION HAS A CHOKE, FELT LIKE THE GEAR WAS FORCED INTO PLACE.  *TR",
        "vin": "JM1GJ1W56G1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/16/2016",
        "dateOfIncident": "12/19/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916379,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WAY THE HEADREST IS POSITIONED, I CONSTANTLY HAVE NECK PAINS WHILE I DRIVE. IF I DRIVE LONGER THAN 1 HOUR, THAN THE PAIN LASTS FOR DAYS.",
        "vin": "JM1GJ1U54G1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2016",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914911,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY AUTOMATIC TRANSMISSION 2016 MAZDA 6 FROM THE DEALER AS A CERTIFIED PRE-OWNED VEHICLE WITH ONLY 1,800 MILES ON IT. I HAD THE VEHICLE FOR ONLY A WEEK WHEN I STARTED TO RUN INTO ISSUE. THE RESULT WAS A NEW TRANSMISSION FOR MY CAR AT ONLY ~2,700 MILES.    THE TRANSMISSION WAS SLIPPING WHICH MADE DRIVING AND ACCELERATION UNSAFE. WHEN I WOULD COME TO A COMPLETE STOP FOR A FEW SECONDS AT AN INTERSECTION, AFTER RELEASING THE BREAK PEDAL, THERE WOULD BE A SLIGHT DELAY BEFORE MY CAR KICKED INTO FIRST GEAR. THE CAR WOULD STALL A BIT AND THEN IT WOULD KICK FORWARD VERY ABRUPTLY. THE ISSUE WOULD ALSO OCCUR WHEN I WOULD SHIFT MY CAR FROM REVERSE TO DRIVE. THE CAR WOULD CONTINUE TO ROLL IN REVERSE A LITTLE BIT AFTER I'VE SHIFTED TO DRIVE, THEN IT WOULD STALL AND KICK FORWARD VERY ABRUPTLY.     I TOOK THE CAR INTO MY LOCAL DEALER TO GET IT CHECKED. I WAS ABLE TO REPRODUCE THE ISSUE FAIRLY CONSISTENTLY SO I WAS ABLE TO SHOW THE SERVICE TECHNICIAN THE PROBLEM. AFTER THE DEALER SPOKE TO MAZDA, THE DEALER INFORMED ME THAT MY CAR NEEDED A NEW TRANSMISSION AT ONLY 2,700 MILES. THE NEW TRANSMISSION WOULD BE COVERED UNDER WARRANTY.",
        "vin": "JM1GJ1V57G1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910195,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 7,000 MILES, I BEGAN NOTICING THAT MY CAR WAS NOT SHIFTING PROPERLY OR SMOOTHLY. INITIALLY, I THOUGHT THAT IT MAY HAVE BEEN SOMETHING THAT I WAS DOING.    UPON SHIFTING THE CAR FROM PARK TO DRIVE/REVERSE, THE CAR WOULD LULL FOR A MOMENT, AND THEN SUDDENLY SHOOT INTO GEAR. AT FIRST, THIS WAS MINOR. AS TIME AS GONE ON, IT HAS BECOME MORE FREQUENT AND MORE INTENSE; IN ONE INCIDENT, THE SHIFT WAS SO INTENSE THAT MY CAR ACTUALLY \"PEELED\" OUT.    AFTER READING ABOUT THE EXPERIENCE FROM OTHERS ON RECALL.GOV, I TOOK MY CAR TO MY DEALERSHIP TO GET EXAMINED & HOPEFULLY FIND SOME TYPE OF SOLUTION. THE SERVICE DEPARTMENT TOLD ME TO \"HAVE SOMEONE STAND OUTSIDE OF MY CAR AND VIDEO RECORD\" THE CAR DOING THIS. I EXPLAINED THAT IT IS RANDOM AND THAT I COULD NOT POSSIBLY HAVE SOMEONE WITH ME AT ALL TIMES TO RECORD THIS. THEIR RESPONSE THEN WAS FOR ME (AS THE DRIVER) TO RECORD THIS ON MY OWN PHONE. I DIDN'T EVEN BEGIN TO ADDRESS THEIR SUGGESTION OR THE SAFETY CONCERN OF THAT.    MY FEAR IS THAT MY CAR IS GOING TO SHIFT OR ACCELERATE SO INTENSELY THAT I HIT SOMETHING, OR WORSE CASE, SOMEONE.",
        "vin": "JM1GJ1W54G1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2016",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908082,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS OVERFLOW FROM TANK DUE TO PUMP AUTO-SHUTOFF NOT ACTIVATING.  FUELING VEHICLE, SET GAS NOZZLE TO AUTOMATIC, WAS NOT HOLDING THE HANDLE OR TRYING TO TOP OFF.  WAS WATCHING THE PUMP CLOSELY BECAUSE OF SIMILAR ISSUE WITH A 2016 MAZDA3 AT A DIFFERENT . BEFORE I COULD STOP THE FILL, GAS OVERFILLED THE TANK AND SPILLED ONTO THE GROUND.",
        "vin": "JM1GJ1T54G1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/21/2016",
        "dateOfIncident": "08/20/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897456,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORWARD TILT OF THE HEADREST FORCES MY HEAD FORWARD IN AN UNSAFE AND UNCOMFORTABLE MANNER NO MATTER WHAT SEAT SETTINGS ARE USED. I HAVE SUSTAINED CHRONIC NECK AND UPPER BACK HEALTH ISSUES SINCE I BEGAN DRIVING MY NEW CAR. THE SEAT AND HEADREST DESIGN FORCE THE DRIVER INTO AN UNNATURAL POSTURE THAT GIVES NO BACK SUPPORT AND BUMPS THE HEAD FORWARD AND DOWNWARD FACING. THE CONSTANT STRAINING TO WHILE DRIVING THIS CAR IS NOT ONLY UNSAFE BUT IT IS CAUSING CHRONIC INJURY. I DO NOT HAVE AN UNUSUAL BODY TYPE, I AM FIT AND OTHERWISE HEALTHY AND THIS AGGRAVATION DOES NOT HAPPEN IN ANY OF MY OTHER (OLDER) VEHICLES.",
        "vin": "JM1GJ1W56G1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883742,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 60 MPH ON THE INTERSTATE, THE SUNROOF SHATTERED LOUDLY, WITH BROKEN GLASS PUSHED UPWARD.  THE SUNROOF WAS OPEN IN THE VENT POSITION.  NO EVIDENCE OF OUTSIDE FORCE, SUCH AS A ROCK, CAUSING THE DAMAGE.  ONLY 600 MILES ON THE NEW CAR.   AFTER DEALER INTIALLY DENIED A WARRANTY CLAIM, IT WAS FIXED UNDER WARRANTY.",
        "vin": "JM1GJ1W54G1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/07/2016",
        "dateOfIncident": "04/30/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863760,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD THE VEHICLE FOR ONE WEEK. HEADLIGHTS ARE UNSAFE. IF ONE IS TO DRAW A LINE FROM 8 TO 4 ON THE CLOCK EVERYTHING ABOVE THAT IS NOT ILLUMINATED. DEATH TRAP. MAZDA DEALER WILL NOT TAKE THE CAR BACK OR REFUND MY MONEY. I'M AFRAID TO DRIVE IT AT NIGHT.",
        "vin": "JM1GJ1V59G1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "04/21/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861340,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS AUTOMATIC TRANSMISSION. WHEN I WOULD RELEASE THE BRAKES AFTER STOPPING AT AN INTERSECTION, THE CAR WOULD NOT IMMEDIATELY GO INTO FIRST GEAR.  IT WOULD SIT AT THE INTERSECTION AND THEN SUDDENLY JERK INTO FIRST GEAR.  I WOULD DRIVE NORMALLY AFTER THAT. DEALER REPORTS I HAVE A DEFECTIVE TRANSMISSION AND THEY ARE REPLACING UNDER WARRANTY.",
        "vin": "JM1GJ1V51G1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854596,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT MY MAZDA 6 NEW ON 10/04/15 WITH 40 MILES. ON 3/26/16 AT 3245 MILES THE TRANSMISSION FAILED, VERY SIMILARLY TO ANOTHER COMPLAINT LISTED ON THIS SITE THAT STATED THAT THERE WERE HUNDREDS IF NOT MORE TRANSMISSIONS FAILURES OF THIS MODEL AT VERY LOW MILES. MY CAR TOOK AT LEAST SIX TO EIGHT SECONDS TO ENTER DRIVE FROM PARK. WHILE DRIVING, THE CAR ABRUPTLY BEGAN SLAMMING INTO MUCH LOWER GEARS THAN NECESSARY  WITH LITTLE OR NO CHANGE IN CHANGE IN THE ACCELERATOR PEDAL. SLIGHTEST OF GRADE CHANGE ON THE ROAD ONLY EXASPERATES THE PROBLEM. I WAS DEVASTATED. CALLED THE MAZDA SERVICE CENTER AND SPOKE TO A SERVICE ADVISOR WHO COULD NOT HAVE MORE MORE APATHETIC. CURTLY HE TELLS ME THAT THE SOONEST THEY WORK ME IN WAS IN 5 DAYS. HE NOTED THAT I SHOULD MAKE MY APPOINTMENT ONLINE, AND BE SURE TO ASK FOR HIM!  YOU HAVE GOT TO BE KIDDING SON! NO WAY! UNFORTUNATELY THE ONLY OTHER SERVICE ADVISOR IN THE PLACE WAS A WOMAN WHO SEEMED TO BE ANNOYED BEING THERE. HER OWN MISTAKES, WHICH WERE MANY, MADE HER ANGRY AND SHE ACTED LIKE IT WAS THE CUSTOMERS FAULT. NOT JUST WITH ME EITHER. I RECEIVED NOTHING ON DAY ONE FOR MY CAR EVEN BEING THERE. NOT THE WORK ORDER I HAD SIGNED. NOTHING.. DAY TWO I SIGN A WORK ORDER FOR MAZDA TO GET THE NEW TRANSMISSION INSTALLED, AGAIN SHE GAVE ME NO COPY. IT REALLY SEEMED TO ANNOY HER WHEN I ASKED TO BOTH WORK ORDER COPIES, AS IF IT WAS SOMETHING COMPLETELY IRRELEVANT. I WISH I HAD FOLLOWED MY GUT AND TAKEN MY CAR OUT OF THERE PRONTO.  THIS WAS TO BE MY LAST NEW CAR AND I NOW WANT NOTHING TO DO WITH MAZDA. I AM A 50 YEAR OLD MAN WHO TREATS HIS CARS GENTLY. NEARLY EVERY MILE ON MY MAZDA 6 WAS HIGHWAY, THE EASIEST BEST MILES FOR A CAR WHEN IT COME TO WEAR AND TEAR. THIS CAR IS UNSAFE, I NEARLY ROLLED BACKWARDS INTO MY NEIGHBORS CAR WHEN I FORGOT ABOUT THAT LONG PAUSE FROM PARK TO DRIVE ONE NIGHT. MAZDA, GET SERIOUS ABOUT THIS BEFORE SOMEONE GETS HURT!",
        "vin": "JM1GJ1U52G1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/26/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851718,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW MAZDA 6 WITH ONLY 6000 MILES TRANSMISSION QUIT ON 3/21/16. THE CARS GEARS WOULDN'T ENGAGE UNTIL THE RPMS WOULD HIT 3000 AND THEN THE CAR WOULD LURCH FORWARD. THE DEALER HAS ORDERED A NEW TRANSMISSION. THIS SEEMS TO BE A COMMON ISSUE WITH MAZDA 6 AND MAZDA CX-5. A RECALL NEEDS TO BE ISSUED. THIS IS A MAJOR SAFETY ISSUE. SOMEONE COULD HAVE REAR ENDED ME OR I COULD HAVE CAUSED AN ACCIDENT. THE DEALER SAID THIS IS THE FIRST THEY HAVE HEARD OF THIS BUT THERE HAVE BEEN 100S OF REPORTS ABOUT THIS. MAZDA NEEDS TO ISSUE A STATEMENT AND RECALL BEFORE SOMEONE GETS HURT.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823940,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MAZDA 6. WHILE DRIVING 25 MPH, THE BRAKES FAILED WITHOUT WARNING. THE CONTACT WAS ABLE TO REGAIN BRAKE CONTROL WITHIN A FEW BLOCKS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 1,200.....UPDATED 07/05/16 *BF  THE CONSUMER STATED THE DEALER INSTALLED A DATA TRACKING SYSTEM ON THE VEHICLE. THE CONSUMER DROVE THE VEHICLE FOR A MONTH WITH THE DEVICE AND THERE WERE NO FURTHER INCIDENTS. UPDATED 07/21/16.*JB",
        "vin": "JM1GJ1U55G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2016",
        "dateOfIncident": "12/20/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822594,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MAZDA 6. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE EVENTUALLY RESTARTED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP AND BRAKE LINES WERE FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE PERSISTED AFTER THE ENGINE SYSTEM MALFUNCTION WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN BACK TO THE DEALER, BUT THE FAILURE WAS UNABLE TO BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 7,000.",
        "vin": "JM1GJ1W5XG1"
    },
    {
        "components": "STRUCTURE,WHEELS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "11/14/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10811562,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 MAZDA 6 GT WITH STOCK 19\" DUNLOP TIRES. I BOUGHT THE CAR WITH AROUND 80 MILES & AT THE TIME OF THE INCIDENT WAS AROUND 6800 MILES. I WAS TRAVELING TO WORK GOING AROUND 72 MPH & THE LEFT REAR TIRE BLEWOUT CAUSING AN ACCIDENT ON THE INTERSTATE. TIRES SHOULD NOT BLOWOUT THAT QUICKLY WITH PROPER CARE OF THE VEHICLE. THE TIRE TREAD WORE TOO FAST.",
        "vin": "JM1GJ1W5XG1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/08/2015",
        "dateOfIncident": "12/07/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809030,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF IN MY CAR EXPLODED AND PARTIALLY SHATTERED WHILE PARKED IN MY WORK'S PARKING LOT.  GLASS WAS ALL OVER THE EXTERIOR AND INTERIOR OF THE CAR.  WHAT GLASS WAS LEFT HAD CRACKED COMPLETELY AND WAS UNSTABLE.  I WAS ABLE TO GET THE CAR TO MY LOCAL MAZDA DEALER AND THEY ARE REPLACING IT UNDER WARRANTY.",
        "vin": "JM1GJ1T58G1"
    },
    {
        "components": "STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "09/09/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788612,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA HAS CRAMPED VENT DUCT, SPEAKER, AC DUCT AND FRONT DISPLAY ON TO OF THE DASHBOARD AT THE DRIVER SIDE. REFLECTION FROM ALL THESE MAKE THE DRIVING VERY DIFFICULT. I HAVE TALK TO THE MAZDA CUSTOMER SERVICE AND MY DEALER. THEY ARE NOT INTERESTED IN LISTENING TO MY COMPLAINT. THERE MESSAGE IS THEY CAN NOT DO ANYTHING ABOUT IT. I HAVE BOUGHT THE CAR AND ITS DONE. ITS A SAFETY HAZARD AND ACCIDENT IS BOUND TO HAPPEN. WE HAVE TO TAKE ACTION BEFORE SOMETHING HAPPENS",
        "vin": "JM1GJ1W59G1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/21/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785455,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TO PARK THE CAR IN A PARKING SPOT IN A MALL. IT WAS CRAWLING SPEED AND ALMOST ABOUT TO STOP. THEN THE CAR SUDDENLY SURGED FORWARD AND WENT OVER THE CURB ON TO THE OTHER SIDE. THANKFULLY THERE WAS NO OTHER VEHICLE OR PERSON ON THE OTHER SIDE. I WAS HOLDING TIGHT THE STEERING WHEEL. MY HUSBAND PULLED THE ELECTRONIC PARKING BREAK BUTTON AND THE CAR FINALLY CAME TO A STOP. TIRES WERE BURST ON RUNNING OVER AND THERE WAS DAMAGE TO FRONT LEFT SIDE OF CAR. I BELIEVE THIS COULD BE AN ISSUE OF UNINTENDED ACCELERATION.",
        "vin": "JM1GJ1V59G1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/06/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780425,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD IS TOO THIN, AND BREAKS VERY EASILY.  A SMALL (LESS THAN A QUARTER INCH) STONE HIT MY WINDSHIELD ON THE PASSENGER SIDE ABOUT 6 INCHES FROM THE BOTTOM, CRACKING IT WHILE I WAS FOLLOWING ANOTHER VEHICLE AT 60 MPH AND ABOUT 3 TO 4 SECONDS APART.",
        "vin": "JM1GJ1T52G1"
    }
]