[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/23/2021",
        "dateOfIncident": "11/23/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444849,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mazda CX-5. The contact stated while driving 35 MPH, the \"go to the nearest safe location\" warning message was displayed. The contact was able to park the vehicle on the side of the road. The vehicle was not drivable. The contact towed the vehicle to an independent mechanic and was informed that an unknown belt and unknown pulley needed to be replaced. The vehicle was repaired. The contact stated two days later she experience the failure and heard an abnormal noise. The contact took the vehicle back to the independent mechanic but was unable to duplicate the failure. The contact took the vehicle to a second independent mechanic and was informed that a loosened wire needed to be tightened and the rotor needed to be turned. The vehicle was repaired but continued to experience failure. The contact stated that on another occasion while driving 70 MPH, she heard a loud abnormal noise. The contact stated no warning light was illuminated. The contact was able to park the vehicle on the side of the road. The vehicle was not drivable. The contact towed the vehicle to a second independent mechanic and was informed that the center driveshaft needed to be replaced. The vehicle was not repaired. The contact called the local dealer and made them aware of the failure. The manufacturer had been informed of the failure. The failure mileage was approximately 124,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "08/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11018854,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA5",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY WHILE FILLING SUV WITH GAS THE CAR WAS RUNNING AND IN PARK. I HAD PROCESSED MY DEBIT CARD, CHOSE GAS AND WAS IN THE FILLING PROCESS WHEN THE CAR ROLLED AWAY- SPILLING GAS AS NOZZLE WAS IN CAR. I RAN AFTER THE VEHICLE AND FELL TRYING TO CATCH IT. IT HIT A CURB, BOUNCED BACK AND CONTINUED ACCELERATING FORWARD. SOMEHOW I MANAGED IN EXTREME PANIC MODE TO CATCH UP WITH THE CAR- GET THE DOOR OPEN AND GET THE CAR BACK INTO PARK MODE. I WAS ALONE. THE WRITER KNOB WAS IN PARK OR I COULD NEVER HAVE GOTTEN THAT FAR WITH THE DEBIT- THE GAS CAPTURE  AND THE NOZZLE.I AM SO SORE FROM THE FALL AND CHASE. OTHERS SAW WHAT HAPPENED AND CAME TO MY AID. I HAVE NOT GONE TO A DOCTOR. GOT HOME DRENCHED IN GASOLINE AS CAR TOOK OFF WHILE PUMPING AND ICED MYSELF EVERYWHERE. MY BACK IS KILLING ME AND AND MY ARMS FROM CATCHING A MOVING VEHICLE WHILE TRYING TO OPEN THE DRIVERS SIDE DOOR. SOMEONE IN FRONT OF THIS CAR WOULD HAVE BEEN MOWED DOWN OR A CAR IN FRONT WOULD HAVE BEEN HIT. NOTHING LIKE THIS HAS EVER HAPPENED TO ME BEFORE. SO DISTURBED.  CAR HAS LESS THAN 5000 MILES ON IT AND I WILL SELL IT TO CARMAX NEXT WEEK. WHAT HAPPENED TO MAKE A CAR IN PARK GETTING FUEL JUST TAKE OFF IS BEYOND COMPREHENSION. THERE WAS NO HILL AS I AM IN FLAT FL. EVERY PART OF ME IS IN PAIN TODAY. CAR WAS STATIONARY BEING FILLED WITH GAS WHEN IT TORE AWAY FROM THE GAS PUMP AND PROCEEDED STRAIGHT- IT ACCELERATED. IT WAS IN PARK.",
        "vin": "JM3KE2CY0G0"
    }
]