[
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298069,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 370 Z AT THE LOCAL DEALERSHIP AND I AM A LOYAL NISSAN CUSTOMER.  THIS IS MY SECOND Z AND MY FAMILY OF 9 CARS IS A LARGE BASE FOR YOUR VEHICLES. MY DAUGHTER-IN-LAW PURCHASED A NEW NISSAN AND WE WILL BE SHOPPING FOR MY WIFE'S NEW CAR IN JUNE WHEN SHE RETIRES. MY AIR BAG WARNING LIGHT HAS BEEN FLASHING FOR A WEEK SO I BROUGHT IT TO THE LOCAL DEALER TODAY.  MY VEHICLE HAS 38,000 MILES. I WAS TOLD THAT SOMETHING UNDER THE PASSENGER SEAT HAS TO BE REPLACED TO CORRECT THE PROBLEM.  THE COST: OVER $3000.  I CAN'T AFFORD TO PAY THIS.  I ASKED THE TECH IF THE AIR BAGS WERE FUNCTIONING AND HE ANSWERED NO SO MY WIFE AND I HAVE NO AIRBAG PROTECTION.  I ASK IF THIS FALLS UNDER THE AIRBAG PROBLEMS THAT HAVE BEEN IN THE NEWS FOR YEARS?  IS MY WIFE AND I IN DANGER?   PLEASE REVIEW THE AIRBAG ISSUE AND DIRECT ME TO MY NEXT OPTION.  I FEAR A LIABILITY ISSUE.  THANK YOU",
        "vin": "JN1AZ4EH1GM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/08/2019",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287807,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "370Z",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I BEGAN TO START MY VEHICLE ONE DAY, THE CLUTCH PEDAL WENT STRAIGHT TO THE GROUND BECAUSE IT HAD NO PRESSURE ON IT. I FOUND THAT THE CLUTCH FLUID WAS COMPLETELY EMPTY AND REFILLED IT. AFTER IT REBUILT PRESSURE, IT WAS OPERABLE AGAIN FOR SEVERAL MONTHS UNTIL IT COMPLETELY LOST PRESSURE AGAIN WHILE DRIVING, SO I HAD TO PULL OVER. THE TRANSMISSION FLUID HAD COMPLETELY EMPTIED AGAIN. AFTER LOTS OF RESEARCH ONLINE, I FOUND THAT THERE IS A PLAGUING PROBLEM WITH THE CLUTCH SLAVE CYLINDER. (I AM MECHANICALLY INCLINED AND CAPABLE OF AUTO REPAIRS). I ORDERED THE CLUTCH SLAVE CYLINDER ONLINE AND REPLACED IT MYSELF FOR A PERMANENT FIX WITH AN OEM CLUTCH SLAVE CYLINDER. THERE'S NO TELLING HOW LONG THIS ONE WILL LAST BECAUSE NISSAN MAKES THESE PARTS OUT OF A VERY CHEAP PLASTIC THAT IS SUBJECT TO FAIL AT ANY TIME. THE CLUTCH SLAVE CYLINDER COST ME $188 PLUS THE COSTS OF RENTING A GARAGE BAY, PAYMENT FOR A FRIEND'S ASSISTANCE, AND OTHER MISCELLANEOUS ITEMS, AS WELL AS TIME OFF OF WORK. THE SAFETY MATTER BEHIND THIS GREATLY CONCERNS ME AS I PURCHASED MY 370Z BRAND NEW IN OCTOBER 2015 AND TAKE GREAT CARE OF IT. THE VEHICLE HAD 39K MILES AT THE TIME OF THE CLUTCH SLAVE CYLINDER FAILURE. HOW IS IT THAT NISSAN CAN CONTINUE TO MAKE SUCH A CHEAP, HIGH-FAILURE PART THAT GREATLY ENDANGERS SAFETY AND NOT UPGRADE THE PART AND FIX THE HUNDREDS OR THOUSANDS THAT HAVE FAILED? THE PROBLEMS ASSOCIATED WITH THE CLUTCH SLAVE CYLINDER CAN BE FOUND ALL OVER THE INTERNET AND AFTER-MARKET COMPANIES HAVE TAKEN IT INTO THEIR OWN HANDS TO PRODUCE THEIR OWN CLUTCH SLAVE CYLINDER AND MASTER CYLINDER TO ALLEVIATE THE ISSUES CAUSED BY NISSAN. THE VEHICLE WAS STATIONARY WHEN THE FIRST PROBLEM OCCURRED, AND IN MOTION DURING THE SECOND FAILURE. THE AVERAGE MECHANIC'S QUOTED RATE TO FIX THIS ISSUE RANGED FROM $1000 TO $1375.",
        "vin": "JN1AZ4EH1GM"
    }
]