[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432812,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's daughter owns a 2016 Mini Cooper S Countryman. The contact stated that his daughter was informed by an independent mechanic that the vehicle could be started without the ignition key. The contact stated that his daughter tested the vehicle while the keys remained in the residence with him. The contact stated that his daughter was able to start and drive the vehicle without the ignition key. The dealer was made aware of the failure and advised the contact's daughter that she would be responsible for the cost of the diagnostic test and repair. The manufacturer was not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 60,000.",
        "vin": "WMWZC5C55GW"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431116,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I suddenly have a warning appear on my start menu including warning lights. Upon starting, The message states “ RESTRAINT SYSTEM MALFUNCTION! Fault in passenger-restraint system affecting airbag, belt tensioner or belt-force limiter. Continue to wear seatbelt. Have system checked by nearest Mini Center” I bought this car used less than a year ago, but my extended warranty does not cover electrical or restraint systems.  I called BMW customer service and they said they could not help me.  As it stands, my airbag will not deploy on the passenger side if I am in a crash.",
        "vin": "Wmwzb3c59gw"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398641,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO GAS UP MY 2016  MINI COOPER COUNTRYMAN ALL4 S, AFTER GASSING I STARTED THE CAR AND STARTED PULLING AWAY FROM GAS PUMP STATION  WHEN SUDDENLY I FELT THE STEERING WHEEL WAS HARD AND HEAVY TO STEER THEN THERE'S WARNING LIGHT ON DASHBOARD SAYING STEERING WHEEL ASSISTANCE MALFUNCTION. I PULLED OVER TO NEXT PARKING SPOT AND TRIED TURNING ENGINE OFF AND ON AND STEERING WHEEL STILL FEELS HARD AND HEAVY TO TURN LEFT OR RIGHT. MY DAD EVENTUALLY DROVE THE CAR SLOWLY TO CAR SHOP NEARBY BUT CAR SHOP SAID CAR NEEDS TO BE EVALUATED BY DEALERSHIP SO HE DROVE IT TO DEALERSHIP FOR EVALUATION. MY DAD STATES CAR DRIVABLE BUT STEERING IS HARD",
        "vin": "WMWZC5C51GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2021",
        "dateOfIncident": "02/08/2021",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398268,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 8, 2021 9:00AM DROVE MINI APPROXIMATELY 24 MILES, RETURNED HOME. PARKED CAR, TURNED OFF ENGINE, WENT INTO HOUSE AND LESS THAN 3 MINUTES LATER, NEIGHBOR SAYS MY ENGINE IS SMOKING FROM UNDER HOOD.  WITHIN SECONDS IT WENT FROM HEAVY, WHITE SMOKE TO FIRE COMING FROM UNDER HOOD AND ENGULFED FRONT OF VEHICLE, BREAKING WINDSHIELD, MELTING TIRES.  THERE WERE NO WARNINGS THAT CAME ON WHILE DRIVING VEHICLE, NO SMELLS, NOTHING TO WARN OF IMPENDING FIRE.  LUCKILY, THE VEHICLE WAS PARKED OUTSIDE IN A PARKING SPACE IN FRONT OF HOME RATHER THAN IN COVERED GARAGE. I KEPT A HOSE GOING ON HOOD AND SURROUNDING BUSHES TO KEEP FIRE FROM ESCALATING TO BUILDINGS OR HILLSIDE UNTIL FIRE DEPARTMENT ARRIVED   THE MINI WAS KEPT IN GOOD WORKING ORDER, ALL MAINTENANCE DONE ON TIME.  SO LUCKY WE WERE NOT IN THE VEHICLE WHEN IT OCCURRED. THE CAUSE OF THE FIRE IS CONSIDERED UNKNOWN.",
        "vin": "WMWZC3C54GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396364,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER S",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME THURSDAY NIGHT I RECEIVED LEFT TAIL LIGHT MALFUNCTION WARING ON MY DASH PANEL WITH THE TURN SIGNAL BLINKING EXTREMELY FAST. AFTER ARRIVING HOME I CHECKED THE LIGHT AND FOUND THAT THE TAIL LIGHT INOPERATIVE AND THE TURN SIGNALS WERE EXTREMELY DIM. THE NEXT MORNING I CALLED TUCSON MINI AND TOLD THEM THE PROBLEM. THE SA STATED TO BRING THE CAR IN AND THEY WOULD CHECK OUT THE PROBLEM. UPON INSPECTION THEY FOUND THAT THE L/H TAIL LIGHT GROUND CONNECTOR AND THE BULB CONNECTOR MELTED. I ASK THE SA WHAT WOULD CAUSE THIS PROBLEM AND SHE COULD NOT ANSWER THIS PROBLEM. BUT SHE DID MAKE A COMMENT THAT SHE HAD SEEN HUNDREDS OF THESE PROBLEMS. SOME WHICH CAUSED ENOUGH DAMAGE THAT REQUIRED THE WHOLE TAIL LIGHT TO BE REPLACED. SHE ALSO STATED THAT I WAS LUCK THAT THE DAMAGE TO MY CAR LIMITED TO ONLY THE GROUND CONNECTOR AND THE LIGHT BULB HOLDER. I DID SOME RESEARCH ON THE INTERNET AND FOUND SEVERAL INSTANCES WHERE THE SAME PROBLEM HAD OCCURRED. IN ONE CASE THE PERSON HAD TO REPLACE BOTH TAIL LIGHTS. I BELIEVE THIS IS CONSIDERED A SAFETY HAZARD AND COULD POSSIBLY CAUSE A FIRE.",
        "vin": "WMWXU3C50G2"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/29/2020",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322865,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER S",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED 2016 MINI COOPER S. CONTACT STATED THAT WHILE HIS WIFE WAS DRIVING AT 40 MPH, WITHOUT WARNING AN SMOKE APPEARED ON THE FRONT PASSENGER SIDE UNDER THE HOOD. THE CONTACT STATED HIS WIFE PULLED TO THE SIDE OF THE ROAD AND EXITED THE VEHICLE BEFORE THE WHOLE VEHICLE WAS ENGULFED IN FLAMES. THE FIRE DEPARTMENT EXTINGUISHED THE FLAMES AND A FIRE DEPARTMENT REPORT WAS FILED. THE VEHICLE WAS TOWED TO A SALVAGE LOT AND DEEMED A TOTALED LOST. THE MANUFACTURER WAS CONTACTED AND SENT A FIELD INSPECTOR WHOM COULD NOT DETERMINE THE CAUSE OF THE FAILURE.  THE DEALER MOTOR CITY MINI (29929 TELEGRAPH RD. SOUTHFIELD, MI 48034) WAS CONTACTED AND INFORMED THE CONTACT THAT FIRE WAS NOT COVERED UNDER THE WARRANTY. THE DEALER DID NOT INSPECT THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMANT 41,000.",
        "vin": "WMWZC5C55GW"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245046,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER S",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MINI COOPER S. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED ON A HILL OF A DRIVEWAY, FIFTEEN MINUTES LATER THE VEHICLE SHIFTED OUT OF PARK AND ROLLED AWAY. AS A RESULT, THE VEHICLE CRASHED THROUGH THE CONTACT'S GARAGE DOOR. THERE WAS NO POLICE REPORT FILED AND NO INJURIES REPORTED. THE VEHICLE WAS PARKED WITH THE EMERGENCY BRAKE APPLIED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 18,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182358,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER S",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MINI COOPER S. WHILE DRIVING 35 MPH, THE CHECK ENGINE AND OIL WARNING INDICATORS ILLUMINATED. ALSO, THE INSTRUMENT PANEL ALERTED THE CONTACT TO SHUT OFF THE ENGINE. THE CONTACT STATED THAT THE OIL DIPSTICK SHOWED THAT THERE WAS NO OIL IN THE ENGINE. THE VEHICLE WAS TOWED TO MINI OF FT. MYERS (LOCATED AT 13880 S TAMIAMI TRAIL, FORT MYERS, FL 33908, (239) 205-7816) WHERE IT WAS DETERMINED THAT THE OIL CONSUMPTION WAS NORMAL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 43,000.",
        "vin": "WMWZC3C59GW"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156742,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOV 19, 2018 AT 6:00 PM I WAS DRIVING ON 6 LANE ROADWAY APPROXIMATELY 45 MPH WHEN FRONT DRIVER AIRBAG AND 2 SIDE AIRBAGS (FRONT AND REAR) DEPLOYED FOR NO APPARENT REASON.  THE CAR CAME TO AN ABRUPT HALT IN THE INTERSECTION.  STUNNED I THOUGHT I HAD HIT SOMEONE. I GOT OUT OF THE CAR BECAUSE THE CAR WAS FILLED WITH SMOKE AND I THOUGHT THE CAR WAS GOING TO CATCH FIRE. THE HORN WAS BLARING NONSTOP. I PUT THE CAR IN PARK, RELEASED MY SEAT BELT.  UPON LEAVING THE CAR AN OFF DUTY POLICE OFFICE CAME TO MY ASSISTANCE AND STATED 'MAM, ARE YOU OK? DID SOMEBODY HIT YOU?' I STATED ' I THINK I HIT SOMETHING. HE REPLIED  'YOU DIDN'T HIT ANYTHING AND NOBODY HIT YOU.  I WITNESSED THE WHOLE INCIDENT.' WE CALLED A TOW TRUCK AND THE CAR WAS TRANSPORTED TO OUR MECHANICS SHOP.  LATER THE NEXT DAY WE HAD IT TOWED TO A BMW BODY SHOP.  BMW NORTH AMERICA SENT AN ENGINEER TO THE BODY SHOP TO INVESTIGATE THE CAUSE OF THE DEPLOYMENT OF THE AIRBAGS.  WE ARE WAITING FOR THE REPORT FROM BMW.",
        "vin": "WMWZC3C54GW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "03/29/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129198,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR WAS PARKED FOR APPROX. 10 MINUTES. THE CAR WAS OFF AND THE KEY WAS WITH MY WIFE. NO ONE WAS IN THE CAR, NOR WAS IT IN OPERATION ON ANY LEVEL. NO FLAMMABLE ITEMS WERE WITHIN THE CAR AND THE CAR WAS NOT PARKED ON ANYTHING FLAMMABLE. MY WIFE ALSO DOES NOT SMOKE. THE CAR CAUGHT ON FIRE NEAR THE FRONT OF THE ENGINE COMPARTMENT. THE FIRE DEPARTMENT WAS CALLED AND THEY WERE ABLE TO PUT OUT THE FIRE. THE CAR WAS A TOTAL LOSS. THE POLICE AND FIRE DEPARTMENT INVESTIGATED THE CAUSE OF THE FIRE AND IT WAS DETERMINED TO BE INCONCLUSIVE. FROM WHAT I UNDERSTAND, THE FIRE WAS SO INTENSE THAT IT WOULD BE INCREDIBLY DIFFICULT TO DETERMINE A CAUSE OF THE FIRE. BMW AND TWO OTHER INSURANCE COMPANIES THEN PERFORMED AN EXTENSIVE REVIEW AND ALSO DETERMINED THAT THE FIRE'S CAUSE WAS INCONCLUSIVE.     FROM MY UNDERSTANDING, OUR MODEL HAD A TURBO CHARGER WITH AN AUXILIARY WATER PUMP. THESE PUMPS HAVE BEEN KNOWN TO HAVE A TECHNICAL PROBLEM IN WHICH THEY DON'T STOP RUNNING. OVER THE COURSE OF TIME, THE PUMP ITSELF CAN OVERHEAT AND IN OUR CASE, IGNITE OIL AND/OR FUEL WITHIN THE ENGINE COMPARTMENT. MOST PEOPLE ARE ABLE TO SEE THE FIRE START AND EXTINGUISH IT QUICKLY BUT IN OUR CASE, WE WERE DID NOT SEE THE FIRE START.     IN CONCLUSION, OUR CAR CAUGHT ON FIRE WHILE NOT IN MOTION OR OPERATION. NO ONE WAS IN OR NEAR THE CAR. THE KEY WAS ALSO NOT IN OR NEAR THE CAR. IT CAUGHT ON FIRE APPROX. 10 MINUTES AFTER BEING PARKED IN NORMAL CONDITIONS. NO WARNING LIGHTS OR CHECK ENGINE LIGHTS WERE PRESENT. NO MAINTENANCE HAD BEEN MISSED. IT HAD LESS THAN 30K MILES ON IT AND THE CAR ITSELF WAS ONLY ABOUT TWO YEARS OLD.     VIDEOS CAN BE PROVIDED UPON REQUEST.",
        "vin": "WMWZC5C57GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111743,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME, ON HIGHWAY, AT HIGHWAY SPEEDS, I HAD THE REAR SUNROOF EXPLODE.  HEARD A SINGLE CRACK, THEN ~30 SECONDS LATER, SUNROOF EXPLODED. LARGER PIECES OF GLASS CAUGHT BY SUN NET, HOWEVER, FINE PARTICLES OF GLASS NOW COVER REAR SEAT.  NO KNOWN PRIOR DAMAGE.",
        "vin": "WMWZC5C5XGW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "03/29/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102958,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 29,2018 MY DAUGHTER PARKED HER 2016 MINI COUNTRYMAN IN MY DRIVEWAY AND CAME IN TO VISIT. 10 MINUTES LATER MY WIFE WENT OUTSIDE AND SAW THE MINI ENGINE COMPARTMENT ON THE DRIVERS SIDE ON FIRE. BY THE TIME THE FIRE DEPT. ARRIVED, THE MINI AND MY 2 CARS WERE ON FIRE. ALL 3 WERE TOTALED, MY DRIVEWAY WAS RUINED AND THE SIDING ON MY GARAGE WAS DAMAGED BY THE HEAT OF THE FIRE.. I REMEMBER MINI RECALLING THEIR VEHICLES WITH TURBOS IN 2012. THE RECALL STARTED BECAUSE MINIS WITH TURBOS WERE STARTING ON FIRE AFTER THE CAR WAS TURNED OFF AND PARKED.THE SYSTEM TO COOL THE TURBOS WASN'T WORKING AND THE TURBOS OVERHEATED. THE NAPERVILLE FIRE DEPT REPORT SAID THAT IT APPEARED THAT THE FIRE STARTED IN THE ENGINE COMPARTMENT OF THE MINI BUT THAT THEY COULD NOT TELL HOW IT STARTED. THE ENGINE COMPARTMENT WAS TOTALLY BURNED TO ASHES. OUR STORY FITS THE SAME PATTERN OF THE STORIES I READ CONCERNING THE RECALL OF 2012.I WANT TO SOUND AN ALARM BECAUSE PEOPLE CAN BE INJURED OR KILLED BECAUSE OF THIS PROBLEM. IT MAY BE THAT THE TURBO RECALL ISSUE WASN'T FIXED.",
        "vin": "WMWZC5C57GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "03/29/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101782,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 MINI COUNTRYMAN. THE CONTACT WAS ALERTED BY HIS WIFE THAT THE VEHICLE WAS ENGULFED IN FLAMES WHILE PARKED. THE FAILURE OCCURRED WITHOUT WARNING. THE FIRE DEPARTMENT WAS CONTACTED AND EXTINGUISHED THE FLAMES. THE VEHICLE WAS TOWED TO THE INSURANCE COMPANY'S LOT WHERE IT WAS DEEMED DESTROYED. THERE WERE NO INJURIES. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000. THE VIN WAS NOT PROVIDED. *TT     THE CONSUMER STATED BMW PAID THE DEDUCTIBLE FOR HIS DAUGHTER'S VEHICLE BUT NOT THE OTHER CAR OR HOUSE. *    FD REPORT CONCLUSION: UNDERTERMINED- DUE TO THE SEVERITY OF DAMAGE TO THE VEHICLE INVESTIGATORS WERE UNABLE TO DETERMINE THE EXACT CAUSE OF THE FIRE. THE PROBABLITY EXISTS THAT DUE TO THE BEADED BATTERY CABLE FOUND THAT A SHORT ENSURED THUS CAUSING THE FIRE. THERE IS ALSO A PROBABILITY THAT A MECHANICAL MALFUNCTION/ FAILURE ENSUED, BUT INVESTIGATORS WERE NOT ABLE TO DETERMINE IF THIS WAS A CAUSE, DUE TO THE OWNER STATEMENTS RECORDED IN NYPD INTERVIEWS THAT SHE DID NOT NOTICE ANYTHING WHILE DRIVING THE VEHICLE. UPDATED 9/25/18*JP",
        "vin": "WMWMF33599T"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/15/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085110,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COUNTRYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON A CITY STREET GOING APPROXIMATELY 15 MPH WHEN A PICKUP TRUCK IN THE LANE TO MY RIGHT TRIED TO TURN INTO A DRIVEWAY I WAS APPROACHING TO MY LEFT- HIS CAR HIT MINE AND MY CAR ROLLED OVER ONTO THE ROOF AND THE AIRBAGS DIDN'T DEPLOY.",
        "vin": "WMWZB3C50GW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "10/07/2016",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985774,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER S",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS MINI COOPER S ON MARCH 16, 2016 AND IT HAD 47,282 MILES ON IT. I ALSO BOUGHT A LIMITED 90 DAY WARRANTY OFFERED BY BUDDY'S AUTO SALES OF SPRINGFIELD, MO. I TRAILERED THE CAR TO PHOENIX WHERE MY SON WAS TO ATTEND A MOTORCYCLE MECHANIC SCHOOL IN OCTOBER. ON OCTOBER 07, 2016 WE UNLOADED IT FROM THE TRAILER AND PARKED IT AT A HOTEL. THE NEXT MORNING MY SON (A CERTIFIED MECHANIC) WENT OUTSIDE TO CHECK ON THE CAR AND THE BRAKE LIGHT WAS ON. ASSUMING SOMEONE WAS IN THE CAR, HE RAN TO IT AND FOUND THAT IT WAS FULL OF SMOKE AND SMELLED OF MELTING WIRES/METAL. HE GOT A PAIR OF PLIERS FROM THE HOTEL AND UNHOOKED THE BATTERY BEFORE THE CAR COULD BURN ITSELF TO THE GROUND. AS SOON AS WE COULD GET A DEALERSHIP ON THE PHONE, WE HAD IT TOWED THERE. THEY INFORMED ME THAT THERE WAS A LARGE RECALL ON BMW POWER STEERING PUMPS AND THEY LOOKED IT UP TO SEE IF MINE WOULD BE COVERED. IT WASN'T. IT COST $3,823.22 TO GET THE CAR BACK AND THEY HAD THE VEHICLE UNTIL OCTOBER 14, 2016, CAUSING ME TO MISS MY FLIGHT HOME. IF THIS IS A WIDE-SPREAD PROBLEM, WHY WASN'T MY MINI COVERED?    AFTER HAVING THE POWER STEERING PUMP REPLACED ON MY MINI COOPER S AND FINALLY RECEIVING THE CAR BACK AFTER A WEEK, I DROVE IT FROM TEMPE TO PHOENIX WHERE I WAS STAYING AND HEARD A LOUD POP NOISE AS SOON AS I GOT IT HOME. THERE WAS SMOKE COMING OUT FROM UNDER THE HOOD AND THE CAR WOULDN'T STEER. I CALLED THE DEALERSHIP WHERE I HAD JUST HAD IT REPAIRED AND THEY SAID THAT I WOULD ONCE AGAIN HAVE TO PAY THE TOW BILL TO GET IT BACK TO THEM BUT THAT IF THEY FOUND THAT IT WAS THEIR FAULT FOR NOT FIXING SOMETHING, THEY WOULD REIMBURSE ME FOR THE TOW BILL. AFTER RECEIVING THE CAR FOR THE SECOND TIME, THEY CLAIMED THAT THE POWER STEERING HOSE WAS AN UNRELATED PROBLEM TO THE POWER STEERING PUMP. I HAD TO PAY THE TOW BILL AS WELL AS THE REPAIR BILL.",
        "vin": "WMWRE33506T"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/09/2017",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984502,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER S",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT ON DRIVER SIDE OF THE CONVERTIBLE WAS ROLLING UP ON ONE SIDE AND NOT PROVIDING ADEQUATE SAFE RESTRAINT.  WAS TOLD BY DEALERSHIP THAT I WAS PULLING THE SEAT BELT OUT WITH MY LEFT HAND AND SITTING TOO CLOSE AND THAT I SHOULD BE PULLING THE SEAT BELT OUT WITH MY RIGHT HAND.  OWNERS MANUAL DID NOT PROVIDE THIS INFORMATION. CONTACT WITH BMW OF NORTH AMERICA DID NOT RESOLVE ISSUE. WHEN I TOLD THE DEALERSHIP SERVICE PERSON THAT THIS WAS A DESIGN FLAW IF YOU CAN ONLY USE ONE HAND TO PULL THE SEAT BELT AND SIT A CERTAIN WAY, SHE AGREED THAT IT WAS.  I TOLD BMW THE SAME WHEN I SPOKE TO THEM TODAY AND TOLD THEM I WAS FILING A FORMAL COMPLAINT WITH THE NHTSA ABOUT THE SEAT BELT DESIGN.",
        "vin": "WMWWG9C5XG3"
    }
]