[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/05/2022",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457333,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mitsubishi Lancer. The contact stated while driving approximately 35 MPH, the vehicle lost motive power. The contact stated he was not sure if any warning lights were illuminated. The contact was able to safely pull over to the side of the road. The vehicle was towed to his residence. The contact had not taken the vehicle to a local dealer. The vehicle had not been diagnosed or repaired. The contact researched the failure and related the failure to NHTSA Campaign Number: 17V609000 (Electrical System). The manufacturer had not been informed of the failure. The failure mileage was approximately 125,000.",
        "vin": "JA32U2FU1GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "08/27/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455748,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mitsubishi Lancer. The contact stated that while driving at various speeds, the vehicle would hesitate upon depression of the accelerator pedal without warning. The contact then stated that while at a complete stop, the vehicle stalled without warning. After multiple failed attempts to restart the vehicle, the contact towed it to his home where it remained. The contact called the manufacturer on multiple occasions and was initially informed that his vehicle was previously included in NHTSA Campaign Number: 16V563000 (Power Train) however, no further assistance could be offered because of the prior recall repair. The vehicle had yet to be repaired. The failure mileage was approximately 40,000.",
        "vin": "ja32u2fu1gu"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/01/2022",
        "dateOfIncident": "08/10/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445778,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "It I not wanting to go or like ir catch gears",
        "vin": "JA32U2FU7GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "11/12/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441857,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Car has 76,470 miles. Took to dealership due to loss of power and jerking hard during takeoffs and said that it needed new transmission. Dealership looked at it said it had internal failure codes for transmission. When doing research there was a recall in 2016 for this specific car for issues that this car is having and the specific transmission. Spoke with woman on hotline and was told to file a report since some cars could have been overlooked in the recall possibly. Recall was for 2016 Mitsubishi lancers with CVT transmission and was made during the time frame that the recall was going on.",
        "vin": "Ja32v2fw3gu"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/05/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439506,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on the way home, my car started to skip and jerking. Went to Mitsubishi and told me I needed a whole new transmission replacement on a 2016 Lancer with only 81,000 miles on it. It seemed to never catch up to speed smoothly. Which I was terrified I was going to wreck otw home that day.",
        "vin": "JA32U2FU9GU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438417,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Our 2016 lancer has suddenly started hesitating/ taking seconds to shift from park to reverse/drive. Also while driving vehicle its rpms fluctuate causing a shudder and surge in power or acceleration. This is a very alarming problem as it puts mine and my kids safety as it hesitates to shift and while driving it loses power and then powers up by itself. We have taken to a transmission shop (HIgH TECH Transmission) and now a dealer (Mission Mitsubishi) and both have replicated problem and pulled code but dealer will not honor recall or repair it. There was a safety recall for 2016 lancers with a cvt8 (SR-16-006) that produces a code P084A as well which and that if both were present a replacement transmission should be approved. All information was pulled from Mitsubishi website, and I called them and spoke to Carla did not give a last name and she advised me that our lancer doesn’t have a recall and I said well is it possible you’ll missed some vehicles that have the same problem from the recalls you’ll have already put out? And she got snappy and said to contact safer car.gov; so here I am, presenting facts to you'll that my 2016 lancer may and hopefully is part of a recall which in result to not being identified or checked out caused more damage as stated it would on the manufacturers website. And needs to be fixed due to not being identified in recall so preventive measures could have been taken. Please our vehicle is experiencing the problem as a recall Mitsubishi put out but failed to identify our lancer and now is experiencing hesitation in CVT trans, and shudder/surge in transmission.",
        "vin": "JA32U2FU1GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405458,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC CVT TRANSMISSION BEGAN FAILING AT 60,000 MILES. TRANSMISSION FLUID WAS CHANGED AT 30K MILES, 55K MILES, 80K, AND 98,000 MILES.  TRANSMISSION COMPLETELY FAILED AT 98,000 MILES. THIS IS DUE TO A MANUFACTURER DEFECT AND WE SHOULD NOT HAVE TO PAY FOR THIS OUT OF POCKET. PLEASE OPEN A RECALL. THIS HAS BEEN REPORTED SEVERAL TIMES ON THIS VIN SERIES. THE VEHICLE HESITATES TO SWITCH GEARS AND CANNOT ENTER 4TH GEAR OR HIGHER. TRANSMISSION SLIPS WITH ACCELERATION. PLEASE RECALL!",
        "vin": "JA32U2FU4GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404737,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY TO ACCELERATE, THE CAR STARTS OUT REALLY SLOW. THERE IS A LOT OF JERKING AND ACCELERATION ISSUES. WHEN I TRY TO ACCELERATE, IT ACTS LIKE IT IS SHIFTED TO L, BUT THEN IT SPEEDS UP. THIS IS A CONSTANT ISSUE.",
        "vin": "JA32V2FW7GU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "03/07/2021",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399625,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING IT IT SEEMS TO HESITATE ON ACCELERATING AFTER A  FEW STOPS  THE TRANSMISSION LIGHT WOULD COME ON FOR A LITTLE BIT THEN GO OFF. SAME WITH THE CHECK ENGINE LIGHT. AS I WAS DRIVING IT TO WORK ON THE HIGHWAY.. IT SUDDENLY STARTED LOSING POWER AND I WAS ABLE TO PULL OVER AND PARK IT AT A GAS STATION WHERE IT WENT COMPLETELY DEAD.. I HAD  AAA  TOW IT.. IT STARTED UP BUT THE SHIFTING IS NOT ENGAGING RIGHT AWAY. HAD THE SOFTWARE UPDATED IN 2019.. THE CVT TRANSMISSION ARE FULL OF  PROBLEMS. IT SEEMS TO HAVE THE SAME SYMPTOMS AS THE RECALL BUT MY CAR WAS NOT RECALLED ACCORDING TO THE VIN NUMBER..  I HAD A FLUSH DONE RECENTLY AND I HAVE ALSO HAD THE OIL CHANGED WHEN NEEDED. THE ACCELERATION HESITATION THEN LOSS OF POWER WHILE DRIVING 60 ON THE FREEWAY IS A SAFETY ISSUE... A LOT OF SEMI TRUCKS TRAVEL THAT HIGHWAY AND THEY CANT STOP WHEN A CAR LOSES POWER IN FRONT OF THEM.",
        "vin": "JA32U2FU0GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "05/20/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331284,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DOESNT CRANK AND WE HAVE TO WAIT LIKE 2 OR 3 MIN AND THEN WILL CRANK BUT STRUGGLING.",
        "vin": "JA32U2FU3GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11299752,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCIDENT THAT RESULTED IN THE CAR BEING DECLARED TOTAL LOSS. THE CAR WAS HIT IN THE UPPER FRONT AND SIDE AREA OF DRIVERS SIDE. DURING THE ACCIDENT THE AIR BAGS DID NOT DEPLOY. RESULTED IN INJURIES, OF COURSE. THE CAR WAS MAKING LEFT HANDED TURN FROM RESIDENTIAL AREA ONTO A BUSY MAIN STREET. AND THE OTHER VEHICLE WAS NOT PAYING ATTENTION AND HIT THE CAR WHILE IT WAS TRYING TO TURN. THE CAR WAS GOING APPROXIMATELY 15-20 MPH. THE OTHER VEHICLE WAS GOING 40-45 MPH. WHAT WOULD CAUSE THE AIR BAGS TO MALFUNCTION?? BECAUSE I WOULD LOVE TO KNOW WHY INJURIES HAD TO EVEN OCCUR SINCE THEY ONLY HAPPENED DUE TO THE MALFUNCTION OF THE AIR BAGS.",
        "vin": "JA32U2FU9GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267399,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MITSUBISHI LANCER. AFTER COMING TO A STOP, THE VEHICLE WOULD NOT ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. IN ADDITION, THE SERVICE TRANSMISSION WARNING INDICATOR ILLUMINATED INTERMITTENTLY. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 16V563000(POWER TRAIN). THE CONTACT ATTEMPTED TO NOTIFY THE MANUFACTURER, BUT HIS CALL WAS NOT ANSWERED. BAKERSFIELD MITSUBISHI (4600 WIBLE RD, BAKERSFIELD, CA 93313, (661) 398-9422) WAS ALSO CONTACTED, BUT A REPRESENTATIVE GAVE HIM INFORMATION REGARDING AN UNRELATED VEHICLE ISSUE. THE CONTACT WAS PROVIDED A QUOTE FOR THE REPAIR COST AND WAS OFFERED NO FURTHER ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 98,600.",
        "vin": "JA32U2FU3GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265637,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHT STATING TO SERVICE MY TRANSMISSION CAME ON. THE MAINTENANCE MILEAGE  WAS WITHIN STATED PARAMETERS.SERVICE  WAS COMPLETED, TRANSMISSION FLUID CHANGED. DROVE AWAY AND THE LIGHT TURNED ON. MY TRANSMISSION FAILED IN APRIL OF 2019.",
        "vin": "JA32U2FU3GU"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/15/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11085158,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE FREEWAY AT 65 MPH, WHEN I HEARD A VERY LOUD SOUND, LIKE A GUNSHOT, AND MY SUNROOF SHATTERED. THERE WAS NO ROCK OR IMPACT TO MY CAR, IT JUST SPONTANEOUSLY EXPLODED WITH GLASS RAINING EVERYWHERE. WHEN I TOOK IT TO THE DEALERSHIP, THEY TOLD ME IT WAS CLEAR THAT THERE WAS NO ROCK IMPACT TO THE SUNROOF BECAUSE OF THE WAY THAT THE REMAINING GLASS WAS BOWED OUTWARD. HOWEVER, WHEN THEY SUBMITTED THE DOCUMENTATION TO MITSUBISHI CORPORATE, AFTER 8 HOURS OF REVIEW, THEY DECLINED TO COVER IT UNDER WARRANTY, STATING THAT IT MUST HAVE BEEN DUE TO A ROCK IMPACT OR OTHER COLLISION AND NOT BECAUSE OF A GLASS OR MANUFACTURER DEFECT.",
        "vin": "JA32U8FW6GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/18/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979053,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED AN ISSUE WITH MY CARS ACCELERATION FROM A 0 MILE PER HOUR STARTING POINT TO A 30 MPH.   IT IS VERY SUDDEN AND RANDOM. IT HAS OCCURRED SEVERAL TIMES FROM A STOP AT A TRAFFIC LIGHT OR A STOP SIGN. THERE IS A SECOND TO AS LONG AS 4 SECOND HESITATION IN ACCELERATION. ACCELERATOR PEDAL IS PRESSED AND THE CAR TAKES OFF FOR A BRIEF SECOND OR 2 BEFORE THE FEW SECOND HESITATION OCCURS. IT CAN BE DANGEROUS IF THIS OCCURS WHEN PULLING OUT ON A BUSY HIGHWAY WITH TRAFFIC COMING. FOR THOSE FEW SECONDS THERE IS NOTHING YOU CAN DO BUT PRESS THE GAS PEDAL HARDER WHEN THOUGH THE CAR IS NOT DOING ANYTHING. AFTER THOSE FEW SECONDS THE CAR TRANSMISSION KICKS IN AND YOU EVENTUALLY HAVE CONTROL IN ACCELERATION ONCE AGAIN.   TOOK TO THE DEALER TODAY. THEY SAID NO RECALLS ON THE VEHICLE. ONLINE I SEE A SIMILAR RECALL ON THE OUTLANDER TRANSMISSION BUT SERVICE TECH SAYS HE CHECKED AND NOTHING ON THE LANCER. THEY DROVE MY CAR AND OF COURSE IT DON'T HAPPEN. IT'S VERY RANDOM. IT USUALLY HAPPENS ONCE A WEEK. IT HAS PROB OCCURRED ABOUT 10 TIMES IF NOT MORE. THERE IS NO WAY TO EXPECT IT SO NOW I HAVE TO TAKE EXTREME CAUTION WHEN I'M ABOUT TO PULL OUT ON A BUSY ROAD WITH TRAFFIC COMING MY WAY.   HAS ANYONE ELSE HAD THIS ISSUE WITH THEIR LANCER?",
        "vin": "JA32U8FWXGU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968384,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN DRIVING THIS CAR FOR A COUPLE OF MONTHS NOW AND EVERY ONCE IN A WHILE VERY RANDOMLY I EXPERIENCED A LOSS OF ACCELERATION COMPLETELY. IT HAPPENS AFTER A LONG PERIOD OF DRIVING AND WHEN I'M COMING UP TO A STOP SIGN AND GOING TO ACCELERATE AGAIN AFTER DOING RESEARCH ONLINE AND TAKING IT TO MY DEALERSHIP THEY WILL NOT DO ANYTHING BECAUSE THEY CANNOT FIGURE OUT THE PROBLEM I FOUND A RECALL ON THE NHTSA WEBSITE FOR MY VEHICLE WITH MY VIN NUMBER INCLUDED IN THE RANGE OF IN NUMBERS EXPERIENCING THIS EXACT PROBLEM. I NEED HELP GETTING MY DEALERSHIP TO ACKNOWLEDGE THIS BECAUSE IT IS NOT ON THEIR WEBSITE. I HAVE ALMOST BEEN REAR-ENDED MULTIPLE TIMES BECAUSE OF THIS PROBLEM AND I AM AFRAID FOR MY SAFETY",
        "vin": "JA32U2FUXGU"
    }
]