[
    {
        "components": "SERVICE BRAKES, AIR,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445998,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mercedes-Benz Sprinter 3500. The contact stated that while driving at 30 MPH, the ABS warning light and the electronic stability control warning lights illuminated. The contact also stated that the motorhome was making abnormal clunking sounds.  The contact was able to continue to drive at less than 30 MPH. The manufacturer was notified of the failure and advised the contact that one of the wheels must have failed to patch the ground. The manufacturer advised the contact to turn the vehicle on and off three times using the ignition key for the warning lights to disappear. The contact stated that he did so and the warning lights and warning messages disappeared; however, they reappeared the next day. The contact stated that while driving at 50 MPH and towing his Volkswagen vehicle, the transmission disengaged and the vehicle made an abnormal clunking sound. Then the transmission reengaged and disengaged causing the vehicle to lurch forward. The contact continued to drive the vehicle. The contact stated upon starting the vehicle the failure reoccurred.  The RV was taken to the dealer who diagnosed that the rear axle speed sensors, knock sensors needed to be replaced, and the recall repair for NHTSA Campaign Number: 21V042000 (ELECTRONIC STABILITY CONTROL) was completed. The contact also stated that the dealer cross-fired the speed sensors which caused the computer to not allow the vehicle to drive more than 35 MPH. The vehicle was not diagnosed or repaired. The contact stated that while driving at 5 MPH, the vehicle leaned on his right side and crashed into a street sign. The air bags failed to deploy. There were no injuries sustained. A police report was not filed. The contact stated that while driving at an undisclosed speed, The warning lights reappeared and the vehicle leaned and hit the curb. The air bags did not deploy. There were no injuries sustained. A police report was not filed. The manufacturer was notified of the failures and offered the contract to trade the vehicle. The vehicle was not repaired. The failure mileage was approximately 2,000.",
        "vin": "WDAPF4CC0G9"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440985,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "trucks cut  speed  limit 65 to 10  normal highway  i do understood %35 degrees  slow down  but its only %2  degrees  uprise there is no power at engine  rpm is shows less then 1 rpm and even if press the gas pedal all the way the truck does not accelerate like truck is lock  right there   very dangers  any one drive back of me  they are not accept that much  speed change  they are in dangers  scarr to drive truck   be couse same one get git back of truck and can get kill",
        "vin": "wdppf4cc4g9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437198,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mercedes-Benz Sprinter 3500. The contact stated that while driving, several unknown warning lights illuminated. The contact pulled over and restarted the vehicle. The contact received notification of NHTSA campaign number: 21V042000 (Electronic Stability Control) however, the part to do the recall repair was unavailable. The contact called the local dealer who stated that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the failure. The approximate failure mileage was 8,000. Parts distribution disconnect.",
        "vin": "WDAPF4CCXG9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "08/19/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434169,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The  NHTSA law requires that the recall be done on a timely manner .  Mercedes benz is not doing this . The wheel sensor recall is being not being done in a  timely manner by Mercedes benz.   They are typically making appointments 1 month to 3 months out to do a recall that takes 40 minutes to accomplish.  .They are purposely endangering sprinter RV owners by their untimely repair schedule.",
        "vin": "WDAPF4CC3G9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "06/12/2021",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425081,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Mercedes-Benz Sprinter 3500. The contact received notification of NHTSA Campaign Number: 21V042000 (Electronic Stability Control) however, the part to do the recall repair was unavailable. The contact stated that while driving over a railroad track at a slow speed, the vehicle independently accelerated with the ABS, check engine, and traction control warning lights illuminated. The contact was able to safely stop the vehicle and shut-off the vehicle. Due to the failure, the contact had the vehicle towed to the dealer. Due to the parts for the repair not being available, the dealer decided to place a new, yet defective, speed sensor on the vehicle as a temporary repair and the contact drove the vehicle back home. The manufacturer was informed of the failure but offered no assistance. The contact had called three separate dealers and it was confirmed that the part would not be available until the fourth quarter of 2021. The vehicle was not repaired. The failure mileage was 23,580. Vin tool confirms parts not available.",
        "vin": "wdapf4cc1g9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403912,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT DISCOVERED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 21V042000 (ELECTRONIC STABILITY CONTROL) HOWEVER, THE PARTS TO DO THE RECALL REPAIR WAS UNAVAILABLE. MERCEDES-BENZ OF WILSONVILLE (25035 SW PARKWAY AVE, WILSONVILLE, OR 97070, 503-454-5000) WAS CONTACTED AND IT WAS CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WDAPF4CC8G9"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394837,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 30, 2019, I WAS DRIVING DOWNHILL ON A MOUNTAIN ROAD WHEN OUR RV, A 25' LTV UNITY ON A MERCEDES SPRINTER 3500 CHASSIS, SUDDENLY LURCHED AND FELT OUT OF CONTROL. THE BREAKS AND STEERING WERE UNRESPONSIVE, AND I WAS PUMPING THE BREAKS, HARD! AFTER ABOUT 10 MINUTES OF STRUGGLING TO CONTROL THE VEHICLE AROUND A CURVEY DOWNHILL ROAD, CONTROL WAS RESTORED. LUCKILY, I WAS GOING SLOW ENOUGH THAT NO ACCIDENT RESULTED, BUT IT REALLY SHOOK ME! A COUPLE OF DAYS LATER THE VEHICLE (STILL UNDER WARRANTY) WAS LOADED ONTO A FLATBED TRUCK AND HAULED 2 HOURS AWAY TO KNOXVILLE, TN; THE CLOSEST MERCEDES SPRINTER VAN SERVICE CENTER. THEY REPLACED THE RIGHT REAR WHEEL SPEED SENSOR. I WAS TOLD THE OTHER SENSORS MIGHT ALSO FAIL, BUT THEY COULD NOT BE REPLACED UNTIL THEY FAILED. SINCE THEN, WE HAVE HEARD FROM SEVERAL OTHER RVERS WITH MERCEDES SPRINTER CHASSIS THAT THIS IS A COMMON PROBLEM. FOR US, THE VEHICLE NO LONGER FEELS SAFE TO TAKE ON THE ROAD SINCE WE HAVE NO IDEA WHEN THE NEXT SENSOR WILL FAIL. (PS - I TRIED TO SUBMIT THIS FORM EARLIER, BUT ACCIDENTALLY SELECTED 'I DO NOT WISH TO RECEIVE SAFETY RECALL ALERTS' - I DO WISH TO RECEIVE THOSE ALERTS.",
        "vin": "WDAPF4CC9G9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2021",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390889,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL SPEED SENSORS KEEP FAILING. I HAVE HAD EIGHT SENSORS FAIL IN THREE YEARS OF OWNERSHIP. TRANSMISSION SHIFTS ERRATICALLY, SPEED SURGES, ABS, CHECK ENGINE LIGHT AND BRAKING IS IMPAIRED. THIS HAPPENS WHEN VEHICLE IS IN MOTION.",
        "vin": "WDAPF4CC9G9"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389262,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE THIRD TIME THE ESP AND ABS SYSTEM WARNING MESSAGE IS SHOWN, AT FIRST THE SPEED OF THE VEHICLE INCREASES, IN THIS CASE FROM THE SET 60 MPH TO 70, AT WHICH POINT I SHUT THE CRUISE CONTROL DOWN. FROM THEN ON FOR THE REST OF THE DAYS TRAVEL C.A.200 MILES AND FOR THE REST OF THE TRIP (450 MILES) CRUISE CONTROL WAS INOPERATIVE.  EACH TIME IT HAPPENS A MECHANIC VISIT IS NECESSARY.  THE VEHICLE IS A WINNEBAGO NAVION",
        "vin": "WDAPF4CC3G9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387156,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN AN RV ON A MERCEDES 3500 SPRINTER CHASIS.  I HAVE EXPERIENCED NUMEROUS FAILURES THAT CAUSE THE RV TO SPEED UP RAPIDLY AND I HAVE TO TAKE EMERGENCY ACTION TO AVOID AN ACCIDENT.  USUALLY, I SHIFT INTO NEUTRAL TO DISENGAGE THE TRANSMISSION.      I HAVE ~43,000 MILES ON MY RV AND I HAVE EXPERIENCED THIS ISSUE AND MERCEDES HAS REPLACED THE WHEEL SENSORS 6 DIFFERENT TIMES. ALL MAINTENANCE PERFORMED ON THE VEHICLE HAS BEEN PROVIDED BY A MERCEDES DEALER SERVICE CENTER.      DOESN'T SEEM TO MATTER IF I AM DRIVING ON THE FREEWAY OR CITY STREETS, WHEN THE FAILURE HAPPENS, THE VEHICLE STARTS TO ACCELERATE RAPIDLY, RPMS SKYROCKET, THE DASHBOARD GETS THREE TROUBLE INDICATOR LIGHTS THAT COME ON, THE CHECK ENGINE LIGHT COMES ON.      I AM PICKING UP THE VEHICLE FROM THE LOCAL MERCEDES DEALER TODAY AFTER JUST HAVING ANOTHER SENSOR FAILURE.  I WAS DRIVING ON I-10 WHEN THE MOST RECENT FAILURE OCCURRED.  THE VEHICLE BEGAN TO ACCELERATE, RPMS WENT VERY HIGH. VERY SCARY SITUATION.    THE \"WHEN DID THIS HAPPEN\" DATE I'VE ENTERED IS FOR THE MOST RECENT FAILURE.  I HAVE EXPERIENCED THIS ISSUE NUMEROUS TIMES.",
        "vin": "WDAPF4CC5G9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "12/29/2020",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386418,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON A DRY DAY, SMOOTH ROAD, WITH CRUISE CONTROL ON 65MPH AT 7:45PM.  THIS VEHICLE IS CONVERTED WITH A THOR 24HL CAMPER ON THE CHASSIS.     FIVE HOURS INTO THE DAYS DRIVE THE VEHICLE FLASHED ASR/ESP TRIANGLE - AND JERKED ABRUPTLY BUT INSTANTANEOUSLY BUT REMAINED ON CRUISE CONTROL.  2 SECONDS LATER:    ABS LIGHT ON, ASR/BAS LIGHT ON, ESP LIGHT ON    CRUISE CONTROL STOPPED FUNCTIONING (FYI -  A VERY HEAVY ACCELERATOR PEDAL SPRING MAKES DRIVING DIFFICULT, FOR HOURS ON END, WITHOUT CRUISE WORKING - ESPECIALLY FOR THE OLDER DRIVERS LIKELY TO BE DRIVING THIS RIG.)    PULLED OFF THE SIDE OF THE ROAD, SET FLASHERS, AND TURNED OFF ENGINE FOR ONE MIN HOPING TO RESET THE FAULT.  TURNED BACK ON - NO CHANGE    OFF THEN BACK ON AND THE YELLOW CHECK ENGINE CAME ON STEADY ALONG WITH THREE PREVIOUS AUCTION LIGHTS (ABOVE)    VEHICLE HAD EXPERIENCED (WITH THE PREVIOUS OWNER) A PREVIOUS 'WHEEL SPEED SENSOR FAILURE' AND IT WAS REPAIRED. . 'WHEEL SPEED SENSOR FAILURE' APPEAR AT EPIDEMIC LEVELS ON THE TWO RV FACEBOOK GROUPS ASSOCIATED WITH THIS VEHICLE.      THE 5TH KEY TURN AFTER INITIAL FAULT AND FAILURE OF CRUISE CONTROL THE THREE LIGHTS WENT OUT BUT THE CHECK ENGINE LIGHT REMAINED ON.     ON APPROXIMATELY THE TENTH KEY TURN THE CHECK ENGINE LIGHT WENT OUT.      VEHICLE RETURNED FOR SERVICE AT MERCEDES DEALERSHIP 'UNDER WARRANTY'.   MY ISSUE LAYS IN THE POTENTIAL FOR THE VEHICLE TO ENTER INTO THE LIMP MODE IF ANOTHER CENSOR SHOWS A FAULT AND I'M ON THE ALASKA HIGHWAY 200 MILES FROM THE NEAREST POSSIBLE SERVICE.  DEALER REFUSES TO SHARE TECH DATA CONCERNING RESET OF FAULT CONDITION OR A MERCEDES FIX FOR THIS NOW WELL KNOWN AND DOCUMENTED VEHICLE SHORTCOMING.      THIS ISSUE CAN AND WILL GET PEOPLE KILLED AS THEY 'LIMP' DOWN THE HIGHWAY TO GET SERVICED OR ARE FORCED TO PULL OVER IN HEAVY TRAFFIC TO CHECK OUT WHAT MERCEDES SHOULD BE WARNING IS ALL ABOUT PROACTIVELY.",
        "vin": "WDAPF4CC2G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378628,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO REPLACE OUT OF POCKET ALL FOUR BRAKE SPEED SENSORS WHILE THEY SHOULD HAVE BEEN COVERED UNDER WARRANTY. MY LOCAL MERCEDES DEALER EVENTUALLY ACKNOWLEDGED THIS, BUT WILL NOT REIMBURSE SINCE THEY DID NOT REPLACE THEM. THIS ALL HAPPENED BETWEEN 17 AND 21,000 MILES AND CREATED UNSAFE DRIVING CONDITIONS.",
        "vin": "WDAPF4CC8G9"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "11/28/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377384,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WHEEL SPEED SENSOR HAD TO BE REPLACED AT 30,000 MILES AND NOW BOTH FRONT WHEEL SENSORS ARE FAULTY AT 50.000 MILES.  IN MY READING THIS IS A COMMONLY FAULTY PART AND IT COST $ 760.00 TO REPLACE BOTH SENSORS. FORTUNATELY THE FIRST SENSOR WAS UNDER WARRANTY.  IT WOULD BE GREATLY APPRECIATED IF YOU WILL LOOK INTO THIS ISSUE.  BECAUSE YOU CANNOT AFFORD TO TRADE AN RV.  I WAS ON A TRIP WHEN THE INDICATOR LIGHTS CAME ON ON DASH AND I WAS ABLE TO DRIVE 7 HOURS HOMES. MY OWNERS MANUAL EXPRESSED I SHOULD SEEK TECHNICAL ASSISTANCE ASAP.",
        "vin": "WDAPF4CC2G9"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/26/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376973,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH LEFT AND RIGHT REAR WHEEL SPEED SENSORS FAILED RESULTING IN TRANSMISSION LIMITED TO 2ND GEAR AND BACK UP. VEHICLE HAS DRIVEN 9800 MILES TOTAL.",
        "vin": "WDAPF4CC6G9"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373892,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WENT TO TRY THE 4 WHEEL DRIVE THE FOLLOWING THINGS HAPPENED: A CLUNKING SOUND IN THE REAR OF THE VEHICLE. NUMEROUS WARNING LIGHTS CAME ON .  ABS, COLLISION AVOIDANCE, CRUISE CONTROL, CHECK ENGINE, ESC OR ESP. OVER TIME THE LIGHTS CLEARED BUT CAME BACK ON WEEKS APART.  I AM A RETIRED NASA SAFETY/RELIABLY ENGINEER.  IN MY OPINION ALL OF THESE LIGHTS COME ON AS A RESULT OF FAILURES OF ONE OR MORE WHEEL SPEED SENSORS.  THIS IS A MAJOR SAFETY PROBLEM AS WHEN THERE IS A FAILED OR INTERMITTENT OPERATION OF A FAILED SPEED SENSOR.  ALL OF THESE SAFETY SYSTEMS FAIL WHEN THE ONE SENSOR FAILS. THIS FAILURE COULD OCCUR UNEXPECTEDLY AT ANY TIME.  LEADING TO LOSS OF LIVES AND VEHICLE.  I HAVE NOT RECEIVED ANY WARNING LETTERS ON THIS MAJOR SAFETY FAILURE.  ACCORDING TO THE DEALER MERCEDES IS AWARE OF THIS ISSUE. AFTER THE VEHICLE IS OUT OF WARRANTY MERCEDES SAYS THEY WILL CHARGE THE OWNER TO FIX IT. AT THE VERY LEAST THE ISSUE CLEARLY  NECESSITATES THAT THIS ISSUE BE ELEVATED, TO CONSUMERS, AND THAT THE ISSUE BE FIXED .  A WARNING THAT DESCRIBES THE ISSUE AND MERCEDES STATUS ON A FIX SHOULD GO OUT TO ALL THE APPROPRIATE PARTIES IMMEDIATELY.  THE VEHICLE WAS STOPPED PUT IN NEUTRAL THEN 4 WHEEL DRIVE WAS ENGAGED, IMMEDIATELY WHEN MOVING THERE WAS A BIG CLUNK AND THE WARNING LIGHTS CAME ON.  THEY WENT OUT THEN CAME BACK ON INTERMITTENTLY FOR MONTHS. ONE TIME THEY CAME ON JUST SITTING AT THE LIGHT. FAILURE OF MULTIPLE SAFETY SYSTEMS DUE TO A SENSOR FAILURE IS UNACCEPTABLE.  I BELIEVE A DESIGN FIX IS URGENTLY NEEDED AND SHOULD BE PRESSED FOR HARD BY THE GOVERNMENT. CURRENTLY THERE IS NO FIX. AND MERCEDES IS NOT ADEQUATELY WARNING THE PUBLIC OF THE ISSUE.  UNTIL I PRESSED MERCEDES HARD ON THIS INTERMITTENT PROBLEM   I WAS NOT MADE AWARE OF WHAT EXACTLY THE PROBLEM WAS.  THE FAILURE OF ONE SENSOR SPEED CAUSES MULTIPLE SAFETY SYSTEMS TO NOT WORK.",
        "vin": "WDAFF4CC6GP"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373244,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIRD-TIME SPEED SENSOR FAILED WHILE DRIVING ' ALL 3 TIMES WHILE DRIVING ON HIGHWAY.  CAUSES THE VEHICLE TO SPEED UP / SLOW DOWN AND LURCH WITH THE ENGINE DOING HIGH REVS.  CRUISE CONTROL BECOME INOPERABLE.  ABS, FORWARD COLLISION, AND PARKING SENSORS BECOME INOPERABLE.  BRAKES PERFORM ERRATICALLY FOR SEVERAL MOMENTS AND THEN ABS INDICATES IT IS INOPERABLE.  VAN BECOMES HAZARDOUS TO DRIVE WHILE THE ELECTRONICS ATTEMPT TO SORT OUT WHAT IS GOING ON.  VERY GLAD I WAS NOT IN CONGESTED TRAFFIC EACH TIME THIS HAPPENS AS THE VAN BECOMES UNSTABLE.  M-BENZ SOLUTION IS TO REPLACE SENSOR ' THIS DOES NOT SEEM SAFE NOR VIABLE LONG TERM FIX.",
        "vin": "WDAFF4CC4GP"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366659,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V003000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CONTACTED TROPHY MERCEDES-BENZ OF VALENCIA   (23355 VALENCIA BLVD, SANTA CLARITA, CA 91355, (661) 753-5555) WHERE IT WAS CONFIRMED THAT PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WDAPF4CC0G9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366386,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG IN CRUISE CONTROL AROUND 65 MPH ALL OF A SUDDEN CRUISE CONTROL STOPS WORKING AND VEHICLE BUCKS QUITE A BIT,VERY STARTLING.THEN I NOTICE ON DASHBOARD THE SO CALLED THREE STOOGES LIGHTS APPEAR.THIS WAS MY FIRST ENCOUNTER AROUND 18,000 MI.AUGUST 2020.PROBLEM FIXED IN CT UNDER WARRANTY. TWO MONTHS LATER DRIVING THROUGH VIRGINIA,SAME STOOGE LIGHTS APPEAR IN THE MOUNTAINS SHIFTING ERRATICALLY.CALLED M B TECH, VERY HELPFUL,DIRECTED ME TO MERCEDES BENZ OF FREDERICKSBURG VA 77 MILES AWAY.INCONVENIENCED BUT GRATEFUL WORK WAS DONE UNDER WARRANTY.I BELIEVE THIS IS A HAZARD ON THE ROADS AND SHOULD BE A RECALL.",
        "vin": "WDAPF4CC4G9"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2020",
        "dateOfIncident": "10/04/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365059,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MB SPRINTER  HAS FAULT  THAT GENERATES INSTRUMENTS INDICATORS OF ABS, SKIDDING AND ANOTHER. BEFORE THIS OCCURRED TRANSMISSION SHIFTING BECAME ERRATIC AND WHEN BREAKING THE ENGINE REVVED UP AND ALSO MADE BRAKES UNLESS. NO ACCIDENT OCCURRED BUT WAS ALMOST OUT OF CONTROL.",
        "vin": "WDAPF4CCXG9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362944,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL SPEED SENSOR FAILURE CAUSED VEHICLE TO DISABLE CRUISE CONTROL, ABS BRAKE SYSTEM AND PUT THE TRANSMISSION IN LIMP MODE. CANNOT ACCELERATE MORE THAN 25 MPH ON THE INTERSTATE. WAS TRAVELLING AT 62 MPH WHEN EVENT OCCURED. FRIGHTENING EXPERIENCE!",
        "vin": "8BNPF4CC3GE"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362948,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL SPEED SENSOR FAILED AT 10000 MILES (REFER TO PREVIOUS COMPLAINT), AGAIN FAILS AT 20000 MILES CAUSING ERRATIC TRANSMISSION SHIFTING AND PROPULSION WITHOUT DRIVER INPUT.",
        "vin": "WDAPF4CC4G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "06/14/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354676,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 MERCEDES BENZ SPRINTER 3500. CONSUMER WRITES IN REGARDS TO ACCELERATION ISSUES. *LD    THE CONSUMER STATED, WHILE DRIVING ON HIGHWAY 20, THE VEHICLE LOST THE ABILITY TO ACCELERATE AND SHIFT GEARS. THE SPEED DECREASED TO LESS THAN 20 MPH. *JS",
        "vin": "WDAPF4CC0G9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337921,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD THREE DIFFERENT WHEEL SENSORS GO OUT CAUSING ENGINE TO GO INTO LIMP MODE RESULTING IN HAZARDOUS DRIVING CONDITIONS. MOST MERCEDES DEALERS CANNOT DO THIS SERVICE. THIS IS A DANGEROUS FAULT THAT MANY HAVE EXPERIENCED AND IS A SERIOUS ROAD SAFETY HAZARD. IN ALL INSTANCES I WAS DRIVING VEHICLE ON 'WASHBOARD' ROAD CONDITIONS; ONCE IN I-70 WESRBOUND FROM KANSAS CITY.",
        "vin": "WDAPF4CC2GP"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331427,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG ON CRUISE CONTROL.  CRUISE CONTROL DEACTIVATES, ANTI-LOCK, TRACTION CONTROL AND ANTI-SKID LIGHTS COME ON. I STOP THE VEHICLE, THE TRANSMISSION WANDERS BETWEEN GEARS JERKING.  I GO TO MB DEALERSHIP THEY REPLACE R REAR SPEED SENSOR MILEAGE:9659MILES.  AT 12,060 MILES THE SAME THING HAPPENS.  I DRIVEA FIVE HOUR ROUND TRIP TO MB DEALER, THEY REPLACE THE L REAR SPEED SENSOR.  AT 17,000 MILES  (NOW OFF WARRANTY) ALL THE LAMPS ARE ON AGAIN, THE TRANSMISSION WILL NOT SHIFT INTO DRIVE AND I FACE A 133 MILE TOW TO KNOXVILLE, TN  MERCEDES DEALERSHIP.",
        "vin": "WDAPF4CC5G9"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331476,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS/ESP/CECK ENGINE WARNING LIGHTS ALL CAME ON AT ONCE. MERCEDES DEALER DIAGNOSED PROBLEM AS LEFT REAR RPM SENSOR. MADE REPAIR.   UNDERSTAND FROM OWNER FORUMS SENSOR FAILURE IS VERY COMMON ON THESE VEHICLES. ONLY HAD 22,700 MILES. MERCEDES NEEDS TO WORK ON IMPROVING THESE PARTS OR MAKE REPAIRS AT NO CHARGE.  *TR",
        "vin": "WDAPF4CC5GP"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/02/2020",
        "dateOfIncident": "05/30/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326963,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT STATED THAT WHILE THE RV WAS PARKED, THE CONTACT BECAME AWARE THAT THE DRIVER'S SIDE REAR TIRE WAS FLAT. THE CONTACT DROVE THE RV TO AN INDEPENDENT MECHANIC WHERE IT WAS DISCOVERED THAT THE WELDING ON THE BACK OF THE REAR DRIVER'S SIDE WHEEL HAD FRACTURED, WHICH PUNCTURED THE TIRE. THE CONTACT STATED THAT HE WAS CONCERNED THAT THE WELDING DEFECT ON THE OTHER WHEEL COULD LEAD TO OTHER TIRES BEING PUNCTURED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE WHEELS WERE NOT REPAIRED NOR REPLACED. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "8BNPF4CC5GE"
    },
    {
        "components": "POWER TRAIN,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "05/22/2020",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325768,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MB SPRINTER 3500 3.0 DIESEL IS THE CHASSIS FOR A 2018 THOR CHATEAU 24FS RV.  2018-07-06 - 8485 MILES: LEFT REAR SPEED SENSOR REPLACED.  2018-09-14 - 9488 MILES: RIGHT REAR SPEED SENSOR REPLACED.  2020-05-22 - 14127 MILES: LEFT REAR SPEED SENSOR REPLACED.    IN ALL CASES THE TRACTION, SKID, AND ABS LIGHTS COME ON ALONG WITH THE CHECK ENGINE LIGHT INTERMITTENTLY.    WHEN THIS OCCURS, THE TRANSMISSION CAN SHIFT MANY TIMES PER SEC WHEN TURNING A SHARP CORNER (AND CAUSE THE RV TO \"BUCK\").  ALSO THE TRANSMISSION CAN DROP OUT OF DRIVE MULTIPLE TIMES AND REV THE ENGINE RPMS AT HIGHWAY SPEEDS, ALSO CAUSING THE RV TO \"BUCK\".  A STARTLED DRIVER MIGHT TRY TO TURN OFF THE ENGINE AT HIGHWAY SPEEDS AND LOCK THE STEERING WHEEL.     MB SERVICE AGENT ON 5-22-2020 TOLD ME THAT THEY SEE THIS WITH RV'S \"ALL THE TIME, BUT NEVER SEEM TO SEE IT WHEN THE SPRINTER IS JUST A VAN.  UNCLEAR WHY THIS IS HAPPENING\".    THIS IS A SAFETY ISSUE THAT COULD CAUSE AN ACCIDENT!!!  IT ALMOST DID FOR ME DRIVING 55 MPH ON I-515 IN GA NEAR WOODSTOCK AND OTHER TIMES.  ALSO CAUSED ME TO HAVE THE RV TOWED TO THE MB DEALER IN ATLANTA FROM TYBEE ISLAND GA AT AN EXPENSE OF $600.    AT MINIMUM, MB SHOULD UPDATE THEIR ESP COMPUTER TO SANITY CHECK THE DATE BEING GIVEN BY THE WHEEL SPEED SENSORS.  IF THEY DON'T MAKE SENSE, THEN DISABLE ABS, TRACTION AND SKID, BUT DON'T START SHIFTING THE TRANSMISSION MULTIPLE TIMES PER SECOND, OR TAKE IT OUT OF GEAR AND REV THE ENGINE.  *DT*JB*DT *DL",
        "vin": "WDAPF4CC4G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289906,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BEEN WAITING 11 MONTHS FOR PARTS FOR THE PASSENGER SIDE AIRBAG RECALL AND I STILL CAN'T GET A DATE AS TO WHEN THEY WILL BE ABLE TO CORRECT THE SITUATION.",
        "vin": "WDAPF4CC4GP"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289709,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS RECALL GOES BACK TO MARCH 2019.  I NEED TO SELL THIS VEHICLE AND I CAN'T SELL IT WITH THE RECALL NOT PERFORMED.  WHEN WILL THE PARTS BE AVAILABLE FOR THE RECALL?",
        "vin": "WDAPF4CC0GP"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281785,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED NOTICES OF 2 AIRBAG RECALLS ON THIS VEHICLE. ONE FOR DRIVER SIDE, ONE FOR PASSENGER SIDE.  DEALER TELLS ME HE HAS ALL PARTS IN STOCK FOR BOTH REPAIRS, BUT PASSENGER SIDE AIRBAG IS LISTED ON HIS RECORDS AS PENDING.  THEREFORE, HE CANNOT PROCEED WITH THAT REPAIR, AS HE WILL NOT BE REIMBURSED.  IS THE PASSENGER AIRBAG IN THIS VEHICLE IN FACT SUBJECT TO RECALL?  IF SO, WHY IS IT THAT IT CANNOT BE REPAIRED A FULL SEVEN MONTHS AFTER I RECEIVED A RECALL NOTICE IN MARCH, 2019 WHEN THE DEALER HAS THE PARTS?  I LIVE APPROXIMATELY TWO HOURS DRIVE FROM MY DEALER.  IT MAKES NO SENSE TO TAKE TWO 4 HOUR ROUND TRIPS TO DEAL WITH THESE RECALLS.  THAT WILL COST ME THE PRICE OF TWO FULL TANKS OF DIESEL GASOLINE.",
        "vin": "WDAPF4CC6G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279821,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V004000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. WORLD WIDE MOTORS INC (3900 E 96TH ST, INDIANAPOLIS, IN 46240, (317) 580-6800) WAS CONTACTED AND CONFIRMED THAT PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WDAPF4CC8G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279669,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500 (M3CC170). THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V004000 (AIR BAGS). THE CONTACT CALLED MERCEDES-BENZ OF TUCSON (6350 E GRANT RD, TUCSON, AZ 85715, (520) 886-1311) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT HAD NOT SPOKEN WITH THE MANUFACTURER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.     CONSUMER STATES THAT VEHICLE WAS REPAIRED ON 1/22/2020. REPAIR WAS COMPLETED BY CHAPMAN MOTORCARS OF TUCSON, LLC (TUCSON, AZ). *DL",
        "vin": "WDAPF4CC7G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/01/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277513,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 19V003000 (AIR BAGS) AND 19V004000 (AIR BAGS). THE CONTACT CALLED JOHN G. LEDFORD JR. FOR MERCEDES BENZ OF ATHENS AT 706-549-6585 (LOCATED AT 4735 ATLANTA HIGHWAY, ATHENS, GA 30622) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN BOTH PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE FOR 19V004000 (AIR BAGS) AND PARTS DISTRIBUTION DISCONNECT FOR 19V003000 (AIR BAGS). *BF*JB  CONSUMER STATED PARTS DEPT HAD NEW AIR BAGS AVAILABLE BUT WOULD NOT SELL IT TO THE CONSUMER.*JB",
        "vin": "WDAPF4CC9G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266290,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 MERCEDES-BENZ SPRINTER 3500.CONSUMER WRITES IN REGARD TO SAFETY RECALL INTERIM NOTICE 2018110007 NHTSA RECALL 319V004, REPLACE DRIVER-SIDE AIRBAG MODULE. *AS     THE CONSUMER WAS INFORMED THERE WAS A MISTAKE MADE AND THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE CONSUMER WAS CONCERNED THAT THE VEHICLE NEEDED TO BE REPAIRED. *JS",
        "vin": "8BNPF4CC2GE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11258988,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2016 MERCEDES-BENZ SPRINTER 3500. WHILE DRIVING 40-45 MPH, THE CONTACT WAS INVOLVED IN A CRASH WITH A SCHOOL BUS TRAVELING NORTH AT 30 MPH. THE AIR BAGS DID NOT DEPLOY. THE CONTACT WAS NOT INJURED; HOWEVER, SEVERAL CHILDREN ON THE SCHOOL BUS SUSTAINED MINOR INJURIES. THREE STUDENTS SOUGHT MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED FROM THE SCENE TO A LOCAL TOW LOT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND THE MANUFACTURER WERE NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 19,000.  *DT    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB *DT  *TR *DT*JB",
        "vin": "WDAPF4CD6GP"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/18/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252220,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. WHILE DRIVING 65 MPH, THE VEHICLE ACCELERATED AND THE ABS, ESP, TRACTION CONTROL, AND CHECK ENGINE WARNING INDICATORS ILLUMINATED. IN ADDITION, WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE CONTINUED TO ACCELERATE. THE CONTACT SHIFTED INTO NEUTRAL, PULLED OFF THE ROAD, AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED, BUT THE FAILURE RECURRED THREE TIMES DOWN THE ROAD. THE VEHICLE WAS TOWED TO MERCEDES-BENZ OF THE WOODLANDS (16917 I-45, CONROE, TX 77385, (936) 206-7500) WHERE IT WAS DIAGNOSED THAT THE REAR DRIVER AND PASSENGER SIDE SPEED SENSORS HAD SPORADIC READINGS. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 18,763.",
        "vin": "WDAPF4CC1G9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246534,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V004000 (AIR BAGS). THE CONTACT STATED THAT MERCEDES-BENZ OF FAIRFIELD (LOCATED AT 2950 AUTO MALL PKWY, FAIRFIELD, CA 94533, (707) 430-0101) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND STATED THAT THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WDAPF4CC3G9"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232230,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 14, 2019, WE WERE DRIVING OUR 2016 MERCEDES-BENZ SPRINTER 3500 RV IN HEAVY TRAFFIC DURING A RAINSTORM IN SPRING HILL, FLORIDA.  MULTIPLE DASH WARNING LIGHTS CAME ON INDICATING THE VEHICLE ABS BRAKING SYSTEM HAD FAILED.  THE VEHICLE BEGAN SHIFTING VERY ERRATICALLY WHILE WE WERE IN TRAFFIC.  THE VEHICLE EVENTUALLY WOULD NOT SHIFT OUT OF FIRST GEAR WHICH PLACED US IN A VERY DANGEROUS SITUATION AS WE TRIED TO GET OUT OF THE TRAFFIC STREAM AND FIND A SAFE PLACE TO PARK THE VEHICLE.  WE HAD TO HAVE THE VEHICLE TOWED APPROXIMATELY 35 MILES TO THE NEAREST MERCEDES-BENZ SPRINTER SERVICE CENTER IN WESLEY CHAPEL, FLORIDA.  THEY ULTIMATELY DETERMINED THAT ONE OF THE VEHICLE?S REAR SPEED SENSORS HAD FAILED AND THEY REPLACED IT.  THE REPAIRS WERE MADE UNDER MERCEDES-BENZ WARRANTY.    SPEED SENSOR FAILURE ON THE MERCEDES-BENZ SPRINTER 3500 HAS BEEN PREVIOUSLY REPORTED BY OTHERS UNDER NHTSA ID NUMBERS 11196530,11138785,11124129, 11093070.  *TR",
        "vin": "WDAPF4CC0F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232316,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER. THE CONTACT STATED THAT THE MANUFACTURER FAILED TO PROVIDE THE PART FOR NHTSA CAMPAIGN NUMBER: 19V004000 (AIR BAGS) WITHIN A REASONABLE TIME FRAME FROM WHEN THE RECALL WAS ISSUED. THE CONTACT WAS UNCERTAIN AS TO WHEN MERCEDES-BENZ OF SANTA ROSA (7878, 2885 CORBY AVE, SANTA ROSA, CA 95407, 1-888-803-6978) WOULD RECEIVE THE PART FROM THE MANUFACTURER. THE CONTACT WAS UNABLE TO SELL THE VEHICLE FOR AN EXTENDED PERIOD OF TIME. THE MANUFACTURER WAS CONTACTED TO ADDRESS PART AVAILABILITY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *BF  CONSUMER STATED THE DELAY WITH THIS RECALL IS CAUSING AN ISSUE WITH SELLING THE VEHICLE.*JB",
        "vin": "WDAPF4CC0GP"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232524,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 7, 2019, WE WERE DRIVING OUR 2016 MERCEDES-BENZ SPRINTER 3500 RV IN HEAVY TRAFFIC DURING A RAINSTORM IN BRANSON, MISSOURI.  MULTIPLE DASH WARNING LIGHTS CAME ON INDICATING THE VEHICLE ABS BRAKING SYSTEM HAD FAILED.  THIS WAS THE SAME FAILURE WE HAD EXPERIENCED WITH THIS VEHICLE IN FEBRUARY, 2019.  THE BRANSON AREA IS EXTREMELY HILLY BEING PART OF THE OZARK ?MOUNTAINS?.  WE WERE OBVIOUSLY VERY CONCERNED ABOUT THE SIGNIFICANT DANGERS OF TRYING TO DRIVE IN THIS AREA WITHOUT A WORKING BRAKING SYSTEM.  WE WERE ABLE TO DRIVE OUR SPRINTER TO OUR RV PARK AND PARK IT.  WE SPENT ALL DAY ON MONDAY, JULY 8, GETTING THE UNIT TOWED 90 MILES TO BENTONVILLE, ARKANSAS, THE NEAREST MERCEDES-BENZ SPRINTER SERVICE CENTER.  WE SPENT ALL THE NEXT DAY AT THE SERVICE CENTER GETTING THE UNIT REPAIRED.  AGAIN, ONE OF THE REAR SPEED SENSORS WAS FOUND TO BE THE PROBLEM AND IT WAS REPLACED.   OUR REPAIR WAS DELAYED AT THE SERVICE CENTER WHILE THE MERCEDES-BENZ SERVICE CENTER WAS WAITING FOR APPROVAL ON REPAIRING THIS SPEED SENSOR.  THE SERVICE MANAGER INDICATED THAT MERCEDES-BENZ HAD ISSUED A SERVICE BULLETIN RELATED TO SPEED SENSOR FAILURES ON MERCEDES-BENZ SPRINTERS WITHIN THE LAST MONTH AND THEY HAD TO GET APPROVAL MERCEDES-BENZ IN GERMANY BEFORE MAKING REPAIRS.  THE REPAIRS WERE MADE BY MERCEDES-BENZ AS AN EXTENSION OF OUR WARRANTY.  THERE HAVE BEEN MULTIPLE REPORTS OF SPEED SENSOR FAILURES ON MERCEDES-BENZ SPRINTERS ON THE NHTSA WEBSITE AND NUMEROUS OTHER SPRINTER/SPRINTER RV WEBSITES.     SPEED SENSOR FAILURE ON THE MERCEDES-BENZ SPRINTER 3500 HAS BEEN REPORTED BY OTHERS UNDER NHTSA ID NUMBERS 11196530,11138785,11124129, 11093070, 11232230.  *TR",
        "vin": "WDAPF4CC0F9"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196660,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V077000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. MERCEDES-BENZ OF NORTHWEST ARKANSAS (2400 SE MOBERLY LN, BENTONVILLE, AR 72712, (479) 286-3010) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WDAPF4CCXG9"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "10/21/2018",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196530,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WHEEL SPEED SENSOR FAILURE. CAN CAUSE VEHICLE TO SURGE UNCOMMANDED. VEHICLE ENTERS LIMITED OR LIMP MODE. SOME FEATURES / FUNCTIONS ARE DISABLED. WHILE STATIONARY VEHICLE ATTEMPTED TO ACCELERATE (SURGE) IN SPITE OF DRIVER BRAKE APPLICATION. VEHICLE HAS HAD THIS FAILURE TWO TIMES ONCE FOR EACH REAR WHEEL SENSOR FAILURE.",
        "vin": "WDAPF4CC4G9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192350,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. BUT NO BRAKE OR TAIL LIGHTS FIXED. VEHICLE IS UNDER FACTORY WARRANTY. DEALER HAD VEHICLE FOR 3 DAYS. MADE ME DRIVE AN UNSAFE VEHICLE OFF THEIR LOT.",
        "vin": "WDAPF4CC0G9"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180968,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LIGHTS FULL OF WATER AND SHORTED OUT. SAME AS RECALL BUT NOT DEALT WITH LATER MOTORHOMES.   WATER IN TAILLIGHT AND DOES NOT WORK WITH LED  WATER IN TAILLIGHTS 2017 BUT BAFTER RECALL VINS. SHORTED WIRE HARNESS AS RECALL NOTICES  (XXXXX)   SAME ISSUE NOT RESOLVED *DT    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).    *AS",
        "vin": "WDAPF4CC2G9"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2018",
        "dateOfIncident": "10/04/2018",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138785,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 12000 MILES, BOTH REAR WHEEL SPEED SENSORS FAILED CAUSING MULTIPLE INDICATOR PANEL ALARMS, SPONGY BRAKING AND DRIVETRAIN/TRANSMISSION TO STICK IN A GEAR, IE. WOULD NOT SHIFT GEARS (STUCK IN FIRST GEAR ON INTERSTATE AT ONE POINT). *DT    THE CONSUMER STATED THE TRANSMISSION SUDDENLY DOWNSHIFTED. BOTH THE REAR RPM SENSORS WERE REPLACED. *JS",
        "vin": "WDAPF4CC4G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2018",
        "dateOfIncident": "09/02/2018",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124129,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "7-9-2018:  PULLING OUT OF MY DRIVEWAY WITH A 2018 THOR CHATEAU 24FS (WITH A 2016 SPRINTER 3500 DIESEL CHASSIS) WITH LESS THAN 9K MILES, I HAD A \"BANG\" FROM THE TRANSMISSION. IN HINDSIGHT, THIS WAS JUST AFTER A RIGHT TURN. ABOUT 300 MILES LATER AFTER A STOP LIGHT AND 90 DEGREE RIGHT TURN, THE TRANSMISSION STARTED TRYING TO SHIFT BACK AND FORTH BETWEEN 2 AND AND 3 (OR MAYBE 1ST AND 2ND) IN SOMEWHAT VIOLENT RAPID ALTERNATION. I STOPPED AND RESTARTED THE RV. RAN FINE. ABOUT 75 MILES LATER AFTER A RIGHT TURN, SAME THING. STOPPED & RESTARTED.    ODBII (SCANGAUGE) GAVE C0037 \"LEFT REAR WHEEL SENSOR\" CODE AND THE DASH LIGHTS SHOWED: CHECK ENGINE, ABS, TIRE ROTATION AND TRACTION LIGHTS...AND THEY WOULDN'T GO OFF AFTER RESTARTING ENGINE. MB DEALER REPLACED LEFT REAR WHEEL SPEED SENSOR.    9/2/2018:  DID A LEFT TURN AND STARTED HAVING SAME PROBLEM.  SAME DASH LIGHTS CAME ON.  ODBII CODE WAS C003A ('RIGHT REAR WHEEL SENSOR'). I WAS ABLE TO NURSE THE UNIT HOME, BUT IT DID HAVE THE SAME PROBLEM AFTER LEFT TURNS A COUPLE OF TIMES.    SAFETY ISSUE:  IF YOU MAKE 90 DEGREE LEFT/RIGHT TURN (DEPENDING WHICH SENSOR WENT OUT), THE SPRINTER STARTS SHIFTING BETWEEN GEARS RAPIDLY WITH GREAT NOISE. NO CHOICE BUT TO MANUALLY PUT THE TRANSMISSION INTO NEUTRAL.  AT THAT POINT, UNTIL YOU STOP THE VEHICLE AND TURN OFF/ON THE ENGINE, THE TRANSMISSION WILL NOT ENGAGE AND YOU ARE STUCK COASTING TO STOP. IF YOU JUST PULLED ONTO A BUSY INTERSECTION AND HAVE THIS PROBLEM, YOU WOULD STOP TRAFFIC AND MAY GET REAR-ENDED. THE SPRINTER'S COMPUTER OBVIOUSLY DOESN'T TAKE INTO CONSIDERATION THAT CHANGING GEARS MULTIPLE TIMES PER SECOND IS NOT GOOD AND THUS THE SPEED SENSOR MUST BE BAD. THERE SHOULD BE A THRESHOLD LIMIT THAT IF EXCEEDED, THE COMPUTER WOULD IGNORE THE SENSOR'.GO AHEAD AND TURN ON THE DASH LIGHTS, BUT DON'T TRY TO DESTROY THE TRANSMISSION...AND DON'T LEAVE THE POOR DRIVE A 'SITTING DUCK'.",
        "vin": "WDAPF4CC4G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093070,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 MERCEDES BENZ SPRINTER 35. CONSUMER WRITES IN REGARDS TO SHIFTER BEING UNABLE TO MOVE INTO PARK OR REVERSE. *LD    THE CONSUMER STATED THE TRANSMISSION FAILED. IT WAS REPAIRED, BUT THE FAILURE RECURRED ON MULTIPLE OCCASIONS. THE DEALER COULD NOT DUPLICATE THE FAILURE. *JS  *TR",
        "vin": "8BNPF4CC1GE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "04/23/2017",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089629,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. WHILE THE VEHICLE WAS STATIONARY, THE REAR LEAF SPRINGS BECAME BENT AND COULD NOT SUPPORT THE WEIGHT OF THE CARGO. THE DEALER (MYRTLE BEACH AUTOMOTIVE IN MYRTLE BEACH, SOUTH CAROLINA) WAS MADE AWARE OF THE FAILURE, BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 3,700.",
        "vin": "WDAPF4DC0G9"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "08/27/2017",
        "fire": true,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11079855,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A MOUNTAIN ROAD THE VEHICLE BEGAN TO SEND FIRE, SMOKE AND STEAM FROM  THE MOTOR COMPARTMENT UNDER THE DASH BOARD AND OVER THE WIND SHIELD, CAUSING THE MOTOR TO STOP RUNNING AND  SUBSEQUENTLY CAUSING THE BRAKES TO FAIL SENDING MY WIFE AND I DOWN A WINDING MOUNTAIN AND ULTIMATELY RESULTING IN A NEAR FATAL CRASH INTO A MOUNTAIN RETAINING WALL. THE VEHICLE WAS COMPLETELY DESTROYED. THIS VEHICLE WAS BRAND NEW WHEN PURCHASED BY US AND ONLY 5 MONTHS OLD WITH 4500 MILES (2325 MILES WERE PUT ON VEHICLE BY THE TRANSPORTER TO GET IT FROM FACTORY TO POINT OF SALE).  *TR*DT*JB*DT*TR",
        "vin": "WDAPF4CC1G9"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078951,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INFORMATION (11 COMPLAINTS)    DATE REPORTED  SEP 18, 2015  LOCATION  WOODINVILLE, WA  MANUFACTURER  MERCEDES-BENZ USA, LLC - DBA SPRINTER  VEHICLE  2015 MERCEDES SPRINTER 3500  TRANSMISSION  NOT SPECIFIED  DRIVETRAIN  NOT SPECIFIED  FUEL TYPE  NOT SPECIFIED  OCCURENCES  0  CRASH INVOLVED  N  INJURIES  0  DEATHS  0  SOURCE  NHTSA WEBSITE        I BOUGHT USED WINNEBAGO NAVION WITH MERCEDES SPRINTER CHASSIS AND CHROME REAR OUTSIDE DUAL WHEELS DOES NOT HAVE ACCESS TO THE INNER DUAL TIRE TO CHECK AND CHANGE THE AIR PRESSURE. I AM 66 YEAR OLD FEMALE AND HAVE NO WAY TO AIR MY INNER DUAL WHEELS DUE TO DESIGN FLAW. WINNEBAGO PROVIDES A RUBBER TUBE TO BE USED AS A TOOL TO REMOVE AND REINSTALL THE TIRE VALVE CAPS ON THE INNER WHEEL BUT THE ANGLE AND LENGTH OF THE INNER TIRE VALVE STEM MAKES THE JOB OF REINSTALLING THE VALVE CAP VIRTUALLY IMPOSSIBLE WITHOUT REMOVAL OF THE OUTER CHROME DUAL WHEEL. AS A RESULT, I CAN NOT CHECK THE TIRE PRESSURE ON THE INNER DUAL TIRE  OR EVEN AIR THE TIRE BY MYSELF, CREATING A POTENTIAL SAFETY ISSUE. WINNEBAGO AND MERCEDES REFUSE TO CORRECT THIS PROBLEM AND WILL NOT AUTHORIZE THE USE OF VALVE STEM EXTENDERS TO MAKE CHECKING TIRE PRESSURE MORE USER FRIENDLY. REMOVAL OF THE OUTER CHROME WHEEL IS A JOB THAT SHOULD ONLY BE DONE BY PROFESSIONALS WITH THE PROPER EQUIPMENT, NOT BY THE VEHICLE OWNER.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064317,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPERATION OF BOTH FRONT TIRES ON MERCEDES 3500 SPRINTER. THIS TRUCK HAS HAD VERY LIGHT USE AND TRAVELS 17K PER YEAR. THE PHOTOS ARE ATTACHED.",
        "vin": "WD3PF4CCXGP"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2018",
        "dateOfIncident": "07/26/2017",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062574,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR VIEW WAS SUBJECT TO A RECALL (NHTSA NOTICE - 17V-262) WHICH INVOLVED THE RADIO/CELL PHONE VOLUME & FUNCTION CONTROLS MOUNTED IN THE STEERING WHEEL. WINNEBAGO'S FIX WAS JUST REMOVING THE CONTROL. WHICH WAS A SAFETY FEATURE IN THAT WE DIDN'T HAVE TO TAKE OUR EYES OFF THE ROAD TO ANSWER THE PHONE OR ADJUST THE RADIO. IT SEEMS UNACCEPTABLE THAT WINNEBAGO'S ONLY ACTION WAS TO REMOVE THE CONTROL AND NOT REPLACE IT! MINNESOTA'S AG'S OFFICE RECOMMENDED CONTACTING NHTSA AND FILE A COMPLAINT.",
        "vin": "WDAPF4CC0G9"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "04/08/2016",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052317,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITION SHUTS DOWN AFTER A COUPLE OF HOURS. IT JUST COMES FROM THE VENTS HOT AIR AND STAUNCHY (BAD ODORS) ODORS. CONTACT MERCEDES BENZ AND THEY SAY THAT THEY AWARE OF THE PROBLEM BUT ARE NOT WILLING TO FIX IT.",
        "vin": "WDAPF4CC3F9"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11016161,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER'S SIDE AND PASSENGER SIDE, AND THE CARGO SLIDING DOOR, HANDLES PINCH FINGERS.  THE WAY THE HANDLE LATCH OPENS PROVIDES THE OPPORTUNITY FOR YOUR FINGERS/HAND TO SLIDE INTO THE OPENING PART OF THE LATCH, AND GET SEVERELY PINCHED. BLEEDING WAS SOMEWHAT SEVER RECENTLY, WITH BLOOD STREAMING DOWN THE VEHICLE'S DOOR BODY. THE SKIN ON MY LEFT SMALL FINGERTIP WAS PINCHED ARE REMOVED, CAUSING SUBSTANTIAL BLEEDING.  I HAD TO OFTEN CHANGE THE BANDAGES TO MAINTAIN PRESSURE. VEHICLE WAS STATIONARY, AND OCCURRED WHILE OPENING SLIDING CARGO DOOR LATCH",
        "vin": "WDAFP4CD8GP"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/31/2017",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011853,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC - DBA Sprinter",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO SLAM ON BRAKES TO AVOID HITTING A CAR THAT PULLED OUT IN FRONT OF ME AS I APPROACHED A RED LIGHT. REAR PASSENGER BRAKE LINE FAILED AS A RESULT OF THE STOP. PUMPING BRAKES RESULTED IN FLUID BEING PUMPED OUT OF THE LINES.",
        "vin": "WD3FF4CC1GP"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "03/29/2017",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980246,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. PRIOR TO PURCHASING THE VEHICLE  THE CONTACT NOTICED RUST ON THE REAR BUMPER AND CORROSION UNDERNEATH THE VEHICLE. IN ADDITION, THE CONTACT NOTICED THAT THE WEATHER CAULKING WAS NOT SEALED AND LEAKED WATER ON THE BUMP-OUT LOCATED BETWEEN THE HOLES OF THE VEHICLE. THE DEALER PROVIDED THE CONTACT WITH A CONTRACT THAT INDICATED A 2016 FOREST RIVER PRISM 2200 LE. THE DEALER WOULD NOT DIAGNOSED OR REPAIR THE VEHICLE; THEREFORE, THE CONTACT REFUSED TO ACCEPT THE VEHICLE FROM THE DEALER IN THAT CONDITION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 500. UPDATED 06/13/17*LJ  CONSUMER STATED SALES DEALER MADE ME WAIT ONE WEEK AFTER PURCHASE \"TO GET IT READY\" THEY SAID. HOWEVER THE SCREEN DOOR FELL APART WHEN HE OPENED IT. A MAGNET WAS MISSING. SO I BELIEVE THEY MADE ME WAIT A WEEK TO NOT HAVE THE 3DAY RIGHT TO RECIND. UPDATED 9/27/18*JB",
        "vin": "WDAPF4CCXG9"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919917,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 MERCEDES-BENZ SPRINTER 3500. THE CONTACT STATED THAT THE TAIL LIGHTS FAILED TO ILLUMINATE. THE DEALER STATED THAT THE MANUFACTURER HAD NOT YET SUPPLIED THE PARTS AND REMEDY FOR NHTSA CAMPAIGN NUMBER: 16V465000 (EXTERIOR LIGHTING). THE CONTACT RECEIVED A RECALL NOTICE FROM THE MANUFACTURER MONTHS AGO. THE CONTACT WAS UNCERTAIN OF WHEN THE PARTS WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "WDAPF4CC1G9"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2016",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Daimler Vans USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891844,
        "products": [
            {
                "manufacturer": "Daimler Vans USA, LLC",
                "productMake": "MERCEDES-BENZ",
                "productModel": "SPRINTER 3500",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS EXCESSIVE BRAKE PEDAL FREE-PLAY TRAVEL BEFORE BRAKING OCCURS.  ALTHOUGH THE MANUFACTURER'S OWNERS MANUAL WARNS AGAINST PUMPING THE BRAKE PEDAL TO STOP THE VEHICLE, IT IS IMPERATIVE TO DO SO ESPECIALLY IN AN EMERGENCY SITUATION. IF THE DRIVER HAS TO HESITATE TO MAKE A DECISION ON WHETHER TO BRAKE OR ACCELERATE, THE FREE-PLAY TRAVEL WILL NOT ALLOW THE DRIVER ENOUGH TIME TO BRAKE SAFELY. THE VEHICLE IS DIFFICULT TO BRING TO A SAFE STOP UNLESS THE BRAKE PEDAL IS PUMPED AT LEAST TWO PUMPS BEFORE IT FEELS LIKE AND BRAKES LIKE A NORMAL SYSTEM. THE EXISTENCE OF THIS CONDITION WAS CONFIRMED BY A LOCAL MERCEDES DEALERSHIP TECHNICIAN. HIS RESPONSE WAS, \"THIS IS NORMAL FOR THE 1-TON CHASSIS TO HAVE A SOFT, SPONGY PEDAL AND MAY GO TO THE FLOOR BEFORE THE BRAKE GRABS, BUT IN A EMERGENCY SITUATION IT WILL STOP EVEN IF THE PEDAL IS ALMOST TO THE FLOOR.\"",
        "vin": "WDAPF4CCXGP"
    }
]