[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/18/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457288,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Nissan Pathfinder. The contact stated while driving 5 MPH, the brake pedal was depressed and went to the floorboard. The contact stated that the failure had since been consistent whenever the brake pedal was depressed. There was no warning light illuminated. The vehicle was taken to the local dealer however, the mechanic was unable to determine the cause of the failure. The vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 32,200.",
        "vin": "5N1AR2MN6GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/08/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448298,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The hood does not stay latched.  Periodically it comes unlatched from its locked position or it will not lock down when being closed after an oil change. The latch is faulty and if it comes undone and it is windy I am afraid it will fly up and smash the windshield and or detach and kill someone! It has happened more than once. This is the latest incident.",
        "vin": "5n1ar2mm9gc"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "12/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447689,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunroof spontaneously exploded. While driving at approximately 35 miles per hour on a smooth, relatively level, paved road, the sunroof spantaneously exploded.  The elevation above sea level was less than 200ft, and the outside temperature was in the mid 30s.  The sunroof was not hit by an object.  The explosion sounded like a gunshot, and we truly believed that our car had been shot at. The incident occurred in good weather in day light conditions.  Had this incident occurred on a highway, at night, or in adverse weather conditions, this event could have easily resulted in a serious accident. It took approximately 10 minutes for us to realized that the explosive sound had come from the roof of the car.  Our insurance company, Allstate, covered the cost of a new sunroof minus a deductible.    I have learned from online research that exploding sunroofs are not uncommon, and that NHTSA has been investigating them for several years.  We trust our government to establish timely standards to ensure public safety.  NHTSA needs to take timely action to stop this phenomenon.  Inaction has the potential to cause public harm, and would be a failure of the DOT to do its job ensuring public safety.",
        "vin": "5N1AR2MMXGC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "10/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440170,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger side air bag indicator is off all the time even with an adult in the seat. The red blinking indicator light flashes for the air bag on the control panel. The air bag cannot be manually turned on or off. If in a crash I do not know if the air bag will deploy. Your site shows 0 recalls other sites show a sensor recall. What do I do?",
        "vin": "5N1AR2MM6GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431131,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving 70 mph on the turnpike, the hood of my vehicle came up and shattered my windshield, bent my hood and roof, amongst other damage. Despite the hood covering my windshield, I was able to safely navigate to a pull-off on the road. My passenger and I were shook up, but not injured. It had been weeks since I had last opened my hood. I have the vehicle at the collision center now.  I should  hear from the claims adjuster tomorrow.",
        "vin": "5N1AR2MMXGC"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427702,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Nissan Pathfinder. The contact stated that the hood of the vehicle would not properly secure and latch when closed. After having the oil changed, the mechanic was unable to secure the hood. The cause of the failure was not determined. The local dealer and manufacturer were not notified of the failure. The failure mileage was 44,000.",
        "vin": "5N1AR2MM5GC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424875,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "My car hit 62,000 miles, it started having transmission issues. It shakes, makes large noises, the car tries to stall, having issues accelerating, and loss power. I am concerned that the car will turn off or broke down while driving",
        "vin": "5N1AR2MN4GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/10/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402619,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED MAKING A CLICKING LIKE SOUND WHEN THE AIR CONDITIONER IS ON. THE SOUND WAS NOTICED WHILE PARKED IN MY DRIVEWAY.  I TOOK THE VEHICLE TO NISSAN DEALERSHIP WHICH STATED IT WAS THE FAN ASSEMBLY THAT NEEDED REPLACING AT $1000.00 THE VEHICLE DON'T HAVE 65000 MILES.",
        "vin": "5N1AR2MM6GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398173,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FAN BEARINGS IN THE TWIN FAN SHROUD HAVE FAILED AND ARE CREATING A LOUD NOISE AND HAVE BEEN KNOWN TO LEAD TO ENGINE OVERHEATING AND POTENTIAL ENGINE TROUBLE.  THE NHTSA AND NISSAN HAVE PUT OUT A TSB (NTB17-100) IN OCT 2017.  ALTHOUGH MY VEHICLE IS PAST WARRANTY SEARCHING THE WEB IT APPEARS THIS HAS BEEN A VERY BIG PROBLEM FOR NISSAN PATHFINDERS.  BECAUSE THE COMPLETE FAN SHROUD (2 FANS-RADIATOR AND COOLING FANS) ALONG WITH A COMPUTER MODULE ARE PART OF THE FINAL ASSEMBLY THE COST TO REPAIR IS SIGNIFICANT ($800).  A FAN REPLACEMENT ALONE WOULD BE MUCH LESS EXPENSIVE BUT NISSAN ONLY PROVIDES A FULL ASSEMBLY VS COMPONENT FIX.",
        "vin": "5N1AR2MN3GC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384700,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 21 DEC 2020 WE WERE IN A ACCIDENT WITH A DEER WE WEAR GOING ABOUT 80MPH WHEN THE DEAR CAME OUT OF NO WEAR AND WE HIT IT HEAD ON AND NEITHER ONE OF THE AIR BAGS DEPLOYED MY HUSBAND HIT HIS HEAD ON STEERING WHEEL AND NEITHER ONE THE AIRBAGS DEPLOYED  I WAS SITTING IN PASSENGER SEAT AND NOTHING EITHER THIS WAS ON THE HIGHWAY AT NIGHT TIME",
        "vin": "5N1AR2MNXGC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/14/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374662,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS BOUGHT BRAND NEW, NO ACCIDENTS, AND ONLY HAS LESS THAN 53 MILES TO BE A 2016 PATHFINDER. SO TELL ME WHY THE CHEAP MOTOR FAN THAT NISSAN PUT IT IN STARED MAKING A CLANG NOISE EVERYTHING I WOULD TURN THE AIR OR HEATER ON. LIKE NISSAN WHAT IS THIS. WITH ALL THIS COMPLAINS ABOUT THE SAME ITEM, YOU GUYS SHOULD PUT A RECALL ONTHIS ITEM. IT'S ASHAMED SO FAR BAD EXPERIENCE WITH TO VEHICLES FROM YOU GUYS. EVEN ON THE NISSAN TITAN THAT WE BOUGHT BRAND NEW AT 3 MONTHS SOMETHING WAS WRONG WITH THE ENGINE AND GAS TANK AND YOU GUYS DID NOT WANT TO TAKE RESPONSIBILITY FOR THE VEHICLE. KNOWING THAT YOU GUYS COULD NOT EVEN DETERMINE WHY THE TRUCK WAS NOT WORKING. YOU GUYS EVEN BROUGHT IN AN EXPERT FROM THE NISSAN FACTORY AND STILL DID NOT FIND WHY IT WAS NOT WORKING. KNOWING WHAT WAS HAPPENING YOU GUYS WOULD NOT EVEN TRADE IN THE TRUCK FOR ANOTHER ONE. WE ENDED UP FIGHTING WITH NISSAN AND RETURNED THE TRUCK BACK. TO TOP THAT OFF I RECEIVED A BILL FOR HALF THE TRUCK PRICE. I WOULD NEVER RECOMMEND NISSAN.",
        "vin": "5N1AR2MN4GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362670,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS ENTERING THE DRIVE WAY WHEN THE BRAKE PEDDLE WENT TO THE FLOOR AND THE VEHICLE ACCELERATED. THE VEHICLE WENT OVER A PATIO AND STRUCK AN ABOVE GROUND POOL.  THE POOL WAS DESTROYED.  THE VEHICLE STOPPED AFTER HITTING THE POOL AND CAME TO REST WITH THE FRONT TIRES OFF THE WALL OF THE PATIO.THE FRONT RIGHT OF THE VEHICLE WAS RESTING ON THE UNI-BODY FRAME JUST BEHIND THE FRONT TIRES.",
        "vin": "5N1AR2MNXGC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/03/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362566,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FADE.  COMING TO A STOP BRAKE PEDAL WILL FADE CAUSING THE PEDAL TO TOUCH FLOOR FORCING YOU TO LET OFF AND REAPPLY THE BRAKES. WHEN STOPPED AT INTERSECTION BRAKE PEDAL SLOWLY GOES TO FLOOR CAUSING VEHICLE TO START MOVING RESULTING IN COLLISION WITH VEHICLE IN FRONT",
        "vin": "5N1AR2MN9GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352231,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 NISSAN PATHFINDER, STARTED MAKING LOUD CLANKING NOISES AND VIBRATING IN THE FRONT OF THE VEHICLE WHEN THE AIR CONDITIONING WAS ON (STAIONARY AND IN MOTION). THE COOLING FAN NEEDED TO BE REPLACED WITH ONLY 33K ON THE ODO.  REALLY SUPRISED THAT IS WAS SO EXPENSIVE AND NOT COVERED UNDER WARRANTY - 6 MONTHS OVER 3 YEARS.",
        "vin": "5N1AR2MN9GC"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338365,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC COOLING FAN BEARINGS FAILED AT 62,000 MILES.  THE NISSAN DEALERSHIP THAT DIAGNOSED THE PROBLEM STATED THAT IT IS COMMON FOR THIS VEHICLE TO EXPERIENCE THIS PART FAILURE.  I REPLACED AT MY OWN EXPENSE WITH AN AFTERMARKET ASSEMBLY THAT HAS A LIFETIME WARRANTY. IT DOESN'T MAKE SENSE TO REPLACE WITH ANOTHER NISSAN PART THAT WILL FAIL IN ANOTHER 50,000 +/- MILES.    ALSO, BRAKE PEDAL WILL FADE WHEN STOPPED AT AN INTERSECTION WITH 62,000 MILES ON VEHICLE. THE NISSAN DEALERSHIP CHECKED ALL BRAKE COMPONENTS AND COULD ONLY SURMISE IT MUST BE THE MASTER CYLINDER. THEY EVEN CONTACTED NISSAN FOR THEIR OPINION, WHICH THEY TOO SUGGESTED REPLACING THE MASTER CYLINDER. AFTER TWO BRAND NEW MASTER CYLINDERS, THE PROBLEM HAS NOT BEEN FIXED AND WILL BE AN ONGOING ISSUE FOR MY VEHICLE.    ALSO, THE REAR A/C LINES THAT TRAVEL UNDERNEATH THE VEHICLE DEVELOPED A HOLE AT ONE OF THE MOUNTING POINTS.  LOST ALL FREON ON TWO OCCASIONS BY THE TIME THE DEALERSHIP FOUND THE LEAKING AREA.  THE DEALERSHIP STATED THAT THIS TOO IS COMMON ON THIS VEHICLE STYLE AND IS A DESIGN FLAW.  WITH FREON BEING BAD FOR THE EVIRONMENT, ONE WOULD WONDER HOW A MANUFACTURER WOULD BE ALLOWED TO LET THIS HAPPEN.",
        "vin": "5N1AR2MM2GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324324,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A STREET LIGHT, THE BRAKE PEDAL WENT DOWN TO THE FLOOR AND THE CAR STARTED MOVING FORWARD.  I HAD TO PUMP THE BRAKE TO STOP THE CAR AND PUT IT IN PARK.  VERY CLOSE TO ROLLING INTO THE INTERSECTION.  *TR",
        "vin": "5N1AR2MN3GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323259,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT BRAKE SYSTEM ISSUE.  WHILE STOPPED, THE BRAKE PEDAL WILL FADE CAUSING THE CAR TO CREEP AND THE BRAKE PEDAL GOES TO THE FLOOR FORCING DRIVER TO RELEASE AND REAPPLY BRAKE TO STOP VEHICLE FROM MOVING.  HAPPENS MOSTLY WHEN CAR IS HOT AND HAS BEEN DRIVEN FOR HOUR OR MORE.  NISSAN DEALERSHIP DIAGNOSED AND FOUND NO FLUID LEAK. RECOMMENDED REPLACING MASTER CYLINDER.  CYLINDER REPLACED AND ISSUE PERSISTS.",
        "vin": "5N1AR2MN3GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310859,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTRY 02/23/2020:  2016 NISSAN PATHFINDER WITH ABOUT JUST 36,200 MILES  HAVE ENGINE COOLING FAN PROBLEMS - LOUD CLACKING NOISE AND ENGINE TEMPERATURE GOES UP OVERHEATING THE ENGINE AND SHAKING/VIBRATING STEERING WHEEL AND BRAKE PEDAL. IT HAPPENS BOTH WHEN DRIVING AND RUNNING ENGINE IN PARK. THE PROBLEM OCCURS MORE OFTEN WHEN HEATER IS TURNED ON.",
        "vin": "5N1AR2MM1GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307419,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TURNED ON MY AC, IT SOUNDS LIKE A HELICOPTER.  I WAS TOLD IT'S THE COOLING FAN AND THAT IT'LL COST OVER $1000 TO FIX.  THIS SEEMS TO BE A COMMON ISSUE WITH THESE CARS.  MY CAR HAS 80,000 MILES.  MY 2007 CAMRY HAS OVER 290,000 AND NEVER HAD THIS ISSUE.  I ALSO OWNED A HONDA PILOT WITH OVER 300,000 AND NEVER AN ISSUE.",
        "vin": "5N1AR2MN9GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302149,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 NISSAN PATHFINDER,   STARTED MAKING LOUD CLANKING NOISES AND VIBRATING IN THE FRONT OF THE VEHICLE WHEN THE AIR CONDITIONING WENT ON.  DID NOT MATTER IF THE VEHICLE WAS STATIONARY OR IN MOTION. FIRST NOTICED AFTER EXITING THE HIGHWAY AND NOTICED THE TEMP NEEDLE WAS SLOWING CLIMBING.  THE BEARING ON ONE OF THE COOLING FANS CRAPPED OUT WITH ONLY 49,000 MILES. WAS LUCKY TO HAVE CAUGHT IT BEFORE IT OVERHEATED OR BLEW THE MOTOR.  AN EXPENSIVE REPAIR NOT COVERED BY THE DEALERSHIP.",
        "vin": "5N1AR2MM7GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301626,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DON'T EVEN HAVE THE CAR A YEAR! LOUD NOISE UNDER HOOD LIKE FAN BANG. CONSTANT ISSUE ON OTHER PATHFINDERS AS WELL. HAD TO PAY $1100 FOR COOLANT FAN REPLACEMENT THAT WAS OVERHEATING ENGINE! SHOULD RECEIVE SOME TYPE OF REIMBURSEMENT AS THIS IS AN ONGOING ISSUE WITH THESE VEHICLES! HAZARD AS CAR CAN CATCH ON FIRE FROM OVERHEATING!",
        "vin": "5N1AR2MM2GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300898,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC COOLING FAN BEARINGS BAD (85,000 MILES). RESEARCH INDICATES THIS IS A COMMON PROBLEM THE DEALERS ARE AWARE OF, HOWEVER HAVE NOT ISSUED A RECALL, EXTENDED WARRANTY, OR OTHER CUSTOMER ASSISTANCE",
        "vin": "5N1AR2MM3GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A LOUD FAN NOISE COULD BE HEARD COMING FROM THE ENGINE SHAKING THE CAR.  IT HAS BEEN DETERMINED THAT THE RADIATOR COOLING FAN HAS GONE BAD, WITH ONLY 60,000 MILES CURRENTLY ON THE VEHICLE.",
        "vin": "5N1AR2MM0GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298361,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE COOLING FAN BEARING IS BAD AND NOW I HAVE TO REPLACE THE FAN WHICH IS $1,000 WORTH OF WORK AND I ONLY HAVE 34,000 MILES ON MY VEHICLE. EVERY MECHANIC AND AUTO PARTS PERSON SAID THIS SHOULD NOT HAVE TO BE REPLACED THIS EARLY AND WITH THE MILEAGE I HAVE ON MY VEHICLE",
        "vin": "5N1AR2MM9GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/25/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291191,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER/AC COOLING FAN CRAPPED OUT AT 45K.  BEARINGS/BUSHINGS CAUSING LOUD, CRUNCHING NOISES WHEN HEAT OR AC IS ON.  THE SAME THING HAPPENED TO ME ON MY 2013 PATHFINDER.",
        "vin": "5N1AR2MM6GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "12/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287432,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY PATHFINDER IN TO HAVE IT INSPECTED FOR A LOUD RATTLING WHEN THE HEAT IS ON ONLY TO BE TOLD MY CAR HAS COOLING FAN FAILURE. IT HAS A LITTLE OVER 57,000 MILES ON THE VEHICLE. UNFORTUNATELY, MY 90 DAY WARRANTY HAS LAPSED.",
        "vin": "5N1AR2MNXGC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282670,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I DON'T RECALL THE EXACT DATE OF THE FIRST TIME I TOOK IT. TAKEN THE VEHICLE TWICE AND HAD TO INSIST MULTIPLE TIMES IN ORDER FOR NISSAN TO KEEP THE CAR AND KEEP TESTING AS WELL AS FOR THEM TO OPEN A CASE. THE SCREEN FOR THE 2016 PATHFINDER HAS TURNED SOLID BLUE A FEW TIMES BUT NOT SURE WHAT CAUSES IT. DEALERSHIP BLAMED THE CELL PHONE WHICH I DON'T BELIEVE THAT TO BE TRUE. THEY WILL NOT FIX IT BECAUSE THEY SAY THEY DON'T KNOW HOW TO DUPLICATE IT SO THERE'S NOTHING THAN CAN DO. THIS SCREEN IS WHERE CLIENTS LIKE MYSELF SEE THE FULL VIEW OF THE OUTSIDE OF THE VEHICLE (SAFETY) AS WELL AS OTHER PARTS GPS, A/C & HEATER TEMPERATURE CONTROL, RADIO CHANNELS, WEATHER ETC. I REFUSE TO BELIEVE NO ONE ELSE HAS HAD THIS ISSUE AND I REFUSE TO IT'S THE PHONES FAULT (MANY CELL PHONE USERS WHICH IS A LARGE NUMBER WOULD HAVE BEEN SENDING TONS OF COMPLAINTS). I STRONGLY BELIEVE IT'S A NISSAN ISSUE WITH THE CAR THAT I THINK IT'S A SAFETY ISSUE IF THE SCREEN TURNS BLUE WHEN BACKING UP",
        "vin": "5N1AR2MN8GC"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279686,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED NISSAN PATHFINDER IN JULY 2019.   WHEN I PURCHASED THE VEHICLE I ALSO PURCHASED A FULL-COVERAGE WARRANTY THROUGH THE DEALERSHIP, HOWEVER, THE DEALERSHIP CLAIMS THAT THEY HAVE NO RESPONSIBILITY TO HELP ME. THEIR REASONING IS THAT THEY ARE NOT A NISSAN DEALER YET, THEY SOLD ME A VEHICLE THAT IS POTENTIALLY DANGEROUS FOR MY CHILDREN TO BE IN AND REFUSE TO HONOR THE WARRANTY OR HELP OTHERWISE.   THE AIRBAG OFF LIGHT WILL TURN ON WHILE ADULTS ARE SITTING IN THE FRONT PASSENGER SEAT.  IT ALSO COMES ON EVEN WHEN MY 160 LB SON IS IN THE FRONT SEAT.  ACCORDING TO MY RESEARCH THE WAS A RECALL ON THE AIRBAGS ON THIS PARTICULAR VEHICLE A FEW YEARS AGO THAT WAS SUPPOSEDLY PREVIOUSLY ADDRESSED, HOWEVER THIS CONTINUES TO BE AN ISSUE. ADDITIONALLY  I WAS SOLD A VEHICLE WITH NO INSULATION IN THE DOORS AND NO SEALS ON THE BOTTOMS OF THE DOORS.  THE INSIDE OF THE VEHICLE (ESPECIALLY NOW THAR IT'S VERGING ON WINTER) GETS FRIGID AND YOU CAN EVEN FEEL THE WIND COMING THROUGH THE WINDOW CONTROLS AND BUTTONS ON THE DOORS.",
        "vin": "5N1AR2MM1GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268720,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK ON THE INTERSTATE AND MY SUNROOF EXPLODED. GLASS WAS EVERYWHERE INSIDE THE VEHICLE AND MYSELF. IT SOUNDED LIKE A SHOTGUN.",
        "vin": "5N1AR2MN3GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267644,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR LOSE THE POWER AND ONLY WAS 25MILES BY HOURS SPEED, THIS HAPPEN RUNNING IN THE HIGHWAY.",
        "vin": "5N1AR2MM2GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245458,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLING FAN FAILURE. WIDESPREAD REPORTS OF COOLING FAN BEARINGS FAILING FROM 30-60 THOUSAND MILES. IT VIBRATES AND CAN DAMAGE THE RADIATOR CAUSING A CATASTROPHIC FAILURE. IF YOU LOOK IN FORUMS THIS IS EXTREMELY COMMON. I HAVE THIS ISSUE AS WELL AND IT COMES ON SUDDENLY.",
        "vin": "5N1AR2MN9GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "08/06/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242027,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: RECALL 16V244000   NISSAN PATHFINDER WAS RECALLED TO FIX PASSENGER AIRBAG SENSOR.  WITHIN 2 MONTHS AFTER REPAIR PROBLEM BEGAN AGAIN INTERMITTENTLY.  APPROX 30% OF STARTS SHOWED PASS AIRBAG OFF IN SPITE OF PASSENGER IN PLACE.  THIS WOULD CORRECT BY RESTARTING VEHICLE.  THIS WAS REPORTED TO DEALER AT EVERY 5000 MILE SERVICE AND HAD ADJUSTMENTS MADE A FEW TIMES.  AIRBAG SENSOR WOULD BE FINE FOR A FEW WEEKS, THEN START ACTING UP AGAIN.  THE LAST DEALER VISIT (55000 MILES) NO PROBLEM WAS FOUND.  THIS NOW HAPPENS ON 75 % OF VEHICLE STARTS, AND SIMPLY RESTARTING IS NOT ALWAYS EFFECTIVE.  REPEATED RESTARTS (3-4) USUALLY CORRECTS PROBLEM, OR AT LEAST TURNS OFF THE \"AIRBAG DISABLED\" LIGHT ALTHOUGH WE SOMETIME NEED TO TAKE SHORT TRIP WITHOUT AIRBAG PROTECTION FOR MY WIFE.  I THINK ANOTHER RECALL IS IN ORDER FOR THIS VEHICLE.    THE CONSUMER STATED THE AFTER BEING REPAIRED, THE AIRBAG FAILED 4 DAYS LATER. *JS    THE CONSUMER STATED THE MANUFACTURER DETERMINED THE AIRBAG WAS OPERATING AS DESIGNED. THE CONSUMER'S WIFE WAS CONSIDERED A SMALL ADULT SO, THE AIRBAG DID NOT ACTIVATE. *JS",
        "vin": "5N1AR2MM3GC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/17/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232769,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE COMING TO A STOP BRAKE PEDAL WILL FADE CAUSING THE PEDAL TO TOUCH THE FLOOR AND FORCING THE DRIVER TO RELEASE AND REAPPLY BRAKES.   ALSO WHILE USING CRUISE CONTROL ON THE HIGHWAY, THE VEHICLE BEGINS TO RAPIDLY ACCELERATE AND DE-ACCELERATE CAUSING A 'JERKING' MOTION",
        "vin": "5N1AR2MN9GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209375,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 NISSAN PATHFINDER WITH 81,000 MILES.  DUAL COOLING FANS BEHIND RADIATOR HAVE LOUD RATTLE, ESPECIALLY WHILE A/C IS BEING USED.  NISSAN OF CHATTANOOGA EAST STATES COMMON FAILURE AT BEARINGS INSIDE THE DUAL COOLING FANS BEHIND RADIATOR.  THIS IS NOT COVERED BY WARRANTY BUT IS SO VERY COMMON THERE ABSOLUTELY SHOULD BE A RECALL BY NISSAN",
        "vin": "5N1AR2MN8GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209388,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A RATTLE BEGAN IN THE FRONT OF THE CAR NEAR THE ENGINE. AFTER TAKING THE CAR TO NISSAN FOR AN OIL CHANGE, THEY NOTICED THAT THE COOLANT FAN WAS GOING BAD AND SHAKING. I WAS TOLD IF NOT REPLACED, IT WOULD DAMAGE THE TRANSMISSION FAN. I WAS QUOTED $873 TO GET A NEW FAN ON A CAR THAT IS LESS THAN 3 YEARS OLD THAT HAS NEVER BEEN INVOLVED IN ANY ACCIDENT TO WHICH COULD HAVE CAUSED THIS.",
        "vin": "5N1AR2MN0GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206408,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE COOLING FAN BROKE AT <60K MILES-RATTLING SO MUCH NEARLY PUNCTURED RADIATOR",
        "vin": "5N1AR2MM3GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194364,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHTS STARTED BLINKING , WHEN CALLING THE DEALERSHIP MY NISSAN PATHFINDER WAS NOT INCLUDED IN THE RECALL. NO ACCIDENT ON THE CAR AND THE CAR WAS PURCHASE NEW AUGUST 2016 .",
        "vin": "5N1AR2MN0GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185964,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE WITH THE HEAT ON. A RANDOM NOISE APPEARED THAT I HAVEN'T HEARD BEFORE SO I TURNED OFF THE RADIO AND STILL HEARD THE NOISE. AFTER SHUTTING OFF THE HEATER, THE NOISE STOPPED. I TURNED THE HEATER BACK ON AND THE NOISE APPEARED AGAIN BUT STOPPED. BROUGHT IT TO A MECHANIC AND THEY SAID THAT IT WAS THE FAN. I ASKED FOR A PRICE AND I COULDN'T BELIEVE THE INFORMATION I WAS GIVEN. I THEN DID RESEARCH AND NOTICED THAT THERE ARE MANY COMPLAINTS ABOUT THE FAN AND THE NOISE. NISSAN SHOULD BE HELD RELIABLE /ACCOUNTABLE FOR THIS MALFUNCTION.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184663,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I NOTICED UNEXPLAINED SOUNDS FROM THE REAR OF THE VEHICLE. I PULLED OVER AND A PASSENGER IN THE BACKSEAT OPENED AND CLOSED THE DOOR. WHEN THE DOOR WAS SHUT THE NOISE WAS HEARD. THE CATION WAS REPEATED AND WE NOTED THE NOISE WAS COMING FROM OVERHEAD IN THE BACKSEAT AREA. I GOT OUT OF THE CAR AND FOUND THAT THE PANORAMIC SUNROOF HAD EXPLODED FOR NO APPARENT REASON. NOTHING HAD COME IN CONTACT WITH IT. THE BROKEN GLASS WAS CONTAINED IN THE CLOSED SHADE. *DT*JB",
        "vin": "5N1AR2MMXGC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184673,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIATOR FAN BEGAN MAKING LOUD NOISE WHEN AC OR HEAT IS ON. THE SOUND AND VOLUME OF THE NOISE VARIES BUT DOESN'T MATTER WHETHER THE VEHICLE IS STATIONARY. MECHANIC SAID IT IS THE RADIATOR FAN ASSEMBLY AND THAT HE'S REPLACED A DOZEN ON THIS MODEL. IT APPEARS TO BE A VERY COMMON ISSUE THAT NISSAN SHOULD HAVE ISSUED A RECALL FOR. $800 REPAIR.",
        "vin": "5N1AR2MN7GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 PATHFINDER NISSAN. CONSUMER WRITES IN REGARD TO REIMBURSEMENT FOR PART REPLACEMENT THAT WAS CAUSED FROM A MANUFACTURING ISSUE. *AS  *TR",
        "vin": "5N1AR2MM1GC"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180953,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY WHEN MY CAR STARTED VIBRATING (MUCH LIKE THE FEELING OF WHEN A CAR NEEDS TO GET THE WHEELS ALIGNED). I GOT OFF OF THE HIGHWAY TO TAKE IT TO A NEARBY NISSAN DEALERSHIP SERVICE PARTS SHOP TO HAVE IT LOOKED AT. ABOUT A BLOCK AWAY FROM THE DEALERSHIP, WHEN I WAS DRIVING, MY FRONT RIGHT WHEEL FLEW OFF OF MY VEHICLE. MY CAR WAS THEN LYING ON THE END OF THE AXLE AND WAS NOT DRIVABLE AND STUCK IN THE ROAD. I WAS AT THE VERY LEFT SIDE OF THE STREET AND LUCKILY THE WHEEL DID NOT HIT ANOTHER VEHICLE OR PERSON AND CAUSE ANY INJURIES. THIS PATHFINDER IS A 2016 AND I HAVE HAD IT FOR 2 YEARS. IT HAS 17,000 MILES ON IT AND I HAVE NOT HAD ANY ISSUES WITH THE CAR SINCE I HAVE HAD IT UNTIL NOW. I HAVE NOT NEEDED TO HAVE THE TIRES ROTATED YET BECAUSE THE TREAD ON THE TIRES LOOK GOOD AND NOT WORN DOWN. I HAVE NOT NEEDED TO HAVE THE WHEELS ALIGNED EITHER. SO, THE TIRES HAVE NEVER BEEN TAKEN OFF OF THIS VEHICLE. NISSAN CLAIMS THAT THEY THINK THIS ISSUE IS RELATED TO LOOSE LUG NUTS. I CLAIM THAT THIS ISSUE DID NOT START UNTIL I WAS ON THE HIGHWAY HALFWAY HOME. I CLAIM THAT THIS ISSUE WAS FROM DEFECTIVE LUG NUTS. JUST 2 YEARS BEFORE, IN 2014, THERE WAS A RECALL NISSAN HAD RELATED TO LUG NUTS FOR PATHFINDERS AND THAT WAS RESOLVED, HOWEVER, IT IS REASONABLE TO THINK THAT THIS COULD BE ANOTHER POTENTIAL RECALL ISSUE. MY ADVICE FOR ANY ONE HAVING A 2016 PATHFINDER IS TO CHECK AND MAKE SURE THEIR LUG NUTS ARE NOT DEFECTIVE. I HAVE MUCH MORE DETAILS REGARDING THIS ISSUE THAT I CAN PROVIDE THAT SUPPORTS MY CASE. I FEAR THAT IF THIS HAPPENS TO SOMEONE ELSE, THERE IS A STRONG CHANCE THIS COULD END UP CAUSING A CRASH AND/OR GETTING OTHER PEOPLE KILLED. THE PAST RECALL IN 05/02/2014 THAT I MENTIONED IS RECALL NUMBER 14V229000, COMPONENT: WHEELS:LUGS/NUTS/BOLTS. ALSO, I CONTACTED NISSAN CONSUMER AFFAIRS AND THEY WERE NOT HELPFUL.",
        "vin": "5N1AR2MNXGC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180200,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A BRAND NEW 2016  NISSAN PARTFINDER SL IN 2016 , AT 65,191 MILES  ONE EVENING COMING HOME I HEARD KNOCKING NOISE COMING FROM THE ENGINE , TOOK IT TO THE NISSAN DEALER , HAD IT  DIAGNOSE AND WAS INFORMED THE THE  RADIATOR COOLANT FAN  WAS WAS DEFECTIVE . I HAD IT REPLACED NOVEMBER 11/18 2017 , COST US $1268.49 , ON 02/12/2019 THE BRAND NEW COOLING FAN FAIL AGAIN AT 112,303 MILES  , TOOK IT TO THE SAME DEALERSHIP HAD IT  DIAGNOSED AND IT WAS THE SAME  PROBLEM  PREVIOUS .  WE CONTACT NISSAN REGIONAL OFFICE  FOR REIMBURSEMENT ON REPAIRS AND PARTS  OUR RECORDS WAS DENIED . HAVE IT FIX  AT THE DEALERSHIP ONCE AGAIN COST US $1016.21  PARTS AND LABOR .  THE DEALERSHIP ADVISE US TO KEEP ON FIGHTING FOR THESE COSTS AND REPAIRS BECAUSE IT'S A WIDE SPREAD PROBLEM WITH ALL NISSANS  COOLING FAN ASSEMBLY ASSEMBLY .",
        "vin": "5N1AR2MM8GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174625,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIATOR:  NISSIAN  PATHFINDER RADIATOR FAIL AFTER OWNING FOR LESS THAN 2 YEARS. THIS IS COVERED UNDER EXTEND WARRANTEE.  BUT BASE ON THE PAST RADIATOR RECALL, THE VECHILE RAIDATOR MAY NOT BE UP TO SPECS.",
        "vin": "5N1AR2MM8GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "01/27/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173603,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED MAKING A SOUND UNDER THE HOOD. THE NOISE WOULD STOP WHENEVER I TURNED THE CLIMATE CONTROL OFF. I TOOK IT TO GET CHECK OUT AND IT IS THE COOLING FAN. APPARENTLY THERE ARE TWO FANS. WHILE I PLACED AN ORDER TO REPLACE THE PART, THE OTHER FAN HAS STARTED MAKING THE SAME NOISE. THE CAR IS LESS THAN 3 YEARS OLD WITH 43K MILES. I HAVE HAD OTHER NISSANS FOR MUCH LONGER AND A LOT MORE MILES AND THIS HAS NEVER HAPPENED. THIS IS NOT THE FIRST REVIEW I READ ABOUT THIS ISSUE FOR THIS MAKE, MODEL AND YEAR. SOMETHING THAT DEFINITELY NEEDS TO BE REVIEWED BY NISSAN.",
        "vin": "5N1AR2MN4GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172787,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLING FAN ASSEMBLY FAILED ON 1/26/2019 AT 64,XXX MILES. NEW ASSY WAS PURCHASED ON 1/26/2019 FROM TONY SERRA NISSAN IN CULLMAN, AL COSTING $560.29 (PART AND TAX ONLY). I R/R THE ASSY MYSELF, AS I HAVE EXPERIENCE IN THE AUTOMOTIVE REPAIR FIELD, IT TOOK ME JUST SHY OF 2 HOURS TO REPLACE THEM (TIME AND CARE WAS TAKEN). THE SERVICE MANAGER (I FAILED TO ACQUIRE HIS NAME) STATED TO ME ON THE PHONE THAT IT IS A KNOWN/FREQUENT ISSUE. IT WAS A SUDDEN ISSUE, NO NOISES DETECTED ON 1/25/2019. A LIGHT CLICKING DETECTED OUTSIDE ONLY ON 1/26/2019 AT 09:30 HRS, AFTER A <50 MILE ROUND TRIP TO PURCHASE THE PART, EAT, AND GROCERY STORE STOP, ON 1/26/2019 AT 16:00 HRS, A HEAVY KNOCK COULD BE READILY HEARD OUTSIDE THE VEHICLE AS WELL AS A 'LOUD ROAR' AND VIBRATIONS DETECTED INSIDE THE VEHICLE WITH ALL WINDOWS CLOSED, STATIONARY VEHICLE, AND ENGINE AT IDLE. SYMPTOMS WOULD DISSOLVE WHEN THE A/C WAS DEACTIVATED. ALL REGULAR MAINTENANCE PERFORMED ON TIME, WITH THE EXCEPTION OF BRAKE FLUID CHANGE. VEHICLE IS ALSO REGULARLY CLEANED.",
        "vin": "5N1AR2MM4GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "12/25/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170141,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS LESS THAN 3 YEARS OLD WITH 44K MILES.  NOTICED THAT WHEN THE AC/HEATER IS ON IT MAKES A VIBRATING/KNOCKING SOUND BY THE FRONT.  IT STOPS WHEN IT'S TURNED OFF.  HAD IT DIAGNOSED AT DEALERSHIP AND WAS TOLD IT COOLING FAN NEEDED TO BE REPLACED.  I'VE HAD OTHER VEHICLES WITH MORE MILEAGE AND NEVER HAD THE FAN REPLACED.  VIBRATION/KNOCKING SOUND IS OF AND ON WHEN DRIVING OR STOPPED.  STARTED AROUND CHRISTMAS HOLIDAY.  UNFORTUNATELY, IT WAS PASSED THE MANUFACTURER'S WARRANTY LIMIT OF 3 YEARS/36K MILES.",
        "vin": "5N1AR2MM7GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "01/09/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166303,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN A PASSENGER IS IN THE PASSENGER SEAT THE SENSOR FOR THE PASSENGER SIDE AIR BAG WILL NOT GO OFF. MEANING IT DOES NOT DETECT ANYONE SITTING IN THE SEAT.",
        "vin": "5N1AR2MNXGC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "12/31/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164764,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD CLICKING NOISE IN THE ENGINE BOTH WHILE DRIVING AND IDLING IN PARK. AFTER RESEARCHING IT, I FOUND OUT THAT IS THE FAN HITTING THE SHROUD AND IT NEEDS TO BE REPLACED. THE PART IS ANYWHERE FROM $200-600 AND THAT DOESN'T INCLUDE LABOR. I BOUGHT THIS CAR BRAND NEW, ALWAYS KEPT UP ON THE MAINTENANCE AND OF COURSE MY EXTENDED WARRANTY RAN OUT LAST WEEK AND NOW THIS HAPPENS. :(",
        "vin": "5N1AR2MM9GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "12/31/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164596,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAN BEGAN MAKING LOUD NOISE AT 74K MILES.  TOOK TO DEALERSHIP AND WAS ADVISED TO REPLACE THE RADIATOR FAN.  A QUICK SEARCH UNCOVERED COUNTLESS OTHER OWNERS WITH THE SAME ISSUE ON THE SAME VEHICLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163623,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD WHISTLING NOISE COMING FROM THE POWER STEERING PUMP. ALL RESEARCH SUGGEST NISSAN KNOWS THIS IS AN ISSUES AND SAYS IT IS NORMAL.",
        "vin": "5N1AR2MM7GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162363,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE WINDOW DOESN'T WANT TO GO UP OR DOWN WHEN IT'S COLD, SOMETIMES STOPS WORKING ALL TOGETHER, HAVE SEEN MANY SIMILAR COMPLAINTS ON LINE CONCERNING MOTOR IN DOOR. HAPPENS WHEN STATIONER OR IN MOTION",
        "vin": "5N1AR2MM1GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2018",
        "dateOfIncident": "12/07/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157328,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR NISSAN PATHFINDER 2016 WAS SUDDENLY MAKING LOUD NOISE WHICH WAS COMING FROM THE FRONT (ENGINE AREA). THE DEALER DIAGNOSED THAT REPLACEMENT OF FAN SHROUD IS NECESSARY AND THAT'S EXPENSIVE. WE SEND CAR FOR REGULAR MAINTENANCE, WHAT ELSE WE CAN DO!! THE MILES ON MY CAR IS ABOVE 50000 AND THAT'S WHEN I CAME ACROSS THIS PROBLEM. I HAVE NEVER HAD THIS KIND OF PROBLEM IN ANY OF MY CARS SO FAR. THIS IS SOMETHING TO DO FROM THE MANUFACTURING SIDE.",
        "vin": "5N1AR2MM9GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156549,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING THE IGNITION, AIR BAG OCS INDICATOR SHOWS BOTH FRONT PASSENGER AIR BAGS NOT WORKING. INDICATION LIGHT REMAINS ON WHILE VEHICLE IS BOTH STATIONARY AND WHILE IN MOTION.",
        "vin": "5N1AR2MM8GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/19/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154548,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 48,800 MILES RADIATOR FAN FAILED.  AS WAS EXPLAINED TO ME BY SERVICE ADVISOR AT NISSAN DEALER, A MOUNTING PART FAILED AND CAUSED THE FAN TO RUB AGAINST THE SHROUD WHEN IN OPERATION.  MANY REPORTS OF FAILURE ON VARIOUS WEBSITES FOR MODEL YEARS 2014 -2016, MOST OCCURRING IN THE 50,000 MILE RANGE.",
        "vin": "5N1AR2MM9GC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2018",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153196,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIATOR FAN ASSEMBLY FAILED AND NEEDED REPLACEMENT AS INDICATED BY SEVERAL PATHFINDER OWNERS FROM 2014 UP TO THE PRESENT.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "08/26/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140412,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN PATHFINDER. THE CONTACT CALLED ON BEHALF OF THE DRIVER. WHILE DRIVING 50 MPH, THE BRAKES FAILED WHEN THE BRAKE PEDAL WAS DEPRESSED. AS A RESULT, THE VEHICLE CRASHED INTO A DITCH. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND LATER TAKEN TO AN INDEPENDENT MECHANIC FOR BODY REPAIRS. THE INSURANCE COMPANY HAD THE VEHICLE TOWED TO SHEEHY NISSAN OF GLEN BURNIE (LOCATED AT 7232 RITCHIE HWY, GLEN BURNIE, MD 21061, (410) 754-1777), BUT IT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 32615475. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "5N1AR2MM3GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115675,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING AT A RED LIGHT MY CAR STARTED TO MOVE. THE BRAKE PEDAL WENT TO THE FLOOR AND THE EMERGENCY BRAKE WOULD NOT WORK OR CLICK IN. THE CAR WOULD NOT STOP WHEN PLACING IT IN NEUTRAL EITHER. MY CAR WOULD ONLY STOP AFTER PLACING IT IN PARK. LUCKILY NO MOTOR VEHICLE ACCIDENT OCCURRED.  MY BRAKE PADS ARE IN GOOD SHAPE, BRAKE FLUID IS FULL. I TOOK MY CAR TO A LOCAL NISSAN DEALER AND THEY CAN ALSO FIND NOTHING WRONG. THIS IS WORRISOME AS THIS CAN BE FATAL IF I WAS DRIVING AT A FAST SPEED. PLEASE LOOK INTO THIS AS THERE HAVE BEEN REPORTS OF BRAKE FAILURE RESULTING IN DEATH OF OTHER NISSAN MODELS.",
        "vin": "5N1AR2MM0GC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/29/2018",
        "dateOfIncident": "07/14/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114363,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BECAME STIFF WHILE DRIVIVINF AND CAR SEEMS TO PULL ON OPPOSITE DIRECTION OF THE TURN. DEALER NOTES STEERING PUMP LEAK.",
        "vin": "5N1AR2MM3GC"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "05/04/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104547,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN PATHFINDER. THE CONTACT TOOK THE VEHICLE TO GREAT NECK NISSAN (250 NORTHERN BLVD, GREAT NECK, NY  11021) WHERE THE AIR CONDITIONER WAS REPAIRED BECAUSE HOT AIR WAS FLOWING THROUGH THE VENTS. THE VEHICLE WAS TAKEN TO ANOTHER DEALER (KOEPPEL NISSAN, 74-15 NORTHERN BLVD, JACKSON HEIGHTS, NY 11372) BECAUSE THE FAILURE PERSISTED. THE DEALER DIAGNOSED THAT FREON HAD LEAKED OUT AND THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND PROVIDED THE CONTACT WITH A CASE NUMBER. THE CONTACT WAS INFORMED THAT THE WARRANTY WAS EXPIRED. THE FAILURE MILEAGE WAS 12,308.",
        "vin": "5N1AR2MM5GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/13/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089824,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY WHEN SUDDENLY MY BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR. I WAS APPROXIMATELY 10 MILES FROM HOME. MY HUSBAND CHECKED AND IT WAS OUT OF BRAKE FLUID. HE ADDED FLUID SO I COULD GET TO THE DEALER, APPROX. 35 MILES AWAY. THEY SAID THERE WAS NOTHING WRONG AND THAT IT PROBABLY WAS NOT OUT OF BRAKE FLUID. IT WAS.",
        "vin": "5N1AR2MM9GC"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": true,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "03/29/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11088907,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL GOT STUCK AND CAUSED AN ACCIDENT",
        "vin": "5N1AR2MM6GC"
    },
    {
        "components": "ENGINE,Other/Unknown",
        "crash": true,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084475,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE UP TO 16,000 MILES AND THEN THE ENGINE SUDDENLY MADE A WEIRD SOUND. I WENT TO 2 NISSAN DEALERSHIPS TO CHECK IT OUT AND IT SAID IT WAS NORMAL FOR 2016 PATHFINDER.BUT WHILE DRIVING SOMETIMES IT WILL CAUSE A HUMMING NOISE LIKE A BEE AND ITS REALLY ANNOYING, I WENT TO CHECK IT OUT AND IT SAID IT WAS NORMAL, WHAT DO I DO NOW?",
        "vin": "5N1AR2MN9GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2018",
        "dateOfIncident": "04/07/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083815,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDSHIELD EXPLODED TODAY WHILE I WAS DRIVING. FORTUNATELY NO ONE WAS IN THE REAR SEATS. THIS WAS ON A FLAT ROAD SURFACE NO BUMPS OR POT HOLES.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082648,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIATOR FAN AND SHROUD ASSEMBLY AND I CANNOT FIND REPLACEMENT PARTS AT ANY DEALER, AUTO PARTS STORE NOR JUNK YARD DUE TO SO MANY PEOPLE NEEDING THESE PARTS REPLACED. I WAS TOLD THEY ARE ON BACKORDER AND DONT KNOW WHEN THEY WILL HAVE REPLACEMENT PARTS. I WAS TOLD BY A CERTIFIED MECHANIC THAT THE CAR COULD OVERHEAT AND STALL IF THESE PARTS ARE NOT REPLACED.",
        "vin": "5N1AR2MM7GC"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081831,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL PROBLEM RESULTED IN LOSS OF RPM AND BRAKES.  COULD NOT SHUT OFF.",
        "vin": "5N1AR2MN2GC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "02/25/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075647,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF SHATTERED WHILE DRIVING ON HIGHWAY FOR NO REASON AND NISSAN IS NOT WANTING TO REPAIR DUE TO BEING OUT OF MILEAGE WARRANTY",
        "vin": "5N1AR2MM7GC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061439,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER HYBRID",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT STAY ENGAGED IN FOUR WHEEL DRIVE FOR LONGER THAN 4 MINUTES AT A TIME WITHOUT DISENGAGING. VEHICLE PURCHASED IN JULY 2017 AND USING FOUR WHEEL DRIVE FOR THE FIRST TIME SINCE PURCHASE.",
        "vin": "5N1AR2MM2GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045532,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER HYBRID",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL",
        "vin": "SNIAR2MM36C"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042805,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ACID RAIN ETCHING ON THE WINDSHIELD SEVERELY IMPAIRS VISIBILITY WHEN DRIVING TOWARD THE SUN IN MORNINGS AND AFTERNOON.  THE SAME WAS TRUE FOR A 2014 NISSAN PATHFINDER I OWNED, BUT OTHER BRANDS I HAVE OWNED, INCLUDING A 2007 TOYOTA TUNDRA I CURRENTLY OWN, WERE AND ARE NOT AFFECTED BY ACID RAIN.  THE PROBLEM APPEARS TO BE UNIQUE TO NISSAN GLASS.  TODAY, WHILE DRIVING TOWARD THE SETTING SUN, I NARROWLY MISSED A PEDESTRIAN ON A RURAL ROAD.  I HAVE FILED TWO COMPLAINT REPORTS WITH NISSAN, INCLUDING ONE FOLLOWING THE NEAR-MISS TODAY. THE FIRST ONE WAS FILED ABOUT TWO WEEKS AGO, BUT NISSAN HAS NOT RESPONDED.      FROM MY PERSPECTIVE, NISSAN HAS A SYSTEMIC PROBLEM WITH GLASS THAT IS HYPERSENSITIVE TO ACID RAIN.  AND SINCE NO OTHER VEHICLE BRANDS SEEMS TO HAVE THE PROBLEM, I BELIEVE NISSAN SHOULD INVESTIGATE THE PROBLEM IN THE INTEREST OF PUBLIC SAFETY.",
        "vin": "5N1AR2MM9GC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/28/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040808,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS PARKED AND IF YOU OPEN THE TRUNK VIA KEY OR BUTTON THE TRUNK DOOR WILL CLOSE BY ITSELF AFTER IT REACHES THE TOP . IF NOT PAID ATTENTION MAY CAUSE HEAD INJURIES.TOOK TO THE DEALER THEY REPLACED A PART BUT THE FIX ONLY STAYED FOR 2- 3 MONTHS. THE CAR TRUNK IS A POTENTIAL HAZARD AND NISSAN IS JUST APPLYING PATCHES TO THE PROBLEM BUT NOT DOING A PERMANENT FIX.",
        "vin": "5N1AR2MM2GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035581,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL 16V-244 HAS NOT BEEN RESOLVED DUE TO UNAVAILABILITY OF CORRECTIVE PARTS, AS I UNDERSTAND IT. THE RECALL DATES FROM 24MAY2016.  ABOUT 15-20% OF THE TIME ADULT PASSENGERS ARE PRESENT IN THE FRONT PASSENGER SEAT, THE WARNING LIGHT INDICATES THAT THE OCS SYSTEM HAS DEACTIVATED THE PASSENGER SIDE AIRBAG.  HOW MUCH LONGER WILL NISSAN BE ALLOWED TO AVOID CORRECTIVE ACTION WHILE PASSENGERS IN THE AFFECTED VEHICLES ARE EXPOSED TO GREATER THAN NECESSARY RISK OF INJURY?",
        "vin": "5N1AR2MM9GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/27/2017",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957365,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN PATHFINDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 162440000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5N1AR2MN1GC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/20/2017",
        "dateOfIncident": "02/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955674,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF BLEW UP FROM THE INSIDE OUT WHILE DRIVING AT 80 MPH. GLASS FLEW TO THE VEHICLE THAT WAS FOLLOWING MINE. THIS INCIDENT OCCURRED WHILE TRAVELING ON COLUMBIA, SC. HIGHWAY 26.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/22/2017",
        "dateOfIncident": "01/21/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953529,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUR 2016 NISSAN PATHFINDER VEHICLE, WE FELT A SUDDEN VIBRATION AND THEN THE NEXT THING WE KNEW, THE RIGHT FRONT WHEEL (TIRE AND RIM) FELL OFF THE CAR. THE VEHICLE CAME DOWN ON WHAT REMAINED OF THE RIGHT FRONT WHEEL ASSEMBLY. I MANAGED TO KEEP THE VEHICLE ON THE ROAD UNTIL WE HAD ENOUGH SPEED TO THEN COAST TO A COMPLETE STOP ON THE RIGHT SHOULDER OF THE ROAD. THE WHEEL THAT CAME OFF CONTINUED THROUGH AN OPEN FIELD AND COLLIDED WITH A PRIVATE PROPERTY FENCE, DAMAGING THE FENCE IN THE PROCESS. THERE WERE A TOTAL OF 6 OF US IN THE VEHICLE AND THANKFULLY, EVERYONE WAS WEARING THEIR SEAT BELTS. ONCE I CONFIRMED THAT THERE WERE NO INJURIES, I CONTACTED A NEARBY TOWING COMPANY WHICH THEN TOWED THE VEHICLE TO THE DEALERSHIP FROM WHICH WE PURCHASED THE VEHICLE. THE VEHICLE HAS NOT HAD ANY WORK DONE THAT INVOLVES THE TIRES SINCE IT WAS PURCHASED. THERE HAVE BEEN NO ACCIDENTS AND NO DAMAGE HAS BEEN DONE TO THE WHEELS OR THE VEHICLE AS A WHOLE SINCE THE TIME OF PURCHASE WHICH WAS AUGUST OF 2016. WE HAVE DROPPED OFF THE VEHICLE WITH THE LOCAL NISSAN DEALERSHIP FROM WHERE WE PURCHASED IT AND AS OF THIS REPORT, ARE WAITING TO HEAR BACK FROM THE COMPANY AS TO HOW THEY PLAN TO ADDRESS THIS PROBLEM. DAMAGE TO THE VEHICLE AS A RESULT OF THIS MISHAP IS NOT FULLY KNOWN AT THIS POINT. AT A MINIMUM, THE FENDER AND FENDER WELL, ENTIRE WHEEL ASSEMBLY, RIGHT FRONT SUSPENSION, BRAKE SYSTEM, RIGHT FRONT TIRE ALL APPEAR TO HAVE SUSTAINED DAMAGE. IT IS UNKNOWN IF THERE HAS BEEN ANY COMPROMISE TO THE DRIVE TRAIN OR FRAME/CHASSIS COMPONENTS AS A RESULT OF THIS INCIDENT. THIS HAS CAUSED US GREAT CONCERN GIVEN THAT THIS COULD HAVE RESULTED IN A LOSS OF LIFE OR SERIOUS INJURY DEPENDING ON THE LOCATION AND TYPE OF ROAD THAT IT MAY HAVE OCCURRED ON. WE WERE FORTUNATE THAT THE INCIDENT OCCURRED ON A STRAIGHT AND LEVEL PORTION OF THE ROAD WITH VERY LITTLE TRAFFIC IN THE VICINITY.  ...UPDATED 02/15/17 *BF",
        "vin": "5N1AR2MM8GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934872,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS THE PERSON WHO FIRST FILED THE AIRBAG ISSUE ON NHTSA. FINALLY TODAY, THE ISSUE WAS \"PATCHED\".I SAY PATCHED NOT FIXED SINCE NOW THE \"AIRBAG OFF\" LIGHT IS ALWAYS ON IN MY CAR WHICH DOES NOT MATCH THE MANUAL OF MY VEHICLE.A BIGGER ISSUE THOUGH IS THAT THIS CONFUSES US INTO THINKING THE SIMILARLY ORANGE COLORED CROSS TRAFFIC LIGHT ON THE PASSENGER SIDE IS ON AND TWICE OUT OF TWO TIMES WE ALMOST HAD A CRASH DUE TO THAT. THIS PATCH IS NOT SAFE OR ACCEPTABLE AND I HOPE THAT NHTSA ACTS TO PROTECT CUSTOMERS WHO PAID A CONSIDERABLE AMOUNT OF MONEY TO ACQUIRE A SUPPOSEDLY SAFE VEHICLE.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/23/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10910225,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING AT A RED LIGHT AND WAS REAR ENDED AND MY TWO FRONT SEATS COLLAPSED. IF I WOULD HAVE HAD ANYONE IN THE BACKSEATS THEY WOULD HAVE BEEN BADLY INJURED OR DIED.  *TR...UPDATED 12/22/16 *BF..UPDATED 04/11/17 *BF  UPDATED 09/07/2017*JS",
        "vin": "5N1AR2MM3GC"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "09/04/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906995,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Graco Children's Products, Inc.",
                "productMake": "GRACO",
                "productModel": "CHILD SAFETY SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "THIS CAR SEAT HAS A GAP FOR A SEAT BELT (WHEN THE SEAT IS CHANGED TO A BOOSTER), BETWEEN THE BACK AND BOTTOM. THE GAP IS ON BOTH SIDES. MY CHILD HAS GOTTEN HER LEG STUCK IN THE GAP MANY MANY TIMES. IF I WERE IN AN ACCIDENT WHILE HER LEG IS STUCK, I CANNOT IMAGINE THE DAMAGE THAT WOULD BE DONE TO HER. EVERY TIME SHE CRIES I HAVE TO PULL OVER TO CHECK IF HER LEG IS STUCK/GET IT OUT. THIS IS INCREDIBLY DANGEROUS. SHE IS REAR FACING IN THE SEAT. SHE WEIGHS 19 POUNDS. I HAVE PICTURES IF NECESSARY TO FURTHER DESCRIBE THIS FAILURE. GRACO FOREVER WITH SAFETY SURROUND CONVERTIBLE CAR SEAT. MODEL NUMBER: 1939912",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "09/09/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905040,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN PATHFINDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V244000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5N1AR2MM1FC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/07/2016",
        "dateOfIncident": "04/03/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854052,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA CAMPAIGN NUMBER: 15V681000  COMPONENT(S): AIR BAGS     THE ABOVE ISSUE WAS ALSO SEEN ON MY 2016 PATHFINDER SL TECH PURCHASED LESS THAN 1 MONTH AGO. THE ISSUE HAPPENS ABOUT 10% OF THE TIME. TO RESOLVE I HAVE TO POWER CYCLE THE CAR...",
        "vin": ""
    }
]