[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "02/02/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450028,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Nissan Leaf. The contact stated that while driving at an undisclosed speed, the \"Low Battery Mode\" warning message was displayed while the battery was fully charged, which caused the vehicle to inadvertently decelerate. The vehicle was taken to the dealer. The dealer replaced the capacitor and three cells in the battery; however, the failure recurred. The vehicle was not repaired and had an upcoming appointment with the dealer. The manufacturer was made aware of the failure and informed the contact to take the vehicle to the dealer for diagnostic testing. The failure mileage was approximately 54,000.",
        "vin": "1n4bz0cpxgc"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2021",
        "dateOfIncident": "12/13/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389581,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NISSAN LEAF WAS BEING DRIVEN ON A 35 MPH ROAD IN A HILLY AREA. WHILE GOING APPROXIMATELY 25 MPH ON A DOWNHILL CURVE COMING UP TO A RED LIGHT THE DRIVER APPLIED THE BRAKES AND THEY DID NOT ENGAGE WITH NORMAL PRESSURE. THE DRIVER THEN PUSHED THE BRAKE PEDDLE ALL THE WAY DOWN TO THE FLOOR BEFORE THE VEHICLE BEGIN TO SLOWLY STOP CAUSING THE VEHICLE TO GO 10 FEET PAST A RED LIGHT INTO AN INTERSECTION. THE DRIVER DROVE OUT OF THE INTERSECTION AND TESTED THE BRAKES AGAIN WITH THE SAME RESULTS. THE DRIVERS SPOUSE ARRIVED TO TEST THE VEHICLE AND VERIFIED THE SAME RESULTS. THE ONLY WAY HOME WAS A VERY STEEP DOWN HILL SO TOW TRUCK WAS CALLED TO PICK UP THE VEHICLE AND BRING IT TO THE NISSAN DEALERSHIP THE TOW TRUCK DRIVER ALSO VERIFIED THE BRAKES WERE NOT ENGAGING WHEN HE LOADED THE VEHICLE ON THE FLATBED. WHEN THE VEHICLE ARRIVED AT THE DEALERSHIP AND UNLOADED FROM THE TOW TRUCK THE BRAKES STARTED WORKING. THE DEALERSHIP TESTED THE VEHICLE AND VERIFIED THE BRAKES PASSED INSPECTION.  FEELING UNSAFE TO DRIVE THE VEHICLE THE OWNER TRIED TO CONVINCE THE DEALERSHIP TO TEST MORE. THEY WERE NOT ABLE TO REPRODUCE THE ISSUE. THE OWNERS REPORTED TO NISSAN OF AMERICA CUSTOMER SERVICE. NISSAN OF AMERICA SAID THEY HAD NOT HEARD OF THIS TYPE OF ISSUE AND THAT IF THE DEALERSHIP COULDN'T FIND ANYTHING THERE WAS NOTHING THEY COULD DO. SINCE THE DEALERSHIP AND CORPORATE CAN NOT FIX THE CAR AND DO NOT WANT TO FURTHER INVESTIGATE THE VEHICLE WAS TOWED TO THE OWNERS HOUSE WHERE IT NOW SITS UNUSED.",
        "vin": "1N4BZ0CP7GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344245,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING CONDITIONS OF LOW 12V BATTERY CHARGE, THE VEHICLE WILL OCCASIONALLY START, GO INTO A DRIVE MODE (\"R\" OR \"D\") BUT THE BRAKES WILL NOT OPERATE.     I STRESS THAT THIS ONLY HAPPENS WHEN THE 12V BATTERY HAS LOW CHARGE, BUT NOT TOO LOW THAT THE VEHICLE WILL REFUSE TO START.     I AM NOT THE ONLY PERSON TO REPORT THIS. NOTE THE COMMENT ABOUT BRAKES FAILING IN THIS POSTING:  HTTPS://WWW.MYNISSANLEAF.COM/VIEWTOPIC.PHP?F=30&T=12959&P=588304#P587949",
        "vin": "1N4AZ0CP9GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "11/02/2019",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301153,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONSUMER OWNED A 2016 NISSAN LEAF. THE CONSUMER STATED THAT WHILE ASLEEP AT THEIR RESIDENCE, THEY WERE AWOKEN BY THE POLICE DEPARTMENT WHO INFORMED THEM THAT THEIR VEHICLE WAS ENGULFED IN FLAMES. NO INJURY WAS SUSTAINED. THE FIRE DEPARTMENT WAS CONTACTED AND EXTINGUISHED THE FIRE. A POLICE REPORT WAS FILED. NO MEDICAL ATTENTION WAS NEEDED. FIRST INSURANCE WAS CONTACTED AND THE VEHICLE WAS TOWED TO A SALVAGE YARD. NO DEALER WAS CONTACTED. THE VEHICLE WAS DEEMED A TOTAL LOSS. THE MANUFACTURER WAS CONTACTED AND A CASE WAS OPENED. AN INVESTIGATION WAS ALSO STARTED. THE FAILURE MILEAGE WAS APPROXIMATELY 22,000. *LN THE CONSUMER STATED THAT THOUGH THE MANUFACTURER WAS MADE AWARE OF THE SITUATION, HOWEVER THEY ARE CLAIMING NO RESPONSIBILITY OVER THE INCIDENT. THE MANUFACTURE IS CLAIMING THAT THE FAILURE DUE TO THE DEFECTIVE INSTALLATION OF THE ORIGINAL BATTERY.*AS *LN*JB",
        "vin": "1N4AZ0CP3GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "10/22/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280442,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT SPEEDS OF 70 MPH, MY CAR TURNS OFF IN THE MIDDLE OF THE HIGHWAY! I HAVE A VIDEO OF THIS ORDEAL THAT I'D BE HAPPY TO SEND OVER.",
        "vin": "1N4BZ0CP9GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266691,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NO BRAKES AT STARTUP.   NO PREVIOUS PROBLEMS.  DROVE 20 MILES NIGHT BEFORE. BRAKE PEDAL WENT TO FLOOR WHILE BACKING OUT OF GARAGE.",
        "vin": "1N4BZ0CP0GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234686,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE STOPPED WORKING WHILE I WAS DRIVING ON SAN THOMAS EXPRESSWAY IN SANTA CLARA CITY IN CALIFORNIA; I IMMEDIATELY SWITCHED TO \"PARK\" AND ALSO USED MANUAL BRAKE, EVENTUALLY I MANAGED TO STOP IT; SINCE IT'S BLOCKING A LANE, POLICE CAME AND TOWED THE CAR TO THE DEALERSHIP.     MILEAGE IS ESTIMATE SINCE THE CAR IS STILL BEING REPAIRED IN THE DEALERSHIP.",
        "vin": "1N4AZ0CP4GC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222684,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I DO NOT HAVE MUCH RANGE. AT 100% CHARGED I'M GETTING A RANGE OF 64 MILES. CONSIDERING THE CAR ONLY HAS 10K MILES ON IT, THAT'S TERRIBLE RANGE. MY CAR WAS SITTING STILL, IN PARK AND TURNED ON WHEN I TOOK THIS IMAGE.",
        "vin": "1N4BZ0CP2GC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217262,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "USING THE J-1772 CHARGE PORT AT A SHOPPING MALL WHILE GOING FOR A WALK; ON SUN 5/19 AS WE APPROACHED THE CAR TO LEAVE, WE NOTICED A STRONG ELECTRICAL SMELL.  I DISENGAGED THE CHARGER, INSPECTED IT AND SAW NO ISSUES.  OUR CAR, HOWEVER SHOWED DISTORTION IN THE PORT AT THE UPPER RIGHT.  THE NEXT MORNING, 5/20, I TOOK THE CAR TO THE DEALER, AND HAD THE CERTIFIED LEAF TECHNICIAN TRY TO PLUG IT IN AND CHECK THE CHARGING.  HE FOUND RESISTANCE AS HE TRIED TO PLUG IT IN, LOOKED AT THE DISTORTED PLASTIC, AND SAID \"YOU NEED TO REPLACE THAT PORT\"  IT'S JUNE 1ST TODAY; THE DEALER SAID THEY HAD TO CONTACT NISSAN.  AFTER A WEEK OF NO RESPONSE OR CALLBACK, I FINALLY WAS TOLD THAT WE MUST HAVE DAMAGED IT, AND IT WOULDN'T BE COVERED.  THEY HAD NO BASIS FOR THAT ASSERTION, AND THEY OFFERED NO EXPLANATION OR ADVICE ABOUT THE DAMAGE ON THE PORT.  I'VE CONTACTED NISSAN CUSTOMER SERVICE, WAITING TO HEAR BACK FROM NISSAN WARRANTY DIVISION.   IN THE MEAN TIME, I'M CHARGING WITH THE CHADEMO PORT WHENEVER POSSIBLE, AND STILL USING THE J-1772, ALTHOUGH WITH NO EXPLANATION OF WHAT CAUSED THE PROBLEM I FEEL LIKE IT'S A RISK EVERY TIME.  OBVIOUSLY THE CHARGING IS BASIC FOR THE VEHICLE'S FUNCTION.",
        "vin": "1N4BZ0CP9GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152331,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVEN'T HAD AN ACCIDENT DUE TO THE BRAKES NOT WORKING, BUT I HAVE HAD SIMILAR ISSUES THAT OTHERS ARE REPORTING. I'VE LEARNED TO NOT FOLLOW CLOSE AT ALL.   MINE IS ONLY AT LOW SPEEDS THAT I'VE NOTICED THE LACK OF BRAKES.  SEEMS RANDOM, CANNOT DETERMINE A SPECIFIC SPEED OR CONDITIONS THAT ARE COMMON.  IT HAS HAPPENED SINCE  THE BEGINNING.  ONLY AT 13700 MILES CURRENTLY.",
        "vin": "1N4AZ0CPXGC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151213,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN LEAF. WHILE DRIVING IN REVERSE, THE BRAKES FAILED TO ENGAGE WHEN THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TOWED TO PREMIER NISSAN OF METAIRIE (LOCATED AT 6636 VETERANS MEMORIAL BLVD, METAIRIE, LA 70003, (504) 455-5800) TO BE DIAGNOSED, BUT A FAILURE CODE COULD NOT BE FOUND. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 33554796. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.",
        "vin": "1N4BZ0CP7GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2018",
        "dateOfIncident": "05/21/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097873,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A BRAKE FAILURE AT POWER ON ISSUE ON MY 2016 NISSAN LEAF SL. NOTHING ON THE DASH ALERTED ME. THE BRAKES DID WORK, BUT IT SEEMED LIKE NO VACUUM ASSIST, SO HAD TO PRESS REALLY HARD. TOWED TO A DEALER. REPLACED THE 12V BATTERY. VERY SCARY, I ROLLED OUT INTO AN INTERSECTION AND LUCKILY I WAS NOT IN AN ACCIDENT OR RAN OVER A PEDESTRIAN.",
        "vin": "1N4BZ0CP5GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "03/19/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084606,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 LEAF SL WAS DAMAGED IN A FAIRLY LOW SPEED COLLISION DURING HEAVY OFFICE RUSH TRAFFIC (AROUND 7:30AM IN THE MORNING). WHEN THE CAR IN FRONT OF ME SUDDENLY STOPPED, I ALSO BRAKED HARD. AT THAT TIME I HEARD ABS LIKE SOUND BUT THE CAR DID NOT ACTUALLY STOP, IT KEPT ON GOING AND HIT THE CAR IN FRONT OF ME. I WAS TOO STRESSED OUT AT THE MOMENT THEREFORE I DID NOT HAVE TIME TO THINK.    LATER ON, I SPENT SOME TIME SEARCHING INTERNET WITH SEARCH QUERIES LIKE 'NISSAN LEAF BRAKE PROBLEM' OR 'NISSAN LEAF DID NOT BRAKE' ETC. I FOUND MULTIPLE MENTIONS OF EXPERIENCES VERY SIMILAR TO MINE. IF YOU PERFORM GOOGLE SEARCH, YOU WILL SEE WHAT I MEAN.    IS THERE A WAY TO LOOK AT THE LEAF ONBOARD DATA TO SEE WHAT MAY HAVE HAPPENED?",
        "vin": "1N4BZ0CP7GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/26/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075080,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOST ALL BREAK CAPABILITIES AS I APPROACHED A TRAFFIC LIGHT. BRAKE PEDAL WAS LOOSE AND CAR WOULD NOT ENGAGE BREAKS, LOUD CRACK SOUND ON FIRST PUMP BEFORE BREAK WAS LOST. SINCE I WAS GOING AT LOW SPEED (30MPH) I COULD EMPLOY MANUAL BREAK TO STOP VEHICLE. BREAK REMAIN IN FAILURE STATE TILL ON HOUR LATER WHEN IT SEEM TO HAVE RETURNED.",
        "vin": "1N4BZOCP6GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2018",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072190,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6 OCCASIONS THE BRAKES FAILED TO WORK ON FIRST CONTACT WHEN ATTEMPTING TO COME TO A FULL STOP AT EITHER A STOP LIGHT OR A STOP SIGN ON CITY STREETS.  RELEASING THE BRAKE PEDAL AND REAPPLYING THE BRAKES FINALLY BROUGHT THE CAR TO A STOP. THIS HAPPENED TO BOTH MY HUSBAND AND MYSELF AND HAPPENED ON BOTH STRAIGHT FLAT ROADS AND DOWNHILL ROADS.   THIS HAPPENED IN BOTH REGENERATIVE AND NON-REGENERATIVE BRAKING BUT THE WORST FAILURE HAPPENED IN NON-REGENERATIVE BRAKING.",
        "vin": "1N4BZ0CP7GC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047839,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DEGRADATION OCCURRING MUCH QUICKER THAN REASONABLY EXPECTED.  DETAILS FOLLOW.    CAR PURCHASED IN JUNE 2016.  AFTER DRIVING A TOTAL OF 6,150 MILES UNDER CONDITIONS OF MODERATE TEMPERATURE, CONSERVATIVE DRIVING (NOT EXCEEDING 65 MPH ON THE HIGHWAY, USING ECO MODE AS RECOMMENDED IN THE MANUFACTURER'S MANUAL TO ENHANCE BATTERY LIFE) AND RARELY CHARGING THE BATTERY TO MORE THAN 80% NOR MAKING USE OF FREQUENT QUICK-CHARGING (ALSO AS RECOMMENDED IN MANUFACTURER'S MANUAL), I NOTICED THAT 1 OUT OF 12 \"BARS\" OF BATTERY CAPACITY WERE LOST.    USE OF SOFTWARE TO DETERMINE STATE OF HEALTH (SOH) OF THE BATTERY INDICATED THAT AFTER ONLY 2,300 MILES (AND 4 MONTHS OF OWNERSHIP), SOH WAS 89%.  MOST RECENTLY (NOV. 2016), SOH IS LESS THAN 84%.    CAR IS ALWAYS KEPT IN GARAGE WHEN NOT IN USE, NEVER PARKED OUTSIDE OVERNIGHT.      CONTACTED MANUFACTURER IN OCT. 2016 AND NOV. 2017 ABOUT THIS PROBLEM.  SERVICE DEPARTMENT DECLINED TO ACKNOWLEDGE ANY PROBLEMS IN OCT. 2016 WITH SOH WAS ONLY 89%.    CONCLUSION: SINCE CAR HAS BEEN DRIVEN AND CHARGED UNDER OPTIMAL CIRCUMSTANCES WITHOUT ANY EVIDENCE OF OVERHEATING WHILE IN OWNER'S POSSESSION, IT APPEARS LIKELY THAT THERE IS EITHER A DEFECT IN THE BATTERY PER SE OR POOR HANDLING OF THE VEHICLE BEFORE TIME OF SALE.  THERE IS NO WAY FOR A CONSUMER GET AN ACCURATE MEASURE OF BATTERY CAPACITY AT THE TIME OF PURCHASE.      I CAN MAKE A SPREADSHEET OF BATTERY SOH OVER TIME AS MEASURED BY 3RD PARTY SOFTWARE AVAILABLE TO NHTSA AT YOUR REQUEST.",
        "vin": "1N4BZ0CP0GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042126,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BATTERY LOST 2 OF MY 12 RANGE BARS AND NISSAN DOES NOT SEE ANY OF THIS AS AN ISSUE,   OCTOBER 06,  2016 -  110 MILE RANGE  MARCH  04,   2017 -     AUGUST 28,  2017 -  76 MILE RANGE ' 1 BAR LOSS  OCTOBER 23, 2017 -  65 - 72 MILE RANGE ' 2 BAR LOSS    I CAN NO LONGER MAKE MY COMMUTE AFTER 1 YEAR OF USAGE.                                                                                                                       LEASED 2016 NISSAN LEAF OCTOBER 8, 2016  DEALER PURCHASED FROM: AVONDALE NISSAN       [XXX]     10/8/2016                              SERVICE DATE  MILEAGE  CHARGED 100% = RANGE DEALER NAME    CONCERN      10/8/2016  ODOMITER  110 MILES   AVONDALE NISSAN                    BATTERY DEPLETES AT A RAPID PACE WHEN IT REACHES 20% CHARGE,    3/17/2016  8,193     PINNACLE NISSAN  ESTIMATED FOR EVERY MILE DRIVEN IT DROPS 5 MILES IN CAPACITY.                     8/5/2017  16,329  82 MILES   PINNACLE NISSAN  BATTERY DEGRADATION                         8/28/2017  17,296  72 MILES   AVONDALE NISSAN  BATTERY DEGRADATION  LOST 1ST BAR                      10/23/2017  19,623  68 MILES   AVONDALE NISSAN  BATTERY DEGRADATION  LOST 2ND BAR                          38.18% RANGE LOSS ON BATTERY IN ONE YEAR       I FIND THE DEALERSHIP AND NISSAN INTENTIONALLY PROVIDING MISLEADING AND FALSE INFORMATION. DO I HAVE ANY RECOURSE IN SMALL CLAIMS OR OTHER ACTIONS. THE LEMON LAW WILL NOT WORK IN THIS SITUATION BECAUSE     THEY TELL ME IT IS NOT BROKE AND THEY HAVE NOT ATTEMPTED TO FIX ANYTHING? NISSAN CLAIMS THIS IS NORMAL AND TO BE EXPECTED, WHO WOULD BUY THAT FOR OVER 30K. AFTER TWO YEARS OF SERVICE WHAT WILL HAPPEN    TO THE BATTERY DEGRADATION.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1N4BZ0CP7GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "07/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011092,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRACTION MOTOR INVERTER FAILURE ON 2016 NISSAN LEAF. WHEN THIS INCIDENT OCCURRED, I WAS NOT ABLE TO CHARGE OR START THE CAR.",
        "vin": "1N4BZ0CP5GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001701,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPROACHING AN INTERSECTION IN A BUSY AREA OF SAN DIEGO COUNTY, THE BRAKES FAILED ON MY NISSAN LEAF.  THE BRAKE SHUDDERED UNDER MY FOOT, MUCH LIKE ANTI-LOCK BRAKES DO WHEN THEY'RE ENGAGED.  AFTER I FELT THE SHUDDERING, THE BRAKE PEDAL WENT DOWN BUT THE VEHICLE DID NOT DECELERATE AS IT NORMALLY WOULD IN RESPONSE TO BRAKING.  I TRIED THE BRAKE PEDAL A FEW TIMES WITH NO RESPONSE, BUT THE VEHICLE'S MOMENTUM SLOWED ENOUGH FOR ME TO AVOID A COLLISION AND CONTINUE ON THE ROAD.      AS I CAME TO A SECOND INTERSECTION, I AGAIN TRIED THE BRAKES AND THE VEHICLE DID NOT RESPOND.  I USED THE EMERGENCY BRAKE TO STOP THE LEAF AT THE INTERSECTION.      I LOCATED AN UPHILL DRIVEWAY TO A CORPORATE PARKING LOCATION, AND DROVE THE VEHICLE VERY SLOWLY TO A PARKING SPOT. I INTENDED TO PARK THE CAR AND CALL A TOWING SERVICE, BUT WHEN I ONCE AGAIN TRIED THE BRAKE PEDAL THE NISSAN LEAF RESPONDED TO THE BRAKES AND STOPPED IN THE PARKING SPOT.      BECAUSE I WAS CLOSE TO WORK AND THE BRAKES HAD RE-ENGAGED, I DROVE THE VEHICLE TO THE PARKING LOT AT MY OFFICE AND LATER THAT DAY CALLED NISSAN'S CONSUMER AFFAIRS LINE FOR THE LEAF (877-664-2738).  I REPORTED THE ISSUE TO NISSAN, AND THEY HAD THE VEHICLE TOWED TO A NEARBY NISSAN DEALERSHIP.      AT THIS POINT IN TIME, NISSAN IS WORKING WITH MOSSY NISSAN IN POWAY, CA TO TRY TO DIAGNOSE THE PROBLEM.  NISSAN OPENED CASE #27170321 ON THE ISSUE.      THIS IS A FAIRLY NEW VEHICLE (BOUGHT IN SEPTEMBER 2016), AND I DON'T THINK THERE ARE ANY PHYSICAL PROBLEMS WITH THE BRAKE PADS OR MECHANISM.  MY BEST GUESS IS THAT AN ELECTRIC/CONTROLLER FAILURE OCCURRED WITH REGENERATIVE BRAKING.",
        "vin": "1N4AZ0CP0GC"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "11/29/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DECEMBER 07, 2016  I BOUGHT NISSAN LEAF 2016 IN JUNE 30, 2016. ON NOVEMBER 29, 2016, IT JUST STOPPED AND NOT GOING IN REVERSE OR FORWARD, JUST STAY ON NEUTRAL AND PARK. IT HAS TWO RECALLS ISSUED BY TRANSPORT CANADA (# 2016179 AN # 2016302). NISSAN CANADA NEVER SEND MY ANY NOTIFICATION ABOUT RECALLS. ON NOVEMBER 29, 2016 IT WAS TOWED TO THE DEALERSHIP, 401/DIXIE MISSISSAUGA, ON CANADA.SINCE THEN SERVICE DEPARTMENT IS WORKING AND AFTER REPEATED CALL, THEY ARE UNABLE TO TELL ME WHATS WRONG WITH THE VEHICLE. THEY DO NOT KNOW HOW LONG IT WILL TAKE TO FIX THE PROBLEM. I REQUESTED A REPLACEMENT VEHICLE WHILE THEY ARE FIXING MY VEHICLE AND THE REQUEST WAS DENIED. IT LOOK LIKE A MANUFACTURING DEFECT ASSOCIATED WITH SAFETY ISSUE. SERVICE DEPARTMENT IS NOT RELEASING ANY INFORMATION ABOUT THE PROBLEM.IT IS MORE THAN ONE WEEK NOW. I HOPE THIS INFORMATION MAY BE HELPFUL FOR OWNERS AND POTENTIAL BUYERS.DECEMBER 7, 2016 8:15 PM",
        "vin": "1N4BZ0CP4GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904540,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN LEAF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V244000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1N4BZ0CP4GC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "05/24/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888766,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "LEAF",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN LEAF. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V244000 (AIR BAGS);  HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1N4AZ0CP4FC"
    }
]