[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/23/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453792,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Nissan Murano. The contact stated that an antifreeze-like odor could be smelled upon exiting the vehicle. There were no warning lights illuminated. The vehicle was taken to the dealer where it was diagnosed that the transfer case fluid had leaked onto his manifold; he was informed that the vehicle was unsafe to drive and was given an estimate for the repair. The manufacturer was not notified of the failure. The vehicle had yet to be repaired and remained in the possession of the dealer. The failure mileage was approximately 120,000.",
        "vin": "5n1az2mhxgn"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/29/2022",
        "dateOfIncident": "12/12/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449410,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The driver seat heater is not working.",
        "vin": "5N1AZ2MH0GN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "01/19/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449318,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I recently brought my 2016 Nissan Murano to the Nissan service department and asked them to check the driver's side heated seat as it was not working.   I was notified by the Nissan service department that the heated seat module had melted and that they needed to disconnect the component because it was a safety concern. It was very concerning to learn that the heated seat component could have possibly caused personal harm to anyone driving my vehicle.  I reached out to Nissan in an effort to have them fix the defect and they refused to fix the vehicle free of charge. I have also researched this defect online and there seems to be a pattern of this defect happening in other vehicles of this model and year. I believe that this is a serious safety issue and that Nissan should be investigating the heated seat components on these vehicles and fix the component, so they are safe and in working order.",
        "vin": "5N1AZ2MH5GN"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2021",
        "dateOfIncident": "09/02/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440886,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I am having transmission issues. The car vibrates when I am driving and accelerating between 15-50MPH. I also have water coming in my vehicle and causing mold from the passenger side.  I have taken the car to 3 dealers and I have contacted Nissan. There has not been a resolution yet.  I had the transfer case repaired twice within less than a month at a Nissan dealer.  The vibrating/growling noise is still present.  I simply want my car to be fixed",
        "vin": "5N1AZ2MH3GN"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439779,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Nissan Murano. The contact stated that water was leaking into the front driver’s side of the vehicle. Additionally, the engine was making a grinding sound and vibrating while attempting to accelerate. The vehicle also had an oil leak from the transfer case. The contact took the vehicle to a dealer who replaced the transfer case however, the leak recurred approximately a month later. The repair was completed again however, the vehicle was still emitting an abnormal sound. The contact was also informed that the torque converter needed to be repaired. The contact was informed that the torque converter was not damaged enough to be replaced. The contact took the vehicle to a certified mechanic who diagnosed that the transaxle needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 45,000.",
        "vin": "5n1az2mh3gn"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "09/25/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436514,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS actuator failed. In case of a sudden stop the anti lock brakes would not work The problem was confirmed after my brake and ABS light stayed on after suddenly coming on while I was driving. I took it to the Nissan dealer  Dick Smith Nissan Columbia, SC 3670 Ferandina RD. phone 803-213-3802. Dwayne Brown service mgr. will confirm. Prior to this there was no confirmation of this part being inspected or replaced on my vehicle despite a recall on all muranos 2015-2017 including my model 2016 murano hybrids. See Nissan recall NTB 16-0886 Nissan memo PC482 Jan 12,2017. When contacted Nissan consumer affairs refused to cover my vehicle despite having the problem they had recalled prior.CASE # 44822189 costing me $1417.32 despite saying would replace free of charge in bulletin. incident occurred Sept 25,2021 and repaired Oct !2,2021.",
        "vin": "5N1CZ2MG8GN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425892,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the road, state highway 78 in Alabama, while going roughly 55 mph, when I heard what sounded like a gunshot or explosion. I stopped to assess the situation, thinking I hit something or a tire exploded. Upon further investigation I discovered that the sunroof had actually exploded. As you can see from the pictures the glass pushed upward and out instead of in and down.",
        "vin": "5N1AZ2MG0GN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423793,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle randomly quits running while driving.  Once stopped, it will typically restart after being put in park and usual parking, stopping, end running operations are performed.  There are no warning lights of any kind prior to engine stopping.  There are no codes and check engine light has not come on. My daughters safety is of primary concern, as well as other motorists.  This happens at speed randomly with no warning.  I have searched online and find numerous reports of this on forums and the usual dealer response is it couldn't be replicated.  It has occurred between 5-10 times over the past 6-12 months. No accidents yet, but it is not a question of 'if' it is a question of 'when'.",
        "vin": "5N1AZ2MG1GN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2021",
        "dateOfIncident": "03/21/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405706,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF TRANSFER CASE: WHILE DRIVING VEHICLE ON STREET GOING AT POSTED SPEED LIMIT OF 45 MPH, SUV MADE GRINDING NOISE WHEN COMING TO A STOP LIGHT.  UPON START OF ACCELERATION NOISE HEARD AGAIN.  AT SPEED LIMIT OF 45 MPH CAR SUDDENLY FELT AS IF WHEELS LOCKED UP AND CAR WOULD NOT MOVE IN DRIVE.  SHIFT TO PARK, SHIFTED BACK TO DRIVE AND REVERSE, NO MOVEMENT OF CAR IN GEAR. NEEDED SPECIALIZED DOLLY LIFT TOWING TO DEALERSHIP IN AREA.  UPON MULTIPLE INSPECTIONS AND DELIBERATIONS WITH DEALERSHIP MAINTENANCE DEPARTMENT AND NISSAN WARRANTY REPRESENTATIVES PART DEEMED RESPONSIBLE WAS THE TRANSFER CASE.  THIS WAS SUPPOSEDLY REPAIRED WHEN INCIDENTALLY FOUND AT PRIOR CAR INSPECTION AT USUAL DEALER.  REPAIR HAS NOW BEEN DEEMED TO BE COMPLETED WITH USED TRANSFER CASE AS A SAFE OPTIONS.  CONCERN REMAINS ON MY MIND FOR FAULTY PART AND REPAIR.  CONCERN FOR OTHERS TRAVELING ON ROAD THAT CAR WILL COME TO IMMEDIATE ABRUPT STOP AND ACCIDENT POSSIBLE.  LUCKILY CAR BEHIND ME WAS ABLE TO AVOID COLLISION.",
        "vin": "5N1AZ2MH0GN"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404458,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2015-2019 NISSAN MURANOS HAVE AN ON-GOING ELECTRICAL HAZARD WITH THE CLIMATE CONTROLLED SEATS.  THE ELECTRICAL HARNESS CONNECTOR DIRECTLY UNDER THE SEAT WILL FAIL AND ACTUALLY GET SO HOT IT WILL MELT THE PLASTIC PIECES!  IN FACT, NISSAN HAS ISSUED IT'S OWN 15 PAGE SERVICE BULLETIN WARNING TO ITS DEALERS ON THE FIRE DANGER (EL18-035, REFERENCE NTB19-004, DATED 17 JANUARY 2019).  THIS BULLETIN GRAPHICALLY SHOWS PICTURES OF HOW THE HARNESS CONNECTOR AND THE SEAT CONTROL UNIT WILL GET SO HOT THEY WILL MELT AND FAIL.  IT ALSO DETAILS HOW LOCAL DEALERS SHOULD REPLACE THE DEFECTIVE CONNECTOR AND EVEN HOW THEY SHOULD CHARGE NISSAN BACK FOR THE REPAIR (PAGE 15 - PRIMARY PART LINE CLAIM).      MY 2016 NISSAN MURANO SUFFERED THE SAME DRIVERS SEAT ELECTRICAL FAILURE RECENTLY.  I VISUALLY VERIFIED THE DAMAGED (MELTED) CONNECTOR UNDER THE SEAT AND CONTACTED MY LOCAL NISSAN DEALER (YOUNGBLOOD NISSAN, SPRINGFIELD MO.).  I PROVIDED THEM THE NISSAN  ALERT INFORMATION.  THE DEALER IS REFUSING TO FIX THE KNOWN FAILURE UNLESS THEY ARE PAID FOR THE SERVICE WORK (ESTIMATED IS OVER $300.00)!      GIVEN THAT THIS FIRE HAZARD COVERS FOUR YEARS WORTH OF NISSAN MURANO PRODUCTION AND THE 2016-2019 TITANS, NISSAN SHOULD FIX THE DEFECTIVE PARTS FOR FREE.  WHILE IN MY CASE THERE WAS NO ACTUAL FIRE OR DAMAGE BEYOND THE MELTED ELECTRICAL PARTS AND LOSS OF THE SEAT CLIMATE CONTROL FEATURE..I HAVE LEFT THE DEFECTIVE PLUG DISCONNECTED, STILL LEAVES ME VERY CONCERNED ABOUT THEY SAFETY OF MYSELF AND MY FAMILY.    I HAVE ATTACHED IMAGES OF BOTH THE INTERNAL NISSAN SERVICE BULLETIN AND AN IMAGE OF MY MELTED AND DEFECTIVE ELECTRICAL PLUG.    THANK YOU.",
        "vin": "5N1AZ2MH4GN"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398051,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS A CONSTANT RINGING OR BUZZING SOUND COMING FROM THE REAR BUMPER WHETHER CAR IS ON OR OFF CONSTANT RINGING SEEM TO APPEAR WHEN I'M WASHING THE VEHICLE AND THE TEMPERATURE IS LOW",
        "vin": "5N1AZ2MH7GN"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387772,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WE WERE DRIVING ON A CITY STREET OUR 2016 NISSAN MURANO WE COULD SMELL PLASTIC MELTING OR BURNING WHILE HAVING OUR DRIVER SEAT HEATING SYSTEM TURNED ON. WE TURNED OFF THE HEATING SYSTEM. NOW, OUR DRIVER SEAT HEATER DOES NOT TURN ON AT ALL. WE PLAN TO TAKE THE VEHICLE TO A NISSAN DEALERSHIP TO GET IT DIAGNOSED, BUT AFTER DOING SOME RESEARCH ONLINE, WE COULD READ THAT MANY OTHERS DEALT WITH THIS ISSUE PREVIOUSLY. THE ELECTRICAL HARNESS UNDER THE DRIVERS SEAT GETS TOO HOT AND BEGINS TO MELT.  IT SEEMS THAT THIS IS A SAFETY ISSUE DUE TO A FAILURE OF THE ELETRICAL HARNESS. I WILL HAVE A SPECIFIC DIAGNOSIS SOON.*DT CONSUMER STATED VEHICLE WAS TAKEN TO THE DEALER AND THEY DID NOT HAVE A SOLUTION.",
        "vin": "5N1AZ2MH2GN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366166,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF THE AUTOMATIC OPEN/CLOSE REAR HATCH. REQUIRES EXCESS FORCE TO MANUALLY OPEN AND CLOSE",
        "vin": "5N1AZ2MH1GN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366167,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT. HEATING AND COOLING FUNCTION FAILURE DUE TO CLIMATE CONTROL MODULE.  SEE TECH BULLETIN  NTB19-004",
        "vin": "5N1AZ2MH1GN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/24/2020",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366169,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INTELLIGENT FORWARD COLLISION WARNING RADAR SENSOR FAILURE. FAILED AT 37K MILES. MANUFACTURER AGREED TO NO CHARGE REPLACEMENT AFTER OWNER FILED COMPLAINTS WITH OUTSIDE AGENCIES.",
        "vin": "5N1AZ2MH1GN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363002,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS WITH THE CRUISE CONTROL ENGAGED, THE TRACTION CONTROL AND COLLISION MITIGATION WARNING LIGHTS ILLUMINATED. THE AUTOMATIC EMERGENCY BRAKING ENGAGED AND THE CRUISE CONTROL WAS DISENGAGED. THE CONTACT HAD TO DEPRESS THE ACCELERATOR PEDAL FOR THE VEHICLE TO RESUME NORMAL OPERATION. THE VEHICLE WAS TAKEN TO NISSAN OF NORTH OLMSTED (28500 LORAIN RD, NORTH OLMSTED, OH 44070) WHERE IT WAS DIAGNOSED AND IT WAS DETERMINED THAT THE DISTANCE SENSOR WAS DEFECTIVE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED INTERMITTENTLY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 79,000.",
        "vin": "5N1AZ2MHXGN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348736,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY LEAVING THE STORE I PUT THE CAR IN RESERVE TO COME OUT THE PARKING SPOT NOTHING HAPPEN TURN OFF THE CAR RESTART AND PUT THE CAR AGAIN INTO REVERSE STIL NOTHING HAPPENED THEN O TRY TO PUT THE CAR INTO PARK AND IT JUMP FORWARD. TWO WEEKS LATER THE SAME ISSUE AGAIN BUT PUT IT INTO DRIVE  IT DIDN'T EVEN MOVE THIS IS A 2016 NISSAN MURANO THAT I PURCHASE AT 43K MILES. NOW TOOK IT TO THE DEALER I NEED A NEW TRANSMISSION AT $5500 THIS CAR ONLY HAS 75K MILES NEVER EXPECT FOR IT TO BE OUT OF WARRANTY. NOW IM STUCK  PAYING FOR A CAR THAT I CAN'T DRIVE DUE TO THE CRAPPY TRANSMISSION ISSUE THAT IS AFFECTING NISSAN CAR.",
        "vin": "5N1AZ2MH6GN"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348384,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LEL MODELO PRESENTA LUZ EN EL PANEL DEL CONDUCTOR. LA UNIDAD FUE SCAN EN AUTK CENTRO NISSAN EXPERTOS EN LA UNIDAD Y REFLEJO CODICO QUE INDICA QUE EL RADAR FRONTAL DE COALICION EST DEFECTUOSO. ESTE MODELO NISSAN MURANO A PRESENTADOS EN OTRAS UNIDADES QUE ESTA PIEZA ES TIENE PROBLEMAS Y QUE EL MANOFACTURERO RECOMIENDA REEMPLAZO. LA COMPAIA DE GARANTIA EXTENDIDA CON TEL 1 800 323 5771 CON #CONTRATO PRAD1-51224 INDICAN QUE PARA ELLOS LA PIEZA NO ESTA DEFECTUOSA AUNQUE EN EL SCAN APAREZCA COMO FALLA. HABLE CON JOSE, EFRAIN Y AUN ESPERANDO LLAMADA DEL GERENTE ANTONIO LOS CUALES INDICAN QUE PARA ELLOS NO ES SUFICIENTE Y NO VAN A AUTORIZAR LA PIEZA. ESTA PIEZA NO ES UN ACCESORIO EN UN VEHICULO ESTA PIEZA PUEDE CAUSAR O EVITAR UN ACCIDENTE.*DT*JB",
        "vin": "5N1AZ2MG7GN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339057,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK UP CAMERA DISPLAY IS OFTEN, BUT NOT ALWAYS, SHOWING A BLACK SCREEN WHEN I PUT THE VEHICLE IN REVERSE.  I HAVE TO PUT THE VEHICLE IN PARK AND THEN REVERSE AGAIN TO MAKE IT WORK.  THIS HAPPENS ANYWHERE, IN THE GARAGE, IN A PARKING LOT OR ANYPLACE I HAVE TO PUT THE VEHICLE IN REVERSE. IT IS NOT CONSISTENT BUT HAPPENS ENOUGH TIMES TO BE A SAFETY ISSUE.",
        "vin": "5N1AZ2MHXGN"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "05/28/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326553,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS AND FRONT RADAR LIGHTS ON CLUSTER. I TOOK THE VEHICLE TO THE SAME DEALER THAT SOLD IT TO ME AND THEY DIAGNOSED THE SAME WITH A PROBLEM ON THE ABS ACTUATOR.  THE SERVICE REPRESENTATIVE ALSO TOLD ME THAT THE FRONT RADAR ON THE BUMPER IS RELATED TO THE ABS SYSTEM AND THAT THE WARRANTY OF THE VEHICLE ON THE ELECTRICAL PART DOES JOT COVER THE SAME.  I DID MY RESEARCH AND FOUND THAT THE 2016 NISSAN MURANO HAS AA MANUFACTURERS RECALL FROM THE ABS SYSTEM.  *TR   *BF  *AS",
        "vin": "5N1AZ2MGXGN"
    },
    {
        "components": "SUSPENSION,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325145,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "1. DRIVERS SEAT ROCKS AS IF IT IS BROKEN. COULD CAUSE PROBLEM WITH AIRBAG DEPLOYING IN A CRASH.  2. REAR SHOCKS/STRUTS SEAM TO BE WEAK OR COLLAPSED. MAKES VEHICLE SIT LOWER IN REAR, THIS CAUSES THE SUN TO REFLECT IN DRIVERS EYES BLINDING THE DRIVER. OUR VEHICLE IS SILVER IN COLOR. I*DT  *TR",
        "vin": "5N1AZ2MG9GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/12/2020",
        "dateOfIncident": "05/07/2020",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324248,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 NISSAN MURANO. THE CONTACT STATED RESEARCHED ON-LINE AND FOUND NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V807000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED THAT WHILE HIS WIFE WAS DRIVING APPROXIMATELY 15 MPH SHE DETECTED AN ELECTRICAL OR PLASTIC BURNING ODOR IN THE VEHICLE AND THE BRAKE WARNING LIGHT ILLUMINATED.  HIS WIFE THEN PARKED THE VEHICLE AND WALKED BACK TO HER RESIDENCE. THE CONTACT STATED THAT A NEIGHBOR NOTIFIED THEM THAT THEIR VEHICLE WAS ON FIRE. THE FIRE DEPARTMENT WAS CONTACTED AND EXTINGUISHED THE FLAMES.  A FIRE DEPARTMENT REPORT WAS FILED. THE VEHICLE WAS DESTROYED BY THE FIRE AND TOWED TO A TOW LOT. THE CONTACT STATED THEY WERE STILL AWAITING INFORMATION FROM THE INSURANCE APPRAISER. THE CONTACT CONTACTED THE DEALER TOM PEACOCK NISSAN (15300 NORTH FWY HOUSTON TX 77090, 281-821-4000) WHO REFERRED THE CONTACT TO THE MANUFACTURER AND TO NHTSA. THE CONTACT WAS UPSET THAT HE HAD NOT RECEIVED NOTIFICATION OF THE RECALL BY THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OPENED A CASE HOWEVER, NO RESOLUTION HAD BEEN PROVIDED AS OF YET. THE CONTACT STATED THE BRAKE WARNING LIGHT HAD ILLUMINATED IN THE PAST, BUT, NEVER REMAINED ON. THE APPROXIMATE FAILURE MILEAGE WAS 80,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*DS*JB  - (RECALL RELATED INCIDENT) TS",
        "vin": "5N1AZ2MG6GN"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/18/2020",
        "dateOfIncident": "11/04/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321472,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TITANIUM EDITION - PERIODICALLY ON START UP (STATIONARY) OF THE CAR THE SEAT WILL MOVE FORWARD, AND SOMETIMES THE BACK WILL RECLINE WHEN THIS HAPPENS.  THE STEERING WHEEL WILL DROP DOWN A LITTLE BIT AND THE SEAT MEMORY AND STEERING WHEEL WILL BE RESET TO THE POSITION THE SEAT MOVED TO AND THE STEERING WHEEL DROPPED DOWN TO.  THIS HAS BEEN OCCURRING SINCE THE VEHICLE WAS NEW AND IT ALSO HAPPENED ON MY OLD MURANO THAT WAS REPURCHASED FROM ME BY NISSAN.  26 OCCURRENCES IN 34,000 MILES.",
        "vin": "5N1AZ2MH3GN"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315561,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION LIGHT ILLUMINATES AFTER APPROX 10-15 MIN OF DRIVING THOUGH NO OBSTRUCTION EXISTS.  REAR HATCH BUTTON & OUTSIDE DOOR LOCK BUTTONS INTERMITTENTLY WORK.",
        "vin": "5N1AZ2MH9GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306666,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "\"PASSENGER AIRBAG OFF\"  LIGHT IS ON",
        "vin": "5N1AZ2MH5GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306664,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BACK PASSENGER  LIGHT IS ON...\"PASSENGER AIRBAG OFF\"",
        "vin": "5N1AZ2MH5GN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300099,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT HEATER OVER HEATED AND SHORTED.",
        "vin": "5N1AZ2MH5GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297906,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BACK PASSENGER LIGHT IS ON... SAYS \"PASSENGER AIR BAG OFF\"",
        "vin": "5N1AZ2MH5GN"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "01/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297351,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOSSES SPEED AND POWER WHILE LOCKED IN CRUISE CONTROL AT HIGHWAY SPEEDS. HAS OCCURRED MORE THAN 7 TIMES, ONCE NEARLY CAUSED MY VEHICLE TO BE REAR ENDED BY FOLLOWING TRUCK. VEHICLE ENGINE OVER REVS AND LOSSES SPEED AND POWER. SLOWING FROM 74 MPH TO 58MPH WITH ENGINE SPEED INCREASING FROM 1600 RPM TO OVER 4500 RPM. HAS BEEN BACK TO DEALER OVER 7 TIMES AND HAVE GOTTEN SAME RESPONSE, IT'S NOT CODING , SO THEY CAN'T FIX OR GIVE A REASON WHY THIS OCCURS. VEHICLE IS A SAFETY HAZARD TO OPERATE ON THE HIGHWAY AS IT CAN ACCELERATE OR LOSE POWER AND SLOW RAPIDLY INTO AN ACCIDENT.   IN CASE REQUESTED, I ALSO HAVE VIDEO AS AN MP4 SHOWING EXACTLY WHAT IS HAPPENING THAT WILL NOT UPLOAD. PLEASE EMAIL ME WITH INSTRUCTIONS AS TO HOW I CAN GET THIS VIDEO FILE SUBMITTED   THANK YOU",
        "vin": "5N1AZ2MH8GN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/27/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271368,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DISTANCE SENSOR, PART # 28438-5AA0B, LOCATED IN FRONT BUMPER, IS DEFECTIVE AGAIN.  THIS DISTANCE SENSOR IS TIED IN WITH THE CRUISE CONTROL.   AS OF YESTERDAY, I HAVE NO CRUISE CONTROL ON THIS VEHICLE--AGAIN.   THIS IS THE SECOND ONE ON THIS VEHICLE, AND THIS ONE LASTED LESS THAN 90 DAYS.  THE ORIGINAL ONE IN THE CAR LASTED JUST THREE YEARS.  THE DEALERSHIP CHARGED ME OVER $1500 TO REPLACE IT.",
        "vin": "5N1AZ2MH4GN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268251,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SURGING WHILE DRIVING. THE DEALERSHIP PICKED UP MY MURANO ON 10/4/19 AND HAS BEEN UNABLE TO FIND THE SOLUTION TO THE PROBLEM. I AM BEING TOLD THEY CAN NOT DUPLICATE THE PROBLEM THAT I HAD ON 10/3/19. THIS SAME PROBLEM OCCURRED A FEW MONTHS AGO AND I WAS TOLD THE PROBLEM HAD BEEN IDENTIFIED AND REPAIRED. YET, THIS TIME CAN'T FIND A PROBLEM. ALSO, THE DEALERSHIP SERVICE DEPARTMENT CAN NOT FIND A RECORD OF THIS REPAIR. I TRIED TO TELL THE NISSAN SERVICE MANAGER ABOUT A (TSB) NTB 18 041A DEALING WITH THE AUTOMATIC BRAKING SYSTEM ON THE 2015-2019 NISSAN SUV'S AND CARS. HE TOLD ME THAT WAS NOT THE PROBLEM BECAUSE THERE WOULD BE A CODE WHEN THE DIAGNOSTIC WAS PERFORMED.     MY HUSBAND HAS CANCER AND I DRIVE HIM TO AND FROM DUKE CANCER CENTER (160 MILES ROUND-TRIP). THIS PROBLEM OCCURRED AGAIN AND MY MURANO KEEP SURGING AND NEEDLESS TO SAY BY THE TIME I GOT HIM HOME HE WAS SO VERY NAUSEATED. A TRIP THAT NORMALLY TAKES ABOUT ONE AND HALF HOURS TOOK FOUR AND HALF HOURS. I AM HORRIFIED THIS PROBLEM WILL OCCUR AGAIN AND I REFUSE TO KEEP DRIVING AND MAKING MY HUSBAND SICK AND NAUSEATED AGAIN SO WE WILL BE STRANDED ON THE SIDE OF THE ROAD WAITING FOR SOMEONE TO ASSIST.",
        "vin": "5N1AZ2MG6GN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244234,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DISTANCE SENSOR, LOCATED BELOW THE FRONT BUMPER, FAILED. THIS \"DISTANCE SENSOR\" IS INTEGRAL TO THE CRASH AVOIDANCE SYSTEM.  THE SENSOR , ALONG WITH THE CRUISE CONTROL, MAINTAINS A SAFE DISTANCE BETWEEN MY CAR AND THE CAR DIRECTLY AHEAD OF ME.  WHEN THIS SENSOR FAILED, I HAD NO CRUISE CONTROL AND THE CONCEPT OF KEEPING A SAFE DISTANCE AHEAD OF ME DISAPPEARED.  THIS SENSOR FAILED DRIVING DOWN A BUSY INTERSTATE HIGHWAY.",
        "vin": "5N1AZ2MH4GN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233167,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 NISSAN MURANO. FRONT RADAR UNAVAILABLE. BOUGHT THE CAR WITH APR.33K MILES. NOTICED LIGHT COMING ON AND ALARMING AT APR. 37K MILES.RADAR UNAVAILABLE WARNING APPEARS MULTIPLE TIMES DURING DRIVING.WAITING FOR REPLY FROM NISSAN CORPORATE TO SEE IF THEY WILL COVER REPAIR.SAFETY ISSUE",
        "vin": "5N1AZ2MH1GN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/26/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222804,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT BECOMES LOOSE, BASED ON THE BOLT MOUNTS BREAKING FROM THEIR WELDS.  UNSAFE TO DRIVE BASED ON THE SEAT MOVING BACK AND FORWARD WHEN APPLYING THE BRAKES OR PRESSING THE GAS PEDAL.",
        "vin": "5N1AZ2MH1GN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "06/10/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219676,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE GETTING AN OIL CHANGE AT 62000 MILES, IT WAS NOTED THAT THERE WAS A LEAK AROUND THE TRANSMISSION.  WE TOOK THE VEHICLE TO THE NISSAN DEALER AND THE NTED THE TRANSMISSION CASING WAS CRACKED. THE CRACK IS A STRUCTURAL FAILURE, NOT TGE RESULT OF A PHYSICAL DAMAGE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/10/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219126,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS CAR USED, IN MARCH 2019. IT STARTED SHORTLY AFTER BUYING IT AND CONTINUES TO HAPPENED. .  REPEATEDLY , WHILE CITY AND HIGHWAY DRIVING, A WARNING COMES ON 'FRONT RADAR UNAVAILABLE DUE TO OBSTRUCTION' AND THE CRUISE CONTROL IS DEACTIVATED. I TOOK IT BACK TO THE DEALER AND THEY SAID THIS WAS NORMAL.  ITS NOT NORMAL.",
        "vin": "5N1AZ2MG1GN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186844,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY MURANO IN FOR AN OIL CHANGE AND HAD A 30K SERVICE CHECK DONE AT THAT TIME.  A BROKEN ENGINE MOUNT WAS FOUND.  SINCE THE CAR HAD JUST 36,134 MILES ON IT AND I PURCHASED IT NEW WITH 281 MILES ON THE ODOMETER (DEALER TRADE), I CONTACTED NISSAN CUSTOMER SERVICE TO REQUEST THAT IT BE CONSIDERED COVERED UNDER WARRANTY.  THEY EMPHATICALLY DENIED MY CLAIM, THEREBY LOSING A LOYAL, REPEAT CUSTOMER.  I COULD UNDERSTAND IF I WAS 10K OVER WARRANTY, BUT 134 MILES?  THIS IS A HUGE SAFETY CONCERN AND I'D LIKE FOR THE BROKEN ENGINE MOUNT TO BE NOTED.  IF I CAN HELP OTHERS BY CONTRIBUTING TO A RECALL OR AT LEAST WARNING THEM OF POOR QUALITY AND BAD CUSTOMER SERVICE, THEN I'LL FEEL I'VE DONE MY PART.",
        "vin": "5N1AZ2MH8GN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181551,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. WHEN THE VEHICLE WAS APPROACHING A STOP, IT LUNGED FORWARD. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE FAILURE OCCURRED INTERMITTENTLY.  MARTIN NISSAN (5240 GOLF RD, SKOKIE, IL 60077, (866) 800-1100) INFORMED THE CONTACT THAT THE FAILURE WAS NORMAL AND THE VEHICLE DID NOT NEED TO BE REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "5N1CZ2MHXGN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181333,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WILL LURCH FORWARD AND THEN WHEN I COME TO A STOP, IT WILL STALL OUT.  I TOOK IT TO MY SERVICE PROVIDER AND THEY TOLD ME THERE WAS AN ISSUE WITH THE TORQUE CONVERTER IN THE TRANSMISSION.  I TAKE IT TO THE NISSAN DEALER AND THEY TELL ME THERE IS NO ISSUE AND THEY DON'T KNOW WHY THIS IS HAPPENING.",
        "vin": "5N1AZ2MHXGN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/04/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161274,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WORLD NISSAN GAVE ME A PRINTED OUT INVOICE WHICH STATES 97616 WAR FOR WARRANTY AND ON IT WAS PRINTED INFORMATION RECALL FIIELD SERVICE ACTION: R1809 MAX MUR ABS ACTUTOR NTB18065 RECALL REFERENCE PREVIOUS ROL COMPLETED CONCERN COMPLIMENTARY 27 POINT INSPECTION  AND WINDOW WIPER FLUID DOE NOT WORK WELL.   WENT BACK THREE TIMES AND THEY KEPT SAYING THEY DID NOT HAVE THE PARTS TO DO THE RECALL REPAIR.  NO VERIFICATION WAS GIVEN WORK WAS EVER DONE.   THEY NEVER GAVE ME A COPY OF THE RECALL NOTICE OR ANY TSB'  S RELATED.  WHEN LOOKED ON NHTSA SITE IT SAID NO RECALLS BUT YOUR SITE SAYS MANUFACTURER IS REQUIRED TO GIVE IT TO ME.",
        "vin": "5N1AZ2MG5GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "11/11/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151042,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED  RECALL 18V-601 FOR A 2016 NISSAN MURANO. I AM NO LONGER THE REGISTERED OWNER. WE TRADED THIS CAR IN 4 MONTHS AGO AT A NISSAN DEALER. NISSAN IS USING SERVICE RECORDS FROM THE DEALERSHIP TO IDENTIFY REGISTERED OWNERS. THIS CAR AS PROBABLY BEEN SOLD AS A PRE-OWNED CAR; THE NEW OWNER WILL NOT RECEIVE THIS RECALL NOTICE AND IS NOT AWARE OF THE SAFETY ISSUE, ESPECIALLY IF THE CAR IS NOT SERVICED AT THE NISSAN DEALERSHIP.",
        "vin": "5N1AZ2MH2GN"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143428,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ADAPTIVE CRUISE CONTROL AND FORWARD EMERGENCY BRAKING (FEB) SYSTEM BECOMES SPONTANEOUSLY DISABLED DURING DRIVING.  THIS POSES A SERIOUS ISSUE WHEN ACTUALLY DRIVING THE CAR.  THE CAR IS IN MOTION WHEN THIS HAPPENS.  THE SYSTEM CAN ONLY BE RESET BY STOPPING THE CAR, TURNING OFF THE IGNITION AND THEN RE-STARTING THE ENGINE.",
        "vin": "5N1AZ2MGXGN"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129091,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT LIGHT OFF WHEN PASSENGER IS IN CAR.  THIS HAPPENS ON AND OF, I CANNOT PREDICT WHEN IT HAPPENS. THE PASSENGER SEAT BELT LIGHT IS ON INDICATING THERE IS NOT NO PASSENGER ON THE SEAT WHEN MY DAUGHTER IS SITTING IN IT. THIS HAS HAPPENED WITH THE CAR STATIONARY AND IN MOTION. I'VE CALLED THE DEALER AND THEY SAID THERE WAS NO RECALL FOR MY VEHICLE WITH REGARDS TO THIS SPECIFIC ISSUE. IT APPEARS THAT I'M NOT THE ONLY ONE EXPERIENCING THIS ISSUE. PLEASE HAVE NISSAN FIX THIS PROBLEM. THANKS",
        "vin": "5N1AZ2MG6GN"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129093,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKING NOISE FRONT WHEEL WHEN TURNING RIGHT  WHEN I TURN RIGHT I HEAR A CLICKING OR KNOCKING OR FLAPPING NOISE. IT APPEARS THAT THERE IS SOMETHING STUCK IN THE WHEEL. IT DOES IT FREQUENTLY AFTER THE CAR HAS BEEN RUNNING FOR AWHILE. THE DEALER INSTEAD OF LOOKING INTO THE ISSUE IS ASKING FOR MONEY IN ORDER TO DIAGNOSE IT. THIS IS AN ISSUE WITH NISSAN FROM THE ONLINE RESEARCH I DID. PLEASE HAVE NISSAN ADDRESS THIS ISSUE. THANKS",
        "vin": "5N1AZ2MG6GN"
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102636,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. AFTER DRIVING VARIOUS SPEEDS FOR MORE THAN THIRTY MINUTES, THE VEHICLE SUDDENLY BECAME UNRESPONSIVE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE RPMS INCREASED, BUT THE SPEED DID NOT. ALSO, THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO WORLD CAR NISSAN (12908 NORTH INTERSTATE HWY 35 BLDG 1, SAN ANTONIO, TX) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION WAS FAULTY. THE TRANSMISSION WAS REPLACED AND THE FAILURE WAS REMEDIED. IN ADDITION, THE WINDSHIELD WIPER PUMP WOULD BECOME CLOGGED WITH DEBRIS AND FAILED TO OPERATE CORRECTLY. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO SOLUTION WAS OFFERED. THE FAILURE MILEAGE WAS 89,000.",
        "vin": "JN8AZ1MUXEW"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092785,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WARM DAY, DRIVING WITH THE SUNROOF OPEN ON THE HWY IN STOP IN GO TRAFFIC. ALL OF SUDDEN HEAR THIS LOUD BOOM AND THE PANORAMIC ROOF SHATTERS. TRAFFIC WAS GOING ABOUT FIVE TO TEN MILES AN HOUR SO I KNOW IT WASN'T A ROCK THAT HIT IT. PLUS MY LOCATION WAS NOT UNDER ANYTHING THING, NO TREES, NO BYPASSES. DEALERSHIP IS SAYING A ROCK HIT. GEICO IS CALLING IT COMPREHENSIVE DAMAGE (HIGHER DEDUCTIBLE, INSTEAD OF GLASS REPAIR ($50 DEDUCTIBLE)). I WAS ABLE TO CONTINUE DRIVING, GLASS FELL IN THE BACK SEAT.",
        "vin": "5N1AZ2MGXGN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/05/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092072,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG DEACTIVATES ITSELF RANDOMLY WHILE A PASSENGER IS SEATED AND BELTED IN.  THIS CONTINUES EVEN WHILE THE CAR IS MOVING.  THE ELECTRICAL COMPUTER SYSTEM ALSO INTERMITTENTLY MALFUNCTIONS AND WON'T FOLLOW THE TOUCH SCREEN'S COMMANDS OR COMMUNICATE WITH PAIRED CELL PHONES.  THIS HAS BEEN REPORTED MULTIPLE TIMES BOTH TO THE DEALERSHIP AND TO NISSAN DIRECTLY.  THE DEALERSHIP HAS TRIED MULTIPLE TIMES TO DIAGNOSE THE PROBLEM AND FAILED EVERY TIME.  THEY NO WON LONGER RETURN OUR CALLS.  WE HAVE 3 VIDEOS SPREAD OVER MANY MONTHS THAT PROVE THE PROBLEM IS OCCURRING, BUT THE DEALERSHIP NO LONGER RESPONDS, AND NEITHER DOES NISSAN.  THESE MALFUNCTIONS OCCUR AS SOON AS THE CAR IS STARTED AT REST AND CONTINUES WHILE IN MOTION AT ALL SPEEDS INCLUDING HIGHWAY TRAVEL AND CITY STREETS.  I WOULD LIKE THE DOT AND THE HSA TO GIVE ME SOME WAY TO SUBMIT THE VIDEOS THAT SHOW THIS INTERMITTENT PROBLEM IS OCCURRING, AND TO FORCE NISSAN TO FIX THIS OR REFUND OUR MONEY BEFORE IT GETS ME KILLED.",
        "vin": "5N1AZ2MH5GN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "02/06/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088705,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. THE CONTACT STATED THAT THE PASSENGER SEAT HEATER FAILED TO OPERATE WHEN ACTIVATED. THE VEHICLE WAS TAKEN TO CAPITAL NISSAN (5501 MARKET ST, WILMINGTON, NC 28405, (910) 392-4300) WHERE IT WAS DIAGNOSED THAT THE SEAT HEATER SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. AS THE CONTACT WAS LEAVING THE DEALER, THE SWITCH FAILED AGAIN. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THE WIRING HARNESS WAS REPLACED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CASE NUMBER: 30388450 WAS OPENED. THE APPROXIMATE FAILURE MILEAGE WAS 32,000.",
        "vin": "5N1AZ2MH8GN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "03/04/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079075,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HOOD HAS ABOUT A 3 INCH PORTION NEAR THE WINDSHIELD THAT IS ANGLED TOWARDS THE CAB OF THE VEHICLE. ON SUNNY DAYS, THE SUN REFLECTS INTO THE VEHICLE CAUSING A BLINDING REFLECTION. THIS HAPPENS ON SUNNY DAYS, STANDING STILL OR IN MOTION. I TOOK MY VEHICLE ON A ROAD TRIP AND IT WAS TERRIBLE DRIVING FOR HOURS WITH A BLINDING LIGHT IN YOUR FACE. I BOUGHT MY VEHICLE USED. SO THE MILES WHEN I FIRST GOT MY VEHICLE WERE APPROXIMATELY 21,000. THIS IS PROBABLY WHY IT WAS LESS EXPENSIVE.",
        "vin": "5N1AZ2MH9GN"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079097,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AND ALL THE WARNING INDICATORS ILLUMINATED. ON THE OUTSIDE OF THE VEHICLE, THERE WAS A BURNING ODOR. THE VEHICLE WAS TAKEN TO PRICE LEBLANC NISSAN (14295 AIRLINE HWY, GONZALES, LA 70737, (225) 743-8100) WHERE IT WAS DIAGNOSED THAT THE ABS MOTOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V636000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER INFORMED THE CONTACT THAT THE SERIAL NUMBER WAS NOT INCLUDED IN THE RANGE OF THE RECALL AND DID NOT OFFER FURTHER ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 19,000.",
        "vin": "5N1AZ2MGXGN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2018",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072114,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE HAVING A PROBLEM WITH THE PASSENGER AIR BAG LIGHT. IT DOESN'T ALWAYS GO OFF WHEN SOMEONE IS SITTING IN THE PASSENGER SEAT. WE'VE BEEN INFORMED IF THE LIGHT DOES NOT GO OFF THE PASSENGER WILL NOT BE PROTECTED BY THE AIR BAG SYSTEM. WE'VE BEEN TOLD TO TURN THE CAR OFF THEN RESTART IT THAT THIS WILL SOLVE THE PROBLEM. THIS MEANS WE HAVE TO LEAVE THE ROAD FIND A PLACE TO PARK SHUT THE CAR OFF AND RESTART IT.  THIS CAN BE VERY DIFFICULT WHEN ON THE FREEWAY. OUR CONCERN IS SOMETIME WE MAY NOT NOTICE THE AIR BAG LIGHT IS ON, HAVE AN ACCIDENT AND THE PASSENGER WON'T BE PROTECTED BY THE AIR BAGS. THIS HAS BEEN GOING ON HUNDREDS OF TIMES SINCE WE BOUGHT THE CAR BRAND NEW IN JUNE 2016 AND NISSAN TELLS US THEY CAN'T FIND ANYTHING WRONG WITH IT.    *JS",
        "vin": "5N1AZ2MH1GN"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/11/2018",
        "dateOfIncident": "12/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062234,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. WHEN STARTING THE VEHICLE AND ACTIVATING THE SEAT HEATER ON THE DRIVER'S SEAT, IT FAILED TO WORK CORRECTLY. THE CONTACT DROVE THE VEHICLE TO THE DEALER (PRIORITY NISSAN, 12925 JEFFERSON AVE, NEWPORT NEWS, VA 23608) WHERE IT WAS DIAGNOSED THAT THE WIRING HARNESS WAS FAULTY. THE MANUFACTURER WAS CONTACTED. THE CONTACT STATED THAT THE ENTIRE SEAT NEEDED TO BE REPLACED, BUT NISSAN REFUSED TO REPLACE THE SEAT. THE VEHICLE WAS NOT REPAIRED BECAUSE PARTS WERE UNAVAILABLE. THE DEALER PROVIDED THE CONTACT WITH A LOANER VEHICLE IN THE INTERIM. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 13,000.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047990,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PHOTO SHOWS HOW THE SUN REFLECTS OFF THE RIDGELINE OF THE HOOD AT THE BASE OF THE WINDSHIELD IN SUCH A WAY AS TO PARTIALLY BLIND THE DRIVER. THIS PARTICULAR IMAGE IS NOT DIRECTLY IN FRONT OF THE DRIVER (HARD TO CAPTURE WHILE DRIVING), BUT IT DOES SHOW THE ANGLE OF THE REFLECTION. IT HAPPENS ALL THE TIME ON SUNNY DAYS, DEPENDING ON THE HOUR AND DIRECTION OF TRAVEL RELATIVE TO THE SUN (SEEMS TO OCCUR MOST OFTEN WHEN THE SUN IS OVERHEAD AND JUST BEHIND THE CAR).    IT IS A SIGNIFICANT DESIGN FLAW. IF THERE AREN'T CASES WHERE THE REFLECTION HAS CAUSED AN ACCIDENT, I'D BE SURPRISED, BUT I'M HOPING ENOUGH PEOPLE WILL COMPLAIN TO THE NHTSA THAT NISSAN WILL BE CALLED TO ACCOUNT. I JUST HOPE IT DOESN'T TAKE A DEATH OR SERIOUS INJURY TO INITIATE CORRECTIVE ACTION ON NISSAN'S PART.",
        "vin": "5N1AZ2MH9GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2017",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044751,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY WIFE WAS DRIVING HOME FROM WORK HER BRAKE PEDAL STARTED DEPRESSING TO THE FLOOR, AND THE CAR WOULD NOT STOP QUICKLY. WHEN SHE FINALLY MADE IT HOME, I CHECKED THE BRAKES AND THEY ARE STILL ACTING THE SAME WAY IN OUR DRIVEWAY. SHE WAS DRIVING HOME ON CITY STREETS AND THE HIGHWAY.",
        "vin": "5N1AZ2MHXGN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035227,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MURANO WAS TRAVELING APPROX 40 MPH DOWN THE ROAD WHEN THE SUNROOF SHATTERED. I HAVE A DASH CAM VIDEO OF THE INCIDENT. YOU CAN SEE IN THE VIDEO THERE WASN'T A CAR IN FRONT OR TO THE SIDE TO CLAIM A ROCK CAUSED THIS. DEALERSHIP WOULD NOT REPLACE UNDER WARRANTY CAR IS LESS THAN A YEAR OLD WHEN PURCHASED.",
        "vin": "5N1AZ2MH8GN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/13/2017",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004982,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 4 LANE DEVIDED HIGHWAY AT NIGHT WITH NO TRAFFIC, LARGE PLASTIC TRIM PIECES   STARTED FLYING OFF.  I WAS ABLE TO STOP & WITH MY POLICE MAGLITE CONFIRMED I HAD NOT HIT ANYTHING. THE WHEEL TRIM PIECE PASSENGER FRONT CAME OFF & FLEW UP INTO THE REAR WHEEL WELL, KNOCKING IT LOSE AS WELL. ON THE SAME TRIP, A PIECE CAME LOSE ON I-95 AT NIGHT. I STOPPED & PULLED THE CLANGING PIECE THE REST OF THE WAY OFF TO AVOID DAMAGING THE PAINT. IT WASN'T WORTH RISKING MY LIFE. CHECKING LATER A BLACK VENT COVER ON THE FRONT BUMPER HAD COME OFF ALONG WITH AN ACCESS PANEL ON THE BUMPER. I DON'T RATTLE EASILY DRIVING BUT IT SHOOK ME UP A BIT, AN INEXPERIENCED DRIVER WOULD HAVE A WRECK. BUDGET RENT A CAR HERNDON VA INSISTS I HAD AN ACCIDENT, I DID NOT. I HAVE PICS & BELIEVE THIS WAS ACTUALLY PRIOR DAMAGE THAT WAS NOT PROPERLY REPAIRED. IN SHORT I WAS RENTED A COSMETICLY REPAIRED DAMAGED CAR, PUTTING CUSTOMERS AT RISK. IN CASE IT'S A DESIGN FLAW, I THOUGHT IT SHOULD BE CALLED OUT. I DID NOTICE TWO DESIGN ISSUES I BELIEVE MAY CAUSE DRIVERS PROBLEMS.  IN BOTH CASES THE CAR WAS BEING DRIVEN NORMALLY ON CLEAR OR MODERATE CONDITIONS. ONE OF THE PHOTOS SHOWS THE CLEAR TAPE CONSISTENT WITH A HEADLIGHT HAVING BEEN REPLACED.",
        "vin": "5N1AZ2MH5NH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/21/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968941,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER CERTAIN LIGHTING CONDITIONS FROM THE SUN, A STRONG GLARE CAN APPEAR AND COME THROUGH THE WINDSHIELD AND INTO THE DRIVER'S AND/OR PASSENGER'S EYESIGHT.    THIS IS CAUSED BY THE DESIGN OF THE HOOD AND WHERE IT DIPS DOWN NEAR THE FRONT EDGE OF THE WINDSHIELD.  THERE IS ABOUT A 5\" WIDE AREA THAT SPANS THE WITH OF THE HOOD, AROUND THE LOWER SECTION OF THE WINDSHIELD.    I HAVE READ OF OTHERS HAVING THIS SAME ISSUE AND THE LIGHT CAN BE 'BLINDING' AT TIMES LIKE THE LIGHT REFLECTING OFF A MIRROR ON A BRIGHT SUNNY DAY.    FOR SAFETY REASONS, I HAVE DECIDED TO COAT THIS AREA OF THE HOOD WITH EITHER A MATTE FINISHED VINYL OR A MATTE FINISHED PLASTI-DIP SPRAY.  I AM HOPING THIS WILL ALLEVIATE/ELIMINATE THE DANGERS OF THIS GLARE THAT CAN HAPPEN.    ** TO NOTE, I HAVE READ OF OTHERS EXPRESSING THEIR CONCERNS WITH THIS ISSUE ON AUTOMOTIVE FORUMS SO I KNOW IT IS MORE COMMON THAN ORIGINALLY THOUGHT",
        "vin": "5N1AZ2MH7GN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 NISSAN MURANO. CONSUMER WRITES IN REGARDS TO FAULTY ABS LIGHT. *LD  THE CONSUMER REFERENCED RECALL # 16V636000. *JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/17/2017",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966617,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE FROM MODERN NISSAN OF CONCORD ON JAN 11 2017 BUT DID NOT HAVE THE CAR IN MY POSSESSION UNTIL JAN 20.  I HAD TO TRAVEL TO UVA HOSPITAL WITH MY MOTHER AFTER A MAJOR SURGERY DRIVING HER HOME ON I77 A BLAST OF AIR JOLTED THE CAR BECAUSE THE HOOD CAME UNLATCHED AND BOUNCED UP N DOWN UNTIL I COULD SAFELY EXIT THE INTERSTATE.  I TRADED THE CAR IN ON JAN 25 DUE TO THIS AND OTHER ISSUES I PERSONALLY HAD WITH THE CAR.  THE 2ND OWNER DAWN TREXLERS PURCHASED THE CAR AFTER ME AND SHE CONTACTED ME AND INFORMED ME THERE WAS A HOOD ISSUE STILL AT HAND AFTER HER PURCHASE DUE TO THE HOOD WASN'T FIXED PROPERLY.  I JUST WANTED TO MAKE YOU ALL AWARE.",
        "vin": "5N1AZ2MG6GN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/04/2017",
        "dateOfIncident": "01/08/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958607,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON INTERSTATE AT 70 MPH, FRONT PASSENGER DOOR WINDOW SUDDENLY AND UNEXPECTEDLY SHATTERED INTO THOUSANDS OF PIECES FALLING ONTO PASSENGER, EXTERIOR, AND BLOWING AROUND INTERIOR OF VEHICLE. TO BEST OF OUR KNOWLEDGE NOTHING HIT THE WINDOW, NO CAR WAS ON EITHER SIDE OF US. PIECES OF GLASS CUT PASSENGER, BUT LUCKILY NONE GOT INTO EYES OF PASSENGER OR DRIVER. THIS CAUSED DRIVER TO SWERVE , BUT RECOVERED CONTROL. SMALL PIECES OF GLASS IN DRIVER'S HAIR ETC. HAD TO DRIVE 350 MILES HOME IN COLD WEATHER . TOOK VEHICLE TO A DEALER [ TRAVELLING , SO NOT SELLING DEALER]. DEALER NOTIFIED MANUFACTURER OF PROBLEM AND REPORT OF INCIDENT. MANUFACTURER RESPONDED THAT SINCE ALL PIECES OF GLASS COULD NOT BE RECOVERED, THEY COULD NOT REASSEMBLE ENTIRE WINDOW, THEREFOR IMPOSSIBLE TO TEST GLASS FOR DEFECTS. YET THERE WAS LARGE AMOUNT OF GLASS INSIDE OF VEHICLE. OWNER STATED THAT BY THAT REASONING NO SHATTERED WINDOW WOULD EVER BE INVESTIGATED, SO HOW WOULD ANYONE KNOW IF DEFECTIVE? CONCERN IS WITH REMAINING WINDOWS IN SAME VEHICLE AS WELL AS OTHERS MFG AT SAME TIME. MIGHT SOMETHING , UNBEKNOWN TO OWNER , HAVE STRUCK SUBJECT WINDOW PREVIOUSLY WHILE PARKED UNATTENDED, LEAVING NO MARK, BUT WEAKENING GLASS ALLOWING FUTURE SUDDEN SHATTER ? MAYBE. BUT POSSIBILITY ALSO EXISTS OF DEFECTIVE GLASS OR INSTALLATION DURING ASSEMBLY, BUT MANUFACTURER REFUSED TO INVESTIGATE THAT POSSIBILITY REPEATING THAT THEY WOULD NEED EVERY PIECE OF GLASS[IMPOSSIBLE]. IF OTHER SAME MAKE AND MODEL EXPERIENCE SAME, IT INCREASES DEFECT POSSIBILITY. IF OUR INCIDENT IS ONLY ONE, IT INCREASES CHANCE OF OURS BEING PREVIOUSLY DAMAGED. AT MINIMUM, ALL DRIVERS BE AWARE, AS WE NARROWLY ESCAPED DISASTER IN ABOVE CASE. DEALER WAS VERY HELPFUL, MANUFACTURER CONCERNED AND HELPFUL, BUT RESTATED THEY COULD NOT TEST GLASS  WITHOUT ALL PIECES. DOES MFG MAKE, OR PURCHASE GLASS FROM VENDOR?",
        "vin": "5N1AZ2MHXGN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2017",
        "dateOfIncident": "12/26/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954755,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 NISSAN MURANO.  CONSUMER WRITES IN REGARDS TO VEHICLE SPEED DECLINES- SERVICE DEPARTMENT STATES DRIVER BELT ISSUES, OIL PRESSURE AND ENGINE PROBLEMS.  *SMD  THE CONSUMER STATED THE VEHICLE WOULD ONLY GO 30 MPH. AFTER ABOUT TWO MINUTES, THE SPEED STARTED TO DECLINE QUICKLY. *JB",
        "vin": "5N1AZ2MG4GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2017",
        "dateOfIncident": "02/05/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956377,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "190 POUND PASSENGER SITTING STRAIGHT UPRIGHT, AIRBAG LIGHT IS ILLUMINATED ON CENTER CONSOLE INDICATING THAT THE PASSENGER AIRBAG IS TURNED OFF WHILE VEHICLE IN MOTION FOR AT LEAST 30 MINUTES IN DURATION. I RARELY HAVE PASSENGERS BUT THIS HAS OCCURRED TWICE IN 10K MILES. I PURCHASED THE VEHICLE IN 9/2016.",
        "vin": "5N1AZ2MG5GN"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10950095,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN MURANO 2016 AND ON OUR PREVIOUSLY OWNED 2014 PATHFINDER, WHEN STATIONARY, THE POWERED BACK LIFTGATE CAN REVERT DIRECTION WHEN IT'S AUTOMATICALLY OPENING TO AUTOMATICALLY CLOSING WHEN THERE'S ACCUMULATED SNOW OR HEAVY SNOWFALL, WHEN THERE'S WEIGHT. THE FORCE FOR IT'S POWERED CLOSING IS ENOUGH TO PINCH SOMEONE BETWEEN CAR OR TO HIT THEIR HEAD.   NISSAN HAS ACKNOWLEDGED THIS IS BY DESIGN AND \"NO REPAIR OPTION\" BOTH AT DEALER AND WITH MY CALL WITH ANDREA FROM NISSAN NORTH AMERICA'S CUSTOMER CARE DEPARTMENT.  HOWEVER, IT IS A DANGER.  IN OUR CASE, THE FORCE OF IT COMING DOWN AND MY WIFE STANDING UP AFTER PUTTING IN GROCERY, NOT REALIZING THE GATE IS COMING DOWN ON HER, RESULTED IN HER HITTING HER HEAD ON THE LIFT GATE COMING DOWN AND CAUSED INJURY TO HER HEAD AND HER HEAD TO SWELL.  THERE ARE ALSO OTHER COMPLAINTS OF SIMILAR SITUATION ONLINE PER BELOW.  IT IS A ACTUAL DANGER AND SHOULD BE CORRECTED BY NISSAN.  IT SHOULD NOT COME DOWN BUT INSTEAD SHOULD JUST STOP.  IT CAN BE EASILY REPRODUCED AND WE HAVE VIDEO TO SHOW HOW IT CAN BE REPRODUCED WHEN THERE'S WEIGHT ON THE LIFTGATE SUCH AS ENOUGH SNOW ACCUMULATION ON IT.  HTTP://WWW.CARCOMPLAINTS.COM/NISSAN/PATHFINDER/2014/BODY_PAINT/LIFTGATE_OPENS_AND_CLOSES_WITHOUT_HITTING_BUTTON.SHTML",
        "vin": "5N1AZ2MH9GN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950108,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SIX-MONTH OLD 2016 NISSAN MURANO PLATINUM HAD SPONTANEOUS COMBUSTION OF MOON ROOF WHILE DRIVING ON FREEWAY IN GOOD WEATHER. THERE WERE NO CARS AROUND ME AND NO OVERHEAD PASS. THERE WERE NO BUMPS IN THE ROAD. I SAW NO ROCKS OR ANYTHING COMING TOWARD THE CAR. THERE WAS NO PREVIOUS DAMAGE. I HEARD A SNAP SOUND AND A LOUD BANG LIKE A GUNSHOT OR BOMB. IT SCARED ME. I DIDNT KNOW WHAT HAD HAPPENED UNTIL I WAS OFF THE FREEWAY AND CHECKED MY CAR OUT. THE DEALER WILL NOT PAY FOR IT. THEY SAY IT WAS A ROCK. THERE WAS NO ROCK SEEN AND NO ROCK FOUND IN THE HOLE ON TOP OF MY CAR/MOONROOF.  RESEARCH ONLINE SHOWS THAT MANY PEOPLE ALL OVER THE WORLD ARE REPORTING THIS HAPPENING FOR NISSAN AND OTHER CAR MAKES. ALL THE PICTURES AND THE STORIES REPORTED ARE THE SAME. I TOOK PICS. CAR MAKERS ARE USING CHEAPER, THINNER GLASS FOR MOON/SUN ROOFS TO KEEP DECENT MILEAGE. THE GLASS CAN BE INSTALLED WRONG, TEMPERED WRONG OR IS NOT FITTED WELL CAUSING IT TO HAVE ISSUES WITH PRESSURE. I HAVE NOTICED MOST OF THESE REPORTS INDICATE THE OCCURRENCE WHILE THE CAR IS TRAVELING ON A FREEWAY WHERE IT WOULD BE HIGHER SPEEDS THAN IN THE CITY. PLEASE INVESTIGATE. NISSAN OF BAKERSFIELD NEEDS TO PAY AND STAND BY THE CUSTOMER IN THIS CONCERN OF A DEFECTIVE PRODUCT.",
        "vin": "5N1AZ2MG8GN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/05/2017",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949621,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED INTERMITTENT POWER SYSTEM FAILURES SHORTLY AFTER PURCHASING A NEW 2016 MURANO ON 12/28/16.    I FIRST NOTICED THE PROBLEM ON 1/4/17 WHEN I WAS MAKING A RIGHT TURN ONTO A TWO-WAY ROAD.  THE POWER SYSTEM FAILED IMMEDIATELY AFTER ENTERING THE TURN AND THE STEERING WHEEL BEGAN TO PULL HARD AGAINST THE DIRECTION OF THE TURN.  THIS CAUSED MY VEHICLE TO OVERSHOOT THE TURN AND I WAS DRIVING IN THE LANE OF OPPOSING TRAFFIC PULLING HARD ON THE WHEEL TO RECOVER.  THEN SUDDENLY THE POWER RETURNED AND MY VEHICLE VEERED HARD TO THE RIGHT IN THE ORIGINAL DIRECTION OF THE TURN.  THERE WAS NO ONCOMING TRAFFIC SO I WAS ABLE TO AVOID AN ACCIDENT.    THE SECOND OCCURRENCE WAS ON 1/5/17 WHEN I WAS BACKING THE VEHICLE OUT OF A PARKING SPACE.  THERE WAS ABSOLUTELY NO POWER STEERING SO THE VEHICLE DID NOT TURN AS EXPECTED INTO THE TRAFFIC LANE.  I RETURNED THE VEHICLE TO THE ORIGINAL PARKING SPACE AND SHUT OFF THE ENGINE.  RESTARTING THE ENGINE CAUSED THE POWER STEERING TO FUNCTION CORRECTLY AGAIN.    THE THIRD OCCURRENCE WAS ON 1/6/17 WHILE DRIVING THE VEHICLE TO A NISSAN DEALER FOR REPAIR.  AGAIN THE POWER STEERING FAILED MOMENTARILY WHILE MAKING A RIGHT TURN.  I WAS DRIVING SLOWER THAN USUAL AND I WAS PREPARED TO ADJUST MY FORCE ON THE WHEEL BECAUSE I WAS AWARE OF THE PROBLEM.    THE NISSAN SERVICE DEPARTMENT DIAGNOSED THE PROBLEM AND FOUND THAT THE CONNECTOR E62 TERMINAL 5 WIRE WAS OUT OF POSITION (SEE ATTACHED SERVICE REPORT).  SO THE PROBLEM WAS BASICALLY CAUSED BY A MANUFACTURING DEFECT.    I WAS VERY FORTUNATE TO HAVE AVOIDED AN ACCIDENT WITH THIS VEHICLE.",
        "vin": "5N1AZ2MGXGN"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2017",
        "dateOfIncident": "01/28/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948774,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED THIS CAR FOR 5.5 MONTHS NOW .IT HAS A RAMDAM PROBLEM WHEN I TRY TO   PULL OUT.WHEN I PUSH THE GAS PEDAL DOWN IT MAY OR MAY NOT PULL OUT BUT IF IT  HESITATES [FROM 3 TO 20 SECONDS] IT WILL FINALY PULL OUT BUT IF YOU HAVE THE PEDAL  PUSHED DOWN IT WILL TAKE OFF REAL FAST WHEN IT GETS READY TO GO.THE PROBLEM IS YOU  DO NOT KNOW WHEN IT WILL DESIDE TO TAKE OFF.IT HAS DONE THIS BETWEEN 40 AND 50  TIMES SINCE NEW.I THINK THIS IS SAFTY ISSUE BECAUSE I CAN SEE HOW SOME ONE  COULD PULL OUT INTO TRAFFIC OR INTO THE BACK OF SOMEONE IF IT WAS TO TAKE OFF AT THE  WRONG TIME.IT HAS MY WIFE AFRAID TO DRIVE IT.I'VE HAD IT TO TWO DEALERS AND THEY SAY  THEY CHECK IT AND CAN NOT DUPLACATE WHAT I SAY IT IS DOING SO THEY CAN NOT DO  ANYTHING ABOUT IT.MOST OF THE TIME IT DOES THIS WHEN I PULL OUT FROM A STOP WEATHER  IN TRAFFIC OR AT A STOP SIGN AND WEATHER THE CAR IS HOT OR COLD.",
        "vin": "5N1AZ2MH6GN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/14/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945718,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER SIDE AIR BAG SENSOR IS FAULTY. WHEN MY 67 LB DAUGHTER SITS IN THE FRONT SEAT, THE AIR BAG LIGHT TURNS OFF INDICATING THAT THE AIRBAG IS ACTIVE. I BROUGHT THE VEHICLE IN TO THE DEALER AND THEY \"UPDATED AND RE-CALIBRATED\" THE SENSOR, BUT I AM STILL HAVING THE SAME ISSUE. I WAS GIVEN ANOTHER MURANO AS A LOANER VEHICLE WHILE THEY REPAIRED MINE AND WHEN MY DAUGHTER SAT IN THE FRONT SEAT OF THE LOANER VEHICLE, THE AIR BAG INDICATOR TURNED OFF AS WELL, INDICATING THAT THE AIR BAG WAS ACTIVE, WHICH IS TELLING ME THAT THIS IS NOT ISOLATED TO MY VEHICLE. I NEED TO GET THIS ISSUE RESOLVED AND NOT SURE WHERE TO TURN, SO I'M FILING A REPORT HERE.  *TR",
        "vin": "5N1AZ2MG5GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/24/2016",
        "dateOfIncident": "12/19/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937331,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED  THE FOLLOW UP OWNER NOTIFICATION NHTSA RECALL 16V-636 (ANTILOCK BRAKE SYSTEM ) WENT TO THE DEALER ON 1219-16 TO ASK FOR A TIME WHEN THEY COULD CHECK MY CAR. THE DEALER SAID THERE WAS NOTHING THEY COULD DO UNLESS MY CHECK ENGINE LIGHT WAS ON. DEALER IS SANDY SANSING NISSAN 5705 PENSACOLA BLVD. PENSACOLA FL. THE NOTIFICATION I HAVE CLEARLY STATES THAT THEY WILL INSPECT THE SERIAL NO. ON THE ABS ACTUATOR TO SEE IF IT IS AFFECTED.HOW CAN I GET THIS DONE/",
        "vin": "5NAZ2MG7GN1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/06/2016",
        "dateOfIncident": "12/06/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930171,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM DRIVING AT ABOUT NOON, WHEN THE SUN IS DIRECTLY OVERHEAD, THERE IS A TERRIBLE, BLINDING GLARE PRODUCED BY THE \"RIDGE\" ON THE HOOD NEAR THE WINDSHIELD.  THERE IS NO WAY TO AVOID THIS AND IT IS ALMOST IMPOSSIBLE TO CONTINUE DRIVING SINCE THE GLARE IS SO SEVERE. THIS IS OBVIOUSLY A DESIGN FLAW THAT NEEDS TO BE CORRECTED BEFORE SOMEONE GETS KILLED.  *TR",
        "vin": "5N1AZ2MG8GN"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "11/03/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924150,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MOON ROOF EXPLODED/SHATTERED WHILE DRIVING ON HIGHWAY.  WE DROVE IT IMMEDIATELY TO THE DEALERSHIP WE PURCHASED IT FROM 12 DAYS EARLIER.  SOUNDED LIKE A GUN GOING OFF IN MY EAR.  VERY DANGEROUS EVENT TO TAKE PLACE WHILE DRIVING.  THE MOON ROOF THEN STARTED FALLING INTO THE VEHICLE IMMEDIATELY.  *TR",
        "vin": "5N1AZ2MG6GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "10/11/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915245,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED VEHICLE UP IN THE MORNING AND WAS BACKING OUT OF MY DRIVEWAY. WHEN I REACHED THE STREET TO COME TO A STOP AND PUT MY CAR INTO DRIVE, MY BRAKES DID NOT RESPOND AND I ALMOST HIT A PILLAR OUTSIDE OF MY DRIVEWAY. I HAD TO IMMEDIATELY PLACE MY CAR INTO DRIVE AND IMMEDIATELY I TO PARK TO AVOID A COLLISION. MY BRAKE PEDAL SANK TO THE BOTTOM AND THE BRAKE LIGHT ON THE DASHBOARD LIT UP. BRAKES FAILED AND I'M HAVING VEHICLE TOWED TO MY NISSAN DEALER.",
        "vin": "5N1AZ2MG2GN"
    },
    {
        "components": "VISIBILITY,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914232,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. WHILE DRIVING AT ANY SPEED, THE CONTACT WAS UNABLE TO PUT ON AND FASTEN THE SEAT BELT. ALL OF THE SEAT BELTS FAILED TO EXTEND OUT ENOUGH TO FASTEN. THE CONTACT ALSO STATED THAT HE WAS UNABLE TO SEE PASSING VEHICLES THROUGH THE SIDE MIRRORS. THE FAILURES WERE NOT DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND STATED THAT THERE WERE NO DEFECTS. THE FAILURE MILEAGE WAS APPROXIMATELY 500.",
        "vin": "5N1AZ2MH6GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909617,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V636000 (SERVICE BRAKES, HYDRAULIC). THE PART TO DO THE REPAIR WAS NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5N1AZ2MG3GN"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/06/2016",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893745,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN MURANO COMPLAINT,  I PURCHASED A 2016 NISSAN MURANO IN MAY OF 2016 AND SINCE I HAVE OWNED IT I HAVE BEEN HAVING PROBLEMS WITH THE TRACTION CONTROL SYSTEM BOGGING DOWN ACCELERATION IF I AM COMING OFF A CURB CUT OR GOING OVER A POT HOLE OR IRREGULARITIES IN THE ROAD.  I LIVE OFF A  55 MPH  ROAD WHERE I AM REQUIRED TO GET INTO THE LEFT LANE TO MAKE A TURN IN ABOUT A 1/3RD  OF A MILE AFTER MAKING A RIGHT ON HIGHWAY AND THE ENGINE BOGGS DOWN AND WILL NOT ACCELERATE AFTER GOING OVER ROAD IRREGULARITIES PUTTING ME IN CONSTANT DANGER EVERY DAY LEAVING FOR WORK. THE SAME PROBLEM HAS HAPPENED MAKING A LEFT TURN ACROSS TRAFFIC IF A POT HOLE IS PRESENT AND I HAVE THE SAME PROBLEM COMING OUT OF STORES OR SHOPPING CENTERS DUE TO CURB CUTS. THE CAR JUST WILL NOT ACCELERATE AND TAKES OVER 16 SECONDS TO ACCELERATE FROM 0-60 MPH LEAVING ME WITH MANY CARS COMING DOWN ON MY BACK AT 55 MPH WHICH IS VERY SCARY AND PLACES ME IN DANGER ALMOST EVERY DAY. MAKING LEFTS AT LARGE INTERSECTIONS CAN ALSO BE VERY SCARY, BECAUSE I NEVER KNOW IF I WILL BE T-BONED IF THERE IS IRREGULARITY IN THE INTERSECTION. THE PROBLEM OCCURS FROM A DEAD STOP WITH THE ENGINE HOT OR COLD.   I DID A TEST DRIVE WITH A NISSAN TECHNICIAN AND HE WAS ABLE TO SEE THE PROBLEM FIRST HAND, BUT SAYS THAT THE CAR IS SUPPOSED TO DO THAT DUE TO THE TRACTION CONTROL SYSTEM. WE THEN TURNED THE SYSTEM OFF AND THE SAME PROBLEM HAPPENED AGAIN. THIS IS A VERY SCARY DEFECT THAT PUTS MY LIFE IN DANGER ALMOST EVERY DAY.  I HAVE LIVED IN THE SAME DEVELOPMENT FOR 15 YEARS AND NEVER HAD THIS PROBLEM WITH ANY OTHER CAR THAT I OWNED, IF THIS DEFECT IS INHERENT IN THIS VEHICLE, THE CAR SHOULD BE RECALLED. NISSAN HAS PRETTY MUCH WASHED THEIR HANDS OF THE SITUATION AND I DON'T KNOW WHERE TO TURN.  THANK YOU",
        "vin": "5N1AZ2MH3GN"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "07/21/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893526,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING. NO OBJECTS FELL ONTO THE CAR. WE HAD NO IDEA WHAT THE LOUD BANG/EXPLODING SOUND WAS UNTIL WE WERE ABLE TO SAFELY PULL OFF THE ROAD AND EVALUATE. THE HOLE WAS NOT INWARD, LIKE SOMETHING FELL INTO IT, BUT THE GLASS WAS PUSHED UPWARDS. WE WERE ON A 4-LANE STRAIGHTAWAY GOING MAYBE 35 OR 40 MPH AND NOT UNDER ANY BRIDGES, TREES, ETC. NO VEHICLES AROUND US, ETC. IT WAS ABOUT 8:30PM IN JULY IN SOUTH CAROLINA. THE NOISE WAS VERY LOUD AND VERY STARTLING!",
        "vin": "5N1AZ2MG0GN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10885664,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. WHILE DRIVING APPROXIMATELY 40 MPH, THE BRAKES FAILED WHEN THE BRAKE PEDAL WAS DEPRESSED APPROXIMATELY 50 FEET BEFORE STRIKING ANOTHER VEHICLE. THE \"PLEASE PUT FOOT ON THE BRAKE AND PRESS THE START BUTTON\" WARNING INDICATOR WAS ILLUMINATED. A POLICE REPORT WAS FILED. THE CONTACT WAS INJURED AND TRANSPORTED TO THE HOSPITAL. THE VEHICLE WAS TOWED TO A REPAIR SHOP. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 997.",
        "vin": "5N1AZ2MH3GN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2016",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871647,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARK IN A SUPERMARKET PARKING LOT AND TURN MY CAR I REVERSE AND WHEN I CHANGE GEAR TO DRIVE MY CAR DIDN'T MOVE TURN OFF CAR TO TRY AGAIN AND THIS TIME NOTHING HAPPEN NOT EVEN REVERSE OR NEUTRAL I DIDN'T KNOW ANYTHING ABOUT THIS ISSUES WITH THIS TYPE OF VEHICLES I CALL NISSAN AND I WAS TOLD THAT THE EXTENSION ON MY VEHICLE EXPIRED JANUARY 31, 2016 SORRY.  I FOUND OUT THERE'S A RECALL ON MY VEHICLE BUT UP TO TODAY I HAVEN'T RECEIVED ANYTHING  I DON'T HAVE THE MONEY TO FIX ISSUE AND STILL PAYING FOR MY CAR.",
        "vin": "JN8AZ08W06W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/26/2016",
        "dateOfIncident": "05/26/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870943,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 NISSAN MURANO. WHILE DRIVING VARIOUS SPEEDS, THE PASSENGER SIDE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 600.",
        "vin": "5N1AZ2MG7GN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "04/27/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864633,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE TIMES IN TWO WEEKS I HAD CRUISE SET AT 49MPH AND SET INTELLIGENT CRUISE CONTROL RANGE TO THREE CAR LENGTHS AHEAD OF ME.  ALL THREE TIMES THE VEHICLE THAT WAS AT LEASE 6-7 CAR LENGTHS AHEAD HAD MADE A RIGHT TURN AND WAS OUT OF MY LANE WHEN SUDDENLY THE CRUISE SHUTS DOWN AND THE AUTO BRAKES ARE ACTIVATED HARD ENOUGH TO LURCH ME FORWARD IN MY SEAT, THE THIRD TIME I ALMOST GOT REAR ENDED. TOOK TO THE DEALER WHO OF COURSE COULDN'T DUPLICATE THE ISSUE AND WAS TOLD NOT TO USE CRUISE CONTROL AROUND TOWN!!! I HAVE DOCUMENT ION INDICATING TIME AND DATES OF OCCURRENCES..",
        "vin": "5N1AZ2MG5GN"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/10/2016",
        "dateOfIncident": "05/08/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864093,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATION. I FIND THAT AFTER I AM STOPPED AT A RED LIGHT AND THEN I PULL OUT TO THE MIDDLE OF THE INTERSECTION WHEN THE LIGHT CHANGES (STOPPING AGAIN WAITING FOR ONCOMING TRAFFIC), THE GAS PEDAL DOES NOTHING WHEN I TRY TO MAKE THE TURN. I HAVE TO RELEASE THE PEDAL AND PUSH IT AGAIN, USUALLY IN A HURRY SO I DON'T GET HIT BY ONCOMING CARS. THE PROBLEM IS NOT CONSISTENT. PRETTY SCARY WHEN YOU EXPECT THE CAR TO MOVE AND IT DOES NOT. SO IT APPEARS THAT THE PROBLEM BECOMES EVIDENT WHEN I MAKE A SMALL MOVEMENT, STOP AND THEN GO AGAIN.",
        "vin": "5N1AZ2MH6FN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/30/2016",
        "dateOfIncident": "02/14/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862335,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER AIR BAG SENSOR CONSISTENTLY FAILS TO RECOGNIZE THE 150 POUND PASSENGER RIDING IN THE CAR.  IF, WHILE STARTING THE CAR, THE FRONT PASSENGER MOVES IN ANY FASHION, THE AIR BAG INDICATOR REMAINS ON, INDICATING THE AIR BAG IS \"OFF\".  NO MATTER WHAT THE PASSENGER DOES, INCLUDING PUTTING THE SEAT BELT ON OR OFF, ONCE THE AIR BAG SENSOR IS ON, IT WILL NOT GO OFF.   I MUST THEN TURN THE CAR OFF, ASK THE PASSENGER TO HOLD PERFECTLY STILL, THEN RESTART THE ENGINE.  IF THE PASSENGER REMAINS PERFECTLY STILL WHILE THE CAR IS TURNED ON, THE AIR BAG SENSOR WILL TURN OFF, INDICATING THE AIR BAG IS \"ON\".  THIS OCCURS EVERYTIME I START THE CAR.  IF I DO NOT TAKE THIS VERY SPECIFIC SET OF STEPS, AND I SUBSEQUENTLY FAIL TO NOTICE THE INDICATOR REMAINS ON (AIR BAG OFF), MY PASSENGER IS IN DANGER WHILE DRIVING.    IF THE PASSENGER ENTERS THE CAR WHILE THE ENGINE IS ALREADY RUNNING, I GET NO INDICATION WHATSOEVER FROM THE AIR BAG SENSOR.  FOR EXAMPLE, IS IT ACTIVATED OR NOT?   I HAVE ZERO CONFIDENCE IN THE FRONT PASSENGER AIR BAG SENSOR.",
        "vin": "5N1AZ2MG9FN"
    }
]