[
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Pagani Automobili SpA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193712,
        "products": [
            {
                "manufacturer": "Pagani Automobili SpA",
                "productMake": "PAGANI",
                "productModel": "HUAYRA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PAGANI AUTOMOBILE SPA MANUFACTURES A SPORTS CAR NAMED THE HUAYRA.  I WAS AN EMPLOYEE OF THE US SUBSIDIARY COMPANY, PAGANI WORLDWIDE LLC FROM MARCH 1 2012 TO JUNE 30 2015.  THE HUAYRA WAS TO BE SOLD IN THE STATE OF CONNECTICUT AND I WAS THE EMPLOYEE IN CHARGE OF IMPORTATION DOCUMENTATION AND CERTIFICATIONS.  THE HUAYRA WAS NOT A SAFE VEHICLE FOR IMPORT AND FAILED IT'S DUMMY OUT OF POSITION TEST.  I CONTACTED THE DOT AND THE NHTSA REGARDING THE SAFETY OF THE VEHICLES AND THE FACT THAT THE DISTRIBUTOR/DEALER LICENSE FOR THE STATE OF CONNECTICUT WAS FRAUDULENTLY OBTAINED. THE VEHICLE DID NOT PASS IT'S DUMMY OUT OF POSITION TEST AND WAS UNFIT FOR ROADS IN THE UNITED STATES.  SUBSEQUENTLY THEREAFTER, PAGANI WORLDWIDE LLC APPLIED FOR A LICENSE TO IMPORT AND SELL AND AS A MANUFACTURER OF RECORD IN THE STATE OF CONNECTICUT.  THE STATE OF CONNECTICUT REFUSED PAGANI WORLDWIDE LLCS APPLICATION FOR LICENSE AND ASKED FOR AN ENGINEER TO CERTIFY THAT THE VEHICLES WERE COMPLIANT WITH BOTH FEDERAL AND STATE MOTOR VEHICLE STANDARDS.  THE ENGINEERING FIRM DECLINED TO SIGN THE PAPERWORK BECAUSE THE VEHICLES DID NOT MEET MOTOR VEHICLE STANDARDS.  HORACIO PAGANI ON BEHALF OF PAGANI WORLDWIDE LLC AND PAGANI AUTOMOBILE SPA THEN FRAUDULENTLY OBTAINED THE LICENSES TO IMPORT VEHICLES INTO THE STATE OF CONNECTICUT BY:    1) FRAUDULENTLY CLAIMING THAT HE WAS A LICENSED ENGINEER  2) FRAUDULENTLY CLAIMING THE MOTOR VEHICLES HAD PASSED FEDERAL MOTOR VEHICLE CRASH TESTING  3) FRAUDULENTLY CLAIMING THAT THE VEHICLES HAD PASSED STATE REGULATIONS FOR IMPORTATION    THE FOLLOWING DOCUMENT CONTAINS AN EMAIL THREAD CONCERNING THE EXCHANGE REGARDING HORACIO SIGNING THE ATTESTATION DOCUMENT IN LIEU OF A LICENSED ENGINEER IN THE STATE OF CONNECTICUT AND THE FRAUDULENT, INCOMPLETE FORM FOR LICENSE IN THE STATE OF CONNECTICUT.",
        "vin": ""
    }
]