[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451121,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRW Automotive Inc. Airbag Control Unit (Part No. 218737-124 RI; Serial No. 11050089RI; Produced: April 20, 2015) was equipped in 2016 Porsche Cayman VIN [XXX] by Porsche (Vehicle Production Date: June 29, 2015).  In 2019, TRW recalled the aforementioned ACU in NHTSA 19E-043.  In 2019, in response to the TRW recall, Porsche recalled 2016 Porsche Caymans in NHTSA 19V-533 but Porsche & the NHTSA failed to include 2016 Porsche Cayman VIN [XXX] (Vehicle Production Date: June 29, 2015) from this recall by setting an incorrect production date bracket starting at July 8, 2015 which is at least 9 days too late.  The ACU failed during normal operation of the vehicle on February 1, 2020.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "WP0AA2A8XGK"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375115,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VARIABLE VALVE TIMING ADJUSTER SPROCKET BOLTS HAVE A TENDENCY TO SHEAR UNDER HIGH LOAD. THIS IS A DOCUMENTED ISSUE THAT WAS ALSO COMMON IN SEVERAL OTHER PORSCHE MODELS OF SIMILAR PRODUCTION YEAR RANGES. THE VALVETRAIN LOSES TIMING, RESULTING IN A CATASTROPHIC ENGINE FAILURE WHICH DISABLES A VEHICLE. MY VEHICLE SUSTAINED SUCH A FAILURE AND THE CAR IMMEDIATELY WENT INTO \"LIMP MODE.\" ALL THE VALVES ON ONE CYLINDER BANK WERE BENT. OTHER MODELS WERE RECALLED BUT THE CAYMAN AND BOXSTERS THAT CAME WITH THE 9A1 ENGINE WERE NOT. PORSCHE REPAIRED MY ENGINE BUT THEY PUT THE SAME PART NUMBER THAT FAILED BACK INTO THE CAR. THERE HAS NOT BEEN AN ENGINEERING REVISION TO THE PART, AND ANOTHER FAILURE IS POSSIBLE.",
        "vin": "WP0AC2A88GK"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342230,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PORSCHE HAS IDENTIFIED A PREVIOUSLY UNREPORTED FAULTY AIRBAG CONTROL UNIT SERIAL NUMBER 11050089RI EQUIPPED IN THE 2016 PORSCHE CAYMAN IN JUNE 2015 BY PORSCHE AG MERE DAYS BEFORE THE PRODUCTION DATE BRACKET START OF JULY 8, 2015 FOR MANUFACTURER RECALL AKB4. THE 2016 PORSCHE CAYMAN WAS ORDERED AS A CUSTOM SPECIFICATION 2015 PORSCHE CAYMAN IN EARLY 2015 HOWEVER, WHILE WAITING FOR THE CAR, THE OWNER WAS NOTIFIED BY THE DEALER THAT DELAYS HAVE PUSHED YOUR DELIVERY DATE BACKBUT YOU WILL RECEIVE A 2016 MODELTHE FACTORY IS GOING TO PRODUCE THE VEHICLE BEFORE THEIR SUMMER BREAK AND YOULL HAVE IT IN JULY 2015 BUT IT WILL BE A 2016 CAYMAN. THE 2016 PORSCHE CAYMAN IS A JULY 2015 PARTS BIN VEHICLE ASSEMBLED WITH FAULTY AIRBAG CONTROL UNIT SERIAL NUMBER 11050089RI IN JUNE 2015 BY PORSCHE AG.  WITH COMPONENT SUPPLIER CORRECTIVE ACTION OCCURRING DURING WEEK 38 OF 2015 (MID-SEPTEMBER 2015) PORSCHE AG INSTALLED FAULTY AIRBAG TRIGGERING UNIT SERIAL NUMBER 11050089RI IN THE 2016 PORSCHE CAYMAN. THIS IS EVIDENT BY SCAN RESULTS PERFORMED ON THE 2016 PORSCHE CAYMAN DISPLAYING FAILURE CODE: C11005  AIRBAG TRIGGERING UNIT, FAULTY. THE AIRBAG LIGHT IS ALSO ILLUMINATED ON THE DASH.  PORSCHE DID NOT IDENTIFY THAT FAULTY AIRBAG CONTROL UNIT SERIAL NUMBER 11050089RI IS AFFECTED BY MANUFACTURER RECALL AKB4 AND HAS NOT CORRECTLY IDENTIFIED THE POPULATION OF 2016 PORSCHE CAYMAN CARS IMPACTED BY MANUFACTURER RECALL NUMBER AKB4 (TRANSPORT CANADA RECALL 2019353 & NHTSA CAMPAIGN NUMBER 19V-533). PORSCHE MUST INCLUDE THE 2016 PORSCHE CAYMAN IN MANUFACTURER RECALL NUMBER AKB4, NOTIFY THE OWNER BY MAIL AND INSTRUCT THEM TO TAKE THEIR VEHICLE TO A DEALER TO REPLACE THE FAULTY AIRBAG CONTROL MODULE UNDER RECALL.  REFER TO VOLKSWAGEN GROUP COMPLIANCE REF. NUMBER 12638/2020, PCNA CASES 5591432 & 5595168, TC CONFIRMATION NUMBERS 2020-1107/-1108/-1310/-1311 AND US NHTSA TCN FKN23-56239 FOR DETAILS.",
        "vin": "WP0AA2A8XGK"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330990,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYMAN",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 PORSCHE CAYMAN HAS AN ERROR CODE 'C11005 ? AIRBAG TRIGGERING UNIT, FAULTY' AND THE AIRBAG LIGHT IS ILLUMINATED BUT THIS VIN WAS NOT INCLUDED IN PORSCHE'S RECALL (AKB4) CONCERNING THIS ISSUE. PORSCHE HAS NOT CORRECTLY IDENTIFIED THE RECALL POPULATION OF 2016 PORSCHE CAYMAN CARS AFFECTED BY MANUFACTURER RECALL NUMBER AKB4 (TRANSPORT CANADA RECALL 2019353 & NHTSA CAMPAIGN NUMBER 19V-533) AND SHOULD INCLUDE THIS 2016 PORSCHE CAYMAN VIN, NOTIFY THE OWNER BY MAIL AND INSTRUCT THEM TO TAKE THEIR VEHICLE TO A DEALER TO INSPECT, AND REPLACE, THE FAULTY AIRBAG CONTROL MODULE UNDER RECALL. BASED ON A PRODUCTION DATE BRACKET OF JULY 8, 2015 ? APRIL 18, 2016 AND COMPONENT SUPPLIER CORRECTIVE ACTION OCCURRING DURING CALENDAR WEEK 38 OF 2015 (APPROXIMATELY MID-SEPTEMBER 2015) PORSCHE HAS MISSED THIS 2016 PORSCHE CAYMAN (PRODUCED JUNE 2015) FROM ITS DATABASE OF 2016 PORSCHE CAYMAN VINS AFFECTED BY THIS RECALL. PORSCHE DID NOT CONSIDER THAT IT WAS PRODUCING 2016 PORSCHE CAYMANS EARLIER THAN JULY 8, 2015 AND, AS A CONSEQUENCE, THE OWNER OF THIS 2016 PORSCHE CAYMAN WAS NOT ALERTED DURING THE CUSTOMER NOTIFICATION PERIOD OF MANUFACTURER RECALL NUMBER AKB4 AND DID NOT BECOME AWARE OF THIS KNOWN SAFETY RISK UNTIL ALMOST A YEAR HAD PASSED. AT THIS TIME, PORSCHE REFUSES TO REPAIR THE FAULTY VEHICLE UNDER RECALL. THERE MAY BE OTHER 2016 PORSCHE CAYMAN VEHICLES IN ADDITION TO THIS 2016 PORSCHE CAYMAN ASSEMBLED OUTSIDE THE STATED PRODUCTION DATE BRACKET THAT ARE AFFECTED BY THIS RECALL AND WERE MISSED BY THE MANUFACTURER.  *TR",
        "vin": "WP0AA2A8XGK"
    }
]