[
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/29/2020",
        "dateOfIncident": "11/29/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376997,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "PRIME TIME",
                "productModel": "CRUSADER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE NHTSA ID NUMBER: 11363266  THE RIGHT SIDE REAR TIRE RUBS ON THE SLIDE OUT FLOORING, THE SLIDE OUT CROSS MEMBER (INCLUDING MOUNTING BOLTS/NUTS) AND SLIDE OUT END BRACKET. THE UNIT WAS MANUFACTURED WITH INSUFFICIENT CLEARANCE TO PREVENT TIRE RUBBING. THE TIRE RUBBING HAS CAUSED DAMAGE TO TIRES AND IS SUSCEPTIBLE TO INSTIGATE CATASTROPHIC TIRE FAILURE WHILE GOING DOWN THE HIGHWAY. THE CLEARANCES ARE INSUFFICIENT TO PREVENT CONTACT WHEN THE SUSPENSION IS COMPRESSED FROM NORMAL HIGHWAY BUMPS.    PREVIOUS OWNER REPORTS BLOWOUT ON RIGHT REAR. HE WAS UNAWARE OF THIS ISSUE AND DID NOT REPORT. THE 3 PICTURES ATTACHED CLEARLY DEMONSTRATE RUBBING FROM TIRE CONTACT.    PRIMETIME HAD AN IDENTICAL ISSUE IN A 2014 315 MODEL WITH IDENTICAL WEAR POINTS. AN NHTSA RECALL WAS ORDERED WITH A LIFT KIT TO BE INSTALLED THAT REMEDIED THE CLEARANCE ISSUES. 2014 PRIME TIME 315 NHTSA 14V-140.     I HAVE NOT YET CONTACTED PRIME TIME BUT WANTED TO DOCUMENT WHAT APPEARS TO BE A CONSISTENT AND HAZARDOUS SAFETY ISSUE WITH MY 2016 PRIMETIME CRUSADER.     ARE WE SAFE TRAVELING DOWN THE HIGHWAY WITH THIS CONDITION?*DT    THE CONSUMER PROVIDED PHOTOS. *TR",
        "vin": "5ZT3CSVB5GG"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363266,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "PRIME TIME",
                "productModel": "CRUSADER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT SIDE REAR TIRE RUBS ON THE SLIDE OUT FLOORING, THE SLIDE OUT CROSS MEMBER (INCLUDING MOUNTING BOLTS/NUTS) AND SLIDE OUT END BRACKET.  THE UNIT WAS MANUFACTURED WITH INSUFFICIENT CLEARANCE TO PREVENT TIRE RUBBING.  THE TIRE RUBBING HAS CAUSED DAMAGE TO TIRES AND IS SUSCEPTIBLE TO INSTIGATE CATASTROPHIC TIRE FAILURE WHILE GOING DOWN THE HIGHWAY.  THE CLEARANCES ARE INSUFFICIENT TO PREVENT CONTACT WHEN HE SUSPENSION IS COMPRESSED FROM NORMAL HIGHWAY BUMPS.    I HAVE PICTURES ATTACHED THAT CLEARLY SHOW THE 3 CONTACT POINTS WHERE THE TIRE HAS RUBBED THE FINISH OFF OF THE STEEL MEMBERS, PHYSICALLY WEARING AWAY THE NUTS AND BOLTS AND IS WEARING A HOLE IN THE SLIDE OUT FLOORING IN MULTIPLE WHEEL LOCATIONS.  THE END BRACKET CUT A GROOVE IN A TIRE AND WAS LUCKILY NOTICED PRIOR TO CATASTROPHIC FAILURE ON THE HIGHWAY.  IT WAS DEEMED NOT REPARABLE BY DISCOUNT TIRE AND THUSLY REPLACED.    AFTER INSTALLING THE OEM SPARE TIRE I APPLIED SOME TOUCH UP PAINT TO THE RUBBING LOCATIONS AND COMPLETED ONE SHORT TRIP.  THE PAINT WAS ONCE AGAIN RUBBED OFF AS IT MAKES CONTACT WITH THE TIRE.  THIS DESIGN NEEDS TO BE RECOGNIZED AS A SAFETY ISSUE AND RECTIFIED BY THE MANUFACTURER..  I SUSPECT IT HAS CAUSED NUMEROUS CATASTROPHIC TIRE FAILURES AND INITIALLY BLAMED ON THE TIRE MANUFACTURERS.  OEM TIRES ARE TOWMAX POWER KING.  I REPLACED WITH GOODYEAR ENDURANCE.    PRIMETIME HAD AN IDENTICAL ISSUE IN A 2014 315 MODEL WITH IDENTICAL WEAR POINTS. AN NHTSA RECALL WAS ORDERED WITH A LIFT KIT TO BE INSTALLED THAT REMEDIED THE CLEARANCE ISSUES.  2014 PRIME TIME 315 NHTSA 14V-140.   A RECALL WAS ORDERED AND A LIFT KIT INSTALLED.    I HAVE CONTACTED THE MANUFACTURER IN GOOD FAITH. THEY SAY IT IS OUTSIDE OF THE MANUFACTURERS 12 MONTH WARRANTY PERIOD.  I DO NOT BELIEVE  A SAFETY ISSUE IS EXCLUDED FROM THE MANUFACTURERS RESPONSIBILITY.*DT*DT*JB*JB",
        "vin": "5ZT3CSVB2GG"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "02/24/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076739,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "PRIME TIME",
                "productModel": "CRUSADER",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE SIZE WAS ST235/80R16.  CAMPER IS 10,000 POUNDS LOADED AND HAS DOUBLE AXLES WITH 4 TOWMAX STR TIRES.  WAS DRIVING 60 MPH ON STRAIGHT, WELL MAINTAINED HIGHWAY.  EXPERIENCED BLOW OUT THROUGH TREAD.  TIRE PRESSURE WAS VERIFIED AT 80PSI BEFORE TRIP.  TIRE HAS LESS THAN 2000 MILES ON IT.",
        "vin": ""
    }
]