[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "11/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447451,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Was getting off work. Started car and   Engine system malfunction light, DSC malfunction light,  TPMS System Malfunction light,  Auto transmission malfunction light, and  SCBS malfunction light  all turned on.  Car was not currently in motion when lights went on. Was in parking lot. Turned car off, and restarted, lights remained on. Drove vehicle 6.8 miles home, car was in limp mode.   When at home used OBD2 scan tool and got codes    P0847 C1031 U0401 B13D3  Cleared codes and unplugged 12 volt battery to reset system.  Only engine system malfunction light remained. Parked car overnight and went to dealership next morning. Car drove on highway and car seemed fine.   Dealership scan car and received code P0847, tech cleared code and test drove car. Problem can not be reproduced.",
        "vin": "3MYDLBZV0GY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354181,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 SCION IA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, THEY CRASHED INTO A WILD HORSE. THE CONTACT STATED THAT NO AIR BAGS DEPLOYED. THE VEHICLE WAS TOWED AND A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED NO INJURIES AND NO MEDICAL ATTENTION WAS NEEDED. THE CONTACT HAD NOT CONTACTED THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE; HOWEVER, THE CONTACT HAD NOT HEARD FROM THEM AS OF YET. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3MYDLBZV7GY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "05/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351758,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS UNDER 60,000 MILES, I BOUGHT IT WITH ABOUT 28,000 ON IT AND IT HAS HAD INTERMITTENT ISSUES WITH THE DISPLAY.  I WENT TO DEALERSHIP, WHO SAID THE WHOLE INFOTAINMENT SYSTEM NEEDS REPLACED, WHICH IS ABOUT $1200 WITH PARTS AND LABOR.  IT HAS BEEN DOING THIS WITH LESS THAN 30,000 MILES ON THE CAR AND HAS GOTTEN WORSE. IT CAUSES THE DISPLAY TO GO IN AND OUT, WHICH HAPPENS ALSO WITH THE BACKUP CAMERA.",
        "vin": "3MYDLBZVXGY"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL INTERMITTENTLY SHUT ITSELF OFF IN THE ROAD FOR NO APPARENT REASON. THE CHECK ENGINE LIGHT AND BATTERY LIGHT WILL DISPLAY ON THE DASH. HOWEVER, WHEN I PUT THE CAR BACK IN PARK AND RESTART THE ENGINE THERE ARE NO INDICATOR LIGHTS ON AND NO CHECK ENGINE LIGHT WHATSOEVER. THIS CAR HAS BEEN LOOKED AT BY 3 CERTIFIED TOYOTA DEALERS AND NONE OF THE MECHANICS CAN ACCURATELY PINPOINT THE ISSUE. I AM CONCERNED THIS CAR WILL SHUT ITSELF DOWN IN THE MIDDLE OF THE HIGHWAY AND CAUSE A COLLISION. WORST EXPERIENCE WITH A CAR I'VE EVER HAD. SURPRISINGLY NEWER MODEL VEHICLE AND THIS DIFFICULT TO DIAGNOSE. THE CAR MAINLY SPUTTERS AND STALLS AT IDLE OR LOW SPEEDS. WE HAVE TRIED NUMEROUS TIMES TO GET AN ACCURATE DIAGNOSES. NOTHING LEFT TO DO AT THIS POINT EXCEPT REPLACE THE CAR. I FEELS IT IS A DANGER TO MYSELF AND OTHERS ON THE ROAD.",
        "vin": "3MYDLBZV4GY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/27/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311928,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AND THE CAR IN FRONT OF ME SLAMMED ON HIS BRAKES AND I SLAMMED ON MINE  AND THEN THE CAR BEHIND ME HIT ME AND I HIT THE CARIN FRONT OF ME.  MY AIRBAGS DIDN'T DEPLOY  WHEN HIT FROM BEHIND AND THEN I HIT CAR IN FRONT OF ME .  MY CAR IS TOTALED. PLEASE FILE COMPLAINT AND GET BACK TO ME",
        "vin": "3MYDLBZV3GY"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/22/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290769,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WHINE AFTER USED CAR PURCHASE WITH 91K MILES. TOOK IT TO TOYOTA OF GREENVILLE FOR DIAGNOSTIC. NEEDED A NEW TRANSMISSION. TOOK THE CAR BACK TO RALPH HAYES TOYOTA OF ANDERSON WHEW I PURCHASED AND THEY REPLACED THE TRANSMISSION. SINCE THEN THERE HAS BEEN A TRANSMISSION GRINDING AND SEVERE VIBRATION WHILE IN DRIVE OR REVERSE. I CALLED TOYOTA CUSTOMER SERVICE AND ASKED FOR A BUY BACK. THEY DECLINED. I ALSO COMPLAINED ABOUT THE DEALERSHIP AND THEIR LACK OF CARING AND UNDERSTANDING. TOYOTA CORPORATE DOES NOT CARE. DEALERSHIP KEEPS SAYING THIS VIBRATION AND BEHAVIOR IS NORMAL FOR THIS CAR. IT IS DANGEROUS NOW BECAUSE IT STALLS OUT INTERMITTENTLY WHEN PLACED IN DRIVE OR REVERSE. WHEN IT DOES GO IT LAUNCHES FORWARD. ALSO THE VIBRATION IS SO SEVERE IT WILL SHAKE THE TEETH IN MY MOUTH. I HAVE VIDEO ON MY PHONE OF THE TRANSMISSION ALSO HANGING UP IN GEAR AND THE DEALERSHIP AND TOYOTA CORPORATE DID NOT SEEM TO CARE I HAD PROOF THE NEW TRANSMISSION IS FAULTY. ALSO, THE INFOTAINMENT SYSTEM KEEPS CRASHING AND WAS QUOTED ALMOST $2,000 TO FIX IT. THEY ACKNOWLEDGE THAT'S A COMMON PROBLEM BUT REFUSE TO OFFER ANY ASSISTANCE TO FIX IT. ON TOP OF IT ALL THE BRAKES ARE HORRIBLE AND THEY HAVE BEEN REPLACED AND STILL ARE LOUD AND ACT LIKE THEY DON'T WANT TO STOP. WET CONDITIONS ALSO MAKE BRAKING MORE DIFFICULT. I WOULD ALSO LIKE TO SAY THE PASSENGER SEAT IS SENSITIVE TO WEIGHT AND THE AIRBAG LIGHT WILL TURN TO ON AND THE SEAT BELT WILL CHIME EVEN WHEN NO ONE IS IN THE SEAT. MY CELL PHONE CAN BE SITTING IN THE SEAT AND IT MAKES IT CHIME AND THE PASSENGER AIRBAG ACTIVE.",
        "vin": "3MYDLBZV2GY"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "07/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11256685,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 SCION IA. ON TWO SEPARATE OCCASIONS, WHILE DRIVING, THE TRANSMISSION ERRONEOUSLY DOWNSHIFTED AND CAUSED THE VEHICLE TO ABRUPTLY DECELERATE. DURING THE FAILURE, A LOUD GRINDING METAL NOISE WAS PRESENT UNDER THE VEHICLE AND AN UNKNOWN WARNING INDICATOR DISPLAYED. ON ONE OCCASION, WHILE DRIVING, THE FAILURE OCCURRED AND CAUSED A SECOND VEHICLE TO CRASH INTO THE REAR OF THE CONTACT'S VEHICLE. THE DRIVER SUSTAINED NECK, BACK, AND SHOULDER INJURIES. IN A SEPARATE INCIDENT, THE PASSENGER SUSTAINED HEAD, NECK, AND SHOULDER INJURIES FROM WHEN THE VEHICLE ABRUPTLY REDUCED SPEED. A POLICE REPORT WAS NOT FILED. THE CAUSE OF THE FAILURES WAS NOT DETERMINED. LAKE CITY TOYOTA (12059 LAKE CITY WAY NE, SEATTLE, WA) AND THE MANUFACTURER WERE NOTIFIED AND PROVIDED CASE NUMBER: 1909103427). THE FAILURE MILEAGE WAS 30,000.",
        "vin": "3MYDLBZV0GY"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208448,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR TRUCK POPS OPEN RANDOMLE WILE DRIVING!",
        "vin": "3MYDLBZVXGY"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT A STOP THE ENGINE STARTS TO SHAKE LIKE IT'S ABOUT TO TURN OFF WE BOUGHT IT WITH 29000 MILES NOTICED IT A WEEK AFTER WE BOUGHT IT AND IT HAS DONE IT A FEW TIMES THE TOYOTA DEALERSHIP COULDN'T FIND ANY CODES TO REMEDY IT. THE CHECK ENGINE DOES NOT COME ON BUT IT DOES SHAKE VIOLENTLY.IT HAS 35000 MILES NOW.I HAD THE THROTTLE BODY CLEANED AND IT STILL PUTTERS AT THE LIGHT. MOSTLY WITH THE A/C OFF",
        "vin": "3MYDLBZVXGY"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186554,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TIME THIS HAPPENED...FIRST THEY SAID BATTERY...WHILE DRIVING, INDICATING WARNING LIGHTS ON DASH START BLINKING (ABS, CHECK ENGINE, TRACTION, AND OTHERS), THEN THE ENGINE GOES INTO LOW HEAR AND STAYS UNTIL THE VEHICLE IS TURNED OFF AND BACK ON. DURING THESE EPISODES THE SPEED ODOMETER IS ERRATIC. ALSO WHEN IN THIS STATE, THE REVERSE GEAR DOES NOT ENGAGE. WHEN THIS STARTED IT WAS A ONCE A MONTH PROBLEM, THEN WEEKLY, NOW IT HAPPENS DAILY/HOURLY. IT STARTED AT APPROXIMATELY 40,000 MILES. THIS HAPPENS WHILE DRIVING ON CITY STREETS AND HIGHWAY, MOST OF THE TIME AT STOPS AND LOWER SPEEDS BUT DOES HAPPEN ON FREEWAY TOO.",
        "vin": "3MYDLBZV2GY"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152522,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, INDICATING WARNING LIGHTS ON DASH START BLINKING  (ABS, CHECK ENGINE,  TRACTION,  AND OTHERS), THEN THE ENGINE GOES INTO LOW HEAR AND STAYS UNTIL THE VEHICLE IS TURNED OFF AND BACK ON. DURING THESE EPISODES THE SPEED ODOMETER IS ERRATIC. ALSO WHEN IN THIS STATE, THE REVERSE GEAR DOES NOT ENGAGE. WHEN THIS STARTED IT WAS A ONCE A MONTH PROBLEM,  THEN WEEKLY, NOW IT HAPPENS DAILY/HOURLY. IT STARTED AT APPROXIMATELY 40,000 MILES. THIS HAPPENS WHILE DRIVING ON CITY STREETS AND HIGHWAY, MOST OF THE TIME AT STOPS AND LOWER SPEEDS BUT DOES HAPPEN ON FREEWAY TOO.",
        "vin": "3MYDLBZVXGY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139656,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TO PARK AT A BURGER KING STORE AT DELANO CALIFORNIA 93215 AND SLOWING DOWN WHEN MY SCION IA SPEED UP MORE AND KEPT ON RUNNING WHILE MY FOOT IS ALREADY ON THE BRAKE. SO I ACCIDENTALLY HIT THE STORE.  IT ONLY STOP BECAUSE THE TIRE WHERE ALREADY UP. I TRIED TO REVERSE MY CAR BUT CANNOT MOVE ANYMORE.",
        "vin": "3MYDLBZV8GY"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139369,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 SCION IA. BRAKES MAKE LOUD NOISE WHEN APPLIED AFTER COLD START OR LONG PERIOD OF TIME ENGINE IS OFF. NOISE DISAPPEARS AFTER 3-5 BRAKE ATTEMPTS AND BRIEFLY SHOWS UP AGAIN AFTERWARDS. THIS ISSUE HAS BEEN HAPPENING FOR THE LAST 6 MONTHS.",
        "vin": "3MYDLBZV7GY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "07/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11123000,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 SCION IA. WHILE DRIVING APPROXIMATELY 5 MPH, THE VEHICLE WAS INVOLVED IN A CRASH. UPON ACCELERATING THROUGH AN INTERSECTION, THE CONTACT'S VEHICLE WAS STRUCK (T-BONED) BY ANOTHER VEHICLE ON THE FRONT PASSENGER DOOR. NONE OF THE AIR BAGS DEPLOYED. A POLICE REPORT WAS NOT FILED. THE CONTACT'S OLDER SON SUSTAINED WHIPLASH, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS ABLE TO BE DRIVEN AWAY FROM THE SCENE. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 110,000. THE VIN WAS NOT AVAILABLE.",
        "vin": "3MYDLBV3GY1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102895,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES MAKE LOUD NOISE WHEN APPLIED AFTER COLD START OR LONG PERIOD OF TIME ENGINE IS OFF. NOISE DISAPPEARS AFTER 2-3 BRAKE ATTEMPTS AND BRIEFLY SHOWS UP AGAIN AFTERWARDS.",
        "vin": "3MYDLBZV1GY"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2018",
        "dateOfIncident": "03/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082332,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUR TIMES NOW( ON DIFFERENT OCCASIONS) AFTER SHIFTING THE CAR INTO REVERSE THE ENGINE MADE  HORRIBLE GRINDING SOUNDS AND THE CAR BEGAN TO LURCH VIOLENTLY AS I ATTEPMPTED TO BACK UP. IT EVENTUALLY STALLED OUT COMPLETELY.  ON ONE OCCASION I WAS ABLE TO HAVE SOMEBODY SHIFT THE CAR INTO REVERSE SO  I COULD LOOK UNDER THE HOOD WHILE THE CAR WAS GRINDING AND LURCHING. I SAW THE ENGINE START TO VIBRATE AND THEN DUMP FORWARD AND THEN REPEAT THAT CYCLE. I DO HAVE VIDEO OF THE EVENT ON MY PHONE BUT I AM NOT ABLE TO DOWNLOAD IT TO THIS LAP TOP.",
        "vin": "3MYDLBZV8GY"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/29/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020378,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IS DIFFCULT TO BUY TIRES FOR THIS CAR BECAUSE OF THE DEALERS NEVER HAVE IN STOCK  THIS SIZE TIRE TOYOTA DEALERS HAVE TO ORDER FOR YOU NEVER HAVE IN STOCK OTHER TIRE DEALERS HAVE TO ORDER FOR YOU ALSO MORE EXPENSIVE TO ORDER",
        "vin": "3MYDLBZV1GY"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2017",
        "dateOfIncident": "04/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012571,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 SCION IA. WHILE DEPRESSING THE BRAKE PEDAL, THE VEHICLE ACCELERATED WITHOUT WARNING. THE CONTACT STATED THAT THE FAILURE OCCURRED TWICE WHILE STOPPED. THE VEHICLE WAS TAKEN TO DAVID WILSON'S TOYOTA OF LAS VEGAS (3255 E SAHARA AVE, LAS VEGAS, NV 89104 (702) 457-2000), BUT THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT MENTIONED THAT HE NO LONGER OWNED THE VEHICLE DUE TO THE ACCELERATION ISSUE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 4,000. ...UPDATED 10/19/17 *BF    UPDATED 12/12/2017*JS",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "11/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001922,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "@ 9851 MILES, PICKED UP THE CAR FROM AN OIL CHANGE (IN NOV. 2016.) NOTICED A LIGHT SHAKING WHEN AT A COMPLETE STOP AT STOP LIGHT. THE ISSUE CONTINUED RANDOMLY, AT FIRST NOT VERY OFTEN, THEN STARTED HAPPENING MORE AND MORE OFTEN AND BECAME MORE AND MORE INTENSE AT TIMES. CAR IS AT 18,029 MILES (6/28/17,) AND IT STILL CONTINUES TO RANDOMLY HAPPEN. HAVE TAKEN THE VEHICLE TO THE DEALER SEVERAL TIMES, THEY DO NOT KNOW WHAT'S WRONG WITH IT, NO SERVICE/ENGINE LIGHTS OR CODES. THE SERVICE MANAGER AND SERVICE ADVISOR WITNESSED THE PROBLEM IN THE SERVICE BAY. I HAVE BEEN TOLD IT IS \"CHARACTERISTIC\" OF THE VEHICLE (BUT DIDN'T HAPPEN FOR THE FIRST 9851 MILES,) AND I HAVE ALSO BEEN TOLD I PUT \"BAD GAS\" IN IT (ALTHOUGH IT'S BEEN DRIVEN  8,358 MILES SINCE IT STARTED AND THERE HAVE BEEN NUMEROUS TYPES OF GAS FROM NUMEROUS GAS STATIONS PUT IN THE VEHICLE.) IT STILL HAPPENS RANDOMLY, IT DOESN'T MATTER IF THE AC IS ON OR OFF, HOW LONG IT BEEN DRIVEN, THE TYPE OF GAS THAT IS IN IT, OR WHAT THE TEMPERATURE IS OUTSIDE. MANUFACTURERS REP COULD NOT \"RECREATE\" THE INTERMITTENT PROBLEM, ARBITRATOR SAID THE 20 OR SO VIDEOS I RECORDED OF THINGS SHAKING IN MY VEHICLE WHEN IT DOES HAPPEN, WAS NOT \"CREDITBLE EVIDENCE.\" I WOULD LIKE THE ISSUE I'M EXPERIENCING WITH MY CAR TO BE POSTED ON THE NHSTA WEBSITE UNDER PROBLEMS, JUST IN CASE OTHER OWNERS ARE EXPERIENCING THE SAME ISSUE.",
        "vin": "3MYDLBZV1GY"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "05/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10994995,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 SCION IA. WHILE AT A STOP, ANOTHER VEHICLE WENT THROUGH A STOP LIGHT AND CRASHED INTO THE FRONT PASSENGER AND DRIVER'S SIDE OF THE CONTACT'S VEHICLE. THE OTHER VEHICLE LEFT THE SCENE OF THE CRASH. THE FRONT AIR BAGS DEPLOYED WITH FORCE. THE DRIVER AND FRONT PASSENGER SUSTAINED HEAD INJURIES AND PAIN TO THE NECK, BACK, AND LEGS. MEDICAL TREATMENT WAS REQUIRED. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED. THE MANUFACTURER WAS CONTACTED TO DETERMINE IF THEY COULD INVESTIGATE THE IMPACT OF THE AIR BAGS, WHICH DEPLOYED WITH EXTREME FORCE. THE CONTACT WAS WAITING ON A RESPONSE FROM THE INSURANCE COMPANY AND THE MANUFACTURER CONCERNING THE VEHICLE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3MYDLBZV7GY"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2017",
        "dateOfIncident": "05/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983861,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DEALER LOST MY KEY, AFTER THE GAVE ME THE CAR AND I DROVE OFF TO COSTCO WITHOUT NOTICING I DIDN'T HAVE THE KEY, FOUND OUT THE CAR IS STARTING WITHOUT THE KEY IN THE CAR. DEALER KEPT WITH THE CAR WHILE TOYOTA CORP DECIDE HOW TO FIX THE PROBLEM, THE GAVE ME A LOANER CAR WHILE THEY DO THE JOB.",
        "vin": "3MYDLBYVXGY"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "09/27/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A 113 LB ADULT.  WHENEVER I SIT ON A 2-INCH FOAM CUSHION IN THE PASSENGER SEAT OF OUR SCION IA, THE \"PASSENGER AIRBAG OFF\" WARNING ILLUMINATES ON THE DASHBOARD.  THE SEAT IS TOO LOW AND HARD FOR ME TO SIT COMFORTABLY WITHOUT THE CUSHION, AND I ALSO HAVE TO USE IT WHEN I DRIVE THE SCION IA.  BUT THE AIRBAGS SHOULD NOT BE OFF FOR PERSONS WEIGHING MORE THAN 85 LBS.  THIS DOES NOT HAPPEN WHEN A PASSENGER WEIGHING OVER 125 LBS SITS ON THE CUSHION.  BUT IT MEANS THAT FOR PASSENGERS WEIGHING BETWEEN 85 LBS AND 125 LBS, THERE WILL BE NO AIRBAG PROTECTION.  I USED THE SAME CUSHION IN OUR 2015 MAZDA 3, WITH NO PROBLEM; SO CLEARLY THERE IS A PROBLEM WITH THE LOCATION OR FUNCTION OF THE SENSORS IN THE SCION IA.  WHEN I TOOK IT TO THE DEALER, THE SERVICE DEPARTMENT RECOMMENDED EITHER NOT USING ANY SEAT CUSHION OR PUTTING A WEIGHT UNDER THE CUSHION, BUT DID NOT RECORD MY COMPLAINT.  THIS IS AN ONGOING PROBLEM, SO THE DATE I ENTERED BELOW IS THE FIRST DAY I RODE AS A PASSENGER IN THE CAR.  BY THE WAY, I DON'T KNOW WHY THE 2016 SCION IA IS NOT A RECOGNIZED MODEL IN YOUR SYSTEM.",
        "vin": "3MYDLBZV8GY"
    }
]