[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/06/2022",
        "dateOfIncident": "01/31/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450687,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "In November of 2018 and again January 31, 2022.  In November 2018, I was backing up in small parking lot tap the gas pedal.  and my car speed up going backwards, even when I was pushing the brake. What stopped the momentum was another car, my car crashed into caused extensive damage  to that car( it was totaled) .  The second time; I turned the wheels to back-in as I had a several times into my driveway. The car was to far over, but because I was not centered enough in the driveway, I moved forward to realign myself. The  car seemed to hesitate  as I moved forward, before putting  it in reverse.  I Put the car in reverse, lightly hit gas the car seem to take off  as if it was a rocket backing up into driveway and went through the back wall of my garage ( because there was so much snow it came to a stop). My daughter was observed on the ring camera. I have been very sensitive to making sure since first time to be more aware. It is significant to note prior to this occurrence my car did this in smaller spurts ,( but did not think anything of it , I took my car in for all of the checks) but  I was able to control it  by putting foot on brake, It's like this time the engine revved up on its own. This time the car was totaled. ( The back window shattered. A lot of damage underneath the car. I will not be buying another Subaru. It was my dream car:(. I was very traumatized.)I was diligent with the maintenance of the car. I informed my insurance company.",
        "vin": "JF1GPAK69G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/09/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449200,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Windshield cracked with a small pebble",
        "vin": "JF1GPAP63G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2022",
        "dateOfIncident": "01/13/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447434,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Recently, when trying to park and turn off the vehicle, the key gets stuck in the battery position. The engine will turn off, but the car doesn't fully turn off so you can remove the key. The shifter is in park and there is no steering wheel lock or anything else that might ordinarily prevent the vehicle from being turned off. This process is no different from every other time I've turned the vehicle off previously.   To finally retrieve the key, the car needs to be restarted numerous times (often 1-3 more times) while trying a combination of moving the steering wheel, putting the shifter into drive and back into park, and/or releasing the brake pedal and reapplying it firmly.  My car is only lightly used and judging by internet research, this is a common issue with Subaru vehicles around this age due to a faulty part, not normal wear and tear.",
        "vin": "JF1GPAA61GH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435535,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "After turning off the engine in Park, the keys are not being released from the ACC position of the ignition in my 2016 Subaru Impreza, which has 32,000 miles. I must repeatedly depress the shift lever and/or shift gears back and forth and/or restart and turn off the car in order to get the key out. This has been going on for two months now for at least half the time although not every time I turn off the car. There are no warning messages or diagnostic lights, just the malfunction itself. The issue has been documented in TSB 16-112-18 in numerous models of Subaru. My spouse and I have contacted Subaru of America and a local Subaru dealer, who have disclaimed responsibility for the problem, but did admit that this was a known issue. The dealer also insinuated that the fault could be the customers' by spilling beverages or something into the shifter linkage. As indicated in the YouTube printout I have attached (Yakfish Taco 2014 - 2018 Subaru Forester Key Stuck in Ignition - Quick fix solution), many people are working around this problem by disabling the key removal safety feature in the wiring of the steering column. This allows the key to be removed from the ignition at any time, such as when the vehicle is driving or stopped but not in Park. It is my belief that people are going to die from this. Subaru should be forced to issue a recall.",
        "vin": "JF1GJAA67GH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434109,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle's engine displayed an \"check engine\" light, the cruise control indicator light flashed on and off continuously when not engaged at a standstill,  and the VDC vehicle dynamics control off indicator remained lit.  This occurred while the vehicle was parked and these indicators came on when the engine was switched on.     When driving a noticeable decrease in engine performance and louder exhaust noise was evident.  Took vehicle to dealer and subsequently was informed that there was a complete four valve engine failure that would require a complete overhaul of engine at an extremely high cost.  The safety issue would be if this had occurred at highway speeds potentially  losing control of vehicle causing accident.    This was the second time this has occurred with this particular vehicle.  When purchased new in 2016 after roughly 38k miles  engine  failed and had to be rebuilt at dealer cost.  This current failure occurred at just under 101k miles, so this second failure occured at approximately 60k miles after first repair.  This indicates to  me that:  1. Poor engine quality, 2. Poor repair parts, 3. Poor quality control at the factory, 4, Poor repair service.    As of writing of this complaint vehicle is still at the dealer  undergoing repair which according to service rep will take a few days.  We believe the cost of this repair should lay at the feet of Subaru for producing a defective engine.",
        "vin": "JF1GJAA61GH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433748,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "There seems to be an issue with keys getting stuck in the ignition on a lot of various years and makes of Subaru's.  So much so, that Subaru put out a service bulletin (Bulletin Number: 16-112-18R) to remedy this.  Unfortunately, those who are out of the warranty time frame, are no longer eligible for a replacement without charge.  This is not a safety issue per-say, but rather an issue of the car possibly getting stole due to Subaru's unwillingness to make this a recall issue and making it free to current owners regardless of the warranty status.  What I would like for you folks to do is push subaru's hand into making this a recall issue and fixing the issue free of charge even if the vehicle is outside of the warranty time period.  Thank you for taking the time to read my concern.  PS: I got the recall serviced on this vehicle on 09/17/2021",
        "vin": "JF1GJAB69GH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/04/2021",
        "dateOfIncident": "09/04/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431751,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Windshield spontaneously cracked. Additionally, windshield wiper reservoir leaks but dealer says it’s fine.",
        "vin": "JF1GPAP66GH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "02/10/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427705,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The component / system that fails is the fuel system / fuel pump. The 2016 subaru impreza has the same fuel pump that later motels have and they where recalled due to the fuel not being delivered correctly from the fuel tank to the engine. it is typically winter fuels that make the fuel pump fail. (there is a handful of information on other websites)  The safety issue is that the car will shut off and is difficult to get started again. this happens when the car has about 2 gallons left in the tank or 50 ish miles to empty. this situation has happened to me three (3) times on the highway at about 70 miles an hour. this also happens most commonly in the winter due to the available fuel. this is also a safety issue because the car has NO heat and you could be stranded with a baby and this could become life threatening.   This problem has been reported on other websites and reproduced in my car 3 times. When I got my car towed to a Kia dealer (closest one) they said it was a mechanical issue with the fuel system.   The Kia dealer told me that the issue is due to winter fuel and low pressure in the fuel line. they recommended that I keep my car at or above 100 miles to empty. (so far they are correct)   This issue doesn't trigger any warning lamps / lights, or set any codes off. The car will just shut off and you will have to get more pressure into the fuel system.",
        "vin": "jf1gpaa69g9"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/22/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426926,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Subaru Impreza. The contact stated while driving at a low rate of speed and making a right turn, the vehicle suddenly experienced unintended acceleration causing the driver to lose control of the steering and drive into the opposite lane and into the neighbor’s yard. After shifting into neutral, the vehicle decelerated. The vehicle was later towed to the dealer who was unable to duplicate the failure. In addition, on several occasions when turning the vehicle off, the key would remain stuck in the ignition switch. The cause of the failure was not determined. The manufacturer was not notified of the failure. The failure mileage was 24,800. The Vin was not available.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424502,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "For the past few months, whenever I reach my destination, my key has been getting stuck in the ignition when I'm trying to park the car. This happens intermittently although it's becoming more frequent. I park the car, shift into \"P\", turn the key and it only turns partially .  I have to keep shifting in & out of \"P\"  until it finally turns the rest of the way and comes out. I've started to carry a second key with me. I have an appointment with a dealer next week.",
        "vin": "JF1GPAB67G8"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403410,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AND HIT A SMALL POTHOLE AND THE ENTIRE PASSENGER FRONT HEADLIGHT FELL OUT OF THE CAR. IT WAS NOT DARK OUT. THE CAR WAS FINE PRIOR TO TODAY. I WAS ON A CITY STREET JUST AFTER A SNOWSTORM AND ROADS WERE PLOWED.",
        "vin": "JF1GPAP68G8"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355575,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ONCE THE CAR IS PARKED, THE KEY CANNOT BE REMOVED FROM THE IGNITION. THIS PROBLEM GRADUALLY GOT MORE FREQUENT OVER THE LAST YEAR UNTIL IT GOT STUCK EVERY TIME WE DROVE. IT WOULD TAKE MULTIPLE ATTEMPTS TURNING THE CAR ON AND OFF TO GET THE KEY OUT. SUBARU OF AMERICA DID AGREE TO FIX IT AT NO CHARGE EVEN THOUGH THE CAR IS OUT OF WARRANTY.",
        "vin": "JF1GPAA67G8"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353983,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY LOCKS INTO IGNITION AND VEHICLE NEEDS TO BE RESTARTED AND THE SHIFT MOVED FROM PARK POSITION BACK TO PARK POSITION A FEW TIMES BEFORE THE KEY WILL RELEASE. I HAVE SEEN MANY COMPLAINTS ONLINE REGARDING THIS ISSUE IE. FAILING LOCK CYLINDER/PARK SENSOR PROBLEMS. WILL THERE BE AN INVESTIGATION INTO THIS AND A POSSIBLE RECALL?  MY CAR HAS LESS THAN 50,000M ON IT.",
        "vin": "JF1GPAA66GH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353881,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT ALLOW YOU TO TAK KEY OUT OF IGNITION WHEN CAR IS IN PARK.",
        "vin": "JF1GPAB68G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352844,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY CAR IS PARKED I CANNOT REMOVE MY KEY FROM THE IGNITION. I HAVE TO TAKE IT OUT OF PARK PUT IT BACK IN PARK PRESS PARK ALL THE WAY FORWARD JIGGLE MY KEY MOVE MY STEERING WHEEL AND THEN TAKE MY KEY OUT. SOMETIMES IT STILL WILL NOT REMOVE AND IT WILL TAKE ME A VERY LONG TIME TO REMOVE IT. OTHER TIMES I HAVE TO REVERSE MY CAR AND DRIVE FORWARD AND PARK TO TRY AND TAKE IT OUT.",
        "vin": "JF1GPAU61G8"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/22/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351771,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WILL NOT COME OUT OF THE IGNITION WHICH HAPPENS EVERY DAY SINCE THE FIRST HAPPENING ON 8/22/20.  AFTER GOOGLING IT APPEARS THIS IS A COMMON OCCURRENCE WITH 2016 IMPREZAS AND OUTBACKS.",
        "vin": "JF1GPAP60G8"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "07/16/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351026,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SHAKES WHEN I  DRIVING THE CAR AND WHEN I AM WAITING FOR THE LIGHT TO CHANCE USING THE BRAKES AND AC  IT LOOKS LIKE  TURN IN OFF .I WENT TO THE DEALER THEY SAID IS NORMAL BUT I BOUGHT THE CAR NEW NEVER SHAKE  I JUST WORRY HAVE TO DO SOMETHING WITH THE BRAKES",
        "vin": "JF1GPAY62GH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341855,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK IN VEHICLE IGNITION WHEN THE VEHICLE IS PLACED INTO PARK. SOME SORT OF COMPONENT THAT TELLS THE CAR IT IS PARKED IS MALFUNCTIONING. THIS DOES NOT HAPPEN EVERY TIME BUT PROBABLY ABOUT 50% OF THE TIME. PLACING THE CAR INTO GEAR AND THEN BACK INTO PARK EVENTUALLY FIXES THE ISSUE, BUT IT OFTEN TAKES MULTIPLE ATTEMPTS.     THIS STARTED HAPPENING AFTER ADJUSTING THE STEERING WHEEL FOR ANOTHER DRIVER. IT HAS SUBSEQUENTLY BEEN AN ISSUE.",
        "vin": "JF1GPAA69G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/20/2020",
        "dateOfIncident": "07/15/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340474,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY ON THE SUBARU IMPREZA WOULD NOT TURN TO THE OFF POSITION. DIFFICULT TO GET KEY OUT  OF THE IGNITION. TOOK CAR TO NAPLETON'S SUBARU IN PALATINE AND MECHANIC TECH REPLACED PARK SWITCH. I BELIEVE MECHANIC STATED THE KEY WOULD HAVE FALLEN OUT OF THE IGNITION IF THIS WAS NOT FIXED.  MY IMPREZA HAS 28,289 MILES AND IS IN GREAT CONDITION.  WHY DID THIS HAPPEN? CAR HAS KEY IGNITION AND WOULD NOT GO TO FINAL POSITION.",
        "vin": "JF1GPAP61G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339480,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY IGNITION REQUIRES MULTIPLE TRIES TO REMOVE KEY FROM IGNITION LOCK.    THIS HAPPENS EACH TIME I DRIVE THE CAR.  IT IS IMPOSSIBLE TO REMOVE THE KEY FROM THE IGNITION WITHOUT RESTARTING THE CAR AND COMPRESSING THE BRAKES OVER AND OVER.",
        "vin": "JF1GJAF64GH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "02/17/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309759,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS STOPPED AND TURNED OFF, THE KEY GETS STUCK IN THE IGNITION AND CAN'T BE REMOVED WITHOUT TURNING THE CAR BACK ON AND SHIFTING FROM PARK BACK TO DRIVE AND THEN BACK TO PARK AGAIN. HAVE TO DO THIS TWICE TO BE ABLE TO REMOVE THE KEY FROM THE IGNITION.",
        "vin": "JF1GPAU67G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2020",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298546,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STOPPING THE VEHICLE AND WHEN TRYING TO TAKE KEY OUT, KEY GETS STUCK IN THE KEY SLOT - CANNOT TAKE OUT. COMPLAINED TO DEALER AND DEALER IMMEDIATELY SAID IT IS IS A BRAKE SHIFT LOCK PROBLEM AND WILL COST $700 TO FIX - SO SUBARU KNOWS OF THE PROBLEM. CAR IS ONLY 24K MILES OLD. MANY PEOPLE ARE REPORTING IT ONLINE. DEALER SAYS IF I DO NOT FIX IT, YOU WILL GET STUCK OUTSIDE WITHOUT BEING ABLE TO TAKE KEY OUT AT A SUPER MARKET, FOR EXAMPLE",
        "vin": "JF1GJAF60GH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292465,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS STRUGGLING TO START, AND BATTERY HAS BEE DRAINING AT LEAST ONCE A WEEK BUT NEVER GOT A BATTERY LOW LIGHT. HAVE BEEN DRIVING IT EVERY WEEK DAY FOR ABOUT 5-10 MILES CONSISTENTLY.    TOOK IT TO AUTOZONE & THEY RAN SOME TESTS, SAID THERE IS NO POWER LEAK AND THE BATTERY IS STILL IN GOOD CONDITION. HOWEVER THE BATTERY STILL IS DRAINING.",
        "vin": "JF1GPAK67G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269117,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY ROUTINELY GETS STUCK IN THE IGNITION, REQUIRING ME TO SOMETIMES RESTART THE CAR MULTIPLE TIMES IN ORDER RIP REMOVE IT. I HAVE SEEN POSTS ON THE INTERNET SUGGESTING A SENSOR DOES NOT TELL THE CAR THAT IT IS IN PARK AND GOVE DIRECTIONS TO DISCONNECT IT.",
        "vin": "JF1GJAB63GH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/13/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268130,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING A VERY LOW RATE OF SPEED A SMALL ROCK WAS ABLE TO CRACK MY WINDSHIELD. I WAS MERGING ONTO A HIGHWAY WITH A WORK VEHICLE IN FRONT OF ME. THE WINDSHIELD APPEARS TO BE VERY WEAK AND BRITTLE. I HAVE NOT EVEN HAD MY FORESTER FOR A YEAR AND IT SEEMS AS IF DINKS AND CRACKS APPEAR VERY EASILY.     I HAD SAFELITE COME TO FILL IN THE CRACK AND ONLY 80% WAS ABLE TO BE CORRECTED.. ON A CRACK SMALLER THAN A SAND DOLLAR.     THINGS CONSTANTLY SEEM TO BE HEADED TOWARDS THE WINDSHIELD. I DON'T KNOW WHO TO FILE A COMPLAINT WITH, I FEAR SUBARU WOULDN'T CARE ABOUT WHAT SEEMS LIKE A MINOR COMPLAINT. I AM CONCERNED ABOUT THE POTENTIAL OF GETTING INTO A ACCIDENT AND MY WINDSHIELD RAINING OVER ME. OR A SMALL OBJECT BLOWING THROUGH MY WINDSHIELD.",
        "vin": "JF1GPAB67G8"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246165,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS STOPPED/PARKED I AM UNABLE TO TURN IGNITION OFF AND REMOVE THE KEY. THIS HAPPENS 25% OF THE TIME. IT IS AN ONGOING ISSUE.",
        "vin": "JF1GJAA69GH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245184,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS STOPPED AND TURNED OFF, THE KEY GETS STUCK IN THE IGNITION AND CAN'T BE REMOVED. SUBARU HAS ISSUED A TSB (TSB 16-112-18R) BUT NOT A RECALL.",
        "vin": "JF1GPAS62GH"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241421,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING WITH A FRONT SEAT PASSENGER THE PASSENGER BECOMES UNRECOGNIZED AND AIR BAG LIGHTS COME ON. THIS HAPPENS INTERMITTENTLY. THIS HAPPENS WILL DRIVING",
        "vin": "JF1GJAA68GH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234138,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A COMMON KNOWN ISSUE WITH SUBARU'S THAT WHEN PUT INTO PARK AND TURNED OFF, THE KEY CANNOT BE REMOVED.  THIS CAUSES THE CAR TO BE TURNED ON AND OFF, WHILE PUTTING INTO DRIVE, MOVING AND THEN BACK INTO PARK.  WITH CHILDREN AROUND, THIS IS VERY DANGEROUS AND AN UNNECESSARY RISK.    CURRENTY THIS IS ONLY COVERED UNDER STANDARD WARRANTY AND DISSUADING PEOPLE FROM REPAIRING.  SUBARU'S ANSWER TO OUR INQUIRIES AT THE SHOP AND ONLINE IS THAT IT IS NOT COVERED BY WARRANTY.  THE SHOP SAID THEY SEE THIS COMMONLY.    HTTPS://WWW.SUBARUFORESTER.ORG/VBULLETIN/F88/CANNOT-REMOVE-KEY-698170/    SUBARU NEEDS TO BE HELD ACCOUNTABLE FOR THIS DESIGN FLAW BEFORE IT CAUSES SOMEONE HARM.",
        "vin": "JF1GPAA62G8"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231541,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CAR WAS SLOWING IN A PARKING LOT AREA, TURNING AND BRAKING (HAVE WITNESS TO ATTEST TO THIS), IT HAD SUA (SUDDEN UNINTENDED ACCELERATION) AS I WAS ABOUT TO PARK AND THE VEHICLE WENT OVER A CURB AND THROUGH A BUILDING WALL IN LESS THAN 10 SECONDS. THE AIR BAGS DID NOT DEPLOY.   THIS CAR ALSO HAD A RECENT RECALL INVOLVING THE ELECTRICAL BRAKE SYSTEM LIGHTS/SENSORS.   THERE WAS NO ALCOHOL, PILLS OR ANYTHING OF THAT SORT INVOLVED AND NOR WAS A CELL PHONE IN PLAY AND NO DISTRACTIONS. THE CAR WAS BEING PARKED, AS IS THE CASE EVERYDAY AND THERE WAS A JOLT OF ACCELERATION AS I WAS DOING SO, WHICH IN TURN CAUSED CONFUSION AND PANIC. MY FOOT WAS NOT ON THE ACCELERATION AS THIS HAPPENED.   I AM VERY FORTUNATE THAT NO ONE WAS HURT.  ALTHOUGH, SEEING HOW I HAVE NEVER BEEN INVOLVED IN A WRECK BEFORE, THIS HAS ALL BEEN VERY TRAUMATIC. (DRIVING FOR ALMOST 20 YEARS)  I HAVE NOTIFIED MY INSURANCE AND SUBARU ABOUT WHAT HAPPENED.   HOPEFULLY THEY CAN SHED SOME LIGHT ON THE SITUATION SO IT WON'T HAPPEN TO ANYWAY ONE ELSE.  THE OTHER PEOPLE THAT IT HAS HAPPENED TO, UPON RESEARCH, MY HEART GOES OUT TO THEM.",
        "vin": "JF1GPAA65G8"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220987,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RECEIVING A RECALL NOTICE BY EMAIL FOR NHTSA RECALL ID 19V-149, I CALLED FOX SUBARU OF GRAND RAPIDS, MI (888-658-9163) FOR RECALL REPAIR. THE SERVICE DEPARTMENT TOLD ME THAT I WOULD NOT BE ABLE TO GET IN FOR RECALL REPAIRS FOR AT LEAST TWO MONTHS OR LONGER, WHICH IS WELL BEYOND A REASONABLE TIME FOR REPAIR OF AN URGENT SAFETY RECALL.",
        "vin": "JF1GPAP64G8"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/16/2019",
        "dateOfIncident": "06/16/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220482,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IF THE TWO FRONT SEATS ARE MILDLY WET, THEN THE FRONT AIR BAGS WILL TURN OFF. THIS MEANS THAT IF YOU SPILLED A DRINK, HAVE BLADDER PROBLEMS, WENT SWIMMING OR SNOWBOARDING, OR HAVE WET VACUUMED YOUR SEATS THEN THE AIRBAGS WILL TURN OFF. THEY ARE OFF UNTIL THE SEAT COMPLETELY DRIES WETHER YOU ARE MOVING OR NOT. IT HAPPENS EVERY TIME THE SEAT GETS WET.",
        "vin": "JF1GPAP65G9"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208999,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 SUBARU IMPREZA. WHILE THE VEHICLE WAS IN PARK, THE KEY FAILED TO RELEASE FROM THE IGNITION SWITCH. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO CAPITAL CHEVROLET (2855 MAPLE AVE NE, SALEM, OR 97301, (503) 585-4141) WHERE IT WAS DIAGNOSED THAT THE GEAR SHIFTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 15,000.  CONSUMER STATED THE PROBLEM IS WITH DEFECTIVE PLATE OPERATED BY THE GEAR SHIFTER TO TOUCH A SENOR WHICH JOB IS TO RELEASE THE KEY OUT OF THE IGNITION. THIS PLATE DOESN'T ALWAYS DO THE JOB THEREBY THE FAILURE OF THE KEY. I WAS TOLD THIS PROBLEM IS HAPPENING IN ALL SUBARU MODELS OF 2016 AND BEYOND. CONSUMER STATED IGNITION KEY GETS STUCK AND NOT RELEASING THE KEY.*JB",
        "vin": "JF1GPAP60G8"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "05/13/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208396,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE FOR BRAKE LIGHTS SUBARU SAFETY RECALL WUE-90; NHSTA RECALL ID 19V-149; APRIL 2019. I CALLED OUR LOCAL DEALER TO ARRANGE REPAIR AND WAS TOLD THAT IT WOULDN'T OCCUR UNTIL 8 JULY. WHAT ARE WE SUPPOSED TO DO IN THE MEANTIME? THE CAR IS USED FOR BUSINESS AND THE ONLY ONE WE OWN. WE CAN'T JUST \"NOT DRIVE IT\" AND ARE APPARENTLY AT INCREASED RISK DESPITE DRIVING APPROXIMATELY 30,000 MILES PER YEAR. IN THE TWO MONTHS BEFORE THIS CAN BE REMEDIED IT WILL HAVE BEEN DRIVEN APPROXIMATELY 5000 MILES, ALL THE WHILE RUNNING THE RISK OF GETTING REAR ENDED.",
        "vin": "JF1GPAY60G8"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187175,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS STATIONARY AND PLACED INTO PARK POSITION, THE GEAR SHIFTER IS ABLE TO BE MOVED FROM PARK INTO DRIVE, REVERSE, AND NEUTRAL WITH THE ENGINE OFF.  THE KEY ALSO BECOMES STUCK IN THE IGNITION WHEN THE GEAR SHIFTER IS MALFUNCTIONING.  DEALERSHIP STATED THAT THE SHIFT INTERLOCK WOULD NEED TO BE REPLACED TO REMEDY THE ISSUE.",
        "vin": "JF1GPAP68GH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/13/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186615,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE STOP SWITCH FAILS INTERMITTENTLY CAUSING DASH LIGHTS TO SHOW THE HILL BRAKE ASSIST, STABILITY CONTROL, AND ABS SYSTEMS HAVE STOPPED FUNCTIONING. ANOTHER SIDE-EFFECT OF THIS SITUATION IS THE FAILURE OF THE BRAKE LIGHTS CAUSING A RISK OF REAR COLLISION IF THE DRIVER CONTINUES TO DRIVE EVEN WHEN THE DASH LIGHTS GO OFF. AN EXTREMELY UNSAFE DRIVING SITUATION.",
        "vin": "JF1GPAA67G8"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183740,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS TURN ON AUTONIMOUSLY WITHOUT HAVING TO PULL THE EMERGANCY BRAKE OR DEPRESS THE BRAKE PEDAL. THE BRAKE LIGHT WITHIN MY VECHILE WILL TURN ON WHILE DRIVING RANDOMLY OR EVEN WHILE IN A STATIONARY POSITION, THERE IS NOT SET TIME INTERVAL TO THE RANDOM ON AND OFF BRAKE LIGHT SWITCH. SOME TIMES IT'LL TURN ON AND OFF WITHIN FIVE MINUTES OF DRIVING OR THRITY MINUTES.THERE HAS RECEMTLY BEEN A RECALL BY SUBARU FOR THIS EXACT ISSUE BUT I HAVE NOT RECEIVED A DEALER NOTIFICATION YET.",
        "vin": "JF1GJAB67GH"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175630,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 SUBARU IMPREZA. CONSUMER WRITES WITH CONCERN FOR VERY DIM HEADLIGHTS AND EASILY SCRATCHED/SOFT WINDOW SHIELD. *AS  *TR",
        "vin": "JF1GPAY60G8"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/03/2019",
        "dateOfIncident": "10/27/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173830,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED UNEXPECTED ACCELERATION WHEN TAKING MY FOOT OFF THE BREAK WHEN BACKING OUT OF A PARKING SPOT; SUCCESSFULLY STOPPED THE CAR WITH THE BREAK HOWEVER WHEN I TOOK MY FOOT OFF THE BREAK AGAIN TO GO FORWARD, THE CAR ACCELERATED DRIVING OVER A SMALL ISLAND AND HIT A PARKED CAR WHICH WAS PUSHED INTO ANOTHER PARK CAR.  AIRBAGS DID NOT DEPLOY.  NO INJURIES WERE SUSTAINED.  RECENTLY AN OUTSIDE AGENCY WAS HIRED BY SUBARU AND AN ENGINEER FROM THIS AGENCY COMPLETED AN INSPECTION.  AM WAITING TO GET THE RESULTS OF THIS REPORT.",
        "vin": "JF1GPAP64G8"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161996,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT SENSOR HAS BEEN GOING OFF WHEN NOTHING IS IN THE SEAT. BECAUSE THE SENSOR THINKS SOMETHING IS IN THE SEAT THE AIRBAG FOR THE PASSENGER SIDE IS TURNED ON. AFTER GOING TO THE DEALERSHIP, QUIRK SUBARU, IN BANGOR MAINE, THEY TOLD ME MY CELL PHONE WAS SETTING OFF THE SENSOR. THEIR RESOLUTION TO THIS PROBLEM, \"DON'T BRING YOUR CELL PHONE INTO THE CAR.\" THE CAR CAN BE MOVING OR STATIONARY AND WILL RANDOMLY TURN ON. IT'S GOTTEN WORSE OVER THE LAST YEAR HAPPENING ABOUT 4 TIMES SINCE AUGUST OF 2018.  I HAVE CONTACTED SUBARU OF AMERICA AND THEY TOLD ME TO GO TO ANOTHER DEALERSHIP TO HANDLE THE MATTER. IT IS MY OPINION THAT THIS POSES A RISK TO OCCUPANTS INSIDE THE VEHICLE WHICH MAY LED TO AN UNWANTED AIRBAG DEPLOYMENT.",
        "vin": "JF1GPAA61G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/24/2018",
        "dateOfIncident": "11/22/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153555,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO A THANKSGIVING GATHERING, WHEN ALL OF A SUDDEN THE CAR JULTED. IT WAS VERY ODD FELT ALMOST LIKE A PIN WAS PUT IN THE TRANSMISSION FORCING THE TIRES TO STOP SPINING. BUT WAS VERY BRIEF. AFTER ANOTHER 0.5 MILES OF DRIVING ON THE FREEWAY AT 70MPH IT HAPPENED AGAIN BUT CONTINUOUSLY WITH LOUD GRINDING AND CRUNCHY NOISES. AFTER PULING OVER THE CAR WAS SMOKING. THE TRANSMISSION WAS EXTREMELY HOT. NO LIGHTS WARNING LIGHTS CAME ON. GOT A TOW TRUCK AND IT STRUGGLED TO PULL THE CAR ON TO THE TRAILER BED. AND WHILE IT WAS ROLLING ON YOU COULD STILL HEAR THE GRINDING NOISES. WE HAD 4 PEOPLE IN THE CAR 2 SMALL 5FT 2IN WOMEN AND 2 MAKES WINNING 180 LBS. WE HAD FOOD AND DUFFLE BAGS IN THE TRUNK AND IT WAS 40 DEGREES FAHRENHEIT OUTSIDE WE WERE 1 HOUR INTO THE TRIP AND ON FLARE ROADS",
        "vin": "JF1GPAB64G8"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,WHEELS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151546,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A DECLINE AT 10 TO 15 MILES PER HOUR ON A SNOWY EVENING AND WHEN I TRIED TO BREAK, MY BREAKS LOCKED UP AND I HAD ABSOLUTELY NO CONTROL OF MY AUTOMOBILE EXCEPT FOR STEERING AND MADE THE CHOICE TO GO TOWARDS THE GUARD RAIL TO SLOW MY AUTOMOBILE DOWN SINCE I HAD NO BRAKES.  I BOUGHT MY AUTOMOBILE 16 MONTHS AGO AND HAVE HAD DIFFICULTIES WITH TIRE LIGHTS COMING ON AND MANY OTHER ISSUES AND I DO NOT FEEL SAFE DRIVING THIS AUTOMOBILE.",
        "vin": "JF1GPAB61GH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/07/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150017,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY UNABLE TO REMOVE KEY FROM IGNITION AFTER PLACING CAR IN PARK. UPON RESTARTING VEHICLE AND TURNING IT BACK OFF, KEY IS ABLE TO BE REMOVED.",
        "vin": "JF1GPAU69G8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "10/04/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133615,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAGS TURN OFF WHEN IT IS RAINING OR HUMID OUTSIDE.  PROBLEMS HAVE BEEN EXPERIENCED WHEN THE CAR WAS STATIONARY AND WHEN THE CAR WAS IN MOTION.  PASSENGER AIRBAG HAS TURNED OFF WHEN THERE WAS A PASSENGER IN THE SEAT; DRIVER'S SIDE AIRBAG HAS ALSO TURNED OFF DURING RAINING/HUMID CONDITIONS.  THIS HAS HAPPENED MULTIPLE TIMES OVER THE LAST FEW MONTHS.",
        "vin": "JF1GPAP63GH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/22/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103341,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR AUTOMATIC DOOR LOCKS WILL NOT LOCK/UNLOCK USING KEY FOB OR AUTOMATIC DOOR LOCK/UNLOCK FEATURE ON INTERIOR OF CAR. IT SEEMS TO BE MORE AFFECTED DURING HOT OR COLD DAYS. THE ONLY WAY TO LOCK/UNLOCK IS TO MANUALLY DO IT. THE VEHICLE HAS NEVER BEEN IN AN ACCIDENT, NO WATER DAMAGE OR HAS HAD ANY OTHER ISSUE.",
        "vin": "JF1GPAA60G9"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062403,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CVT WILL NOT SHIFT IN COLD WEATHER. I TOOK TO THE DEALER 3 TIMES AND THEY SAID NOTHING WRONG. I HAVE A VIDEO OF THE TACH REACHING 2600 RPM'S AT 30 MILES TO 55 MPH AND CVT WAS STUCK IN 3RD GEAR, WOULD NOT SHIFT. I SAY THIS IS A SAFETY PROBLEM, NOT NORMAL FOR THIS OR ANY CAR. GAS MILEAGE IS BAD, ENGINE WEAR IS BAD AND NOT SAFE ON HIGHWAY. THIS HAPPENED )1/3/18, 1/6/18 AND 1/8/18.",
        "vin": "4S4BSANC2G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/28/2017",
        "dateOfIncident": "11/16/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030369,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLUETOOTH HAS A CONNECTIVITY ISSUE.  IT HAPPENS WHEN I'M DRIVING, WHEN I HIT THE BRAKES, WHEN I PUT THE CAR IN GEAR, WHEN I'M STATIONARY.  THERE IS REALLY NO TELLING WHEN IT WILL SKIP, BUT IT HAPPENS ONE TO TWO TIMES EVERY HOUR.  IT IS A SAFETY HAZARD BECAUSE IT CAUSES MY HEART TO RACE AND SOMETIMES I FEEL I'M HAVING A PANIC ATTACK.  I BOUGHT THE CAR BRAND NEW, THE DEALERSHIP AND THE MANUFACTURER KNOW ABOUT THE PROBLEM.  THE MANUFACTURER SAID THE PROBLEM IS NOT THE CAR, IT'S NOT THE PHONE, BUT IT'S THE WAY IT CONNECTS, AND THEY HAVE NO SOLUTION.  I PREVIOUSLY OWNED A 2013 SUBARU IMPREZA AND IT DID NOT HAVE THIS PROBLEM.  THEY REPLACED THE RADIO UNIT, MADE SURE THE CAR'S OPERATING SYSTEM IS UP TO DATE, AND BASICALLY TOLD ME IT'S JUST THE WAY IT IS AND THERE'S NOTHING THEY CAN DO ABOUT IT.",
        "vin": "JF1GJAB61GH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013796,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 16 YEAR OLD DAUGHTER WAS DRIVING TRAVELING AT APPROXIMATELY 40MPH ON A CIITY STREET WHEN A DEER JUMPED IN FRONT OF HER.  SHE SWERVED TO MISS THE DEER, LEAVING THE ROAD AND ENTERING A HEAVELY WOODED LOT.  SHE CAME TO A STOP APPROXIMATELY SIX FEET OFF THE ROAD STOPPED BY A TREE DEAD CENTER IN THE FRONT BUMPER.  EVEN THOUGH SHE WAS TRAVELING APPROXIMATELY 40 MPH, NEVER LOCKED UP THE BRAKES, AND HER REAR PUMPER WAS ONLY SIX FEET OFF THE ROAD, THE AIR BAGS NEVER DEPLOYED.",
        "vin": "JF1GJAA62GH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "04/29/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984238,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 SUBARU IMPREZA. THE CONTACT STATED THAT THE VEHICLE ACCELERATED AT A HIGH RATE OF SPEED AND SURGED WHILE MAKING A TURN IN EITHER DIRECTION. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED BY A DEALER. THE CONTACT WAS TO CHECK WITH THE MANUFACTURER TO DETERMINE IF THEY COULD PROVIDE A SOLUTION. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "JF1GPAB67G8"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2017",
        "dateOfIncident": "01/22/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949640,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED MY CAR ON ONE AFTERNOON AND FOUND THE POWER STEERING WARNING LIGHT STAYED LIT ON THE DASHBOARD WHILE CAR WAS STATIONARY. WHEN I TRIED TO DRIVE, I DISCOVERED THE POWER STEERING WAS COMPLETELY GONE (I.E., VERY HARD TO TURN STEERING WHEEL). HAD CAR TOWED TO DEALER, SINCE ONLY 1 YEAR OLD. DEALER INITIALLY DIAGNOSED THE PROBLEM AS A BAD POWER STEERING CONTROL MODULE. THREE DAYS LATER, AFTER THE PART ARRIVED, THEY INSTALLED IT AND FOUND MORE ERROR CODES INDICATING A POWER SUPPLY ERROR. MORE NEW PARTS WERE ORDERED THAT TOOK ANOTHER THREE DAYS TO ARRIVE. UPON REMOVAL OF POWER STEERING RACK, TECHNICIAN FOUND RODENT DAMAGE ON WIRING TO MODULE ON RACK AND PINION UNIT.  MY ONLINE RESEARCH SUGGESTS RODENTS ARE ATTRACTED TO SOY WIRE INSULATION THAT IS USED IN NEWER SUBARU VEHICLES LIKE MINE.  I AM CONCERNED OTHER ELECTRICAL SYSTEMS CAN SHORT OUT IN THE CAR AT ANY TIME, SINCE I CANNOT AVOID SQUIRRELS AS MY CAR IS PARKED IN AN OPEN PARKING LOT AT HOME.  MY PRIOR CAR (A 1999 SATURN SL2) WAS DRIVEN AT THE SAME INTERVALS AND PARKED AT THE SAME LOCATION FOR 5.5 YEARS WITHOUT A SIMILAR PROBLEM.",
        "vin": "JF1GJAB67GH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/17/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10927234,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 SUBARU IMPREZA. WHILE DRIVING 3 MPH, THE VEHICLE ACCELERATED RAPIDLY WITHOUT WARNING AND CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A WHIPLASH AND A BLOODY NOSE, WHICH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 2,047.",
        "vin": "JF1GPAB68GH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/01/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920499,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE WHILE DRIVING ON A HIGHWAY, I BLACKED OUT. FIRST TIME, RAN OFF EDGE OF ROAD; SECOND TIME, RAN OVER INTO ON-COMING LANE. TWICE, I HAD MAJOR ALLERGIC SYMPTOMS. FIRST, RIGHT AFTER BUYING CAR; SECOND, SIX MONTHS LATER. TWICE, I GREW BREATHLESS AFTER DRIVING CAR FOR SEVERAL HOURS. ONCE, I COULD NOT KEEP MY BALANCE AFTER DRIVING CAR ON A HIGHWAY. ALL OF THESE EPISODES OCCURRED AFTER LONGER THAN USUAL DRIVES. NORMALLY, I DRIVE SHORT DISTANCES AROUND TOWN.    TWICE, AN OPAQUE FILM FORMED ON THE EXTERIOR OF THE FRONT WINDSHIELD, OBSCURING VISIBILITY - ONCE ON A DARK HIGHWAY; ONCE ON ENTERING A GARAGE. WIPERS, WASHER FLUID, RAIN DID NOT AFFECT THE FILM.  *TR",
        "vin": "JF1GPAP61GH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908013,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2016 SUBARU IMPREZA STARTED TO GO FORWARD WHEN THE SHIFT KNOB WAS IN THE REVERSE POSITION. THIS HAPPENED 3 TIMES IN A ROW AND ON THE THIRD TIME THE CAR WAS ACCELERATING CAUSING THE DRIVER TO BRAKE HARD IN ESSENCE \"FIGHTING\" THE TRANSMISSION. AFTER THE CAR WAS TURNED OFF, TRIED AGAIN, MADE IT HOME.  IT WAS A RAINY DAY. MADE APPT. WITH DEALER. AFRAID TO DRIVE IT!",
        "vin": "JF1GPAA65GH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10877160,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 SUBARU IMPREZA. WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE UNINTENTIONALLY ACCELERATED WITHOUT WARNING. THE FAILURE RECURRED ON THREE DIFFERENT OCCASIONS. THE VEHICLE WAS TAKEN TO BE DIAGNOSED, BUT THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 34,500. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "04/12/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872648,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO ACCELERATE RAPIDLY FROM A STANDING OR SLOW MOVING POSITION THE CAR STALLS OFTEN TIMES LEAVING YOU MOMENTARILY STOPPED IN THE FACE OF ONCOMING TRAFFIC.THIS ACTION IS SPORADIC, IT DOES NOT HAPPEN EVERY TIME YOU MASH THE ACCELERATOR FOR TAKE-OFF . THE DEALER MECHANIC SAYS IT HAS BEEN A NORMAL PROBLEM WITH THIS CAR.",
        "vin": "JF1GPAA67F8"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/01/2016",
        "dateOfIncident": "02/21/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839197,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY WIFE SITS ON A 3 INCH FOAM CUSHION ON THE PASSENGER SIDE THE PASSENGER SIDE TO SIT MORE COMFORTABLY (SHE IS 4'11' AND HAS HIP PROBLEMS); THE PASSENGER SIDE AIR BAG INDICATOR ONLY GOES INTO ON MODE INTERMITTENTLY.    THIS HAPPEN WHEN ENTERING THE CAR AND CONTINUES WHILE THE CAR IS IN MOTION.    THIS COULD BE DANGEROUS IN AN ACCIDENT, IF NOT NOTICE BE THE PASSENGER OR DRIVER. CORRECTIVE ACTION BELIEVE IT OR NOT INVOLVE.S BOUNCING UP AND DOWN ON THE SEAT.     A SIDE EFFECT SEEMS TO BE, THAT WHEN THE SIGN IS IN OFF POSITION, THE SEAT BELTS LOCKUP AND CONSTRICT THE PASSENGER.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/07/2016",
        "dateOfIncident": "02/06/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824680,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELTS LOCK OFTEN AND WILL NOT RELEASE UNTIL THEY ARE FULLY RETRACTED AND PUT BACK ON.  THE DRIVER OR PASSENGER WILL BE FIRMLY SECURED TO THE SEAT WHEN THIS OCCURS.  IT HAS CAUSED US MANY TIMES TO HAVE TO PULL OFF THE ROAD TO CORRECT THE BELT.  THIS CAUSES A DANGEROUS SITUATION WHEN THE DRIVER CANNOT MOVE TO CHECK FOR ONCOMING TRAFFIC ETC.  THE DEALER CALLS THIS NORMAL OPERATION AND SAYS NOTHING IS WRONG.  ALSO, THIS HAPPENS IN MOTION OR STANDING STILL AND EVEN WHEN THE CAR IS OFF.",
        "vin": "JF1GPAA65G8"
    }
]