[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "12/06/2019",
        "fire": false,
        "manufacturer": "Royal Enfield North America Limited",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11377235,
        "products": [
            {
                "manufacturer": "Royal Enfield North America Limited",
                "productMake": "ROYAL ENFIELD",
                "productModel": "BULLET ELECTRA EFI",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE 2016 MODEL IN 2018 AS A NEW MOTORCYCLE AND LIKELY THAT CAUSED ISSUES DUE TO JUST SITTING IN THE FACTORY/DEALER. WITHIN A FEW MONTHS- SOMETIMES, THE BIKE WOULD STOP AT SLOW SPEED/ TAKING TURNS, ETC. I REPORTED IT TO A LOCAL DEALER, BUT DIFFICULT TO REPRODUCE THE SAME EVERY TIME. NEXT SERVICE- I WAS TOLD THAT THEY CHANGED THE START PLUG ETC, BUT NO CHANGE. THEN ONLY AT AROUND 2000 MILES- CLUTCH WIRE BROKE ON HIGHWAY DRIVING AND SCREWS STARTED FALLING ON HIGHWAYS. THE LOCAL DEALER CHECKED AGAIN AND FOUND NOTHING WRONG. THIS TIME, I CONTACTED ROYAL ENFIELD TO GET A HIGHER LEVEL CHECK AS NEW BIKE WITH SUCH A LOW MILEAGE APPEARED DANGEROUS. MEANWHILE, LOCAL DEALER FIXED EVERYTHING AS STILL IN WARRANTY. ROYAL ENFIELD CUSTOMER SERVICE ACKNOWLEDGED BUT DID NOTHING. DEALER DID NOT GET ANY MESSAGES FROM ROYAL ENFIELD AND FORCED ME TO PICK UP MOTORCYCLE. THEN WITHIN ONE MONTH AND AROUND 200 MILES- I WAS DOWN FROM MOTORCYCLE ON SLOW SPEED/ CLOSE TO REDLIGHT. LUCKILY I SURVIVED BUT HAD MULTIPLE FRACTURES. FINALLY, I SENT ANOTHER EMAIL TO ROYAL ENFIELD TO LOOK INTO THIS SERIOUS ISSUES BUT NO RESPONSE. DEALER SAID EARLIER MULTIPLE TIMES TRIED TO CONTACT ROYAL ENFIELD BUT NO RESPONSE. EVEN THEY COMMENTED THAT THEY HAD TO FIX SO MANY THING ON THEIR OWN COST AS ROYAL ENFIELD CUSTOMER SERVICES DOES NOT DEAL WITH MANY CUSTOMERS.   ACCIDENT HAPPENED DUE TO MOTORCYCLE SUDDEN LOOSING POWER/STOPPING AS NO ONE ELSE INVOLVED IN ACCIDENT AND SIMILAR TO PREVIOUS INCIDENCES AT LOW SPEED. PLEA TO ROYAL ENFIELD TO TAKE ACCOUNTABILITY FOR THEIR MANUFACTURING ISSUES AND RESOLVE ASAP.",
        "vin": "ME3FSV271GC"
    }
]