[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2021",
        "dateOfIncident": "08/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431532,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The horn on the vehicle began to operate intermittently and now it does not work at all.  This is a major safety issue as I have several near misses with other drivers turning into my travel lane without signaling and nearly causing an accident.  I have no way of preventing an incursion without the horn being operational.  Toyota dealership informed me it was a spiral cable and the cost would be nearly $900.00 to replace.  I feel this device should not be prone to failure and be replaced at no cost to me.  I have seen where Toyota has had this issue before and recalled to have said spiral cable replaced.  I tried Toyota customer care and they told me it was my issue.  This is a safety issue and wish Toyota to stand behind their product.",
        "vin": "JTNKARJE8GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388528,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LIGHT ON THE DASH CAME ON FOR A SECOND WHILE ACCELERATING FROM A STOP. THE PROBLEM HAS PROGRESSIVELY GOTTEN WORSE. THE LIGHT NOW COMES ON AND STAYS ON THE WHOLE TIME YOU ACCELERATE BUT AS SOON AS YOU LET OFF THE GAS PEDAL THE LIGHT GOES OUT. THIS NOW HAPPENS EVERY TIME YOU ACCELERATE FROM A STOP AND THE LIGHT STAYS ON UNTIL YOU LET OFF THE GAS.",
        "vin": "JTNKARJE5GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388529,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION DOES QUIRKY THINGS. SOMETIMES IT GETS STUCK IN HIGH RPM'S AND DOESN'T WANT TO UPSHIFT. SOMETIMES IT WON'T ACCELERATE BECAUSE YOU CAN'T GET THE RPM'S UP HIGH ENOUGH. THIS IS AN AUTOMATIC TRANSMISSION. SOMETIMES IT SLIPS",
        "vin": "JTNKARJE5GJ"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145240,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY 2016 SCION IM AND WAS GREAT FOR THE FIRST YEAR. IN 2018, THE CAR DEVELOPED A ROUGH IDLE, USUALLY AT A STOP LIGHT AND AFTER THE CAR WAS WARM. I REPORTED IT TO THE DEALERSHIP AND NOTHING WAS FOUND AS IT WAS NOT REPLICATED DURING THEIR TEST DRIVE. THE CAR CONTINUED TO ROUGH IDLE UNTIL THE NEXT ISSUE HAPPENED.   THE NEXT ISSUE I HAVE BEEN HAVING IS THE TRANSMISSION WOULD HESITATE AT STOP LIGHTS. IT ALSO DECELERATED ON ITS OWN WHILE TRAVELING AT 70 MPH DOWN TO A SLOW CRAWL!. TOOK IT INTO THE DEALERSHIP AFTER A SCARY SITUATION ON THE FREEWAY. THE SERVICE REP TOLD ME THAT THERE WAS AN UPDATE TO THE TRANSMISSION SOFTWARE THAT HAD TO BE DONE. AFTER ABOUT 3 HOURS, I WAS TOLD THAT AFTER THE SOFTWARE UPDATE, MY CAR'S TRANSMISSION WAS DESTROYED! I WAS A BIT CONFUSED AS TO WHAT HAPPENED ON A SIMPLE SOFTWARE UPDATE. MY CAR ONLY HAS 32K MILES ON THE ODOMETER. THE SERVICE DEPARTMENT GAVE ME A RENTAL CAR TO GET AROUND IN WHILE MY CAR AWAITS A TRANSMISSION FROM TOYOTA. I DON'T KNOW IF ANYONE ELSE HAS BEEN EXPERIENCING THIS ISSUE BUT IT SURE IS A SCARY ISSUE TO HAVE. I MUST SAY THAT TOYOTA HAS NOT SENT ANY INFORMATION TO MY HOME ADDRESS WITH REGARDS TO ANY SOFTWARE UPDATES. SEEMS LIE TOYOTA HAS DROPPED THE BALL ON THIS ONE.",
        "vin": "JTNKARJE2GJ"
    },
    {
        "components": "SEATS,VISIBILITY/WIPER",
        "crash": true,
        "dateComplaintFiled": "03/12/2018",
        "dateOfIncident": "08/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11078616,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS THE WORST BACKSEAT HEADREST. THEY'RE TOO HIGH AND TALK AND OBSTRUCT THE REAR WINDOW WHEN DRIVING. CREATES A TERRIBLE BLINDSPOT ON BOTH SIDES OF THE BACK WINDOW.   ACTUALLY GOT INTO A CAR ACCIDENT IN A PARKING LOT PULLING OUT OF MY SPOT. SINCE I DID NOT HAVE THE CLEAR VISIBILITY THE DRIVER BEHIND ME PULLED OUT AND I COULDN'T REACT IN TIME.",
        "vin": "JTNKARJE9GJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2018",
        "dateOfIncident": "04/24/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074707,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE FRONT WINDOW MAKES A NOISE AS IT RUBS AGAINST SOMETHING INSIDE OF DOOR WHEN LOWERING OR RAISING WINDOW.",
        "vin": "JTNKARJE7GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2018",
        "dateOfIncident": "08/26/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063894,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW TOYOTA IM BUT IT WAS A BROKEN EVAPORATOR CORE.  I WANT TOYOTA CHECK THE PLACE.  I AM CLAIMING TO THE LEMON LAW ARBITRATION.  THE MECHANIC WHO CHECKED SAID LOOKED LIKE IT WAS CRUSHED WHEN THE CAR WAS MAKING.  I WOULD LIKE YOU TO CHECK FURTHER INVESTIGATION SINCE IT WAS SOLD AS A BRAND NEW CAR AND TOYOTA TRY TO GET AWAY WITH NOTHING HAPPENED.  ALSO CLEARWATER POLICE FOUND THAT THEIR TINTED WINDOWS WERE ILLEGAL LEVEL.  THEY SOLD ME AN ILLEGAL CAR!!",
        "vin": "JTNKARJE9GJ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2017",
        "dateOfIncident": "07/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011861,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION BEGAN SLIPPING WHILE ON THE HIGHWAY LESS THAN 25 MILES AFTER SERVICE AT TOYOTA DEALERSHIP. THE CLUTCH THEN DEGRADED OVER LESS THAN 500 MILES TO THE POINT WHERE VEHICLE WAS BARELY DRIVABLE AND DID NOT TRANSMIT ENOUGH POWER TO GO UP HILLS AT ALL.    TOYOTA SERVICE TECH TEST DROVE VEHICLE AND VERIFIED CLUTCH IS SLIPPING AND JUST BARELY ENGAGING AT THE TOP OF THE PEDAL TRAVEL. RECOMMENDED REPLACING CLUTCH DISC, PRESSURE PLATE, THROWOUT BEARING, AND RESURFACING FLYWHEEL. TOTAL REPAIR COST WAS QUOTED AT $2,527.36.     VEHICLE HAD APPROXIMATELY 43500 MILES ON IT WHEN TRANSMISSION BEGAN SLIPPING. THIS IS EXTREMELY LOW MILEAGE FOR A NEW VEHICLE, ABOUT A YEAR OLD. I'VE SPOKEN WITH THREE OTHER DRIVERS OF THE SAME MODEL, AND THEY REPORTED THEIR CLUTCHES REQUIRED REPLACING BETWEEN 30000 AND 40000 MILES. THEY ALSO AGREED WITH MY OPINION THAT THE CLUTCHES WERE POORLY DESIGNED, CONTRIBUTING TO ACCELERATED WEAR AND TEAR (THE CLUTCH IS EXTREMELY LONG AND HAS A VERY VAGUE BITE POINT). I HAVE FILED A COMPLAINT WITH TOYOTA, AND THEY HAVE YET TO COMPLETE AN INVESTIGATION. IT IS UNCLEAR WHETHER THIS IS A FACTORY DEFECT, DESIGN ISSUE, SABOTAGE BY THE TOYOTA DEALERSHIP, OR SOME COMBINATION THEREOF.",
        "vin": "JTNKARJE9GJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/16/2016",
        "dateOfIncident": "09/09/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926474,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "IM",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-  PURCHASE 2016 SCION IM BRAND NEW A FEW MONTHS AGO.  I NOTICED A PAINT DETAIL ON THE TOP OF THE HATCHBACK DOOR INSIDE WAS DONE POORLY.",
        "vin": "JTNKARJE9GJ"
    }
]