[
    {
        "components": "STRUCTURE,TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "TAXA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437201,
        "products": [
            {
                "manufacturer": "TAXA INC.",
                "productMake": "TAXA LP",
                "productModel": "CRICKET",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2021 Taxa LP Cricket RV. The contact stated that while the RV was parked, he noticed a lack of clearance between the rear passenger’s and driver’s side suspension, tire, and the wheel well. The contact took the vehicle to a local dealer who confirmed the clearance issue with the tires and the wheel well. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 750.",
        "vin": "4t9ac1519mh"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/30/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "TAXA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326585,
        "products": [
            {
                "manufacturer": "TAXA INC.",
                "productMake": "TAXA LP",
                "productModel": "CRICKET",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS HAVE FORMED ON BOTH SIDES OF MAIN TRAILER A-FRAME WHERE IT TRANSITIONS TO THE PARALLEL LADDER FRAME (BENDS 25DEG).  THE CRACKS ARE NEARLY ALL THE WAY THROUGH THE FRAME.  THE A-FRAME AND TOWING VEHICLE WERE CLOSE TO SEPARATING FROM THE MAIN SECTION OF THE TRAILER, IN SUCH A WAY THAT  THE TRAILER WOULD RUN AWAY UNCONTROLLABLY.  TRAILER FRAME WAS UNMODIFIED AND TRAILER USAGE WAS WITHIN INTENDED USE.  CRACK LIKELY FORMED DURING NORMAL ROAD GOING USE AND GREW OVER TIME.  IT IS MY UNDERSTANDING THAT THIS MODEL YEAR, 2016, WAS THE INTRODUCTION OF A NEW FRAME DESIGN.",
        "vin": "4T9AC1516GH"
    }
]