[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/30/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065976,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE A TOTAL OF 18 VERTICAL POSTS (SQUARE STEEL TUBE) THAT CONECT AND SUSPEND THE COACH FLOOR FRAME APPROXIMATELY 1.5 INCHES ABOVE THE CHASSIS RAILS.  PER TIFFIN SERVICE REPRESENTATIVES, THESE POSTS ARE TO BE WELDED TO THE CHASSIS ON BOTH SIDES WHERE THE SQUARE STEEL TUBE INTERFACES THE CHASSIS RAIL BY APPROXIMATELY 2 INCHES.  ON 1/15/18, I PERFORMED AN INSPECTION OF THESE WELDS BASED ON MANY DOCUMENTED CASES FROM OTHER TIFFIN ALLEGRO OWNERS OF FAILED HOUSE-TO-CHASSIS WELDS, AND I FOUND ALL 18 POSTS WELDED ON ONLY ONE SIDE AND ONE FAILED WELD THAT HAD A COMPLETE FULL-LENGTH CRACK.  TIFFIN IS FULLY AWARE OF THIS MANUFACTURING ERROR AS MANY COACHES HAVE EXPERIENCED WELD FAILURES ON ALL PASSENGER SIDE POSTS RESULTING IN A COLLAPSE OF THE HOUSE ONTO THE CHASSIS RAIL.  THIS PRESENTS A SIGNIFICANT SAFETY CONCERN AS VEHICLE HANDLING CAN BE ADVERSELY AFFECTED BY SUCH A COLLAPSE.  MANY OF THESE COACHES HAVE RETURNED TO TIFFIN'S RED BAY SERVICE CENTER IN ALABAMA WHERE MECHANICS CORRECTLY SECURE THE POSTS WITH WELDS ON BOTH SIDES OF EACH POST.  TIFFIN HAS NOT NOTIFIED ANY OWNER OF THIS MANUFACTURING ERROR AND THE ASSOCIATED SAFETY RISKS.  FURTHERMORE, THEY REFUSE TO AUTHORIZE A REASONABLE AMOUNT FOR OTHER SERVICE CENTERS TO PERFORM THE NECESSARY REPAIRS.  INSTEAD, ONCE QUESTIONED ABOUT THESE FAULTY WELDS, THEY ENCOURAGE THEIR CUSTOMERS TO TRAVEL TO THEIR ONE FACILITY IN ALABAMA SO THEIR OWN MECHANICS CAN PERFORM THE REPAIRS AT NO CHARGE.",
        "vin": "1F66F5DYXF0"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "01/02/2017",
        "fire": true,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030594,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIFFIN ALLEGRO PHAETON 44OH WAS PARKED IN FRONT OF OUR HOME ON JANUARY 2, 2017.  AT APPROXIMATELY 2:30AM OUR HOME SECURITY CAMERA CAPTURED A FIRE START IN THE WET BAY AREA.  THE FIRE QUICKLY SPREAD TO THE ENTIRE CENTER SECTION OF THE VEHICLE.  CITY FIRE INVESTIGATORS AND AN INDEPENDENT FIRE FORENSIC INVESTIGATION COMPANY IDENTIFIED THE WET BAY ARE AS THE LOCATION WHERE THE FIRE IGNITED (COINCIDING WITH THE HOME SECURITY VIDEO).  ONE DAY PRIOR TO THE FIRE, WE NOTED THAT THE GFCI OUTLET IN THE WET BAY WAS NOT WORKING AND IT QUICKLY TRIPPED OFF WHEN WE ATTEMPTED TO RESET IT.  ADDITIONALLY, WE REVIEWED OUR TIFFIN DEALER ORIENTATION VIDEOS AND LEARNED THAT THE MANUFACTURER BEGAN INSTALLING THESE 110V OUTLETS IN THE WET BAY RECENTLY.    THE FIRE INVESTIGATORS WERE NOT ABLE TO LOCATE THE GFCI OUTLET AS A RESULT OF THE FIRE HEAT (IT WAS DESTROYED) HOWEVER, THEIR REPORT INDICATES THAT THE FIRE PATTERN INDICATES AN IGNITION IN THIS AREA.",
        "vin": "5VBPA87A8GA"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "01/19/2017",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947003,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TIFFIN ALLEGRO. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 60 MPH WITH THE CRUISE CONTROL ACTIVATED, THE THROTTLE BODY WAS GETTING STUCK, THE ACCELERATOR PEDAL WAS SLOW TO RESPOND WHEN REVERSING OR WHILE IN DRIVE, AND THE CONTACT HAD TO MANEUVER THE PEDAL WHEN THE FAILURE HAPPENED. THE VEHICLE WAS TAKEN TO TWO DIFFERENT DEALERS WHERE THE FAILURE WAS UNABLE TO BE REPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 3,000.  ...UPDATED 03/13/17 *BF    *CN",
        "vin": "1S66S5DY4G0"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "10/19/2015",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788704,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHERE THE METAL RING THAT THE SEAT BELT SLIDES THROUGH ATTACHES TO THE FRAME OF THE MOTOR HOME ABOVE THE PASSENGERS RIGHT SHOLDER AND THE DRIVERS LEFT SHOULDER THE MOUNT WAS ASSEMBLED WITH THE INCORRECT PARTS. THE STUD, SEAT BELT SLIDE, WASHER AND NYLON LOCKING NUT ARE INCOMPATIBLE AND THE NYLON LOCKING NUT WILL NOT SEAT ON THE THREADS OF THE STUD. THIS ALLOWED THE NUT TO LOOSEN FROM VIBRATION WHILE DRIVING ON THE INTERSTATE AFTER LESS THAN 4,OOO MILES AND THE BELT FELL FROM THE MOUNT.     THE ISSUE IS THE OUTSIDE DIAMETER OF THE STUD MOUNTED TO THE WALL IS A LARGER OUTSIDE DIAMETER THAN THE INSIDE DIAMETER OF THE MOUNTING HOLE OF THE METAL SEAT SLIDER THAT GOES ONTO THE STUD. THIS MISMATCH OF DIAMETERS WILL NOT ALLOW THE WASHER AND NYLON LOCKING NUT TO SEAT PROPERLY. THE NYLON IN THE LOCKING NUT IS TWO THREADS AWAY FROM MAKING ANY CONTACT AT ALL WITH THE BOLT.",
        "vin": "1F66F5DY5G0"
    }
]