[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "11/07/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439744,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving my 2016 Sienna 30 mph, when suddenly, the rear driver's side window exploded. The police came and inspected the incident, the surroundings and the vehicle, and determined that there was no object or strike to cause the explosion. There were no warnings or lamps. There was no pressure change such as a window or door opening to cause the explosion. Should the glass have imploded, we would be having a very different conversation, as my two children were in the vehicle with me. The safety of my two children was at risk due to the glass exploding. We called our local Toyota dealer, and they claim to have no information on dealer notifications, recalls, or even heard of such a thing, perhaps to avoid having to pay for the repair. I have attached a photo of the damaged window.",
        "vin": "5TDDK3DC5GS"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403888,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 TOYOTA SIENNA. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, THE STEERING WHEEL STIFFENED, WHICH RESULTED IN HER CRASHING THE VEHICLE INTO THE HIGHWAY SIDE BARRIER AND A FENCE STOPPED THE VEHICLE FROM GOING INTO THE WATER. THE CONTACT DID NOT SEEK MEDICAL ATTENTION AND A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED AND DEEMED TOTALED BY THE INSURANCE COMPANY. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND PERFORMED AN INVESTIGATION. THE MANUFACTURER INFORMED THE CONTACT THAT FROM THE INSPECTION, THE EDR RECORDED VARIOUS STEERING INPUT PRIOR TO THE IMPACT, HOWEVER, THERE WAS NO EVIDENCE FOUND OF A STEERING DEFECT THAT CAUSED THE FAILURE, AND NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 22,000.",
        "vin": "5TDYK3DC3GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396132,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CURRENTLY OVERSEAS IN THE ARMY AND NO TOYOTA STORE WILL FIX IT AND THE ARMY WILL NOT LET ME SHIP MY VEHICLE BACK TO THE STATES.   [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "5TDDK3DC8GS"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351994,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SOMETHING MECHANICALLY WRONG WITH THE DESIGN OF THE SUSPENSION THAT IS CAUSING TIRES TO WEAR COMPLETELY IN 15K-20K MILES. THIS IS A KNOWN ISSUE, AND NOTHING IS BEING DONE ABOUT IT.     HTTPS://WWW.CARGURUS.COM/CARS/DISCUSSION-T34192_DS548164",
        "vin": "5TDDK3DCXGS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "08/08/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344026,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE TIRE WEAR ON THE OUTSIDE OF THE FRONT WHEELS AFTER 20,000 MILES. MINIVAN IS DRIVEN IN NORMAL CITY AND HIGHWAY DRIVING. TIRES ARE ROTATED EVERY 5,000 MILES. ALL 4 TIRES WILL NEED TO BE REPLACED AFTER 20,000 MILES.",
        "vin": "5TDXK3DC6GS"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339817,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT STATED THAT WHILE STOPPED WITH THE ENGINE STILL RUNNING, THE PASSENGER'S SIDE SLIDING DOOR SLID OPEN INDEPENDENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AUBURN TOYOTA (800 NEVADA ST, AUBURN, CA 95603) AND REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE). APPROXIMATELY TWO YEARS LATER, THE FAILURE HAD RECURRED WHILE THE ENGINE WAS TURNED OFF. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER ON TWO SEPARATE OCCASIONS WHERE THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS ALSO NOTIFIED OF THE FAILURE AND A CASE WAS FILED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 36,512.",
        "vin": "5TDDK3DC4GS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "12/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312097,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BUCKLING UP ON 6 DEC 2019, THE SEAT ATTACHMENT TO THE B-PILLAR COMPLETELY, WITHOUT RESISTANCE, DETACHED.  THE BOLT THAT SECURED THE BELT WAS ON THE FLOOR, COMPLETELY PRISTINE IN APPEARANCE, UNDAMAGED, WITHOUT ANY EVIDENCE OF THREAD-LOCKER APPLICATION AT THE FACTORY.  THE CAR HAD BEEN IN NO ACCIDENTS AND WAS IN EXCELLENT SHAPE, WITHOUT A TRACE OF BODY RUST OR DETERIORATION.  DEALER REPLACED THE BOLT AND CHECKED THE OTHER BELT ANCHORING BOLTS AND SAID THEY WERE OKL.  HAD TO RETURN TO THE DEALER IN TWO DAYS SINCE THEIR REPAIR HAD LEFT THE SEAT BELT TWISTED.  THEY UNBOLTED, THEN RE-BOLTED THE BELT ANCHOR IN THE UN-TWISTED, CORRECT POSITION.  NO HARM OCCURRED SINCE I PUT ON MY BELT BEFORE STARTING THE CAR;  REALIZING THE DEFECT IMMEDIATELY, I GOT TO WORK BY OTHER MEANS THAT DAY.  THE VEHICLE WAS STATIONARY, IN MY GARAGE AT THE TIME OF THE DEFECT DISCOVERY.",
        "vin": "5TDYK3DC5GS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "12/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291343,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING SEIZED UP ON MY 2016 TOYOTA VAN WHILE STOPPED AT A TRAFFIC LIGHT.  I HAD TO GET THE VEHICLE TOWED.   THERE ARE ONLY 20904 MILES ON THE ODOMETER. TOYOTA SAYS MY WARRANTY IS EXPIRED.  TOYOTA SAYS I WILL NEED A NEW STEERING ASSEMBLY, WHICH I WILL HAVE TO PAY IS FOR   $3200.",
        "vin": "5TDDK3DC7GS"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "12/10/2019",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288762,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 TOYOTA SIENNA SPONTANEOUSLY CAUGHT FIRE WHILE PARKED IN OUR DRIVEWAY AFTER RETURNING FROM A SHORT DRIVE. AFTER PULLING INTO OUR DRIVEWAY AND SHUTTING OFF THE IGNITION, MY WIFE SMELLED SMOKE AS SHE WAS EXITING THE PARKED VEHICLE. THIS SMOKE INTENSIFIED AND QUICKLY ACCELERATED BECOMING AN ENGINE COMPARTMENT FIRE. SHE CALLED FOR ME & THEN CALLED 911; BUT IN THE BRIEF MOMENTS IT TOOK ME TO GRAB A FIRE EXTINGUISHER, THE FIRE FURTHER INTENSIFIED WITH SIZABLE FLAMES ERUPTING OUT FROM AROUND THE HOOD, FRONT GRILL & UNDERNEATH THE VEHICLE.    I USED UP 2 FIRE EXTINGUISHERS WITHOUT ANY SIGNIFICANT EFFECT. I DID NOT HAVE ANY PROTECTIVE SAFETY GEAR SO AFTER HEARING SEVERAL SMALL EXPLOSIONS COMING FROM UNDER THE HOOD & FEARING MORE EXPOSURE TO NOXIOUS FUMES, I DECIDED TO ABANDON MY ATTEMPTS TO EXTINGUISH THE FIRE. THE FIRE DEPT. ARRIVED WITHIN A FEW MINUTES AND WERE ABLE TO PUT THE FIRE OUT; HOWEVER, THE FIRE PROGRESSED THROUGH THE INITIAL ATTACK AND ENTERED THE PASSENGER COMPARTMENT CAUSING SEVERE DAMAGE TO THE ENTIRE VEHICLE (SEE ATTACHED PHOTOS). THE SIENNA IS COMPLETELY DESTROYED. FORTUNATELY, THERE WERE NO INJURIES.    I HAVE BEEN MADE AWARE OF MULTIPLE INCIDENTS OF ENGINE FIRES IN TOYOTA SIENNAS IN THIS & OTHER CLOSELY RELATED MODEL YEARS (2014-2017). SEE: NHTSA ID NUMBER: 11010601. I CAN ALSO SUPPLY YOU WITH SOME ADDITIONAL MEDIA ACCOUNTS OF OTHER TOYOTA SIENNA ENGINE FIRE REPORTS.    OUR SIENNA WAS ROUTINELY MAINTAINED AS PER MANUFACTURER'S RECOMMENDATIONS & WAS LAST SERVICED ON 9/13/2019 (SEE ATTACHED SERVICE RECEIPT). THE VEHICLE HAD APPROX. 35K MILES ON IT & EXHIBITED NO PRIOR SIGNS OF TROUBLE, CHANGE IN PERFORMANCE OR WARNING INDICATOR LIGHTS. WE DID HAVE AN UNRESOLVED PROBLEM WITH AUTOMATIC SIDE DOORS NOT OPERATING PROPERLY AFTER A RECALL REPAIR; HOWEVER, THE LOCAL TOYOTA DEALER SERVICE DEPT. COULD NOT IDENTIFY A PROBLEM AFTER MULTIPLE SERVICE COMPLAINTS.",
        "vin": "5TDYK3DC4GS"
    },
    {
        "components": "SUSPENSION,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "06/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228525,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 6, 2019 AT APPROXIMATELY 6 PM MY VEHICLE EXPERIENCED UNINTENDED ACCELERATION. I WAS DRIVING AT 15 MPH AND IT ACCELERATED TO 40-50 MPH. BRAKING DID NOT SLOW DOWN THE VEHICLE. I JUMPED THE CURB AND HIT THREE SMALL TREES. IT CAME TO A HALT AFTER UNDERCARRIAGE DAMAGE HAD BEEN SUSTAINED. IT WAS TOWED TO CUMMINGS MOBILITY WHERE I PURCHASED THE VEHICLE. THEY COULD NOT DETERMINED WHAT CAUSED THE UNINTENDED ACCELERATION.",
        "vin": "STDXK3DC5GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT THE SLIDING DOOR THAT COULD OPEN WHILE DRIVING.  TOYOTA SENT A RECALL DOCUMENT BUT THEY CLAIM THAT SINCE IT WAS FIXED WITH A RAMP FOR HANDICAP ,THEY CLAIM THAT THE ONES RESPONSIBLE ARE THE  OTHER COMPANY AND NOT TOYOTA. THE COMPANY EXAMINED IT AND THEY CLAIM THAT IT IS TOYOTA.",
        "vin": "5TDKK3DC7BS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206621,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF GLASS EXPLODED ON ME AND MY KIDS ON MID MORNING OF 5/9/2019. NO OTHER DAMAGE TO VEHICLE. THE TEMPERATURE WAS AROUND 85 DEGREES. THE GLASS IS SHATTERED WITH NO WAY OF UTILIZING THE SUNROOF AT THIS TIME. THE VEHICLE WAS STATIONARY AT THE TIME OF THE INCIDENT.",
        "vin": "5TDYK3DC4GS"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173021,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEELS/ TIRES: NEEDED TO REPLACE TIRES AFTER 10,000 MILES ON NORMAL HIGHWAY DRIVING CONDITIONS    ELECTRICAL:  VEHICLE CONTINUES TO BLOW/POP FUSES WHEN AN ELECTRONIC DEVICE IS PLUGGED INTO THE 12V DC POWER SUPPLY PORT LOCATED UNDER THE RADIO",
        "vin": "5TDJK3DC9GS"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11156694,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD CAR ACCIDENT TODAY AND GOT HI MY LEFT FRONT WND REALLY GOOD AND THE POLICE SEEN MY CAR'S AIR BAG DID NOT GO OFF-IT DIDN'T SHOWS UP.MY FACE GOT HITTED BY STEERING WHEEL.I WAS DRIVING ON CITY OF PUYALLUP WASHINGTON RUNNING 25-35MILES AN HOUR WHEN THE VEHICLE BEHIND ME TOOK OVER IN FRONT OF ME TO CHANGE LANE TO THE LEFT.IT WAS A BIG IMPACT TO MAKE ME TURNED  AND BOUNCED AWAY TO RIGHT SIDE.",
        "vin": "5TDZK3DCXGS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145293,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SLIDING DOOR CABLE SNAPPED. IT HAPPENED TO BOTH DOOR (RIGHT AND LEFT) ABOUT 6 MONTHS APART. HAD THE CAR FOR ABOUT 2 YEARS NOT NOT EVEN EXCESSIVE USE. THE FIRST TIME WAS AT A DEALERSHIP FOR VEHICLE SERVICE AND THEY FIX IT FOR FREE SINCE IT HAPPENED THERE EVEN THOUGH THEY SAID WARRANTY DOES NOT COVER. THE SECOND TIME WAS OVER THIS WEEKEND AND WHEN I SEARCH ONLINE, MANY PEOPLE EXPERIENCE THE SAME PROBLEM. POOR QUALITY CABLE (LINKAGE) FOR THE POWERED SLIDING DOOR.",
        "vin": "5TDYK3DC0GS"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112775,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 TOYOTA SIENNA. WHILE DRIVING 65 MPH, THE STEERING WHEEL SEIZED AND THE VEHICLE CRASHED INTO A CEMENT BARRIER ON THE DRIVER SIDE WITHOUT WARNING. THE AIR BAGS DEPLOYED. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED.  THE VEHICLE WAS TOWED TO A TOW LOT WHERE IT WAS DEEMED A TOTAL LOSS. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 23,000.",
        "vin": "5TDYK3DC3GS"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "04/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090440,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 TOYOTA SIENNA THAT HAS 16,000 MILES WAS PARKED AT HOME AND I WENT TO GO START IT AND IT STALLED. THE CAR WAS TOWED TO HENDRICK TOYOTA OF APEX, NC AND THEY TOLD ME THAT RODENTS CHEWED THREW THE WIRING AND IT WAS NOT COVERED BY MY WARRANTY.  I HAVE COMPLAINED TO BOTH THE DEALERSHIP AND TO TOYOTA. I HAVE HAD ANOTHER TOYOTA PARKED IN WITHIN THE SAME PROXIMITY FOR OVER 15 YEARS. I HAVE NEVER HAD RODENT ISSUES WITH IT. I AM CONCERNED FOR THE SAFETY OF MY FAMILY. IIF THERE ARE MICE LIVING INSIDE THE CAR, THEY COULD BE LEAVING RAT DROPPINGS THAT COULD BE HARMFUL TO BOTH OF THEM. I AM ANGRY AND CONCERNED AND DON'T UNDERSTAND WHY, WHEN OTHER VEHICLES PARKED IN THE SAME LOCATION AREN'T EXPERIENCING THE SAME PROBLEM.     AFTER FURTHER RESEARCH I FOUND THAT AUTO MANUFACTURERS IN ORDER TO GO GREEN ARE USING SOY BASED PRODUCTS ON WIRES INSTEAD OF PETROLEUM. THEY ARE USING SUGAR IN THEIR PLASTICS. RICE HUSKS IN THEIR INTERIORS. ALL THIS STUFF ATTRACTS RODENTS. THIS IS UNACCEPTABLE! MY DEALERSHIP SAID THEY ARE SEEING AT LEAST 2 RODENT DAMAGED VEHICLES A WEEK. TOYOTA NEEDS TO FIX THIS PROBLEM, CHANGE THE MATERIALS THEY USE, AND COVER IT UNDER WARRANTY.     THERE HAVE BEEN SEVERAL CLASS ACTION LAWSUITS AGAINST TOYOTA FOR THIS ISSUE.      HERE ARE TWO ARTICLES THAT DETAIL THE PROBLEM MYSELF AND OTHER TOYOTA OWNERS HAVE HAD - HTTP://CTWATCHDOG.COM/FINANCE/RODENTS-DAMAGE-CARS-BYCHEWING-ELECTRICAL-CONNECTIONS-TIPS-ON-HOW-TO-AVOID-COSTLYREPAIRS, HTTP://WWW.SYNLUBE.COM/INCREDIBLEEDIBLECAR1.HTM",
        "vin": "5TDDK3DC9GS"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072419,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT RECEPTICAL IS TORN UP. SEAT BELT WILL NOT LATCH.",
        "vin": "5TDYK3DC3GS"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061607,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS 1.5 YEARS OLD, ABOUT 20K MILES, AND JUST RECEIVED WORD THAT WE'LL NEED 4 NEW TIRES @ $300/EA BECAUSE OUTSIDE WEARING IS OCCURRING.  DEALER NOR MICHELIN TAKING RESPONSIBILITY OR WARRANTY, BOTH POINTING AT EACH OTHER FOR THE ISSUE.  THIS APPEARS TO BE AN ONGOING ISSUE WITH THIS VEHICLE - WAS NOT DISCLOSED BEFORE PURCHASING THE SIENNA THAT TIRES WOULD ONLY LAST 20K MILES ON THIS VEHICLE.",
        "vin": "5TDYK3DC2GS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056428,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA SIENNA. CONSUMER WRITES IN REGARDS TO INCORRECT MILEAGE LISTED AT TIME OF PURCHASE. * LD *JS    THE CONSUMER REQUESTED TO BE REIMBURSED FOR THE PURCHASING THE VEHICLE IF THE INVESTIGATION RESULTS IN DISCOVERING THE ODOMETER WAS TAMPERED WITH. *JS",
        "vin": "5TDYK3DC0GS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "08/26/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051549,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE HEADLIGHTS ARE OFF, THE DASHBOARD INSTRUMENTS (SPEEDOMETER) ARE VERY DIFFICULT TO SEEN WHEN OVERCAST OUTSIDE (NO BACK-LIGHTING).  THIS IS OUR 3RD SIENNA AND WAS NOT AN ISSUE WITH PAST MODELS (2011 & 2013).  THIS IS A SAFETY ISSUE IN THE IT REQUIRE EYES OFF THE ROAD LONGER THAN NECESSARY IN ORDER TO READY THE INSTRUMENTS.",
        "vin": "5TDJK3DC2GS"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046959,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V585000 (POWER TRAIN); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUTONATION TOYOTA ARAPAHOE AT 303-578-6111 AND WAS INFORMED THAT SHE WOULD RECEIVE A CALL BACK WHEN THE PARTS ARRIVE. THE MANUFACTURER WAS NOTIFIED AND INFORMED THE CONTACT TO CALL THE DEALER. THE CONTACT MENTIONED THAT THE DRIVER'S DOOR FAILED TO OPEN COMPLETELY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS DISTRIBUTION. *TT  CONSUMER STATED DRIVER'S SIDE SLIDING. POWER DOORS HAD BEEN TURNED OFF WHEN RECALL RECEIVED IN OCT OR NOV 2016.   UPDATED 8/13/18*JB",
        "vin": "5TDDK3DCXGS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041862,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIENNA EMISSIONS CONTROL DESIGN HAS AN INHERENT PROBLEM WITH ITS MECHANISM WHICH CANNOT BE DIAGNOSED PROPERLY AT THE SERVICE SHOP. MY 2008 WAS SERVICED ABOUT FIVE TIMES FOR THE SAME PROBLEM, DURING WHICH THE CARBON CANISTER WAS REPLACED AT ALL OCCASIONS TO FIX THE PROBLEM. ON THE DASHBOARD THE CHECK ENGINE LIGHT + TRAC OFF + VSC LIGHTS COME ON. IT INDICATES SOMETHING SERIOUS IS WRONG WITH THE VEHICLE.    PLEASE READ THIS WEB LINK FOR COMPLETE DETAILS. WHY IS THIS PROBLEM NOT A RECALL AS TOYOTA HAS NO INTENTION TO FIX IT ??? :(    HTTP://TOYOTA-SIENNA-CANISTER-DEFECT.BLOGSPOT.COM/2017/10/THE-TOYOTA-SIENNA-2008-2016-CARBON.HTML    TRULY,  [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "GENERAL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040038,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE WINDOW SEAL COMES OUT WHEN YOU ROLL THE WINDOW DOWN.  THE WINDOW THEN WILL AUTO GO BACK DOWN BECAUSE IT SENSES SOMETHING IN IT'S PATH (WHICH IS THE ACTUAL SEAL).  I HAVE TO SLOWLY WORK THE SEAL BACK IN THE FRAME.  THE DEALERSHIP MILTON MARTIN TOYOTA IMPLIED IT WAS BECAUSE I DID NOT KEEP MY WINDOW CLEAN ENOUGH.  THEY HAVE GREASED IT,DIDN'T WORK.  THEN THEY PUT A NEW SEAL IN, THAT IS COMING OUT NOW.  AND NOW THEY ARE PUTTING ANOTHER NEW SEAL IN.  THIS HAPPENED AT ABOUT 34K MILES.",
        "vin": "5TDZK3DC1GS"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "03/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034418,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT STATED THAT THE DOOR SPONTANEOUSLY OPENED WHILE THE VEHICLE WAS IN MOTION. THE CONTACT CALLED ANTIAC TOYOTA (1817 AUTO CENTER DR, ANTIOCH, CA 94509) AND WAS INFORMED THAT THERE WAS NO OPEN RECALL OR REMEDY FOR THE FAILURE. IN ADDITION, WHILE DRIVING APPROXIMATELY 75 MPH, THE SEAT BELT SPONTANEOUSLY BECAME UNLOCKED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE SEAT BELT BUCKLE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE VIN WAS INCLUDED IN AN UNKNOWN RECALL FOR THE STRUCTURE. THE MANUFACTURER INFORMED THE CONTACT THAT NOTHING COULD BE DONE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "5TDDK3DC5GS"
    },
    {
        "components": "SEAT BELTS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/17/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034095,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. WHILE DRIVING 70 MPH, THE DRIVER'S SEAT BELT FRACTURED WITHOUT WARNING. IN ADDITION, WHILE DRIVING VARIOUS LOW SPEEDS, BOTH SLIDING DOORS OPENED ON MORE THAN ONE OCCASION. THE CONTACT STATED THAT THE REAR PASSENGER SLIDING DOOR OPENED MOSTLY WHILE DRIVING. THE VEHICLE WAS TAKEN TO AN UNKNOWN TOYOTA DEALER IN WALNUT CREEK, CALIFORNIA TO BE REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 100.",
        "vin": "5TDDK3DC5GS"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/16/2017",
        "dateOfIncident": "10/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CAME ON. TOYOTA SAYS A RECALL HAS NOT BEEN ISSUED AND NEEDS A DIAGNOSTIC THAT THEY WILL CHARGE FOR. I AM SEEING MANY COMPLAINTS ON LINE FOR EXACT ISSUE AND COSTS OF FIXING ISSUE COSTING 1500-3000 AND MORE!",
        "vin": "5TDZA23C76S"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030461,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (LIA TOYOTA OF COLONIE, 2116 CENTRAL AVE, SCHENECTADY, NY 12304) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS CONTACTED AT 888-270-9371 AND STATED THAT THE PARTS WERE AVAILABLE AND TO CONTACT THE DEALER. A CASE NUMBER WAS NOT PROVIDED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDKK3DC3GS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029890,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDOWS ON ALL 4 DOORS OF THIS VEHICLES ARE CONSTANTLY HAVING DIRT/DEBRIS GETTING INSIDE THE DOOR.  YOU CAN SEE THIS ON THE WINDOWS, AND THE FRONT ONES ARE THE WORST.  IT'S A CONSTANT SOURCE OF ISSUE WITH SCRATCHING SOUNDS FROM THE WINDOWS GOING UP AND DOWN.  THE OTHER ISSUE THAT HAS BEEN ONGOING FOR 4-5 MONTHS IS THE DRIVER'S SIDE WINDOW SEAL - IT BECOMES DETACHED FROM WINDOW FRAME AND EVENTUALLY GOES BACK INTO PLACE ONCE WINDOW PRESSES INTO THE DOOR.  I HAVE HAD THE SEAL PUT BACK IN BY DEALER, HOWEVER, THE FIX DIDN'T LAST 2 MONTHS.  PLEASE ADVISE.",
        "vin": "5TDDK3DC9GS"
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011559,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "3 RUN FLAT BRIDGESTONE TIRES BLOWN UP WHILE DRIVING FOR NO REASON OR ROAD HAZARDS IN LESS THAN 21,000 MILES AND WITHIN 4 WEEKS. FIRST TIRE IN CHICAGO HIGHWAY, TRAVELING ABOUT 40 TO 50 MPH, SECOND IN ARKANSAS/OKLAHOMA HIGHWAY ABOUT 60 TO 70 MPH AND 3RD IN BOSTON/REVERE AREA TRAVELING 3 TO 7 MPH WHILE PARKING. NO OTHER DAMAGE TO TIRES. 2 SIDEWALLS BLOWN AND ONE CRACKED IN THE MIDDLE. SAME BRAND TIRES, TWO DIFFERENT MODELS. BRIDGESTONE DUELER AND BRIDGESTONE TURANZA.",
        "vin": "5TDDK3DC6GS"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005304,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA SIENNA DASH HEAD DISPLAY, RADIO GO OUT. WHEN THIS HAPPENS HEADLAMPS GO DIM TO POINT WHERE YOU CAN BARLEY SEE AND HAVE TO STOP THE VEHICLE. TOOK THIS IN TO LOCAL DEALERSHIP SEVERAL TIMES THEY STATED THAT UNTIL IT WAS HAPPENING IN THEIR PRESENCE THERE WAS NOTHING THEY COULD DO. WE WERE ABLE TO VIDEO RECORD THE ISSUE AND SHOWED DEALERSHIP. THEY REPLACED THE RADIO HEAD BUT ISSUE STILL OCCURS. ALSO HAVE PROBLEM WITH RECALL ON SLIDING DOOR. DEALER STATED THAT TOYOTA WAS STILL LOOKING FOR A FIX. I HAVE HAD DOOR OPEN AND CLOSE ON MY YOUNG CHILDREN WITHOUT NOTICE. HAVE THE POWER TURNED OFF TO DOORS NOW BUT BOUGHT THIS MODEL FOR THE POWER DOORS DUE TO BEING A DISABLE VET THIS FEATURE HELPS ME OUT A LOT.",
        "vin": "5TDXK3DC2GS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001273,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSING A CONSTRUCTION ZONE ON HIGHWAY (AT SPEED ABOUT 40MPH) , SEVERAL SMALL GRAVELS HIT THE WINDSHIELD AND MADE A FEW CHIPS. SOMETHING LIKE THIS HAPPEND TO MY PREVIOUS CAR TOO, BUT NEVER MADE ANY DAMAGE AT ALL. SO I SUSPECT THE WINDSHIELD ON 2016 SIENNA IS NOT STRONG ENOUGH AND WORRY ABOUT ITS SAFETY.",
        "vin": "5TDYK3DC8GS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/25/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001276,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH SECOND CENTER SEAT INSTALLED (8-PASSENGER VAN), THE RECLINER COULD NEVER AUTOMATICALLY COME BACK UP WHEN PULL THE LEVER. DEALER INSPECTED IT AND DIDN'T FIND ANY ISSUE. HOWEVER, IT IS NOT NORMAL TO PULL THE LEVER AND SEAT BACK UP AT THE SAME TIME, ESPECIALLY WHEN SITTING ON THE CHAIR.",
        "vin": "5TDYK3DC8GS"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "06/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11000200,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT SIDE PASSENGER DOOR, OPENED BY ITSELF WHILE DRIVING. MY JIDS WERE SEATED ON THE BACK WITH GRANDMA. DOOR ALSO, CLOSES BY ITSELF HURTING THE PASSENGER WHO IS TRYING   TO GET INTO. IT HURT SEVERAL TIMES MY 8YR OLD DAUGHTER, MY 11 YR OLD BOY AND GRANDMA. EVEN CLOSES WHEN YOU ARE PUTTING STUFF IN THE PASSENGER SIDE.",
        "vin": "5TDYK3DC8GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993732,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LOCAL DEALER (CAVENDER TOYOTA 5730 NW LOOP 410 SAN ANTONIO, TX, 78238) CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC6GS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/03/2017",
        "dateOfIncident": "05/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992966,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA SIENNA FAULTY POWER SLIDING DOORS. THE VEHICLE WAS PARKED. WHEN WE TRIED TO OPEN THE DOOR, THE CABLE SNAPPED. THEN WE WON'T BE ABLE TO CLOSE IT. WE HAD TO CUT THE REMAINING CABLE BEHIND THE SLIDING WHEEL TO MANUALLY CLOSE THE DOOR.",
        "vin": "5TDZA22C66S"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/01/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992737,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PART NOT AVAILABLE.",
        "vin": "5TDXK3DC7GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "03/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991019,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE REMEDY WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986022,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "FR710",
                "productYear": "9999",
                "size": "205/65R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA EQUIPPED WITH FIRESTONE FR710 TIRES, SIZE 205/65R16. WHILE THE VEHICLE WAS PARKED, THE CONTACT HEARD AN EXPLOSION. UPON INSPECTION, THE CONTACT DISCOVERED THAT THE FRONT DRIVER SIDE TIRE EXPLODED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 3,750.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/02/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983060,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS CONTACT AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC6GS"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980066,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. WHILE OPERATING THE VEHICLE, THE REARVIEW CAMERA, WHICH WAS INTEGRATED INTO THE RADIO SYSTEM, MALFUNCTIONED AND STOPPED OPERATING. THE DEALER WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE CAMERA/RADIO UNIT WAS REPLACED, BUT THE FAILURE CONTINUED. THE CONTACT INDICATED THAT THE CAMERA/RADIO WAS REPLACED ON FOUR SEPARATE OCCASIONS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100.",
        "vin": "1GTR1LEH2GZ"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "11/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980270,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (LATCHES/LOCKS/LINKAGES). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND INFORMED THE CONTACT NOT TO USE THE FEATURE FOR THE POWER DOORS. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYK3DC8GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "11/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971615,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYK3DC0GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "01/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967776,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC1GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/17/2017",
        "dateOfIncident": "03/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966565,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5TDYK3DCXFS"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/19/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955462,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH BOARD LIGHTS AND ALL INTERIOR LIGHTS CONTINUE TO GO OUT WITH OUT WARNING. IT REQUIRES STOPPING THE VAN SHUTTING IT OFF AND RESTARTING IT. THE HEADLAMP DIM THEMSELVES AND THEN BRIGHTEN WHILE DRIVING. TOOK IT TO DEALERSHIP TWICE NOW FOR ISSUE. DEALER STATED SINCE PROBLEM WAS NOT OCCURRING AT THAT MOMENT THERE IS NO TEST THEY COULD DO. SERVICE MANAGER ALSO STATED THAT TOYOTA DOESN'T LIKE THE DEALERSHIPS TRYING TO GUESS AT WHAT MAYBE WRONG. THIS IS A MAJOR SAFETY ISSUE WHEN DRIVING AT NIGHT.",
        "vin": "5TDXK3DC2GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "12/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955237,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT  RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE: BODY) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5TDYK3DC7GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950460,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V858000 (STRUCTURE) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDKK3DC8FS"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "02/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950364,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE IN THE POWER SLIDING DOOR MALFUNCTIONING. TOYOTA HAS FAILED TO PROVIDE A SOLUTION AND REFUSES TO PROVIDE A LOANER CAR. TOYOTA INDICATED THAT ONE SHOULD NOT DRIVE IN THE BACK SEAT BECAUSE THE DOOR COULD POTENTIALLY OPEN. WITH SOMETHING THIS SERIOUS, HOW CAN THEY NOT PROVIDE A LOANER CAR TO THEIR CUSTOMERS UNTIL A RESOLUTION IS FOUND?! THIS IS HIGHLY UNACCEPTABLE AND HORRIBLE CUSTOMER SERVICE FROM TOYOTA.",
        "vin": "5TDKK3DC1GS"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2017",
        "dateOfIncident": "01/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 15 MPH, THE BRAKE PEDAL WAS DEPRESSED, BUT IT WAS DIFFICULT TO STOP THE VEHICLE. THE CONTACT HEARD A CLICKING NOISE AT THE TIME OF THE FAILURE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 14,300.",
        "vin": "5TDXK3DC0GS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2017",
        "dateOfIncident": "01/24/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED A RECALL FOR THE ELECTRICAL SYSTEM. THE PARTS FOR THE RECALL REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 05/10/17*LJ UPDATED 08/29/2017*JS",
        "vin": "5TDJK3DC7GS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2017",
        "dateOfIncident": "01/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946891,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING HAS HAPPENED YET WITH MY VEHICLE BUT TOYOTA JUST SENT A LETTER WITH A RECALL ON THE AUTOMATIC DOORS ON THEIR VANS FROM 2011-2016.  CHILDREN RIDE IN THE BACK SEAT OF VANS AND THEY ARE PUTTING THEM IN DANGER. THEY DON'T HAVE A FIX FOR THIS BESIDES TO TURN OFF AUTOMATIC DOORS WHICH IS A MAIN FEATURE OF THE VAN INCLUDED IN THE COST OF THE VEHICLE. IT IS UNACCEPTABLE THAT THEY HAVE NO FIX FOR THESE AND AREN'T OFFERING PARTIAL REFUNDS TO OWNERS THAT HAVE PAID FOR THOSE FEATURES. TOYOTA NEEDS CLOSER REGULATIONS ON THEIR VEHICLES BECAUSE THEY HAVE HAD SO MANY RECALL ISSUES IT IS RIDICULOUS.  NOT TO MENTION PUTTING CHILDREN IN DANGER WITH THIS NEW DOOR ISSUE.  I HOPE THAT THEY ARE FINED AND REGULATED MORE IN THE FUTURE SO THAT THEY DON'T CONTINUE TO PUT OUR CHILDREN AND FAMILIES IN DANGER.",
        "vin": "5TDDK3DC1GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT STATED THAT THE HATCH ON THE REAR OF THE VEHICLE CLOSED INDEPENDENTLY WITHOUT WARNING. THE FAILURE OCCURRED TWICE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "5TDYK3DC3GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA NOTIFIED ME TODAY 1/17/17 OF A RECALL DATING BACK TO NOVEMBER 22, 2016. THERE IS STILL NO REMEDY FOR THE RECALL, WHICH POSES A SERIOUS SAFETY ISSUE.     MY CONCERN IS DRIVING THIS VEHICLE UNDER UNSAFE CONDITIONS, WITH THE POSSIBILITY OF SOMETHING DIRE OCCURRING.  *TR",
        "vin": "5TDXK3DC7GS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2017",
        "dateOfIncident": "12/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944480,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH LIGHTS AND GAUGES ALL GO OUT AND HEAD LAMPS GO DIM. TOOK IT TO DEALER WHO COULD NOT DO ANYTHING AS THE PROBLEM WAS NOT HAPPENING AT THAT TIME. STARTED WITH ABOUT 8500 MILES ON CAR AND I WOULD SAY IT HAPPENS ABOUT TWICE A WEEK OR MORE.",
        "vin": "5TDXK3DC2GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "12/09/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944134,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE). THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  ..UPDATED 02/09/17 *BF  THE CONSUMER STATED HE/SHE EXPERIENCED AN ISSUE WITH THE DOOR OPENING/CLOSING. UPDATED 03/01/17.*JB",
        "vin": "5TDDK3DC7GS"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "05/26/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V858000 (STRUCTURE). THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS A MODIFIED HANDICAPPED VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5TDYK3DC5GS"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939478,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD TEMPERATURES, THIS VEHICLE MODEL (ACCORDING TO THE DEALER) DOES NOT SHIFT INTO OVERDRIVE RIGHT AWAY WHEN DRIVING FROM A COLD-START. THIS CAUSING A MOMENTARY ACCELERATION WHEN BRAKING AND PRESENTS AN UNEXPECTED SAFETY ISSUE. I HAVE FOUND THIS ISSUE POSTED ON SEVERAL CAR FORUMS AND IT APPEARS TO AFFECT MORE THAN JUST THE 2016 MODEL SIENNA, BUT DOES NOT TRIGGER A FAULT OF ANY KIND.  *TR",
        "vin": "5TDYK3DC1GS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/16/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935875,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS NEW TOYOTA SIENNA 2016 WAS DELIVERED WITH A DEFECTIVE FRONT WINDSHIELD WITH DISTORTION AT THE CENTER BOTTOM. IT CAUSES THE ROAD MARKINGS TO BECOME WAVY AND DISTORTED, AND IS DANGEROUSLY DISTRACTING ESPECIALLY AT NIGHT OR IN LOW LIGHT SITUATIONS. THE DEALER WAS IMMEDIATELY NOTIFIED, AND CHECKED OTHER SIENNAS ON THE LOT, ALL OF WHICH HAVE THE SAME DEFECT. THE DEALER DIRECTED US TO TOYOTA, AND TOYOTA FAILED TO RESPOND AND DID NOT CORRECT THE ISSUE.SINCE IT IS APPARENTLY A VEHICLE WIDE DEFECT, IT SEEMS A RECALL WOULD BE REQUIRED TO ADDRESS THE ISSUE.",
        "vin": "5TDYK3DC0GS"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10910205,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA SIENNA. WHILE DRIVING APPROXIMATELY 65 MPH, THE CONTACT LOST CONTROL OF THE STEERING WHEEL. THE CONTACT WAS NOT ABLE TO STOP THE VEHICLE AND THE ELECTRONIC BRAKE WARNING INDICATOR ILLUMINATED. THE CONTACT CRASHED INTO A ROAD SIGN. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THERE WERE MINOR INJURIES THAT DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 9,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/18/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907429,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOT MONITOR ONLY ACTIVATES WHEN PASSING CAR REACHES REAR FENDER WHICH IS INSUFFICIENT WARNING -- UNSAFE AT ALL SPEEDS.  IF YOU WERE TO DEPEND ON IT WHEN CHANGING LANES IT COULD CAUSE A SERIOUS ACCIDENT. MY 2013 LEXUS ALSO HAS BSM WHICH OPERATES PERFECTLY WITH GOOD AND SUFFICIENT WARNING FOR LANE CHANGE.",
        "vin": "STDYK3DC1GS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/25/2016",
        "dateOfIncident": "06/04/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888079,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADRESTS TILT SO FAR FORWARD THAT THEY CAUSE NECK PAIN, PARTICULARLY ON TRIPS OF LONGER THAN 15 MINUTES.  THEY SHOULD NOT BE SO FAR FORWARD THAT ONE'S HEAD IS IN CONTACT WITH THE HEADREST AT ALL TIMES, OR IF THEY DO NEED TO BE THAT FAR FORWARD, THEY SHOULD NOT BE AT SUCH AN ANGLE AS TO PRESS THE HEAD FORWARD AND DOWN.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872360,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A BRAND NEW CAR WE PURCHASED FROM THE DEALER.  WE WANTED TO FIND OUT   WHAT TYPE (THE MANUFACTURER)  OF AIRBAG WAS INSTALLED IN THE CAR.  THE DEALER DOES NOT KNOW.  TOYOTA HEADQUARTER REFUSED TO GIVE OUT.",
        "vin": "5TDYK3DC3GS"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/31/2016",
        "dateOfIncident": "05/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871565,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE CAR, NEW, A LITTLE OVER A MONTH AGO.  3 MILES ON THE ODOMETER AT THE TIME OF PURCHASE.  HAVE DRIVEN THE CAR UNDER 800 MILES.  CAR HAS BEEN COVERED, IN OUR DRIVEWAY, SINCE MAY 20TH.  CAME OUT YESTERDAY (MAY 30TH) TO MOVE IT.  UNCOVERED IT AND FOUND THE CRACK ALONG THE LOWER SECTION OF THE WINDSHIELD.  IT WAS NOT THERE WHEN I COVERED IT ON THE 20TH. THERE IS NO EVIDENCE OF \"CHIP OR DAMAGE\" JUST THE CRACK  (WHICH WAS NOT THERE WHEN THE CAR WAS COVERED).  CAR WAS STATIONARY, IN OUR DRIVEWAY ON A PRIVATE, GATED STREET, COVERED.  CONCERNED THAT THERE IS A FAULTY DESIGN ISSUE AND THAT WILL HAPPEN AGAIN.  SCARES ME TO THINK IT COULD HAPPEN WHEN I'M DRIVING WITH OTHERS IN THE CAR. TOYOTA IS NOT TAKING RESPONSIBILITY.  THEY HAVE TOLD ME TO BRING IT IN FOR \"EVALUATION\". THE DEALERSHIP IS 45 MINUTES AWAY, AND I DO NOT THINK IT IS SAFE TO DRIVE.",
        "vin": "5TDKK3DC5GS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/16/2016",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865182,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VANS THAT HAVE BEEN CONVERTED TO A HANDICAP/MOBILITY VAN ARE UNSAFE FOR OTHERS TO DRIVE ONCE THE DRIVER SEAT HAS BEEN REMOVED. I HAVE CONTACTED THE LOCAL COMPANY RESPONSIBLE FOR THE CONVERSION, AND THEY TOLD ME TO SIT ON A DINNING ROOM CHAIR OR A BUCKET.  THAT IS DEFINITELY NOT A SAFE OPTION WHEN A NON HANDICAP PERSON NEEDS TO MOVE OR DRIVE THE VAN. I BELIEVE THERE NEEDS TO BE A SEAT MADE THAT CAN CLIP INTO THE WHEEL CHAIR CLAMPS THAT THE HANDICAP DRIVER USES.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2016",
        "dateOfIncident": "05/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862854,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SLIDING PASSENGER DOORS STOPPED WORKING AND YOU COULD NOT OPEN THEM MANUALLY. PASSENGERS SIDE DOOR STOPPED WORKING 8/3/15 AND THE DRIVERS SIDE DOOR  STOPPED  WORKING  5/3/16.",
        "vin": "5TDZA22C96S"
    }
]