[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457984,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Our car has approximately 65K miles on it. THREE of the door lock actuators have failed already. This is terrifying that we might not be able to lock or unlock doors in an emergency particularly with our kids in the back seat.  We have had our Prius serviced regularly by an independent well regarded local hybrid car mechanic and they think it is very odd that these have all failed so quickly.",
        "vin": "JTDKBRFU1G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/21/2022",
        "dateOfIncident": "02/13/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453306,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The active grille shutter system failed due to debris. There is a bulletin already that references error code P05A072 - active grille shutter stuck open. The code I got was P059F73 - active shutter grille stuck closed. Not sure why it wasn’t included in the original bulletin when the cause and part are the same. This seems to be a known problem with this vehicle that can lead to engine overheating.  Bulletin referenced was T-SB-0319-17.",
        "vin": "JTDKARFU2G3"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "12/06/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11442846,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2016 Toyota Prius. The contact stated that while switching lanes, the vehicle was rear-ended by another vehicle driving at 30 MPH. The contact's front driver's side seat backrest inadvertently moved backward, which caused her shins to hit the dashboard under the steering wheel during impact. None of the air bags deploy upon impact. The contact later received medical attention at the hospital for injuries to her shins. A police report was filed. The vehicle was towed to a tow yard and deemed totaled by the insurance company. The manufacturer was not made aware of the failure. The failure mileage was approximately 88,000.",
        "vin": "jtdkbrfu5g3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438516,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Over the course of the last year, I have noticed an increasingly louder clicking noise coming from the front left (driver side) wheel area upon breaking. The noise goes away if I shift into neutral, so I'm nearly positive that this is related to the axle/CV joint. I've also conducted extensive research on this issue and it is a common problem encountered by other Gen4 Prius owners. Toyota even issued a TSB for this issue in December of 2018 (T-SB-0157-18), NHTSA No. 10153229. My car had its powertrain warranty lapse earlier this year, but I know for a fact that this has been covered out of warranty because I've corresponded with other Prius owners who had Toyota cover the repair of this defect/glitch.   I am trying to avoid a catastrophic breakdown of my CV joint if I'm driving on the highway and I'd appreciate it if NHTSA would be able to compel Toyota to help with the repair of this issue. I've had no luck dealing with either the dealership, or the corporate office at Toyota. They do not seem to be taking any ownership of this issue nor taking demonstrating any accountability.",
        "vin": "JTDKARFU9G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "10/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Moments ago, I entered my 2016 Toyota Prius to find that my windshield had mysteriously cracked while parked over night. The crack was not present when I last drove the car last night. Based on some online research for windshield replacement cost, I've learned that Toyota was faced with a class action lawsuit regarding 2016-17 Toyota Prius containing defective windshields; in which these windshields are known to unexpectedly crack while parked or under ordinary driving conditions. Furthermore, my Toyota Prius is equipped with safety features (such as pre-collision system, lane departure alert with steering assist, automatic high beams and full-speed dynamic radar cruise control) that require a front camera to function properly. The cracked windshield now interferes with the camera's visibility, line of sight and perceived orientation, thus causing me to feel unsafe while driving the vehicle.   I am filing this compliant because I am now faced with not only an unsafe vehicle to operate, but also the cost to fix a windshield that is known to be defective from Toyota.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435515,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought my 2016 Prius brand new in November of 2016. Over the past 2 years or so my OEM leather like steering wheel wrap started to wrinkle. it is now cracking and starting to peel.  it hasn't caused any stealing control issues, it is just ugly an slight distracting on the palm of the hand.  I do worry that if might start causing gripping issues on that side of the steering wheel if the wrap becomes loose.",
        "vin": "JTDKARFU9G3"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425866,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was hit when someone ran a stop sign. Pushed into oncoming traffic and hit a truck.  My Toyota Prius was totaled. No air bags deployed. Seatbelt did not tighten either. I have contacted Toyota. Someone retrieved the data from recorder. I have a copy but it was to long to send with pics.  Toyota claim # [XXX]  (sorry for one pic I couldn’t delete)  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).”",
        "vin": "JTDKBRFU8G3"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2021",
        "dateOfIncident": "06/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420359,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle stalls for 5-10 seconds when stopped at a red light. Seems to happen sporadically and is difficult to reproduce. There have been other reports of it online here: https://priuschat.com/threads/tsb-nimh-only-reduced-power-when-accelerating-from-a-stop.187455/  https://priuschat.com/threads/2017-prius-2-no-acceleration-movement-from-full-stop.209317/  https://priuschat.com/threads/2016-prius-2-stalling.200606/",
        "vin": "JTDKBRFU9G3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "04/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418913,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Airbags failed to deploy upon impact with guardrail. Drivers side front corner hit the guardrail at approx. 45% angle at 50-60mph. The vehicle was inspected by an insurance rep. and was deemed a total loss. The car is available for inspection.",
        "vin": "JTDZN3EU4GJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413148,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CONDENSATION BUILDING UP IN PASSENGER SIDE HEADLIGHT. THE CAR HAS ONLY 31,200 MILES. NOT CRACKS VISIBLE FROM OUTSIDE ON HEADLIGHT ASSEMBLY. CONDENSATION DISTORTS THE LIGHT BEAM AND DIMMING THE LIGHT INTENSITY.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413149,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUTTING THE CAR IN PARK AND THEN ENGAGING THE FOOT PARKING BRAKE ON A SLOPE, SUCH AS MY DRIVEWAY, AND THEN TURNING OFF THE CAR, THE CAR ROLLS BACK SIGNIFICANTLY. THEN, WHILE EXITING THE CAR, THE REAR BRAKES MAKE LOUD GRINDING AND CREAKY NOISES AS THE CAR SETTLES DOWNWARDS SLIGHTLY.     THEN, WHEN ENTERING THE CAR, THE BRAKES MAKE THE SAME CREAKY AND GRINDING SOUNDS. WHEN HOLDING THE BRAKE PEDAL TO POWER ON THE CAR, THEN DISENGAGING THE FOOT PARKING BRAKE, THEN SHIFTING THE CAR FROM PARK TO REVERSE OR DRIVE, THE CAR JERKS ABRUPTLY AND AT THE SAME TIME MAKES A LOUD AND STUCK DISENGAGEMENT SOUND, AS IF THE CAR WAS BEING HELD ON THE HILL/DRIVEWAY SOLELY BY THE PARKING PAWL. IT SEEMS LIKE THE PARKING BRAKE IS NOT HOLDING THE CAR, AND INSTEAD, THE PARKING PAWL IS.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "BACK OVER PREVENTION,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "03/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413150,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE HAPPENS RANDOMLY. WHEN POWERING THE CAR ON, AND WHILE THE CAR IS DOING ITS ROUTINE DASHBOARD LIGHT-UPS AND THE DINGING SOUNDS, SOMETIMES THE FORWARD SONARS WOULD BEEP AND DETECT THE OBJECT IN FRONT OF THE CAR. THE FORWARD WARNING INDICATOR SHOWS UP ON THE MULTI-INFORMATION SCREEN EVEN WHEN THE CAR IS STILL IN PARK AND WHILE THE NORMAL SYSTEM STARTUP IS TAKING PLACE. IT IS NOT SUPPOSE TO DO THAT, AS THE TRANSMISSION IS STILL IN PARK AND RUNNING THE SYSTEM STARTUP TESTS.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413018,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SLOWING AND PULLING INTO A PARKING SPACE, IN FRONT OF THE DENTIST OFFICE WHERE MY WIFE HAD AN APPOINTMENT, THE VEHICLE SUDDENLY ACCELERATED. IT JUMPED THE CURB, AND SHE STEERED HARD RIGHT TO AVOID THE BUILDING DIRECTLY IN FRONT OH THE PARKING SPACE. SHE SIDESWIPED THE FRONT OF 2 VEHICLES PARKED NEXT TO THE SPACE SHE WAS MOVING INTO, AND THE CAR CONTINUED TOWARD THE STREET. IT HIT THE CURB GOING OUT OF THE PARKING LOT AND THE CAR FINALLY STOPPED. A PERSON CAME TO THE DRIVERS SIDE OF THE CAR AND ASKED MY WIFE IF SHE WAS OK, AND SAID SHE SHOULD TURN THE CAR OFF - WHICH SHE DID.",
        "vin": "JTDZN3EU0GJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "12/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11385206,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. THE CONTACT STATED THAT WHILE DRIVING AT A VERY LOW SPEED A SECOND VEHICLE SUDDENLY CRASHED INTO THE REAR OF THE VEHICLE PUSHING IT INTO THE REAR END OF A THIRD VEHICLE POSITIONED AHEAD. DURING THE INCIDENT THE VEHICLE SUSTAINED SIGNIFICANT DAMAGE TO THE FRONT END AND WAS DESTROYED BUT THE AIR BAGS DID NOT DEPLOY. THE FRONT PASSENGER SUSTAINED NECK AND BACK INJURIES WHICH REQUIRED MEDICAL TREATMENT. A POLICE REPORT WAS TAKEN AT THE SCENE AND THE VEHICLE WAS TOWED AWAY. THE LOCAL DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "JTDKARFU0G3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385149,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BLUE TOOTH CONNECTION VIA PHONE WILL BE DROPPED AFTER 7-10 SECONDS POST CONNECTION TO THE VEHICLE. AUDIO PLAYER CAN BE CONNECTED SEPARATELY BUT ONCE THE PHONE CONNECTS THE DISPLAY CONSOLE RESETS AS IF THE CAR WAS JUST BEING STARTED. CAR CAN BE STATIONARY NOT MOVING. NO DIFFERENCE",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "11/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377389,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PREVIOUSLY SENT IN A COMPLAINT BUT THERE HAVE BEEN DEVELOPMENTS AND I NEEDED TO EXPLAIN MORE CLEARLY.  OUR TOYOTA HAS LESS THAN 18,000 MILES AND HAS BEEN VERY WELL TAKEN CARE OF.  DESPITE THIS, OUR VEHICLE HAS NOT BEEN IN OPERATION SINCE EARLIER THIS MONTH.  IT STARTED BY FLASHING WARNING LIGHTS 2 WEEKS AGO AND THEN WOULDN'T START UP.   SATURDAY WHEN I OPENED THE DRIVER DOOR TO GET SOMETHING OUT OF THE INOPERABLE VEHICLE, THIS INITIATED A VERY LENGTHY TERRIBLE SOUND COMING FROM UNDER HOOD ON DRIVER'S SIDE.  IT SOUNDED LIKE SOMETHING WOULD EXPLODE UNDER THE HOOD.  THIS HORRIBLE PROCESS APPEARANTLY  DRAINED THE WHOLE BATTERY.  IT HAS ABSOLUTELY NO SIGNS OF LIFE NOW.  ALL OF THIS HAPPENED WHILE THE VEHICLE WAS STATIONARY.",
        "vin": "JTDZN3EU0GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2020",
        "dateOfIncident": "11/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376721,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR VEHICLE IS COMPLETELY INOPERABLE.  THE BATTERY WORKS BUT THE VEHICLE FLASHES ALL KINDS OF WARNING LIGHTS AND WILL NOT START UP.  WE BELIEVE THAT IT MAY BE DUE TO RODENTS AS TOYOTA DEALERSHIP POINTED OUT RODENT ISSUE IN CABIN AIR FILTER LAST TIME WE WENT THERE FOR SOME SAFETY RECALL.  IT SEEMS TO BE A HUGE ISSUE WITH PRIUS AND WE WOULD HAVE NEVER BOUGHT ONE HAD TOYOTA BEEN UPFRONT WITH THE RODENT ISSUES THAT THEY HAVE WITH THEIR VEHICLES.  ARE THERE ANY RECALLS OR CLASS ACTION SUIT RELATED TO THIS RODENT ISSUE AND THEIR USING SOY BASED WIRING AND FAILING TO CLOSE UP RODENT ACCESS TO CABIN AIR FILTER ETC.?  THANK YOU FOR YOUR TIME!",
        "vin": "JTDZN3EU0GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376074,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE NOTICED A FEW TIMES WHILE DRIVING THAT MY PRIUS STARTED ACCELERATING WHEN MY FOOT WAS OFF THE PEDAL. IT HASN'T CAUSED AN ACCIDENT OR ANYTHING TOO SCARY YET BUT IT IS DISCONCERTING. I NOTICED OTHERS HAD COMPLAINED ABOUT THIS AND WANTED TO ADD THAT I SEEM TO BE EXPERIENCING THE ISSUE TOO. IT'S POSSIBLE IT'S JUST MY VEHICLE SPECIFICALLY; I'VE NOT HAD TIME TO TAKE IT TO A MECHANIC YET.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372683,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS ACCELERATION INCIDENT. I WAS SLOWLY PULLING INTO A PARKING SPACE IN A PARKING GARAGE. AS I STRAIGHTENED IT OUT TO COMPLETE THE MANEUVER, THE CAR TOOK OFF ON ITS OWN AND HIT THE WALL OF THE PARKING GARAGE THERE WAS SOME DAMAGE TO THE FRONT END. A SIMILAR INCIDENT OCCURRED ONCE BEFORE WITH NO DAMAGE. TOYOTA HAS HAD RECALLS IN PRIOR YEARS FOR THIS PROBLEM - BROKEN THROTTLE RETURN SWITCH - BUT THEY INSIST THIS ISN'T THE PROBLEM HERE. ESSENTIALLY THEY ARE CLAIMING THIS DIDN'T HAPPEN, THAT WHAT I EXPERIENCED WITH THE CAR JUST TAKING OFF ON ITS OWN DIDN'T HAPPEN. THE CAR ISN'T SAFE TO DRIVE WITHOUT GETTING THIS REPAIRED, BUT THEY CLAIM IT DOESN'T NEED REPAIR.  IN THEIR RESPONSE LETTER, TOYOTA SAID, \"THE EVENT DATA RECORDER (EDR) RECORDED THAT THERE WAS ACCELERATOR PEDAL APPLICATION AND NO BRAKE APPLICATION LEADING UP TO THE IMPACT.\" OF COURSE THERE WAS NO BRAKE APPLICATION, THERE WAS NO TIME TO APPLY THE BRAKE! THE CAR TOOK OFF LIKE A BAT OUT OF HELL AND RAMMED INTO THE WALL IN 2-3 SECONDS! THIS IS NOT ONLY A DANGER FOR ME AND MY CAR BUT COULD BE FOR OTHER PRIUS OWNERS AS WELL. I HAVE A YOUTUBE VIDEO ON HOW TO DO THE REPAIR BUT I CAN NOT UPLOAD IT HERE.",
        "vin": "JTDKARFU2G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365389,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GPS SYSTEM REPORTS INACCURATE SYSTEM LOCATION. I LIVE IN HENDERSON, NV, BUT IT SHOWS THE LOCATION AS BOULDER CITY, NV. THIS IS AN 11 MILE DIFFERENCE. I HAVE TOYOTA'S SOS FEATURE (LIKE ONSTAR), SO IF EMERGENCY ASSISTANCE IS NEEDED, THEY WOULD NOT COME TO THE CORRECT LOCATION. I DO NOT KNOW IF IT IS ONLY MY CAR OR OTHERS. THE SOS REP SEEMED TO BE AWARE, BUT NO NOTICE WAS SENT OUT TO CUSTOMERS FOR SERVICE OR RECALLS.",
        "vin": "JTDKARFU0G3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "07/28/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361559,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATING WITH NOT BEING ABLE TO STOP WHEN APPLYING BRAKE, CAR WAS PUT IN REVERSE AND TOOK OFF WITH ENGINE RACING IN HOME DRIVEWAY.",
        "vin": "JTDKARFU9G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355295,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING UPHILL THEN I HAD TO MADE MAKE A STOP SIGN, CAR WOULDN'T MOVE WHEN ACCELERATING, KEPT PRESSING GAS AND STILL NOT MOVING (IT WAS ON DRIVE MODE) DECIDED TO GET OUT AND LOOK AROUND THE CAR. I HEARD UP NORMAL NOISE COMING OUT OF THE EXHAUST. I TURNED ENGINE OFF FOR SOME MINUTES AND IT MOVED. AFTER FEW MINUTES THERE WAS ANOTHER STOP SIGN. SAME THING HAPPENED BUT CAR WOULDN'T MOVE EVEN AFTER TURNING ENGINE IF FOR MORE THAN 15 MINUTES. I HAD TO LEAVE THE CAR SOMEWHERE IN THAT AREA UNTIL I GET IT TOWED. FOLLOWING DAY I TOOK IT TO TOYOTA SERVICE CENTER, THE GUY TOLD ME I WAS THE SECOND PERSON WHO HAD THIS ISSUE THAT DAY. I THINK TOYOTA SERVICE TECH DIDN'T DO GOOD DIAGNOSES AS THE REPORT SAYS I WAS PRESSING THE GAS PEDAL WHEN THE CAR WAS IN NATURAL MODE NOT DRIVE AND THE NOISE I HEARD FROM EXHAUST WAS A RESULT FROM PRESSING THE GAS WHILE CAR IN NATURAL! THAT DOESN'T MAKE ANY SENSE AND I FEEL THAT WAS AN INSULT TO ME. FIRST I LOOKED AT THE CAR MODE TO MAKE SURE IT'S ON DRIVE MODE, I EVEN CHANGED THE DRIVE MODE TO POWER MODE IN CASE IT NEEDED MORE POWER TO MOVE. SECOND. I WAS OUT OF THE CAR, BEHIND THE CAR , LISTENING TO THE NOISE FROM THE EXHAUST SO I DON'T KNOW WHO WAS PRESSING THE GAS PEDAL IN THE CAR, MAYBE THERE WAS A GHOST PUSHING THE GAS PEDAL.",
        "vin": "JTDKBRFU1G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/24/2020",
        "dateOfIncident": "08/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350840,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 PRIUS SITTING IN THE DRIVEWAY DURING A RELATIVELY HOT DAY (~95 F TEMPERATURE), APPEARS TO HAVE A BIG CRACK. I LOOKED IT UP AND APPARENTLY TOYOTA IS UNDERGOING A CLASS ACTION LAWSUIT OVER THE SAME ISSUE. NO OUTSIDE DAMAGE TO THE WINDSHIELD, THE DRIVER SIDE WINDOW WAS DOWN FOR THE REASON OF THE HEAT. SHAME THAT THIS HAPPENED. HOPEFULLY SOMEONE FROM THE AUTHORITY CAN HELP WITH THIS.",
        "vin": "JTDKBRFU9G3"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350158,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA PRIUS HAS ISSUES ACCELERATING WHEN PUT IN DRIVE AND FOOT IS ON THE GAS PETAL. CAR ENGINE WILL REV BUT DOES NOT ACCELERATE. I REVERSED, PUT THE CAR IN DRIVE AND WENT ABOUT A TENTH OF A MILE AND STOPPED TO WAIT FOR THE GATE TO OPEN. UPON GATE OPENING I PRESSED THE GAS PETAL AND CAR DID NOT MOVE BUT THE ENGINE REVVED. NO WARNING LIGHTS WERE ON AND CAR WAS IN FACT IN THE DRIVE POSITION. SECOND OCCURRENCE HAPPENED AT A MAJOR INTERSECTION, I WAS WAITING AT A RED LIGHT, LIGHT TURNED GREEN I PRESSED THE GAS AND ENGINE REVVED BUT CAR DID NOT MOVE. TOYOTA HAS BEEN UNABLE TO DIAGNOSE THE ISSUE BECAUSE THE CAR DOESN'T GIVE ANY CODES OR WARNING LIGHTS. THEY HAVE BEEN UNABLE TO REPLICATE THE PROBLEM.",
        "vin": "JTDKBRFU1G3"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350160,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DOES NOT ACCELERATE FROM A STOP WHEN PRESSING THE GAS PETAL WHILE CAR IS IN DRIVE. THIS SEEMS TO HAPPEN ONLY IN THE SUMMER MONTHS. WHILE PULLING UP TO A RED LIGHT I SLOWED THE CAR TO A STOP. WHEN THE LIGHT TURNED GREEN I LET MY FOOT OFF THE BRAKE, CAR MOTIONED FORWARD A BIT BUT WHEN I PRESSED MY FOOT ON THE GAS PETAL THE ENGINE WOULD REV BUT WOULD NOT ACCELERATE IN ANY WAY. I PUT THE CAR IN REVERSE TO TRY AND GET OUT OF MAIN ROAD TRAFFIC BUT CAR CONTINUED TO HAVE NO POWER. I THEN PUT THE CAR INTO DRIVE, PUT MY FOOT ON THE GAS PETAL AND AGAIN, ENGINE WOULD REV BUT CAR WOULD NOT ACCELERATE. THIS IS VERY DANGEROUS AS THE CAR WILL ROLL FORWARD WHEN TAKING YOUR FOOT OFF THE BRAKE, SO YOU CAN ROLL INTO THE MIDDLE OF A HIGHWAY BEFORE YOU REALIZE THERE IS NO ACCELERATION PUTTING DRIVERS AT GREAT RISK OF BEING T-BONED WHILE ATTEMPTING TO TURN (ESPECIALLY LEFT TURNS). I HAVE TAKEN THE CAR TO TOYOTA TWICE AND SERVICE CAN NOT FIND ANY ISSUES AS NO CODES HAVE SHOWN UP. THE SOFTWARE WAS UPDATED AND ISSUE OCCURRED AGAIN AFTER UPDATE.",
        "vin": "JTDKBRFU1G3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341250,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT CV AXLE JOINT DISCONNECTED.THIS HAPPEN IN CITY WHEN IN MOTION.",
        "vin": "JTDKARFU2G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339798,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE SECOND TIME IN MY OWNERSHIP OF THIS TOYOTA 2016 PRIUS, THE WINDSHIELD HAS CRACKED CONSIDERABLY DUE TO TINY ROAD DEBRIS MAKING CONTACT WITH IT. I WAS DRIVING ALONG THE HIGHWAY WHEN A SMALL PEBBLE FROM THE ROAD MADE CONTACT WITH MY WINDSHIELD CAUSING A CRACK WHICH HAS GROWN IN SIZE AND HAS SNAKED ALONG MY WINDSHIELD CONSIDERABLY SINCE THE CRACK OCCURRED EARLIER THIS WEEK (7/13/2020). THE TOTAL REPLACEMENT OF THE WINDSHIELD ALONG WITH THE CALIBRATION OF THE EQUIPPED ADS CAMERA SYSTEM IS VERY EXPENSIVE, ESPECIALLY CONSIDERING THAT THIS WILL BE THE SECOND TIME THAT I MUST REPLACE AND RE-CALIBRATE. ALTHOUGH I WOULD PREFER TO USE A TOYOTA DEALERSHIP, IT WOULD BE VERY DIFFICULT FOR ME TO DO SO AS THE ESTIMATED COST IS OVER $1K. WITH THE CURRENT STATE OF GLOBAL AFFAIRS, NO GLASS REPAIR COMPANIES IN MY VICINITY OFFER ANY OEM WINDSHIELDS AND THEY ARE HEAVILY INUNDATED WITH CLIENTS SO THE EARLIEST THAT I COULD GET A REPLACEMENT SERVICE WOULD BE AT THE END OF THIS MONTH. I FEAR THAT THE CRACK MAY FULLY SPREAD ACROSS THE WINDSHIELD AND THAT THE INTEGRITY OF THE WINDSHIELD MAY GIVE. AS A HEALTHCARE WORKER, I CANNOT AFFORD TO NOT USE MY VEHICLE.",
        "vin": "JTDKARFUXG3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330881,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES WHEN IT IS HOT MY PRIUS DOES NOT ACCELERATE FROM A STOP WHEN THE ACCELERATOR IS PRESSED FOR 1 OR MORE SECONDS; THIS MAKES IT A DEATH-TRAP ON LEFT TURNS. TOYOTA DEALERS HAVE SERVICED IT 3 TIMES FOR THIS COMPLAINT WITH NO RESOLUTION.  *TR",
        "vin": "JTDKBRFUXG3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA PRIUS. CONSUMER WRITES IN REGARDS TO UNINTENDED ACCELERATION. *LD    THE CONSUMER THE VEHICLE ACCELERATED ON IT'S OWN STRIKING 2 VEHICLES. *JS",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316777,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 PRIUS FOUR TOURING  WITH 25,202 MILES IS CHEWING UP ITS TIRES. SPECIFICALLY, IT IS CHEWING THEM UP ON THE \"INSIDE\" OF THE REAR TIRES (THAT IS, THE TREAD OF THE REAR TIRES CLOSEST TO THE CENTER OF THE CAR IS BEING WORN OFF FASTER THAN THE TREAD ON THE \"OUTSIDE\" OF THE TIRES).   THE REAR WHEELS ARE OUT OF ALIGNMENT IN THE CAMBER BY A NEGATIVE 1.7 DEGREES \"OUT\" OF WHERE IT SHOULD BE (THE TOP OF THE TIRE IS \"TILTED IN\" TOWARD THE MIDDLE OF THE CAR 1.7 DEGREES FROM WHERE IT SHOULD BE).   THE TOYOTA DEALER SERVICE WRITER REFUSES TO TAKE OWNERSHIP AND IS SAYING THAT THERE IS NO KIT/REPAIR TO MAKE A CAMBER ADJUSTMENT ON THE REAR TIRES OF THE 2016 PRIUS CARS.  I JUST ROTATED MY TIRES WITH 25,202 MILES ON 3.7.2020 AND THE TIRE DEPTH ON THE REAR TIRES IS A 2/32 WITH THE FRONT 4/32 AS O 3.7.2022.  ON 12.19.2019, WITH A MILEAGE READING OF 23,361THE TIRE DEPTH WAS 6/32 ON THE REAR TIRES AND 7/32 ON THE FRONT.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301587,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/23/2020 WHILE DRIVING ON HIGHWAY I60 IN AZ AROUND 9 AM THE SUNROOF OF THE CAR EXPLOITED. NO OBJECT WAS NOTICED TO HIT THE CAR OR SUNROOF. IT'S UNKNOWN THE REASON LEADING TO THE EXPLOSION.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "07/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299159,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT PEELING FROM TRIM.",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "12/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291277,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. WHILE ATTEMPTING TO START THE VEHICLE, THE COLLISION AVOIDANCE INDICATOR REMAINED ILLUMINATED AND THE CRUISE CONTROL FAILED TO WORK. THE CONTACT TOOK THE VEHICLE TO GATES TOYOTA (640 W IRELAND RD, SOUTH BEND, IN 46614), BUT IT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "JTDKARFU0G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289808,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS CLICKING NOISE WHEN WE PUSH THE BREAK PADDLE.  THIS IS THE SECOND VEHICLE THAT I GOT FROM TOYOTA WHICH HAS THE SAME PROBLEM. THE COMPANY KEPT THE FIRST VEHICLE AND THEN GIVE ME THIS ONE AFTER THE TRADE IN.",
        "vin": "JTDKBRFU6G3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255204,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SHOCK NUT COMES LOOSE AND TOYOTA HAS ISSUED TSB 0144-16, TO TIGHTEN THE NUT. THIS IS COMMON AMONG PRIUS. THIS MUST BE A RECALL OTHERWISE IT IS DANGEROUS IF THE SHOCK BECOME LOOSE. INITIALLY THE DEALER TOLD ME TO REPLACE SHOCKS BUT FORTUNATELY I FOUND OUT ABOUT TSB AND THE DELEAR FIXED IT FREE.",
        "vin": "JTDKBRFU5G3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242980,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED SEVERAL TOYOTA VEHICLES OVER THE YEARS - A TERCEL, A RAV4, A TACOMA AND A PRIUS V. RECENTLY I WAS HIT WITH A $1680 + REPAIR TO MY 2016 PRIUS V DUE TO 'RODENT DAMAGE' TO MY WIRING. THIS INCLUDED DAMAGE TO 3 OUT 4 BRAKE LINES, AN O2 SENSOR LINE, A FUEL LINE SENSOR AND POSSIBLY A FUEL PUMP WIRING HARNESS. THE CHECK ENGINE LIGHT CAME ON WHILE DRIVING AT 60MPH. I WAS DRIVING ON 1 WORKING BRAKE LINE!! MY CAR WAS IN THE TOYOTA SHOP FOR 3 DAYS. I'VE READ THAT TOYOTA DENIES RESPONSIBILITY FOR USING WIRING THAT ATTRACTS RODENT CHEWING. I HAVE BEEN FORCED TO TAKE THIS LOSS OF USE AND DAMAGE TO MY AUTO INSURANCE POLICY AND AM EXTREMELY CONCERNED THAT I WILL FACE THIS TYPE OF DAMAGE IN THE FUTURE WITH MORE CATASTROPHIC RESULTS LIKE AN ACCIDENT. THIS POSSIBILITY MAKES THE OWNERSHIP OF A MY PRIUS FINANCIALLY AND PRACTICALLY UNTENABLE!!! I CAN'T DEPEND ON MY PRIUS TO BE ABLE TO DRIVE ME TO MY WORK OR AND ANY OTHER DESTINATION SAFELY IF THE DESIGN OF THIS VEHICLE MAKES THE WIRING ACCESSIBLE TO RODENTS. I CAN'T KILL EVERY RODENT THAT MAY ENCOUNTER MY CAR IN EVERY LOCATION I PARK OR DRIVE MY CAR!! SINCE THIS HAS HAPPENED NOT ONLY TO ME BUT ALSO OTHER TOYOTA OWNERS, I WANT TO KNOW WHAT TOYOTA IS DOING TO PREVENT AND/OR CORRECT THIS PROBLEM? I'M HAVING TO PAY FOR INSTALLING NEW WIRING, WHICH UNLESS THE TOYOTA SERVICE CENTER DOING THE REPAIR DOES SOMETHING TO PREVENT THIS FROM HAPPENING AGAIN, THE WIRING WILL STILL BE SUBJECT TO THE SAME DESTRUCTION DUE TO TOYOTA'S BAD DESIGN AND/OR INFERIOR MATERIALS THAT PERMIT RODENT DAMAGE.",
        "vin": "JTDZN3EU2GJ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229653,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. THE CONTACT STATED THAT THE VEHICLE STRUGGLED TO MOVE FORWARD WHEN ATTEMPTING TO ACCELERATE. THE VEHICLE WAS TAKEN TO TEMPE TOYOTA (7970 S. AUTOPLEX LOOP, TEMPE, AZ 83326, (480) 420-3425) WHERE IT WAS DIAGNOSED THAT A NEW FUEL SYSTEM NEEDED TO BE INSTALLED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO CAMEL BACK TOYOTA (1550 E CAMELBACK RD, PHOENIX, AZ 85014, (602) 464-7261), BUT WAS NOT DIAGNOSED BECAUSE THE MECHANIC STATED THAT THERE WAS NO FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 71,000.",
        "vin": "4F2YU08171K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229029,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS V. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V085000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. AVONDALE TOYOTA (10005 PAPAGO FWY, AVONDALE, AZ 85323) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  *BF",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221678,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING THE CAR THE ELECTRONIC DASHBOARD WAS BLACK WITH NO INFO ON SPEED.  WE DROVE IT 70 MILES HOME GUESSING AT THE SPEED.  WE TURNED IF OFF AND RESTARTED IT WITH THE SAME RESULT. THEN WE GOT HOME, TURNED IT OFF, RESTARTED IT AND THE DASHBOARD WAS BACK, WORKING NORMALLY.  WTF? NOT HAVING A SPEEDOMETER IS A HUGE SAFETY HAZARD. THERE SHOULD BE A FALLBACK FOR THIS. WE CANT TRUST THIS CAR AND LIKELY WILL TRADE IT IN SOON FOR  SOMETHING ELSE.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "05/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218509,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 PRIUS WITH APPROXIMATELY 20,000 MILES THAT WAS PURSUED NEW FROM THE DEALERSHIP IN NOV 2016.     AT AROUND 10:30AM, I WAS TWO BLOCKS FROM HOME, DRIVING ON A RESIDENTIAL STREET (25MPH) AND DECELERATED TO APPROX 10MPH AS I APPROACHED A RED STOPLIGHT AT THE ONCOMING INTERSECTION. CROSS TRAFFIC WAS MOVING BUT THERE WERE NO OTHER CARS IN THE LANES LEFT OR RIGHT OF ME AND/OR APPROACHING MY CAR. I HEARD A VERY FAINT CLICK/POPPING SOUND COMING FROM THE UPPER RIGHT UPSIDE OF THE WINDSHIELD AND IMMEDIATELY PULLED OVER TO EXAMINE THE GLASS. I FOUND A VERY SMALL STAR SHAPED DING, LESS THAN A MILLIMETRE WIDE ABOUT 3-4 INCHES FROM THE TOP RIGHT OF THE WINDSHIELD. I THEN CALLED MY INSURANCE AGENT WHO STATED A SMALL DING LIKE THAT COULD DEFINITELY BE FIXED BY A GLASS SHOP AND WOULD BE COVERED IN FULL BY ALLSTATE.     I DECIDED TO JUST GO BACK HOME AND LOOK ONLINE FOR SOMEWHERE NEARBY I COULD TAKE IN MY CAR. I DROVE BACK, PARKED MY CAR BACK INTO MY UNDERGROUND TEMPERATURE CONTROLLED SPACE. I WASN'T ABLE TO GET A SAME DAY APPOINTMENT SO STAYED IN UNTIL 5:30PM WHEN I LEFT TO GO TO DINNER. I WAS SHOCKED TO SEE THAT THE SMALL DING WAS NOW A LARGE DIAGONAL CRACK FROM THE UPPER LEFT CORNER, TO JUST PAST MIDPOINT OF THE WINDSHIELD. BECAUSE OF THE CRACK, THE WINDSHIELD CAN NOT BE FIXED. I WAS TOLD THAT REPLACEMENT AND RECALIBRATION WILL COST APPROX JUST UNDER $1000, WHICH I WILL END UP PAYING OUT OF POCKET BECAUSE MY INSURANCE DEDUCTIBLE IS $1000.     HAS NOW BEEN 8 DAYS SINCE THE INITIAL DING AND THE CRACK HAS CONTINUED TO ELONGATE. IT IS NOW 2/3 OF THE LENGTH OF THE WINDSHIELD.     I HAVE OWNED EIGHT TOYOTA VEHICLES, THREE OF WHICH HAVE BEEN NEW PRIUSES. THIS IS THE FIRST AND ONLY CAR WHERE ANYTHING LIKE THIS HAS EVER HAPPENED. IT APPEARS THAT MANY OTHER 2015-2016 PRIUS OWNERS HAVE EXPERIENCED SIMILAR PROBLEMS WITH THEIR WINDSHIELDS TOO.  TOYOTA MUST ADDRESS THIS SAFETY ISSUE,",
        "vin": "JTDKARFU0G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209662,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA PRIUS. WHILE DRIVING 66 MPH, THE VEHICLE DECELERATED AND LOST POWER IN THE MIDDLE OF TRAFFIC. THE CONTACT ATTEMPTED TO PLACE THE VEHICLE INTO NEUTRAL, BUT WAS UNSUCCESSFUL. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND THEN TOWED TO AN INDEPENDENT MECHANIC. THE MECHANIC DIAGNOSED THAT A FUSE WAS BLOWN AND A NEW WATER PUMP NEEDED TO BE INSTALLED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 223,601. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192609,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR'S AIR CONDITIONING SYSTEM CONTINUALLY SETS ITSELF TO THE AUTO POSITION AND DISABLES ITSELF WHERE NOTHING YOU DO CAN ACTIVATE THE FAN THE AIR CONDITIONING THE HEAT ANYTING, GOING THROUGH ALL THE MENUS RESETTING EVERYTHING TURNING THE CAR OFF AND ON 50 TIMES DOES NO GOOD. THIS BEGAN HAPPENING WHEN THE CAR HAD ABOUT TEN THOUSAND MILES ON IT AND HAS BEEN MORE AND MORE COMMON SINCE.",
        "vin": "JTDKARFU7G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183577,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH NO IMPACT WHATSOEVER, AND THE CAR PARKED AND STATIONARY FOR MORE THAN 15 HOURS, I WOKE UP THIS MORNING TO FIND A CRACK IN THE FRONT WINDSHIELD. THIS CRACK IS IN THE LOWER, MIDDLE SECTION OF THE FRONT WINDSHIELD, GENERATING UP FROM THE BASE OF THE WINDSHIELD, AND VEERING TOWARDS THE LEFT. THERE IS ABSOLUTELY NO FEELING OF AN IMPACT (I.E. SCRATCH, DENT, PING, ETC.) ON EITHER THE OUTSIDE OF THE WINDSHIELD OR THE INSIDE OF THE WINDSHIELD - IT APPEARS THAT THE CRACK IS EMBEDDED IN THE GLASS ITSELF. I HAVE CONTACTED MY LOCAL TOYOTA DEALER AND WILL BE BRINGING IT IN FOR THEIR INSPECTION THIS WEEK. HOWEVER, IN MY ONLINE RESEARCH, IT SEEMS THAT THERE HAVE BEEN A NUMBER OF 2016 TOYOTA PRIUS' THAT HAVE HAD THIS MYSTERIOUS FRONT WINDSHIELD CRACK OCCUR - ENOUGH TO MAKE ME WONDER IF THERE IS SOMETHING WRONG WITH THE FACTORY-PROVIDED WINDSHIELD, AND THAT WOULD POSSIBLY WARRANT A RECALL. THANK YOU FOR YOUR CONSIDERATION.",
        "vin": "JTDKBRFU1G3"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181608,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM IN THE PROCESS OF BRAKING AND HIT A ROUGH SPOT IN THE ROAD SUCH AS A POTHOLE, I ESSENTIALLY LOSE CONTROL OF THE CAR FOR A SPLIT SECOND.  IT FEELS JERKY LIKE IT LURCHES FORWARD OR SHAKES SIDE TO SIDE.  ITS NOT VERY PRONOUNCED BUT ENOUGH TO MAKE ME FEEL UNSAFE.  THIS HAPPENS EVERY TIME I AM BRAKING AND RUN OVER POTHOLES, SO ITS NOT AN ISOLATED INCIDENT THAT ONLY HAPPENED ON ONE DAY, AND IT DOESN'T MATTER HOW HARD I'M BRAKING OR HOW FAST I'M GOING UNLESS I'M BARELY MOVING (THEN IT DOESN'T JERK).",
        "vin": "JTDKDTB32G1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "11/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157195,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SOMETHING WRONG WITH THE WINDSHIELD DESIGN OF THE CAR. I HAD DEBRIS OR ROAD GRAVEL HITTING THE WINDSHIELD TWICE IN LAST 2 MONTHS AND GOT A CRACK ON WINDSHIELD IN 2 OCCASIONS. I WAS DRIVING CAR AT 65 MPH ON HIGHWAY IN BOTH INSTANCES.  I ALSO REALIZE A FLAW WITH WIPER DESIGN THAT THE WIPERS DO NO CLEAR THE FULL WIND SHIELD. THIS REDUCES VISIBILITY SPECIALLY WINTER WHEN THERE IS LOT OF SALT AND SNOW ON ROADS.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/04/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155879,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT ON DRIVERS SIDE DOES NOT RETRACT, GETS CAUGHT IN DOOR WHEN EXITING THE CAR. DEALER WON'T FIX IT. IT'S A SAFETY ISSUE IN THAT THE DRIVER WHEN EXITING HAS TO STOP DEAL WITH EXTENDED SEAT BELT CAUGHT IN DOOR, COULD BE HIT BY ANOTHER CAR IN A PARKING LOT OR THE STREET. IT'S BEEN LIKE THIS FOR MONTHS. VERY ANNOYING.A GOOGLE SEARCH SHOWS THIS IS A COMMON PROBLEM FOR TOYOTA CARS.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "05/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11154354,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 TOYOTA PRIUS. WHILE DRIVING APPROXIMATELY 40 MPH, THE CONTACT CRASHED INTO THE FRONT PASSENGER SIDE OF ANOTHER VEHICLE. THE AIR BAG DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DAMAGED AND TOWED TO A BODY SHOP WHERE IT WAS REPAIRED. THE DEALER WAS NOT CALLED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS APPROXIMATELY 37,000.",
        "vin": "JTDZN3EU7GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11154115,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING MY VEHICLE AND SLOWING DOWN TO ENTER A PARKING SPACE, I EASED OFF THE BRAKE TO PULL INTO THE SPACE WHEN I HEARD THE ENGINE REV LOUDLY AND THEN THE CAR ACCELERATED AND CONTINUED TO ACCELERATE DESPITE ATTEMPTS TO PUMP THE BRAKES, RELEASE THE BRAKES WITHOUT TOUCHING ANY PEDAL AND ALSO TRYING TO PUT THE TRANSMISSION INTO PARK. THE VEHICLE WOULD NOT STOP AT ALL. I WAS AFRAID FOR MY LIFE AND TRIED EVERYTHING TO AVOID OTHER VEHICLES AND PEDESTRIANS AS THE CAR ACCELERATED GREATLY. I STEERED THE CAR TO TRY AND AVOID A SLIGHT EMBANKMENT AND CURVE BUT WITH THE RAPID SPEED OF THE CAR, IT BECAME HARD TO MANEUVER THE CAR. THE VEHICLE JUMPED THE CURB STRIKING A TREE AND THEN A CONCRETE POST. THE CAR CAME TO REST ON ITS SIDE AFTER IMPACT. THE CAR WAS A TOTAL LOSS.",
        "vin": "JTDZN3EU8GJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152286,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOW HAD MY WINDSHIELD DEVELOP CRACKS TWICE. THE FIRST TIME WAS ON JANUARY 8, 2018. I WAS DRIVING BEHIND A LARGE TRUCK, AND A PEBBLE WAS KICKED UP BY THE TRUCK'S REAR TIRE THAT STRUCK THE MIDDLE OF THE BASE OF MY WINDSHIELD. A CRACK DEVELOPED THE NEXT DAY, AND STARTED SPREADING. I HAD MY WINDSHIELD REPLACED. THE SECOND WINDSHIELD CRACK OCCURRED ON 11/6/2018. MY SPOUSE AND I HAD RETURNED FROM DINNER, AND HE NOTICED A CRACK AT THE BASE OF THE WINDSHIELD, JUST TO THE RIGHT OF CENTER, BEFORE WE GOT OUT OF THE CAR, AFTER WE HAD PARKED IN OUR INDOOR GARAGE. THIS TIME, I DO NOT RECALL ANY OBJECTS, SUCH AS A PEBBLE, GRAVEL, OR HAIL, HITTING MY WINDSHIELD PRIOR TO THE CRACK DEVELOPING.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD ON MY 2016 TOYOTA PRIUS CRACKED FOR NO REASON. I PARKED MY PRIUS IN A COVERED PARKING GARAGE. WHEN I RETURNED TO MY CAR LATER, THERE WAS A LARGE CRACK IN THE WINDSHIELD (OVER A FOOT LONG), AND THE CRACK CURVED DOWN TO THE BOTTOM OF THE WINDSHIELD. I DON'T KNOW WHAT CAUSED THE WINDSHIELD TO CRACK ALL OF A SUDDEN. THERE WERE NO SIGNS OF DEBRIS OR IMPACT. I BELIEVE THE WINDSHIELD MAYBE DEFECTIVE OR WAS SET ON MY CAR IMPROPERLY IN THE FACTORY, WHICH CAUSED STRESS ON THE WINDSHIELD WHICH LED TO THE LARGE CRACK.",
        "vin": "JTDKARFU9G3"
    },
    {
        "components": "SUSPENSION,VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139280,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA PRIUS VIN#[XXX]  I PURCHASED THIS CAR IN JULY, 2017 AND I AM HAVING PROBLEMS WITH A CLICKING OR POPPING SOUND UNDER THE VEHICLE ON BOTH THE RIGHT AND LEFT, REAR AND FRONT.  I HAVE TAKEN MY CAR IN FOR REPAIRS 3 TIMES AND THE TOYOTA REPAIR SHOP CAN FIND NOTHING WRONG. THE CLICKING AND POPPING NOISE IS GETTING WORSE AND I AM VERY CONCERNED ABOUT THE SAFETY OF THIS CAR. I HOPE FOR THE SAFETY OF THE TOYOTA CUSTOMERS THAT THE TOYOTA CORPORATION IS TAKING THESE COMPLAINTS SERIOUSLY. I ALSO HAVE A COMPLAINT REGARDING THE WINDSHIELD. WHILE DRIVING A PEBBLE HIT THE WINDSHIELD AND IN A AND WITHIN 5 MINUTES THE LINE SPREAD AND A WINDSHIELD REPAIR COMPANY TOLD ME THAT IT COULD NOT BE REPAIRED. THERE IS A MAZE OF CRACKS COVERING THE WINDSHIELD. IF THE CAR WAS INVOLVED IN A COLLISION, I FEEL THAT THIS WOULD A DISASTER BECAUSE OF THE SUBSTANDARD QUALITY. I HAVE PURCHASED SEVEN TOYOTAS IN THE LAST 20 YEARS AND HAVE NEVER EXPERIENCED THESE TYPE OF PROBLEMS. THE PAINT ON THIS VEHICLE IS ALSO VERY POOR QUALITY, THERE ARE AREAS WHERE THE PAINT HAS COME OFF AND GRAY AREAS APPEAR. I WOULD LIKE TO KNOW WHY THERE ARE NO RECALLS AND IF THESE COMPLAINTS ARE BEING SERIOUSLY INVESTIGATED. I SUPPOSE THAT WHEN LIVES ARE LOST BECAUSE OF SUBSTANDARD WINDSHIELDS OR OTHER PROBLEMS ASSOCIATED WITH THIS VEHICLE, THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION AND THE TOYOTA CORPORATION WILL ADDRESS THESE ISSUES.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JTDKARFU6G3"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129560,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MOTION ON A HIGHWAY.  WINDSHIELD GOT HIT BY A ?ROCK? AND HAD A SMALL STAR.  WITHIN DAYS IT HAS GROWN TO COVER THE ENTIRE WINDSHIELD IN SEVERAL DIFFERENT PATTERNS.  WINDSHIELD IS TOTAL LOSS AND NEEDS TO BE REPLACED.",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "07/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124671,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MANY OCCASIONS WHEN I WOULD STEP ON MY BRAKE, MY CAR WOULD JERK AND THRUST FORWARD AGGRESSIVELY. I'D HAVE TO STEP HARD ON MY BRAKE SO THE CAR WOULD NOT CATAPULT PAST A STOP SIGN OR LIGHT. IT FEELS LIKE THE CAR IS STRONGER THAN THE BRAKE AND OUT OF CONTROL. WHICH IS ALARMING BECAUSE I PICK UP MY 2 YEAR OLD GRANDDAUGHTER FROM DAYCARE AND BRING HER HOME. IT'S HAPPENED WHEN I TURN CORNERS OR COME TO A STOP SIGN OR LIGHT AND I NEVER KNOW WHEN IT WILL HAPPEN.",
        "vin": "JTDKBRFU4G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/03/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD HAD A VERY MINOR CHIP WHICH RESULTING IN A CRACK ACROSS THE WINDSHIELD. THIS SEEMS TO BE AN DISPROPORTIONATE DAMAGE TO THE WINDSHIELD SUGGESTING A STRUCTURAL DESIGN DEFECT.",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2015 TOYOTA PRIUS. CONSUMER WRITES IN REGARDS TO ISSUE WITH VEHICLE TIRES. *LD    THE CONSUMER STATED THE TIRES HAD A BROWN SUBSTANCE ON THEM. THE CONSUMER WAS INFORMED THE TIRES WERE NOT NEW LIKE THE DOCUMENT FROM THE DEALER STATED THEY WERE. THE TIRES NEEDED TO BE REPLACED. THE DEALER WAS NOTIFIED, BUT DID NOT OFFER ANY ASSISTANCE. *JS",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "12/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123885,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS SOLD WITHOUT A SPARE TIRE OR JACK. WHY DOES THE GOVERNMENT ALLOW A CAR COMPANY TO SELL A VEHICLE WITHOUT A SPARE TIRE AND JACK?",
        "vin": "JTDKARFU9G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/24/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123118,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FROM TUCSON TO PHOENIX ON US ROUTE 10 AT AROUND 65 MPH ON THE WAY TO SOUTHERN CALIFORNIA ON AUGUST 24, 2018, IN 100 DEGREE F. HEAT, A CRACK BEGAN IN THE LOWER DRIVERS SIDE OF THE WINDSHIELD AND WAS A FOOT LONG WITHIN SECONDS.  BY THE TIME I REACHED HOME AT 5:00PM, THE CRACK HAD GROWN HORIZONTALLY TO MORE THAN TWO FEET IN LENGTH.  I HAVE AVOIDED WASHING THE WINDSHIELD WITH COLD WATER, OR AT ALL, AND IF THE CRACK HAS LENGTHENED FURTHER IN THE MORE MODERATE TEMPERATURES, I HAVE NOT NOTICED.  THERE IS NO OBVIOUS SIGN OF A ROCK IMPACT.  WHEN THE SUN IS A THE WRONG ANGLE, THERE IS A DISTRACTINGLY BRIGHT GLARE FROM THE CRACK.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115228,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. WHILE THE VEHICLE WAS REVERSING AND DEPRESSING THE BRAKE PEDAL, THE VEHICLE JERKED WHILE COMING TO A STOP. THERE WERE NO WARNING INDICATORS ILLUMINATED. AS A RESULT, THE CONTACT HAD TO RELEASE THE BRAKE PEDAL TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO CITY TOYOTA (255 SAN PEDRO RD, DALY CITY, CA 94014, (650) 204-8135) WHERE IT WAS DIAGNOSED THAT THE BRAKE ACTUATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE DEALER ADVISED THE CONTACT TO SCHEDULE A DIAGNOSTIC APPOINTMENT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 17,000.",
        "vin": "JTDKBRFU4G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER OF A 2016 TOYOTA PRIUS 3 WITH ADVANCED TECHNOLOGY PACKAGE:    I'LL PREFACE THIS THAT I'M SATISFIED WITH MOST/IF NOT ALL OTHER ASPECTS OF THE PRIUS (EXCEPT ENTUNE...). HOWEVER, IT SEEMS THERE IS A DEFINITE ISSUE WITH WINDSHIELDS CRACKING. I WAS DRIVING ON THE FREEWAY AT THE START OF ROADTRIP WHEN I HEARD AND BARELY SAW A ROCK/PEBBLE HIT LOWER LEFT DRIVERS SIDE SECTION OF THE WINDSHIELD. I INSTANTLY SAW 1-2 INCH DIAMETER CRACK/CHIP APPEAR. OVER THE NEXT FEW HOURS I SAW IT GROW AND EXPAND.    READING UP ON THIS IT SEEMS I'M NOT ONLY ONE WHO'S EXPERIENCING THIS ISSUE. I DON'T KNOW IF ITS JUST THE DESIGN OR GLASS IS UNDER SOME HIGHER STRESS. UNFORTUNATELY, DUE TO THE NATURE OF THE CAMERAS AND SENSORS, ONE HAS TO GO TO TOYOTA SERVICE ANYWAY TO GET THE CAMERA RECALIBRATED. OEM GLASS DOES NOT APPEAR TO BE CHEAP EITHER!",
        "vin": "JTDKARFU6G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104580,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SMALL ROCK CHIP CAUSED WINDSHIELD TO CRACK ALL THE WAY THROUGH ACROSS THE ENTIRE WINDSHIELD.  I'VE BEEN DRIVING SINCE I WAS 17 AND NEVER HAVE HAD A WINDSHIELD CRACK FROM A SMALL ROCK CHIP, EVEN THE SHOP SAID HE HAS SEEN A LOT OF THIS GENERATION PRIUS COMING IN FOR REPLACEMENTS. TOYOTA HAS MADE A SUB PAR WINDSHIELD THAT ISN'T ABLE TO WITHSTAND ANYTHING. THIS GLASS IS THIN, AND VERY UNSAFE. NOW MY WINDSHIELD IS CRACKED ALL THE WAY ACROSS IMPARING MY VISIBILITY.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103517,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS IN DRIVE AND STATIONARY ON A HILL FACING UP WARDS (LIKE IN A DRIVEWAY) THE CAR STILL SENDS ELECTRICAL POWER TO THE ELECTRIC MOTOR AND TO THE WHEELS EVEN WHEN THE BRAKES ARE APPLIED. THIS ONLY HAPPENS WHEN FACING UP A HILL. ALL ELECTRICAL POWER IS SUPPOSE TO TURN OFF WHEN THE BRAKE IS PRESSED.     THIS STARTED HAPPENING TWO WEEKS AGO AND THE DEALERSHIP SAID THAT THIS IS NORMAL BUT IT IS NOT NORMAL AS IT NEVER DID THIS BEFORE. IT DOES NOT HAPPEN WHEN ON FLAT GROUND OR WHEN FACING DOWN HILL. DEALERSHIP CLAIMED THAT THIS IS THE HILL ASSIST FEATURE HOLDING THE CAR BUT THAT'S A LIE AS THE HILL ASSIST UTILIZES THE BRAKES AND NOT THE MOTOR. DEALERSHIP COULD NOT FIND ANY ERROR CODES AND REFUSED TO DIG FURTHER INTO THE ISSUE AND MADE UP LIES ABOUT IT.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101280,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A BLOW OUT ON THE DRIVER REAR TIRE GOING DOWN THE INTERSTATE GOING APPROXIMATELY 70 MPH. THE TREAD COMPLETELY SEPARATED FROM THE SIDEWALL. THE TIRES WERE TOYO NANOENERGY A29.",
        "vin": "JTDKARFU9G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2018",
        "dateOfIncident": "06/06/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100512,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMES TO A STOP AND ON ACCELERATION VEHICLE WON'T MOVE ESPECIALLY AFTER RAIN AND CAR WASH. IT HAPPENED 10 TIMES SINCE JUNE 2017 AND ONCE A WEEK LATELY. EVERY TIME IT STARTS WITH LOUD NOISE FROM ENGINE,RIGHT AFTER THAT THE BATTERY BAR DROPPED FROM FULL BAR TO ONE BAR QUICKLY IN ONE SECOND. IF I HAVE TO STOP AT THE TRAFFIC LIGHT WHEN THIS HAPPENS IT WON'T MOVE. EARLY THIS YEAR 01/12/2018,IT 'S BEING TOWED TO PUENTE HILLS TOYOTA DEALER AND SERVICE COULDN'T FIND ANY CLUE AFTER 5HRS. ON 06/01/2018 WE BROUGHT IT IN AGAIN FOR SAME ISSUES TO THE SAME DEALER AND BEING TOLD NO CLUE AFTER 5 HRS AGAIN . ON 06/06/2018 AT 18.38 PM PST, IT HAPPENED AGAIN..  I FEEL SO UNSAFE TO DRIVE, IT MIGHT GET ME KILLED ANYTIME WHEN IT HAPPENS,",
        "vin": "JTDKBRFU7G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/03/2018",
        "dateOfIncident": "06/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099437,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, WITH NO OTHER VEHICLE WITHIN 100 YARDS, AN APPROXIMATELY 12 INCH LONG CRACK APPEARED FROM THE LOWER PASSENGER SIDE WINDSHIELD. I DID NOT HAVE THE RADIO ON AND DID NOT HEAR OR SEE ANYTHING STRIKE THE WINDSHIELD. WHEN I ARRIVED AT MY DESTINATION I INSPECTED THE CRACK AND SAW NO CHIP OR OTHER EVIDENCE THAT SOMETHING STRUCK THE WINDSHIELD. AFTER A FEW HOURS I CAME BACK TO LEAVE AND NOTICED THAT THE CRACK HAD GROWN EVEN LONGER. I ASSUME FROM BEING PARKED IN DIRECT SUNLIGHT, ALTHOUGH IT WAS ONLY ABOUT 80F DEGREES.    I HAVE ALWAYS BEEN PROUD OF TOYOTA'S DURABILITY AND HAVE OWNED EVERYTHING FROM THE PRIUS TO THE TUNDRA. I'VE EVEN GOTTEN MANY OF MY FRIENDS AND FAMILY MEMBERS TO SWITCH TO TOYOTA. I NOW HAVE TO WONDER IF TOYOTA HAS STARTED TO \"CHEAP OUT\" LIKE MANY OTHER MANUFACTURERS.    I AM ESPECIALLY DISAPPOINTED AT THE FACT THAT THIS APPEARS TO BE A \"FIT AND FINISH\" DEFECT. EITHER THE WINDSHIELD MUST BE CHEAP AND THIN, OR THE QUALITY OF WORKMANSHIP MUST BE LACKING. A QUICK GOOGLE SEARCH REVEALED THAT THIS IS A DISPROPORTIONATELY COMMON PROBLEM WITH THE NEW 4TH GEN TOYOTA PRIUS AND THAT THE WINDSHIELD HAS BEEN BACK ORDERED. TO ADD INSULT TO INJURY, THE NEW TOYOTA SAFETY SENSE SENSORS MUST BE RE-CALIBRATED WITH THE REPLACEMENT WINDSHIELD, WHICH CAN ADD UP TO $500 TO THE TOTAL COST OF REPAIR!    I CANNOT RECOMMEND THE NEW 4TH GEN PRIUS IF IT COMES WITH SUCH A DEFECTIVE WINDSHIELD. THIS IS CERTAINLY A SAFETY ISSUE AND IS A VERY EXPENSIVE REPAIR. I WISH I KNEW ABOUT THIS PROBLEM BEFORE BUYING!",
        "vin": "JTDKARFU2G3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/20/2018",
        "dateOfIncident": "04/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SUSPENSION CREAKING AND FEELS SOFT IN THE REAR.  WHILE DRIVING OR GOING ONTO A DRIVEWAY THE REAR SUSPENSION CREAKS AND POPS.  DRIVING NORMALLY THE REAR END SEEMS TO BOB AROUND OFTEN AND FEELS SUPER SOFT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093376,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. WHILE ACCELERATING FROM A STOP, THE VEHICLE JERKED AND WOULD NOT MOVE. THE VEHICLE WAS ABLE TO BE DRIVEN TO HAMER TOYOTA (11041 SEPULVEDA BLVD, MISSION HILLS, CA 91345), BUT THEY COULD NOT DETECT ANY FAILURES. THREE MONTHS LATER, THE SAME FAILURE OCCURRED AND THE VEHICLE HAD TO BE TOWED FROM THE LOCATION. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 22,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/01/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091276,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD HAS CRACKED IN DRIVE WAY FOR NO REASON. NOW HAS SPIDER WEBBED ACROSS WINDSHIELD OBSTRUCTING MY  VIEW. CALLED TO REPAIR AND FOUND OUT MANY PEOPLE ARE REPORTING THE SAME PROBLEM. EVEN AFTER THEY FIX AND REPLACE NEW WINDSHIELD I=ITS CRACKING AGAIN. NEW WINDSHIELD IS $600PLUS INSTALL AND RE CALIBRATION  IM LOOKING AT $1300. PLEASE HELP US CUSTOMERS BECAUSE WINDSHIELD IS DEFECTIVE!",
        "vin": "JTDKARFU8G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088852,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SMALL ROCK HIT WINDSHIELD ON PASSENGER SIDE WHILE DRIVING ON I 25 INTERSTATE FROM RIO RANCHO TOWARDS SANTA FE....OVERNIGHT CRACK DEVELOPED AND SPREAD 6 INCHES OR SO...SUBSEQUENTLY CRACK QUICKLY SPREAD ACROSS CENTER OF WINDSHIELD TO DRIVERS SIDE.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/15/2018",
        "dateOfIncident": "04/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085102,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A NEW 2016 PRIUS FROM LONGO TOYOTA IN MARCH 2016.  EVERYTHING HAS BEEN FINE UNTIL MARCH 2018 WHEN WE HAVE HAD TWO INCIDENTS WHERE THE NEXT MORNING A TIRE WAS COMPLETELY FLAT WHEN IT WAS PERFECTLY FINE THE NIGHT BEFORE.  THE OE TIRES ARE TOYO NANOENERGY A29 P195/65R15.  NOW IT HAS HAPPENED A THIRD TIME, APRIL 15, 2018.  IT IS PARKED IN MY GARAGE OVERNIGHT SO ITS IMPOSSIBLE TO BE TAMPERED WITH.  ALL THREE INSTANCES HAVE BEEN EXACTLY THE SAME.  THE CAUSE HAS BEEN A SMALL HOLE IN THE OUTSIDE SIDEWALL.  I HAVE TO BELIEVE THAT THESE TIRES ARE DEFECTIVE SINCE IT HAS NOW HAPPENED TO 3 OUT OF THE 4 ORIGINAL TIRES.  THERE IS NO EVIDENCE OF A NAIL, SCREW, DEBRIS, ETC., THAT WOULD CAUSE THIS SMALL HOLE/TEAR.  WE HAVE 30K MILES ON THE TIRES AND THE TREAD IS STILL PRETTY DECENT.",
        "vin": "JTDKARFUXG3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "02/09/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT HIGHWAY SPEEDS I WAS STRUCK BY A ROCK. WINDSHIELD CRACKED. HAD TO HAVE IT REPLACED. COSTLY AND NOW I AM TOLD IT WILL COST ANOTHER $400+ TO HAVE IT CALIBRATED. I AM NOW READING THAT THE PRIUS IS PRONE TO WINDSHIELD BREAKS AND THE COST OF RECALIBRATION IS BOTH EXPENSIVE AND THE DEALERS DON'T LIKE DOING IT SO THE TIME TO GET IT DONE IS EXCESSIVE.  I NOW WORRY IF SAFETY FEATURES ARE COMPROMISED AND IT IS DANGEROUS TO DRIVE.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11072993,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FEBRUARY 7, 2018  !01 FRWY NORTH APPROACHING SANTA ROSA/ PLEASANT VALLEY OFF RAMP ON THE DOWNGRADE OUT OF NEWBURY PARK AT 25 MPH IN THE RIGHT LANE.    A.BRAKE LIGHTS ARE SEEN IN CAR AHEAD.  B.THE DASH BOARD LIGHTS UP RED WITH THE WORD BRAKE IN RED  C.A  LOUD PULSATING AUDIO NOISE CAN BE HEARD COMING FROM THE SPEAKERS.  D.THE DRIVER TOUCHES THE BRAKES AND THE CAR GOES INTO FULL ABS EMERGENCY BRAKING REDUCING SPEED FROM 25 MPH TO 12 MPH IN LESS THAN 1/2 SECOND  E.THE DRIVER AND THE PASSENGERS EXPERIENCE A VIOLENT LURCH WHICH PRODUCES WHIP LASH.  F.THE SEAT BELTS ENGAGE CAUSING PAIN TO THE SHOULDERS.  G.THE INCIDENT OCCURRED AT 25 MPH.     THIS HAS OCCURRED OVER 6 TIMES IN THE PAST YEAR.  A PDF IS ATTACHED OF THE HISTORY OF PROBLEM AS PRESENTED TO THOUSAND OAKS TOYOTA AND TOYOTA NATIONAL IN NOVEMBER 2017.    VIDEO CAMERAS WERE INSTALLED IN THE CAR IN DECEMBER 2017 TO CAPTURE THIS AS THOUSAND OAKS TOYOTA AND TOYOTA NATIONAL SAID THIS NEVER HAPPENED.      HERE ARE THE LINKS TO THE VIDEO OF THE ABOVE INCIDENT:  ACCIDENT STARTS AT 30 SECONDS    HTTPS://VIMEO.COM/254847752  HTTPS://YOUTU.BE/62AO8Z0IGDY    [XXX]  - DRIVER  [XXX]  - PASSENGER FRONT SEAT  [XXX]  - PASSENGER REAR LEFT SEAT    CAMERA 1 MOUNTED IN BACK CEILING  CAMERA 2 MOUNTED ON CONSOLE      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "01/11/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072880,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE PAST YEAR AND OVER 15,000 MILES OUR 2016 TOYOTA PRIUS FOUR TOURING HAS EXPERIENCED SUDDEN DISPLAYS OF WARNING MESSAGES AND LIGHTS REPORTING BRAKING POWER LOW - VISIT YOUR DEALER; BRAKING POWER LOW - STOP IN A SAFE PLACE - SEE OWNER'S MANUAL; PRE-COLLISION SYSTEM MALFUNCTION - VISIT YOUR DEALER; ANTI-LOCK BRAKE SYSTEM MALFUNCTION - VISIT YOUR DEALER; LANE DEPARTURE ALERT MALFUNCTION - VISIT YOUR DEALER; ICS MALFUNCTION - VISIT YOUR DEALER; CHECK CRUISE CONTROL SYSTEM - VISIT YOUR DEALER.    THE FOLLOWING CODES/FAULTS HAVE BEEN DETECTED:  ABS - C1403, C1407, C1415; PARKING SENSORS - C164D, C1A50; BLIND SPOT MONITOR - C1A45; BLIND SPOT MONITOR SLAVE - C1A45; PRE-COLLISION SYSTEM 2 - C1A50; LANE-KEEPING ASSIST 2 - C1A50; ECU - P157800 & CRUISE ECU - P157800.    THE WARNING MESSAGES/LIGHTS CAME AND WENT WHILE DRIVING ON BOTH CITY STREETS AND HIGHWAYS.  EACH TIME I TOOK THE VEHICLE TO THE DEALER.  THEY COULD SEE THE CODES IN MEMORY, BUT COULD NOT REPLICATE THE PROBLEM.  NO PARTS WERE REPLACED.  THE ONLY THING THEY HAVE DONE IS TO TAKE APART AND RESEAT SOME OF THE CONNECTOR CABLES AND THEN SEND US ON OUR WAY TELLING US TO BRING IT BACK IN IF IT HAPPENS AGAIN.    WE ARE SERIOUSLY CONCERNED ABOUT THE SAFETY OF THIS VEHICLE AND HAVE NO REASSURANCE THAT THE PROBLEM HAS BEEN RESOLVED AND NO REASSURANCE THAT MAJOR BRAKING SYSTEMS MIGHT NOT BE AVAILABLE TO ME IF IT OCCURS AGAIN.    I CONTACTED TOYOTA CUSTOMER ASSISTANCE WITH NO CHANGE IN THEIR POSITION.  I AM CURRENTLY NEGOTIATING TO TRADE THE VEHICLE IN AS I AM NOT COMFORTABLE THAT THE PROBLEM IS RESOLVED AND DEEPLY CONCERNED THAT IT WILL HAPPEN AGAIN.    I HAVE SHARED VIDEO OF THE WARNING MESSAGES AND LIGHTS WITH THE DEALER, BUT AM UNABLE TO UPLOAD VIDEO HERE.",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2018",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED 3 TOYOTA PRIUS AND SINCE I PURCHASED THIS 2016 PRIUS IN 09/2016.   I HAVE HAD TO REPLACE THE WINDSHIELD TWICE SO FAR, 1 IN 09/2016 AND 06/2017.   AND NOW HAVE CRACKED WINDSHIELD ALL CAUSE BY SMALL ROCK CHIP STARTING IN THE CORNERS OF THE WINDSHIELD.  THIS IS GETTING RIDICULOUS, I HAVE NEVER HAD THIS ISSUE WITH OTHER 2 MODELS OR OTHER VEHICLE I HAVE OWNED.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/03/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071671,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED WHILE DRIVING DOWN THE HIGHWAY",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "08/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "LEASED THE VEHICLE FOR LESS THAN 1 YEAR AND HAVE EXPERIENCED 3 MAJOR CRACKS TO THE FRONT WINDSHIELD.  THE FIRST ONE WAS CAUSED BY PROBABLY A SMALL ROCK WHILE DRIVING MID SPEED AND SPREAD IMMEDIATELY FROM THE PASSENGER-SIDE PERIMETER.  THE SECOND ONE WAS CAUSED BY UNKNOWN, MAYBE A ROCK, AS I DID NOT SEE NOR HEAR ANYTHING BUT OVERNIGHT SAW A CRACK IN THE CENTER THAT SPREAD VERY QUICKLY.  THE THIRD CRACK WAS CAUSED BY PROBABLY A SMALL ROCK THAT STARTED ON THE DRIVER'S SIDE PERIMETER.  I HAVE OWNED NICER CARS THAN THE PRIUS AND ALSO ONES LESS PRESTIGIOUS.  WHILE OWNING THESE CARS FOR 5+ YEARS AND DRIVING EXTENSIVELY, I HAVE NEVER, EVER SUFFERED MORE ROCK IMPACTS BY A WINDSHIELD THAT CAUSED EXTENSIVE DAMAGE THAN WHEN I HAVE DRIVEN THIS 2016 PRIUS.   THIS CAR SHOULD BE RE-EXAMINED FOR SAFETY AND ANGLES.  IN ADDITION, TOYOTA SUPPOSEDLY HAS HAD A BACKORDER OF THIS PARTICULAR TYPE OF WINDSHIELD AND HAS NOT ALLOWED AFTER-MARKET PRODUCTION SO I AM FORCED TO EITHER USE MY INSURANCE OR PAY AN EXORBITANT AMOUNT OUT OF POCKET.",
        "vin": "JTDKBRFU4G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055627,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PREVIOUS PROBLEMS WHEN I FIRST BOUGHT MY PRIUS WHERE I RECEIVED 2 CRACKS ON MY WINDSHIELD WITHIN A WEEK OF OWNING THE CAR. I NEVER HEARD A ROCK HIT MY CAR. I REPORTED IT HERE AND TOYOTA CALLED ME TO REPLACE MY WINDSHIELD SO THEY COULD KEEP MY OLD ONE FOR QUALITY CONTROL. I WAS FINE WITH THIS BUT JUST TODAY I GO OUT TO MY CAR AND SEE A 6 INCH CRACK THAT STARTED FROM THE BOTTOM OF THE WINDSHIELD THAT WASN'T THERE BEFORE AND I DIDN'T HEAR A ROCK HIT IT EITHER. I FEEL LIKE MY PRIUS WINDSHIELD PROBLEMS WILL NEVER EVER END",
        "vin": "JTDKBRFU2G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/17/2017",
        "dateOfIncident": "12/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055096,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE OF THE CAR, THE VEHICLE HAS SHIFTED FROM DRIVE TO NEUTRAL UPON BRAKING HARD.  THIS HAS OCCURRED  WHILE DRIVING ON THE FREEWAY.  THE CAR WILL NOT RETURN TO DRIVE WITHOUT TURNING OFF THE ENGINE AND RESTARTING.  IT IS NOT SAFE TO DRIVE.  TOYOTA OF CARLSBAD COULDN'T REPRODUCE THE EVENT AFTER A FEW TRIES ON  A TEST DRIVE, SO THEY WILL NOT DO ANYTHING ABOUT IT. I AM CONCERNED ABOUT HAVING A FATAL ACCIDENT  WHILE DRIVING ON THE FREEWAY.  THE EVENTS HAPPEN RANDOMLY.",
        "vin": "JTDKDTB37G1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052136,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A SMALL CHIP IN FRONT WINDSHIELD AND DEVELOP A LARGE CRACK QUICKLY",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/02/2017",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051896,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON START UP THIS TOYOTA PRIUS VEHICLE EMITS FOUL SMELLING CHEMICAL AIR INTO THE CABIN OF THE VEHICLE.  IT IS UNKNOWN HOW TOXIC THESE SMELLS ARE BUT AGGRAVATE RESPIRATORY CONDITIONS AND ASTHMATIC CONDITIONS.  TOYOTA ACKNOWLEDGES THAT THEY HAVE A SERVICE BULLETIN WITH \"THOUSANDS\" OF COMPLAINTS FROM CONSUMERS REPORTING NOXIOUS AIR BEING EMITTED INTO THE CABIN OF THE VEHICLE.  HOWEVER THEY ARE REQUIRING CONSUMERS TO PAY FOR FIXES, EVEN IF THE CONSUMER HAS A FULL WARRANTY FOR MANUFACTURER DEFECTS.  THIS VEHICLE ONLY HAS ABOUT 9.2K MILES ON IT (2016) AND IS GETTING WORSE.      THE PROBLEM ALWAYS HAPPENS ON VEHICLE START UP WHEN AT REST, ESPECIALLY IN WARM AMBIENT CONDITIONS.  THE AC WILL BE FOUL AND NOXIOUS.  IN COLD TEMPERATURES THE FIRST FEW MINUTES OF HEATING WILL ALSO EMIT FOUL AND NOXIOUS ODORS.    SERVICE LINE AT DEALERSHIP ACKNOWLEDGE THESE COMPLAINTS ARE HERE BUT WILL NOT EFFECT REPAIRS UNDER DIRECTION OF TOYOTA CORPORATE.  ALL REPAIRS FOR MANUFACTURING DEFECT FOR TOXIC AIR HAVE TO BE PAID FOR BY THE CUSTOMER.      S",
        "vin": "JTDKARFUXG3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/25/2017",
        "dateOfIncident": "09/24/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048391,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONARY SITTING IN DRIVEWAY. FIRST CRACK STARTED AND CONTINUES TO SPREAD. SECOND CRACK STARTED 3 WEEKS AFTER THE FIRST. WINDSHIELD REPLACEMENT SUPPOSEDLY ON BACKORDER. THE CAR IS TYPICALLY PARKED IN A PARKING GARAGE DURING THE WORKWEEK AND EITHER IN MY DRIVEWAY OR GARAGE. THE CAR IS NOT EVEN 2 YEARS OLD. TO REPLACE WINDSHIELD ALSO MEANS HAVING TO RECALIBRATE FOR SIDE AND BACK UP MIRRORS TO FUNCTION PROPERLY WHICH IS JUST AS COSTLY AS HAVING TO PAY FOR THE WINDSHIELD.",
        "vin": "JTDKARFUXG3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "11/11/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047972,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS EQUIPPED WITH YOKOHAMA BLUEARTH S34 TIRES, SIZE: P215/45R/17 (NA). WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE SUDDENLY BECAME UNSTABLE AND A THUMPING NOISE WAS PRESENT COMING FROM THE REAR END. AFTER STOPPING THE VEHICLE AND INSPECTING IT, THE CONTACT DISCOVERED THAT THE REAR DRIVER SIDE TIRE WAS FLAT. AFTER REMOVING THE TIRE, IT WAS DISCOVERED THAT THE SIDEWALL BLEW OUT INSIDE THE TIRE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE TIRE AND VEHICLE MANUFACTURER WERE BOTH NOTIFIED ALONG WITH THE LOCAL TIRE DEALER (LES SWAUB AND GOODYEAR). THE VIN AND DOT NUMBER WERE UNKNOWN. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 15,900.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/12/2017",
        "dateOfIncident": "09/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045494,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION ON A HIGHWAY AT 65 MPH THE DRIVER'S SIDE FRONT WINDOW SHATTERED. MOST OF THE PIECES OF THE GLASS FELL ONTO THE DRIVER'S LAP, BUT PIECES ALSO LANDED ON THE PASSENGER'S SIDE AND IN THE BACK SEAT BEHIND THE DRIVER. IT IS UNKNOWN WHY THE GLASS SHATTERED. NO OBJECT WAS FOUND IN THE CAR THAT COULD HAVE SHATTERED IT.",
        "vin": "JTDZN3EU0GJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042841,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING WITH A HEAVY LOAD IN THE BACK OR WITH LARGE ADULTS IN THE BACK SEAT IT CAUSES THE HEADLIGHTS TO POINT UPWARD BLINDING ON COMING CARS. YES YOU CAN MANUALLY LOWER THE LIGHTS VIA THE SCREW UNDER THE HOOD BUT THAT'S AN INCONVENIENCE AS I WILL NOT BE ABLE TO SEE FURTHER DOWN THE ROAD. SOMETIMES THE HEADLIGHT BLINDS ONCOMING CARS EVEN WITHOUT A HEAVY LOAD CAUSING ONCOMING CARS TO FLASH ME AND I HAVE TO FLASH THEM BACK TO PROVE TO THEM I HAVE MY LOWS ON. AT TIMES WHEN I GET TOO MANY FLASHES I END UP DRIVING WITH JUST THE DIM DAY RUNNING LIGHTS TO MAKE SURE I DON'T BLIND ONCOMING CARS CAUSING ME TO COMPROMISE MY NIGHT DRIVING SAFETY. TOYOTA SHOULD PROVIDE AUTO LEVELING HEADLIGHTS LIGHTS OR A FIRMER SUSPENSION TO ENSURE THE LEVEL OF THE HEAD LIGHT IS POINTING WHERE IT SHOULD BE.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/30/2017",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041440,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE AUXILIARY BATTERY WELL CHARGED THE GAS ENGINE WILL TURN OFF WHEN VEHICLE COMES TO A STOP.  IN ORDER TO TURN THE IGNITION KEY TO THE OFF POSITION AND REMOVE THE KEY IT IS NECESSARY TO MOVE THE SHIFT LEVER TO THE PARK POSITION.  AT THE SAME TIME IT IS ADVISABLE TO SET THE PARKING BRAKE.  IF DISTRACTED IT IS POSSIBLE TO OPEN THE DOOR AND LEAVE THE VEHICLE WITH THE ELECTRIC ENGINE STILL RUNNING. THERE IS NO ENGINE NOISE AT ALL. THERE IS NO SIGNAL, AUDIO OR LIGHT, TO INDICATE THE ENGINE IS STILL RUNNING.  I HAVE HAD THIS OCCUR ON TWO OCCASIONS, ONCE DURING DAYTIME, WITH MY SON ACCOMPANYING ME, 09/07/2017, THE SECOND TIMEL  ALONE, WHEN PARKING THE CAR IN MY GARAGE AT NIGHT, 09/13/2017.   ON RETURN TO THE CAR, WITH MY SON, I SEARCH FOR MY KEYS AND FOUND THE CAR'S GAS ENGINE RUNNING, EMITTING THE NORMAL ENGINE NOISE, THE KEY NOT HAVING BEEN REMOVED AFTER PARKING.  WHEN TURNING OFF AND REMOVING THE KEY FROM THE IGNITION, INSIDE LIGHTS AND DRIVE LIGHTS CONTINUE TO BE ON UNTIL THE DOOR IS CLOSED, AT WHICH TIME THE LIGHTS, INSIDE AND OUT, GO OFF AFTER A BRIEF PERIOD OF TIME.  THE THREE ACTIONS, MOVING THE SHIFT LEVER, SETTING THE PARKING BRAKE AND TURNING OFF THE IGNITION ALL REQUIRE USE OF THE RIGHT HAND, WITH THE MOVING OF THE SHIFT LEVER BEING MANDETORY.  WITH NO AUDIBLE ENGINE NOISE IT IS EASY TO OVERLOOK THE FACT THAT THE ENGINE IS STILL RUNNING.  AN AUDIBLE BEEP OR FLASHING LIGHT WOULD ALERT THE DRIVER TO THE FACT THAT SOMETHING IS AMISS.  OF COURSE AN UNLOCKED PARKED CAR WITH ENGINE RUNNING IS ALSO AN INVITATION TO CAR THEFT. THE CAR'S DOORS CANNOT BE LOCKED WITH THE KEY IN THE IGNITION, BUT THERE IS NO INDICATION THAT THE DOORS HAVE NOT LOCKED WITHOUT TESTING THE DOORS FROM THE OUTSIDE.  NOT HAVING SUCCESSFULLY LOCKED THE DOORS CAN ALSO BE EASILY OVERLOOKED BY A DISTRACTED DRIVER.",
        "vin": "JTDKDTB36G1"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033430,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD VERY SMALL WINDSHIELD CRACK WHILE I WAS DRIVING ON 10 FRWY COVINA CA , I DIDN'T NOTICE ANYTHING HIT MY WINDSHIELD WAS VERY HOT DAY JUST HEARD TING AND I SHAW CRACK BUT WITHIN A DAY WAS VERY LONG ABOUT 2FT CRACK .I TOOK LONGO TOYOTA AT EL-MONTE THEY SAID IT DON'T COVER BY DEALER OR TOYOTA COMPANY SO THEY GIVE ME $1265 EST. COST TO FIX IT.IT WAS MY 2016 TOYOTA PRIUS MILES 17K ONLY AND UNDER FACTORY WARRANTY    ANOTHER PROBLEM WITH 2016 PRIUS IS BODY COLOR POPUP SO EASY IT JUST COMEUP SO SO EASY LOOK LIKE THEY JUST PAINT SO EASY ... I HAVE SO BAD EXPERIENCE WITH PRIUS CAR FEEL LIKE I JUST WAST MY 30K FOR JUST PIECE OF [XXX]  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JTDKBRFU3G3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031356,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "TOYO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "AT HIGHWAY SPEED TIRE TREAD SEPARATED COMPLETELY FROM SIDEWALL ON BOTH SIDES OF RIGHT REAR TIRE. VEHICLE: 2016 TOYOTA PRIUS TWO ECO.  TIRES - MANUFACTURER: TOYO - MODEL: NANOENERGY A29 - DOT CODE: N39N SIZE:195/6515 TIRE - DATE OF MANUFACTURE: 1216 (DECEMBER 2016)",
        "vin": "JTDKARFU8G3"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/23/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025200,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A VERY SMALL PEBBLE HIT MY WINDSHIELD WHILE DRIVING SLOWLY ON A RESIDENTIAL STREET. THE INITIAL IMPACT CAUSED SEVERAL SIGNIFICANT CRACKS RUNNING LENGTHWISE AND WIDTHWISE ACROSS MY WINDSHIELD INSTEAD OF JUST STARING OR PITTING AS TRADITIONALLY OCCURS. THIS IS MY THIRD PRIUS AND I HAVE NEVER EXPERIENCED A WINDSHIELD RESPONDING THIS WAY. IT APPEARS ONLINE THAT THIS HAS BECOME A VERY COMMON PROBLEM AND IT IS EXTREMELY COSTLY SINCE THEY CURRENTLY DO NOT HAVE AN AFTERMARKET AVAILABLE. AS WELL AS REQUIRING $600+ RECALIBRATION. I AM EXTREMELY DISAPPOINTED IN TOYOTA.    I AM CONCERNED THAT I AM GOING TO PAY $1500 TO GET THIS FIXED (SINCE MY INSURANCE USES MY DEDUCTABLE) ONLY FOR IT TO BREAK AGAIN DUE TO A MINOR INSTANCE (AS MANY HAVE COMPLAINED ONLINE). MY UNDERSTANDING IS THAT THE NEW WINDSHIELD IS THINNER/ LIGHTER FOR MPG. IS THIS NOT COVERED ON SOME SORT OF WARRANTY OR RECALL? I'M VERY UPSET THAT THIS HAS OCCURRED AND HAVE ALWAYS BEEN EXTREMELY LOYAL TO TOYOTA, IM AT A POINT WHERE I JUST WANT TO DRIVE WITH IT CRACKED TO AVID HAVING TO FIX FUTURE CRACKED WINDSHIELDS.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024473,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA PRIUS. CONSUMER WRITES IN REGARDS TO CONCERNS ABOUT FRONT END BUMPER BEING EXTREMELY LOW TO THE GROUND.*LD    THE CONSUMER REQUESTED TO BE ADVISED ON THE LEGAL SPECIFICATIONS FOR THE DISTANCE BETWEEN THE GROUND AND THE BUMPER AND ENGINE OF THE VEHICLE. UPDATED 09/20/2017*JS",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/15/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023695,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ON THE HIGHWAY AND A SMALL ROCK HIT MY WINDSHIELD.  WITHIN MINUTES, A 6 INCH CRACK HAD DEVELOPED.  BY THE TIME I ARRIVED AT WORK (ABOUT 15 MINUTES LATER), THE CRACK HAS EXTENDED TO OVER A FOOT.  I CALLED A LOCAL TOYOTA DEALERSHIP AND ASKED IF ANY KNOWN DEFECTS EXISTED.  I WAS TOLD NO RECALLS EXISTS FOR MY WINDSHIELD.  SPOKE WITH MY INSURANCE AGENT AND REFERRED TO SAFELITE AUTOGLASS FOR REPLACEMENT, SINCE IT COULD NOT BE REPAIRED.  THE NEXT MORNING, I DROVE CAR TO WORK AGAIN AND NOTICED CRACK HAS PROGRESS A FEW MORE INCHES OVERNIGHT.  BY THE TIME I LEFT WORK, THE LATERAL EXTENDING CRACK HAS NOW STARTED EXTENDING TOWARDS THE MIDDLE OF THE WINDSHIELD, FORMED A JAGGED C-SHAPE.  VISIBILITY WAS NOW LIMITED FROM THE CRACK AND FROM THE GLARE FROM THE SUNLIGHT REFLECTING OFF THE CRACKS.  I CALLED SAFELITE AND WAS TOLD THAT THE ONLY REPLACEMENT WINDSHIELD WAS AN TOYOTA OEM, BUT THAT IT WAS ON BACKORDER FOR ANOTHER 3 WEEKS AND AT A COST OF ALMOST $800.  FEARING ANOTHER POTENTIALLY DANGEROUS DRIVING CONDITION, I DID NOT ATTEMPT TO DRIVE MY CAR UNTIL THE WINDSHIELD WAS REPLACED.  TODAY, I WAS READING PRIUSCHAT WEBSITE AND FOUND THAT MY CASE IS CERTAINLY NOT AN ISOLATED INCIDENT.  I AM CONCERNED NOW THAT SINCE I REPLACED MY WINDSHIELD WITH AN TOYOTA OEM PART, I AM AGAIN SUBJECTED TO REPEAT DANGER VEHICLE CONDITION AND ADDITIONAL HIGH COST OF REPLACEMENT.",
        "vin": "JTDKBRFU9G3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/13/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023401,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER T-SB-0144-16.  ALOT OF 2016 TOYOTA PRIUS OWNERS ARE COMPLAINING A CLICK NOISE FROM REAR OF VEHICLE WHILE DRIVING.  I CONFIRMED THROUGH  PRIUS CHAT UNDER TECHNICAL SERVICE BULLETIN 0144-16 THAT CLICKING NOISE IS FROM THE SUPPORT NUTS ON THE REAR SHOCKS. I ATTEMPTED TO HAVE IT FIX AS A RECALL. THE TOYOTA SERVICE REPAIR IN SAN BRUNO CALIFORNIA SAID MY BASIC WARRANTY EXPIRED & THEY REFUSED TO FIX IT EVEN THOUGH THE ISSUE IS A POTENTIAL SAFETY-RELATED DEFECTS AND THERE ARE ADEQUACY OF EXISTING SAFETY COMPLAINT WITH MANY PRIUS CUSTOMERS VIA PRIUS CHAT/TSB.",
        "vin": "JTDKBRFU4G3"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BREAKING WHILE TRAVELING OVER BUMPS/RIPPLES ON THE ROAD OR OVER ROUGH ROAD CONDITIONS SUCH AS POTHOLES OR ROADWORK, THE VEHICLE FEELS AS THOUGH THE BREAKS ARE SKIPPING OR FAILING. THIS HAS OCCURRED MULTIPLE TIMES UNDER THE SAME OR SIMILAR CONDITIONS. THERE IS A SENSATION WHILE ATTEMPTING TO STOP, THAT THE CAR IS NOT GOING TO STOP IN TIME OR THAT YOU HAVE LOST CONTROL OF THE VEHICLE'S ABILITY TO STOP SAFELY.",
        "vin": "JTDKARFU0G3"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "09/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015398,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2016 TOYOTA PRIUS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V672000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER ROBERTS TOYOTA (LOCATED AT 1027 NASHVILLE HWY, COLUMBIA, TN 38401; (931) 388-3006) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JTDKARFUXG3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015554,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CHIPPED EASILY AND DEVELOPED INTO VERY LONG CRACK AFTER SHORT PERIOD OF TIME. POSSIBLE SOURCE OF INITIAL CRACK WAS UNSEEN PEBBLE/DEBRIS THAT HIT THE WINDSHIELD DURING FREEWAY DRIVING. REPLACEMENT CLAIMED THROUGH AUTO INSURANCE. THE RAPID AND GREAT INCREASE IN LENGTH OF CRACK IS VERY CONCERNING. MATERIAL DURABILITY MAY BE IN QUESTION.",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "08/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013915,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-40W WHEN I GOT A ROCK CHIP ON MY WIND SHIELD. THE NEXT DAY WHILE DRIVING I NOTICED A CRACK IN MY WINDSHIELD, NOT ASSOCIATED WITH THE ROCK CHIP,  STARTING ON THE LEFT BOTTOM OF THE WINDSHIELD AND CURVING UP TO THE RIGHT FOR ABOUT 6\". THIS CRACK KEPT PROGRESSING DAILY AND NOW EXTENDS APPROX. 3/4 OF THE WAY ACROSS THE WINDSHIELD. THE WINDSHIELD FOR MY CAR IS ON NATIONAL BACKORDER WITHOUT ANY IDEA AS TO HOW LONG IT WILL TAKE TO GET IT IN.I WENT ONLINE AND IT APPEARS FROM THE NUMBER OF PEOPLE DISCUSSING IT,  IT APPEARS TO BE WIDESPREAD AND PROBABLY THE REASON FOR THE BACK ORDER. WITH THE NUMBER OF COMPLAINTS I'VE BREADTHS SHOULD BE A RECALL. AS A SIDE NOTE WHENEVER MY CAR'S VIN # IS RUN IT COMES UP AS A 2016 TOYOTA PRIUS C NOT A 2016 PRIUS FOUR TOURING. THE TECH AT THE AUTO GLASS SHOP TOLD ME THAT THIS HAS BEEN A RECURRING PROBLEM.",
        "vin": "JTDKARFU7G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/01/2017",
        "dateOfIncident": "07/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011994,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN TOWED TWICE.  EVERY TIME I ATTEMPT TO TURN ON THE CAR, THERE IS NO POWER. THE DEALER SAYS IT IS THE BATTERY AND HE HAS CHANGED THE BATTERY TWICE. I AM AFRAID TO USE THE CAR AND GET STRANDED IN THE HIGHWAY.",
        "vin": "JTDKDTB3XG1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "05/09/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006174,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OEM WINDSHIELDS THAT ARE INSTALLED ON NEW 2016 PRIUS 2 MODELS ARE CLEARLY NOT TO STANDARD. I HAVE A HUGE CRACK ACROSS MY WINDSHIELD FROM A VERY TINY PEBBLE WHILE TRAVELING AT 12 MPH. WHAT THE HECK TOYOTA??? I WAS TRAVELING ON THE 101 SOUTHBOUND IN LA IN A MERGING LANE MOVING AT A PACE THAT JOGGERS COULD KEEP UP WITH WHEN A STRAY PEBBLE CRACKED MY ENTIRE GLASS.",
        "vin": "JTDKBRFU8G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "06/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005840,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING APPROXIMATELY 60 MPH ON THE FREEWAY, A VERY SMALL ROCK HIT MY WINDSHIELD AND CREATED A CRACK THAT WAS ABOUT 1 INCH BY 1 INCH IN SIZE. MERELY TWO DAYS LATER, I WOKE UP TO FIND THE CRACK HAD EXTENDED 3/4 OF THE WAY ACROSS MY ENTIRE WINDSHIELD AND COMPLETELY UP AND DOWN THE ENTIRE HEIGHT OF THE WINDSHIELD - JUST OUT OF THE BLUE, OVERNIGHT. IT'S NOW DIFFICULT TO PROPERLY SEE OUT OF THE WINDSHIELD AS ONE OF THE CRACKS RUNS RIGHT IN MY LINE OF VISION WITH THE ROAD. FOR SOMETHING SO MINOR TO CREATE SUCH A MAJOR EFFECT ON MY CAR THAT IS NOT QUITE 14 MONTHS OLD IS QUITE DISTURBING.",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/10/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004172,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).    IN EARLY JUNE I WALKED OUT FROM A BOOKSTORE IN OCEANSIDE, CA TO FIND MY WINDSHIELD, ON MY PARKED/STATIONARY PRIUS, HAD ABOUT AN 8 TO 10 INCH CRACK ON THE PASSENGER SIDE. I FILED AN INSURANCE CLAIM WITH AAA AND FOUND THAT WHEN I ATTEMPTED TO USE TWO DIFFERENT VENDORS FOR REPAIR AS WELL AS THE CARLSBAD, CA DEALERSHIP, EACH ONE CONVEYED TO ME THAT THERE IS A NATIONAL SHORTAGE ON PRIUS WINDSHIELDS.  THE CRACK HAS EXPANDED ON ITS OWN AT THIS TIME, MAKING THE CAR UNSAFE TO DRIVE.  IT IS ALMOST ACROSS THE ENTIRE WINDSHIELD.  I'M RENTING A CAR, BUT MY RENTAL WILL EXPIRE ON JULY 20TH.  IF I RENEW THE RENTAL, IT WILL BE AT MY EXPENSE.  ACCORDING TO THE CARLSBAD TOYOTA DEALERSHIP, THE REPLACEMENT WINDSHIELD WILL NOT BE AVAILABLE UNTIL AUGUST 8TH WHICH IS NEARLY A MONTH AWAY FROM NOW.  THE CLAIM WAS REPORTED IN EARLY JUNE. DUE TO THIS IMMENSE AMOUNT OF INCONVENIENCE CAUSED BY THIS NATIONAL SHORTAGE, I WOULD APPRECIATE IT IF TOYOTA CORPORATION WOULD TAKE RESPONSIBILITY AND PAY FOR MY RENTAL CAR UNTIL THIS ISSUE IS RESOLVED--STARTING JULY 21ST.  FINALLY, PERHAPS THERE NEEDS TO BE A RECALL. YOU CAN E-MAIL ME AT [XXX] AND/OR [XXX].  THANK YOU. *DL",
        "vin": "JTDKARFU7G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002721,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2 MONTHS AFTER GETTING THE PRIUS, I WAS DRIVING ABOUT 50 MPH ON A ELEVATED, SINGLE-LANE HIGHWAY OVERPASS WITH NO CARS IN FRONT OF ME WHEN I HEARD A CRACK AND NOTICED A CHIP IN THE WINDSHIELD ON THE PASSENGER SIDE.  I HAD IT REPAIRED THAT DAY, BUT IT STILL SHOWS UP.  IT HAS NOT CHANGED SINCE THEN.    8 MONTHS LATER, I WAS DRIVING AT AROUND 50 MPH ON A HIGHWAY AND SAW A MAN IN A PICKUP TRUCK THROW HIS ARM OUT OF HIS OPEN WINDOW, LIKE HE WAS TOSSING SOMETHING.  ALMOST INSTANTLY I HEARD A CRACK AND THERE WAS ALREADY A CRACK A FEW INCHES HIGH, FROM THE BOTTOM OF THE WINDSHIELD, ON THE LOWER-LEFT OF THE DRIVERS SIDE OF THE WINDSHIELD.  I TOOK A PICTURE OF THE TRUCK WITH THE LICENSE PLATE, JUST IN CASE IT MIGHT HELP.  WHEN I HAD GOTTEN TO MY DESTINATION, I CHECKED THE CRACK AND WHERE IT LOOKED LIKE IT HAD STARTED, FROM A SMALL CHIP NEAR THE BOTTOM EDGE OF THE WINDSHIELD.  BY NOW, THE CRACK HAD EXTENDED SEVERAL MORE INCHES.  I THEN CALLED MY INSURANCE TO MAKE A CLAIM.  THAT WAS 3 WEEKS AGO AND I HAVE NOT BEEN ABLE TO GET A REPLACEMENT AS I WAS TOLD THAT THERE IS A NATIONAL BACK ORDER ON PRIUS 2016 WINDSHIELDS.    THE FIRST INCLUDED PHOTO WAS TAKEN RIGHT AFTER THE CRACK APPEARED.  THE SECOND PHOTO, ALTHOUGH A LITTLE OUT OF FOCUS, HAS A SMALL WHITE CIRCLE, WHICH IS WHERE IT LOOKED LIKE THE UNKNOWN OBJECT STRUCK THE WINDSHIELD.",
        "vin": "JTDKARU6G35"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/28/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001953,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 PRIUS 2 SEDAN WINDSHIELD WAS STRUCK BY A SMALL ROCK CAST LATERALLY ACROSS THE FREEWAY FROM SEVERAL LANES TO MY RIGHT, AS ONE WOULD SKIP A STONE ACROSS WATER, TRAVELING ABOUT 55MPH. UNFORESEEABLE, UNAVOIDABLE ACT OF CHANCE, KICKED UP BY ANOTHER CAR'S TIRE. INITIAL DAMAGE (SEE PHOTO SERIES) WAS TWO UNSIGHTLY BUT REPAIRABLE CRATERS IN THE OUTER LAYER OF GLASS. WITHIN MINUTES / BEFORE AN EPOXY REPAIR WAS POSSIBLE, TWO CRACKS GREW AT AN ALARMING RATE. A SMALLER CRACK WENT VERTICALLY, AND A FAST AND LARGE CRACK RAN HORIZONTALLY. WITHIN A DAY IT SPANNED THE ENTIRE DRIVER'S SIDE. THE CRACK REFLECTS AND REFRACTS LIGHT INTO THE DRIVER'S EYES, AND IS THICK ENOUGH TO OBSTRUCT VISION EVEN IN DIM LIGHT. OUR PRIMARY TRAVEL IS EAST IN THE MORNING AND WEST AT NIGHT, SO THE OBSTRUCTION OF VISION IS AN ACTIVE DANGER AS WE ARE TYPICALLY ORIENTED ON THE SUN.  I WAS ADVISED BY THREE DIFFERENT GLASS SERVICES THAT NOT ONLY IS THERE NO AFTERMARKET WINDSHIELD AVAILABLE, BUT THAT THERE WAS AN UNKNOWN WAIT TIME TO RECEIVE ONE FROM THE ONLY AVAILABLE SOURCE, TOYOTA. THERE IS NO INTEGRATED TECHNOLOGY AND I WAS QUOTED REPLACEMENT COSTS OF $800-$900, NOT COVERED BY INSURANCE.     I HAVE REVIEWED THE FORUMS, NHTSA SITE, AND A PROMINENT COMPLAINT SITE, AND EXCESSIVE CRACKING APPEARS TO BE A FREQUENT FLAW, BOTH FROM DEBRIS IMPACTS AND WHEN OWNERS REPORT \"SPONTANEOUS\" CRACKING.  OUR GLASS SHOPS STATED THEY SAW THIS PROBLEM MORE FREQUENTLY ON TOYOTAS THAN ON ANY OTHER CAR. GIVEN THE COST AND FREQUENCY THIS PROBLEM IS REPORTED, I AM HESITANT TO REPLACE THE WINDSHIELD UNTIL I GET A REASONABLE RESPONSE FROM THE DEALER, AS IT OTHERWISE SEEMS LIKELY TO RECUR. THIS IS NOT A ONE-OFF PROBLEM. DEALER WON'T RETURN CALLS. GLASS SERVICE STILL HAS NO ETA ON REPLACEMENTS.     WE WOULD LIKE TO UNDERSTAND WHY THIS PROBLEM IS SO COMMON. THANK YOU.",
        "vin": "JTDKBRFU2G3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "06/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993174,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. THE CONTACT STATED THAT WHILE DRIVING AT ANY SPEED, THE PLASTIC RIDGE ON THE CENTER CONSOLE CAUGHT THE DRIVER'S SHOE AND CAUSED THE ACCELERATOR PEDAL TO STICK TO THE FLOORBOARD OF THE VEHICLE WHEN THE DRIVER ATTEMPTED TO RELEASE THE ACCELERATOR PEDAL. THE CONTACT CALLED THE FITZGERALD TOYOTA DEALER IN GAITHERSBURG, MD AND WAS ADVISED TO CONTACT THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT BACK TO THE DEALER FOR INVESTIGATION. THE FAILURE MILEAGE WAS 7,700. THE VIN WAS NOT PROVIDED.",
        "vin": "JTDKARFU7G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2017",
        "dateOfIncident": "06/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993049,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD IS CONSTANTLY GETTING HIT WITH PEBBLES AND NOW HAVE TWO LARGE CRACKS IN MY WINDSHIELD. I AM NOT DRIVING ANY DIFFERENTLY THAN I HAVE SINCE I HAVE OWNED CARS AND I AM NOT SURE WHAT THE PROBLEM IS. IT MIGHT BE A DESIGN PROBLEM OR THE WINDSHIELD IS NOT STRONG ENOUGH TO TAKE THE FORCE OF A TINY PEBBLE.",
        "vin": "JTDKBRFU1G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "05/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992232,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED WINDSHIELD.     NEW MODEL VEHICLE W 10000 MILES WINDSHIELD CRACKED FROM AN IMPACT OF A SMALL ROCK OR OTHER ON THE HIGHWAY.  NEVER HAD THIS HAPPEN, 30+ YEARS DRIVING. VERY THIN AND FRAGILE GLASS AND COMPLICATED EXPENSIVE ELECTRONIC SENSORS WILL REQUIRE 2 REPAIR SHOPS, 7 OR MORE COMBINED HOURS, AND MANY DOLLARS FOR THE REPAIR.     TOYOTA DOES NOT COVER THE REPAIR, ALTHOUGH MY CAR IS UNDER WARRANTY AND I HAVE PURCHASED A TOYOTACARE PLUS PREPAID PRENIUM MAINENTANCE PLAN.  AAARGH!!  FRUSTRATED CUSTOMER!    IS TOYOTA GOING TO ISSUE A RECALL ON THESE LOUSY WINDSHIELDS?",
        "vin": "JTDKARFU2G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "01/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990501,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK DELIVERY OF MY 2016 PRIUS IN JANUARY 2016.   AT HE TIME OF DELIVERY, THE SPEEDOMETER DISPLAYED MPH, HOWEVER THE OWNER'S MANUAL INDICATED THIS COULD BE CHANGED TO KPH VIA A SIMPLE USER INTERFACE ON THE DASHBOARD.    I HAVE SINCE LEARNED THAT SUCH A CHANGE IS NOT POSSIBLE FOR MY CAR, AS IT WAS MANUFACTURED EARLY IN THE 2016 MODEL YEAR PRODUCTION RUN.    THE INABILITY TO ADJUST FROM MPH TO KPH MAKES IT DIFFICULT OR IMPOSSIBLE TO CORRECTLY  FOLLOW THE POSTED SPEED LIMITS WHEN I VISIT CANADA.       THIS REPRESENTS A SAFETY ISSUE WHICH SHOULD BE REMEDIED.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/17/2017",
        "dateOfIncident": "05/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986268,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DOES NOT REPORT SPEED IN KPH, ONLY IN MPH. THIS MEANS THAT EVERY TIME I CROSS INTO CANADA WITH THIS VEHICLE, I HAVE DIFFICULTY DISCERNING WHETHER I AM FOLLOWING ALL VEHICLE SAFETY AND TRAFFIC LAWS OR MAINTAINING A SAFE SPEED.     TO REPEAT, WHILE EVERY OTHER VEHICLE I HAVE EVER OWNED HAS A SPEEDOMETER THAT READS IN BOTH ENGLISH AND METRIC UNITS, THIS VEHICLE DOES NOT. IT REPORTS SPEED IN MPH *ONLY*. THIS IS FINE IN THE UNITED STATES, BUT EVERY TIME I CROSS INTO CANADA I'M LEFT GUESSING.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985954,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A STONE STRIKE CAUSED A CRACK IN THE WINDSHIELD. REPLACED IT AND SOON AFTER WE HAD SOME HAIL WHICH PITTED THE NEW WINDSHIELD AS WELL AS CAUSED A HUGE CRACK.  ANOTHER PEBBLE STRIKE CAUSED ANOTHER IMMEDIATE LONG CRACK.  ALL THESE HAPPENED WHILE DRIVING. THERE HAVE BEEN A TOTAL OF MORE THAN 4 CRACKS ON THIS VEHICLE WHICH WE HAVE HAD A TOTAL OF 12 MONTHS.  WE HAVE NEVER HAD THIS KIND OF PROBLEM BEFORE.",
        "vin": "JTDKBRFU3G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985691,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD CRACKED WITHIN 3 DAYS OF PURCHASING THE CAR AS BRAND NEW. I DIDN'T HEAR A ROCK HITTING IT AND I CAN'T SEE AN IMPACT PATTERN. I WOKE UP ONE MORNING AND THE CRACK WAS OVER A FOOT AND IT SPREAD FROM THERE INTO MULTIPLE CRACKS. THERE WAS NO CHANCE TO GET THE WINDSHIELD REPAIRED AT ALL AND IT NEEDED TO BE REPLACED BUT I DON'T HAVE THE 1300 DOLLARS THAT THE DEALER IS SAYING IT TAKES TO GET IT REPLACED AND THEY CLAIM IT WAS A ROCK AND NOT A DEFECT WHICH I'M DISPUTING.",
        "vin": "JTDKBRFU2G3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983378,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RODENTS WERE ATTRACTED TO THE SOY-BASED WIRING USED BY TOYOTA AND CAUSED EXPENSIVE DAMAGE BY CHEWING WIRES. TOYOTA HAS HAD PROBLEMS WITH THIS WIRING AND RODENT DAMAGE FOR 4 YEARS AND I WAS UNAWARE OF THIS WHEN I BOUGHT THE VEHICLE. THEY REFUSE TO PAY FOR MY DAMAGE AND ALSO REFUSE TO REPLACE THE WIRING WITH NON-SOY WIRING, WHICH MEANS IT COULD EASILY HAPPEN AGAIN. MANY OTHER CUSTOMERS, I DISCOVER, HAVE REPORTED RODENT DAMAGE TO WIRING BECAUSE OF THE SOY-BASED MATERIAL.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978856,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR'S WINDSHIELD SEEMS TO BE SOFTER THAN PREVIOUS MODELS.  I HAD THE WINDSHIELD COMPLETELY REPLACED A FEW MONTHS AGO, AFTER A FAILED REPAIR OF A LARGE CHIP.  A CHIP REPAIR WAS DONE ON THE NEW WINDSHIELD ON APRIL 7TH.  IN THE CAR WASH LAST FRIDAY, I NOTICED SEVERAL SMALL CHIPS IN THE WINDSHIELD.  MY HUSBAND DRIVES A 2016 TOYOTA HIGHLANDER.  HIS WINDSHIELD WAS ALSO REPLACED EARLY THIS YEAR.  HE NOW HAS A SIZEABLE CHIP IN THE NEW WINDSHIELD.  IT SEEMS THAT THERE IS A PROBLEM WITH 2016 TOYOTA WINDSHIELDS, NOT JUST IN THE PRIUS, BUT IN OTHER MODELS AS WELL.",
        "vin": "JTDKARFUXG3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971170,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 3 FT. LONG CRACK IN MY WINDSHIELD THAT OCCURRED APPROXIMATELY A MONTH AND A WEEK AGO. IT HAS BECOME A SAFETY RISK TO DRIVE AS THE CRACK REFLECTS SUNLIGHT IN MY EYES WHEN DRIVING DURING THE DAY, OR AT THE END OF THE WORK DAY DURING SUNSET. TOYOTA IS UNABLE TO PROVIDE A WINDSHIELD REPLACEMENT.",
        "vin": "JTDKARFU8G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "04/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970999,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS V",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CITY STREETS AT A MAXIMUM SPEED OF 55,ON SUNDAY 4/2/17, MY WINDSHIELD MUST HAVE BEEN HIT BY A SMALL STONE.  I DID NOT NOTICE WHEN IT HAPPENED. ON MONDAY, 4/3/16,  I NOTICED A SMALL MARK ON THE WINDSHIELD WHICH I MISTOOK FOR A BUG.  I LATER NOTICED A SMALL LINE COMING FROM THE \"BUG\" WHICH I MISTOOK FOR FLUID.  BY TUESDAY, 4/4/17, THERE WERE \"LINES\" IN BOTH DIRECTIONS AND I REALIZED THAT I HAD A CRACKED WINDSHIELD.  BY WEDNESDAY, THE CRACK WAS 16\" IN LENGTH. I TOOK MY CAR TO TOYOTA SERVICE AND WAS TOLD THAT THEY WERE NOT RESPONSIBLE UNDER WARRANTY; THIS IS SOMETHING THAT WAS CAUSED BY \"IMPACT\". THE CAR HAS 8400 MILES ON IT.  MY CONCERN IS WITH THE QUALITY OF THAT WINDSHIELD.  IF A SMALL PEBBLE CAN CAUSE THAT MUCH DAMAGE, IT SEEMS TO ME THAT THIS IS AN INFERIOR PRODUCT.   I HAVE DRIVEN FOR 49 YRS IN  DIFFERENT CLIMATES, THROUGH BLIZZARDS, HAILSTORMS, AND HAD FLYING DEBRIS HIT MY WINDSHIELDS.  I HAVE HAD FENDER BENDERS AND BEEN REAR-ENDED.  NEVER HAVE I HAD A BROKEN WINDSHIELD.  A WINDSHIELD THAT IS THIS DELICATE IS A SAFETY ISSUE.  IT SEEMS TO ME, THAT IN THIS WORLD OF PROFIT-DRIVEN CHOICES, THAT THE WINDSHIELDS ARE BEING MADE CHEAPER, AND THEREFORE LESS EFFECTIVE IN TERMS OF PROTECTION. I WONDER WHAT WOULD HAVE HAPPENED IF IT WERE MORE THAN A PEBBLE THAT FLEW AT MY CAR.  IN CA, IT IS ILLEGAL TO DRIVE WITH A CRACKED WINDSHIELD.  SO NOW I AM IN THE PREDICAMENT OF GETTING THIS FIXED IMMEDIATELY. HANDILY FOR TOYOTA, THEY WON'T REPLACE IT GRATIS, SO IT IS A NICE $1,300.00 REPAIR JOB FOR THEM.  THEY PLEASANTLY ADVISED ME THAT MY INSURANCE WOULD COVER THE $800.00 OVERAGE OF MY $500 DEDUCTIBLE. WITH THE ISSUE AT HAND BEING MY SAFETY AND COMPLIANCE WITH THE LAW, I HAVE LITTLE CHOICE.  CHEAP WINDSHIELDS MUST CREATE A REGULAR BASE OF REPAIR WORK FOR ALL THE AUTOMAKERS WHO USE THIS PARTICULAR AUTO GLASS. THIS SHOULD BE SERIOUSLY CONSIDERED IN TERMS OF VEHICLE SAFETY.",
        "vin": "JTDZN3EU6GJ"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "01/20/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970349,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL NO.16V672 AND 16V741 WERE NOT COMPLETED. CALLED THE AUTHORIZED TOYOTA DEALER, STEVENS CREEK TOYOTA, 380 KIELY BLVD, SAN JOSE, CA 95129, ON 01/20/2017 FOR REMEDY TO BE PERFORMED. I WAS TOLD THAT THEY WILL CALL ME BACK WHEN TEH PARTS ARE AVAILABLE. REMEDY NOT COMLETED YET.",
        "vin": "JTDKARFU8G3"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "01/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968678,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V741000 (PARKING BRAKE); HOWEVER, THE TECHNICIAN DID NOT COMPLETE THE RECALL REPAIR. THE CONTACT DID NOT DISCLOSE THE REASONING FOR THE DEALER NOT PERFORMING THE REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JTDKBRFU4G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/25/2017",
        "dateOfIncident": "01/31/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956961,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO WORK, WHILE SWITCHING LANES FROM LEFT TO RIGHT, MY VEHICLE WINDSHIELD WAS HIT WITH A SMALL ONCOMING PEBBLE ROCK THAT FELL FROM A SEMI-TRUCK THAT WAS APPROXIMATELY 125 FEET IN FRONT OF ME. I COULD NOT AVOID IT SINCE IT WAS A \"LAST SECOND\" SITUATION. MY CURRENT SPEED WAS 50 MPH IN A 70 MPH ZONE BECAUSE TRAFFIC IN THE LEFT LANE WAS MOVING SLOWER THAT IT SHOULD HENCE WHY I MOVED FROM THE LEFT TO THE RIGHT LANE. WHAT I AM TRYING TO REPORT IS THAT I BELIEVE AS WELL AS MANY OTHER 2016/2017 TOYOTA PRIUS OWNERS WHO HAVE CRACKED WINDSHIELDS, IS THAT TOYOTA IS USING WINDSHIELD GLASS THAT IS NOT UP TO CURRENT SAFETY STANDARDS. JUDGING BY THE CRACK IN MY WINDSHIELD, WHICH IS NOW WELL OVER A FOOT LONG, YOU CAN TELL HOW MUCH THINNER THE GLASS IS COMPARED TO OTHER CURRENT MAKE AND MODEL VEHICLES. I AM NOT SURE IF THIS IS DUE TO GAINING WEIGHT SAVINGS WHICH IN TURN WOULD GIVE A FEW EXTRA MPG OR NOT FOR A HYBRID VEHICLE, BUT I BELIEVE THIS NEEDS TO BE LOOKED INTO BECAUSE WINDSHIELDS FOR A VEHICLE LIKE THIS ARE EXTREMELY COSTLY. UPWARDS OF $690 FROM DIFFERENT VENDORS OR $1500 FROM A TOYOTA DEALER. I HAVE OWNED 5 CARS IN THE PAST, THE TOYOTA PRIUS IS NUMBER 6, AND ALL OF THE PAST 5 VEHICLES HAVE BEEN HIT EVEN HARDER WITH BIGGER ROCKS THAN THE PRIUS WAS ON THE WINDSHIELD WITH NO CRACKS OR CHIPS. I DO HOPE THIS IS LOOKED INTO BEFORE I START PAYING HIGH AMOUNTS OF MONEY FOR NEW WINDSHIELDS.",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2017",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956818,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FEELS LIKE IT WANTS TO GO FORWARD AS SOON AS THE GAS ENGINE TURNS ON TO CHARGE THE HYBRID BATTERY WHEN IT IS STATIONARY, IS IN PARK GEAR WITH THE FOOT PARKING BRAKE FULLY ON AND ON A FLAT SURFACE.     WHEN THE CAR IS RUNNING OFF OF BATTERY MODE AND THE BATTERY BECOMES DEPLETED THE GAS ENGINE TURNS ON TO CHARGE THE HYBRID BATTERY, YOU CAN FEEL THE CAR SENDING POWER TO THE WHEELS FOR A SLIGHT TWO SECONDS AND CAN ALSO HEAR THE BRAKES CREAKING AS A RESULT OF THE ENGINE FEELING ENGAGED TO THE WHEELS EVEN WHEN THE PARK GEAR (/BUTTON) IS SELECTED.    IT HAPPENS ALL THE TIME AND NOT SURE WHY IT WOULD DO THAT WHILE IN PARK. IF A PARKING BRAKE FAILURE WAS TO HAPPEN WHAT WOULD HAPPEN WHEN THE ENGINE TURNS ON TO CHARGE THE BATTERY AGAIN? WILL IT CREEP FORWARD OR WHAT?     JUST THOUGHT THIS WAS A CONCERN SINCE I HAVE NOT EXPERIENCED THIS WITH NON HYBRID CARS.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/18/2017",
        "dateOfIncident": "02/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955451,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "WHILE DRIVING ON HWY 14 AT APPROXIMATELY 1100 AM, MY SON'S  VEHICLE LEFT REAR TIRE BLEW OFF.  HE SUMMONED ASSISTANCE TO AAA WHO CAME AND PUT THE SPARE TIRE IN,  HE  SUBSEQUENTLY DROVE THE CAR TO SIERRA TOYOTA IN LANCASTER CA  AND CHANIN YESCAS  SERVICE DEPT MGR ASSISTED WITH HAVING THE CAR CHECK.  I AM CONCERNED WITH THIS VEHICLE IT IS THE 2ND INCIDENT WITH HAVE HAD WITH THE VEHICLE WITHIN A WEEK.  PLEASE ASSIST ASAP.",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953980,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE STARTED TO SHAKE FROM UNDERNEATH FIERCELY, I  CALLED MY MOTHER WHO CAME AND PICKED UP THE CAR SHE TURNED AROUND AND WENT BACK TO MY RESIDENCE, WHILE ATTEMPTING TO PARK IN THE GARAGE THE CAR STARTED TO ROLL DOWN THE DRIVEWAY AND THE BRAKES WOULDN'T WORK, THE CAR LANDED ON THE STREET.  CITY OF LANCASTER CA",
        "vin": "JTDKARFU5G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/14/2017",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945338,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD CRACKED 12+ INCHES OVERNIGHT WITH NO CAUSE. VEHICLE WAS PARKED IN GARAGE. CRACK HAS SINCE GROWN TO 20+ INCHES",
        "vin": "JTDKBRFU8G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "01/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944144,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA OF SURPRISE IS SAYING THAT THEY CAN'T FIX OUR PRIUS RECALL FOR THE EMERGENCY BRAKE UNTIL JANUARY 2018.",
        "vin": "JTDKBRFU6G3"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943978,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IF THE TIRE PRESSURE IS DECREASED BY THE SLIGHTEST AMOUNT THE LIGHT WILL GO ON AND STAY ON. IF THE TEMPERATURE IS COOL THE LIGHT WILL GO ON AND STAY ON. I'VE BROUGHT IT BACK TO SERVICE 4 TIMES DURING NOVEMBER AND DECEMBER OF 2016. THEIR SCAN SHOWS NO FAULT. I PURCHASED THE PRIUS IN FEBRUARY 2016 AND DIDN'T HAVE THIS PROBLEM UNTIL NOVEMBER. THE LIGHT MAY COME ON WHILE DRIVING OR SOMETIMES WHEN THE CAR IS FIRST STARTED.  *TR",
        "vin": "JTDKARFU7G3"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/30/2016",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938767,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS HYBRID. WHILE DRIVING 70 MPH, THE WINDSHIELD TRAPPED RAIN WATER, WHICH MADE IT DIFFICULT FOR THE CONTACT TO SEE THE ROAD. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 2,800.",
        "vin": "JTDKBRFU6G3"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V741000 (PARKING BRAKE). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JTDKARFU2G3"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT NIGHT ON DARK STREETS WITH NO OTHER LIGHTING, YOU CANNOT SEE TO DRIVE UNLESS YOU USE HIGH BEAMS.  THERE IS A LINE ACROSS THE WINDSHIELD; A HORIZON.  YOU CAN SEE BELOW THAT HORIZON (A THIN AREA), BUT IT'S BLACK ABOVE IT, MAKING IT VERY HARD TO SEE.  VISIBILITY IS ONLY A FEW FEET. I CONTACTED TOYOTA AND THE SALES AND MANAGEMENT TEAM CLAIM THAT THEY HAVE NEVER HEARD OF SUCH A THING.  I CONTACTED SERVICE AND WAS TOLD THAT THIS IS NORMAL.  THERE IS NO FIX.  I AM DEMANDING THAT MY HEADLIGHTS BE AIMED HIGHER IN HOPES THAT I CAN SEE TO DRIVE.  IF THIS DOES NOT FIX THE PROBLEM, THIS CAR CANNOT BE DRIVING AT NIGHT.  IT IS NOT SAFE TO DRIVE WITH SUCH LOW VISIBILITY. I WAS DRIVING VERY SLOWLY AND STILL FELT THAT I SHOULD HAVE JUST STOPPED.  *TR",
        "vin": "JTDKDTB30G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/25/2016",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937393,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2016 PRIUS FOUR ON FEBRUARY 16, 2016. THE LITERATURE ON THE TOYOTA FACTORY WEBSITE SAYS MY PRIUS IS EQUIPPED TO SWITCH FROM ENGLISH TO METRIC UNITS. UNFORTUNATELY, TOYOTA FAILED TO DISCLOSE THAT ANY PRIUS MANUFACTURED IN JANUARY AND FEBRUARY AND DELIVERED TO THE UNITED STATES DID NOT HAVE THIS FEATURE WORKING CORRECTLY. WITHOUT THE ABILITY TO SWITCH TO METRIC UNITS, BY GOVERNMENT MANDATE, MY PRIUS DOES NOT MEET CANADIAN MOTOR VEHICLE SAFETY REGULATIONS. APPARENTLY SOME 2016 PRIUS VEHICLES SOLD IN CANADA ALSO CANNOT SWITCH TO ENGLISH UNITS WHEN DRIVING IN THE UNITED STATES PRESENTING A POTENTIAL SAFETY HAZARD.    TOYOTA HAS APPARENTLY FAILED TO REVEAL A MATERIAL FACT THAT THE PRIUS SOLD TO ME DOES NOT MEET THE CANADIAN MOTOR VEHICLE SAFETY REGULATIONS. THERE WAS NO DISCLOSURE ON THE VEHICLE MONRONEY STICKER THAT THIS PRIUS HAS A DISABLED OR DELETED ENGLISH TO METRIC UNIT SPEEDOMETER DISPLAY.    AFTER 10 MONTHS FROM MY DATE OF PURCHASE, THE ONLY REMEDY TOYOTA OFFERS IS FOR ME TO PURCHASE A NEW PRIUS TO REPLACE MY NEW PRIUS AT MY EXPENSE.     WHEN I PURCHASED MY NEW 2016 TOYOTA PRIUS, I DID NOT KNOW I WAS PURCHASING A VEHICLE WITH VAPORWARE SOFTWARE. THERE WAS NOT A CLEAR AND CONSPICUOUS DISCLOSURE THAT TOYOTA DELETED THE OPTION TO SELECT BETWEEN ENGLISH AND METRIC UNITS WHICH AFFECTS MULTIPLE VEHICLE SYSTEMS SUCH AS NAVIGATION, HEATER/AC, SPEEDOMETER, AND ODOMETER.   FOR MY FIRST SIX MONTHS OF OWNERSHIP, THE NAVIGATION SYSTEM WOULD CONSTANTLY REBOOT UNTIL TOYOTA FIXED THEIR SOFTWARE. THIS SYSTEM REBOOTING WAS A SIGNIFICANT DRIVER DISTRACTION.    TOYOTA ADVERTISES, \"LET'S GO PLACES.\" FOR TRUTH IN ADVERTISING, TOYOTA SHOULD REALLY SAY, \"LET'S GO PLACES, EXCEPT TO CANADA, MEXICO AND THE REST OF THE PLANET BECAUSE SOME TOYOTA SPEEDOMETERS CAN'T DISPLAY METRIC UNITS.\"  *TR",
        "vin": "JTDKARFU7G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. THE CONTACT STATED THAT THE SPEEDOMETER GAUGE DID NOT ALLOW THE ABILITY TO SWITCH FROM MILES PER HOUR TO KILOMETERS. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS UNABLE TO BE DIAGNOSED OR REPAIRED DUE TO N MANUFACTURER DEFAULT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 1,500.  ....UPDATED 02/06/17 *BF    *CN",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,HYBRID PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS C. WHILE DRIVING VARIOUS SPEEDS, A RUBBER ODOR EMITTED FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT NO FAILURE WAS DETERMINED. SEVERAL DAYS LATER, THE \"HYBRID COOLANT SYSTEM NEEDS SERVICE\" WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED AS A SAFETY HAZARD. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS UNABLE TO BE DRIVEN AND THAT THE BATTERY COMPARTMENT FILTER SYSTEM NEEDED CLEANING TO PREVENT THE BATTERIES FROM OVERHEATING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 7,000.",
        "vin": "JTDKDTB39G1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2016",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935535,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA PRIUS. WHILE THE VEHICLE WAS STATIONARY, THE BATTERY BECAME EXTREMELY HOT. THE VEHICLE WAS REPAIRED BY THE CONTACT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 20,000. UPDATED 01/26/2017*CT     *CN",
        "vin": "JTDKDTB34G1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934929,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED MY 3RD TOYOTA IN AUGUST (2016 PRIUS). I UPGRADED MY 2011 PRIUS BECAUSE I REALLY NEEDED BUILT IN NAVIGATION DUE THE NATURE OF MY JOB AND MY COMMUTE. I AM CURRENTLY EXPERIENCING ISSUES WITH THE RADIO/NAVIGATION SYSTEM, WHICH IS VERY FRUSTRATING BECAUSE THIS IS A \"BRAND NEW\" CAR. THE NAVIGATION SYSTEM AND RADIO TURN OFF AND ON CONTINUOUSLY DURING THE MOST DANGEROUS AND INCONVENIENT TIMES (I.E. WHEN I AM NAVIGATING THOUGH UNFAMILIAR WOODED AREAS IN THE DARK WHEN IT'S RAINING). THIS ALSO CAUSES ONE OF MY INSTRUMENT PANELS TO GO BLANK. I HAVE HAD TO STOP USING THE NAVIGATION SYSTEM ALTOGETHER AT TIMES, WHICH AGAIN IS THE REASON THAT I UPGRADED MY CAR IN THE FIRST PLACE. THIS BEGAN HAPPENING INTERMITTENTLY IN SEPTEMBER, AND THE PROBLEM HAS GOTTEN PROGRESSIVELY WORSE OVER TIME. I TOOK OFF OF WORK TO HAVE THE ISSUE DIAGNOSED AND REPAIRED BY THE DEALERSHIP IN NOVEMBER AND TO HAVE THE PARKING CABLE RECALL ISSUE TAKEN CARE OF. I WAS INFORMED BY THE DEALER THAT THEY DID NOT HAVE THE PARTS IN TO ADDRESS THE RECALL ISSUE AND THE TECHNICIAN IMMEDIATELY NOTICED THE ISSUE WITH THE RADIO/NAVIGATION SYSTEM BUT WAS UNABLE TO CORRECT THE ISSUE BECAUSE THE UPDATE THAT \"MIGHT\" FIX IT IS NOT AVAILABLE YET. THIS IS VERY DANGEROUS AND THIS ISSUE NEEDS TO BE ADDRESSED BEFORE SOMEONE GETS HURT.",
        "vin": "JTDKARFU4G3"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "11/24/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928387,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT, REAR VIEW INTERIOR MIRROR DOES NOT DIM AS TRAFFIC APPROACHES FROM REAR. WHEN TAKEN TO DEALER, TECHNICIAN SHINED LIGHT FROM IPHONE ONTO MIRROR AND IT DIMMED PROPERLY. HOWEVER, UNDER NORMAL DRIVING CONDITIONS IT DOES NOT! ON A RECENT 2 HOUR NIGHTTIME DRIVE, AS CAR LIGHTS APPROACHED FROM BEHIND, I ALTERNATELY TURNED THE DIMMING FEATURE ON AND THEN OFF AND NOTICED ABSOLUTELY NO DIFFERENCE. I EVEN TRIED IT WHEN STOPPED AT RED LIGHT WITH HEADLIGHTS FROM SEVERAL CARS BEHIND ME, WITH THE SAME RESULT. SINCE THERE IS NO LEVER TO USE TO DIM THE TRAFFIC AS THERE MIGHT BE WITH A NON-ELECTRONIC MIRROR, I WAS FORCED TO LOWER THE MIRROR TO AVOID BEING BLINDED BY CARS APPROACHING FROM REAR - AN OBVIOUS SAFETY SITUATION. DEALER SAYS THERE'S NO PROBLEM BUT HAS NOT TRIED IN REAL LIFE DRIVING.  *TR",
        "vin": "JTDKARFU6G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/19/2016",
        "dateOfIncident": "11/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927070,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "16V741000 WAS NOT PERFORMED ON THE CAR EVEN THOUGH IT WAS PURCHASED 11/17 , AND THE RECALL BEGAN 11/10. DEALER LEE'S TOYOTA LOCATED AT 139-65 QUEENS BLVD, JAMAICA NY 11435",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/15/2016",
        "dateOfIncident": "11/04/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926286,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, OCTOBER 21, 2016 WHILE DRIVING OVER A POTHOLE I PRESSED ON THE BRAKE.  THE CAR SLOWED BUT ALL OF A SUDDEN THE BRAKE SUDDENLY DEPRESSED EVEN FURTHER DOWN AND THE CAR JERKED AND SEEMED TO STALL BEFORE PUSHING FORWARD.  I HAD BEEN PRESSING THE BRAKE AS FAR DOWN AS IT WOULD GO AND IT SEEMED AS IF THERE WOULD BE SOME KIND OF BRAKE FAILURE.  ON OCTOBER 31, 2016 WHILE DRIVING OVER ANOTHER POTHOLE, I AGAIN STEPPED ON THE BRAKE AND SUDDENLY THE PEDAL AGAIN DEPRESSED FURTHER DOWN AND THERE WAS A CREAKING AND SQUEALING SOUND.  THEN ON NOVEMBER 4, 2016 WHILE GOING OVER A POTHOLE, THERE WAS A SQUEALING AND CREAKING SOUND BUT NOT A SUDDEN ADDITIONAL DEPRESSION OF THE BRAKE PEDAL.  ALL THESE INCIDENTS HAPPENED ON SALT LAKE BLVD. OR KAMEHAMEHA HIGHWAY AND PASSES UNDER THE FIXED GUIDEWAY FOR HAWAII'S RAIL SYSTEM.  THE ROAD IS EXTREMELY BUMPY AND FULL OF POTHOLES.",
        "vin": "JTDKBRFU6G3"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "10/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923955,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I LEFT WORK MY INDICATOR SHOWED A FULL BATTERY ALL BARS IN BLUE. AS I WAS DRIVING DOWN THE COAST I NOTICED THE BATTERY STARTED TO QUICKLY DEPLETE, IN APPROX 8.6 MILES MY INDICATOR SHOWED 1 BLUE BAR. AT THAT TIME I WAS MAKING A LEFT ONTO THE CANYON ROAD. I THOUGHT THIS WAS ODD.  AS I TURNED LEFT NOTICED A DECREASE IN ACCELERATION POWER. DIDN'T THINK MUCH OF IT BUT ABOUT UNTIL ABOUT 2 MILES IN I NOTICED THE PRIUS STARTED LOSING ACCELERATION POWER THE MOTOR WAS RUNNING AND THE INDICATOR DID NOT SHOW THAT IT WAS IN EV MODE EVEN COASTING THROUGH THE CANYON AND BRAKING. I HAD TO ACCELERATE TO COME UP A SLOPE THROUGH A TUNNEL I HAD ALMOST NO ACCELERATION POWER. THE CAR FELT LIKE IT WAS HESITATING I THINK BY THE DOWN HILL COAST AND A FEW SPURTS OF POWER SURGES I WAS ABLE TO MAKE IT THROUGH THE TUNNEL BY THE 5TH MILE I HAD NO POWER TO ACCELERATE LUCKILY THERE WAS A ROAD WHERE I COULD MAKE A RIGHT. AS I COASTED TO THE INTERSECTION I TURNED RIGHT THEN ATTEMPTED TO PULL A UTURN ON A PATCH OF DIRT AS I WAS 3/4 OF THE THROUGH THE TURN THERE WAS ZERO POWER THE VEHICLE WAS ON BUT NO POWER ENGINE CUT OUT. NO CHECK ENGINE LIGHT WHATSOEVER I GOT SUCK IN THE MIDDLE OF THE 2 LANE HIGHWAY BLOCKING BOTH DIRECTIONS! I PUT ON MY HAZARDS AND ATTEMPTED TO PUT THE CAR IN NEUTRAL IT INDICATED IT WAS IN NEUTRAL, THEN I SHIFTED TO DRIVE BUT AGAIN NO POWER THE CAR WAS JUST MAKING A NOISE AND LIKE A VERY FAINT GRINDING NOISE. AT THIS POINT CARS WERE ON BOTH LANES TRYING TO HEAD EACH DIRECTION I HAD TO GET OUT AND PUSH THE CAR BACKWARDS TO GET 1 TIRE OFF THE SIDE GRADE THEN I WAS STILL SIDEWAYS IN THE MIDDLE OF THE ROAD. I CYCLE THE CAR 3 TIMES BY PUTTING IT IN PARK WITH PARKING BRAKE WITH NO LUCK, OR POWER. IT WASN'T UNTIL 4TH TRY IT GOT SOME POWER THE ENGINE KICKED ON AND I WAS ABLE TO PULL BACK IN THE RIGHT LANE AND I WAS STUCK AT THE CORNER WITH MY HAZARDS ON.    *TR",
        "vin": "JTDKBRFU8G3"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918653,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD RANDOMLY CRACKED AND LOOKING ON-LINE THIS SEEMS TO BE A COMMON OCCURRENCE ON THE PRIUS 4TH GENERATION VEHICLES.",
        "vin": "JTDKARFU6G3"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "10/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917459,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COATING ON THE WIRING SYSTEM ATTRACTED RODENTS TO MY CAR, THE RODENTS ATE THROUGH THE ELECTRICAL AND TRIED TO NEST IN THE ENGINE BAY. THE RESULTS WERE MASSIVE SYSTEMS MALFUNCTIONS AND THE CAR WASN'T SAFE TO DRIVE. I HAD TO GET IT TOWED TO TOYOTA AND THEY STATED THAT THIS IS A COMMON PROBLEM. \"THEY'VE SEEN ALOT OF THIS RECENTLY\"",
        "vin": "JTDKARFU7G3"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/12/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915494,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I TOOK A HIGHWAY EXIT, FOLLOWING BEHIND OTHER CARS DOING THE SAME, MY PRIUS REFUSED TO BRAKE EFFICIENTLY WHEN ANOTHER CAR ABRUPTLY INVADED OUR LINE. IT FELT AS IF THE BRAKES MADE A SLIGHT RELEASE OR COULDN'T REACH A FULL STOP. I HAD ENOUGH SPACE TO STOP, AND I PRESSED THE BRAKES ON TIME BUT THERE WAS ALMOST NO BRAKE REACTION AND I CRASHED INTO THE TRUCK IN FRONT OF ME. I WAS PROBABLY GOING 20-30 MPH, SOMEWHERE IN THE MIDDLE... SO NOT EVEN THAT FAST. BEST PART IS THAT THE AIRBAGS DIDN'T INFLATE, EVEN THOUGH THE CAR WAS ALMOST TOTALED. THIS FEELS EXPLAINABLE TO ME... I HAD IT FOR ONLY TWO MONTHS THUS FAR. I DO NOT RECOMMEND THIS CAR TO OTHERS.",
        "vin": "JTDKBRFU2G3"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/02/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10911046,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE TRAVELING AT APPROXIMATELY 70MILES AN HOUR ON A DIVIDED HIGHWAY.  THE CRUISE CONTROL WAS ACTIVATED.  MY HUSBAND WAS DRIVING, I WAS THE PASSENGER.  WE BOTH WERE WEARING OUR SEAT BELTS.  MY HUSBAND SUFFERED SOME SORT OF MEDICAL INCIDENT CAUSING HIM TO LOSE CONTROL OF THE VEHICLE.  WE CROSSED THROUGH THE MEDIAN, BECAME AIRBORNE, CROSSED TWO LANES OF OPPOSING TRAFFIC AND HEADED UP A STEEP INCLINE.  THE CAR CAME TO REST ON A PILE OF DEBRIS AND HUNG UP ON A WIRE FENCE.   MY HUSBAND SUFFERED A SUBARACHNOID HEMORRHAGE FROM STRIKING SOMETHING ON THE DASH OF THE CAR.  WHEN THE CAR  STOPPED HE WAS SLUMPED OVER THE WHEEL BLEEDING..  HE ALSO SUFFERED  A MILD L4 COMPRESSION FRACTURE.  AT THE TIME OF THE ACCIDENT I HAD LIGAMENT DAMAGE IN THE CHEST AREA.  AS A RESULT HE WAS TAKEN BY AMBULANCE TO THE REGIONAL HOSPITAL AND THEN AIR-EVACUATED TO LAS VEGAS.  OUR SIDE CURTAIN AIRBAGS DEPLOYED BUT NOT THE FRONTAL BAGS.   I CALLED TOYOTA AND WAS TOLD THAT THE CRASH WAS NOT SEVERE ENOUGH TO CAUSE THEM TO NFLATE BUT MY HUSBAND'S INJURIES WOULD TEND NOT TO SUPPORT THAT. AN ENGINEER DID REMOVE THE \"BLACK BOX\" FROM THE VEHICLE TO TEST IT.  HE PROMISED HE WOULD GET BACK TO US WITH THE RESULTS.  WHEN I DID NOT HEAR FROM HIM I CALLED AND HE TOLD ME THAT ALL RESULTS HAVE BEEN SENT TO TOYOTA.  HE WAS RELUCTANT TO SAY MORE.  I CALLED TOYOTA AND WAS TOLD THAT SEVERAL PEOPLE HAD LOOKED AT THE CASE AND THAT THE RESULTS HAD BEEN SENT TO LEGAL,  THE ATTIITUDE OF THE PEOPLE THERE HAS GONE FROM HELPFUL TO ABRUPT.  MY HUSBAND IS STILL UNDER THE CARE OF A NEUROLOGIST BECAUSE OF THE INJURY AND TO DETERMINE WHAT CASED THE INCIDENT.  THEY HAVE NOT BEEN ABLE TO DETERMINE A CAUSE FOR HIS BLACKOUT BUT WE HAVE BEEN ASSURED VIA CT SCAN THAT THE BLEEDING HAS STOPPED INTO HIS BRAIN.  IF HE HIT SOMETHING IN THE CAR HARD ENOUGH TO CAUSE THIS TYPE OF INJURY IT SEEMS TO ME THAT THE AIRBAG SHOULD HAVE DEPLOYED.  .",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "02/08/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906232,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED TO BURN LOT OF OIL.  LIKE 1 QUART FOR EVERY 1000 TO 1200 MILES.  WHEN I GOOGLED, I SAW I WAS ONE IN A MILLION AS ALREADY PRIUS OWNERS WERE SHOUTING ABOUT THIS ISSUE ONLINE.  WHEN I CALLED AND EXPLAINED THE PROBLEM TO AUTONATION DEALER IN TEMPE, HE CLEARLY UNDERSTOOD THIS PROBLEM(BECAUSE HE FACED THE COMPLAINTS) AND HE SAID IT WOULD COST 6000 BUCKS TO FIX.  TOYOTA IS NOT READY TO EXTEND THE WARRANTY FOR THIS PROBLEM.  BUT, THE DEALER IS READY TO BUY THIS CAR FOR JUST 1000 BUCKS.  MY CAR'S CURRENT VALUE IN KBB IS 7800 BUCKS.",
        "vin": "JTDKN3DU3A0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2016",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897341,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD AN UNEXPLAINED BLOWOUT IN A TIRE WITH  LESS THAN 5000 MILES ON IT ON OUR PRIUS IV 2016 PURCHASED IN MAY.  WE SAW NOTHING IN THE ROADWAY THAT WOULD HAVE CAUSED THIS. THE TIRE WAS RIPPED. THERE IS A RECALL ON THIS BRAND, BRIDGESTONE/FIRESTONE SO WAS THIS TIRE AT RISK? THE TIRE NUMBER IS P195/65R89S. THE WARRANTY IS WORTHLESS AS THEY COULD CLAIM ROAD DAMAGE AND WE CAN'T PROVE OTHERWISE. BUT WE SAW NOTHING THAT WE HIT, AND OTHER CARS PASSING US DID NOT HAVE BLOWOUTS. SO DID THE TIRE FAIL? WE THINK SO. WE WERE ON AN INTERSTATE HIGHWAY WHEN THIS HAPPENED. VERY SCARY AND NO SPARE TIRE, A SEPARATE COMPLAINT. WE COULD HAVE BEEN KILLED BY A PASSING TRUCK WHILE WAITING FOR A TOW TRUCK FOR NEARLY 2 HOURS.",
        "vin": "JTDKRFU4G30"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897152,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS C",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES, I HAVE ANTI LOCK BRAKES, BUT IF I HAVE TO PRESS  THE BRAKE THE LEAST BIT HARD IT LOCKS UP. I HAVE TALKED TO THE DEALER ABOUT THIS PROBLEM AND HE SAYS ITS NORMAL.  THEY ALSO GRAB WHEN I PUT THEM ON. THIS IS MY THIRD PRIUS AND I HAVE NEVER HAD THIS PROBLEM. I THINK THIS NEEDS TO BE LOOKED INTO.IT MAKES THE CAR SKID  . THANK YOU  *TR",
        "vin": "JTDKBRFU2G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/18/2016",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A TIRE BLOWOUT ON AN INTERSTATE HIGHWAY AND DISCOVERED THERE WAS NO SPARE TIRE IN OUR NEW CAR. THE DEVICE TO REPAIR THE TIRE DIDN'T WORK AS THE TIRE WAS RIPPED. WE HAD TO WAIT 2 HOURS FOR A TOW TRUCK, WITH HUGE TRUCKS PASSING US AT 80 MPH, VERY CLOSE. WE WERE TERRIFIED. WE STILL DON'T KNOW WHAT REALLY HAPPENED AS WE DIDN'T SEE ANYTHING THAT WOULD HAVE RIPPED THE TIRE.  THE CAR IS NEW, STILL UNDER WARRANTY.  EVERY CAR SHOULD HAVE A SPARE TIRE FOR EMERGENCIES LIKE THIS. WE DID NOT KNOW IT DIDN'T HAVE ONE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/22/2016",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RODENT DAMAGED WIRING AND CASINGS BY EATING/DAMAGING  BOTH AT A COST SO FAR OF $2700. I HAVE OWNED THIS VEHICLE FOR ONE MONTH. I'VE BEEN TOLD THE WARRANTY DOES NOT INCLUDE THE DAMAGE. I ASKED ABOUT WHERE THE DEALERSHIP STORED THE VEHICLE PRIOR TO ITS DELIVERY TO ME. I WASN'T SATISFIED WITH THEIR EXPLANATION.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882848,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2016 PRIUS IV WE JUST PURCHASED 2 WEEKS AGO COMES WITH A WHITE DASH! THE WHITE DASH CREATES A HORRIBLE GLARE WHEN TRYING TO LOOK OUT EITHER DRIVER OR PASSENGER WINDOW! THE ONLY WAY TO AVOID GLARE IS DRIVE WITH WINDOWS DOWN ALL OF THE TIME. VISIBILITY IS GREATLY HAMPERED BY THE WHITE DASH REFLECTION OFF THE WINDOWS! THIS IS HUGE SAFETY ISSUE!",
        "vin": "JTDKARFU3G3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881749,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GENTLY APPLYING BRAKES FOR A STOP LIGHT, AND THE RIGHT WHEEL HITS A 1 AND 1/8 INCH DEEP DEPRESSION IN THE ROAD, THE BRAKES FEEL LIKE THEY MOMENTARILY RELEASE. THE DEPRESSION IS FOR A 9 INCH DIAMETER CITY WATER COVER, AND THE OVERALL DIAMETER OF THE DEPRESSION IS 12 INCHES, AND IT IS 1 AND 1/8 INCHES DEEP. THIS CAN BE REPLICATED AT THIS LOCATION AND WE HAVE ALSO NOTICED THE SAME THING HAPPENING ELSEWHERE IN TOWN.",
        "vin": "JTDKBRFU9G3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2016",
        "dateOfIncident": "01/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870145,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CENTER DISPLAY HAS A MIRROR HIGH GLOSS/GLARE FINISH.  BECAUSE OF THIS MIRROR FINISH, WHEN THE SUN IS AT AN ANGLE COMING THROUGH EITHER THE SIDE OR BACK WINDOWS, THE SUN IS REFLECTED BACK INTO THE DRIVER'S EYES.  THERE SHOULD BE A RECALL ON THE CAR TO REPLACE CENTER DISPLAY TO PREVENT ACCIDENTS.",
        "vin": "JTDKBRFU7G3"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/11/2016",
        "dateOfIncident": "05/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864390,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN ONGOING ISSUE WITH THE HEAD RESTS ON THIS VEHICLE. THE DEFAULT SETTING IS MUCH TOO FAR FORWARD, CAUSING A FORWARD HEAD AND NECK POSTURE, RESULTING IN HEADACHES, NECK PAIN, ETC., AND MAKE IT VERY UNCOMFORTABLE TO DRIVE, AND DIFFICULT TO CHECK BLIND SPOTS. IT ALSO FORCES THE DRIVER'S HEAD VERY CLOSE THE AIRBAG, WHICH IS SUPPOSEDLY VERY DANGEROUS. IF YOU MOVE THE SEAT BACK, THEN YOU ARE TOO RECLINED TO DRIVE ATTENTIVELY. ONLINE SEARCHES AND COMPLAINTS TO THE DEALER TELL ME I'M NOT THE ONLY ONE COMPLAINING ABOUT THIS, AND IT IS SUPPOSEDLY THE RESULT OF NHTSA REGULATIONS. THIS IS TERRIBLE IF TRUE.",
        "vin": "JTDKBRFU8G3"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/10/2016",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864287,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2016 PRIUS 4 DOESN'T COME WITH THE ABILITY TO CHANGE MILES TO KILOMETERS UNLESS YOU ARE AWARE THAT IT IS AN OPTION YOU HAVE TO BUY WHICH NEITHER SALESMEN OR TOYOTA TECHNICAL ASSISTANCE IS AWARE OF. I HAVE NOT BEEN ABLE TO FIND ANYONE WHO CAN TELL ME WHETHER THIS OPTION CAN BE ADDED BUT SO FAR IT APPEARS THAT IT IS.",
        "vin": "JTDKARFU1G3"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "08/30/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824770,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2015 TOYOTA PRIUS. THE CONTACT STATED THAT THE DRIVER'S HEAD REST POSITIONING IN THE VEHICLE WAS TOO FORWARD MAKING IT IMPOSSIBLE TO DRIVE FOR LONG PERIODS OF TIME WITHOUT SEVERE DISCOMFORT. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50. THE VIN WAS NOT AVAILABLE.  UPDATED 04/20/16*LJ  *JS",
        "vin": "JTDZN3EU9FJ"
    }
]