[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "01/04/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459509,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Toyota Rav4. The contact stated that while driving at various speeds, the seat belt alert chime would intermittently engage while the seat belt was in use. The seat belt warning light was also illuminated. The dealer and the manufacturer were not notified of the failure. The vehicle was not diagnosed or repaired. The failure mileage was approximately 74,800.",
        "vin": "2T3JFREV0GW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/19/2022",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Toyota Rav4. The contact stated that while the vehicle was parked, unattended  in the driveway, it caught fire in the engine. The fire department extinguished the fire. There were no reported injuries, property damage or police report filed. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The vehicle was towed to an independent lot. The manufacturer was not contacted. The fire department  provided report number 2022-05-FV. The approximate failure mileage was 112,000.",
        "vin": "2t3dfrevxgw"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457148,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving from Ft Myers to Tallahassee on I-have 75 in Florida on March 8, 2022. All of a sudden, I heard the Lane Departure Assist go off in my car (which I had previously turned off because the alert is annoying) and my phone stopped working (it was plugged into a USB port in the car playing a podcast). A few minutes later, I stopped at a rest area and noticed my trip odometers had reset and a bunch of other settings I had previously set in my car had also reset back to factory settings, such as the cruise control settings, blind spot monitor, and parking assist. There might be more...I just haven't noticed those yet.  When I got back home, I saw an envelope from Toyota titled, \"12-Volt Battery Size and Installation Inspection Consumer Advisory.\" I did get my battery replaced in Winter 2020 by a non-Toyota dealer so now I'm wondering if that has anything to do with this Consumer Advisory.",
        "vin": "2T3RFREV1GW"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "11/05/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455911,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Toyota Rav4. The contact stated while driving 10 MPH, the brake pedal was depressed and went to the floorboard. The contact stated that extra effort was needed to depress the brake pedal while stopping the vehicle. The vehicle was taken to the dealer but was not yet diagnosed or repaired. The manufacturer was notified of the failure. The failure mileage was approximately 135,000.",
        "vin": "jtmjfrev5gd"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "02/06/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11455671,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The friend of  the contact's son owns a 2016 Toyota Rav4. The contact stated while his son's friend was driving at 10-15 MPH and making a turn with his son in the passenger seat, another vehicle crashed into the front passenger side of the vehicle. The front passenger air bags and the passenger curtain air bags deployed  brutally and violently hit the contact's son face, chest and head.  The contact's son was transported to the hospital with the assistance of emergency units. The contact's son sustained three dislocated front upper teeth and root, two dislocated front lower teeth and lesions on the lips. Additionally the contact's son sustained injuries on the neck, face, head, chest and pelvis. There was no further information provided. The vehicle was towed to a tow lot.  A police report was filed. The vehicle was not diagnosed or repaired. The dealer and the manufacturer were not notified of the failure. The failure mileage was unknown.",
        "vin": "JTMBFREVXGD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454473,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down a highway on the afternoon of February 26, 2022, when we heard a loud pop. At our next stop, we pulled back the interior sunroof cover and discovered the sunroof had shattered spontaneously. It was buckled up, not down, so I don't believe anything on the highway hit the vehicle. We were very lucky the interior cover was closed at the time it happened, or it's possible glass could have fallen into the car on the driver or passenger.",
        "vin": "2T3WFREV7GW"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "02/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447537,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact’s daughter owns a 2016 Toyota Rav4. The contact stated that while the vehicle was idle, the warning message “System Failure” illuminated and the vehicle shuddered, shut off, and lost electrical power. The contact’s daughter shifted into Park. The vehicle was towed to the dealer who diagnosed the failure as a loose vacuum hose and retched fuel system. The dealer secured the vacuum hose; however, the failure reoccurred while she was at a complete stop. The vehicle was towed to the dealer who diagnosed the failure as a contaminated charcoal canister. The dealer replaced the canister; however, the failure reoccurred. The vehicle was towed to the dealer and it was stated that fuel was leaking onto the charcoal canister. The charcoal canister was replaced for the second time; however, the failure persisted. The vehicle was taken back to the dealer for a 4th time. The dealer sent a full diagnostic report to the manufacturer. The manufacturer sent engineers, field experts, and a district manager who took the vehicle apart and diagnosed that the charcoal canister and the evaporative emission control system including the gas tank needed to be replaced. The contact stated that the vehicle was repaired, and the gas cap was tightened. However, the failure persisted. The vehicle was towed to the dealer three more times. The charcoal canister was replaced but the failure persisted. The contact stated that failure would occur when the vehicle was idle at a complete stop. The contact referenced NHTSA Campaign Number: 20V682000 (Fuel System, Gasoline). The contact stated that the manufacturer opened a case and had been assigning the case to different district managers. The vehicle was not repaired. The failure mileage was approximately 1,200.",
        "vin": "2T3WFREV0GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440109,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was traveling at a speed of 40 mph on a wet road.  As I approached an intersection with stop sign I applied brakes about 100 feet before the stop sign.  The ABS engaged shortly after I applied the brakes.  I continued to keep foot on brake but was continuing to get closer to the intersection and the ABS was not disengaging.  I attempted once to let off the ABS and apply the brakes but the ABS was still on disengaging.  At this point I was entering the intersection and turned my wheel toward the left at an embankment and pulled up on my emergency parking brake to stop the vehicle.  The incident did not result in a collision, as it was a 3 way stop and the other vehicles at the intersection was able to avoid hitting me.  I called Rohrich Toyota immediately to see if there was a recall in the brakes or a known problem.  I was told there wasn't any known problem.  I tested out the brakes at slow speed and the problem didn't repeat itself under slow conditions so I drove home.  I believe there is a problem with the ABS not disengaging.",
        "vin": "JTMRJREV3GD"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/01/2021",
        "dateOfIncident": "10/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11438895,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on the entrance road to a major highway, and as I approached the curve in the road and pressed on the brakes to decelerate, the vehicle began to shake, and as I pressed the  brakes harder to slow down, they did not engage, the front wheels became locked in the position of the curving road at an angle and the vehicle went off road at approx  45mph down an embankment and into a tree. The air bags did not deploy. The vehicle is totaled and although there were no fatalities minor injuries did occur since the airbags did not keep the passenger nor driver from hitting there head on the windows and door jam, and the steering wheel.",
        "vin": "JTMRFREV1GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "09/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435857,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "-  I believe the ECM has failed, and I believe this after replacing battery, starter, spark plugs, and spark plug wires. While accelerating, and while maintaining a consistent speed over 50 mph, the tachometer (and engine, accordingly) yanks itself back and forth between 3500 and 5500 rpm. The vehicle physically jumps back and forth between massive acceleration and decceleration, without any change in throttle/pedal placement. This occurs while in Cruise Control, Eco Mode, Normal Mode, and Sport Mode. There is not yet a discernable pattern or trigger identified in why this occurs.  -  My safety and the safety of others has been put at risk by the vehicle's jerking, halting, and unplanned acceleration in heavy traffic situations. It scares me and others in traffic, to the point that people have asked if I was okay after being able to visibly notice the car's behavior on the highway, and my reaction.  -  The problem has been reproduced twice by an independent service center. Toyota Dealership read the computer for the vehicle to pull codes, told me nothing was wrong, and sent me away.  -  The vehicle has been inspected by my local Toyota dealership (lackluster inspection, in my opinion). Nothing resulted from this inspection.  -  There were (and still are) NO warnings lamps, messages, reminders, codes, or notifications of any kind to show that something is abnormal in my engine. This is the most vexing part of this issue. As far as the computer in the Rav4 is concerned, everything is nearly perfect. and it IS NOT.",
        "vin": "2T3WFREV9GW"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/25/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434339,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering wheel lock Dealer suggest to replace the steering column , car only have 30 K miles ???",
        "vin": "Jtmwfrev8gj"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "06/22/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11424085,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2016 Toyota Rav4. The contact stated that while driving approximately 50 mph when they noticed smoke and flames were coming from underneath the hood of the vehicle. The contact stated that when they attempted to move to the passenger side of the road they realized there was not enough room to do so causing them to roll over several times downhill eventually crashing into two trees. The contact stated that a civilian came and assisted them out of the vehicle once they noticed the crash. The air bags did deploy. The contact received head, neck, rib, sternum, and foot. Medical attention was needed. A police report was filed. The vehicle was towed and deemed totaled. The manufacturer was not made aware of the failure. The approximate failure mileage was 89,000.",
        "vin": "jtmbfrev9gj"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Toyota RAV4. The contact stated that the moon roof was leaking. The failure had gotten progressively worse over time causing damage to the interior of the vehicle. The contact had not taken the vehicle to the dealer. The manufacturer was made aware of the failure. The contact was informed that the VIN was not under recall. The vehicle was not repaired. The approximate failure mileage was 43,000.",
        "vin": "2t3nfrev6gw"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/15/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416697,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CONDENSATION IS APPEARING ON BOTH OF THE BACK BRAKE LIGHTS THE CAR HAS 40000 MILES NOT SURE SHY THIS IS HAPPENING I BELIEVE THAT THE SEAL HAS BEEN BROKEN ON THE RIM OF THE BACK LIGHTS",
        "vin": "JTMBFREV9GD"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "05/04/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415425,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2016 RAV4 PRODUCED A LOUD CLUNK THEN LOST POWER (AFTER BEING DRIVE 5-10 MINUTES) AND CAME TO A COMPLETE STOP. THE ENGINE WOULD NOT TURN OVER NOR THE CAR POWER COME BACK ON. WHITE SMOKE BEGAN WITHIN 30 SECONDS OF LOSING POWER AND WITHIN ONE MINUTE FLAMES BEGAN SHOOTING OUT UNDER THE DRIVER'S SIDE UPPER HOOD.",
        "vin": "2T3WFREV5GW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/22/2021",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11414617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT WHILE HER HUSBAND WAS STOPPED AT A TRAFFIC LIGHT, HE STARTED SMELLING AN ABNORMAL BURNING ODOR BEFORE FLAMES STARTED COMING UP FROM UNDER THE DASHBOARD AND OUT OF THE DRIVER'S AND PASSENGER'S SIDE VENTS. THE DRIVER PULLED OVER AND STARTED POURING WATER FROM A COOLER ONTO THE FIRE TO TRY TO EXTINGUISH THE FLAMES HOWEVER, THE FLAMES REIGNITED. ANOTHER MOTORIST PULLED OVER TO ASSIST AND DISCONNECTED THE BATTERY. A BUSINESS OWNER ALSO STOPPED BY, AND EXTINGUISHED THE FLAMES WITH A FIRE EXTINGUISHER. THE FIRE DEPARTMENT ARRIVED HOWEVER, THE FIRE WAS ALREADY EXTINGUISHED. A POLICE REPORT WAS FILED. THE DRIVER STATED THAT A FIRE REPORT WAS NOT FILED. THE CONTACT STATED THAT THE DASHBOARD WAS DESTROYED. THE DRIVER SUSTAINED BURNS ON BOTH HANDS HOWEVER, MEDICAL ATTENTION WAS NOT SOUGHT. THE DRIVER CONTACTED FIESTA KIA (7400 LOMAS BLVD NE, ALBUQUERQUE, NM 87110, (505)999-2700) WHERE THE VEHICLE HAD BEEN PURCHASED ONLY 22 DAYS EARLIER. THE DEALER ARRIVED AT THE SCENE AND THE VEHICLE WAS TOWED TO THE DEALER WHERE IT REMAINED STILL UNREPAIRED. THE INSURANCE PROVIDER WAS CONTACTED AND INFORMED THE DRIVER THAT A FIRE INVESTIGATOR WOULD BE SENT OUT TO INSPECT THE VEHICLE, WHICH WAS STILL PENDING. THE VEHICLE WAS NOT REPAIRED. THE INSURANCE PROVIDER HAD NOT YET DECIDED WHETHER OR NOT THE VEHICLE WAS A TOTAL LOSS. THE MANUFACTURER WAS NOT CONTACTED OR INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 52,000.",
        "vin": "2T3WFREV8GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412949,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY, TRAVELING ABOUT 65MPH WHEN ALL OF THE SUDDEN I HEAR A LOUD BANG. I PULL OVER MY CAR AND NOTICE A LARGE HOLE IN MY SUNROOF. I DIDN'T PASS UNDER A BRIDGE AND THERE WAS NO EVIDENCE A ROCK OR OTHER OBJECT WAS DROPPED ON THE ROOF. ADDITIONALLY, THE GLASS WAS CURVED UPWARD, LIKE A BOTTLE TOP BURSTING FROM A BOTTLE. THE SUNROOF SEEMED TO SPONTANEOUSLY EXPLODE. I BELIEVE THE ONLY POSSIBLE EXPLANATION IS A MANUFACTURING DEFECT.",
        "vin": "JTMWFREV4GJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405450,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT WATER CONDENSATION....IN MADE IN JAPAN MODEL....MY HEADLIGHT GOT WATER CONDENSATION LOOKS WORST OVER THE TIME... I LOOK ON INTERNET N FOUND THAT'S RAV4 ASSEMBLED IN JAPAN HAS SPECIFIC WITH HEADLIGHTS....    HTTPS://WWW.RAV4WORLD.COM/THREADS/MOISTURE-IN-HEADLAMPS.294553/",
        "vin": "JTMWFREV8GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/27/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405116,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A PARKING LOT WHEN I STARTED MY CAR AND PUT IT IN REVERSE.  WITH MY FOOT ON THE BRAKE THE CAR REED WITH THE TACHOMETER REACHING THREE.  IT WAS DIFFICULT TO KEEP THE CAR FROM JUMPING BACKWARD.  THIS IS NOT THE FIRST TIME THIS HAS HAPPENED.  I HAD THE CAR CHECKED OUT ON APRIL 19, 2012.  AT THAT TIME I WAS TOLD THAT I MUST HAVE HIT THE BAKE AND GAS AT THE SAME TIME.  THEN I WAS TOLD THAT THE CAR COMPUTER HAS TO LEARN THE WAY I DRIVE.  I AM SCARED TO DRIVE MY CAR NOW BECAUSE I DON'T KNOW WHEN THIS WILL HAPPEN AGAIN.  I AM THROUGH BEING INSULTED.",
        "vin": "2T3BFREV6GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403332,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT THE KEY FOB FAILED TO START THE VEHCILE. ADDITIONALLY, THE REAR BRAKE LIGHTS WERE FILLED WITH WATER AND WERE INOPERABLE. THE CONTACT CALLED NYC MOTORCARS OF THE BRONX (3748 BOSTON RD, THE BRONX, NY 10469, (347) 966-4272) HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 39,000.",
        "vin": "2T3BFREV4GW"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402953,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE TO REPLACE BRAKES ONLY AFTER 20K MILES. BATTERY BECOME DEAD AFTER 25K MILES",
        "vin": "2T3RFREV9GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400257,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NAVIGATION DISPLAYS, RADIO AND ALL EQUIPMENT THAT USES IT QUITS AND SHUTS DOWN AND WILL GO OFF AND ON 3-8 TIMES AND THEN IT SEEMS TO BE OK. I WAS DRIVING THE VEHICLE DOWN THE HIGHWAY WHEN IT HAPPENS. THIS HAS HAPPEN MANY TIMES.",
        "vin": "JTMDJREV1GD"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399862,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AND CONTINUE TO HAVE BATTERY TROUBLE WITH MY TOYOTA RAV4. I FIRST BOUGHT A NEW 2014 AND AT MY REGULAR MAINTENANCE AT THE DEALERSHIP, THE BATTERY WAS REPLACED SEVERAL TIMES. I WAS UNCOMFORTABLE ENOUGH TO TRADE IT IN AND GET A NEW 2016. I STILL HAVE THIS ONE, BUT IT CONTINUES TO HAVE BATTERY TROUBLE. I HAVE BEEN LEFT STRANDED AT WORK WHEN MY CAR WOULD NOT START. THAT IS WHEN I FOUND MASSIVE AMOUNTS OF CORROSION, AND TO THIS DAY, THE TERMINALS CORRODE OVER EVEN WITH NEW BATTERY. THE PASSENGER DOOR DOES NOT ALWAYS LOCK WITH THE KEY BUTTON BC OF THIS ISSUE. I WOULD ESTIMATE I'VE REPLACED THE BATTERY 3-5 TIMES BETWEEN THE TWO CARS, WITH NO REAL SOLUTION. BATTERIES HAVE ALWAYS BEEN REPLACED/INSTALLED BY THE LOCAL TOYOTA DEALERSHIP. (I'M SURE INVOICES COULD BE PULLED IF NECESSARY) MY CARS HAVE NOT STALLED WHILE RUNNING, THEY WON'T START OR JUST START TO HAVE ELECTRICAL ISSUES W LIGHTS, AND IT GETS CHECKED BY THE DEALERSHIP. THEY USUALLY RECOMMEND REPLACEMENT WHILE THE BATTERY IS COVERED.  A SEPARATE BUT EQUALLY UNSETTLING ISSUE IS WITH THE WINDSHIELD. IT RECENTLY CRACKED DUE TO A PASSENGER FLICKING A BUG ON IT. YOU WOULD THINK A ROCK LANDED ON IT.",
        "vin": "2T3WFREV3GW"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399953,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A LOCAL ROAD I STARTED TO LOSE ELECTRICAL POWER. AT FIRST I LOST POWER STEERING AND SHORTLY AFTER THE HEAT STOPPED WORKING AND ALL THE LIGHTS ON THE DASHBOARD LIT UP. WHEN I BROUGHT THE CAR TO BE DIAGNOSED THE FUSE BOX HAD BEEN BURNED AND WIRES MELTED AND THERE WAS SMOKE INDICATING THERE HAD BEEN A FIRE AROUND THE FUSE/ELECTRICAL AREA",
        "vin": "JTMBFREV8GD"
    },
    {
        "components": "STRUCTURE,ENGINE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "01/01/2018",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398858,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW CAR CAUGHT FIRE IN THE FRONT WHILE IT WAS PARKED OUTSIDE A RESTAURANT. I CAME OUTSIDE TO LEAVE AND IT WAS TOWED AWAY. THE CAR WAS TOTALED FROM THE FIRE. I SAW THE RAV4 INVESTIGATION IS HAPPENING AND WANTED TO MAKE SURE YOU HAD MY REPORT INCLUDED. THE FIRE HAPPENED IN THE FRONT LEFT (AS IT WAS STATED IN THE ARTICLE OTHER CARS). I CAN SEND YOU ADDITIONAL DETAILS IF NEEDED BUT EVERYTHING IS MATCHING UP WITH THE OTHER INCIDENTS. IT WAS A BRAND NEW CAR WHICH IS WHY IT WAS SUCH A STRANGE EVENT.",
        "vin": "2T3DFREV3GW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "05/28/2020",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398767,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 TOYOTA RAV4. WHILE HER HUSBAND WAS MAKING A RIGHT TURN AT 30 MPH, THE VEHICLE ABRUPTLY SHUT OFF WITHOUT WARNING; HOWEVER, HER HUSBAND WAS ABLE TO RESTART THE VEHICLE UPON DEPRESSION OF THE ACCELERATOR PEDAL. AS THEY CONTINUED TO DRIVE, THE FAILURE OCCURRED TWO MORE TIMES AND AFTER THE THIRD FAILURE,  A BLACKISH SMOKE BEGAN TO EMIT FROM UNDERNEATH THE FRONT PASSENGER SIDE OF THE HOOD. THE CONTACT'S HUSBAND WAS ABLE TO EXIT THE VEHICLE AND EXTINGUISH THE FIRE WITH A WATER BOTTLE. THE AUTHORITIES WERE CALLED TO THE SCENE, AND THE FIRE DEPARTMENT REMOVED THE BATTERY FROM THE VEHICLE. A FIRE AND POLICE REPORT WERE FILED; NO INJURIES WERE REPORTED. DUE TO THE FAILURE, THE VEHICLE WAS TOWED TO SHEEHY TOYOTA OF STAFFORD(95 GARRISONVILLE RD, STAFFORD, VA 22554) WHERE THEY INITIALLY GAVE THE CONTACT  AN ESTIMATE TO REPLACE THE VEHICLE PARTS IN ORDER TO CHECK IF THE VEHICLE WAS STILL OPERABLE. DUE TO THE HIGH COST OF THE REPAIR, HER INSURANCE COMPANY DEEMED THE VEHICLE TOTAL LOSS AND WAS DESTROYED. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD BEEN DESTROYED. THE FAILURE MILEAGE WAS 44,156.  *BF  THE CONSUMER PROVIDED THE REPORT FROM THE FIRE DEPARTMENT.",
        "vin": "2T3YFREV8GW"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/10/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396199,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SAYS IS SOMETHING WRONG WITH THE ECO OR PCM",
        "vin": "2T3BFREV9GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385271,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES MY BRAKES WORK NORMALLY. OTHER TIMES, THE BRAKE PEDAL WILL BE HARD TO PUSH, AND THE BRAKE PEDAL WILL NOT COME BACK UP WHEN I RELEASE IT. IF I DON'T PULL THE PEDAL BACK UP WITH MY FOOT, BRAKES WILL CONTINUE TO BE APPLIED EVEN WHEN I'M ACCELERATING. I CAN'T TELL WHY THEY WORK SOMETIMES AND NOT OTHERS. I COULD SPEND 4 HOURS DRIVING AROUND WITH STICKY BRAKES, AND THEN SUDDENLY, THEY'RE FINE.",
        "vin": "JTMDJREV9GD"
    },
    {
        "components": "LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMERA NOT WORKING PROPERLY",
        "vin": "JTMJFREV2GD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/09/2020",
        "dateOfIncident": "11/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382713,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BARELY HAD MY 2016 TOYOTA RAV4 A YEAR, WHEN LAST WEEK JUST LEFT WORK AND TURNED ONTO THE HWY ABOUT 10 MIN GOING ABOUT 65 MPH ON A STRAIGHT STRETCH. ALL OF A SUDDEN I HEARD A BLAST. FIRST I THOUGHT SOMEONE SHOT THE CAR, THEN THOUGHT MUST HAVE BLOWN A TIRE, BUT IT WAS STEERING FINE. I HEARD AIR AND LOOKED UP AT THE SUNROOF AND IT HAD SHATTERED AND EXPLODED, BIG CHUNK HAD BLOWN OUT. MORE LITTLE PIECES WERE BLOWING OUT SO I SHUT THE COVER. TOOK A PICTURE OF MY DISPLAY SHOWING TEMP, SPEED ETC. WASN'T SURE WHAT TO DO, I WAS 30 MILES FROM TOWN, SO I DROVE TO GAS STATION FOR GAS, AND TOOK PICTURES. NEXT MORNING CALLED TOYOTA AND TOLD THEM WHAT HAPPENED. HE MADE ME AN APPT. FOR LATER THAT DAY. I SAID IT SHOULD BE NO COST TO ME AS IT'S OBVIOUSLY A DEFECT IN THE SUNROOF. HE SAID WE WILL TAKE A LOOK AT IT AND SEE IF A ROCK HIT IT OR SOMETHING. I SAID \"NO ROCK HIT IT, IT JUST EXPLODED FOR NO REASON\". WENT TO APPT AND SERVICE GUY HAD ONLY BEEN ON THE JOB FOR A COUPLE OF WEEKS, THEY SENT OUT MAINTENANCE MANAGER. SHE TRIED TO TELL ME A ROCK MUST HAVE HIT IT, I ARGUED THAT NOTHING HIT IT, IT JUST EXPLODED. THEN SERVICE DIRECTOR CAME OUT, HE SAID THERE'S NO WAY TO PROVE WHAT HAPPENED AND THAT IT SHOULD BE COVERED UNDER MY INSURANCE COMPREHENSIVE FOR GLASS REPAIR. I SAID SURE WITH A $500 DEDUCTIBLE THAT I WILL HAVE TO PAY. HE SAID WELL THERE'S NOTHING THAT WE CAN DO. THEY WROTE UP A REPAIR QUOTE AND GAVE THAT TO ME. THEN A COUPLE GUYS COVERED THE SUNROOF WITH STICKY PLASTIC TO KEEP THE RAIN AND OTHER STUFF OUT. OTHER THAN THAT THEY WERE NO HELP, THEY SAID THEY HAD NEVER HEARD OF THIS HAPPENING, WHICH I FIND HARD TO BELIEVE, SO WHEN I GOT HOME I RESEARCHED EXPLODING SUNROOFS AND FOUND THAT THERE ARE HUNDREDS OF COMPLAINTS. I FEEL IT IS A DEFECTIVE SUNROOF AND TOYOTA SHOULD PAY FOR THE REPAIRS.",
        "vin": "2T3DFREV8GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376241,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL 4 TAIL LIGHTS ARE DEVELOPING A WHITE HAZE ON THE INSIDE OF THE LENS THAT WILL EVENTUALLY AFFECT THE VISIBILITY OF THE AFFECTED SAFETY LIGHT. THIS INTERNAL LENS CONTAMINATION CANNOT BE CLEANED AND WILL CAUSE THE LIGHTS TO FAIL TO MEET THEIR ORIGINAL DOT APPROVED SPECIFICATIONS CREATING A SAFETY/CRASH HAZARD.     THIS DEFECT APPEARS TO AFFECT ALL 2016-2018 RAV4S SUPPLIED WITH LIGHT ASSEMBLIES MADE BY ICHIKOH/VALEO. NOTE: THIS ISSUE IS NOT CAUSED BY ISOLATED DEFECTIVE CRACKED OR BROKEN LIGHT ASSEMBLIES CONTAMINATED BY WATER. BASED ON MY OWN VEHICLE AND A ROUGH PARKING LOT SURVEY ALL OF THESE LIGHTS WILL DEVELOP THIS ISSUE OVER TIME.    MY CURRENT WORKING THEORY IS THAT THIS INSIDE LENS FOGGING IS CAUSED BY LEACHING PLASTICIZERS FROM THE LIGHT ASSEMBLIES COMPONENTS VAPORIZING AND THEN DEPOSITING ON THE INSIDE OF THE LENS. THE AMOUNT OF SUNLIGHT RECEIVED SEEMS TO CORRELATE WITH THE SEVERITY OF THE ISSUE.",
        "vin": "2T3YFREV8GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE BE AWARE THAT NEWER TOYOTA CAR AND TRUCK MODELS ARE NOT COMPATIBLE FOR THE MOST PART, WITH THE LATEST TO SERIES OF APPLE IPHONES, THE 11 AND THE JUST RELEASED 12 SERIES. THIS HAS BEEN A KNOWN ISSUE FOR OVER A YEAR, YET  NO RESOLUTION HAS BEEN PROVIDED. THIS IS A POTENTIAL SAFETY HAZARD ESPECIALLY IN STATES THAT REQUIRE HANDS FREE USE OF A CELL PHONE WHILE OPERATING A VEHICLE. HOW CAN TWO LARGE COMPANIES NOT WORK TOGETHER TO PROVIDE THE NECESSARY INTEGRATION BETWEEN THEIR PRODUCTS TO ALLOW SAFE OPERATION OF THEIR VEHICLES AND PHONE. I ASK TO NHTSA TO INVESTIGATE THIS MATTER AND TAKE PROPER ACTIONS TO MITIGATE THIS RISK ASAP.",
        "vin": "JTMWFREV2GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367043,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT WHILE HER HUSBAND WAS DRIVING 65 MPH AND APPROACHING AN EXIT OFF THE FREEWAY RAMP, THE CONTACT DEPRESSED THE BRAKE PEDAL WHICH FAILED TO ENGAGE PROPERLY AS THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD. THE CONTACTS HUSBAND PUMPED THE BRAKE PEDAL A COUPLE OF TIMES BUT FAILED TO RESPOND CAUSING THE VEHICLE TO CROSSOVER A 4 LANE HIGHWAY, ONTO A UPHILL ONRAMP WHERE IT CAME TO A STOP AFTER CRASHING INTO A CURB. THE VEHICLE WAS RESTARTED AND THE VEHICLE RESUMED TO NORMAL. THE VEHICLE RECEIVED MINOR DAMAGE TO THE PASSENGER FRONT TIRE, AND THE RIM WAS CRACKED. THE VEHICLE WAS TOWED TO A DEALER (BALISE TOYOTA 1399 RIVERDALE ST, WEST SPRINGFIELD, MA 01089 (413) 306-3037) HOWEVER THE VEHICLE WAS NOT DIAGNOSED OR SEEN. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT A TECHNICIAN WOULD GO OUT TO THE DEALER AND INSPECTED THE VEHICLE RECORDERS WHICH DETERMINED NO FAULTY CODES. THE FAILURE MILEAGE WAS APPROXIMATELY 40,132.",
        "vin": "JTMRJREV0GD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364685,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT HE NOTICED MOISTURE COMING FROM THE FLOOR ON THE FRONT PASSENGER'S SIDE OF THE VEHICLE. THE CONDITION WAS NOTICEABLE AFTER IT RAINED OR WHEN THE AIR CONDITIONER WAS BEING USED. THE VEHICLE WAS TAKEN TO THE DEALER LONGO TOYOTA 3534 N. PECK RD., EL MONTE, CA 91731, (626) 539-2403. THE MECHANIC WAS UNABLE DIAGNOSE THE ISSUE SINCE THE FLOOR AREA WAS DRIED. IT WAS SUGGESTED TO THE CONTACT TO BRING THE VEHICLE BACK ANOTHER TIME. THE VEHICLE WAS RETURNED TO THE DEALER AND DIAGNOSED THAT THE AIR CONDITIONING DRAIN HOSE UNDERNEATH THE FLOOR WAS CLOGGED WITH SPIDER WEBBING. THE FLOOR UNDERNEATH THE CARPET WAS COVERED IN MOLD AND MILDEW DUE TO THE MOISTURE. THE CONTACT WAS CONCERNED ABOUT A HEALTH RISK FROM THE MOLD AND MILDEW. THE DEALER QUOTED A REPAIR COST OF $4,000 TO $5,000. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 19,000.",
        "vin": "JTMDJREV2GD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/26/2020",
        "dateOfIncident": "08/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351453,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT THE BRAKE SYSTEM FAILED. THE CONTACT STATED WHEN THE DRIVER DROVE AT 60 MPH, THE VEHICLE IN FRONT MADE A SUDDEN STOP AND WHEN THE DRIVER ENGAGED THE BRAKE PEDAL IT WENT TO THE FLOOR BOARD AND CAUSED THE DRIVER TO CRASH INTO THE TRUCK'S REAR END. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER FOR INSPECTION. HOWEVER, THE DEALER TEST DROVE THE VEHICLE AND WAS UNABLE TO DUPLICATE THE FAILURE. THE CONTACT ALSO WANTED TO ADVISE THAT THE BRAKE PADS WAS PREVIOUSLY REPLACED BY AN UNKNOWN DEALER BECAUSE THE CONTACT HAD NOTICED THAT TOOK A LONGER TIME FOR THE BRAKE TO ENGAGE WHEN THE VEHICLE WAS DRIVEN OVER 60 MPH. THERE WERE NO INJURIES TO REPORT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "2T3BFREV3GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349228,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR DOOR LOCKS HAVE MALFUNCTIONED. EACH HAVE BEEN REPLACED. NOW THE REPLACEMENTS ARE ALSO FAILING.   THE DOORS DO NOT LOCK OR UNLOCK WITH THE KEY FOB. MAKING IT IMPOSSIBLE TO GET INTO THE CAR WHEN I START THE CAR, THE DOORS ARE SUPPOSED TO LOCK AUTOMATICALLY, WHICH DOES NOT HAPPEN. MAKING IT INCREDIBLY UNSAFE ALL OF THE INFORMATION IS AT NORTH HOLLYWOOD TOYOTA IT HAS BEEN GOING ON SINCE 2018.",
        "vin": "JTMWFREV3GJ"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349000,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT WHILE DRIVING AND TAPPING ON THE BRAKE PEDAL TO SLOW THE VEHICLE, THE FRONT-END VIBRATED ABNORMALLY. THE VEHICLE WAS TAKEN TO THE KOONS FORD OF BALTIMORE DEALER LOCATED AT 6970 SECURITY BLVD, WOODLAWN, MD 21244, WHERE THE BRAKE PADS AND BRAKE ROTORS WERE REPLACED. THE FAILURE RECURRED AND THE VEHICLE VIBRATED MUCH HARDER AND WAS TAKEN BACK TO THE SAME DEALER WHO THEN REPLACED A PIECE OF RUBBER AROUND THE BRAKE PEDAL. THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS NOT PROVIDED.",
        "vin": "2T3RFREV2GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2020",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341454,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A CITY STREET AND I HEARD A LOUD CRACKING SOUND. MY SUNROOF CRACKED AND THE GLASS SHATTERED. I WAS NOT UNDER ANY SORT OF UNDERPASS OR TREE.",
        "vin": "JTMRJREV7GD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339178,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW APPLE IPHONE 11PROMAX. NO LONGER CAN GET HANDS FREE TEXTING SO SAFETY COMPROMISED. STATIONARY ,IN MOTION ALL ROADS",
        "vin": "2T3WFREV7GW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "05/12/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338271,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, BETWEEN 2,000-3,000 RPM, THE VEHICLE JOLTED BACKWARD AND STALLED WITHOUT WARNING. THE VEHICLE SHUDDERED AND THE BRAKE PEDAL WAS DEPRESSED TO REGAIN CONTROL OF THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO JACK TAYLOR'S ALEXANDRIA TOYOTA (3750 RICHMOND HWY, ALEXANDRIA, VA 22305) WHERE A DIAGNOSTIC TEST WAS PERFORMED. THE CONTACT WAS INFORMED THAT THE DEFECT WAS RELATED TO THE TORQUE CONVERTER. THE CONTACT WAS INFORMED THAT THE TORQUE CONVERTER NEEDED TO BE REPLACED, AND WAS GIVEN AN ESTIMATE FOR THE REPAIR. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "JTMBFREV8GJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER INTERVALS DO NOT CHANGE SPEED AND THE FASTEST SETTING IS INADEQUATE IN HEAVY RAIN.  *TR",
        "vin": "JTMRFREV8GJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322500,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A DEER HEAD ON GOING ROUGHLY 70 MPH, AIRBAGS DIDN'T GO OFF AND RADIATOR AND SENSOR GOT PUSHED INTO THE CAR. WAS ON THE HIGHWAY JUST OUTSIDE OF GILLETE, WY WHEN IT OCCURED.",
        "vin": "2T3RFREV3GW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310180,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HATCH MOTOR FAILED. HATCH WILL NOT OPEN. TOYOTA ADMITS FAULT/DEFECT, BUT REFUSES TO COVER COSTS ASSOCIATED WITH FIXING IT.",
        "vin": "2T3WFREV7GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11297938,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV-4. THE CONTACT STATED THAT WHILE ATTEMPTING TO PARK THE VEHICLE AT A LOW RATE OF SPEED, THE BRAKES FAILED WITHOUT WARNING AND THE VEHICLE DROVE INTO A BRICK PILLAR. THE AIR BAGS DID NOT DEPLOY UPON IMPACT. POLICE WERE CALLED AND A REPORT WAS FILED; NO MEDICAL ASSISTANCE WAS GIVEN AT THE SCENE. THE CONTACT'S WIFE SUFFERED BRUISING ACROSS HER CHEST DUE TO THE SEAT BELT. THE VEHICLE WAS TOWED FROM THE SCENE TO THE CONTACT'S HOME AND WAS REPAIRED AT AN INDEPENDENT AUTO BODY SHOP. THE MANUFACTURER WAS NOTIFIED OF THE MATTER AND WAS INFORMED THAT AN INTERNAL INVESTIGATION WOULD BE LAUNCHED. THE FAILURE MILEAGE WAS 49,623.",
        "vin": "JTMDJREV9GD"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297434,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING HARNESS WAS CHEW COMPLETELY UP. THIS AFFECTED MY POWER BRAKES, ENGINE,STEERING SYSTEM, ETC. THESE LIGHTS CAME ON WHILE DRIVING THE CAR! RATS CHEWED MY WIRING .",
        "vin": "JTMZFREV8GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290997,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR PHONE DOES NOT WORK WITH MY IPHONE 11 PRO MAX. I HAVE A 2016 TOYOTA RAV4 HYBRID. THE BLUETOOTH ON MY NEW PHONE WELL NOT PAIR WITH MY ETUNE SOFTWARE. TBE PHONE CAN'T EVEN  DISCOVER IT. WHEN IT FINALLY FAILS MY SCREEN ON MY CAT PHONE SAYS NO MICROPHONE DETECTED. ROTORS SAYS IT'S AN APPLE SOFTWARE PROBLEM. JUS A SAFETY ISSUE. I DRIVE AND WORK OUT OF MY CAR SIX DAYS A WEEK.",
        "vin": "JTMDJREV0GD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289507,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RAV4 HYBRID LIMITED WITH NAVIGATION. THE NAVIGATION CONTROL [MAPS / RADIO / VOLUME CONTROL] FREEZES SUDDENLY AND SCREEN IS NOT MANAGEABLE UNTIL THE CAR STOPS, ENGINE TURNED OFF AND BACK ON. ONE TIME, RADIO WAS LOUD, AND COULD NOT TURN IT DOWN AS THE SCREEN WAS FROZEN.  HAS HAPPENED ABOUT ONCE EVERY TWO WEEKS.",
        "vin": "JTMDJREV5GD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/14/2019",
        "dateOfIncident": "12/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289050,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE SEAT WHEN MOVED BACK, LOCKS IN AND WON'T MOVE FORWARD.  THIS HAPPENED AT A CAR WASH WHEN CAR WAS NOT MOVING.",
        "vin": "2T3WFREV5GW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11288810,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 TOYOTA RAV4. WHILE DRIVING, THE CONTACT HAD TO QUICKLY VEER OUT OF THE WAY TO AVOID STRIKING ANOTHER VEHICLE. AS A RESULT, HE CRASHED INTO A TREE AT 42 MPH. NONE OF THE AIR BAGS DEPLOYED. THE CONTACT SUSTAINED INJURIES TO THE CHEST AND SHOULDER, AND ALSO HAD WHIPLASH. THE CONTACT WAS TRANSPORTED BY AMBULANCE TO THE HOSPITAL. A POLICE REPORT WAS FILED. THE DAMAGE TO THE VEHICLE WAS EXTENSIVE, PRIMARILY IN THE FRONT. THE INSURANCE COMPANY DECLARED THE VEHICLE DESTROYED. THE VEHICLE WAS TOWED FROM THE SCENE TO A BODY SHOP. THE MANUFACTURER HIRED AN INDEPENDENT ENGINEERING FIRM THAT TOOK THE INFORMATION FROM THE VEHICLE'S BLACK BOX. THEIR FINDINGS STATED THAT ALL OF THE SENSORS WERE WORKING AND THE VEHICLE'S SPEED WAS 42 MPH. THE REASON THE AIR BAGS DID NOT DEPLOY WAS \"INSUFFICIENT DECELERATION\". THE DEALER HAD NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 90,000.  *LN  *TR *DT *DL",
        "vin": "JTMBFREV3GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2019",
        "dateOfIncident": "11/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282708,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REVIEW CAMERA DOES NOT PROVIDE ANY PICTURE WHEN THE SUN SHINES DIRECTLY INTO THE WINDSHIELD THAT ALMOST CAUSED A COLLISION WITH PEDESTRIANS WITH CHILDREN. I WAS BACKING UP FROM THE PARKING SPACE. THANKS GOD NOTHING HAPPENED BUT THIS CAMERA SCREEN MUST BE RECALLED. I REPORTED IT TO PALM BEACH TOTOTA REP. WHEN I DISCOVERED IT BUT I DID NOT HEAR ANYTHING ABOUT HOW TO FIX THE PROBLEM. THE SCREEN BECAME DARK AS LCD SCREENS MANUFACTURED YEARS AGO IF YOU REMEMBER. TOYOTA RAV4-2016 THAT I DROVE BEFORE HAD EXCELLENT SCREEN AND CLEAR PICTURE THAT DID NOT AFFECTED BY ANY LIGHT.",
        "vin": "2T3WFREV5GW"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/16/2019",
        "dateOfIncident": "11/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280463,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHTS COMES ON AND OFF FROM THE DASH ALL THE TIME, I WENT TO A DEALERSHIP AND THEY TOLD ME THAT THERE IS NOTHING THEY CAM DO ABOUT IT BECAUSE THE LIGHT WASN'T ON WHEN I WENT THERE BUT I THINK THEY COULD AT LEAST TAKE A LOOK AT IT BUT THEY DIDN'T CARE, IT'S A SAFETY PROBLEM AND THEY SHOULD BE MORE CAREFUL WITH THESE KIND OF PROBLEM",
        "vin": "JTMBFREV2GJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/19/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269566,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO HIGHBEAM FEATURE WORKS INTERMITTENTLY.",
        "vin": "2T3DFREV2GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268870,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT NIGHT WITH THE LOW BEAMS ON THE VISIBILITY DISTANCE IS LIMITED TO ABOUT 60 FEET.  AFTER THAT ALL THAT YOU CAN SEE IS A BLACK VEIL LIKE A CURTAIN HUNG OVER THE LIGHTS.  NOTHING CAN BE SEEN OR DETECTED IN THE DARKNESS BEYOND WHERE THE LIGHT ABRUPTLY ENDS PRESENTING A VERY DANGEROUS DRIVING EXPERIENCE.  THE CONDITION IS AMPLIFIED ON DARK COUNTRY ROADS WHERE THERE IS NO STREET LIGHTING OR OTHER AMBIENT LIGHT.  DRIVING ON HIGH BEAMS IS THE ONLY SAFE OPTION, BUT EVEN THEN THE HIGH BEAMS CONFLICT WITH EACH SIDE AND THERE IS NO PERIPHERAL VISION MAKING TURNING A SAFETY ISSUE AS WELL.  SEARCHING THE INTERNET ABOUT THIS PROBLEM BRINGS UP A NUMBER OF SIMILAR COMPLAINTS NOT ONLY FOR THE 2016 RAV 4 LE BUT THROUGH 2018 AS WELL.  DRIVING UNDER THESE CIRCUMSTANCES IS A VERY DANGEROUS COMMUTE, AND SOME OF THE COMPLAINTS INCLUDE HITTING DEER, DRIVING OFF THE ROAD WHILE TURNING, AND NOT BEING ABLE TO DETECT ANY MOVEMENT OR OBSTACLES IN THE CURTAIN OF DARKNESS THAT THESE HEADLIGHTS CREATE.  STATEMENTS IN THE COMPLAINTS MENTION THAT THE DEALERSHIPS SAY THEY CANNOT FIX THE PROBLEM BECAUSE IT IS A MANUFACTURED PROBLEM AND THEY CAN ONLY ADJUST TO TOYOTA'S SPECS.  THE HEADLIGHTS ARE EXTREMELY SMALL ON THIS VEHICLE SO I'M NOT SURE WHAT THE SOLUTION IS.  AS FAR AS I KNOW NO ONE HAS BEEN SERIOUSLY INJURED BECAUSE OF THIS FLAW, BUT PERHAPS IT IS ONLY A MATTER OF TIME BEFORE THAT OCCURS, UNLESS THIS VERY DANGEROUS PROBLEM CAN BE CORRECTED.  IT IS IMPOSSIBLE TO DRIVE SAFELY IN THIS VEHICLE WITH THE LOW BEAMS ON.  AND TO DRIVE WITH ONLY THE HIGH BEAMS AT ALL TIMES PRESENTS ANOTHER HAZARD TO ONCOMING TRAFFIC.  THIS PROBLEM HAS TO BE ADDRESSED BY TOYOTA MANUFACTURING BEFORE THE WORST HAPPENS BECAUSE OF IT.  I AM ATTACHING PICTURES TAKEN OUT OF THE WINDSHIELD THAT SHOWS THE LIMITED SIGHT DISTANCE AND THE CURTAIN OF DARKNESS THAT FALLS BEYOND THE LIGHT.",
        "vin": "JTMZFREV5GJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268896,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN ADDENDUM TO COMPLAINT #11268870, CONCERNING A HEADLIGHT PROBLEM WITH OUR 2016 RAV 4 LE.  THE CURTAIN OF DARKNESS CREATED BY THE LOW BEAM HEADLIGHTS MOVES UP AND DOWN WITH THE MOVEMENT OF THE CAR AS THE VEHICLE ADJUSTS TO THE VAGARIES OF THE ROAD.  IT BECOMES A DANGEROUS DISTRACTION BECAUSE YOU ARE TRYING TO SEE WHAT IS IN FRONT OF YOU, WHICH IS IMPOSSIBLE PAST ABOUT 60 FEET.  SO YOU ARE DEALING NOT ONLY WITH LIMITED SIGHT DISTANCE AND AN OMINOUS CURTAIN OF DARKNESS, ITS DIFFICULT TO DRIVE SAFELY BECAUSE THE DARKNESS CONTINUES TO MOVE UP AND DOWN AS YOU DRIVE CAUSING A SERIOUS DIVERSION OF CONCENTRATION.   PUTTING ALL THE FACTORS TOGETHER CREATES A VERY STRESSFUL, ANNOYING AND DANGEROUS SITUATION.",
        "vin": "JTMZFREV5GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "07/31/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267112,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS SYSTEM LIGHT IS ON AND THERE IS NO COVERAGE PLUS I DID NOT GET THE RECALL OF 2016. I AM ON LONG-TERM DISABILITY AND THIS IS EXPENSIVE TO REPAIR.",
        "vin": "JTMWFREV5GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "01/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255670,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE SQUEAKY AT A LOW RATE OF SPEED (20 MPH AND LESS) AT APPROXIMATELY 20K MILES.",
        "vin": "2T3RFREV4GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "08/26/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11254693,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 20 MPH, THE VEHICLE DID NOT STOP WHEN THE BRAKE PEDAL WAS DEPRESSED. AS A RESULT, THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF A SECOND VEHICLE. IN TURN, THE SECOND VEHICLE CRASHED INTO A THIRD VEHICLE. THE CONTACT'S AIR BAGS DID NOT DEPLOY. THE DRIVER AND THE TWO OCCUPANTS IN THE SECOND VEHICLE SUSTAINED MINOR NECK INJURIES. MEDICAL ATTENTION WAS RECEIVED. POLICE REPORT NUMBER: 197537 WAS FILED AND THE VEHICLE WAS TOWED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND AN UNKNOWN DEALER WERE NOTIFIED. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "JTMZFREV6GD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "12/18/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253256,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT RECEIVED NOTIFICATION OF AN UNKNOWN RECALL REGARDING THE STRUCTURE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PINE BELT SUBARU (1104 NJ-88, LAKEWOOD, NJ 08701, (732) 719-4521) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T3BFREV9GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245763,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2016 RAV4 FROM LOCAL TOYOTA DEALER IN JUNE 2019.  HAD BADLY FOGGED TAIL LIGHTS ON PURCHASE (AS DID FOUR OTHER 2016 RAV4S I LOOKED AT ON DEALER LOTS).  PAID LOCAL AUTO REPAIR SHOP $650 ON 6/24/19 TO REPLACE TAIL LIGHTS WITH OEM.  LESS THAN 2 MONTHS LATER (8/17/19) HAD RAIL STORM AND SAW CONDENSATION INSIDE RIM OF ALL 4 TAIL LIGHTS.  CAN REPLACE THEM AGAIN BUT THIS IS OBVIOUSLY A FACTORY DEFECT THAT TOYOTA HAS NOT ACKNOWLEDGED.  IT IS A SAFETY ISSUE WHEN LIGHTS ARE DIMMED FROM FOGGING.",
        "vin": "JTMYFREVXGD"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CV JOINS ON BOTH SIDES WORE OFF TO PREMATURE. I HAD TO FIXED IT BECAUSE OF THE NOISE THEY WERE MAKING. IT BEGAN WITH LESS THAN 60K MILES.  I THOUGHT IT WAS A SAFETY ISSUE. MANY NEW TOYOTAS ARE HAVING THE SAME ISSU.",
        "vin": "2T3WFREVXGW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "06/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAK AND DAMAGE  DRAIN TUBES IN DPILLAR PLUGGED BY DEBRIS.  WATER LEAKED INTO HEADLINER,  SOAKED FLOOR AND CAUSED SMELL AND MOLD GROWTH.  COST INSURANCE A BUNDLE.  DEALER DID NOT SPECIFY CAUSE BUT CHARGED ME FOR \"SERVICING\" AUTO. THE RUGS WERE REMOVED, CLEANED, AND THE INSULATION REMOVED.",
        "vin": "2T3YFREV4GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2019",
        "dateOfIncident": "07/27/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235293,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED MY 2016 RAV4 LIMITED ON 7/27/2019.  AFTER STARTING IT NONE OF THE SAFETY FEATURES ARE WORKING.   THIS APPEARS TO BE A KNOWN ISSUE AMONG OTHER TOYOTA OWNERS.  THE VEHICLE WAS FINE WHEN I SHUT IT OFF THE NIGHT BEFORE.  NOW ANTI LOCK BRAKING, LANE DEPARTURE ALERT, PRE-COLLISION SYSTEM,  AND ADAPTIVE CRUISE CONTROL ARE ALL FAILING.",
        "vin": "2T3DFREV5GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "04/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MOONROOF DRAIN CLOGGED AND CAUSED WATER TO RUN DOWN A FRAME AND SEEP UNDER CARPET. VEHICLE IS NOW FULL OF MOLD DUE TO THE LEAK. AT THIS TIME THE LEAK IS FIXED BUT THE MOLD ISSUE PERSISTS. THIS BEEN CONFIRMED BY DEALER AND TOYOTA NATIONAL OFFICE. THERE IS NO MENTION OF THE DRAIN OR DRAIN MAINTENANCE IN THE MANUAL. THE MOLD IS A SERIOUS HEALTH HAZARD. MY CURTAIN AIR BAG IS ALSO PROBABLY DAMAGED DUE TO WATER RUNNING DOWN THE FRAME. THE WATER MUST HAVE BEEN LEAKING FOR A WHILE BUT I DID NOT BECOME AWARE OF THE PROBLEM UNDER THE MOLD STARTED TO SMELL WHEN THE WEATHER GOT WARM. THE WATER ALSO HAS THE POTENTIAL TO DAMAGE CRUCIAL ELECTRICAL EQUIPMENT. NATIONAL TOYOTA OFFICE AND THE DEALER ARE DISMISSIVE ABOUT THE ISSUE. TOYOTA'S SOLUTION TO THIS PROBLEM IS \"CALL YOUR INSURANCE\" INSTEAD OF TAKING RESPONSIBILITY FOR NOT INFORMING THE CONSUMER ABOUT THE DRAINS. I WOULD NOT HAVE THIS ISSUE IF I WAS INFORMED TO PERIODICALLY CHECK THE DRAINS FOR DEBRIS. MY RAV4 FOR 41K MILES ON IT. USE IS NORMAL.",
        "vin": "2T3RFREV9GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220945,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES SEEM TO SCRAPE ABOUT THE FIRST 5 TIMES I USE THEM THEN THE SOUND GOES AWAY",
        "vin": "JTMRFREV7GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208842,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS ONLY 22,700 MILES. FRONTS END BRAKES AND ROTOR ARE TOTALLY WORN OUT. THE CAR WAS DRIVEN NORMALLY.",
        "vin": "JTMBFREV3GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192556,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A RED LIGHT THE VEHICLE ACCELERATED AND LUNGED FORWARD. BRAKES WOULD NOT HOLD THE VEHICLE FROM GOING FORWARD. HAD TO TURN THE VEHICLE OFF.",
        "vin": "2T3WFREV2GW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192558,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA RAV4 WAS STOPPED AT RED LIGHT AND SUDDENLY ACCELERATED AT HIGH RPM CAUSING THE VEHICLE TO LUNG FORWARD.  HOLDING THE BRAKE PEDAL HARD DID NOT KEEP THE VEHICLE FROM GOING FORWARD. THERE WAS NO TRAFFIC AT THE TIME, WAS STOPPED AT A RED LIGHT WITH BRAKE ENGAGED, AT INTERSECTION ON US17, JACKSONVILLE, FL. VERY SERIOUS SAFETY DISCREPANCY THAT HAS POTENTIAL TO CAUSE SEVERE ACCIDENT AND OR FATALITY.",
        "vin": "2T3WFREV2GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2019",
        "dateOfIncident": "08/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184350,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE ATTEMPTING TO MAKE A TURN FROM A STOP, THE VEHICLE LOST POWER. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE VEHICLE RESTARTED WITHIN TWO SECONDS, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO GETTEL TOYOTA OF LAKEWOOD (941-567-1080, LOCATED AT 5959 E. STATE RD 64, BRADENTON, FL 34208) WHERE IT WAS DETERMINED THAT THE VEHICLE WAS PERFORMING AS DESIGNED. THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND DID NOT ASSIST. THE FAILURE WAS NOT REMEDIED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "2T3YFREV3GW"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE PROBLEM WITH CV JOINT LESS 30,000 MILES, TOYOTA TELL ME EVERYTHING IS GOOD WITH THE SUV, BUT HAVE SOME NOISE, NOW DON'T HAVE GOOD STABILITY WHEN A DRIVE",
        "vin": "2T3ZFREV9GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A GRINDING NOISE IN THE FRONT BRAKES AND TOOK IT TO THE DEALER A COUPLE OF TIMES FINALLY THEY REPLACED THE BRAKES AND TURN THE ROTORS  THAT WAS ABOUT SEVEN MONTHS AGO THAT  NOISE STARTED AND THEY REPLACE THEM ABOUT A MONTH AGO  AND NOW THEY'RE MAKING NOISE AGAIN I DON'T KNOW THERE'S A PROBLEM OR A DEFECT",
        "vin": "2T3ZFREV9GW"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155604,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO, MY SUNROOF SHATTERED WITHOUT WARNING. ONE MORNING, I DECIDED TO OPEN MY SUNROOF. WHEN I PRESSED THE OPEN BUTTON, THE SUNROOF MADE A CRACKING NOISE THAT GOT WORSE AS THE SUNROOF OPENED. I WAS ON A RESIDENTIAL STREET AT THE TIME. TEMP: ABOUT 65 DEGREES.,OVERCAST.",
        "vin": "273FREVOGW2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "09/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154139,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON THIS VEHICLE ARE NOT ADEQUATE.  THE LOW BEAM HEADLIGHTS DO NOT PROJECT FAR ENOUGH DOWN THE ROAD TO SEE OBJECTS ON THE ROAD, ESPECIALLY AT HIGHWAY SPEEDS.  ON THE NIGHT OF SEPTEMBER 16, 2017, I NEARLY HIT TWO DEER ON THE INTERSTATE HIGHWAY BECAUSE I COULD NOT SEE THEM.",
        "vin": "JTMBFREV5GJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151708,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4 HYBRID. WHILE THE VEHICLE WAS STATIONARY AND WHILE DRIVING VARIOUS SPEEDS, THE CHROME TRIM ON THE DASHBOARD SIGNIFICANTLY REDUCED THE DRIVER'S VISIBILITY ON SEVERAL OCCASIONS. THE CONTACT STATED THAT THE VIEW OF THE FRONT SIDE MIRRORS WERE OBSTRUCTED BY A SHINY GLARE THAT CREATED A BLINDING EFFECT. THE CONTACT STATED THAT THE LACK OF VISIBILITY BECAME MORE PROMINENT AND PERSISTENT IN THE FRONT DRIVER'S SIDE MIRROR WHEN THE SUN WAS PRESENT. STEVINSON TOYOTA WEST (780 DENVER WEST COLORADO MILLS BLVD, LAKEWOOD, COLORADO 80401, (720) 259-2544) WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO AN INDEPENDENT BODY REPAIR SHOP. THE INDEPENDENT MECHANIC REPAIRED THE VEHICLE BY APPLYING A FABRIC MASKING TAPE TO THE CHROME TRIM OF THE DASHBOARD. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 36.",
        "vin": "JTMDJREV4GD"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE COMPLAINED ABOUT THE HEADLIGHTS FROM DAY ONE.  THE DEALERSHIP SAID THE HEADLIGHTS ARE ADJUSTED PROPERLY.  SINCE THEN MY WIFE HAS HIT A DEER BECAUSE SHE CAN NOT SEE MORE THAN ONE CAR LENGTH IN FRONT WITHOUT THE HIGH BEAMS ON.  NOW SHE ALWAYS DRIVES WITH THE HIGH BEAMS ON.  THISORNING SHE WAS VERBALLY ACCOSTED FROM ANOTHER DRIVER FOR DRIVING WITH HER HIGH BEAMS ON.   WE LIVE IN A MORE RURAL AREA WITH VERY FEW STREET LIGHTS.  GET A RAV 4 PUT IT IN A TOTALLY DARK AREA AND TURN ON THE HEAD LIGHTS.  MEASURE THE DISTANCE BETWEEN BUMPER AND END OF LIGHT.  THEN YOU WILL SEE THE ISSUE.  THE LIGHTS MIGHT HAVE THE SQUARE FOOTAGE REQUIREMENT MEET BUT THE SQUARE FOOTAGE GOES LEFT AND RIGHT AND NOT FORWARD WHILE DRIVING.",
        "vin": "2T3ZFREV9GW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "10/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139299,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. AFTER THE VEHICLE WAS STARTED AND THE GEAR SHIFTER WAS PLACED IN DRIVE, THE VEHICLE INDEPENDENTLY ACCELERATED. THE CONTACT WAS ABLE TO SLOW THE VEHICLE DOWN WITHOUT A CRASH. ON A SEPARATE OCCASION, WHILE DRIVING 45 MPH, THE VEHICLE ACCELERATED TO 55 MPH. THE CONTACT WAS ABLE TO STOP THE VEHICLE AGAIN. THE CONTACT STATED THAT THE VEHICLE THEN IDLED AT AN EXTREMELY HIGH RPM. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED. CITY TOYOTA (255 SAN PEDRO RD, DALY CITY, CA 94014, (650) 204-8135) WAS CONTACTED AND STATED THAT THE SERVICE MANAGER WOULD GIVE THE CONTACT A CALL BACK. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 1810082932. THE APPROXIMATE FAILURE MILEAGE WAS 43,744.",
        "vin": "2T3BFREV3GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/07/2018",
        "dateOfIncident": "07/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138861,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DIM HEADLAMPS ARE LIFE THREATENING.  FIELD OF VISION IS SHORT WITH A LINE AND DARKNESS ABOVE LIMITING VISION.  RIGHT AND LEFT TURNING VISION NON EXISTENT. AFTER 3 ATTEMPTS AND OFFICIAL COMPLAINT TOYOTA REPAIR SAYS THERE IS NOTHING ELSE THEY CAN DO, LAMPS MEET FEDERAL STANDARDS. EVENING TEST DRIVES SHOULD BE MANDATORY.  I WOULD LIKE SOMEONE WITH AUTHORITY TO TRY AND DRIVE MY VEHICLE IN MY NEIGHBORHOOD IN THE DARK. MANY COMPLAINTS ON INTERNET. NO ONE SEEMS TO HAVE A RESOLUTION.  MY LIFE IS IN DANGER.",
        "vin": "2T3BFREVXGW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11133111,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HIS SPOUSE WHO OWNED A 2016 TOYOTA RAV4. WHILE DRIVING 30 MPH, THE CONTACT BECAME UNCONSCIOUS AND THE VEHICLE CRASHED INTO A TREE. THE CONTACT STATED THAT THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED A FRACTURED NOSE AND BRUISING TO THE RIBS, WHICH REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO AN INDEPENDENT FACILITY. THE VEHICLE WAS NOT DIAGNOSED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 35,000. *TT  UPDATED 11/28/18*JB",
        "vin": "2T3WFREVXGW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131866,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR IN THE RAIN, AND A WARNING CAME ON THAT THE ANTILOCK BRAKE SYSTEM WAS MALFUNCTIONING. I KEPT DRIVING, AND ALL THER DASHBOARD LIGHTS FLASHED OFF THEN BACK ON TWICE. I PULLED OVER TO THE SIDE OF THE ROAD, TURNED THE CAR OFF AND BACK ON AND IT STOPPED. THIS ISN'T THE FIRST TIME I'VE HAD PROBLEMS WITH THE ABS NOT WORKING RIGHT IN THE RAIN.  I WAS DRIVING ON THE INTERSTATE WHEN THIS HAPPENED.",
        "vin": "JTMWFREV5GJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "08/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130152,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA RAV4 XLE. CONSUMER STATES THAT AFTER PURCHASE VEHICLE WOULD NOT START. *LD    THE CONSUMER WAS INFORMED, BY THE DEALER, THE FAILURE WAS DUE TO THE VEHICLE BEING STRUCK BY LIGHTENING. THE INSURANCE COMPANY DID NOT AGREE. *JS",
        "vin": "2T3WFREV5GW"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129655,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT RAINS THE DRIVER SIDE FLOORING AND MATS ARE COMPLETELY SOAKED ABSORBING UP TO 1 INCH OF WATER. THE CAR ISN'T DRIVEN MUCH SO THE PROBLEM ONLY STRUCK A BELL THIS YEAR.    *JS",
        "vin": "ZT3RFREV4GW"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114964,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 15 MPH AND MAKING A LEFT TURN, THE POWER STEERING BECAME VERY DIFFICULT TO STEER. THE CONTACT CRASHED INTO A CURB AND SIDESWIPED ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC BY THE CONTACT'S INSURANCE COMPANY WHERE IT WAS AWAITING INSPECTION. A DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 23,000.",
        "vin": "2T3NFREV5GW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "12/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11113645,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL,  I WAS INVOLVED IN A REAR ENDED COLLISION ON A HIGHWAY  WHILE STOPPED CAUSING MY CAR TO REAREND THE CAR IN FRONT OF ME. THE AIRBAGS DID NOT DEPLOY AND  SAID MALFUNCTION ON THE DASHBOARD.  THERE WAS $19000 IN DAMAGE, I ASKED FOR THE SEATBELTS AND AIRBAGS TO BE REPLACED BECAUSE I WAS AFRAID TO DRIVE THE CAR AND FEEL SAFE. THEY WOULD NOT DO IT BECAUSE THEY SAID THE COMPUTER WAS ABLE TO RESET.  I SPECIFICALLY ASKED OVER AND OVER AS I COULD NOT FEEL SAFE, NO ONE WOULD LISTEN SO I ENDED UP TRADING THE CAR THAT WAS 7 MONTHS OLD IN AND TAKING A LOSS TO FEEL SAFE.  SINCE THE AIRBAG MALFUNCTIONED I COULD NOT FEEL LIKE IT WOULD KEEP ME SAFE IN ANOTHER ACCIDENT. I HAVE NEVER BEEN IN AN ACCIDENT PRIOR TO THIS.",
        "vin": "JTMJFREV3GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103860,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BACKING UP (LIKE FROM YOUR DRIVEWAY) IF YOU SHIFT FROM \"R\" TO \"D\" TOO FAST ONE OF THE FOLLOWING EXTREMELY DANGEROUS ACTIONS WILL OCCUR:    1. THE ENGINE WILL STALL LEAVING YOU A SITTING DUCK IN TRAFFIC. RESTARTING IS NOT QUICK OR EASY. YOU MUST PUT YOUR FOOT ON THE BRAKE, SHIFT INTO \"P\" AND THEN HIT THE I/O BUTTON A NUMBER OF TIMES TO CYCLE BACK TO \"START\" POSITION TO GET THE CAR STARTED AGAIN. ALL THE TIME YOU ARE PRAYING ONCOMING TRAFFIC DOESN'T HIT YOU!    2. THE CAR WILL ENGAGE TRACTION CONTROL (TRAC INDICATOR ON). WHEN THIS HAPPENS PRESSING ON THE ACCELERATOR PEDAL HAS (ALMOST) NO EFFECT (I.E. SEVERE HESITATION) ONCE AGAIN THIS LEAVES YOU A SITTING DUCK IN THE MIDDLE OF THE ROAD UNTIL THE CAR DECIDES IT WANTS TO MOVE AGAIN.    FROM WHAT I CAN TELL THIS DEFECT IS 100% REPEATABLE. I HAVE EXPERIENCED IT NUMEROUS TIMES AND IT SCARES THE LIVING CR@P OUT OF ME EACH TIME IT DOES IT!",
        "vin": "2T3YFREV8GW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/08/2018",
        "dateOfIncident": "05/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11100513,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY, THIS VEHICLE WAS INVOLVED IN AN ACCIDENT WHERE THIS VEHICLE REAR ENDED ANOTHER VEHICLE CAUSING MAJOR DAMAGE TO BOTH VEHICLES. THIS ACCIDENT OCCURRED IN A 4-LANE HIGHWAY; HWY 60 IN PHOENIX. PRIOR TO THE ACCIDENT, THERE WERE NO ERROR MESSAGES OR INDICATED MALFUNCTIONS. THE CAR WAS MAINTAINED AS RECOMMENDED BY THE MANUFACTURER. IMMEDIATELY UPON IMPACT, TWO ERROR MESSAGES WERE DISPLAYED ON THE DASH:H AIRBAG SYSTEM MALFUNCTION AND AN AWD MALFUNCTION 2WD MODE ENABLED. I FOUND THIS VERY DISTURBING AS I CAN'T BELIEVE THE AIRBAGS DIDN'T DEPLOY UPON IMPACT. AS A RESULT, MY DAUGHTER SUFFERED FROM A CONCUSSION, NECK PAIN, AND HER KNEE SUFFERED INJURY BY SLAMMING INTO THE DASHBOARD. OUR INSURANCE COMPANY, LIBERTY MUTUAL, WAS CONTACTED THAT EVENING TO REPORT THE ACCIDENT. THE NEXT DAY, I FILED A CLAIM WITH TOYOTA REGARDING THE ERROR MESSAGES AND THE LACK OF AIRBAG DEPLOYMENT. A THIRD PARTY RETRIEVED THE 'BLACK BOX' FROM THE VEHICLE AND PRESENTED A REPORT TO TOYOTA. TOYOTA CLAIMS THAT THE THIRD PARTY DETERMINED THAT THE VEHICLE WAS OPERATING PROPERLY AND THE AIRBAGS SHOULD NOT HAVE DEPLOYED. MY INSURANCE DOESN'T BELIEVE THIS TO BE A TRUE ASSESSMENT, NOR DO I. I ASKED TOYOTA HOW TO HAVE THIS ESCAPED TO THE NEXT LEVEL FOR FURTHER REVIEW AND WAS TOLD THAT I HAD NO OPTIONS AVAILABLE TO ME. MEANWHILE, THE CAR HAS BEEN REPAIRED HOWEVER, THE AIRBAG ICON WILL NOT LEAVE THE DASH AND THE CAR REPAIR SHOP WILL NOT RELEASE AN UNSAFE CAR TO ME. SOMEONE IS BEING REASONABLE. I'M CONCERNED THAT THE AIRBAG SYSTEM WASN'T WORKING PRIOR TO THE ACCIDENT CAUSING THE AIRBAGS TO NOT DEPLOY AND IS NOW INDICATING THAT THE CAR IS UNSAFE TO DRIVE. MEANWHILE, I AM STRANDED IN PHOENIX, AZ BECAUSE I STILL DO NOT HAVE A VEHICLE IN WHICH TO MOVE MY DAUGHTER HOME TO N.C. PHOTOS AND REPORTS ARE ATTACHED FOR YOUR REVIEW. THE FILE FROM THE BLACK BOX WAS TOO LARGE TO UPLOAD.",
        "vin": "2T3RFREV6GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "05/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099064,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 65 MPH, TWO DEER SUDDENLY EMERGED FROM THE WOODS. WHEN THE CONTACT DEPRESSED THE BRAKE PEDAL, THE VEHICLE DID NOT STOP AND STRUCK ONE OF THE DEER. THE FRONT DRIVER'S SIDE OF THE VEHICLE WAS DAMAGED. A POLICE REPORT WAS FILED (NUMBER: 18-05410) AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO CEDAR RAPIDS TOYOTA (1190 BOYSON ROAD, HIAWATHA, IOWA 52233), BUT WAS NOT DIAGNOSED. THE VEHICLE WAS THEN TOWED TO A BODY SHOP. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 10,900.",
        "vin": "2T3RFREV2GW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2018",
        "dateOfIncident": "05/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092038,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILLED MY CAR WITH FULL TANK I AM ONLY RUNNING MY CAR JUST GAVE ME 248 MILES THE FUEL TANK LIGHT WAS FLASHED .AND THE CAR SUPPOSED TO GO FOR 339 OR 349 MILES WITH FULL TANK I WANT TO DOWNTOWN MIAMI FROM TAMPA I WAS SUPPOSED TO STOP TO FULL IT AGAIN.",
        "vin": "2T3ZFREV3GW"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083143,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I USED TO TAKE FULL TANK GAS EVERYDAY SINCE BOUGHT THE CAR . AFTER DRIVING 1 YEAR  MY OIL TANK GIVING ME PROBLEM. MY ENGINE WAS SUDDENLY SHUT DOWN AUTOMATICALLY AND 3 SIGN CAME UP. I STARTED THE CAR AGAIN AND IT WAS WORKING GOOD AND AFTER A WHILE IT SHUT DOWN AGAIN. I WENT TO MY DEALER ABOUT 5 MONTH AGO AND TOLD THEM THE STORY. THEY DIAGNOSE MY CAR AND FOUND NOTHING SO I TOOK MY CAR BACK FROM DEALER SHOP. NEXT DAY SAME PROBLEM HAPPENS AND I WENT BACK TO THE DEALER. . THIS TIME THEY FOUND MY BATTERIES ALMOST FINISHED AND I HAVE PROBLEM WITH MY AIR SENSORE . SO I FIXED BOTH OF THEM AND PAID ALMOST 1400 DOLLAR WHERE PARTS COST WAS ONLY 300 AND REST WAS FOR 5 HOURS COMPUTER DIGONOATIC. ANYWAY, I THOUGHT MY PROBLEM IS FINISHED BUT IT'S STILL THERE. NOW MY GASOLINE COMING OUT FROM TANK AND I AM GETTING SMELL FROM INSIDE. I AGAIN WENT BACK TO DEALER, THIS TIME THEY KEEP MY CAR FOR 1 DAY AND NEXT DAY THEY TELLING ME THAT I HAVE TO CHANGE MY ENTIRE GASOLIN TANK BECAUSE I USED TO TAKE FULL TANK GAS,WHICH WILL COST AROUND 2000 DOLLAR!! I WAS VERY MAD WITH THE MANAGER BECAUSE IN FIRST TIME THEY COULDNOT  EVEN FIND MY REAL PROBLEM AND CHANGED MY NEW BATTERIES AND AIR SENSOR! NOW THEY TELLING ME IT'S VERY DANGEROUS TO DRIVE WITHOUT FIXED OIL TANK BUT I DIDNOT FIXED IT BECAUSE IT MUST BE FACTORY DEFECT, WHY SHOULD I PAY FROM MY POCKET. I CALLED TOYOTA CORPORATE OFFICE AND TOLD THEM ABOUT MY ISSUE. THEY TOLD ME SINCE I HAVE NO WARRENTY, THEY CAN'T FIXED IT FREE FOR ME.AND THERE ARE NO RECALL ABOUT MY GAS TANK!",
        "vin": "2T3RFREV9GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080715,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO HIGH BEAMS - INTERMITTENTLY GET STUCK IN \"LOW\" I HAVE NOTICED THIS ON MULTIPLE OCCASIONS BUT CAN'T REPRODUCE IT ON DEMAND. LAST INSTANCE WAS ON A STRAIGHT, FLAT RURAL ROAD WITH NO LIGHTS, SIGNALS OR SAME DIRECTION TRAFFIC TRAVELLING AT 55MPH.     WAS APPROACHED BY ONCOMING CAR WHICH FAILED TO DIM LIGHTS. MINE DIMMED BUT DID NOT RETURN TO BRIGHT. HAD TO POWER CYCLE THE LIGHTS TO GET THE HIGH BEAMS BACK.  A MINUTE LATER WAS APPROACHED BY 3 CARS CLOSE TOGETHER WITH OVERLY BRIGHT LIGHTS. MINE DIMMED AND STAYED DIM JUST LIKE BEFORE. HAD TO POWER CYCLE TO GET THE BRIGHTS BACK.    THIS IS A SERIOUS SAFETY DEFECT TO NOT HAVE BRIGHTS IMMEDIATELY AFTER BEING BLINDED BY ONCOMING TRAFFIC!",
        "vin": "2T3YFREV8GW"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "02/17/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074371,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING HIGHWAY SPEEDS, A ROCK STRUCK THE SUN ROOF, FRACTURED IT, AND CAUSED GLASS TO EXPLODE AND IMPLODE INSIDE THE VEHICLE. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO A DEALER (FINDLAY TOYOTA FLAGSTAFF, 5030 E MARKETPLACE DR, FLAGSTAFF, AZ 86004, (888) 736-7324) WHO AT FIRST INDICATED THAT THEY WOULD REPLACE THE PART. THE DEALER THEN STATED THAT THE PART WOULD BE REPLACED BY A WARRANTY AND THE END RESULT WAS THAT THEY REFUSED TO PROVIDE A REPLACEMENT OF THE PART AND ADVISED THE CONTACT TO CALL THE INSURANCE COMPANY. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THEY WOULD PROVIDE A FOLLOW-UP RESPONSE WITHIN A DAY TO DETERMINE IF THEY COULD REMEDY THE FAILURE BY REPLACING THE PART THAT FAILED PREMATURELY. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "JTMJFREV5GJ"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11071841,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING 45 MPH, THE BRAKE PEDAL WAS APPLIED, BUT THE BRAKES FAILED TO RESPOND WITHOUT WARNING. AS A RESULT, THE CONTACT CRASHED INTO AN EMBANKMENT. THE FRONT DRIVER, FRONT PASSENGER, AND FRONT SIDE AIR BAGS DEPLOYED. THE PASSENGER SEAT WAS NOT OCCUPIED. THE CONTACT SUSTAINED A SPRAINED RIGHT ANKLE, WHICH DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND OPENED CASE NUMBER: 1802082867. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 42,000.",
        "vin": "2T3RFREV7GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/05/2018",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067002,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS WHILE DRIVING AT NIGHT ON THIS VEHICLE ARE HORRIBLE!  IT IS LIKE YOU ARE DRIVING IN A POORLY LIT TUNNEL WITH VERY LITTLE PERIPHERAL VISION.  I AM CONSTANTLY HAVING ONCOMING DRIVERS FLASH THEIR HIGH BEAMS AT ME WHILE DRIVING WITH MY LIGHTS  ON LOW BEAM, SO IT MUST BE AFFECTING THEIR ABILITY TO SEE.  VERY DANGEROUS FOR BOTH DRIVERS! THIS IS A VERY POOR HEADLIGHT SETUP AND SHOULD BE RECALLED AND REPAIRED ON ALL THE AFFECTED MODELS.",
        "vin": "2T3RFREV3GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "01/18/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS A COLD DAY IN MASSACHUSETTS. I WARMED UP THE CAR IN THE MORNING FOR 10 MINUTES BEFORE STARTING TO DRIVE TO WORK. I GOT ONTO THE MASSACHUSETTS PIKE AND AFTER A COUPLE EXITS OF CRUISING AT 60 HIT STOP AND GO TRAFFIC. AT ONE OF THE ENTRANCES AND WHEN I SLOWED DOWN TO A STOP IN THE TRAFFIC MY CAR FLASHED THE BATTERY CRITICAL CHARGING ERROR FOR A SPLIT SECOND BEFORE SAYING EVERYTHING NEEDED TO BE RESTARTED BY PUTTING THE CAR INTO PARK. AFTER THAT, THE CAR COMPLETELY SHUT DOWN. I WAS NOT ABLE TO PUT ON HAZARDS UNTIL ABOUT 15 SECONDS LATER OF TRYING TO GET THE POWER BACK ON DID THE CAR START UP. WITHIN THAT TIME A DRIVER BEHIND ME DECIDED TO HIT ME IN THE REAR. ON RESTART THE CAR DIDN'T SHOW THE FAULT BUT UPON LOOKING UP THE BATTERY CRITICAL CHARGING FAILURE IT STATES TO NOT DRIVE THE CAR AND TO IMMEDIATELY TAKE IT TO A SHOP. THE SHOP CANNOT FIND THE CODE DUE TO IT BEING WIPED MAKING SOLVING THE ISSUE EVEN MORE DIFFICULT.",
        "vin": "2T3JFREV3GW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/13/2018",
        "dateOfIncident": "10/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062588,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TRAVELING AT THE SPEED LIMIT ON AN INTERSTATE HIGHWAY. NO OTHER VEHICLES IN FRONT OR SIDE. THE SUN ROOF GLASS EXPLODED. NO PERSONAL INJURIES.",
        "vin": "JTMYFREV6GJ"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "01/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062360,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE THE VEHICLE WAS PARKED, THE SUN ROOF FRACTURED. WHILE THE VEHICLE WAS BEING DRIVEN, PIECES OF BROKEN GLASS STARTED TO FALL INTO THE CABIN OF THE VEHICLE. THERE WERE NO INJURIES. CLEARWATER TOYOTA (21799 US HWY 19 N, CLEARWATER, FL 33765, (800) 667-9051) WAS NOTIFIED OF THE ISSUE. THE VEHICLE WAS TAKEN TO THE DEALER AND REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 10,250. *TT  *TR",
        "vin": "2T3WFREV1GW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "12/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057915,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE SUNROOF SHATTERED SENDING GALSS ONTO MY WIFE AND THE CAR BEHIND US.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058147,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF GLASS SHATTERED WHILE DRIVING ON HIGHWAY. VEHICLE WAS UNDER OR NEAR AN OVERPASS WHEN THE INCIDENT HAPPENED, SO IT IS POSSIBLE THAT SOMETHING DROPPED FROM THE OVERPASS AND STRUCK THE SUNROOF, BUT WE DID NOT SEE ANYTHING FALL.",
        "vin": "2T3DFREV3GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "02/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT THE HEADLIGHTS WERE NOT BRIGHT ENOUGH. THE HIGH BEAM HEADLIGHTS NEEDED TO BE TURNED ON TO HAVE SUFFICIENT VISIBILITY AT NIGHT. THE VEHICLE WAS TAKEN TO ST. COULD TOYOTA (418 2ND ST S, WAITE PARK, MN 56387 (320) 227-8052). THE TECHNICIAN ADJUSTED THE HEADLIGHTS AND STATED THAT NO FURTHER ACTION COULD BE TAKEN. THE CONTACT STATED THAT THE LIGHTS WERE STILL NOT SUFFICIENT. THE STOCK HEADLIGHTS WERE STILL INSTALLED IN THE VEHICLE AND WERE NOT REMOVED. THE MANUFACTURER WAS CONTACTED AND TOYOTA STATED THAT THE STOCK LIGHTS WERE DESIGNED PROPERLY. THE FAILURE MILEAGE WAS UNKNOWN. *TT  CONSUMER STATED CANNOT SEE MORE THAN 2 TO 3 CAN LENGTHS  AHEAD WHEN ON, DIM AT START UPDATED 8/27/18*JB",
        "vin": "2T3BFREV6GW"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/09/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054155,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 65 MPH, THE SUN ROOF EXPLODED. THE CONTACT WAS NOT SURE IF THE FAILURE OCCURRED FROM INSIDE OR OUTSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER AND THE CONTACT WAS INFORMED THAT SHE WOULD BE RESPONSIBLE FOR THE REPAIRS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 11,771. THE VIN WAS NOT AVAILABLE. *TT  CONSUMER STATED CT STATE POLICE WERE CALLED AND RESPONDED. THEY FOUND NO DEBRIS, NO SIGN OF ANY IMPACT. THEY WROTE AS HAVING BEEN \"SPONTANEOUS.\" UPDATED 8/24/18*JB",
        "vin": "2T3RFREVXGW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "10/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING APPROXIMATELY 25 MPH GETTING ONTO A MAJOR HIGHWAY AND HEARD WHAT SOUNDED LIKE AN EXPLOSION. I CONTINUED TO DRIVE AND STARTED HEARING GLASS FLY OFF MY CAR AND SLIDING AROUND ON MY ROOF. I QUICKLY PULLED OVER, PUT MY HAZARDS ON AND SLID BACK THE SUNROOF SHADE. THE ENTIRE CENTER OF MY SUNROOF HAD SHATTERED AND APPEARED AS IF A GIANT ROCK WAS DROPPED ON IT. THERE WAS NO SIGN OF IMPACT AND I HAVE ALREADY REACHED OUT TO CORPORATE HEADQUARTERS AND THEY OFFERED ABSOLUTELY NO ASSISTANCE IN REPAIRS.",
        "vin": "JTMRFREV4GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035705,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER FRONT WHEEL SENSOR HARNESS WAS DAMAGED BY RODENT.  VEHICLE HAS 26K MILES AND TOYOTA REFUSED TO REPAIR THE BREAK, AND WOULD ONLY REPLACE THE ENTIRE HARNESS AT A COST NOT COVERED OF $6300.  THE MATERIAL CHANGE OF THESE PARTS ATTRACT RATS.  THIS DAMAGED CAUSE ABS, LANE DEPARTURE, BLIND SPOT MONITORING AND CRUISE CONTROL SYSTEMS TO FAIL.  THE VEHICLE WAS PARKED IN MY DRIVEWAY AND I LIVE IN A GATE COMMUNITY.  I CALLED THE TOYOTA CUSTOMER LINE AND WAS GIVEN THE SAME EXPLANATION OF THE LACK OF WARRANTY COVERAGE.  CASE #1710230814",
        "vin": "JTMYFREV5GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035986,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS PARKED WHEN I NOTICED WHAT LOOKED LIKE WATER STARTING TO COME DOWN FROM THE TOP OF THE REAR GLASS.  I THOUGHT THAT WAS WEIRD BECAUSE THERE WASN'T ANY WATER ON THE CAR.  WHEN I GOT OUT TO MAKE A CLOSER INSPECTION, THE GLASS EXPLODED.  THIS OCCURRED SIMPLY BY CLOSING MY DRIVER'S SIDE DOOR.",
        "vin": "2T3JFREVXGW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/19/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034611,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ACCELERATING A STRONG ORDOR ENTERS INSIDE OF VEHICLE TOOK TO TOYOTA DEALER AND WAS TOLD IT WAS (NORMAL SULPHER SMEEL FROM CATALYTIC CONVERTER UPON ACCELLERATION) AT TIMES THIS SMEEL IS VERY STRONG AND NAUSEATING, THIS VEHICLE ONLY HAS 5200 MILES ON IT, AND WASN'T NOTICE UNTIL IDROVE IT ON THE INTER STATE",
        "vin": "JTMNFREV5GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "09/25/2017",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031632,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND SMOKE BEGAN TO FILL MY VEHICLE. I PULLED OVER AND MY VEHICLE CAUGHT FIRE. UNSURE OF THE CAUSE.",
        "vin": "2T3ZFREV6GW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "09/25/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029869,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS OCCURRED A FEW WEEKS AFTER ISSUE # 11022546 OCCURRED AND SEEMS TO BE A RELATED ELECTRICAL PROBLEM.  WHILE WAITING FOR A RED TRAFFIC LIGHT TO TURN GREEN, (THIS TIME) THE ENGINE DID NOT STOP  BUT THE DASHBOARD DISPLAY AND RADIO SCREEN WENT COMPLETELY BLACK   AND AFTER ABOUT 5-10 SECONDS ALL POWER RETURNED TO DASH AND RADIO.",
        "vin": "2T3RFREV9GW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022994,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS  FOR   A  FEW  SECONDS   ON  HILLS",
        "vin": "2T3WFREV6GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2017",
        "dateOfIncident": "09/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022546,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WAITING FOR RED LIGHT ON A LOCAL STREET (THE ENGINE WAS RUNNING BUT IN A STOPPED FOOT ON THE BRAKE POSITION)   THE ENGINE  SHUT DOWN AND DASHBOARD DISPLAY MESSAGE APPEARED STATING \"CHARGING SYSTEM FAILURE\".",
        "vin": "2T3RFREV9GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022407,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR ABOUT A YEAR AND HALF BACK FROM TOYOTA DEAER IN ROCKVILLE, MD. WHEN I APPLIED BRAKE TO SLOW DOWN AND STOP THE CAR AT THE HIGHWAY INTERSECTIONS, IT ACCELERATED UNCONTROLLABLY. THIS HAPPENED THREE TIMES ON THREE DIFFERENT OCCASIONS. I HAVE REPORTED THE BRAKE SYSTEM FAILURE AND SUDDEN ACCELERATION EVENTS TO TOYOTA COMPANY IN TEXAS. THE ASSIGNED CASE MANAGER, CAREY CARTER IN TOYOTA COMPANY FURNISHED THE CASE # 1708302943 ON SEPTEMBER 1, 2017. COREY'S CONTACT TELEPHONE # : 1-800-333-4331, OPTION 3, EXTENSION 73834. THE CAR IS NOW PARKED IN MY GARAGE, AND I DARE NOT DRIVE IT, AS IT IS VERY UNSAFE. I REQUEST THAT NHTSA INITIATE PROMPTLY INVESTIGATION OF POSSIBLE DEFECTS IN THE DESIGN AND /OR MANUFACTURE OF THE TOYOTA RAV4 CARS TO AVERT JEOPARDY TO TRAFFIC SAFETY. ALSO, I REQUEST NHTSA 'S ADVICE TO RESOLVE MY CASE FAVORABLY.",
        "vin": "2T3RFREV1GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/31/2017",
        "dateOfIncident": "08/31/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020909,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2016 RAV4 LIMITED WITH 12000 MILES ON IT. NOTHING HAPPENED YET, BUT  THE LED HEADLIGHTS ARE OBVIOUSLY INADEQUATE AND I'M AFRAID I MIGHT RUN INTO AN ACCIDENT DUE TO THE POOR VISIBILITY AT NIGHT SOME DAY. WHEN I DRIVE AT NIGHT, I CANNOT SEE THE ROADS CLEARLY AT ALL. I HOPE A RECALL COULD BE SET TO RESOLVE THIS ISSUE.",
        "vin": "2T3DFREV9GW"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015733,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4 HV. THE CONTACT STATED THAT HE WAS UNABLE TO SEE THE INSTRUMENT PANEL GAUGES IN SUNNY CONDITIONS. THE VEHICLE WAS TAKEN TO GERMAIN TOYOTA OF NAPLES (13315 TAMIAMI TRAIL N, NAPLES, FL 34110 (888) 722-4942) WHERE IT WAS DIAGNOSED. THE DEALER SUGGESTED THAT THE CONTACT HAVE THE WINDOWS TINTED. THE CONTACT PURCHASED THE TINT, BUT THE FAILURE PERSISTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS 10,000. UPDATED 11/02/17*LJ  *TR",
        "vin": "JTMDJREV4GD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2017",
        "dateOfIncident": "07/30/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011566,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A FOLLOW UP TO REPORT 10995701.   AFTER TOYOTA REFUSED TO DO ANY REPAIRS TO THE CAR, I REPLACED THE MASTER CYLINDER MYSELF.   I TOOK THE MASTER CYLINDER APART AND FOUND AN UNUSUAL MACHINING PATTERN WITHIN THE MASTER CYLINDER THAT COULD POTENTIALLY AFFECT THE SEALS.   THERE ARE THREE \"GOUGE\" PATTERNS MACHINED 120 DEGREES APART EXTENDING ABOUT 1\" DOWN.  THESE PATTERNS SLIGHTLY INTRUDE INTO THE GROOVE FOR THE SEAL AND MAY EFFECT THE SEALING INTEGRITY.",
        "vin": "JTMBFREV7GJ"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001720,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING 10 MPH, THE BRAKES FAILED TO WORK AND THE VEHICLE AUTOMATICALLY STOPPED WITHOUT WARNING. THE VEHICLE WAS SLOWLY DRIVEN TO THE CONTACT'S RESIDENCE. THE FAILURE OCCURRED TWICE. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (WEST HERR TOYOTA OF WILLIAMSVILLE LOCATED AT 8129 MAIN ST, WILLIAMSVILLE, NY 14221; (716) 803-8010), BUT THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AT 800-331-4331 AND WAS INFORMED THAT NOTHING COULD BE DONE. CASE NUMBER: 1706191051 WAS PROVIDED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 2,478.",
        "vin": "JTMJFREV7GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001782,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPROACHING A STOP SIGN IN A ROUTINELY DRIVEN RESIDENTIAL NEIGHBORHOOD AT LOW SPEED WITH THE CAR IN DRIVE GEAR AND CLEAR WEATHER, SOMETIMES THE BRAKE PEDAL SLIPS PART WAY OR ALL THE WAY TO THE FLOOR ALLOWING THE CAR TO ROLL INTO THE INTERSECTION BEFORE STOPPING.  THE PEDAL HAS SLIPPED REPEATEDLY WITHIN 2 HOURS WHEN DRIVING IN URBAN, RUSH HOUR, STOP AND GO TRAFFIC.  IT HAS ALSO SLIPPED TO THE FLOOR AT 70 MPH ON AN INTERSTATE HIGHWAY WHEN THE VEHICLE WAS DECELERATING ON A DRY SURFACE.   PUMPING THE BRAKE PEDAL A FEW TIMES ENGAGES THE BRAKES.  I HAVE TAKEN THE CAR TO THE DEALER TO CORRECT THE ISSUE 4 TIMES AND TO ANOTHER DEALER 1 TIME FOR A 2ND OPINION WITH THE SAME RESULT ON EACH VISIT, 'COULD NOT DUPLICATE.'  THE 4TH REPAIR VISIT INVOICE SHOWS 'LOSES VACUUM WHEN BRAKES CONTINUOUSLY APPLIED AT IDLE.' ON THE 5TH VISIT I ASKED FOR THE VACUUM TO BE RESTORED TO PROPER FUNCTION. THEY SAID THERE WAS NO VACUUM LEAK OR RECORD OF A CODE THAT WOULD INDICATE LOSS OF VACUUM, AND THEY COULD NOT DUPLICATE.  I CANNOT DUPLICATE IT EITHER OR PREDICT WHEN THE PEDAL WILL SLIP.  IT HAPPENS SPORADICALLY.  AS SUGGESTED BY A SERVICE ADVISOR, I CALLED THE TOYOTA 800 NUMBER.  I SPOKE WITH A REPRESENTATIVE ON 12-15-16.  I TOLD HER MY EXPERIENCE WITH THE BRAKE ISSUE AND MY REQUESTS FOR REPAIR WITH UNSATISFACTORY RESULTS.  SHE SAID SHE WOULD CALL THE DEALERSHIP AND GET BACK TO ME.  ON 12-16-16, SHE REPORTED THE DEALER SAID THEY COULD NOT DUPLICATE, SO NOTHING COULD BE DONE.  SHE ASKED ME WHAT I WANTED.  I REPLIED THAT I WANTED THE BRAKES TO WORK PROPERLY.  SAFETY IS AT RISK FOR ME AND PASSENGERS AT ANY SPEED.  AT HIGHWAY SPEEDS, IT IS EXTREMELY DANGEROUS.",
        "vin": "JTMNFREV6GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT THE BRAKE PEDAL WAS SPONGY WHEN APPLIED. THE VEHICLE WAS TAKEN TO A DEALER (AUTONATION TOYOTA LAS VEGAS 6300 W SAHARA AVE, LAS VEGAS, NV 89146 (702) 605-5801) WHERE IT WAS DIAGNOSED THAT THE BRAKE PADS AND DISCS MAY NEED TO BE REPLACED, BUT THEY WERE UNSURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/17/2017",
        "dateOfIncident": "05/28/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995701,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA RAV4 WITH 6500 MILES.   IN THE LAST 5 WEEKS, THERE HAVE BEEN 3 INSTANCES WHERE THE BRAKE PEDAL PRESSED AND NOTHING HAPPENED.   THE PEDAL PUSHED ALL THE WAY TO THE FLOOR WITH ZERO RESISTANCE AND THE CAR DID NOT SLOW.   LUCKILY, RELEASING THE PEDAL AND PRESSING IT AGAIN SLOWED THE CAR.   THE CAR IS AT TOYOTA MOTORCARS OF CLEVELAND, WHERE THEY HAVE INSPECTED IT AND SAY NOTHING IS WRONG AND THAT THE CAR IS SAFE.   NO WARNING LIGHTS APPEARED ON THE DASHBOARD.",
        "vin": "2T3BFREV8GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "03/15/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994395,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY TOYOTA RAV4 LE ON MAY 2016 AT SOUTH COAST TOYOTA IN COSTA MESA, CALIFORNIA. I LOVED IT JUST AS MUCH AS THE OTHER TOYOTA CARS I OWNED BEFORE. AFTER 10 MONTHS AND 7, 000 MILES, I'VE NOTICED A CLICKING NOISE ASSOCIATED WITH A FLICKERING HEADLIGHTS. THEY OCCUR EVERY TIME WHEN SHIFTING INTO DRIVE AND ENGAGING THE GEAR JUST ABOVE IDLE. ON MAY 8TH 2017, I DECIDED TO TAKE IT BACK TO THE DEALER SO THEY CAN TAKE A LOOK AT IT. FIRST VISIT THEY STATED THAT THEY COULD NOT FIND/REPLICATE THE NOISE NOR THE FLICKERING HEADLIGHTS. THE NEXT DAY, MAY 9TH 2017, I TOOK IT BACK AND INSISTED THAT THEY CHECK IT AGAIN. THEY KEPT THE CAR OVERNIGHT. THE NEXT DAY THEY CALLED ME TO GO PICK UP THE CAR. WHEN I GOT THERE, THE ASSISTANT SERVICE MANAGER, THOMAS TRAFFORD, CONFIRMED THAT THEY HAVE FOUND THE NOISE BUT NOT THE FLICKERING HEADLIGHTS. AND TO MY SURPRISE, THE SHOP FOREMAN, BOBBY GENTON, CLAIMED THAT THE CLICKING NOISE WAS CAUSED BY ABS (ANTI-LOCK BRAKE SYSTEM) AND IT WAS NORMAL IN A TOYOTA RAV4 AND THERE IS NOTHING THEY CAN DO ABOUT THEREFORE I JUST HAVE TO GET USED TO IT. I ASKED HIM WHY WAS IT THAT THE CLICKING NOISE WAS NOT THERE WHEN I FIRST BOUGHT THE CAR ONE YEAR AGO AND IT STARTED JUST NOW AFTER ALMOST A YEAR. HIS ANSWER WAS: 'MAYBE IT WAS THERE, YOU JUST DIDN'T NOTICE IT TILL NOW.'  I DISAGREE BECAUSE I HAVE BEEN DRIVING DIFFERENT CAR BRANDS, INCLUDING TOYOTA, FOR OVER 30 YEARS AND I CAN ASSURE YOU THAT I'VE NEVER EXPERIENCED THE SAME I'M SURE THAT THE CLICKING NOISE AND THE FLICKERING HEADLIGHTS ARE NOT NORMAL IN ANY OTHER CAR BRAND (THAT IS LESS THAN 10,000) LET ALONE TOYOTA THAT IS KNOWN FOR ITS GOOD QUALITY AND PERFORMANCE. HOWEVER, IF THE CLICKING NOISE AND FLICKERING HEADLIGHTS ARE AN EXISTING AND NORMAL CONDITION, AS THEY CLAIM IT TO BE, ISN'T TOYOTA OBLIGATED TO MAKE THE CONSUMERS AWARE OF IT AND LET THEM DECIDE IF THEY REALLY WANT THE SAME CAR?",
        "vin": "2T3ZFREV4GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "06/09/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994543,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING 55 MPH, THE VEHICLE'S HEADLIGHTS BECAME TOO BRIGHT AND CAUSED OTHER DRIVERS TO FLASH THEIR HEADLIGHTS, WHICH OBSTRUCTED THE CONTACT'S VISION. TOYOTA OF NICHOLESVILLE, KENTUCKY INSPECTED THE VEHICLE, BUT COULD NOT DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 6,100.",
        "vin": "2T3BFREV2GW"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994337,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IDLE SPEED IN THE RAV4 4 IS SET TOO HIGH CAUSING THE CAR TO MOVE FORWARD WHEN STOPPED WITH FULL PRESSURE APPLIED TO THE BRAKES. TOYOTA REFUSED TO REDUCE THE IDLE SPEED AND STATES THAT THIS NORMAL OPERATION. I BELIEVE THEY HAVE SET THE IDLE HIGH SO THE CAR WILL PASS EMISSION STANDARDS AND AS A RESULT NOW HAS THIS DEFECT WHERE THE CAR MOVES FORWARD WITH FULL BRAKE APPLIED DUE TO THE HIGH IDLE SPEED. THIS MAY BAY BE AN EMISSIONS PROBLEM BUT IT MOST CERTAINLY IS A SAFETY ISSUE",
        "vin": "2T3ZFREVOGW"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/16/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986033,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "14 MONTH OLD RAV4 XLE DRIVING DOWN THE INTERSTATE AND APPLIED THE BRAKES FOR SLOW TRAFFIC, THE ABS / TRACTION CONTROL WARNING LIGHTS CAME ON. I AM OVER THE 36,000 MILE WARRANTY AS MY WORK ENTAILS DRIVING. THE LOCAL DEALER QUOTED ME $2800 FOR REPAIRS, HE CHECKED WITH THE TOYOTA MFG. REP TO SEE IF POSSIBLY THE ABS ACTUATOR IS COVERED UNDER THE POWERTRAIN PORTION (60000 MILES) OF TOYOTA'S WARRANTY. TOYOTA DEALER STATED NO WARRANTY COVERAGE DUE TO MILEAGE. LOCATED NUMEROUS COMPLAINTS AND RECALL FOR \"CERTAIN MODEL YEAR\" 2016 TOYOTA RAV4 RECALL - #16V198000  RECALL FOR SERVICE BRAKES, HYDRAULIC : ANTILOCK.    IT APPEARS THEY ARE AWARE OF A PROBLEM WITH THE 2016 MODEL BUT WILL ONLY A FEW OF THE ONES SOLD.",
        "vin": "2T3RFREV0GW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985690,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING 55 MPH, A ROCK STRUCK THE WINDSHIELD AND CAUSED IT TO FRACTURE. THE CONTACT WAS CONCERNED THAT THE WINDSHIELD MAY NOT HAVE BEEN PROPERLY CONSTRUCTED. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED. THE CONATCT WAS INFORMED BY THE DEALER THAT THE REPAIR PART WAS ON BACKORDER. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 9,421.",
        "vin": "JTMDFREV7GD"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "02/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984239,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING ANY SPEED AT NIGHT, THE HEADLIGHTS DID NOT PROVIDE ADEQUATE LIGHTING. THE CONTACT ALSO STATED THAT THE HEADLIGHT BEAMS FOCUSED APPROXIMATELY 20 FEET ABOVE THE GROUND, WHICH MADE IT DIFFICULT TO SEE THE ROAD. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE BULBS NEEDED TO BE CHANGED. THE CONTACT PURCHASED THE AFTER MARKET BULBS, BUT THEY PERFORMED WORSE THAN THE ORIGINAL BULBS. THE FAILURE RECURRED AND THE DEALER STATED THAT NOTHING ELSE COULD BE DONE. ADDITIONALLY, WHILE DRIVING AT A LOW SPEED ONLY, A GRINDING NOISE WAS HEARD WHEN THE BRAKE PEDAL WAS APPLIED. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 4,000.",
        "vin": "2T3ZFREVXGW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/21/2017",
        "dateOfIncident": "04/08/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LEAVING A RESTAURANT WITH OUR GRANDCHILD GETTING INTO OUR 2016 TOYOTA RAV4 VEHICLE, GLASS STARTED FALLING OFF THE BACK OF THE ROOF AS WE PULLED OUT ON THE HIGHTWAY. IT APPEARS THAT POSSIBLY A FOUR DOORS CLOSING CLOSE TO THE SAME TIME SHATTERED OUR SUNROOF. I TOOK THE VEHICLE TO LOMBARD TOYOTA IN LOMBARD, IL WHERE THEY DEEMED IT \"ROAD DAMAGE AT HIGHWAY SPEED\". I CORRECTED THE SERVICE REP TO CLARIFY WE WERE JUST TAKING OFF FROM THE RESTAURANT AFTER GETTING INTO THE CAR. THE REMAINING GLASS WAS PUSHED UPWARD AND NOT INWARD.  THIS IS OBVIOUSLY A DEFECTIVE SUNROOF ON THE RAV4, BUT NEITHER THE LOCAL DEALERSHIP NOR THE TOYOTA CUSTOMER SERVICE REPRESENTATIVE WILL TAKE RESPONSIBILITY. AFTER CLOSE TO TWO WEEKS UNABLE TO DRIVE THE CAR, I JUST PICKED IT UP YESTERDAY. THE BILL--$1400  I SEE OTHER SUNROOF HAVE BEEN REPORTED BLOWING UP. THANKFULLY, WE HAD INSIDE DOOR CLOSED.  NEVER AGAIN WILL I PURCHASE A VEHICLE WITH A SUNROOF, ESPECIALLY FROM TOYOTA.",
        "vin": "2T3RFREV6GW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/20/2017",
        "dateOfIncident": "03/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RAV 4 HAS AN AGGRESSIVE IDLE SPEED WHICH CAUSE THE CAR TO \"CREEP\" FORWARD WHEN STOPPED. IF EXCESS FORCE ISN'T APPLIED TO THE BRAKE, THE CAR WILL MOVE FORWARD AT STOP LIGHTS ETC. I INITIALLY REPORTED THE PROBLEM TO TOYOTA OF VACAVILLE CA. ON 8/25/216. I HAD RENTED A TOYOTA COROLLA WHILE THE DEALERSHIP INVESTIGATED THE PROBLEM ALONG WITH ROUTINE MAINTENANCE. THE REPORT CAME BACK THAT THE CAR OPERATED NORMALLY. I THEN ASKED TO DO A \"TEST DRIVE\" WITH THE CHIEF MECHANIC. WE WENT OUT IN THE COROLLA FIRST TO A FLAT LEVEL LOCATION IN THE PARKING LOT. AFTER STOPPING THE CAR I RELEASED THE BRAKE TO DEMONSTRATE HOW DOCILE THE CAR REACTED WHEN THE BRAKE WAS RELEASED. WE THEN GOT INTO MY RAV 4 AND RETURNED TO THE SAME LOCATION. I REPEATED THE PROCESS AND NOTED WITH THE MECHANIC HOW MUCH MORE AGGRESSIVE THE RAV REACTED WHEN THE BRAKE WAS RELEASED. MY ASSUMPTION IS THAT THE IDLE IS SET TOO HIGH WHICH CAUSES THIS PROBLEM OF \"CREEPING\" WHILE STOPPED. THE MECHANIC AGREED THAT IT APPEARED MORE AGGRESSIVE BUT WANTED TO DO FURTHER TESTING, SO ON 8/28/2017 I RETURNED THE CAR TO THE DEALERSHIP. THE MECHANIC TEST DROVE ANOTHER RAV 4 AND DID A TIME TEST ON HOW FAST IT WENT FROM POINT A TO POINT B. HE REPEATED THE PROCESS WITH MY CAR. HIS REPORT STATED THAT BOTH RAV 'S PERFORMED THE SAME.  UNSATISFIED WITH THE TESTING DONE AT THE DEALERSHIP I CALLED TOYOTA CUSTOMER CARE ON 8/30/207 AND STATED MY CONCERN. I WAS TOLD THAT THE DEALERSHIP COULD NOT ADJUST THE IDLE ON THE CAR BECAUSE THAT'S THE WAY THE CAR WAS DESIGNED AND TO CHANGE IT WOULD VOID THE WARRANTY. SO TOYOTA ENGINEERED INTO THE RAV 4 A PROBLEMATIC IDLE SPEED?  I FEEL THIS IS A SAFETY ISSUE AND ONE DAY I WILL REAR END SOMEONE. I HAVE OWNED OVER 30 TOYOTAS DURING MY LIFE, RENTED HUNDREDS OF CARS DURING MY CAREER AND HAVE NEVER HAD A CAR RESPOND THE WAY THIS RAV 4 DOES.",
        "vin": "2T3ZFREVOGW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2017",
        "dateOfIncident": "04/17/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979394,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF IMPLODED WHILE DRIVING TO WORK. HEARD EXPLOSION, LOOKED UP, AND GLASS FROM SUNROOF STARTING FALLING INTO CAR. SUNROOF VISOR WAS OPEN AT THE TIME. SUNROOF WAS CLOSED. WAS NOT A WARM DAY (AS I HAVE SEEN THIS BE A PROBLEM IN OTHER CASES). LOOKED BEHIND THE CAR AND DID NOT SEE ANYTHING THAT MIGHT HAVE FALLEN ON THE ROOF AND CAUSED THE GLASS TO BREAK. THERE WAS NO ONE IN FRONT OF ME (SO IT WAS NOT A STONE/PEBBLE FROM CAR IN FRONT OF ME).",
        "vin": "JTMDFREV9GJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970372,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING DAYLIGHT DRIVING SPEEDOMETER IS DIFFICULT OR IMPOSSIBLE TO READ. DEALER REPORT THAT EVERYTHING IS \"WORKING AS IT SHOULD\", BUT I CANNOT DETERMINE MY SPEED ACCURATELY.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958261,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN THREE TIMES AT LIPTON TOYOTA OF OAKLAND PARK, FORT LAUDERDALE REGARDING A NOISE IN MY BREAKS, SPECIALLY WHEN I HIT THE BREAKS. THEY STATE THEY DON'T HEAR ANYTHING BUT IT IS CLEARY HEARD WHEN I HIT THE BREAKS.   I BELIEVE THEY DON'T WANT TO REPAIR NOR DO ANYTHING REGARDING MY SITUATION. IT IS NOT SAFE TO DRIVE THE CAR, SPECIALLY I AM A REALTOR AND I AM ALWAYS DRIVING.",
        "vin": "JTMZFREV7GJ"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955326,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT FIRST READING THIS MAY NOT SEEM TO BE MUCH OF A SAFETY ISSUE, BUT GIVING IT THOUGHT IT REALLY IS. MY RAV4 HAS A JBL GREENEDGE RADIO INSTALLED WITH XM CAPABILITY. THE RADIO DISPLAY SCREEN IS DIVIDED INTO 2 SECTIONS, THE RIGHT SHOWS WHAT SONG IS PLAYING WHILE THE LEFT SIDE DISPLAYS MY PRESET CHANNEL LISTINGS. I HAVE MY PRESET CHANNELS BATCHED TOGETHER WITH ALL AM, FM AND XM STATIONS GROUPED TOGETHER. WHEN CHANGING FROM AM TO FM OR BACK AGAIN THE LEFT SIDE OF THE DISPLAY CHANGES ACCORDINGLY, DISPLAYING THE PRESET CHANNEL LIST AND HIGHLIGHTING THE CHANNEL BEING LISTENED TO. HOWEVER IF I GO FROM EITHER AM OR FM TO XM THE PRESET DISPLAY DOES NOT CHANGE, THE HIGHLIGHT BAR DISAPPEARS BUT THE DISPLAY STAYS ON EITHER THE AM OR FM PRESET LIST. I AM FORCED TO EITHER MANUALLY SCROLL BY REPEATEDLY TOUCHING THE SCREEN SCROLL ICONS OR REACH OVER AND TURN THE RADIO OFF THEN BACK ON AGAIN. WHEN THE CAR STARTS UP A WARNING SCREEN APPEARS ON THE RADIO WARNING THAT BEING DISTRACTED BY THE SCREEN MAY CAUSE A SERIOUS ACCIDENT, YET THE RADIO THEY INSTALLED FORCES YOU TO DO JUST THAT. I HAVE CONTACTED BOTH TOYOTA AND JBL. ONLY TOYOTA HAS RESPONDED BY SAYING THAT'S JUST HOW THIS RADIO WORKS. I AM HOPEFUL YOU WILL SEE THIS TO BE A SAFETY ISSUE AND URGE TOYOTA AND JBL TO AMEND THE SOFTWARE FOR THIS RADIO TO CORRECT THIS ISSUE. I HAVE ATTACHED A PHOTO SHOWING THAT AN XM STATION IS PLAYING BUT THE PRESET DISPLAY IS STILL ON FM.",
        "vin": "JTMYFREV6GJ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/12/2017",
        "dateOfIncident": "02/09/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954087,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL; WHILE ATTEMPTING TO BACK OUT OF A DRIVE WAY, THE ACCELERATOR STUCK CAUSING THE CAR TO HIT A BUSH AND A HOUSE. AFTER RECOVERING AND ATTEMPTING AGAIN, THE CAR ACCELERATOR STUCK A SECOND TIME CAUSING THE CAR TO HIT ANOTHER BUSH.",
        "vin": "JTMYFREV2GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/06/2017",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949874,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT THE BRAKE PEDAL WAS SLOW TO ENGAGE AND RELEASED WITHOUT WARNING. AS A RESULT, THE CONTACT HAD TO APPLY FORCE TO THE BRAKE PEDAL EACH TIME THE FAILURE OCCURRED. THE VEHICLE WAS TAKEN TO THE DEALER MORE THAN ONCE. THE DEALER TEST DROVE THE VEHICLE AND WAS UNABLE TO REPLICATE AND DIAGNOSE THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V198000 (SERVICE BRAKES, HYDRAULIC, ELECTRONIC STABILITY CONTROL). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "JTMZFREV7GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/21/2017",
        "dateOfIncident": "01/19/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946843,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR BRAND NEW. AFTER 1 MONTH I STARTED NOTICING A GRINDING SOUND WHEN I WOULD APPLY MY BRAKES, ONLY IF I WAS DRIVING SLOWLY. 2 MONTHS LATER I STARTED HEARING A GRINDING NOISE AS IF METAL WAS GRINDING ON METAL AND THIS WOULD HAPPEN INTERMITTENTLY REGARDLESS OF HOW FAST I WAS DRIVING AND OCCASIONALLY I WOULD HEAR IT WHEN I WAS COMPLETELY STOPPED AS WELL. I WENT TO THE DEALERSHIP AND THEY TOLD ME THE ROTORS HAD DEVELOPED \"HOT SPOTS\" AND THAT THIS WAS LIKELY CAUSED BY SLAMMING ON THE BRAKES OR CRUISING WHILE MY FOOT WAS ON THE BRAKES. I HAD A 2009 NISSAN CUBE FOR 7 YEARS AND DROVE THE SAME WAY AND NEVER ONCE HAD A PROBLEM WITH MY BRAKES IN THAT TIME PERIOD OR EVEN HAD TO SERVICE/REPLACE THEM. EVEN IF THIS ISSUE IS CAUSED BY THE WAY I AM DRIVING, MY CAR IS NOT EVEN 3 MONTHS OLD AND ROTORS SHOULD NOT BE WEARING DOWN THAT QUICKLY. THANKFULLY NO SAFETY ISSUES OCCURRED AS A RESULT OF THIS BUT I IMAGINE IF SOMETHING LIKE THIS IS NOT ADDRESSED IT CAN CERTAINLY AFFECT BRAKE FUNCTION WHICH WOULD RESULT IN AN ACCIDENT.",
        "vin": "2T3BFREV7GW"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/21/2016",
        "dateOfIncident": "12/05/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10936651,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 5, 2016 I WAS INVOLVED IN AN ACCIDENT. MY VEHICLE WAS STRUCK IN THE LEFT FRONT FENDER BY ANOTHER VEHICLE. IMPACT WAS DIRECT AS THE OTHER VEHICLE STRUCK MINE AT A NINETY DEGREE ANGLE CAUSING EXTENSIVE DAMAGE TO THE FENDER AND LEFT FRONT WHEEL ASSEMBLY. IMPACT FORCED MY VEHICLE OFF THE HIGHWAY AND INTO A CONCRETE PILLAR SUPPORTING A STEEL LIGHTPOLE. I WAS TRAVELLING ABOUT 30 MPH AT TIME OF IMPACT WITH THE CONCRETE PILLAR. SUDDEN IMPACT CAUSED THE REAR OF MY VEHICLE TO LEAVE THE GROUND. THIS WAS THE DIRECT RESPONSE TO THE SUDDEN STOP. AIR BAGS DID NOT DEPLOY. AT THE TIME OF ACCIDENT I WAS TRAVELLING ON A HIGHWAY AND IN MOTION. VEHICLE WAS EQUIPPED WITH DRIVER, PASSENGER AND SIDE AIRBAGS.",
        "vin": "JTMRFREV8GJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2016",
        "dateOfIncident": "12/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935415,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STATED THAT THE VEHICLE ACCELERATED WHILE IN PARK ON NUMEROUS OCCASIONS. THE VEHICLE WAS TOWED TO THE DEALER, BUT THE FAILURE WAS UNABLE TO BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 1,025.",
        "vin": "JTMRFREV4GJ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934892,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO A PARKING SPACE IN A PARKING DECK.  AS I TURNED INTO THE SPOT I APPLIED THE BRAKES.  THE BRAKE PEDAL WENT TO THE FLOOR AND THE CAR WOULDN'T SLOW OR STOP. THERE WAS NO BRAKING POWER WHATSOEVER.  I TOOK MY FOOT OFF THE BRAKE PEDAL AND THE CAR CRASHED INTO THE CONCRETE WALL.",
        "vin": "JTMRJREV7GD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934353,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE THIS CAR FOR 12500 MILES ONLY AND I HAD SQUEAKING NOISE FROM BREAKS I WENT TO TOYOTA DEALERSHIP THEY FIXED IT AND NO CHARGE FOR IT. SO BREAK HAS A PROBLEM BUT THEY DID NOT ADMIT IT. THE MECHANIC SAID IF IS NOT MANUFACTURE DEFECT NO NEED TO RESURFACE AND REPLACE THE BREAK. IT CAUSES THE SURFACE TO BE THIN AND EITHER I HAVE TO REPLACE IT OR WILL SONN BE BAD AGAIN.",
        "vin": "JTMBFREV7GD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/02/2016",
        "dateOfIncident": "10/02/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10929666,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE THE VEHICLE WAS STATIONARY, THE AUTOMATIC LIFTGATE CRASHED DOWN ONTO THE CONTACT, WHICH CAUSED INJURY AND DISCOLORATION TO THE CONTACT'S SPINE.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 25,000.  ..UPDATED 03/09/17 *BF  CONSUMER STATED SHORTLY AFTER INJURY TOYOTA ISSUED A \"LIMITED SERVICE CAMPAIGN\" TO REMEDY OR REPLACE THE POWER BACK DOOR ECU (ELECTRONIC CONTROL UNIT). UPDATED 7/16/18*JB  *TR",
        "vin": "2T3RFREVXGW"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/01/2016",
        "dateOfIncident": "11/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928978,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRUNK LIFT GATE PISTON HAS NOT WORKED SINCE PURCHASING THIS CAR BRAND NEW WITH 32 MILES ON IT IN MARCH 2016.  THE PISTON WAS ORIGINALLY REPLACED 200 MILES INTO DRIVING THE CAR.  PISTON HAS REPEATEDLY FALLEN OFF OF JOINT AND HAS CAUSED EXTENSIVE BODY DAMAGE MULTIPLE TIMES.  THIS HAPPENED AGAIN OVER THE WEEKEND AND CAUSED VERY EXTENSIVE DAMAGE TO THE TRUNK AND ROOF OF THE CAR AND THE TRUNK IS UNABLE TO BE SHUT.  CAR IS OUT OF SERVICE CURRENTLY AND THE TRUNK HAD TO BE BUNGEED TO ANOTHER PART OF THE CAR IN ORDER TO DRIVE IT TO A NEARBY DEALER WHICH WAS A 30 MILE DRIVE ON THE HIGHWAY.  THE TRUNK WOULD NOT SHUT AND IT WAS OPEN THE ENTIRE DRIVE.  I HAVE 2 YOUNG CHILDREN IN CAR SEATS AND DO NOT FEEL SAFE PUTTING THEM IN THIS VEHICLE DUE TO THE FAULTY AUTOMATIC LIFT GATE ISSUE.  *TR",
        "vin": "JTMRJREV3GD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "11/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928394,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED THAT WHEN SHIFTING FROM REVERSE INTO DRIVE THE TRANSMISSION CAN TAKE 2-3 SECONDS TO ACTUALLY \"SHIFT\" INTO THE DRIVE GEAR AND HAVE THE GAS PEDAL MOVE CAR FORWARD. DURING THE 2-3 SECONDS, PRESSING THE GAS DOES NOTHING BUT REV/INCREASE THE RPM IN THE ENGINE. IF YOU DO PRESS THE GAS AND THE \"SHIFT\" TAKES PLACE IT WILL JERK THE VEHICLE FORWARD A BIT.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2016",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928126,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS INCIDENT OCCURRED ON 8/30/16 AND INVOLVED A SUDDEN TOTAL AND UNEXPECTED LOSS OF POWER IN TRAFFIC AT INTERSTATE SPEEDS.  VEHICLE INVOLVED WAS A SIX MONTH OLD 2016 TOYOTA RAV4 WITH 5300 MILES.  INCIDENT OCCURRED IN SOUTHBOUND LANES OF   I-65 BETWEEN LAFAYETTE AND LEBANON, IN. WHILE MOVING AT 60 MPH IN A VERY HEAVY RAINSTORM.      FORTUNATELY, I WAS IN THE RIGHT HAND LANE AND WAS ABLE TO COAST TO THE SHOULDER OF THE ROAD WITHOUT BEING STRUCK BY FOLLOWING TRAFFIC AND HAD THE VEHICLE TOWED TO A TOYOTA DEALER IN AVON, IN.    AFTER EXAMINING MY VEHICLE THE DEALERSHIP INFORMED ME THAT THERE WAS WATER IN MY ENGINE WHICH WAS NOT COVERED BY MY WARRANTY.  THEY ALSO TOLD ME THAT I HAD BEEN DRIVING THROUGH DEEP STANDING WATER.  WHEN TOLD THAT I WAS DRIVING ON INTERSTATE, THE DEALERSHIP TOLD ME THAT THEN IT WAS \"AN ACT OF  GOD\" AND STILL WAS NOT COVERED.    SINCE DEALING WITH REPLACEMENT OF THE ENGINE, AT A COST OF $10,000, I HAVE HAD THE CAR EXAMINED BY A MECHANICAL ENGINEER WHO IS OF THE OPINION THAT THIS PROBLEM OCCURRED DUE TO THE RE-DESIGN OF THE AIR INDUCTION SYSTEM.  AIR IS INDUCTED AT LEFT FRONT WHEEL AND, WITH HEAVY RAIN,  WATER SPLASHING OFF ROAD IS FORCED THRU AIR FILTER. WATER SHOULD NOT REACH THE AIR FILTER BUT, SINCE THIS IS THE ONLY AVENUE FOR ENTRANCE TO THE ENGINE WITHOUT SUBMERSION, IT OBVIOUSLY DID.  ONCE FILTER IS SATURATED THERE ARE NO BAFFLES OR SWALES TO PREVENT WATER FROM RUNNING DIRECTLY   INTO THE INTAKE OF THE ENGINE.    TOYOTA ACCEPTS NO RESPONSIBILITY FOR THIS INCIDENT EITHER FINANCIALLY OR FOR SAFETY CONCERNS.  THEY DO NOT BELIEVE THAT I WAS JUST DRIVING DOWN THE INTERSTATE.  I HAVE A DISTINCT ADVANTAGE IN THAT IKNOW THAT THIS IS TRUE.  I FEEL EXTREMELY FORTUNATE TO HAVE AVOIDED A CRASH AT THIS SPEED AND IN THESE CONDITIONS.  I HOPE THAT TOYOTA DOES NOT WAIT UNTIL WE HAVE SERIOUS INJURY OR LOSS OF LIFE TO ACKNOWLEDGE AND CORRECT THIS DESIGN FLAW.  *TR",
        "vin": "2T3DFREV9GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927301,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT BEAMS ARE CAPPED BY WHAT APPEARS AS A HORIZONTAL LINE IN THE MIDDLE OF THE WINDSHIELD AS IF A SHADE IS HALFWAY DOWN.  LIMITED ROAD IS VISIBLE BELOW THE LINE AND JUST PITCH BLACK ABOVE.  IF THE VEHICLE IS PITCHED DOWN AS WHEN GOING DOWN A HILL YOU CAN ONLY SEE ABOUT FIFTY FEET AHEAD.  EXTREMELY DANGEROUS.  YOU HAVE TO CONTINUOUSLY HAVE HIGH-BEAMS ON AND THOSE ARE DIRECTED TO THE CENTER OF THE ROAD RATHER THAN HAVING A BROAD BEAM.  ALSO, THERE IS NO LIGHT TO THE FRONT OF EITHER SIDE SO TURNING AT NIGHT IS BLIND AS YOU MAKE THE TURN.  WE NEED THIS FLAW CORRECTED IMMEDIATELY.  WHAT RECOURSE DO WE HAVE?",
        "vin": "2T3BFREV1GW"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925945,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE CONTACT STRUCK A CURB WHILE DRIVING AND ALL THE WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL SYSTEM WAS NO LONGER IN ALIGNMENT. THE VEHICLE COULD NOT BE REPAIRED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS CONFIRMED THAT THE ELECTRICAL SYSTEM NEEDED TO BE UPDATED AND REALIGNED. THE VEHICLE WAS REPAIRED; HOWEVER, THE DEALER STATED THAT THERE WERE ADDITIONAL FAILURES THAT WERE NOT DISCLOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 200. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "10/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920209,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING AT NIGHT, THE HEADLIGHTS FAILED AND IMPAIRED THE CONTACT'S VISION. AS A RESULT, THE CONTACT DROVE OFF THE ROAD. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 9,800.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "02/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918416,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS BRAND NEW 2016 RAVE LIMITED CONSTANTLY PULLS TO THE RIGHT WHILE MOVING.. HAD 2 ALIGNMENTS DONE, TIRES ROTATED AND BALANCED AND STILL THE SAME PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/18/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916849,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKING MY VEHICLE IN A PARKING SPACE (ON AN INCLINE) WHEN I APPLIED THE BREAKS, THE CAR LURCHED FORWARD JUMPED A RAISED SIDEWALK AND CAME TO A STOP AFTER HITTING THE CONCRETE WALL OF A BUILDING. IT CAUSED DAMAGE TO THE BUILDING AND THE FRONT OF THE VEHICLE. I HAD THE VEHICLE CHECKED AT THE PURCHASING DEALER AND THEY FOUND NOTHING WRONG.",
        "vin": "JTMDJREVXGD"
    },
    {
        "components": "SUSPENSION,STRUCTURE,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/18/2016",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916854,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING THIS VEHICLE WHEN SHE WAS BACKING OUT WHEN MY CAR SURGED  BACKWARD INTO A TREE THAT PREVENTED HER FROM GOING DOWN A REVENE ON A MOUNTAIN.  THERE IS DAMAGE TO THE REAR BUMPER, REAR DOOR, UNDERCARRAGE, AND STRUCTURAL.  *TR",
        "vin": "JTMDJREVXGD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916406,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT CUSHION CLOTH MATERIAL STARTING TO FRAY AND DETERIORATE. FABRIC EVENTUALLY IS GOING TO FRAY AND STUFFING WILL BEGIN TO FALL OUT",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/08/2016",
        "dateOfIncident": "09/27/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914853,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ARE INADEQUATE AND  VERY UNSAFE. LIGHT CAST IS A HALF MOON WITH A HORIZONTAL UPPER BORDER.  IT IS DARK ABOVE THAT AND THERE IS MINIMAL PERIPHERAL LIGHT CAST BY THE HEADLIGHTS SO TURNING CORNERS IS VERY DIFFICULT.  HIGH BEAMS ONLY SLIGHTLY IMPROVE ABILITY TO SEE.",
        "vin": "2T3BFREV4GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914914,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THIS CAR THE LAST WEEK OF JUNE 2016, MY 2016 RAV4 SLE HYBRID CENTER CONSOLE DECK LID SLAM TO CLOSE THERE IS NO SPRING TO HOLD THE LID IN THE CONSOLE SO YOU CAN CLOSE IT NORMALLY, MY GRANKIDS (6 AND 5 YEARS OLD) CAN GET HURT IF THEY PUT THEIR FINGER, TOOK IT TO THE DEALER THEY SAY THIS MODEL DOESN'T HAVE THE SPRING, THIS IS VERY DANGEROUS FOR THE KIDS IF THEY OPEN THE LID AND LET IT GO COULD EASILY BREAK THEIR FINGERS,IT DOES NOT CLOSE LIKE A REGULAR OTHER CAR LID, MECHANICS CHECKED AND SHOW ME THE DIFFERENCE BETWEEN MY CAR AND ANOTHER TOYOTA RAV4 HYBRID LIMITED 2016 THAT IT HAS THE SPRING BUT THE RAV4 SLE HYBRID 2016 NOT, SO PLEASE DO SOMETHING BEFORE ANY CHILD GET HURT AND THAT WILL BE VERY BAD THEY COULD LOSE A FINGER, WITH THE FORCE THAT THE LID CLOSES.",
        "vin": "JTMRJREV8GD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910663,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS WHISTLE OR WHINING NOISE ON ACCELERATION AT 55-70 MPH.  (PREVIOUSLY THE VEHICLE MADE THIS NOISE AT LOWER SPEEDS AND THE TRANSMISSION WAS REPLACED (REPAIR ORDER WAS OPENED ON 6/1 AND CLOSED ON 6/9/2016).  AS STATED ABOVE THE VEHICLE NOW WHINES/WHISTLES AT 55-70 MPH.  APPARENTLY REPLACING THE TRANSMISSION DID NOT RESOLVE THE ISSUE.",
        "vin": "JTMZFREV2GD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910676,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS THE VEHICLE WAS PULLING INTO ITS USUAL PARKING SPOT AT SLOW SPEED WITH THE FOOT BRAKE BEING APPLIED, IT SUDDENLY AND UNCONTROLLABLY ACCELERATED.  DESPITE THE FOOT BRAKE BEING FULLY APPLIED, THE VEHICLE COULD NOT BE STOPPED UNTIL IT STRUCK AN UNMOVABLE OBJECT.",
        "vin": "JTMDJREV9GD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "09/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908585,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ENTERING A PARKING SPACE IN A NORMAL AND FREQUENT MANNER ON THE SIDE OF A WALMART STORE THE VEHICLE FAILED TO RESPOND TO THE BRAKE PEDAL WHEN APPLIED.  THE VEHICLE KEPT MOVING AND PROCEEDED OVER THE SIDEWALK AND INTO THE FENCED AREA AROUND THE GARDEN DEPT.  BRAKES WERE APPLIED SEVERAL TIMES. NO OTHER VEHICLES INVOLVED AND NO OTHER PERSONS INVOLVED EXCEPT DRIVER (MYSELF), HUSBAND AND SON.",
        "vin": "JTMBFREV4GJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906056,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS SAFETY ISSUE WHICH I HAVE SEEN MENTIONED BY MANY OTHER BUYERS ONLINE AND HAVE PERSONALLY SEEN ON A 2015 RAV4 CONSISTS OF TWO PIECES OF PLASTIC MOLDING ON THE DASH BOARD WHICH APPEAR TO BE DESIGNED TO LOOK LIKE SHINY METAL MOLDINGS BUT EXHIBIT A VERY DANGEROUS GLARE FROM BOTH THE FRONT AND SIDE REFLECTIONS FROM THE SUN. EVEN WHEN WEARING SUNGLASSES IT CAN MAKE IT DIFFICULT TO SEE WHERE YOU ARE GOING. I SHOWED THIS ISSUE TO THE SALESMEN AND HE COULD SEE IT TOO. HE SAID THAT HE WOULD TRY AND FIND THE PHONE NUMBER FOR A TOYOTA REPRESENTATIVE AND CALL HIM ABOUT THE PROBLEM. AFTER NOT HEARING BACK FROM HIM I RETURNED A FEW DAYS LATER AND HE TOLD ME THAT NO ONE AT THE DEALERSHIP COULD LOCATE HIS NUMBER. HE THEN TALKED TO HIS MANAGER AND RETURNED TO TELL ME THAT HIS MANAGER WOULD SEND AN EMAIL TO THE REGIONAL REPRESENTATIVE TO SEE IF ANYTHING COULD BE DONE ABOUT THE PROBLEM. IT HAS BEEN MANY WEEKS NOW AND I HAVE NOT HEARD BACK FROM ANYONE ABOUT RESOLVING THIS SAFETY ISSUE.",
        "vin": "JTMDJREV9GD"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/04/2016",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10903507,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NA",
        "vin": "JTMRJREV4GD"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "08/05/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903096,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE FIRST STARTUP OF THE DAY (OR AFTER COOLED DOWN) THE STEERING WHEEL MOVES RAPIDLY FROM SIDE-TO-SIDE AND THE ENGINE SURGES ROCKING THE CAR BACK AND FORTH. THE CAR IS IN PARK, AND MY FOOT HAS TO BE ON THE BRAKE TO START THE CAR, BUT I'M CONCERNED ABOUT THIS HAPPENING IN TRAFFIC WITH THE CAR IN GEAR. SO FAR IT'S AN INTERMITTENT PROBLEM. I CAN'T REPRODUCE IT FOR THE DEALERSHIP. THE STEERING WHEEL CAN WOBBLE AT STARTUP WITHOUT THE ENGINE SURGING. THIS HAS BEEN HAPPENING SINCE I LEASED THE CAR.",
        "vin": "JTMDJREV9GD"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899864,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 TOYOTA RAV 4 CHECK ENGINE LIGHT  CAME ON.. I TOOK IT IN FOR SERVICE AND THE MECHANIC  SAID THAT A RODENT CHEWED THE WIRES AND THAT THE  ENTIRE ENGINE WIRE HARNESS NEEDS TO BE REPLACED  FOR 2080.  ALSO THAT THE WARRANTY DOESN'T COVER  IT EVEN THOUGH IT'S ONLY 7 MONTHS OLD AND THEY  KNOW IT'S DO TO FAULTY WIRES OR USING SOY PRODUCTS.",
        "vin": "2T3BFREV5GW"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/28/2016",
        "dateOfIncident": "08/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10902035,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA PRE-COLLISION SYSTEM (PCS) ON 2016 RAV4. I NEVER GET ANY KIND OF WARNING, EVEN WHEN CARS CUT ME OFF AT HIGHWAY SPEEDS, I APPROACH A CAR FROM BEHIND AT SPEED (I CANNOT GET TOO RISKY HERE), ETC. OTHER PCS SYSTEMS ON FRIENDS CARS (NON TOYOTA) HAVE SOME WARNINGS, EVEN FALSE ONES A BIT. I ASKED MY DEALER TO CHECK IT WAS WORKING, THEY HAD NO PROCEDURES TO TEST IT OTHER THAN OBDII FOR SENSORS OUT. SEEMS LIKE THE PROMISED AND IIHS TESTS INDICATED THAT THIS PCS SYSTEM WORKED TO STOP THE CAR. ON LINE SEARCHES I CANNOT FIND ANYONE WHO HAS SEEN THEIR SYSTEM WORKING OR ALARMS. THE TOYOTA VIDEO INDICATES WARNINGS SEEM TO OCCUR AT 7-10 CAR LENGTHS - I HAVE BEEN CUT OFF ON HIGHWAY AT LESS THAN ONE CAR LENGTH WITH NO WARNINGS. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896294,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A  2016 TOYOTA RAV4. THE CONTACT STATED THAT WHEN THE BRAKE PEDAL WAS DEPRESSED, ALL OF THE AIR BAGS DEPLOYED WITHOUT WARNING. AS A RESULT, THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE AND THE FRONT PASSENGER AIR BAG DEPLOYED AND METAL FRAGMENTS EJECTED FROM THE AIR BAGS ALONG WITH A YELLOW POWDER. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOWED TO AN AUTO BODY SHOP WHERE IT WAS DEEMED DESTROYED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS APPROXIMATELY 700.",
        "vin": "2T3BFREV8GW"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/10/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894701,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PRE COLLISION SYSTEM (PCS) DOES NOT WARN THAT THE CAR IS CLOSE TO ANOTHER VEHICLE AT ANY SPEED.  SINCE IT DOES NOT PROVIDE AN AUDIBLE, HOW CAN ONE BE SURE THAT THE PCS WILL STOP THE VEHICLE BEFORE A COLLISION.",
        "vin": "JTMDJREV9GD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "06/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA HAS INSTALLED A DECORATIVE SILVER TRIM ON THE 2016 RAV4 DASHBOARD FACING THE PASSENGER COMPARTMENT.  THIS TRIM REFLECTS SUNLIGHT INTO THE DRIVER'S EYES AT CERTAIN ANGLES OF BRIGHT SUNLIGHT.  THIS REFLECTION CAN APPEAR SUDDENLY WHEN MAKING A TURN OR EMERGING FROM A SHADOW.  THIS REFLECTION CAN DISTRACT OR PARTIALLY BLIND A DRIVER, AND OVER TIME FATIGUE A DRIVER.  ACCORDINGLY, I BELIEVE THIS DECORATIVE SILVER TRIM IS A SAFETY HAZARD AS DISTRACTED, FATIGUED DRIVERS CAUSE ACCIDENTS.  I BELIEVE TOYOTA SHOULD OFFER TO REPLACE THIS TRIM WITH A NON-REFLECTING MATERIAL.      OTHER TOYOTA RAV4 OWNERS HAVE COMPLAINED ABOUT THIS FEATURE ON THE INTERNET (SEE RAV4WORLD.COM).      I HAVE COMPLAINED ABOUT THIS DESIGN FEATURE DIRECTLY TO TOYOTA CORPORATE.  THEIR TECHNICAL REPRESENTATIVES LOOKED AT MY VEHICLE ON 27 JULY.  I WAS TOLD BY THE DEALER'S REPRESENTATIVE THAT TOYOTA CONCLUDED THIS IS THEIR STANDARD PART FOR 2016 RAV4 AND AS SUCH IS NOT DEFECTIVE.  TOYOTA TECHNICAL REPRESENTATIVES WOULD NOT MEET WITH ME OR ALLOW ME TO SEE HOW THEY EVALUATED THE SUN REFLECTION - IT WAS A BRIGHT SUNNY DAY.  THE DEALER SAID TOYOTA WOULD NOT PROVIDE THEIR WRITTEN EVALUATION DISCREDITING MY COMPLIANT.      IN MY OPINION, TOYOTA TOOK THE EASY WAY OUT AS REPLACING THIS DECORATIVE TRIM IS INCONVENIENT FOR THEM.      YOU CAN EVALUATE THIS ISSUE ON ANY 2016 TOYOTA RAV4.    MY LOCAL DEALERSHIP, APPARENTLY AGREEING WITH ME ABOUT THE PROBLEM, HAS OFFERED TO DO AN UNAUTHORIZED MODIFICATION TO THE VEHICLE AND HAVE THE REFLECTIVE STRIP REMOVED, REPAINTED BLACK AND REINSTALLED.  THIS IS A LESS THAN IDEAL SOLUTION SINCE THE PAINT WILL NOT BOND WELL TO THE PLASTIC REFLECTIVE STRIP AND WILL WEAR OVER TIME.  IN ADDITION, THIS DOES NOT FIX THE TENS OF THOUSANDS OF OTHER RAV4S ON THE ROAD OR REDUCE THE POTENTIAL FOR AVOIDABLE ACCIDENTS.",
        "vin": "JTMDJREV2GD"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/21/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888807,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE THE VEHICLE WAS STARTED AND THE GEAR SHIFTER STICK WAS PLACED IN THE PARK POSITION, THE VEHICLE INDEPENDENTLY MOVED FORWARD AND CRASHED INTO AN UNOCCUPIED PARKED VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 900.",
        "vin": "2T3ZFREV6GW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885169,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THIS VEHICLE AT ANY SPEED, WHETHER IT IS WARMED UP OR RIGHT AFTER STARTING TO DRIVE THERE IS AN INTERMITTENT BRAKE FAILURE. THE BRAKE PETAL WILL GO ALL THE WAY TO THE FLOOR WITH NO SLOWING OR STOPPING OF THE VEHICLE. THIS HAPPENS IN ROUTINE TRAFFIC AND ALSO WITH A SUDDEN STOP.",
        "vin": "JTMZFREV1GJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/13/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884576,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4 EQUIPPED WITH BRIDGESTONE RADIAL TIRES, SIZE: P225/65R/17 (NA). WHILE THE VEHICLE WAS PARKED, THE FRONT PASSENGER SIDE TIRE EXPERIENCED A BLOWOUT. THE VEHICLE WAS TOWED TO A TIRE DEALER WHERE IT WAS DIAGNOSED THAT THE TIRE MODEL WAS DEFECTIVE. THE TIRE WAS REPLACED WITH A SPARE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN AND DOT NUMBER WERE UNKNOWN. THE TIRE AND VEHICLE FAILURE MILEAGE WAS APPROXIMATELY 1,900.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/04/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882526,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MIRRORS HAVE A SMALL 'BLIND SPOT' MIRROR THAT IS POORLY LOCATED.  TO HAVE THE MIRROR POSITIONED TO SEE THE NEIGHBORING LANES THE MAIN MIRROR SHOWS ALMOST 1/2 OF IT'S AREA  OF THE VEHICLE.  TO POSITION THE MAIN MIRROR TO PROPERLY SHOW THE AREA NEAR AND BEHIND THE VEHICLE THE BLIND SPOT MIRRORS SHOW AN AREA THAT IS IRRELEVANT.",
        "vin": "JTMWFREV5GD"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "04/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881355,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA RAV4 LIMITED-AT ALL TIMES OF INCIDENCES THIS VEHICLE WAS IN MOTION. SAFETY ISSUE!!!    1. I PURCHASED THE VEHICLE MARCH 26, 2016, TO COMMUTE TO NEW JOB.  2. HIGHWAY-WARNING 1 ON APX 4/4 MONDAY (9 DAYS AFTER PURCHASE)             \"CHECK TOYOTA PARK ASSIST HAVE VEHICLE CHECKED BY A DEALER\"                      THE CAUSE WAS SNOW ON SENSORS....SINCE WE ARE IN MONTANA THERE WILL BE SNOW ON SENSORS AT LEAST 8 MONTHS A YEAR.  4. HIGHWAY-WARNING 2 ON APX 4/18/16             \"AWD SYSTEM MALFFUNCTION 2 WHEELDRIVE MODE ENGAGED                 DEALER SAID LOOSE GAS CAP CAUSED THIS.  5.  HIWAY-APX 4/12/16-4/14/16 I WAS PASSING A DOUBLE CAR HAULER. THE CAR HAULER WAS GOING ABOUT 50-60 ON INCLINE AROUND A CORNER. I WAS GOING 80 (SPEED LIMIT) WITH 2 VEHICLES BEHIND ME AT THE SAME SPEED. WE WERE ALL PASSING THE CAR HAULER. ALL OF A SUDDEN WARNING SOUNDS IN FRONT OF CAR WENT OFF AND CAR BRAKED TO ALMOST AN IMMEDIATE STOP THEN ALARMS IN BACK OF CARS WERE GOING OFF BECAUSE THE CARS BEHIND ME WERE COMING UP ON MY REAR. I PRESSED THE GAS AND THE BRAKE AND NOTHING, TURNED THE WHEEL TOWARD LEFT AND CAR STARTED TO GO. I AM FEARFUL OF THIS VEHICLE. I AM A WIDOW AND AM AFRAID TO PUT MY CHILDREN IN IT. I PARKED THE CAR AFTER THIS INCIDENT AND CONTACTED TOYOTA MANUFACTURER. THEY REJECTED REPURCHASE. I HAD BEEN IN CONSTANT CONTACT WITH DEALER (OVER 20 LOGGED CALLS AND ALMOST 100 TEXTS) THEY OFFERED TO TRADE VEHICLE AT $28K FOR A VEHICLE THAT WAS 2 WEEKS OLD. I OWED $34K ON IT. THAT IS A LOSS OF $6000 IN 2 WEEKS ON A VEHICLE WITH SAFETY ISSUES.     THE CAR HAD 63 MILES ON IT WHEN I DROVE IT OFF THE LOT, I DROVE FROM DEALERSHIP TO HOME WHICH WAS 225+ MILES. THEN I COMMUTED FROM HOME TO NEW JOB FROM (80 MILES EACH WAY TO WORK) FROM MARCH 28-APRIL 18=16 WORK DAYS AND 1 OR 2 OVERTIME DAYS/VISIT FRIENDS (3,168 MILES) I AM AT ABOUT 3,300 MILES NOW.",
        "vin": "JTMDFREV2GD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A RED LIGHT THE VEHICLE JUMPED FORWARD AND STRUCK THE VEHICLE IN FRONT OF ME.  I NEVER TOOK MY FOOT OFF THE BRAKE.",
        "vin": "2T3BFREVXGW"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "04/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875460,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL ON MY 2016 RAV4 LE AWD WITH 6 SPEED AUTOMATIC TRANSMISSION IS VERY ERRATIC.  AT HIGHWAY SPEED (60-70 MPH) IT IS FINE ON A FLAT ROAD, BUT AT THE SLIGHTEST INCLINE WILL DOWNSHIFT TO FIFTH, THEN SLAM INTO FOURTH GEAR WITH THE ENGINE RPMS GOING UP TO OVER 4000.  IT WILL THEN EITHER STAY DOWNSHIFTED OR CONSTANTLY SHIFT UP AND DOWN UNTIL I AM WELL OVER THE TOP OF THE HILL.  THE DEALER SAID THEY ALL DO THAT, SO IT'S NORMAL. I'VE STOPPED USING THE CRUISE BECAUSE I'M CONCERNED ABOUT POSSIBLE ENGINE AND TRANSMISSION DAMAGE FROM THE HARSH SHIFTING AND HIGH RPMS, BUT IT ALSO IS VERY DISTRACTING TO THE DRIVER WHICH MAKES IT A SAFETY ISSUE.  I'VE COMPLAINED TO \"ASK TOYOTA\" CUSTOMER SERVICE TWICE.  THEY JUST SAY THEY'LL PASS ALONG MY COMPLAINT TO THE PROPER DEPARTMENT.",
        "vin": "2T3BFREV2GW"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872981,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCH 2016 TOYOTA AWD RAV4 1 WK AGO. NEVER TRIED LIGHTS B4 PURCH AS WAS DAYLIGHT. THE NEXT MORNING W/DARK GOING TO WORK I USED THE HEADLIGHTS TO FIND OUT YOU CANT SEE W/THEM. I HAVE NEVER HAD HEADLIGHTS I COULDNT SEE WITH. ON DIM: BEAMS SHORT FOOTAGE IN FRONT OF VEHICLE & THE FIELD OF VISION IS DARK W/LINE OF DARKNESS ABOVE BEAM & YOU CANNOT SEE ANY FUTHER. LIKE YOU ARE IN A BIG BLACK TUNNEL. YOU DONT HAVE A FIELD OF VISION ON THE FRONT & SIDES OF THE VEHICLE AT ALL! THE DRIVER COULD POSSABLY HIT SOMETHING OR A PEDESTRIAN, ETC.DUE TO IMPROPER VISION LIGHTING. I HAD TO STOP & ROLL DOWN THE DRIVERS WINDOW SO I COULD MAKE SURE I WAS TURNING LEFT CORRECTLY ON THE ROAD TO MY HOME AT NIGHT. I LIVE IN THE COUNTRY WITH NO STREET LIGHTS. HIGH BEAM: BEAM UP AT THE TREE TOPS IN FRONT OF YOU CRIS CROSSED.  WITH THESE HEADLIGHTS YOU HAVE NO FIELD OF VISION!  I AM AFRAID TO DRIVE AFTER DARK BECAUSE I CANNOT SEE AT ALL!  I HAVE TAKEN VEHICLE TO DEALERSHIP WHERE PURCHASED & THEY STATE CANT ADJUST THEM BUT THEY DID TRY TO. VISION WAS/IS STILL BAD. I TOOK VEHICLE TO ANOTHER DEALERSHIP TO SEE IF  MIGHT KNOW HOW TO ADJUST & THEY STATED SAME THING.  THEY CHECKED THE LIGHTS, STATED LIGHTS WERE IN TOYOTA'S SPECS & IS LITTLE ROOM FOR ADJUSTMENT.  I TRIED USING AGAIN THIS MORNING & STILL BAD FIELD OF VISION.  I CALLED & ASKED DEALERSHIP TO FILE OFFICIAL COMPLAINT W/TOYOTA CONCERNING THE BAD FIELD OF VISION OF THESE HEADLIGHTS, DUE TO BEING AFRAID I MIGHT HIT SOMETHING I CANT SEE & BE KILLED OR INJURED OR HIT SOMEONE ELSE I CANT  SEE & INJURE OR KILL THEM.  THE PROBLEM W/HEADLIGHTS NEEDS TO BE ADDRESSED IMMEDIATLLY BEFORE THIS HAPPENS W/ME OR SOMEONE ELSE. THE DEALERSHIP STATED THEY HAVE COMPLAINTS ABOUT THE HEADLIGHTS ALL THE TIME. BOUGHT AS RETIREMENT VEHICLE COSTING $30,000.00 & CANT SEE TO DRIVE. I DO NOT KNOW WHAT MY RECOURSE IS.  PLEASE HELP ME IF YOU CAN BEFORE MAJOR MISHAP!  THANKS",
        "vin": "JTMRFREVXGJ"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10872409,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. WHILE DRIVING APPROXIMATELY 30 MPH, ANOTHER VEHICLE CRASHED INTO THE FRONT DRIVER SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE DRIVER AND PASSENGER SUSTAINED MULTIPLE INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A DEALER, BUT WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "JTMWFREV6GD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863917,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS CAR SINCE JANUARY 2016. RECENTLY, I HEARD A NOISE AS I APPLY A BRAKE. I WENT TO THE DEALER TO EXAMINE THE ISSUE. HOWEVER, I WAS TOLD THE BRAKES ARE DOING FINE. BUT THE NOISE HAS BECOME EVEN LOUDER. I ASKED ONE OF MY FRIENDS WHO BOUGHT THE SAME CAR AS MINE, A COUPLE MONTH BEFORE ME. HE TOLD ME HE IS EXPERIENCING THE SAME PROBLEM WITH HIS CAR TOO. ALSO, HE HAD ALSO ENCOUNTERED WITH AN EMPTY BRAKE FLUID TANKER AFTER HE SAW A BRAKE MALFUNCTION SIGNAL ON HIS DASHBOARD. FOLLOWING, MY FRIEND AND I STARTED TO SHOP AROUND OTHER FRIENDS WHO HAVE THE SAME CAR WITH MODEL YEAR 2014-2016. FIVE OUT OF THE SEVEN DRIVERS WE QUESTIONED HAD TOLD US THAT THEY HAD ALREADY REPLACED THEIR BRAKES AT LEAST ONCE BEFORE THEY EVEN DRIVE THEIR CARS[TOYOTA RAV4 2014-2015] FOR A YEAR/<10,000. I THINK CONSUMERS NEED TO BE AWARE OF THESE SITUATIONS BEFORE DECIDING TO BUY THESE PRODUCTS ESPECIALLY AS BRAKES NEED TO MEET THE HIGHEST SAFETY STANDARDS.",
        "vin": "2T3BFREV2GW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/01/2016",
        "dateOfIncident": "04/27/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862372,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CITING A SAFETY DEFICIENCY ON 2016 TOYOTA RAV 4 HYBRID LTD, SOLD TO ME BY GREENTREE TOYOTA, DANBURY CT, ON APRIL 27, 2016.     IT IS A REFLECTIVE AREA ATTACHED TO THE DASHBOARD, WHICH CAUSES A GLARE INTO THE DRIVER'S EYES WHEN THE VEHICLE DASHBOARD CATCHES THE SUN.    THIS UNNECESSARY AND DANGEROUS GLARE IS MORE THAN AN ANNOYANCE BECAUSE IT REDUCES THE DRIVER'S ABILITY TO SEE WHEN THE GLARE OCCURS.   I THEREFORE REQUEST AND DEMAND THAT IT BE CORRECTED ON MY VEHICLE PROMPTLY.  TOYOTA DRIVERS WHO ARE AFFECTED BY THE REFLECTIVE SURFACE GLARE POSE A THREAT TO ALL VEHICLES ON THE ROAD.  IT MUST BE DELETED FROM FURTHER PRODUCTION AS WELL.     IF MY VEHICLE IS NOT PROMPTLY CORRECTED BY MAY 15, 2016, I SHALL SEEK TO HAVE IT DONE EXPERTLY AT MY EXPENSE AND BILL ALL   THOSE RESPONSIBLE FOR SELLING ME THE VEHICLE.",
        "vin": "JTMDJREV3GD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2016",
        "dateOfIncident": "04/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860191,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF EXPLODED WHILE DRIVING DOWN THE HIGHWAY.  NO ROCK WAS SEEN BEFORE IT HAPPENED AND THE GLASS WAS CURVED OUTWARD WHEN WE STOPPED TO LOOK AT IT.  FORTUNATELY, THE VISOR/COVER WAS BELOW IT SO THE GLASS SHARDS DID NOT SPRAY INTO OUR FACES.  IT SOUNDED LIKE A BOMB WENT OFF.  THIS IS EXTREMELY DANGEROUS AND WE HAVE NO OPTION BUT TO HAVE THE SUNROOF REPLACED.  IT WOULD BE WISE TO ALWAYS DRIVE WITH THE SUNROOF COVER OVER THE GLASS TO PROTECT YOURSELF.",
        "vin": "JTMRJREV9GD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/15/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855713,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  2016 RAV4 LE COMES WITH A  SIDE VIEW MIRROR THAT HAS A BUILT IN NON-ADJUSTABLE BLIND SPOT MIRROR. THIS BLIND SPOT MIRROR DOES NOT SHOW THE BLIND SPOT AREA. IT SHOWS AN AREA TWO LANES AWAY FROM THE VEHICLE.  PAGE 154 OF THE  RAV4 OWNERS MANUAL ERRONEOUSLY INDICATES THIS ADDITIONAL MIRROR IS A BLIND SPOT MIRROR AND HAS A DIAGRAM ERRONEOUSLY SHOWING HOW IT FUNCTIONS.THE BLIND SPOT MIRROR IS MISLEADING AND DANGEROUS. I DISCUSSED THIS WITH THE TOYOTA DEALERSHIP AND THEY SAID I NEEDED TO GET APPROVAL FROM THE TOYOTA CORP. TO REPLACE THE GLASS MIRROR INSERT. TOYOTA CORP REFUSED MY REQUEST AND TOLD ME TO FILE A COMPLAINT WITH NHTSA.   ATTACHED IS A SEQUENCE OF THREE PICTURES SHOWING HOW THE BLIND SPOT MIRROR DOESN'T SHOW AN APPROACHING  VEHICLE UNTIL IT IS TOO LATE. THIS IS PARTICULARLY CONFUSING AND DANGEROUS AT NIGHT. YOU GET TO SEE HEADLIGHTS FROM TWO LANES OVER AND NOT THE HEADLIGHTS ACTUALLY APPROACHING YOU. A TOYOTA PERSON TOLD ME I SHOULD HAVE BOUGHT THE $8000 MORE  EXPENSIVE 2016 RAV4 WHICH IS THE ONLY WAY TO GET THE SIDE VIEW MIRRORS WITH SENSORS. THIS IS A BAD WAY TO MAKE MONEY. ALL I WANT IS FOR TOYOTA TO AUTHORIZE THE USE OF THE INTERCHANGEABLE GLASS MIRROR INSERTS USED ON PREVIOUS YEAR RAV4 VEHICLES AND  TO STOP INSTALLING THE DANGEROUS SIDE VIEW MIRRORS WITH  BUILT IN NON-ADJUSTABLE  BLIND SPOT  MIRRORS. THE VISION IS POOR ON THE RAV4 AND TOYOTA SHOULD HAVE REASONABLY PRICED THE SENSORS AND VISION ITEMS FOR ALL MODELS INSTEAD OF ONLY MAKING THESE SAFETY ITEMS AVAILABLE ON VEHICLES LOADED WITH HIGH PRICE FEATURES. TOYOTA NEEDS TO PUT SAFETY FIRST. I HAVE HIGH REGARD FOR TOYOTA AND PREVIOUSLY PURCHASED THREE TOYOTA VEHICLES THAT WERE EXTREMELY GOOD AND LASTED A LONG TIME. THEY ALL HAD GREAT VISIBILITY. THE RAV4 COULD HAVE AND SHOULD HAVE BEEN DESIGNED WITH MUCH BETTER VISION.",
        "vin": "JTMZFREV8GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855336,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE TOYOTA RAV 4 HYBRID, THE \"POWER\" (IGNITION\" BUTTON IS ABOUT 2.25\" FROM THE AC BUTTON. (SEE ATTACHED PHOTO). WHEN YOU ARE DRIVING LESS THAN 10 MPH YOU CAN PUSH THE BUTTON AND THE ENGINE WILL TURN OFF, STEERING WHEEL LOCK UP, AND THE CAR KEEPS ROLLING. THIS HAPPENED TO ME. I WAS STOPPED AT A LIGHT, AS THE LIGHT TURNED GREEN, I WANTED TO TURN OFF THE AC, AND I ACCIDENTALLY PUSHED THE WRONG BUTTON (BECAUSE THEY WERE CLOSE TOGETHER), AND THE WHOLE ENGINE TURNED OFF, WHILE I WAS IN THE INTERSECTION. LUCKILY, THE STREETS WERE EMPTY SO NOTHING HAPPENED. THIS WOULD NOT BE AS MUCH OF AN ISSUE IF THE TWO BUTTONS WERE NOT CLOSE TOGETHER, BUT SINCE THEY ARE SO CLOSE TOGETHER, THE IGNITION BUTTON SHOULD NOT TURN OFF SO EASILY, TURNING OFF WITH A PUSH WITHOUT A FOOT ON THE BRAKE PEDAL, IN DRIVE  AND WITHOUT THE PARKING BRAKE ON. I TESTED IT OUT WHILE IN REVERSE AND BACKING OUT OF MY PARKING SPACE AT WORK, AND THE ENGINE TURNED OFF AND THE CAR KEPT GOING. IT DOES NOT HAPPEN AT HIGHER SPEEDS, BUT I THINK IT IS STILL DANGEROUS.  I CONTACTED TOYOTA ABOUT THIS, BUT THEY SAID THAT THIS IS THE WAY IT WAS DESIGNED. THEY CLAIM, \"IF YOU HOLD THE POWER BUTTON FOR A NUMBER OF SECONDS WHILE DRIVING IT WILL TURN THE VEHICLE OFF. THIS TECHNIQUE MAY SLOW DOWN THE VEHICLE AS A VERY LAST RESORT IN AN EMERGENCY SITUATION IF ALL OTHER EFFORTS TO STOP THE VEHICLE FAIL.\" THE ONLY PROBLEM IS THAT I DID NOT HAVE TO HOLD THE BUTTON DOWN FOR A FEW SECONDS, AND IT TURNED OFF. I MERELY PUSHED IT, AS I WOULD TO TURN OFF THE AC, AND THE ENGINE SHUT DOWN. MAYBE AT HIGHER SPEEDS YOU NEED TO HOLD IT DOWN FOR A WHILE, BUT AT LOW SPEEDS A LIGHT PUSH CAN SHUT THE ENGINE DOWN.",
        "vin": "JTMDJREV3GD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2016",
        "dateOfIncident": "04/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854672,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LANE DEPARTURE SYSTEM SHOWS AS \"OFF\" IN THE STATUS SCREEN HOWEVER IT IS TURNED \"ON\" IN THE MENU.  IT HAS BEEN ON SINCE I BOUGHT IT AND RESPONSIVE, SO I KNOW HOW IT WORKS.  \\    HOWEVER, SINCE YESTERDAY, WHEN IT SNOWED, I RECEIVED AN ERROR ABOUT PARKING ASSIST NOT WORKING - IT WAS ASSUMED THIS HAPPENED WHEN SNOW BUILT UP ON THE SENSORS, AND AT ONE POINT IT ACTUALLY SAID THAT, WHEN I PUT VEHICLE IN REVERSE AND IT SAW SNOWFLAKES.  THAT PROBLEM CLEARED, AND THAT WAS THAT.      BUT OUT OF THE BLUE, THE LDA SAYS OFF, EVEN THOUGH TURNED ON, AND DID NOTHING TO MAKE THAT HAPPEN.  WEIRD, I ONLY KNEW THIS AS I WAS PAGING THROUGH THE SCREEN CHOICES IN THE SMALL SCREEN BETWEEN SPEEDO AND QUASI-TACH, SEEING IT WAS \"OFF\" EVEN THOUGH IT WAS TUREND ON...NO WARNING IT WASN'T WORKING.  AND I KNOW IT ISN'T WORKING AS I TRIED TO CROSS THE LANE MARKING AND NOTHING HAPPENED.",
        "vin": "JTMRJREV7GD"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA RAV4. THE VEHICLE ACCELERATED FORWARD WHILE THE CONTACT'S FATHER WAS GENTLY DEPRESSING THE BRAKE PEDAL. THE CONTACT'S FATHER DEPRESSED THE BRAKE PEDAL ALL THE WAY DOWN, BUT THE VEHICLE CONTINUED TO ACCELERATE AND STRUCK A GATE. THE CONTACT STATED THAT HER FATHER HAD TO REMOVE THE KEY FROM THE IGNITION IN ORDER TO STOP THE VEHICLE. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER AND DIAGNOSED, BUT NO FAILURE WAS DETECTED. THE FRONT BUMPER WAS DAMAGED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 3,500.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/26/2016",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851724,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED THE BRANDNEW 2016 RAV4 XLE PULLS TO THE RIGHT STRONGLY AFTER 3 DAYS OWNING THE CAR WITH 200 MILES. WENT TO THE DEALER TWICE AND DID 2 ALIGNMENTS AND CROSS TIRE ROTATION. THE SERVICE ADMITS THE PULLS AND CLAIM THEY FIXED IT THE 1ST TIME. HOWEVER ACTUALLY NOTHING IS CHANGED.  STILL PULLS TO THE RIGHT, NOT ANY BETTER. COME BACK AGAIN AND THE SAME TECHNICIAN TRIED TO ALIGN AND ROTATE AGAIN. WE TESTED DRIVE AND STILL FOUND IT.  THE DEALER'S LEAD TECHNICIAN MENTIONED HE DID EVERYTHING HE CAN BUT STILL CANNOT FIX IT. HE OPENED A CASE TO TOYOTA CORP TO INVESTIGATE.    ME AND THE TECHNICIAN TOGETHER DROVE ANOTHER IDENTICAL NEW RAV4 (WITH SAME MSRP) AND BOTH OF US DO NOT FIND THE PULLS ON THIS ONE. SO THE PROBLEM IS JUST WITH THE ONE I PURCHASED. THIS ADDS A LOT OF STRESS AND DISTRACTION AS IT NEEDS CONSTANT ADJUSTING THE STEERING WHEEL.  IT IS A SAFETY ISSUE DUE TO THE EXTRA DISTRACTION.     IT IS NOT A NORMAL PULL. IT PULLS HEAVILY AND EVEN TURNING THE STEERING WHEEL A LITTLE BIT LEFT, WITHIN 3 SECONDS THE CAR WILL GO TO THE RIGHT ON EVERY LANE OF ALL TYPES OF ROAD, CONSISTANTLY.    I OWNED SEVERAL OTHER TOYOTA (SOME ARE 1 YEAR NEW) AND NONE OF THEM HAS THIS ISSUE. (THIS IS AFTER ALL REALIGNMENT!!!)  VERY DISAPPOINTED WITH THIS BRAND NEW CAR AND INTRODUCES A LOT OF HASSLES AFTER SPENDING 27K ON IT!!!    BECAUSE TIRE/ALIGNMENT ARE NOT THE ISSUES  I EXPECT SOME DEFECTIVE PARTS, HOWEVER THE DEALER SAY THEY CANNOT FIX IT...",
        "vin": "JTMWFREV5GJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/24/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4 HV",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FULL SUN CONDITIONS,  INFORMATION SCREEN IS WASHED-OUT. TRIED CONTRAST ADJUSTMENT WITH NO SUCCESS. FRONT - SIDE WINDOWS ARE TINTED AS ALLOWED BY ARIZONA VEHICLE CODE.",
        "vin": "JTMDJREV6GD"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/04/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824253,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS 4 DAYS OLD.  I WAS DRIVING IN THE POURING RAIN, ON A HIGHWAY GOING 55-60MPH, WITH NO OTHER VEHICLES AHEAD OF ME OR ON THE SIDE OF ME.  MY SUNROOF SPONTANEOUSLY EXPLODED!  THE SUNROOF WAS IN THE CLOSED POSITION AT THE TIME BUT THE CLOTH COVER WAS OPEN.  LUCKILY IT EXPLODED OUTWARD BUT SOME TINY SLIVERS  OF GLASS DID COVER THE INSIDE.",
        "vin": "2T3RFREV6GW"
    }
]