[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "04/03/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459519,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "After driving in highway about 1 hour,   The driver side door HALF OPENED BY ITSELF. Car has ~60K miles, this incident is happening for the first time.  Before driving door was closed as usual.  The car speed was  ~ 77 mph during the incident, It was windy day, road quality was ideal.",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/21/2022",
        "dateOfIncident": "01/14/2022",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11448301,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "On 01/14/2022, I was in a car accident. I hit a Mitsubishi Outlander Sport head on at 45 mph and my airbags didn’t deploy nor did my seatbelts lock. My car is available for inspection at Classic Collision of Augusta body repair shop.  Since my airbags did not deploy and my seatbelt did not lock, I made contact with my steering wheel and my right hand made contact with the dash. My passenger’s airbags did not deploy nor did their seatbelt lock. They made contact with the window, door, and dash of my car. We sustained injuries from the accident.   Unknown if problem has been reproduced or confirmed by dealer or service center. Vehicle has been inspected by my auto insurance and the body repair shop, but unknown results. Unknown if any other entities have inspected the vehicle.  Yes, a maintenance required message was present for a oil change required. Message appeared when mileage hit 48479 due for oil change per the mileage on the sticker on my windshield.",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I was hit by a car that ran a red light going around 45mph. The front passenger side was hit, we were hit hard.  No airbags deployed.  Other cars airbags did deploy.",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "07/17/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11440718,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I hit a deer that caused all of the airbags to go off. A specific airbag under the steering wheel, a knee bag, caused severe bruising and soft tissue to my calf’s, crippling me for nearly a week. At one point I visited my doctor who confirmed the damage, did a test for roving blood clots, and sent me home to continue to recover. It’s been just over 5 months and I still have visible damage. I would have suffered no injuries if that ‘knee-curtain’ hadn’t been there or if it had not acted like a brick slamming into my legs. I’m concerned for others who may suffer similar unnecessary injuries because of this device.",
        "vin": "4T1BD1FK3Gu"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438356,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Toyota Camry. The contact stated that while driving approximately 65 MPH, the glass sunroof suddenly exploded causing glass pieces to enter the cabin of the vehicle. No injuries were reported. The cause of the failure was not yet determined. The local dealer and manufacturer were not notified of the failure. The failure mileage was 127,000.",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/01/2021",
        "dateOfIncident": "08/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431338,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "When accelerating from a stop, the engine revs but very little power and forward motion, then suddenly, the vehicle lurches as though it has gone from neutral to first gear. The danger here is that I am dangerously crawling through the intersection. In addition, while driving around 30 mph, the vehicle will also suddenly lose power as though it shifts from drive to neutral. This problem is being reported to other websites by other people, see carcomplaints.com and repairpal.com",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424336,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 Toyota Camry. The contact stated that while the vehicle was in for routine maintenance, it was discovered that the radiator was leaking antifreeze and needed to be replaced. The vehicle was taken to an independent mechanic who confirmed the failure was present and replaced the radiator. The cause of the failure was not determined. In addition, a message indicating that cylinder number two had misfired was displayed. The manufacturer was not notified of the failure. The failure mileage was 70,000.",
        "vin": "4T4BF1FKXGR"
    },
    {
        "components": "SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/20/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414390,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST ISSUE, (MINOR) DRIVER SIDE REAR SEATBELT DOES NOT RECOIL CORRECTLY. MUST BE MANUALLY FED IN ORDER TO RESET FOR NEXT USE.  SECOND ISSUE, HOOD LATCH DOES NOT RELEASE AS IT IS SUPPOSED TO. YOU MUST HAVE A LONG FLAT HEAD SCREWDRIVER AND MANUALLY LIFT THE HOOK FROM THE HOOD IN ORDER TO RAISE HOOD. APPEARS TO BE A WEAK SPRING ON THE LEVER.  NOT SURE WHAT ABOUT THIS CAR MAKES IT EAT TIRES BUT I BOUGHT IT BRAND NEW (12 MILES) AND NOW HAVE 98,000 AND I AM GOONG THROUGH TIRES APPROXIMATELY EVERY 10,000 MILES REGARDLESS OF BRAND OR WARRANTY. HAVE HAD THE VEHICLE ALIGNED MULTIPLE TIMES BY MULTIPLE COMPANIES AND STILL NO WEAR PATTERN ON TIRES JUST WORN COMPLETELY SMOOTH. I PURCHASED THIS VEHICLE WITH THE THOUGHT OF PUTTING MY SON IN IT IT TRAVEL TO COLLEGE AND BACK BUT I WILL GET RID OF THE VEHICLE BEFORE I PUT MY CHILD IN IT FULL TIME. HE DOESN'T NEED THE HEADACHE OF CHECKING TIRES AND REPLACING THEM EVERY COUPLE OF MONTHS. THERE IS NO TIRE SPECIALIST WITH ANY IDEA WHY THE TIRES WOULD BE WEARING THIS BAD ON THIS VEHICLE. MAKES ME WONDER IF OTHER CONSUMERS ARE HAVING TO REPLACE THEIRS AS OFTEN AS I DO.  I DO LIVE IN A RURAL AREA BUT ON A PAVED ROAD AND MOST OF MY TRAVEL IS VIA HIGHWAY. DATE PROVIDED IS DATE OF LAST TIRE ROTATION AND REPLACEMENT.",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/14/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414162,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS KEEP GOING OFF AND ON, L DON'T DRIVE AT NIGHT MOSTLY TILL RECENTLY, L TOOK IT TO TOYOTA DEALER. THEY GAVE ME ESTIMATE ABOUT $600.00 TO FIT IT .CLAIMING, I NEEDS REPLACING HEADLIGHT STALK/SWITCH(FOUND HEADLIGHT STOCK/SWITCH OPEN CIRCUT). THE MILEAGE ON MY CAR JUST 21,103. ALSO, THIS MY 3RD TOYOTA, AND USED THEM MORE THAN TEN YEARS WITH THIS PROBLEM, THIS MUST BE MANUFACTURAL DEFAULT, AND FIND OUT THAT, SOME ARE RE-CALL FOR SOME CAMRY 2016. PLEASE. SOMETHING SHOULD BE DONE ABOUT THIS",
        "vin": "4T1BF1FK6GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407200,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SITTING ALMOST ALL WINTER, I WENT TO DRIVE THE CAR THREE BLOCKS AWAY. I NOTICED THAT THE STEERING WHEEL HAD TOO MUCH PLAY IN IT. WE CALLED THE DEALER AND WAS TOLD IS A TYPICAL PROBLEM ON THE CAMRY, SO WHY ISNT THERE A RECALL ON IT. MY CAR ONLY HAS 25,543 MILES ON IT, ITS HARDLY CONSIDERED OLD. ON A PAVED ROAD.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404450,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PANEL THAT CONTROLS THE POWER SEATS BROKE WHEN THE PLASTIC MADE CONTACT WITH THE FRONT OF THE SEAT RAIL WHILE ADJUSTING THE SEAT BACKWARDS FROM THE MOST FORWARD POSITION WHILE THE CAR WAS STOPPED. WHEN DRIVING, THE PANEL THAT BROKE AT THE FRONT ALLOWED THE SEAT TO ENGAGE MOVEMENT WITHOUT DRIVER KNOWLEDGE AND CAUSING DISTRACTION WHILE DRIVING. DRIVER PUT DUCT TAPE ON FRONT OF PANEL SO IT WOULD NOT SELF ENGAGE WHILE DRIVING. TOYOTA DEALER ADVISES THIS HAPPENS QUITE FREQUENTLY AND THERE SHOULD BE A TSB ON IT BUT THERE IS NOT. SAYS REPAIR IS $400. SOUNDS LIKE A DEFECT IN DESIGN SINCE I HAVE ONLINE RECORD OF OVER 100 CARS BEING AFFECTED.",
        "vin": "4T1BD1FK9GU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399706,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLIZZARD PEARL PAINT IS PEELING AROUND THE REAR WINDSHIELD AND ALONG THE SIDES OF THE FRONT WINDSHIELD.",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398933,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. THE CONTACT STATED WHILE THE VEHICLE WAS STOPPED, A STRING GOT CAUGHT INTO THE ELECTRICAL MECHANISM IN THE STEERING WHEEL. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO TOYOTA OF LOUISVILLE (6514 DIXIE HWY LOUISVILLE, KY 40258) WHERE IT WAS DIAGNOSED WITH THE SPIRAL CABLE NEEDING TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VEHICLE HAD TO BE PAID FOR OUT OF POCKET. THE FAILURE MILEAGE WAS APPROXIMATELY 50,197.",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2021",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390915,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA CAMRY MAKES A SCARY NOISE THAT APPEARS TO BE BEHIND THE DASHBOARD RIGHT BEHIND THE AIR CONDITIONER. IT COMES ON AND OFF. IN ADDITION, IN 2018 THE NOISE WAS ACCOMPANIED BY THE WHOLE DASHBOARD SIGNS RED WITH A STRONG NOISE THAT APPEARS SOMETHING BROKE INSIDE. THEN, I IMMEDIATELY STOPPED AND CALL TOYOTA AND THEY ASK ME TO TAKE IT TO A DEALERSHIP BUT DIDN'T OFFER TOWING. THAT DAY, I DROVE TO WORK AND ALL APPEARED NORMAL. THE NOISE COMES ONCES IN A WHILE AND GO AWAY. I AM NOT SURE HOW SERIOUS THIS THING IS AND WHAT TO DO NEXT.      THANK YOU FOR YOUR HELO ON THIS.    SOLOMON",
        "vin": "4T4BF1FK2GR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/13/2020",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383238,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2016 CAMRY  IN MAY 2016, BUT I WAS UNAWARE OF THE ISSUE WITH THIS PARTICULAR VEHICLE. WHENEVER THE VEHICLE IS ON AN UNEVEN SURFACE BETWEEN AXLES, IT PRODUCES A KNOCKING, POPPING, TICKING, OR SNAPPING NOISE FROM GOD KNOWS WHERE! I HAVE SPENT HOURS (FROM WORK WITH NO PAY) AT THE DEARERSHIP AND A TON OF MONIES TO GET NO SATISFACTION.  I AM SUFFERING FROM PTSD AND THE NOISE & POPPING SOUNDS MAKES ME WANT TO JUMP OUT OF MY SKIN.  MANY TIMES I THOUGHT I HAD RAN OVER AN ANIMAL, HIT ANOTHER VEHICLE WHEN BACKING UP AND THESE ISSUES HAS CAUSE ME TO SWERVE INTO ONCOMING TRAFFIC, HIT STREET SIGNS & ON MANY OCCASIONS UNABLE TO PERFORM MY DUTIES AT WORK.",
        "vin": "4T1BK1FK2GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/08/2020",
        "dateOfIncident": "12/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS HIT AT 55MPH BY AN ELK, SIDE CURTAIN DID NOT DEPLOY.",
        "vin": "4T1BF1FK8GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378174,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLOSION:  MY PARTNER AND I WERE DRIVING ON THE FREEWAY WHEN WE HEARD A VERY LOUD, FRIGHTENING EXPLOSION ABOVE AND SLIGHTLY BEHIND FRONT DRIVER/PASSENGER SEATS. THERE WASN'T ANY VISIBLE SIGN OF BROKEN WINDOWS, BODY DAMAGE OR A WOBBLY TIRE TO INDICATE THE CAUSE.  WE WERE TRAVELING IN THE MIDDLE LANE OF THE FREEWAY AT APPROXIMATELY 70 MPH WITH NO OTHER VEHICLES IN FRONT OF, NEXT TO OR BEHIND US.  WE COULD NOT SEE ANYTHING ON THE ROAD IN FRONT OF, NEXT TO OR BEHIND THE CAR TO HAVE CAUSED DAMAGE TO THE CAR.  NOR, WAS THERE ANYTHING OR ANYONE ON EITHER SIDE OF THE FREEWAY IN OPEN GRASSY AREAS.  THERE WAS NO OVERPASS BEHIND OR ABOVE US TO ACCOUNT FOR THIS LOUD, SCARY NOISE.  WE PULLED OFF AT THE NEXT EXIT TO EXAMINE THE CAR.  WE DIDN'T FIND ANY DAMAGE TO THE BODY OF THE CAR OR THE TIRES, BUT WHEN WE CLOSED THE DOOR, WE COULD HEAR THE SOUND OF BROKEN GLASS ABOVE US FROM THE AREA OF THE SUNROOF. THERE WAS A VERY LARGE RECTANGULAR AREA IN THE CENTER OF THE SUNROOF THAT WAS MISSING.  THE SURROUNDING GLASS WAS COMPLETELY SHATTERED.  LATER WE COULD HEAR THE LARGE SECTION OF GLASS SLIDING BACK AND FORTH INSIDE ABOVE THE SHADE COVER WHEN WE CAME TO A STOP OR STARTED UP AFTER HAVING STOPPED.",
        "vin": "4T1BD1FK9GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375782,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WILL NOT START",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375313,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACCELERATOR IS ERRATIC. WE TURNING A CORNER AND ACCELERATING, AT FIRST NOTHING HAPPENS, THEN ALL OF A SUDDEN THE CAR ACCELERATE RAPIDLY.  ANOTHER PROBLEM IS THE ACCELERATOR WILL HESITATE FOR A FULL SECOND OR MORE WHEN YOU PRESS THE PEDAL DOWN HARD TO ACCELERATE INTO TRAFFIC. THIS IS A NEW USED. CAR I RECENTLY PURCHASE FROM TOYOTA AND THEY REFUSE TO LOOK AT THE CAR UNLESS I PAY A $140 DIAGNOSTIC FEE.",
        "vin": "4T1BD1FK2GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362687,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C AND HEAT BLOWER NOT WORKING AT ALL. NOTHING COMES OUT OF ANY KIND. I HAVE ONLY HAD THIS CAR FOR 4 YEARS BOUGHT BRAND NEW OFF THE LOT AND MY SISTER WHO BOUGHT THE SAME EXACT CAR AT THE SAME TIME IS CURRENTLY HAVING THE SAME ISSUE. WE LIVE IN 110 DEGREE WEATHER IN THE SUMMER AND 20 DEGREE WEATHER IN THE WINTER, THIS IS NEEDED AND DOESN'T MAKE SENSE HOW OUR 4 YEAR OLD CARS ARE HAVING THESE ISSUES.",
        "vin": "4T1BF1FK8GU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/24/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOT RECEIVED ANY RECALL FROM ANY ONE. MY VIN # SAID RECALLS X3 BUT WHAT ARE THE RECALLS????? COULD SOME ONE TELL ME IF THIS IS LIFE THREATING.",
        "vin": "4T4BF1FK1GR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352273,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SMILE REAR DOOR WINDOW SHATTERED WHILE PARKED  IN DRIVEWAY. NO KNOWN REASON, NO INDICATION OF IMPACT UNIFORM SHATTERING.",
        "vin": "4T1BF1FK6GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2020",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349563,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEEDOMETER AND ODOMETER ON THE CAMRY ARE GROSSLY INACCURATE. DURING A RECENT ROAD TRIP UPON A ODOMETER SPEEDOMETER CHECKPOINT USED BY INTERSTATE TRUCK DRIVERS OF WHICH I AM ONE THE VEHICLE REVEALED THAT IT CALIBRATES ONE MILE AT 4900 FEET. TOYOTA WAS NOTIFIED ABOUT THIS ON THREE SEPARATE SERVICE OCCASIONS AND THEY HAVE FAILED TO CORRECT THIS DEFICIENCY. AS IT TURNS OUT THE TOYOTA CAMRY IS THE MOST RENTED MID-SIZED CAR IN NORTH AMERICA WHICH MEANS THAT THERE IS CONSIDERABLE OVERCHARGING OF MILES. THIS DEFICIENCY ALSO CAUSES SIGNIFICANT OVERCHARGING OF INSURANCE RATES AND PREMATURE WEAR OF PRIVATELY OWNED VEHICLES. THE SPEEDOMETER HAS BEEN CROSS CHECKED AGAINST GPS AND TOMTOM NAVIGATION SYSTEMS AND REVEALED ITSELF TO BE AT LEAST 16 MILES PER HOUR OFF AT HIGHWAY SPEED ON FIVE SEPARATE OCCASIONS.. THE CARS OVER REPORTING OF SPEED,  AND MILAGE INDICATES FALSE EPA MILAGE ESTIMATES. TOYOTA HAS NOT DISCOVERED ACCESS IN REPAIRING THIS ERROR.",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342673,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ANY GIVEN TIME, WHILE DRIVING SLOW OR STOPPED, I WILL PUSH ON THE GAS PEDAL AND A 1 0R 2 SECOND LAPSE WILL OCCUR BEFORE MY CAR MOVES FORWARD. THIS HAS ALMOST CAUSED ME TO HIT MY ANOTHER CAR!!!!!!",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342294,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT CONCERNS STEERING ISSUES RELATED TO A BAD CELL IN BATTERY. FOR THE PAST YEAR THE CAR HAS RANDOMLY PULLED RIGHT AND LEFT AND VEERED WHILE ON THE HIGHWAY. PULLING WAS MOST PRONOUNCED WHEN ACCELERATING AND STOPPING. THE PULLING COULD BE EXTREME AT TIMES ESPECIALLY THEN TURNING, THE CAR WOULD PULL THE OTHER WAY.  THE ISSUE WAS ERRATIC AND COULD NOT BE REPLICATED FOR THE CAR REPAIR SHOP. I HAD THE TIRES ROTATED TWICE AND AN ALIGNMENT WHICH DID NOT SOLVE THE ISSUE. LOCAL DEALERSHIP WAS NOT HELPFUL. CAME ACROSS INTERNET CAR BLOG THAT LINKED FAULTY BATTERY TO UNSAFE STEERING FOR CAMRY'S THEN FOUND MULTIPLE REFERENCES FOR THIS ISSUE ONLINE.  CHANGED OUT THE BATTERY AND THE STEERING ISSUE IS RESOLVED.",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338330,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWER STEERING WHEEL  IS MAKING LOUD NOISES WHEN MAKING TURNS WHILE DRIVING AND WHILE ON STANDBY SUCH AS ON THE DRIVEWAY AT HOME. THIS MAKE, MODEL, AND YEAR INDICATES THAT THE TOYOTA CAMRY 2016 HAS AN ELECTRIC POWER STEERING MEANING IT DOES NOT RUN OF STEERING FLUID. I DO NOT KNOW WHAT CAUSED THIS ISSUE BUT IT STARTED  HAPPENING AFTER THE 4TH OF JULY 2020. MY CAR IS SALVAGED BUT IT WAS ONLY SLIGHTLY REAR ENDED ON THE LEFT SIDE, ONLY EXTERNAL DAMAGE AND NO INTERNAL DAMAGE. THE MILES ON THE VEHICLE IS 62,000. I'VE READ ONLINE THAT THIS IS AN OCCURRING ISSUE WITH ALL TOYOTA CAMRYS WITH ELECTRICAL STEERING. THE VEHICLE IS USED TO DRIVE TO GROCERY STORES, WORK, COLLEGE, AND ROAD TRIPS. ALIGNMENT AND ROTATION IS DONE ROUTINELY AND THE TIRES HAVE BEEN RECENTLY CHANGED. I DON'T NOT SPEED ON MY TURNS AND I DON'T PUT ANY PRESSURE ON MY STEERING WHEEL WHEN TURNING. I CURRENTLY DON'T KNOW WHY IT'S MAKING SOUND WHEN TURNING THE STEERING WHEEL BUT I HOPE IT ISN'T AN ISSUE THAT WILL CAUSE AN ACCIDENT IN THE FUTURE.",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11338090,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE DRIVING TO FAMILY REUNION, RURAL ROAD, SHE PASSED OUT, MISSED TURN IN ROAD. CAR WENT OF ROAD AND HIT A DITCH. CAR ROLLED SEVERAL TIMES. WIFE'S NECK BROKEN (SHE LIVED) ADMITTED TO HOSPITAL. REMAINED IN HOSPITAL FOR ABOUT 3 WEEKS THEN PHYSICAL THERAPY FOR MONTHS. NEVER RECEIVED RECALL NOTICE. ALL AIR BAGS OPENED EXCEPT THE DRIVERS SIDE",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329590,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE JERKED WITH AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE CONTACT STATED THAT THE ABS AND TRACTION CONTROL WARNING LIGHTS WERE ILLUMINATED. ADDITIONALLY, WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO LOYALTY TOYOTA (2000 WALTHALL CENTER DR, CHESTER, VA 23831) AND DIAGNOSED WITH A DEFECTIVE BRAKE ASSEMBLY. THE CONTACT REPLACED THE ABS SYSTEM, THE BRAKE PADS, THE ROTORS AND FOUR TIRES WERE REPLACED HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE SEVERAL UNKNOWN REPAIRS WERE PERFORMED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 157,703.",
        "vin": "4T4BF1FK3GR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/08/2020",
        "dateOfIncident": "06/07/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327717,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK OPENS BY ITSELF. THEN, TRUNK LATCH DOES NOT CLOSE ANYMORE.  *TR",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/28/2020",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322513,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS RUST IN MY VEHICLES BODY AND THE CHASSIS IS BENT OUT OF SHAPE IN THE FRONT. I DIDNT REALIZE UNTIL I TOOK IT TO THE BODY SHOP. ALSO THE AC SYSTEM WILL NOT WORK NO ONE KNOWS HOW TO FIX IT I SPENT OVER $3000 TRYING TO FIX IT AT THE DEALERSHIP.",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2020",
        "dateOfIncident": "03/16/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318484,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUDDENLY PULLED TO RIGHT, WOULDN'T HOLD CENTER.  REALLY FELT IT DRIVING IN TOWN.  STEERING FELT LIKE SOMEONE WAS GRABBING AND RELEASING THE STEERING WHEEL.  READ ON A FORUM THAT IT COULD BE THE BATTERY.  REPLACED BATTERY (WHICH STARTED THE CAR JUST FINE) ... AND IT DOES SEEM TO HAVE SOLVED THE PROBLEM.  THIS SUDDEN LOSS OF STEERING CONTROL IS GOING TO BE A PROBLEM AND THE AVERAGE PERSON WILL NOT REALIZE A WEAKENING BATTERY COULD BE THE ISSUE, RESULTING IN A RIP-OFF.  NOT NORMALLY A COMPLAINER, BUT THIS IS REALLY DANGEROUS!",
        "vin": "4T4BF1FK0GR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11316314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/23, I WAS INVOLVED IN A MVA. I WAS HIT BY ANOTHER VEHICLE TRAVELING FASTER THAN 65 MILES PER HOUR. MY AIR BAGS DID NOT DEPLOY FROM ANY AREA IN MY CAR. MY CAR WAS AT A COMPLETE STOP ON A CITY STREET WHEN I WAS HIT.",
        "vin": "4T1BF1FK8GU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/05/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315929,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*   THE CONTACT OWNS A 2016 TOYOTA CAMRY. THE CONTACT STATED THAT THERE WAS A SPRING PROTRUDING FROM THE REAR MIDDLE SEAT BELT. UPON REMOVING THE SPRING, THE SEAT BELT BECAME INOPERABLE. TOYOTA OF REDLANDS LOCATED AT (921 NEW YORK ST, REDLANDS, CA 92374) WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE REPAIR WOULD BE AN OUT OF POCKET EXPENSE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 106,000.  *BF*JB",
        "vin": "4T4BF1FKXGR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315938,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2016 CAMRY HYBRID XLE IN OCTOBER 2016, BUT I WAS UNAWARE OF THE ISSUE WITH THIS PARTICULAR VEHICLE. WHENEVER THE VEHICLE IS ON AN UNEVEN SURFACE BETWEEN AXLES, IT PRODUCES A KNOCKING, POPPING, TICKING, OR SNAPPING NOISE FROM THE MOON ROOF AREA WHILE DRIVING.   TOYOTA BUILT MANY DEFECTIVE VEHICLES WITH POOR SUNROOF FRAME INSTALLATION, AND THE CUSTOMER IS HAVING TO PAY THOUSANDS OF DOLLARS TO DRIVE A NEW SHITTY CAR THAT MAKES NOISES ALL THE TIME.  IT IS RATHER UNPLEASANT TO DRIVE A VEHICLE THAT YOU SHOULD BE PROUD OF, AND THE NHTSA SHOULD MAKE TOYOTA RECALL ALL THESE VEHICLES TO TEACH THE MANUFACTURER A LESSON.  I HAVE CONTACTED TOYOTA IN REGARDS TO THIS MATTER, AND SINCE MY VEHICLE WAS NOT UNDER WARRANTY, THEY SAID THAT IT WAS NOT THEIR PROBLEM.  THERE IS A REPAIR PROCEDURE INCLUDED IN TSB 0151-13 HAS BEEN DEVELOPED TO ADDRESS THIS CONDITION.  IT IS VERY UNFORTUNATE THAT THE CONSUMER HAS TO DEAL WITH CAR MANUFACTURER'S INADEQUACY, BECAUSE THEIR INSPECTION PROGRAM IS WORTHLESS.  ALL THAT I WANT IS TO GET MY VEHICLE FIXED FREE OF CHARGE, AND ENJOY A NICE RIDE.",
        "vin": "4T1BD1FKXGU"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309526,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT BELT GETS STUCK OCCASIONALLY, AND IT DOES NOT FULLY RETRACT.",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/16/2020",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309528,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ORIGINAL EXTERIOR PAINT IS PEELING OFF ON MY VEHICLE.  SMALL RUSTY SPOTS CAN BE SEEN ON THE BODY OF MY VEHICLE.",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "09/21/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302204,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN SLOW MOTION AS TRYING TO MOVE OVER FROM AN ENTRANCE LANE TO A TRAFFIC LANE THE CAR WILL STALL (BOGS DOWN) WHEN ACCELERATING THE GAS. THIS HAPPENS ALSO WHEN TRYING TO TURN FROM ALMOST A STOP TO ACCELERATING. THIS HAPPENS ON ALL TYPE STREETS AND HIGHWAYS. I HAVE ASKED THE DEALERSHIP ABOUT THIS AND THEY JUST SAY THAT THIS IS NORMAL. I BOUGHT THE VEHICLE IN LATE 2015 WHEN 2016 VEHICLES HAD ALREADY CAME OUT AND THIS PROBLEM HAS ALWAYS EXISTED AND HAPPENS EVERY DAY THAT IT IS DRIVEN. THIS PROBLEM IS DANGEROUS AND HAVE ARGUED THIS WITH DEALERSHIP TO NO AVAIL.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300345,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BEING DRIVEN DOWN THE ROAD (WITH THE DRIVER'S FOOT ON THE ACCELERATOR PEDAL) THE VEHICLE INTERMITTENTLY LOSES ACCELERATION (BEGINS TO DECELERATE) DESPITE CONTINUED PRESSURE ON THE ACCELERATOR PEDAL. THE DRIVER MUST RELEASE THEIR FOOT FROM THE PEDAL AND THEN PRESS IT AGAIN. THE CAR ACCELERATES (SOMETIMES WITH HESITANCY) AND SOMETIMES THE CAR WILL JERK AS THE ENGINE REVS. THIS HAS HAPPENED OVER 20 TIMES. NO WARNING LIGHTS HAVE DISPLAYED. I CHANGED THE ENGINE AIR FILTER (THOUGH IT WAS NOT YET DUE FOR ITS NEXT CHANGE) AND I CLEANED THE MASS AIR FLOW SENSOR WITH THE THE APPROPRIATE SPRAY. HOWEVER, THE PROBLEM CONTINUED (WITH 3 SEPARATE DRIVERS). IT WAS TAKEN TO A TOYOTA DEALERSHIP FOR A DIAGNOSTIC WORKUP. THEY COULDN'T  FIND ANYTHING WRONG WITH IT. THEY SUGGESTED CLEANING THE THROTTLE BODY AND ADDING A BOTTLE OF HEET TO THE GAS TANK. I ADDED ISO-HEET TO THE GAS TANK AND TOOK IT TO A PRIVATE MECHANIC WHO CLEANED THE THROTTLE BODY WITH THE APPROPRIATE CLEANER AND ADDED A BOTTLE OF SEAFOAM TO THE GAS TANK. NONE OF THESE RESOLVED THE PROBLEM. I TOOK IT BACK TO THE TOYOTA DEALERSHIP. THEY DID A TEST DRIVE AND OBD-II SCAN. AGAIN, NO CODES. THEY TOLD ME THERE WERE NO OTHER OPTIONS TO RESOLVE THE ISSUE. I AM AT A LOSS FOR WORDS. THIS IS A SAFETY HAZARD BECAUSE THIS HAPPENS WHILE ON THE EXPRESSWAY. WHEN THE CAR AUTOMATICALLY DECELERATES (GIVING NO WARNING TO THE DRIVER BEHIND ME, E.G. BRAKE LIGHT), THIS IS A REAR END ACCIDENT WAITING TO HAPPEN. VERY SCARY.",
        "vin": "4T1BF1FKXGU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2020",
        "dateOfIncident": "12/06/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297799,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SUDDENLY STOPS RUNNING WHILE DRIVING ENGINE SHUTS OFF. NEED TO PUT IT INTO PARK AND RESTART IT. IT HAS HAPPENED 4  DIFFERENT TIMES IN THE LAST 30 OR SO DAYS EVEN AFTER IT WAS IN THE DEALER TWICE.LAST TIME IT WAS REPAIRED IT DIED ON THE SERVICE MANAGER.  LUCKILY IT HAS HAPPENED WHEN DRIVING IN TOWN AND NOT ON THE HIGHWAY WHEN GOING 75 MILES AN HOUR.NOTE: THIS HAS HAPPENED ON 3 SEPARATE OCCASIONS BUT CAN ONLY PUT IN 1 DATE.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/28/2019",
        "dateOfIncident": "11/28/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282796,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR AND PUT IT IN REVERSE.  I HAD MY FOOT ON THE BRAKE AND PUT IT IN REVERSE.  THE CAR LURCHED VERY HARD BACKWARDS.  THE CAR HIT A POLE THAT HOLDS UP THE COVERED PARKING.  I HAD MY FOOT ON THE BRAKE HARD AND IT WAS STILL TRYING TO MOVE AND I PUT IT IN NEUTRAL AND IT REVVED A LOT.  THEN I TURNED IT OFF.    IT HAS DONE THIS A COUPLE OF TIMES BUT NOT TO THIS EXTENT.",
        "vin": "4T1BK1FK1GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280277,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON.  CODE STATED THAT THE GAS PEDAL THROTTLE WAS STUCK IN OPEN POSITION. MY CAR WAS NOT IDLING HIGH SO THAT HAD TO BE AN ERROR.  MECHANIC RESET THE CHECK ENGINE LIGHT 2 DAYS LATER LIGHT CAME BACK ON.  THIS TIME MY CAR WOULD NOT ACCELERATE AT ALL.  I HAD MY CAR TOWED TO DEALERSHIP AND WAS TOLD THE ACCELERATOR PEDAL THROTTLE ASSEMBLY WAS BAD.",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/05/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266514,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IF MY WHEEL'S ARE TURNED WHEN I TURN MY CAR OFF THE CAR PULLS REALLY HARD THAT DIRECTION WHEN I START IT AGAIN. RIGHT OR LEFT IT DOESN'T MATTER JUST SWITCH EVER DIRECTION MY WHEELS WHERE POINTED WHEN I TURNED IT OFF.",
        "vin": "4T4BF1FK3GR"
    },
    {
        "components": "STEERING,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258252,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING BOTH WET AND DRY CONDITIONS AT TIMES THE CAR DOESN'T REALIGN AFTER MAKING TURNS, GRINDS WHILE TURNING, PULLS TO THE RIGHT, PULL AND SHAKE VIOLENTLY WHEN HAVING TO COME TO OR MAKE AN ABRUPT STOP. WITH CAR IN PARK, TURNED OFF, AND KEYS OUT OF THE IGNITION THE STEERING WHEEL SHAKES VIOLENTLY AND TRIES TO OSCILLATE. CAN PROVIDE VIDEO UPON REQUEST.",
        "vin": "4T4BF1FK6GR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258391,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I START TO DRIVE MY CAR THE STEERING EITHER GOES TO THE LEFT OR RIGHT AND DOES NOT STAY STRAIGHT.  IT IS HAPPENING PERIODICALLY.  I HAD IT CHECKED, HAD AN ALIGNMENT AND THEY COULD NOT COME UP WITH ANYTHING THAT WOULD CAUSE THIS.  ON THE HIGHWAY IT IS NOT MUCH OF A DIFFERENCE BUT DRIVING ON THE STREET IT SEEMS AS IF SOMEONE IS GRABBING THE STEERING WHEEL AND PULLING IT TO EITHER SIDE.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/08/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11253966,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   I WAS IN A CAR COLLISION, HIT FROM BEHIND AT A VERY HIGH SPEED AND MY AIR BAGS DID NOT DEPLOY CAUSING INJURY TO HEAD AS WELL AS MY BACK. CAR COLLISION WAS AUGUST 3, 2019 IN SACRAMENTO. THE VEHICLE WAS IN STATIONARY POSITION WAITING AT A LIGHT. I HAVE A POLICE REPORT, INSURANCE CLAIM FORMS AND ALL OTHER APPROPRIATE DOCUMENTATION. THE ACCIDENT CAUSED MY CAR TO BECOME A TOTAL LOSE. *DT *DT *DT*JB  *TR",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "12/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242817,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE CAR SINCE IT HAD 7 MILES ON IT.  IT ONLY HAS 24K ON IT NOW.  I HAVE HAD ALIGNMENT ISSUES CONSTANTLY, STEERING IS LOOSE AND TIRES ARE WEARING FAST I HAVE ALREADY HAD TO REPLACE ALL 4 BEFORE IT HIT 10K MILES. NOW THEY ARE WORN AGAIN DUE TO ALIGNMENT",
        "vin": "4T1BF1FKXGU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/07/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232352,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS TAKING A 360 DEGREE EXIT RAMP AT 35 MPH MY STEERING COLUMN COLLAPSED AND I GOT CONTROL BARLEY BEFORE I HIT THE CURB AROUND THE MEDIAN. I STOPPED AND RE-LOCKED THE MECHANISM. ABOUT TEN MINUTES LATER AS I WAS CROSSING A BRIDGE ON THE HIGHWAY 55 MPH  THE CAR ROLLED OVER TWO EXPANSION JOINTS THE LOCK AGAIN RELEASED THE STEERING WHEEL SHOT UP THE COLUMN COLLAPSED I BARLEY GOT CONTROL AGAIN JUST AVOIDING SIDE SWIPING A TRACTOR TRAILER IN THE LANE NEXT TO ME. IS THIS PART A SAFETY ITEM LIKE SEAT BELTS AND AIR BAGS ? IS THIS AN ITEM THAT SHOULD BE ABLE TO LOOSEN ITSELF WHILE YOUR DRIVING ? PLEASE FORGIVE ME MY SCANNER IS NOT WORKING, IF YOU NEED THE REPAIR ORDER PLEASE CONTACT ME AND I WILL MAIL IT TO YOU.",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232365,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING 30 MPH, THE STEERING WHEEL COLLAPSED ON ITS OWN. THE CONTACT STATED THAT THE STEERING WHEEL WAS COLLAPSABLE AND WOULD FOLD WHEN THE COLLAPSE BUTTON WAS PRESSED. WHEN THE CONTACT LEANED ON THE DEVICE, THE STEERING WHEEL WOULD FOLD WHILE DRIVING. THE CONTACT HAD TO PULL OVER AND THEN PULL THE STEERING WHEEL BACK UP. LYNCH TOYOTA (179 TOLLAND TURNPIKE, MANCHESTER, CT 06042, (860) 646-4321) DIAGNOSED THAT THE SYSTEM NEEDED TO BE TIGHTENED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT A REPRESENTATIVE WOULD REACH OUT TO THE CONTACT SOON. THE FAILURE MILEAGE WAS 63,478.",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/05/2019",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229497,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS.  I HAVE 2016 CAMRY, IT JUST WENT OUT OF WARRANTY, I HAVE A MAJOR SAFETY CONCERN RELATED TO THE AIR BAGS AND SEAT BELTS, THE RED WARNING LIGHT FOR AIRBAG AND SEAT BELT CAME UP ABOUT 7 MONTHS AGO, ALSO THE PASSENGER AIR BAG YELLOW LIGHT ALWAYS SAYS AIR BAG IS OFF NO MATTER IF THERE IS A PASSENGER SETTING IN THE SEAT OR NOT ( PLEASE SEE PICTURES ATTACHED ) , WHICH MEANS IT WILL NOT INFLATES IN CASE OF ACCIDENT AND WILL JEOPARDIZE AND RISK PEOPLE LIFE . I CALLED TOYOTA CUSTOMER SERVICE COUPLE OF TIMES AND TALKED TO MANAGERS THERE, AND THEY COULDN'T CARE LESS ABOUT FIXING THE ISSUE ,BOTTOM LINE THEY SAID THE CAR IS OUT OF WARRANTY AND ITS NOT THEIR PROBLEM, THEY EVEN REFUSED TO SEND ME A WRITTEN LETTER STATING THAT, THEY SAID THEY WILL KEEP THE VOICE RECORDS WHICH I'M NOT SURE IF THEY KEPT OR NOT, ITS VERY SHAMEFUL AND SAD THAT TOYOTA DOESN'T STAND BEHIND THEIR PRODUCTS, ESPECIALLY ON SAFETY ISSUES THAT COULD GET PEOPLE KILLED IN CASE OF ACCIDENTS AND THE AIR BAGS NOT FUNCTIONING PROPERLY . TOYOTA INCIDENT# 190515-000353 SHOULD HAVE THE RECORDINGS FOR MY CONVERSATIONS WITH TOYOTA MANAGERS WHO COULDN'T BE ANY RUDER AND INCONSIDERATE FOR A MAJOR SAFETY ISSUES, KEEPING IN MIND ALL THE RECALL THEY DID FOR THE AIRBAGS RECENTLY.",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11223035,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. THE CONTACT STATED THAT WHILE DRIVING ABOUT 40 MPH, THE VEHICLE REAR-ENDED THE VEHICLE IN FRONT WHICH STOPPED ABRUPTLY. THE AIR BAGS DID NOT DEPLOY AND THE SEAT BELTS DID NOT LOCK IN PLACE, CAUSING THE CONTACT TO HIT HER CHEST ON THE STEERING WHILE THE TWO CHILDREN IN THE BACK SEATS HIT THE BACK OF THE SEATS IN FRONT OF THEM. THERE WERE NO WARNING LIGHTS. THE CONTACT SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE TWO CHILDREN IN THE BACK SEATS WERE FRIGHTENED AND SUSTAINED MINOR BRUISES THAT DID NOT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DAMAGED AND WAS TOWED TO A COLLISION CENTER, WAITING FOR THE INSURANCE COMPANY'S DECISION. THE DEALER AND THE MANUFACTURER WERE NOT CALLED. THE FAILURE MILEAGE WAS APPROXIMATELY 62,000.",
        "vin": "4T4BF1FK2GR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217769,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION. THE CAR HAS LESS THE 50K AND USES A QUART OR MORE PER 1000 MILES.",
        "vin": "4T1BF1FK6GU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207239,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY HYBRID",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT HEADLIGHT WILL FLICKER ON/OFF WHILE DRIVING AT NIGHT. A SIMPLE TAP TO THE HEADLIGHT ASSEMBLY WILL CAUSE THE HEADLIGHT TO START WORKING AGAIN. AFTER A FEW MINUTES OF DRIVING THE HEADLIGHT GOES OFF AGAIN. ISSUE OCCURS WHILE STATIONARY AND WHEN THE CAR IS IN MOTION.",
        "vin": "4T1BD1FK1GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206815,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING STARTED PULLING LEFT OR RIGHT  AFTER THE CAR WAS STARTED AND DRIVEN . WOULD STOP  AFTER THE THE IGNITION WAS TURNED OFF AND  TURNED BACK ON.  I THINK THE PROBLEM IS   WHEN THE BATTERY IS LOW ON AMPS AND YOU TURN ON THE IGNITION THE LOW AMPS MESSES UP THE ELECYRICAL POWER ASSIST OR THE STEERING SENCER AND LOCKS THE STEERING PROBLEM IN WHEN YOU START THE CAR AND THEN IT\"S RUNNING OFF THE ELECTRICAL ALTERANOR. BECAUSE  IS YOU PULL OVER AND STOP AND RESTART THE CAR SOME TIMES IT WILL FIX THE PROBLEM TILL YOU RESTART THE CAR. I REPLACED THE LOW AMP BATTERY AND IT FIXED THE PROBLEM FOR NOW. TOOK TOYATO TOMATO AND THEY COULD NOT DUPLICATE THE PROBLEM. PROBLEM COULD BE FIXED WITH A VOLTAGE REGULATOR OR WIRE CHANGE DIRECTLY TO THE ALT. REAL DANGERS PROBLEM ALMOST PULLED ME IN TO THE OTHER LANE!!!!",
        "vin": "4T4BF1FKXGR"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "04/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS ON A PUBLIC STREET IN MOTION. STALLED WHILE ACCELERATING ACROSS THE INTERSECTION TO THE POINT OF ALMOST BEING T-BONED. THIS PROBLEM OF HESITATING TO ACCELERATE HAS OCCURRED MANY TIMES SINCE I PURCHASED THE CAR ONLY 1 MONTH AGO.",
        "vin": "4T1BFIFK6GU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BIGGEST CONCERN IS THAT MY PASSENGER AIRBAG WORKS SOMETIMES AND DOESN'T WORK, WHEN I HAVE PEOPLE SITTING IN MY PASSENGER SEAT, THE AIRBAG SHUTS OFF, WHEN NO ONE IS SITTING THERE IT TURNS ON, THIS IS HAPPENING WHILE I AM DRIVING.",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2019",
        "dateOfIncident": "01/16/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191211,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HI, MY TOYOTA 2016 CAMRY IS USED AS A DAILY DRIVER. I PURCHASED THE NEW CAR AT THE DEALERSHIP WERE I WORK. MY JOB IS IN THE SHIPPING / RECEIVING DEPARTMENT AND ON A MONTHLY BASIS I WILL WITNESS 4 TO 8 WIRING HARNESS REPAIRS. WHEN I ASKED MY MANAGER  ABOUT IT HE SAID \"RODENT DAMAGE, THEY SEEM TO LIKE THE GLUE OR ADHESIVE\".                 WE'LL GUESS WHAT ? IT HAS HAPPENED TOO ME!  A SINGLE DAMAGED WIRE CAN BE DEBILITATING TO THE ELECTRONICS IN A MOTOR VEHICLE. IN JANUARY OF THIS YEAR MY COMPLETE HARNESS HAD TO BE REPLACED. THIS IS BECAUSE THE WIRING HARNESS IS NOT MADE IN A MODULAR OR SECTIONAL OPTION. PLEASE CAN THIS ( WHAT SEEMS TO BE A REOCCURRING MATTER) BE LOOKED INTO AND POSSIBLY ADDRESSED?",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184531,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHEN THE BRAKE PEDAL WAS DEPRESSED, THE FRONT BUMPER LOWERED AND PUNCTURED THE FRONT PASSENGER TIRE. THE FAILURE CAUSED A FLAT TIRE. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 26,000.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181037,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING 15-20 MPH, THE POWER STEERING BECAME DIFFICULT TO MANEUVER WITHOUT WARNING. AS A RESULT, THE CONTACT'S VEHICLE CRASHED INTO A HANDICAP PLACARD SIGN POLE.  THERE WERE NO INJURIES. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. CONSUMER (ROBERT JONES) REPLACED LOWER CONTROLL HAND AND BROUGHT A NEW RIM (DRIVER'S SIDE OF CAR) DAMAGE CONTROL AND MAG WHEEL. KEN GANLEY TOYOTA (LOCATED AT 1110 CLAIRTON BLVD, PLEASANT HILLS, PA 15236, (412) 469-3000) AND THE MANUFACTURER WERE NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 45,000. *TT*JB",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174817,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY, TOYOTA CAMRY 2016 HAS TORQUE CONVERTER PROBLEM, I CHECKED WITH COUPLE OF MECHANICS AND, MY FRIEND'S CARS WHO HAS SAME MODEL CAR ALSO HAS THAT PROBLEM.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11170073,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT ON DRIVER DOOR AND PASSENGER HIT REAL HARD THE SIDE BAGS DIDN'T DEPLOY TURNING IN A LEFT HAND LANE WAS HIT",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/02/2019",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164480,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE SEAT RAIL LOOSENED AT THE RIVETS, ALLOWING THE SEAT TO HAVE EXCESSIVE PLAY IN THE RAIL ITSELF. TOYOTA EVENTUALLY REPLACED UNDER WARRANTY AFTER MUCH ARGUING. HAD THIS BEEN ALLOWED TO CONTINUE THE RIVETS COULD HAVE ACTUALLY PULLED THROUGH THE RAIL ALLOWING THE SEAT TO BECOME TOTALLY LOOSE IN THE EVENT OF A CRASH. THE SYMPTOMS WERE FELT PRIMARILY UNDER STARTING AND STOPPING WHEN ONE COULD FEEL THE SEAT ROCKING EXCESSIVELY.",
        "vin": "4T1BF1FK6GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/16/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161863,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IF STEERING WHEEL IS TURNED TO THE RIGHT OR LEFT WHEN I START THE ENGINE, WHILE DRIVING THE WHEEL PULLS IN THAT DIRECTION WHILE GOING DOWN THE STREET. IF THE STEERING WHEEL IS STRAIGHT WHEN I TURN ON THE ENGINE AND DRIVE, THE CAR GOES STRAIGHT DOWN THE STREET, NO PULL LEFT OR RIGHT. SO I ALWAYS STRAIGHTEN THE WHEEL BEFORE I SHUT OFF THE ENGINE.",
        "vin": "4T1BF1FK4GU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "12/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161442,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR VIOLENTLY SHIMMIES WHEN BRAKING ON AN INCLINE AT 60-70MPH.",
        "vin": "4T4BF1FKXGR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154284,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2016 TOYOTA CAMRY SE 4-CYLINDER AUTOMATIC WITH 67K MILES.  IT IS ON IT'S SECOND SET OF TIRES WHICH HAVE ABOUT 25K MILES ON THEM, AND HAVE BEEN ROTATED ONE OR TWO TIMES SINCE PURCHASED NEW.  KEY POINT: THERE HAS BEEN NO WORK (INCL. NO TIRE ROTATIONS) DONE TO THE CAR RECENTLY...    EVERYTHING WAS FINE UNTIL LAST WEEK WHEN I NOTICED A STRONG PULLING OF THE CAR TO THE LEFT.  THE NEXT TIME I DROVE THE CAR I NOTICED A STRONG PULL TO THE RIGHT, WHICH SEEMED VERY STRANGE SINCE IT WAS NOT THE LEFT AS BEFORE.  THIS PULLING TO ONE SIDE OR THE OTHER HAS HAPPENED A FEW TIMES OVER THE LAST WEEK NOW.  THROUGH EXPERIMENTATION I HAVE LEARNED THAT TURNING THE IGNITION OFF AND RESTARTING SEEMS TO CLEAR THE PROBLEM - IF THE FRONT WHEELS ARE POINTED STRAIGHT FORWARD.  I BELIEVE HAVING THE FRONT WHEELS POINTING STRAIGHT FORWARD WHEN I SHUT OFF / RESTART SEEMS TO CORRECT THE PULLING PROBLEM.  BUT IF THE WHEELS ARE POINTED LEFT OR RIGHT WHEN I RESTART THE CAR, THE CAR PULLS THAT DIRECTION WHEN RESTARTED.    I'M NO AUTOMOTIVE MECHANIC, BUT BASED ON WHAT I THINK I'VE LEARNED, THIS PROBLEM SEEMS TO BE AN ELECTRONIC ONE.  SEEING OTHERS INCIDENTS BEING ENTERED WITH THE SAME PROBLEM ON 2015 AND 2016 CAMRYS, PLEASE LOOK INTO THIS ASAP.",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11152381,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 TOYOTA CAMRY. WHILE DRIVING APPROXIMATELY 60-70 MPH, THE VEHICLE CRASHED INTO A GUARDRAIL ON THE FRONT PASSENGER SIDE. THE CONTACT STATED THAT NONE OF THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE DRIVER AND PASSENGER SUSTAINED MINOR INJURIES THAT DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS DRIVEN FROM THE CRASH SITE, BUT WAS LATER DEEMED A TOTAL LOSS BY THE INSURANCE COMPANY. NEITHER THE DEALER NOR THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE WAS NOT DIAGNOSED. THE APPROXIMATE FAILURE MILEAGE WAS 88,000.",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "10/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY HYBRID",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING EAST ON MARSHALL AVE. IN LONGVIEW TEXAS, TO SUPER 1 GROCERY STORE, AND TURN LEFT TO PARK IN FRONT OF THE STORE. WHEN I TURNED LEFT THE VEHICLE MADE A LOUD POPING SOUND COMING FROM SUNROOF AREA. IT HAS BEEN DOING IT EVERY TIME I TURN LEFT OR RIGHT AS LONG AS THERE IS AN UNEVEN ROAD SURFACE THAT CAUSES THE FRONT TIRES TO BE AT A DIFFERENT ELEVATION THAN REAR TIRES. THIS POSITION PRODUCES A TWISTING MOTION OF THE VEHICLE FRAME AND THAT IS WHEN THE ROOF POPING IS HEARD.",
        "vin": "4T1BD1FKXGU"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151603,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MICE, JUMPING OUT OF EVERYWHERE WHILE I'M DRIVING!!! MY INSURANCE PAID OUT OVER $4000.00 AND I PAID $500 DEDUCTIBLE PLUS $300 TO HAVE METAL SCREENS PUT IN. I HAD TO REPLACE HEATER CORE, AIR CONDITIONING CORE, HEATER FAN, DUCT WORK, WHERE THE MICE HAD BUILT A NEST. WHEN THE HEATER FAN CAME ON IT WAS LIKE PUTTING THE MICE THROUGH A BLENDER. MOUSE PART EVERYWHERE!! SOY USED IN WIRING IS TO BLAME. SHAME ON THE US GOVERNMENT AND TOYOTA FOR DUMPING THIS CAR ON A UNSUSPECTING PUBLIC. YOU BUY A BRAND NEW CAR THEN FIND OUT YOU BOUGHT A BUFFET FOR RODENTS! [XXX], MAINE USA    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4T4BF1FK1GR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133508,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE HESITATED AND FAILED TO ACCELERATE. ALSO, THE VEHICLE SHOOK AND VIBRATED WHILE IDLING. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED GERMAIN TOYOTA OF COLUMBUS AT (614) 686-0300 (LOCATED AT 5711 SCARBOROUGH BLVD, COLUMBUS, OH 43232) AND WAS INFORMED THAT THE VEHICLE WAS OUT OF WARRANTY; THEREFORE, THE CONTACT WOULD BE CHARGED A DIAGNOSTIC FEE. THE VEHICLE WAS NOT TAKEN TO THE DEALER OR AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 41,000.",
        "vin": "4T1BF1FKXGU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "09/29/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11133124,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN A PARKING LOT IN GRIDLOCK TRAFFIC LEAVING AN EVENT MY 2016 TOYOTA CAMRY MADE A LOUD THUMP NOISE AS IF WAS RELEASING THE BRAKE. THE CAR THEN LITERALLY MADE A SUDDEN ACCELERATION FORWARD AND IT WOULD NOT STOP. BECAUSE IT WAS GRIDLOCK IN THE PARKING LOT THE ONLY WAY IT WAS GOING TO STOP WAS TO HIT A PERSON OR ANOTHER CAR. MY CAMRY HIT 2 CARS AND FINALLY STOPPED. THE CAR AT THE TIME WAS NOT IN MOTION BUT IN DRIVE WITH THE FOOT ON THE BRAKE",
        "vin": "4T4BF1FK0GR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH RIGHT FOOT ON THE BRAKE, THE CAR WAS VERY SLOWLY MOVING FORWARD WITH A PLAN TO PARK IN FRONT OF A PALM TREE THAT IS SURROUNDED BY CONCRETE BORDER APPROX. 8' HIGH. THE CAR UNEXPECTEDLY AND ABRUPTLY ACCELERATED THEN HIT THE PALM TREE. ALTHOUGH, THE CONCRETE STOPPED FURTHER FORWARD MOVEMENT, THE CAR HAD SIGNIFICANT FRONT END DAMAGE.    I BROUGHT THE CAR TO AUTONATION DEALER FOR INSPECTION ON 04/23/18, WHO ADVISED ME TO CALL TOYOTA CLAIMS DEPT.  TOYOTA CLAIMS DEPT. ASSIGNED AN INSPECTOR TO REVIEW THE EVENT ELECTRONIC DATA RECORDER (EDR). THE INSPECTOR DOWNLOADED THE DATA FROM THE EDR, GAVE ME A COPY AND FORWARDED TO TOYOTA CORP.  THE INSPECTOR ALSO TEST DROVE THE CAR.    ON 04/04/18 I RECEIVED A MAIL FROM TOYOTA INDICATING THAT THERE IS NO EVIDENCE OF A DEFECT WITH THE THROTTLE CONTROL SYSTEM THAT CAUSED THE INCIDENT BASED ON THE EDR READOUTS.  THE READOUTS COVER THE PRE-CRASH DATA AS FOLLOWS:     1. THE EDR READOUTS INDICATED THAT THERE WAS A MOMENTARY ACCELERATOR INPUT THAT BROUGHT THE ENGINE RPM FROM 700 TO 1500.  HOWEVER, THE EDR READOUT ALSO INDICATED THE ENGINE RPM INCREASED FROM 1500 TO 1900 WITHOUT ACCELERATOR INPUT.    2. THE EDR READOUTS ALSO INDICATED AT 0 SEC, THE ENGINE IS AT 1500 RPM WITH ACCELERATOR AND BRAKE INPUTS AT THE TIME.    ON 04/08/18 I SENT A LETTER TO TOYOTA CLAIMS ADMINISTRATOR REQUESTING FURTHER REVIEW OF ABOVE ITEMS 1 & 2.    ON 07/10/18, TOYOTA CLAIMS ADMINISTRATOR RESPONDED MAINTAINING THAT THERE IS NO EVIDENCE OF DEFECT.      ON 07/17/18 I SENT A WRITTEN REQUEST TO TOYOTA FOR AN EXPLANATION AS TO WHY THE ENGINE RPM INCREASED FROM 1500 TO 1900 WITHOUT ACCELERATOR INPUT.  ALSO REQUESTED FOR AN EXPLANATION OF HOW COULD THERE BE ACCELERATOR AND BRAKE INPUTS AT THE SAME AS INDICATED IN ABOVE ITEM 2. I ALSO FOLLOWED UP WITH A PHONE CALL.    AS OF TODAY, I HAVE NOT RECEIVED A RESPONSE OR RETURN CALL FROM TOYOTA.",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129348,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY HYBRID",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR AT THE END OF APRIL 2017 AND IN AUG 2018 STARTED HAVING A GRINDING NOISE EVERY TIME I STEPPED ON THE BREAK PEDAL.  TOOK CAR TO DEALER AND THEY TOLD ME IT WAS NORMAL TO HAVE THAT NOISE THAT WASN'T THERE BEFORE.  SPENT 3 WEEKS TRYING TO GET TOYOTA TO FIX THIS ISSUE. CAR HAD 29K MILES ON IT.  SERVICE TECHNICIANS WERE EXTREMELY RUDE AND KEPT ON SAYING IT WAS NOTHING AND IT WITH IT.  AFTER FINALLY GETTING THEM DOING SOMETHING ON IT THE DIAGNOSIS WAS THE ABS ACTUATOR NEEDED TO BE REPLACED.  THIS ISSUE SHOULDN'T HAPPEN AT ALL WHEN THE CAR IS ONLY ONE YEAR OLD AND WAS STILL UNDER WARRANTY. NOT TO MENTION THAT I HAD TO REPLACE ALL 4 TIRES WITHIN 9 MONTHS BECAUSE OF THE CHEAP TRASHY ONES THEY HAD ON THE VEHICLES CEL WHEN I BOUGHT IT. THIS WAS A BRAND NEW VEHICLE WHEN I BOUGHT IT. I CONTACTED CORPORATE OFFICE AND COMPLAINED ABOUT IT. I REQUESTED AN EXTENSION ON MY WARRANTY DUE THIS MANUFACTURER DEFECT AND THEY ARE DENYING IT. ALSO THEY ARE TELLING ME THE REPLACED PART WILL BE COVERED UNDER WARRANTY UNTIL MY MANUFACTURER WARRANTY IS GOOD WHICH IS ONLY 6K MILES FROM NOW.  I NEED SOMEONE TO HELP ME HERE.  I DON'T GET TO UNDERSTAND WHY A LITERALLY BRAND NEW CAR HAS THIS TYPE OF ISSUES AND WHEN I SEEK FOR HELP THEY WOULDN'T WANT TO FIX IT UNTIL I GOT TO CONTACT CORPORATE OFFICE. BUT NOW THAT THEY FIX IT THERE IS LITERALLY NO WARRANTY ON THE PART THAT WAS REPLACED.  WHO GUARANTEES ME THAT THIS CAR WON'T HAVE ANY OTHER ISSUES? I DON'T TRUST IT AND I AM SO DISSATISFIED IF THE SERVICE FROM TOYOTA.  I HAVE OWN OTHER IM VEHICLES FROM THEM FOR AT LEAST 5 YEARS EACH AND NEVER HAD AN ISSUE LIKE THIS HAPPENING TO THE CAR, SPECIALLY BEING A BRAND NEW CAR.",
        "vin": "4T1BD1FK9GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2018",
        "dateOfIncident": "08/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115742,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC LOCK DOES NOT LOCK WHEN CAR IS IN DRIVE AND IT DOES NOT UNLOCK WITH ME PRESSING THE BUTTON PLEASE HELPPPP",
        "vin": "4T4BF1FKXGR"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2018",
        "dateOfIncident": "07/15/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111421,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY JUNE 15, 2018, AT APPROXIMATELY 10:15 AM, I WAS TRAVELING IN THE LEFT LANE, EAST ON ROUTE 72 TOWARDS LBI, THE BLACK PICK UP TRUCK IN FRONT OF ME LOST HIS HITCH. HE DID NOT HAVE IT SECURELY ATTACHED TO HIS VEHICLE. THE HITCH HIT THE ROAD IN FRONT OF ME AND BEGAN BOUNCING AND WAS BOUNCING HIGHER AND HIGHER AND I HAD HEAVY TRAFFIC BEHIND ME AND IN THE RIGHT LANE AS WELL. I HAD TO TIME THE BOUNCE OF HIS HITCH SO I COULD GO OVER IT. WHEN I SUCCESSFULLY DID THIS THE HITCH MADE DENTS TO THE UNDERCARRIAGE OF MY VEHICLE AND POSSIBLY CAUSED OTHER DAMAGES THAT I HAVE NOT YET FOUND. THE BLACK PICK UP TRUCKS' LICENSE PLATE NUMBER WAS NJ:H45HNJ. I DID NOT PURSUE THE VEHICLE. I MADE MY WAY TO MY WORK AND FILED REPORT WITH MY INSURANCE COMPANY GEICO.",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2018",
        "dateOfIncident": "09/25/2017",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104137,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. THE CONTACT STATED THAT AN ABNORMAL BURNING ODOR WAS DETECTED IN THE VEHICLE. THE VEHICLE WAS TAKEN TO SLOANE TOYOTA OF PHILADELPHIA (1546 COTTMAN AVE, PHILADELPHIA, 19111) WHERE IT WAS DIAGNOSED, BUT NO FAILURE COULD BE DETERMINED. THE MANUFACTURER WAS NOTIFIED AND INFORMED THE CONTACT TO TAKE THE VEHICLE BACK TO THE DEALER FOR FURTHER DIAGNOSTIC TESTING. THE FAILURE MILEAGE WAS 20,355.",
        "vin": "4T4BF1FK1GR"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "05/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11102884,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AND DRAS II FAILURE FOR AS YET TO BE DETERMINED ADDITIONAL VINS  MY FRIEND AND I WERE IN THE FRONT DRIVER SIDE AND FRONT PASSENGER SIDE SEATS, BUCKLED UP, SITTING IN TRAFFIC STOPPED ON THE 5 FREEWAY HEADED NORTH. WE WERE REAR ENDED AT A HIGH RATE OF SPEED, AT A SLIGHT ANGLE TO OUR BUMPTER, BY A DRIVER WHICH RESULTED IN THE TOTAL DECIMATION OF THEIR VEHICLE AND SUBSTANTIAL DAMAGE TO OUR VEHICLE WHICH MANIFESTED ITSELF AS REAR BUMPER AND REAR UNDER BODY DAMAGE, AS WELL AS CRUMPLING OF THE REAR DRIVER AND PASSENGER SIDE FRAME AND QUARTERPANELS, TO OUR 2016 TOYOTA CAMRY. BOTH THE DRIVER AND I WERE THROWN FORWARD, AND DESPITE WEARING OUR SEATBELTS I HIT MY HEAD AND KNEE ON THE PASSENGER SIDE DASHBOARD AREA DURING THE IMPACT. NO AIRBAGS INFLATED IN THE VEHICLE. UPON EXAMINING THE VEHICLE IMMEDIATELY AFTER THE INCIDENT, THE DRIVER CONSOLE DISPLAYED RED ERROR LIGHTS INDICATING THAT AIRBAGS HAD BEEN DEPLOYED DESPITE NONE HAVING DONE SO. BOTH THE DRIVER AND I SUSTAINED SERIOUS AND ONGOING INJURIES AS A RESULT. THE VEHICLE HAD APPROXIMATELY 27000 MILES AT THE TIME OF THE INCIDENT. THERE ARE CONFIRMED REPORTS FROM TOYOTA DEMONSTRATING THAT AIRBAG SENSORS ARE PRONE TO FAILING AT THE CHIP EDGE DUE TO LARGE INTERNAL TENSILE STRESS INCONJUNCTION WITH DEFECTS IN THE SENSOR CAUSING IT TO DELAMINATE.",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "02/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11101198,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 TOYOTA CAMRY. WHILE DRIVING 40 MPH, THE CONTACT REAR ENDED ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. AS A RESULT, THE CONTACT SUSTAINED CHEST AND BACK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE OTHER DRIVER WAS NOT INJURED. THE CONTACT WAS UNCERTAIN IF A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED A TOTAL LOSS. THE CONTACT PURCHASED THE VEHICLE FROM THE DEALER (STONE MOUNTAIN TOYOTA, 4400 STONE MOUNTAIN HWY, LILBURN, GA 30047), BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT REACHED OUT TO THE DEALER REGARDING A WARRANTY REFUND. THE MANUFACTURER HAD NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "05/21/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097189,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING GETS REAL STIFF WHEN ENGINE IS ON .[CANNOT TURN] STATIONARY AND IN MOTION  POSITION AT ALL TIMES.",
        "vin": "4T4BF1FK5GR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/20/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096919,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING HEAVY RAIN, THE WATER FROM THE WHEEL WELLS IS THROWN UP ONTO THE WINDSHIELD AND THE WINDSHIELD WIPERS CANNOT KEEP UP WITH IT. THIS HAS HAPPENED AT 30 MPH, AS WELL AS HIGHER SPEEDS. THIS COMPLETELY OBSCURES VISIBILITY AND HAS NEARLY CAUSED TWO ACCIDENTS, AS WELL AS SOME VERY FRIGHTENING INCIDENTS. THESE OCCURRED ON HIGHWAYS AND LOCAL PAVED ROADS. HEAVY WATER THROWN BY OTHER VEHICLES CAN'T BE TAKEN CARE OF BY THE WIPERS, FORCING THE DRIVER TO GUESS WHERE THE ROAD AND OTHER VEHICLES ARE.",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092651,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE THE VEHICLE WAS PARKED AND IDLING, IT INADVERTENTLY ROLLED AWAY. THE VEHICLE WAS TAKEN TO BALISE TOYOTA (1399 RIVERDALE STREET, WEST SPRINGFIELD, MA 01089), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "4T1BK1FK9GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/06/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092117,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS 18K MILES WHEN THIS HAPPENED. I DROVE FROM WORK TO GROCERY STORE. AFTER LEAVING THE STORE I STOPPED AT A RED LIGHT, THE ABS WARNING CAME ON THEN CHECK ELECTRICAL CHARGING SYSTEM WARNING. I PUT THE CAR IN PARK, THEN I COULDN'T GET IT IN GEAR AGAIN. I EXITED THE VEHICLE TO WAVE THE CARS BEHIND ME TO GO AROUND BECAUSE THE FLASHERS DIDN'T WORK. AFTER I GOT ALL THE OTHER CARS PAST ME, I CALLED MY HUSBAND TO COME AND GET ME. HE SUGGESTED THAT I TRY RESTARTING THE CAR AGAIN, WITH MORE PRESSURE ON THE BRAKES. THIS TIME, IT STARTED AND I MOVED IT TO A NEARBY PARKING LOT. THE NEXT DAY, IT WAS TOWED TO THE DEALER. THE DEALER KEPT IT OVERNIGHT TO RUN MORE TESTS, BUT THEY SAID THAT NO FAILURE WAS INDICATED. MY HUSBAND GOT THE CHARGING SYSTEM LIGHTS TO COME ON, AND HE VERIFIED THIS WITH THE DEALER. THE LEASE IS UP IN IN 4 MONTHS, BUT I WON'T DRIVE IT AGAIN. TOYOTA CORPORATE WAS NO HELP, SAYING NO ERROR MESSAGE ON COMPUTER MEANS CAR IS SAFE TO DRIVE. GOD HELP THE NEXT PERSON WHO BUYS THIS CAR.",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/28/2018",
        "dateOfIncident": "01/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090830,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2016 TOYOTA CAMRY STEERING RANDOMLY STARTED TO GET STIFF WHEN DRIVEN AND HAS BECOME WORSE. AT TIMES, IT WILL LOOSEN UP AND DRIVE EASIER. TOYOTA DEALERSHIP HAS CHECKED THE STEERING TWICE AND INDICATE THEY ARE UNABLE TO DUPLICATE THE ISSUE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "04/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090296,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING VARIOUS SPEEDS, THE ENGINE STARTED TO SPUTTER WITHOUT WARNING. THE VEHICLE WAS TAKEN TO GREEN'S TOYOTA OF LEXINGTON (630 E NEW CIR RD, LEXINGTON, KY 40505) WHERE IT WAS DIAGNOSED THAT THE TORQUE CONVERTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT NOTHING COULD BE DONE TO ASSIST. THE FAILURE MILEAGE WAS 66,000.",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "04/04/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083654,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LITTLE OVER A YEAR, A CHECK ENGINE ALERT OCCURRED THAT WAS THE RESULT OF A PROBLEMATIC GAS CAP, DEPRESSURIZING THE GAS TANK. THE FIRST OCCURRENCE WAS UNDER WARRANTY, BUT THE SECOND OCCURRENCE COST $130 TO REPLACE THE GAS CAP. REPLACING A GASCAP TWICE IN 14 MONTHS WOULD SEEM TO BE A DESIGN OR MANUFACTURING FLAW AND SHOULD NOT COST $130.",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/19/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081213,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS HIT BY TWO TRUCK ON BOTH SIDES. DRIVER SIDE THE DOOR WAS COMPLETELY DAMAGED AND THE PASSENGER SIDE WIND SHIELD, WINDOW AND FRAME COMPLETELY BROKEN. THE AIRBAG (CURTAIN AIRBAG) WHICH SHOULD BE DEPLOYING FOR SIDE IMPACT DID NOT DEPLOY. THIS COULD BE A POOR AIRBAG OR MAY BE DESIGN FAULT.",
        "vin": "4T1BF1FK8GU"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/20/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080333,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "HIS LOOKS EXTREMELY SCARY!! WHILE I WAS DRIVING ON HIGHWAY US 78 TOWARDS ATLANTA SUDDENLY I HEARD A WEARD SOUND THEN THE CAR APPEARS ATTEMPTING A HARD PRESS ON THE BRAKE. THE DASHBOARD SHOWED CHECK BRAKE SYSTEM IN BOLD RED AND ANOTHER BRAKE LIGHT IS ON WHERE THE ODD METER IS. I HAVE TO PULL OFF THE SIDE THE HIGHWAY. STAYED ON THE SIDE OF THE HIGHWAY AND ATTEMPTED TO CALL TOYOTA 800 331 4331 AND SENT EMAIL TO ASK TOYOTA. I AM VERY SCARED TO DRIVE THIS CAR. THE CAR IS TOYOTA CAMRY 2016",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064290,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN EVER YOU PRESS THE BRAKES MAKE ROARING SOUND WHEN AT SPEED OF 60 OR ABOVE ON HIGHWAY AND SOMETIMES MISSES THE BRAKE WHEN YOU PUSH IT TO STOP. WHEN YOU REVERSE OR TURN RIGHT OR LEFT  DIFFERENT KIND OF NOISES COMES FROM SUSPENSION AND SOUNDS LIKE SOMETHING IS GOING TO BREAK.",
        "vin": "4T1BF1FK4GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061489,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON A HIGHWAY (APPROX 65 MPH) AND SUNROOF EXPLODED.  NOTHING HAD HIT THE VEHICLE AND THERE HAD BEEN NO EXTREME TEMPERATURES OR FLUCTUATIONS.",
        "vin": "4T1BF1FKXGU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/22/2017",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056093,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY WHEN THE SUNROOF SHATTERED. THE VEHICLE IS 1-1/2 YEARS OLD. THE OUTSIDE WEATHER WAS ABOUT 50 DEGREES AND I HAD THE HEAT ON. NOT SURE IF THE INSIDE/OUTSIDE TEMPERATURES CAUSED THIS, OR IF THE BODY HAD SETTLED OR CHANGED IN SOME WAY TO CREATE PRESSURE ON THE GLASS.",
        "vin": "4T1BD1FK8GU"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051607,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AS SOON AS I BOUGHT THE TOYOTA 2016 UNIT AND STARTED DRIVING IT I NOTICED THAT THE VEHICLE WAS APPARENTLY DISALIGNED. BUT IN AN AWKWARD MANNER:  THE STEERING WHEEL WOULD FORCIBLY TURN LEFT. ANOTHER TIME RIGHT. SOMETIMES, SPECIALLY AFTER STARTING THE ENGINE. IT IS AN ERRATIC BEHAVIOR. TOOK IT TO A CERTIFIED MECHANIC AND WAS ALIGNED. THE MECHANIC MENTIONED THAT IT WAS A BIT DISALIGNED.  NEXT DAY I EXPERIENCED THE SAME PROBLEM. BACK TO THE SHOP AND A ROAD TEST WAS PERFORMED. THE MECHANIC WAS BEWILDERED AND COULD NOT FIND AN EXPLANATION FOR THIS PROBLEM.",
        "vin": "4T4BF1FK2GR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "09/22/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11051260,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING 65 MPH, THE CONTACT CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED BACK AND NECK INJURIES, BUT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO AN INDEPENDENT MECHANIC FOR AN ESTIMATE OF THE DAMAGE. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "4T4BF1FK4GR"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/28/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051013,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT BELT GET STUCK OCCASIONALLY. IT WILL NOT FULLY PULL OUT OF THE CASE THAT THE SEAT BELT RETRACTS TO, MAKING IT UNUSABLE FOR THE PASSENGER. YOU HAVE TO FUSS WITH IT AND THEN IT RELEASES. MY SIXTEEN YEAR OLD DAUGHTER HAS BEEN DRIVING THIS CAR AND I WOULD LIKE THE SEAT BELT TO BE FIXED.",
        "vin": "4T1BE32K96U"
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/15/2017",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11023729,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA CAMRY VIN  [XXX].  TOYOTA CASE #[XXX]  POLICE INCIDENT:[XXX]    THIS IS TO INFORM YOU THAT MY WIFE ENDED UP A SEVERE CAR ACCIDENT DATED 9-7-2017. THE TOYOTA CAMRY LE 2016 CAR WHICH WAS ON LEASE FROM THE TOYOTA F OVER 20 MONTHS COMPLETELY TOTALED OUT. THE CAR WAS HIT ON THE NON DRIVER REAR SEAT BY THE OTHER CAR WHILE TURNING. THE IMPACT WAS OF AT LEAST 30-40 M/HR OF THE SPEED.ABOVE  CAR SPINNED 180 DEGREE ENDED UP STOPPING DUE TO ROAD SIDE PAVEMENT IN THE OPPOSITE ROAD.  THE IMPACTED SIDE WHEEL WAS BROKEN AND ROTATED OUT.    THE IMPACT WAS SEVERE BUT THE AIR BAGS MAINLY ON THE DRIVER SIDE FRONT AND REAR SEAT DID NOT OPEN AT ALL. THE REMAINING OPEN BAG WAS FLOPPY.   BEING A MEDICAL PHYSICIAN, THIS IS SURPRISING AND DISTURBING TO ME.  AS THE MOST FATAL CAR INJURY OCCUR DUE TO THE DECELERATION INJURIES DUE TO STEERING WHEEL IMPACT THAT CAN LEAD MAJOR VESSEL LIKE AORTA / HEART RUPTURE.   I SEE IT AS THE MANUFACTURING DEFECT IN THE CAR.IN THE BACK, BOTH BABY CAR SEATS WERE DAMAGED . FORTUNATELY, MY WIFE DROPPED MY CHILDREN 0.3  MILE BEFORE THE ACCIDENT SITE TO THE DAY CARE WHO IS  A 4 MONTH OLD INFANT. I AM VERY SURE THAT IF ANY OF MY CHILDREN WOULD BE IN THE BACK SEAT, THE CONSEQUENCES COULD BE LIFE THREATENING.S. MY WIFE HAS A CHEST PAIN AND BACK PAIN DECELERATION INJURY CAUSING FRONT CHEST PAIN, HEAD CONCUSSION AND OTHER INJURIES RELATED.     I  EXPECT SAFETY SHOULD BE THE PRIORITY WHEN COME TO HUMAN LIFE.  WE WERE PLANNING TO KEEP THIS CAR AS WE SPEND LEASE MONEY IN TO IT. HOWEVER DUE TO  THE ACCIDENT AND TOTAL LOSS OF CAR. IT  HAS EFFECTED OUR FINANCIAL SITUATION TO BUY A NEW CAR. THIS IS EFFECTING OUR WORK AS WE ENDED UP IN URGENT SITUATION TO SPEND THOUSANDS OF DOLLAR TO PURCHASE A NEW CAR.    I HAVE READ THE NHTSA INFORMATION ABOUT THE CAR BAGS AND OTHER DETAILED WHICH FURTHER CONFIRMS MY DOUBT. THANKS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4T1BF1FK8GU"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "UPDATE TO NHTSA ID - 10937419    MY 2016 TOYOTA CAMRY SE HAS SINCE BEEN BACK IN AND OUT OF THE SHOP WITH THE SAME SINCE THE ORIGINAL COMPLAINT MY CAR HAS BEEN AT THE DEALERSHIP 5 TIMES. EACH TIME WAS SIMPLY TOLD \"NORMAL OPERATION\" OR \"COULD NOT DUPLICATE\"...IT IS INTERMITTENT     HAD RECEIVED A CALL FROM MY SERVICE ADVISOR THAT THEY PULLED CODES SHOWING THE FOLLOWING;    P1604 - STARTABILITY MALFUNCTION  P2610 - ECM/PCM INTERNAL ENGINE OFF TIMER PERFORMANCE  B1507 - VEHICLE SPEED CONTROL AND IDLE CONTROL RELATED  HE INFORMED ME IT WAS LIKELY A BAD ECM AND WAS WAITING ON TOYOTA TO APPROVE THE REPAIR. SHORTLY AFTER I WAS INFORMED TOYOTA DENIED THE REPAIR STATING DRIVER ERROR...  AND THE SERVICE INVOICE SAYS NO CODES? I HAVE REPORT SHOWING OTHERWISE!!!    IN APRIL, MY CAR ACCELERATED PULLING INTO A DRIVEWAY AND RAN INTO THE BACK OF TRUCK AT APPROXIMATELY 5 MPH CAUSING DAMAGE TO THE HOOD, GRILL AND BUMPER OF MY VEHICLE. I REPORTED THIS INCIDENT AND TOYOTA TOOK MY VEHICLE IN FOR 20 DAYS FOR AN INVESTIGATION AND BROUGHT IN A \"3RD PARTY\" TO PULL THE EDR BOX INFO. WHEN THE 3RD PARTY SENT ME THEIR READINGS...ALL CODES INCLUDING FREEZE CODES WERE NON-EXISTENT? HOWEVER I DEMANDED THE DIAGNOSTIC REPORT FROM DAYTONA TOYOTA AND HAVE THAT TO PROVE THEY WERE INDEED THERE TO BEGIN WITH. WHERE DID THEY GO?    I SPOKE WITH WENDY OLSEN THE VICTIM AND WITNESS COORDINATOR OF THE US ATTORNEYS OFFICE SOUTHERN DISTRICT OF NEW YORK REGARDING THIS MATTER.    HONORABLE WILLIAM H. PAULEY III US DISTRICT JUDGE FOR THE SOUTHERN DISTRICT OF NEW YORK ARRANGED A DEFERRED PROSECUTION OF FRAUD CHARGES ON TOYOTA FOR THIS SAME ISSUE IN 2014 AND UPON COMPLETION OF MONITORING FOR SEVERAL YEARS THE CASE WAS TO BE NULLIFIED, HOWEVER THAT WAS CHANGED AND WAS NOT...THERE MUST BE A REASON WHY!!!    I HAVE ATTACHED DOCUMENTS TO SHOW SERVICE RECORDS WITH OBVIOUS PERSONAL INFORMATION BLOCKED FOR PRIVACY REASONS!",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "09/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022901,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PARKED, IT WAS DISCOVERED THE TRANSMISSION FLUID STAINS ON THE GROUND, TOOK THE CAR TO THE LUSTINE TOYOTA DEALER IN WOODBRIDGE, VA AND THE TECHNICIAN FOUND TRANSMISSION FLUID LEAKS FROM SEALS, TRANSAXLE, PAN GASKET AND TRANSMISSION CASE.",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "08/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019301,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. THE CONTACT STATED THAT AFTER HE DEPRESSED THE BRAKE PEDAL LIGHTLY, HIS VEHICLE WAS REAR ENDED BY ANOTHER VEHICLE. AFTERWARDS, THE CONTACT'S VEHICLE EXPERIENCED UNINTENDED ACCELERATION. THE CONTACT STATED DEPRESSED THE BRAKE PEDAL FREQUENTLY, BUT IT DID NOT FUNCTION FOR APPROXIMATELY 45 SECONDS BEFORE THE CONTACT WAS ABLE TO REGAIN CONTROL. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS ABLE TO BE DRIVEN AND WAS TAKEN TO PASSPORT TOYOTA (LOCATED AT 5001 AUTH WAY, SUITLAND, MD) WHERE IT WAS DIAGNOSED THAT THERE WAS AN ELECTRICAL ISSUE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 35,962.",
        "vin": "4T4BF1FK4GR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "08/02/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012306,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOORS WILL LOCK WHEN IN DRIVE BUT IN CASE OF AN ACCIDENT THEY WILL NOT UNLOCK AUTOMATICALLY.ONLY IF THE OWNER,DRIVER DISABLES THE AUTO LOCKING SYSTEM.MOST OF PEOPLE DON'T HAVE IDEA ABOUT THIS ISSUE BECAUSE WHEN THE VEHICLE IS PURCHASED NO ONE WARNS US.ABOUT THIS SAFEFY ISSUE.I AM PRETTY SURE THAT ALL TOYOTAS HAVE THE SAME SETUP AS STANDARD FACTORY SETTING.",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/24/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010339,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER IT RAINS, THE BACKUP CAMERA ON MY 2016 TOYOTA CAMRY SE GETS WATER CLOGGED WHICH RENDERS VISIBILITY BY THIS DEVICE USELESS.  THE TOYOTA DEALERSHIP STATES NOTHING CAN BE DONE TO FIX THIS PROBLEM.  TOYOTA'S HOTLINE STATES NOTHING CAN BE DONE TO FIX THIS ISSUE.  THIS IS A SAFETY FEATURE FAILURE.  IN THE RAIN, YOU CANNOT SEE WHAT'S BEHIND YOU ON THE BACKUP CAMERA WHEN YOU ARE BACKING UP. I HAVE HAD BACKUP CAMERAS ON PREVIOUS TOYOTAS AND NEVER HAD THIS PROBLEM BEFORE.  THIS HAS BEEN AN ONGOING PROBLEM SINCE PURCHASE OF THIS PARTICULAR VEHICLE.",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004863,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATES BEFORE ACCELERATING AFTER A STOP OR FOLLOWING A TURN, THEN ACTS NORMALLY WHEN ACCELERATOR IS RELEASED",
        "vin": "4T1BF1FK4GU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001049,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA.  CONSUMER WRITES IN REGARDS TO DRIVER SIDE SEAT MALFUNCTION.  *LD    THE CONSUMER REQUESTED REPEATEDLY FOR THE MANUFACTURER TO REPAIR THE SOP ON THE SEAT WITH BETTER MATERIAL. THE DRIVER'S SIDE SEAT BOTTOM SOP CONTINUOUSLY BREAKS.   UPDATED 07/06/2017*JS   UPDATED 08/16/17*LJ    *CN  *TR",
        "vin": "4T1BK1FK6GU"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/02/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002739,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO REPORT A DEFECT AND SAFETY CONCERN ABOUT MY 2016 TOYOTA CAMRY.  LAST JULY I BOUGHT A 2016 TOYOTA CAMRY (VIN:[XXX]) FROM TOYOTA OF SARASOTA (7435 S TAMIAMI TRAIL SARASOTA, FL 34231). LAST NOVEMBER, WHEN I WAS DRIVING THIS CAR ON I75, THE ENGINE SHUT OFF SUDDENLY AND THE DASHBOARD WAS DEAD AS WELL . I WAS SO SCARED AND PULLED THE CAR OVER TO THE SHOULDER OF THE ROAD. WHEN I CALMED DOWN , I TRIED TO RESTART THE ENGINE, AND IT WORKED AGAIN. I THOUGHT IT WAS JUST BECAUSE IT WAS A NEW CAR AND DID NOT REPORT THIS TO THE DEALER IMMEDIATELY.  WHEN MY FIRST SCHEDULED SERVICE VISIT ON JANUARY THIS YEAR, I TOLD THE DEALER WHAT HAPPENED IN NOVEMBER AND ASKED THEM TO CHECK THE CAR CAREFULLY AND THOROUGHLY. THEY TOLD ME THEY DID NOT HEAR OF THE THING I TOLD THEM EVER HAPPENED ON CAMRY BEFORE AND AGREE TO TAKE A LOOK. THEY FOUND NOTHING WRONG WITH MY CAR. BUT TWO WEEKS LATER, THE ENGINE SHUT OFF AGAIN WHEN I DRIVING THE CAR ON HIGHWAY I75. THE SAME THING HAPPENED AGAIN. I CALLED TOYOTA THOUGH THE NUMBER 800-331-4331, AND THEY SAID THEY DID NOT HAVE THE SIMILAR CASE REPORTED AND SUGGESTED ME TO CHECK MY CAR AT THE DEALER. I STOPPED BY THE DEALER AND THEY DROVE MY CAR ON THE HIGHWAY TRYING TO DUPLICATE THE PROBLEM BUT FAILED. THEY ALSO CHECK THE CAR THOROUGHLY AND FOUND NOTHING UNNORMAL. YESTERDAY(7/2/2017), I WENT THE  DEALER FOR MY SECOND SCHEDULED SERVICE VISIT AND EVERYTHING WAS GOOD FOR MY CAR. BUT WHEN I WAS DRIVING HOME ON I75, THE ENGINE STOPPED WORKING AGAIN. I RESTARTED THE CAR AND DROVE BACK TO THE DEALER REPORTING THEM THE PROBLEM. THEY CHECK THE CAR AGAIN AND FOUND NOTHING WRONG AGAIN. ENCLOSED PLEASE FIND THE PICTURES I TOOK YESTERDAY WHEN I PULLED OVER MY CAR ON THE SHOULDER OF THE ROAD. THE DASHBOARD WAS DEAD AND THE KEY WAS STILL AT THE ON POSITION. PLEASE HELP ME TO FIX THIS PROBLEM, WHICH IS A SERIOUS SAFETY CONCERN.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4T1BF1FK4GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/14/2017",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995200,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE ATTEMPTING TO ACCELERATE FROM A STOP, THE VEHICLE DECELERATED AND STALLED. THE FAILURE RECURRED EACH TIME THE VEHICLE WAS DRIVEN. THE VEHICLE WAS TAKEN TO THE AUTONATION TOYOTA DEALER IN HAYWARD CA, WHERE IT WAS DIAGNOSED, BUT THE TECHNICIAN COULD NOT FIND A FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS ADJUSTING SINCE IT WAS A NEW VEHICLE; HOWEVER, THE FAILURE RECURRED. THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER WHERE THE SAME REASON WAS GIVEN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 10,330.",
        "vin": "4T4BF1FK2GR"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994394,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "6/6/17, 7PM, ON STARTING CAR; IN MALL PARKING LOT, BOTH THE BRAKE AND POWER STEERING ALERT WARNING LIGHTS/MSGS TURNED ON AND STAYED ON. TURNED ENGINE OFF/ON SEVERAL TIMES; ALERTS STILL ON. CHECKED BRAKE FLUID LEVEL AND VERIFIED PARKING BRAKE DISENGAGED. DROVE HOME, AND GARAGED CAR. STARTED/STOPPED ENGINE MANY TIMES, TILL LATE AT NIGHT, BUT ALERTS STAYED LIT. I FLIPPED THROUGH ALL THE ALERT MESSAGES, WHICH SHOWED 2 ALERTS, 1)BRAKE ALERT AND 2)POWER STEERING ALERT. BOTH ALERTS WERE PRESENT NEXT MORNING. PER OWNER BOOKLET, DEALER WANTED CAR TOWED IN.    PREPARED FOR FRONT WHEEL TOW, BY DRIVING FROM GARAGE TO STREET BY TURNING CAR TO FACE STREET AND DRIVING BACK TO DRIVEWAY. AFTER PARKING CAR, BOTH THE ALERT LIGHTS TURNED OFF. MENTIONED THIS TO DEALER. ASKED IF I STILL WANTED TO BRING CAR IN, I SAID YES,  I WANTED IT INVESTIGATED.    6/8/17 DEALER RAN THE DIAGNOSTIC SCAN AND FOUND HISTORY CODE C1441. REPORTED AS \"ABS PERFORMANCE DECLINE AND BRAKE FUNCTION\". THIS CAN BE CAUSED BY \"BRAKE PEDAL BEING PUSHED WHILE MOVE WITH ENGINE OFF, OR PUSHING BRAKE PEDAL AND GAS PEDALS, CONCURRENTLY'. I KNOW NEITHER OF THESE TWO HAPPENED. DEALER ROAD TESTED CAR, FOUND NO RECURRENCES OF THE PROBLEM AND RETURNED CAR.    BACK HOME, FOUND THAT THE 2015 CAMRY ,WITH CODE C1441, HAD A RECALL OF THE BRAKE VACUUM BOOSTER ASSEMBLY (TSB-0010-15). SINCE THE 2016 CAMRY IS ESSENTIALLY THE SAME CAR AS THE 2015 CAMRY, I THOUGHT IT MIGHT APPLY TO THE 2016 MODEL. ABS MALFUNCTION, WITH CODE C1441 IS STILL BEING TRIGGERED, ON THE 2016 CAMRY, WITH THE 2AR... ENGINE.    FOR THE 2016 CAMRY, FOUND BRAKE RELATED PROBLEMS STILL BEING REPORTED, SOME WITH SEVERE ACCIDENTS, POSSIBLY RELATED TO THE ABS OR COMPUTER . SEE NHTSA ID 10991889, 10966112, 10934015, 10915061, 10903212, 10883921, AND 10873023 AS EXAMPLES.    HOPE TOYOTA GETS A CHANCE TO LOOK INTO THIS SAFETY DEFECT, BEFORE A MORE SERIOUS ACCIDENT.",
        "vin": "4T4BF1FK3GR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/27/2017",
        "dateOfIncident": "05/12/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991889,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER OF 2016 WHILE DRIVING BRAKE LIGHTS CAME UP IN 2 PLACES INDICATING CHECK BRAKES. WHEN PUTTING FOOT ON THE BRAKES THEY WENT TO THE FLOOR.  TOOK CAR TO DEALERSHIP, THEY COULD NOT FIND ANYTHING WRONG.  ON MAY 12,2017 LEAVING MY HOUSE I NOTICED BOTH LIGHTS WERE ON INDICATING CHECK BRAKES AND BRAKES.  I LEFT THE DRIVEWAY AND WHEN I CAME TO A STOP THERE WAS A LOUND NOICE COMING FROM THE BARKES AND MY FOOT WENT ALL THE WAY TO THE FLOOR.  I CALLED PAGE TOYOTA CAR WAS TOWED TO DEALERSHIP.  ONCE AGAIN I WAS TOLD THAT THEY COULD NOT FIND A PROBLEM.  A CONSULTANT FROM TOYOTA WAS CALLED IN, USED A COMPUTER TO EXAMINE THE PROBLEM  I WAS TOLD THAT IT WAS MY FAULT I AM DRIVING WITH 2 FEET ONE ON THE BRAKE AND THE OTHER ON THE ACCELERATER.  THAT IS ABSOLUTHLY NOT TRUE.  I WAS TOLD THAT IT IS MY DRIVING THAT IS CAUSING THIS PROBLEM.  IT IS A SEROUS SAFETY ISSUE.  I DRIVE 3 OF MY GRANCHILDREN OFTEN..  I AM NOT COMFORTABLE DRIVING THE CAR.  I AM CONCERNED ABOUT BEING IN AN ACCIDENT OR CAUSING ONE IF I DO NOT HAVE BRAKES TO PROPERLY OPERATE A VEHICLE.",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "03/21/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10971070,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT STOP SIGNS OR TRAFFIC LIGHTS, THE ENGINE WOULD REV CONSIDERABLY & THEN STOP. AS WE APPROACHED OUR DRIVEWAY, THE CAR LURCHED FORWARD, THEN STOPPED. WE GOT TO OUR GARAGE-ENTRY CONTROL BOX & THE CAR LURCHED FORWARD ON OUR PARKING DECK, GOING LESS THAN 5 MPH, & WE HIT A BRICK WALL. WE THEN PUT THE CAR IN REVERSE & IT LURCHED BACKWARDS SO WE STOPPED THE CAR, TURNED IT OFF & CALLED THE POLICE. MY HUSBAND, WHO WAS DRIVING, SUSTAINED CHEST INJURIES (BLACK & BLUE, INJURED STERNUM, MARK ON HIS COLLARBONE FROM THE SEAT BELT NOT RESTRAINING HIM SUFFICIENTLY, DIFFICULTY BREATHING/STANDING/DRESSING/WALKING - GENERAL PAIN & SUFFERING) WHICH WEREN'T VISIBLE TO THE EMTS AT THE TIME & HE DIDN'T NEED TO GO TO THE HOSPITAL ALTHOUGH HIS REGULAR DOCTOR ADVISED HIM TO SEE ANOTHER AT AN EMERGENCY CARE CENTER. I REFUSED HIM MOVING IT ELSEWHERE AS I DIDN'T WANT TO DO FURTHER DAMAGE TO THE CAR OR ANOTHER VEHICLE WHILE WE WAITED FOR THE POLICE. I, AS THE PASSENGER, WAS NOT AFFECTED AT ALL PHYSICALLY. THE CAR WAS TOWED TO OUR DEALERSHIP'S SERVICE CENTER WHERE IT'S BEEN SITTING SINCE 3/21/17 AWAITING A TOYOTA INSPECTION ON APRIL 21ST - WHY IT SHOULD TAKE SO LONG IS INCONCEIVABLE AS IT'S OUR ONLY CAR!",
        "vin": "4T4BF1FKXGR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10971122,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN AN AUTO ACCIDENT ON 4-3-2017.  I WAS PROCEEDING STRAIGHT THROUGH AN INTERSECTION ON A GREEN LIGHT WHEN I WAS T-BONED BY ANOTHER CAR.  THE IMPACT WAS DIRECTLY ON THE DRIVER'S DOOR AND THE SIDE AIRBAG DID NOT DEPLOY.  THE IMPACT WAS HARD ENOUGH TO TOTAL MY CAR.  THE SIDE AIRBAG SHOULD HAVE DEPLOYED.",
        "vin": "4T4BF1FK8GR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/01/2017",
        "dateOfIncident": "03/03/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969871,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR NOT RESPONSIVE.  FROM A MOVING START UNDER 20 MPH, PULLING OUT INTO TRAFFIC OR MERGING.  ACCELERATOR AND MOTOR DOES NOT RESPOND.  THIS HAS BEEN ONGOING SINCE THE CAR WAS BRAND NEW.  CAR HAS TO BE MOVING AND PROBABLY IN SECOND GEAR.  PULLING OUT INTO TRAFFIC AND ACCELERATOR PEDAL ON THE FLOOR NOTHING HAPPENS.  I HAVE BEEN ALMOST HIT SEVERAL TIMES AND HAD TO DRIVE ONTO THE SHOULDER OF THE ROAD TO AVOID AN ACCIDENT.  ENGINE ALSO DOES NOT RESPOND EITHER.  TACHOMOTER REMAINS AT IDLE SPEED.  THIS HAPPENS AT LEAST TWO OR THREE TIMES A MONTH.",
        "vin": "4T4BF1FK1GR"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967750,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM IN ALL SITUATION , MOVING / STATION / .  THE \"SEAT BELT CLICKER\" FOR REAR SEAT  WHICH IS BEHIND THE PASSENGER FRONT SEAT STUCK INSIDE AND IT BECOME VERY HARD TO FASTEN THE SEAT BELT.  WE HAVE TO PULL OUT THE CLICKER FIRST AND THEN FASTEN THE SEAT BELT.",
        "vin": "4T1BF1FK9GU"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/15/2017",
        "dateOfIncident": "03/07/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966112,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING 2-3 MPH, THE BRAKE PEDAL WAS DEPRESSED, BUT FAILED TO OPERATE. THE VEHICLE ALSO LOST ELECTRICAL FUNCTIONALITY AND CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THERE WERE NO INJURIES IN EITHER VEHICLE AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED AND REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 4,000.   UPDATED 06/08/17*LJ *JS",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2017",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959508,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE ATTEMPTING TO TURN RIGHT FROM A STOP LIGHT, THE VEHICLE LOST POWER AND SUDDENLY ACCELERATED, WITHOUT WARNING. THE FAILURE RECURRED APPROXIMATELY THREE TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS WORKING PROPERLY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE WAS NOT REMEDIED. THE FAILURE MILEAGE WAS APPROXIMATELY 3,000. UPDATED 05/05/17 *BF  *AS",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/05/2017",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958691,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER GETTING THE VEHICLE THE AC UNIT WHEN ACTIVATED EMITS A MOLDY SMELL THROUGH THE VENTS. THE VEHICLE NOW HAS 8512 MILES. I FEEL THIS MIGHT BE A CONTRIBUTOR TO ALLERGIC SYMPTOMS",
        "vin": "4T4BF1FK5GR"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/28/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957472,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA CAMRY 2016 TOOK OFF AT HIGH SPEED WHEN ATTEMPTING TO PARK THE CAR.",
        "vin": "1NXBR12E1YZ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/16/2017",
        "dateOfIncident": "04/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CARMAX RESULTS POWERED BY NHTSA STATES RECALL INCOMPLETE. INQUIRY AS OF 1/14/17.  SC DEALER ( BOB RICHARDS-NORTH AUGUSTA SC) STATES RECALL COMPLETED.  NO DATE OR LOCATION PROVIDED DURING CALL OUR CONVERSATION 1/16/2017. FOLLOWED UP WITH ANOTHER DEALER 1/16/17 WHERE RESULTS STILL SHOW INCOMPLETE AS OF 1/16/2017.  TRIED A GEORGIA DEALER 1/16/2017-MILTON RUBIN IN AUGUSTA, GA WHO RESESARCHED AND CONFIRMED A RECALL EXISTS AS OF 1/16/2017.  MY COMPLAINT IS AGAINST BOB RICHARDS IN NORTH AUGUSTA WHERE INACCURATE INFORMATION WAS RECEIVED.  ALTHOUGH THE NORTH AUGUSTA LOCATION IS MOST CONVENTIENT, WE ARE UNCOMFORTABLE WITH TAKING THE VEHICLE TO THEM SINCE THEY ARE NOT AWARE OF A RECALL. WE WILL NOT TAKE THIS VEHICLE TO NORTH AUGUSTA. INSTEAD WE WILL WORK WITH MILTON RUBIN IN AUGUSTA GEORGIA TO COMPLETE THE RECALL SINCE THIS DEALERSHIP PROVIDED CORRECT INFORMATION.",
        "vin": "4T1BF1FKXGU"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937419,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "IN  JULY 2016 I WAS CRESTING THE TOP OF A HILL WHEN ANOTHER VEHICLE PULLED OUT IN FRONT OF ME CAUSING ME TO HIT MY BRAKES. UPON BRAKING AND DECELERATION, I FELT THE CAR MOMENTARILY TRY ACCELERATING THROUGH THE BRAKES. THIS FREAKED ME OUT AND I PULLED OVER TO TRY AND FIGURE OUT WHAT HAD HAPPENED. CHECKED MY FLOOR MAT AND EVERYTHING WAS LOCKED IN PLACE AS IT SHOULD BE. SO I STARTED MY CAR BACK UP, WITH IT IN PARK GAVE IT A LITTLE REV. THAT IS WHEN I NOTICED THAT WHEN THE MOTOR IS COMING BACK DOWN ON THE RPM'S, IT IS ACTUALLY HANGING UP, AND SOMETIMES ACTUALLY JUMPING AT OR AROUND 1500 RPMS. IT DOES IT EVERY SINGLE TIME. I HAVE HAD THE VEHICLE INTO TWO DEALERSHIPS NOW TO BE TOLD NOTHING WE CAN DO. I DON'T BELIEVE THIS IS A SINGLE VEHICLE ISSUE...I AM THE ONLY ONE LUCKY ENOUGH TO HAVE HAD MY CAR MOMENTARILY ACCELERATE THROUGH THE BRAKES AND SAID ANYTHING SO FAR! I HAVE SAT IN NUMEROUS BRAND NEW TOYOTAS WITH THE 2.5L LIKE THE CAMRY AND RAV4 AND EVERY NEW TOYOTA DOES THIS WEIRD RPM JUMP ON THEIR OWN AND ALL THE DEALERS SAID TO ME WAS \"IF THE OTHERS ARE DOING IT ON THE LOT....IT IS OBVIOUSLY NORMAL\" THIS IS NOT NORMAL AND IS AN OBVIOUS FLAW IN THE DESIGN OF SOMETHING IN TOYOTA'S 2.5L ENGINE. I HAVE BEEN TRYING SINCE JULY TO WORK WITH TOYOTA AND HAVE NOW DECIDED TO ESCALATE IT THROUGH THE NHTSA BECAUSE I FEEL THIS IS A HUGE CONCERN AND NEEDS TO BE ADDRESSED!!!!!!  I HAVE TAKEN A VIDEO AND UPLOADED IT TO YOUTUBE. THE LINK IS AS FOLLOWS BELOW.    HTTPS://WWW.YOUTUBE.COM/WATCH?V=K9JUTPQV2U8&T=11S",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/20/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10936497,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE THE VEHICLE WAS PARKED WITH THE ENGINE RUNNING , THE GEAR SHIFTER MOVED FROM THE PARK POSITION INTO THE REVERSE POSITION. THE VEHICLE ROLLED BACKWARDS, RAN OVER THE CONTACT, AND STRUCK A LIGHT POLE IN A PARKING LOT. THE CONTACT WAS INJURED AND REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE'S BLACK BOX WAS EXAMINED BY THE MANUFACTURER. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 5,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "11/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10934015,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN BUMPER TO BUMPER TRAFFIC ON THE BELTWAY GOING BETWEEN 5 -10 MILES PER HOUR ON A DRY ROAD.  WHEN I APPLIED THE BRAKES MULTIPLE TIMES, THE CAR  WOULD NOT STOP AND IT CONTINUED FORWARD UNTIL I REAR ENDED THE OTHER CAR.  WHEN I APPLIED THE BRAKES, I NOTICED THE BRAKE PEDAL BEGAN TO PUMP.  NOT SURE IF THIS WAS THE ABS IN ACTION BUT THE CAR WOULD NOT STOP UNTIL IT REAR ENDED THE OTHER CAR.  ONLY A SCRATCH WAS DONE TO THE OTHER CAR. THERE WAS ADEQUATE SPACE BETWEEN MY CAR AND THE CAR THAT I REAR ENDED AND THERE WERE NO SKID MARKS JUST A COLLISION. BRAKES FAILED ME ON NEW CAR AND WAS TOTALED DUE TO ALL AIR BAGS IN THE CAR DEPLOYING. INTERNET SAYS PREVIOUS CAMRYS HAVE HAD BRAKE FAILURES. I HAVE OWNED 2 CAMRYS THAT I DROVE 9 YEARS AND 16 YEARS AND NO PROBLEM WITH BRAKES. AGAIN A BRAND NEW CAR THAT I HAD FOR 7 MONTHS AND THE BRAKES FAILED ME. I HAVE TRIED TO HIRE A CAR INSPECTOR TO INSPECT THE BRAKES BUT HAVE BEEN UNSUCCESSFUL. THE GOVERNMENT NEEDS TO INVESTIGATES TOYOTA'S BRAKE FAILURES.",
        "vin": "4T1BF1FK8GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "12/06/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933692,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING 30 MPH, THE VEHICLE HESITATED WHILE ACCELERATING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 9,129. UPDATED 02/07/2017*CT     *CN",
        "vin": "4T1BF1FK6GU"
    },
    {
        "components": "SUSPENSION,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10933791,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR NEW 03/16. INVOLVED IN MVA 06/01/16 WHERE WE WERE T-BONED BY A F150 TRUCK AT 30 MPH. THE TRUCK PEELED THE BODY OF CAR OFF THE FRAME FROM WHERE THE PASSENGER DOOR HINGE ALL THE WAY DOWN TO THE REAR PASSENGER DOOR. DAMAGING SENSORS THAT WOULD HAVE DEPLOYED SIDE AIRBAGS. THE DOOR HANDLE FELL OFF, HINGES HAD TO BE REPLACED, TAIL LIGHTS AND HEAD LIGHTS REPLACED, BOTH PASSENGER DOORS AND TIRES REPLACED. WHY DID THE SIDE AIRBAGS NOT DEPLOY? TOYOTA TOLD ME THAT SINCE I HAD THE  OCCUPANT CLASSIFICATION SYSTEM FIXED, THEY ARE NOT TO BE BLAMED. MY CHILD WAS IN THE FRONT SEAT. EVEN AFTER ALL REPAIRS TO THE CAR, WHILE DRIVING OVER 30 MPH, THERE IS A LOUD WIND TUNNEL NOISE GOING THROUGH THE CAR.  *TR",
        "vin": "4T1BF1FK2GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929420,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH THE CRUISE CONTROL ON I APPLIED THE BRAKES AND THE CAR STARTED SPEEDING UP. THIS HAS ISSUE HAS DONE THIS 2 TIMES. IT TOOK ME SEVERAL TIME BY HITTING THE CRUISE SWITCH TO GET IT TO STOP ACCELERATING. I FEEL PROBLEM IS GOING TO CAUSE SOME TO GET INJURED OR POSSIBLY KILLED.  *TR",
        "vin": "4T1BF1K7GU2"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2016",
        "dateOfIncident": "10/27/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SOY BASED COMPONENTS ATTRACTING MICE THAT CAUSE DAMAGE TO WIRING, FILTERS, AND EVEN BLOWER MOTOR. IF THE CRITTERS EAT THRU AIRBAG WIRING THIS COULD BE CATASTROPHIC.",
        "vin": ""
    },
    {
        "components": "VISIBILITY,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916392,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING WITH THE WINDOWS DOWN, THE VEHICLE VIBRATED VIOLENTLY AND PREVENTED THE CONTACT FROM USING THE INTERIOR AND EXTERIOR MIRRORS. THE DEALER WAS AWARE OF THE FAILURE, BUT WAS UNABLE TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 5,422.",
        "vin": "4T1BF1FK3GU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915433,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY AT HIGHWAY SPEED LIMIT THE TIRE BLEW OFF THE RIM . COMPLETELY CAME OFF ONLY LEFT THE SIDE WALLS ALMOST CAUSED THE FATAL COLLISION WHILE CHILDRENS ARE IN THE CAR. BOUGHT THIS CAR FOR CHILDREN TRANSPORTATION FROM HOME TO SCHOOL AND BACK THINK ITS A SAFE CAR. BUT AFTER THIS INCIDENT I CANNOT TRUST THIS CAR FOR THE PURPOSE I BOUGHT  IT FOR . NVERE KNOW WHICH TIRE WILL BLOW OFF THE RIM AND MAY CAUSE FATAL ACCIDENT.",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915435,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAT AT SPEED LIMIT THE TIRE BLEW OFF THE RIM AND ALMOST CAUSED A FATAL ACCIDENT. WHILE CHILDREN IN THE CAR.THE  MIDDLE PART OF THE TIRE COMPLETELY.SEEMS LIKE THESE ARE DEFECTIVE TIRE INSTALLED ON THIS MODEL. I BOUGHT THIS CAR FOR CHILDREN SAFTEY BUT IT DOESNT SEEM LIKE IT WHEN TIRE ARE BLOWING OFF THE RIM. NEXT TIME MAY CAUSE A FATAL ACCIDENT.",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915061,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH RIGHT FOOT ON BRAKE CAR WAS VERY SLOWLY MOVING FORWARD WITH PLAN TO PARK CAR WITHOUT HITTING CEMENT BLOCK. CAR UNEXPECTEDLY AND ABRUPTLY ACCELERATED TO VERY FAST BUT UNKNOWN SPEED. IN SECONDS CAR WENT OVER CEMENT BLOCK AND WAS HEADED DIRECTLY INTO BRICK WALL OF BUILDING THAT WAS 10-15 FEET FROM PARKING SPOT. BREAKS DID NOT RESPOND AND FEARING HITTING THE WALL HEAD ON WHEEL WAS TURNED TO THE RIGHT. CAR STOPPED ACCELERATION EVENT AND RESPONDED TO BREAKING. EVENT OCCURRED IN A MATTER OF SECONDS. VEHICLE HAS 3500 MILES AND HAS HAD NO PREVIOUS PROBLEMS. MATS WERE NOT AN ISSUE. FOOTWEAR WAS FULL SHOE.",
        "vin": "4T4BF1FK7GR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/07/2016",
        "dateOfIncident": "10/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914527,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE AND MY SUNROOF EXPLODED FROM THE INSIDE OUT. NOTHING HIT THE CAR AT ALL TO CAUSE THIS.",
        "vin": "4T1BF1FK1GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913879,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY HYBRID",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED IN TRAFFIC AND FOOT ON BREAK,  CAMRY WAS MOVING FORWARD WHILE MY FOOT FIRMLY ON THE BREAK . I PUSHED EVEN MORE HOWEVER THE VEHICLE WAS MOVING FORWARD AND BREAK WAS NOT EFFECTIVE. FEARING OF HITTING THE CAR INFORMS OF ME I QUICKLY PUSHED THE GREAT FROM DRIVE TO PARK POSITION. VEHICLE CAME TO STOP 1 INCH FROM FRONT CAR REARE BUMPER. THIS WAS ON CITY STREET IN SAN FRANCISCO ABOUT 200 YARDS FROM 80EAST ENTRANCE, NO RAIN, ABOUT 70 DEGREE 6:45 PM. AFTER PUSHING THE GEAR TO PARK I TURN OFF THE VEHICLE AND START IT BACK UP. I FELT THE BREAK PEDAL GETTING HARDER  AND  BREAK WAS FIRM AND PUT THE VEHICLE ON THE DRIVE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "09/11/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906068,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING APPROXIMATELY 40 MPH, THE SUN ROOF EXPLODED WITHOUT IMPACT FROM THE INSIDE. GLASS PARTICLES EMITTED OUTSIDE OF THE VEHICLE. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE SUN ROOF NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4T1BF1FK5GU"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/02/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10903212,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2016 TOYOTA CAMRY. WHILE DRIVING 30 MPH, THE ACCELERATOR PEDAL BECAME STUCK IN THE DEPRESSED POSITION AND THE VEHICLE ACCELERATED TO 80 MPH. THE BRAKE PEDAL FAILED TO RESPOND AND THE VEHICLE CRASHED INTO A POLE. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A FRACTURED STERNUM THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED AND DEEMED DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 6,700.",
        "vin": "4T1BF1FK8GU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883921,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PURCHASED 3/16 WITH NO PROBLEMS UNTIL WE WENT ON VACATION 6/16 WITH ABOUT A 1200 MI ONE WAY DRIVE. UPON ARRIVAL WE NOTICED THAT AT LONG STOPLIGHTS THE BRAKE WAS GOING TO THE FLOOR. AFTER HAVING THIS HAPPEN SEVERAL TIMES THE CAR WOULD ACTUALLY START MOVING WITH THE PEDAL DOWN ON THE FLOOR. PUMPING THE BRAKES WOULD BRING THE PRESSURE BACK UP, BUT THE PEDAL WOULD STILL CREEP TO THE FLOOR ON STEADY PRESSURE. AFTER A VERY SCARY RIDE HOME THRU THE MOUNTAINS THE CAR WAS TAKEN TO THE DEALER. SERVICE MGR VERIFIED PEDAL PROBLEM AND SAID THAT A TOYOTA REP WOULD HAVE TO VERIFY PROBLEM. IT HAS BEEN 2 WEEKS THE REP HAS SAID THAT THE CAR IS IN PERFECT SHAPE. BOTH THE DEALER AND TOYOTA REFUSE TO DO ANYTHING TO FIX IT. STRANGE BUT TOYOTA HAS THE EXACT PROBLEM LISTED IN THE OWNERS MANUAL AS AN ITEM THAT NEEDS TO BE FIXED ASAP LISTED IN 2 PLACES.",
        "vin": "4T4BF1FKXGR"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10882537,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS HEADED TO WORK WHEN A 16 YEAR OLD DRIVER DID NOT MAKE A COMPLETE STOP AT THE STOP SIGN AND PRECEDED TO CROSS THE ROAD WINTER GARDEN - VINELAND RD AS  MY HUSBAND COMING STRAIGHT DOWN THE ROAD TRIED TO AVOID HITTING HER BUT COULD NOT, HITTING HER ON THE BACK DRIVERS SIDE OF HER CAR. THE IMPACT TO THE FRONT OF OUR CAR WHICH BROKE A ROD BENT IN THE TIRE SMASHED THE DRIVERS FRONT SIDE ALSO BENDING THE HOOD, BUT THE AIR BAGS DID NOT DEPLOY WITH THAT IMPACT I AM WONDERING WHY DIDN'T THEY DEPLOY?",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2016",
        "dateOfIncident": "05/31/2016",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874188,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. THE CONTACT STATED THAT THE ENGINE BURNED AN EXCESSIVE AMOUNT OF OIL AND EMITTED A BURNING ODOR. ONCE THE ENGINE WAS STARTED, THE CONTACT NOTICED OIL LEAKING FROM THE ENGINE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 12,000. ...UPDATED 09/15/16 *BF  CONSUMER STATED REPLACEMENT OR BUY OUT IS STILL IN PROCESS UPDATED 6/7/18*JB  CONSUMER STATED HE NOTIFIED DEALER AFTER CALLING NHTS AND STARTED THE PROCESS. INCLUDED IS THE COURSE OF THIS PROBLEM AND LACK OF FIXING AS OF 08/31/16.  UPDATED 06/12/18 *JB",
        "vin": "4T1BD1FK8GU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "05/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE WEEKS AGO I PURCHASED A CAMRY XSE.  AND, LAST THURSDAY I READ IN THE NEW YORK TIMES THAT IT MAY HAVE DEFECTIVE AIR BAGS.  ISN'T THAT A SCAM?  THE DEALERSHIP EVEN SAID THAT THE AIRBAG PROBLEM HAD BEEN TAKEN CARE OF.  I WAS ALREADY UNHAPPY BECAUSE IN ORDER TO GET \"CRASH WARNING, BLIND SIDE FEATURES\" I HAD TO TAKE THE MOST EXPENSIVE MODEL.  ISN'T THERE ANY PROTECTION FOR BUYERS?  I HAVE FRIENDS WHO HAVE WAITED FOR MONTHS TO HAVE THEIR CARS UPDATED AND NOW I MAY HAVE BEEN SOLD ONE THAT WAS SOLD KNOWINGLY DEFECTIVE.  WHAT HELP OR ADVICE CAN YOU GIVE?  THANK YOU,  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "TAKATA RECA"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873023,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO DECELERATE. IN ORDER TO STOP THE VEHICLE, THE BRAKE PEDAL HAD TO BE DEPRESSED WITH FORCE. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 10.",
        "vin": "4T4BF1FK3GR"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/05/2016",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872561,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WE HEAR CONSTATNT ROAD NOISE COMING INSIDE THE CAR FROM THE DAY 1 SINCE WE BOUGHT THE NEW CAR. I FOUND FROM ALL OTHERS THAT  THEY ALL HAVE SIMILAR PROBLEM WE CANNOT HEAR RADIO OR ANY TALKING INSIDE THE CAR. SOMETHING IS MISSING IN THE FIREWALL OR UNDERNEATH INSULATION.",
        "vin": "4T1BD1FK0DU"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/07/2016",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863712,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A NEW 2016 CAMRY SE WITH 417 MILES ON IT AND WHILE DRIVING ON THE HWY (TAMPA, FL) THE RIGHT FRONT TIRE WENT FLAT WITH NO PRESSURE WARNING. I PULLED OVER WITH IN SECONDS AND I HAD TO CHANGE THE TIRE. THERE WERE BULGES IN SEVERAL AREAS OF THE TIRE. I WANT BRIDGETON TO REPLACE MY TIRE FOR FREE. THIS IS A POOR QUALITY TIRE AND I SUSPECT THE OTHER TIRES MAY FAIL ALSO AND WILL NEED TO HAVE THE DEALER INSPECT ALL OF THEM.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 TOYOTA CAMRY.  CONSUMER WRITES IN REGARDS TO VEHICLE DID NOT RESPOND AFTER GAS PEDAL WAS PRESSED AND CONSUMER HAD TO HIT BRAKES QUICKLY TO AVOID AN ACCIDENT.  *SMD  THE VEHICLE WAS SERVICED AT THE DEALER. THEY STATED THE PROBLEM WAS THE TRANSMISSION SEARCHING FOR A GEAR, WHILE IT HESITATED AND IT WAS DESIGNED TO RESPOND THAT WAY. *JB",
        "vin": "4T1BF1FK7GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/17/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859974,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN THIS CAR FROM NOV 2015. I PARKED CAR AND GOT OUT, A SMALL WIND CAUSED THE DOOR ON THE DRIVER SIDE, OPEN TOO MUCH (I HAVE NEVER SEEN A CAR-DOOR OPENING THAT MUCH, THOUGH I OWNED MORE THAN 18 CARS IN 40 YEARS OF DRIVING IN US ROADS. IT WENT AND HIT AGAINST THE CAR PARKED ADJACENT NORMALLY THAT DOOR SHOULD NOT OPEN THAT WIDE, BECAUSE THERE MORE  THAN NORMALLY HAS. I THINK IT HAS SOME PROBLEM WITH THE HINGE NOT HOLDING ENOUGH TO PREVENT THAT WIDE OPEN. IT WENT TO HIT THE MIRROR OF OTHER VEHICLE AND CAUSED DENT IN MY CAR. IT IS THE FIRST TIME THE DOOR WENT OUT THAT FAR.",
        "vin": "4T4BF1FK5GR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853745,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LIGHTS DO NOT ILLUMINATE WHEN THE ADAPTIVE CRUISE IS ON AND THE VEHICLE IS SLOWED BY BRAKING MANEUVERS PERFORMED BY THE ADAPTIVE CRUISE WHEN A CAR TURNS INTO THE LANE AHEAD.  FOR EXAMPLE, THE CAR MAY SLOW RAPIDLY 10-15MPH AND NO BRAKE LIGHTS WILL TURN ON.  THIS MAY INCREASE THE RISK OF A CRASH AS A RESULT OF NO WARNING TO THE CAR IMMEDIATELY BEHIND ME.  THIS WAS CONFIRMED TODAY BY TOYOTA WHO INVESTIGATED AND STATED (GEORGE) THE BRAKE LIGHTS ONLY COME ON IN THE EVENT OF AN IMMINENT CRASH (IN FRONT), DESPITE THE FACT THAT THIS CREATE A PROBLEM FOR THE DRIVER BEHIND.",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "03/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853011,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA ALIGNMENT HAS RECENTLY SHIFTED LOWER, WHICH NARROWS AND DISTORTS THE VISUAL FIELD DUE TO THE ANGLE CHANGE.  DEALER CLAIMED IT IS NORMAL.",
        "vin": "4T4BF1FK1GR"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "02/28/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851144,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2016 CAMRY LE FROM MY LOCAL TOYOTA DEALERSHIP ON 02.21.2016. ON 02.29.2016, I RETURNED TO THE DEALERSHIP WITH THE PROBLEMS I WAS FACING WHILE DRIVING THIS CAR,  PRIMARILY: SLOW-DRAGGING ACCELERATION ALONG WITH TRANSMISSION SHIFTING INSTABILITY.     WHILE DRIVING TO DROP MY WIFE TO WORK ON THE MORNING OF 02.28.2016 I BEGAN NOTICING INCONSISTENCIES IN MY VEHICLE'S ACCELERATION.  AS THE TRAFFIC LIGHT (EXITING MY SUBDIVISION) TURNED GREEN, I PRESSED THE GAS PEDAL AND IMMEDIATELY FELT HESITATION IN THE ACCELERATION ALONG WITH STIFFNESS IN THE STEERING WHEEL, GIVING THE CAR A  HEAVY/DRAGGING FEELING (EVEN AFTER ATTEMPTING TO APPLY EXTRA PRESSURE ON THE GAS PEDAL). AFTER DRIVING IN THIS SLUGGISH CONDITION FOR ABOUT A QUARTER-MILE, I FELT A BOOST IN MY CAR'S ACCELERATION, CAUSING A SUDDEN INCREASE IN SPEED FORCING ME TO APPLY MY BRAKES TO REGAIN CONTROL OF MY CAR'S MOVEMENT. THROUGHOUT THE REMAINDER OF THE DAY I KEPT EXPERIENCING THIS FLUCTUATION IN ACCELERATION (BOOST/SLUGGISH) WITH NORMAL DRIVING FUNCTIONS RETURNING PERIODICALLY.    THE FOLLOWING DAY I TOOK MY CAR IN TO THE DEALERSHIP TO BE CHECKED. ACCORDING TO THE SERVICE DEPARTMENT, \"VEHICLE IS OPERATING AS DESIGNED\"; WHEREAS, THE ABOVE MENTIONED COMPLAINT IS STILL ONGOING.     MULTIPLE FAILED ATTEMPTS TO REACH A RESOLUTION THRU MANAGEMENT AND CUSTOMER RELATIONS AT THE DEALERSHIP THUS FAR HAVE FORCED ME TO CONTINUE TO DRIVE MY NEW CAR IN THIS CONDITION TO BE ABLE TO FULFILL PERSONAL/FAMILY REQUIREMENTS (AS THIS IS THE ONLY CAR I HAVE). THIS HAS BEEN CAUSING ME A GREAT DEAL OF STRESS AND MENTAL ANGUISH IN REGARDS TO MY NUMBER ONE CONCERN: \"SAFETY\". NOT ONLY DO I FEEL UNSAFE PUTTING MY LIFE AT RISK WHILE DRIVING THIS CAR, I ALSO FEEL UNCOMFORTABLE RISKING THE SAFETY OF MY FAMILY/PASSENGERS AND OTHER DRIVERS ON THE ROAD AROUND ME, AS THIS MECHANICAL DEFECT REMAINS PERSISTENT AND IS GRADUALLY WORSENING.",
        "vin": "4T4BF1FK3GR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/04/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839874,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2016 TOYOTA CAMRY. WHILE DRIVING ON A DARK ROAD, THE HEADLIGHTS ILLUMINATED DIMLY AND MADE IT DIFFICULT FOR THE CONTACT TO SEE THE ROAD. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,800. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2016",
        "dateOfIncident": "11/28/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817341,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLIND SPOT MONITORING SYSTEM HAS FAILED 3 TIMES IN SINCE I PURCHASED THE VEHICLE ON NOVEMBER 23 2015.  THE VEHICLE HAS BEEN IN THE REPAIR 3 SEPARATE TIMES AND IS ABOUT TO GO INTO REPAIR FOR THE FOURTH TIME.   THE DEALER HAD THE VEHICLE FOR 4 DAYS THE LAST TIME AND THE ISSUE STILL HAS NOT BEEN REPAIRED.  WHEN THE BLIND SPOT MONITORING SYSTEM FAILS IT STOPS WORKING ENTIRELY.   THIS HAPPENS TO THE VEHICLE WHILE DRIVING, THE BLIND SPOT MONITORING SYSTEM STOPS WORKING.  THE VEHICLE IS A 2016 TOYOTA CAMRY XLE WITH 1074 MILES ON IT.  THE DEALER DOES NOT KNOW HOW TO FIX THIS, AND NEEDS FURTHER SUPPORT DIRECTLY FROM TOYOTA USA TO RESOLVE THE ISSUE.  I'VE INCLUDED 3 PHOTOS OF THE ERROR MESSAGE THAT APPEARS ON THE MESSAGE CONSOLE.",
        "vin": "4T1BF1FK0GU"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2015",
        "dateOfIncident": "11/05/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806374,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATIONS BETWEEN 35 AND 55 MPH WHEN DRIVING.TOYOTA IS WORKING ON IT.",
        "vin": "4T4BF1FK7GR"
    }
]