[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/20/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429883,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "I have now had to replace 4 cracked rims on my S80.  (First 1/9/1991, Second 2/18/21, Third 4/28/21 and Fourth 8/19/21). Prat number 30758060-5 Aluminium Rim S 71.  How was your safety or the safety of others put at risk? As the air leak out of the tire the car became unsafe to drive. Has the problem been reproduced or confirmed by a dealer or independent service center?  Yes Volvo Mitchell Auto Group. Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others?  Yes Volvo Mitchell Auto Group.  Were there any warning lamps, messages or other symptoms of the problemprior to the failure, and when did they first appear? Yes the tire light come on. This is the fourth Volvo I have owned and I have never cracked rim on them or any other car I have owned",
        "vin": "YV140MAK6G1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/22/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182746,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ALONE IN THE RAIN FROM SPOTSYLVANIA, VA TO CLEMSON, SC TO ATTEND MY DAUGHTER'S NURSING WHITE COAT CEREMONY, OUR 2016 S80 SUNROOF EXPLODED AND SHATTERED ON I-85 SOUTH NEAR KANNAPOLIS, NC FOR NO REASON.   THE TIME OF INCIDENT WAS AROUND 11:15AM.   IT HAD BEEN RAINING AND TRAFFIC WAS STOP AND GO ON I-85 WITH SPEEDS ABOUT 30-35MPH WHEN THE SUNROOF SUDDENLY EXPLODED, SENDING PIECES OF THE SHATTERED GLASS FLYING OFF BEHIND MY CAR WITH SMALLER SHARDS OF GLASS COMING DOWN THROUGH THE INSIDE SUNROOF RETRACTABLE VENT WITH DROPS OF RAIN. I IMMEDIATELY PULLED INTO THE FAR RIGHT LANE TO GET OFF HWY TO ACCESS THE DAMAGE AND FIND SOME COVER AS IT WAS RAINING AND COMING INSIDE SUNROOF. I HAD NO IDEA WHERE I WAS OR WHAT STATE I WAS IN UNTIL I PULLED OFF THE EXIT AND IMMEDIATELY FOUND A SHELL GAS STATION WHICH ALSO HAD AMPLE ROOF COVER.   I GOT OUT AND SAW THAT MORE THAN HALF OF OUR SUNROOF WAS MISSING AND THERE WERE TINY PIECES OF GLASS LAYING ON TOP OF THE INSIDE PART OF SUNROOF AND ALONG THE BACK PART OF THE ROOF AND TRUNK. I CALLED OUR AUTO INSURANCE COMPANY, USAA, AND THEY TOOK CAR OF THE REST.",
        "vin": "YV140MAM3G1"
    }
]