[
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/19/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458770,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Random engine hesitancy reducing acceleration while driving.  Vehicle maintained by the dealer for all scheduled maintenance and service visits.  Within 30 days of a manufacture's repair that dealt with the HVAC and air filter AND a service visit to change oil and rotate tires, the hesitancy during driving was more pronounced.  The dealer's service center stated the air filter was flooded from an HVAC leak and a clog.  I have found similar owners have had problems like this and VW will not address it systemically.  I otherwise enjoy my vehicle, but am concerned that it will not accelerate when needed and is potentially dangerous without warning. It should not take loss of life or property to have this corrected.",
        "vin": "WVGEF9BP3GD"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451182,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "There was a big rain last week locally. I drove through a couple big puddles but nothing that's super uncommon for the area. Almost immediately, my car's electric components started going crazy. ACC stopped working completely. Lane assists aren't working. There was an error that I think was shift lock, but it was red, and the car was driving really weird.",
        "vin": "WVGEP9BP3GD"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/24/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441626,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "Electronic Parking Brake lever light was flashing and dashboard showed parking brake error message. Drove car to VW Dealership, which diagnosed problem as likely bad Parking Brake Control Module (Part J540). Dealership ordered part, and stated I could drive car home. Within 1 mile of dealership, parking brake engaged automatically abruptly slowing car and error flashed on dash stating \"Disengage Parking Brake.\" Pulled over, turned car off and back on, which disengaged parking brake. Returned to dealership and left car until it could be repaired. Had I been on the interstate traveling at a higher rate of speed, this may have caused an accident.",
        "vin": "WVGEF9BP9GD"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428041,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "NTHSA folks,  Two months ago, I began getting an \"Error Airbag\" amber warning in the Touareg's driver-information display. I visited the dealer and was told \"the airbag module\" (volkswagen-2016-volkswagen-touareg-control-module-7p0959655g08p) was the issue. I was told they'd order the part, only to hear back later: \"There are none in the U.S. and it'll take 5-8 weeks to get one from. Europe.\" This has since been updated with \"We have no idea if or when this part will be available.\"  As a consequence, it appears I must simply wonder whether the airbags will deploy if needed, which strikes me (no pun intended) as irresponsible on VW's end, particularly since it concerns a safety-related failure.  Indeed, if this part is so unavailable, it would seem that either many owners are experiencing the same problem, or the problem is extremely rare. (I believe it's the former.)  Anyway, I bring this to NHTS' in the hope of getting clarification and/or assistance. And ideally helping find a way to restore full airbag functionality.  Thank you for your time.  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "WVGEP9BP9GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "06/20/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421686,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 Touareg was towed to OStein VW service after engine would not accelerate and ran rough when got onto the interstate.  OStein VW diagnostic was water into the air filter that got into engine and now need to replace engine block because of water getting into the air filter from the rain drain system system getting clogged for the Touareg. VW Service says can hear engine valves chattering.  I see at NHTSA that at least 60 other complaints have been filed about this problem of water getting into the air filter.",
        "vin": "WVGEF9BP1GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "05/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418651,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "There is an ongoing issue with the drain from the air cleaner box clogging and water collecting in the box and then being ingested into the engine.  On other occasions I had drained water from the box and changed the wet air filter to a dry one.  Today (5/26/2021) I pulled out of my driveway and car started stalling.  I got a transmission fault notification and immediately returned to my home.  After raising the hood I noticed a noise from the left side of the engine bay and checked the drain for the air cleaner box.  It was of course clogged.  I opened the air cleaner box and approximately 6\" of water ran out of the box.  I restarted the engine and no longer had a transmission fault but an engine management warning.  The engine while running was running roughly.  I contacted the nearest VW dealership and they stated that this was a known issue, that there was no recall, that VW had come up with a \"fix\" for the issue and that, of course it was not covered under the powertrain warranty.  The vehicle is not driveable and will be towed to the dealership for diagnosis and repair.",
        "vin": "WVGEF9BP2GD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11396521,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY AS A COLD FRONT APPROACHED, OUTSIDE TEMPERATURE DROPPED TO 17 DEGREES. ALL OF A SUDDEN WE HEARD A LOUD SOUND, LIKE A GUNSHOT AND IMMEDIATELY GLASS FELL ON OUR HEADS. THE SUNROOF HAD EXPLODED FOR NO APPARENT REASON AS THERE WERE NO OTHER VEHICLES AROUND US. IT WAS A SCARY INCIDENT WITH MY FAMILY ONBOARD. ONLY MINOR GLASS CUTS WERE SUFFERED, MOSTLY ON THE HANDS AND WE WIPED THE GLASS PIECES OFF OURSELVES. OUR DRIVING SPEED WAS APPROXIMATELY 75 MILES/HOUR, THROUGH OPEN FIELDS (NO BUILDINGS OR CONSTRUCTION NEARBY) ON A STRAIGHT STRETCH OF HIGHWAY.",
        "vin": "WVGEP9BP1GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390252,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INTERMITTENTLY LOSES POWER WHEN ACCELERATING. WOULD DESCRIBE THE FEELING AS RANGING FROM A SHUDDER OR \"HICCUP\" TO A DROPPING SENSATION. OCCURS AT ANY POINT OF ACCELERATION - WHETHER FROM LOW RATE OF SPEED TO HIGH (AS IN ENTRANCE RAMP ACCELERATION) OR FROM CRUISING SPEED TO HIGHER CRUISING SPEED (AS WHEN SPEED LIMIT INCREASES). IDENTIFIED THIS SENSATION WITHIN WEEKS OF TAKING DELIVERY OF VEHICLE AND IT HAS CONTINUED.",
        "vin": "WVGEF9BP3GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376147,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE AIR FILTER COMPARTMENT FILLS WITH WATER UNDER NORMAL, IN-MOTION OPERATING CONDITIONS, LEAVING A SPONGY, MOLDY MESS OF THE AIR FILTER AND EXTREMELY POOR ENGINE PERFORMANCE AS WELL AS ENGINE OVERHEATING DURING SUMMER MONTHS.  HAVE REPLACED THE FILTER REPEATEDLLY.  THIS IS A SERIOUS AND DANGEROUS DESIGN FLAW.",
        "vin": "WVGEF9BP4GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365465,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 18,293 MILES THE VEHICLE ENTERED \"LIMP MODE\" WHILE UNDER NORMAL DRIVING CONDITIONS. THE PROBLEM WAS DIAGNOSED AS THE ENGINE AIR FILTER BEING SATURATED WITH WATER DUE TO A CLOGGED AIR BOX DRAIN HOLDING WATER. AT  26,054 MILES, THE FILTER WAS AGAIN FOUND TO BE SATURATED WITH WATER. THIS REQUIRED REPLACEMENT OF THE AIR FILTER A SECOND TIME. NORMAL AIR FILTER REPLACEMENT IS RECOMMENDED AT 60,000 MILES. AT LAST REPLACEMENT, VW DEALER \"MODIFIED\" THE AIR BOX DRAIN TO IMPROVE DRAINAGE",
        "vin": "WVGEP9BP2GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/12/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360845,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS LEFT PARKED ON MY DRIVEWAY FOR 4 DAYS, DURING SO HEAVY RAINSTORMS PASSED OVER MY AREA. WHEN I WENT TO GO START THE CAR AFTER 4 DAYS, A SUNNY DRY DAY FINALLY, ITS SPUTTERED AND SUFFOCATED WHEN STARTING UP. HAVING HEARD THESE VEHICLES HAVE WATER PROBLEMS WITH THE AIR INTAKE FOR THE ENGINE I IMMEDIATELY SHUT OFF THE CAR. WHEN I OPENED THE AIR FILTER HOUSING THERE WERE ABOUT 2 INCHES OF WATER IN THE HOUSING THAT UNDOUBTEDLY GOT SUCKED INTO MY ENGINE WHEN IT WAS STARTED. WITH THE VEHICLE, NOT BEING DRIVEN AT ALL DURING THE RAIN, HEAVY SPRAY FROM THE ROAD OR OTHER CARS CAN BE RULED OUT AS A CAUSE AND I FIGURE THERE MUST BE A DEFECT IN THE SEAL OR DESIGN OF THE AIR INTAKE. ESPECIALLY, SINCE VW CHINA RECALLED THESE VEHICLES FOR THE EXACT SAME ISSUE EARLIER THIS YEAR. ADDITIONALLY, THE CAR WAS PARKED ON A TYPICAL INCLINED DRIVEWAY ABOUT 8 FEET IN FRONT OF THE GARAGE DOOR, IN NO PRECARIOUS POSITION. NOW THE VEHICLE CONTINUES TO SPUTTER AND LOSE REVS WHEN STARTING UP.",
        "vin": "WVGEF9BP6GD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2020",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341088,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF LEAKS AND WATER ACCUMULATES IN THE SPARE TIRE WELL PLUS GROWS MOLD MAKING THE VEHICLE UNSAFE TO DRIVE",
        "vin": "WVGEP9BP7GD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "06/23/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330385,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF LEAKING MOISTURE INTO CAR AND VW REFUSES TO REPAIR UNDER WARRANTY.  MOLD GROWING IN A ENCLOSED ENVIRONMENT COULD BE TOXIC.  AFTER DEALER RETURN MY VEHICLE FROM ANOTHER PROBLEM THAT STILL ISN'T FIXED, AFTER HAVING IT PARKED ON THEIR LOT 17 DAYS, I IMMEDIATELY NOTICED MOISTURE IN THE VEHICLE.  THIS TIME THE DEALER HAS HAD IT 8 DAYS AND COUNTING AND REFUSES TO FIX THE SUNROOF DRAINS.  *TR",
        "vin": "WVGEP9BP7GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330102,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER FROM RAIN ENTERS THE AIR FILTER HOUSING WHILE PARKED OUTSIDE, AND SOAKS THE AIR FILTER AND DOESN'T DRAIN SO THE ENGINE INGESTS WATER AND HYDROLOCKS WHEN PULLING OUT INTO TRAFFIC.   VOLKSWAGEN REFUSES TO WARRANTY THIS KNOWN PROBLEM. CAR HAS 1600 MILES ON IT. BOUGHT NEW MAECH 2018. 40 DAYS OUT OF SERVICE SO FAR.  *TR",
        "vin": "WVGEP9BP7GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IN ENGINE AIRBOX.  NOTICED AIR FILTER SATURATED WITH WATER WHEN CHANGING AT 21,000 MILES.  APPEARS TO BE A KNOWN PROBLEM THAT IS NOT BEING ADDRESSED BY VW IN THE US.",
        "vin": "WVGEP9BP0GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308050,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO A ENGINEERING FAULT WATER IS A GETTING INTO THE AIR INTAKE AND SOAKING THE BOTTOM OF THE AIR INTAKE WHERE ITS DETERIORATING THE FILTER AND ALSO ENDANGERING THE ENGINE OF SUCKING UP WATER AND HYDROLOCKING. THIS IS A KNOWN ISSUE AND HAS CAUSED OTHER VEHICLES OF THIS MAKE AND MODEL TO LOCK UP AND DISABLE THE ENGINE. IT IS NOT DUE TO DRIVING THROUGH WATER BUT SIMPLY FAULTY ENGINEERING THAT ALLOWS WATER TO FLOW FROM THE FRONT OF THE CAR DOWN INTO THE AIR INTAKE.",
        "vin": "WVGEP9BP1GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307948,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER GETS INTO AIR TAKE SYSTEM.  TOOK VEHICLE TO DEALER FOR CAR WASH AND ALSO PURCHASED A AIR FILTER.   CAME TO REPLACE AIR FILTER AND OLD FILTER WAS DAMAGED AND WATERLOGGED.",
        "vin": "WVGEF9BP2GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288144,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY AIR INTAKE SYSTEM ALLOWS WATER TO BE INGESTED. AIR FILTER BECOMES SOAKED WITH WATER, AND WILL ULTIMATELY FAIL IF LEFT UNCHECKED. BITS OF SOGGY FILTER MEDIA WILL DAMAGE TURBOCHARGER AND POSSIBLY RECIPROCATING COMPONENTS REQUIRING ENGINE REPLACEMENT. ENGINE CAN FAIL AT ANY TIME WITHOUT WARNING, CAUSING AN UNSAFE CONDITION. WATER INGESTION CAN OCCUR WITH VEHICLE STATIONARY OR BEING DRIVEN IN WET CONDITIONS. THIS IS OCCURING IN LIGHT RAIN, AND VEHICLE HAS NOT BEEN DRIVEN THROUGH STANDING WATER.",
        "vin": "WVGEP9BP9GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269082,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT RAINS HEAVILY, MY TOUAREG AIR FILTER IS VERY EASY TO GET INTO THE WATER. I CHECKED THE INFORMATION ON THE INTERNET, IT SAID IN OTHER COUNTRIES, THERE ARE LOTS OF REPORTS THAT THE SAME MODEL OF IMPORTED TOUAREG HAS LOST THE POWER ON FREE WAY BECAUSE OF THE WATER FILTER ENTERING THE WATER.",
        "vin": "WVGEF9BP1GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "09/16/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256613,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE WAS DAMAGED AND BROUGHT TO THE DEALERSHIP. THE DEALER IS SUGGESTING I HAVE GOTTEN WATER IN THE INTAKE BOX AND THE DRAIN WAS CLOGGED RESULTING IN ENGINE DAMAGE. THEY ARE ASKING THAT I PAY FOR THE DAMAGES AND I BELIEVE IT IS A DESIGN FLAW. THIS WAS A RECLASS BY VW GLOBALLY BUT NOT IN AMERICA.",
        "vin": "WVGEP9BP3GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/07/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243552,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE IN RAINSTORM AND CAR SHUT OFF AND CAME TO A COMPLETE STOP. COULD NOT START BACK UP.  AFTER SERVICE INSPECTION, I WAS TOLD THAT THE ENGINE INGESTED A SUBSTANTIAL AMOUNT OF WATER AND THE ENGINE WOULD NEED REPLACED.",
        "vin": "WVGEF9BP0GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242301,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CAME ON AFTER DRIVING THREE MILES IN DRY WEATHER. AFTER SEEING RECALLS IN CHINA ABOUT WATER ENTERING THE AIR FILTER BOX AND SAW THAT THE BOTTOM .25% WAS SOAKED. SAW MANY OTHER TOUAREG OWNERS ON FORUMS WITH SAME PROBLEM. DEALER TOWED VEHICLE IN AND FALSELY CLAIMED CAR WAS SITTING IN WATER. RESET THE ENGINE CODE AND CHARGED ME $50+ FOR A NEW AIR FILTER AND DELIVERED THE CAR BACK TO ME, WITH THE ENGINE LIGHT STILL ON. I'VE CALLED THE SERVICE MANAGER AND WAITING ON A CALL BACK.",
        "vin": "WVGEP9BP7GD"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231894,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 VOLKSWAGEN TOUREG  (VIN # XXXXXX) PURCHASED 5/25/2019.  VROOM ASSURED ALL VEHICLES UNDERGO RIGOROUS INSPECTION AND  WRITTEN GUARANTEE OF A CLEAN TITLE / NO FLOOD DAMAGE.  THE VEHICLE WAS DELIVERED  ON 6/17/2019.  ON 6/18/2019 THE VEHICLE WAS TAKEN TO A MECHANIC FOR A STANDARD PREPURCHASE INSPECTION. I PAID $150.64 FOR THIS SERVICE.     THE INSPECTION REPORT RETURNED SEVERAL AREAS OF INTERNAL RUST IN THE VEHICLE THAT WOULD ONLY BE CAUSED BY SITTING IN WATER FOR EXTENDED AMOUNT OF TIME, AS WELL AS OTHER CONDITIONS CLEARLY INDICATIVE OF FLOOD DAMAGE.  THE VEHICLE ALSO HAD VISIBLE RUST ON THE INTERIOR OF ALL FOUR WHEELS, WHICH IS OBVIOUS INDICATOR OF A FLOODED VEHICLE. WE CONTACTED THE COMPANY ON 6/19/2019 TO LET THEM OUR INTENTION TO RETURN THE VEHICLE AND PROVIDED A COPY OF THE INSPECTION REPORT. WE HAD NO ISSUE RETURNING THE VEHICLE AS WE WERE WELL WITHIN THE 7 DAY RETURN POLICY (CAN RETURN THE VEHICLE WITHIN 7 DAYS FOR ANY REASON). WE SPOKE TO MULTIPLE INDIVIDUALS DURING THE RETURN PROCESS, AS EACH STEP REQUIRED A DIFFERENT DEPARTMENT.  ULTIMATELY, THE VEHICLE WAS PICKED UP BY VROOM AND WE SPOKE TO AN INDIVIDUAL OVER THE PHONE TO GO OVER THE RETURN PROCESS AND ISSUE OUR REFUND. THE CONTACT WE SPOKE TO INDICATED THAT THEY DID NOT FIND THE VEHICLE DAMAGED, AND STATED THEY WOULD LIST THE REASON FOR THE RETURN AS 'PREFERENCE' (ALLOWING THEM TO SELL THIS DAMAGED VEHICLE TO SOMEONE ELSE).  THE REASON FOR THIS COMPLAINT IS TO HAVE A RECORD OF THAT THIS VEHICLE, VIN # (XXXXXX) HAS BEEN DAMAGED BY WATER AND IS NOW BEING ATTEMPTED TO BE SOLD AS A CLEAN TITLED CAR TO AN UNSUSPECTING CONSUMER. AS OF 7/15/2019, THIS VEHICLE IS CURRENTLY LISTED FOR SALE BY VROOM IN STAFFORD, TX.    REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "WVGEF9BP0GD"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/29/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228842,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A RAIN STORM AND WITH MY WIFE DRIVING ON A BUSY NEIGHBORHOOD THROUGHWAY OUR 2016 VW TOUAREG LOST ALL POWER FROM THE ENGINE AND POWER STEERING. SHE WAS FORCED TO STOP ON THE SIDE OF THE ROAD AND PUSH THE CAR TO SAFETY. UPON RESEARCH WE LEARNED ABOUT A PROBLEM WITH WATER GETTING INTO THE AIR FILTER AND SUBSEQUENTLY INTO THE MOTOR. THE NEXT DAY, AFTER THE RAIN CLEARED I UNLATCHED THE AIR FILTER AND FOUND WATER POURING OUT OF THE FILTER BOX AND HAD COMPLETELY SATURATED THE AIR FILTER TO THAT OF A SOAKING WET SPONGE. I HAVE TOWED THE TOUAREG TO THE DEALERSHIP AND AM AWAITING THE DIAGNOSTICS. HOW COULD SUCH A SIMPLE FLAW REMAIN SUCH A MAJOR ISSUE WITH OUT ANY ACTION FROM VOLKSWAGEN? I ONLY HOPE I DO NOT HAVE TO PAY FOR A NEW MOTOR JUST BECAUSE WE DROVE IN A DAILY SUMMERTIME FLORIDA RAIN STORM.",
        "vin": "WVGEF9BP1GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "06/03/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217799,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IN AIR INTAKE BOX, DISCOVERED WHEN CHANGING AIR FILTER.  VEHICLE HAS 12,6XX MILES ON IT.  NO PRIOR OFF ROAD OR DEEP WATER USE.",
        "vin": "WVGEP9BP5GD"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203828,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LESS THAN FOUR YEARS OF OWNERSHIP, AND OUTSIDE OF THE 3 YEAR/36,000 MILE WARRANTY, THE ADAPTIVE CRUISE CONTROL MODULE(S) FAILED FOR NO APPARENT REASON, RENDERING THE ENTIRE CRUISE CONTROL SYSTEM INACTIVE. THE NATURE OF THE SAFETY SYSTEMS IN VOLKSWAGENS IS SUCH THAT IF ONE SYSTEM IS NOT WORKING, NONE WILL - THUS, THE 'FRONT ASSIST' COLLISION AVOIDANCE SYSTEM IS NO LONGER ACTIVE, WHICH IS AN INTEGRAL PART OF THE ACTIVE SAFETY TECHNOLOGY IN THE TOUAREG. IN ADDITION, BASIC SPEED MODULATION OF CONVENTIONAL CRUISE CONTROL IS ALSO UNAVAILABLE. THE RELIABILITY OF BASIC SYSTEMS SUCH AS CRUISE CONTROL SHOULD NOT BE CONTINGENT UPON IMMENSELY EXPENSIVE, AND OVERLY COMPLICATED TECHNOLOGICAL COMPONENTS.",
        "vin": "WVGEF9BP2GD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE TDI FIX I HAVE EXPERIENCED TWO INCIDENTS OF POWER LOSS AND THEN THE ACTIVATION OF THE CHECK ENGINE LIGHT.  THE 1ST INCIDENT OCCURRED IN MY DRIVEWAY AT A SLOW SPEED.  THE LOSS OF POWER WAS FOR A SHORT PERIOD OF TIME.  VW CALLED IT A GLITCH NOT RELATED TO THE TDI FIX, AND RESET THE CHECK ENGINE LIGHT.  THE 2ND INCIDENT OCCURRED 33 DAYS LATER ON A SURFACE STREET.  I WAS IN TRAFFIC AT 40 MPH AND THE CAR HAD A RAPID DROP IN SPEED.  I PUSHED THE ACCELERATOR TO THE FLOOR WHICH RESULTED IN A SLOW ACCELERATION.  FULL POWER RESTORED IN ABOUT A MILE OF  \"LIMP IT\" TO WORK DRIVING.  LATER THE SAME DAY THE ISSUE RETURNED AND THE DPF LIGHT CAME ON AND MADE THE CAR UNDRIVEABLE.  I FEEL THE TDI FIX HAS MADE MY CAR UNSAFE TO DRIVE.  SINCE THE FIX I'VE HAD 3 CHECK ENGINE LIGHT WARNINGS IN 10 MONTHS.  I'M THANKFUL MY RECENT POWER LOSS DID NOT OCCUR ON THE FREEWAY.  ITS A TRAGEDY WAITING TO HAPPEN. MY CAR IS CURRENTLY IN THE SHOP AWAITING REPAIRS.",
        "vin": "WVGEP9BP4GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "02/17/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181027,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR INTAKE WATER INGESTION  BRAND NEW VEHICLE WITH ONLY 134 DEALER MILES ON IT.  WENT FROM DELIVERY TRUCK TO DRIVEWAY WHERE IT WAS PARKED (NO PLATES YET, SO HAS NOT BEEN DRIVEN).  OPENED AIR FILTER BOX TO INSPECT FILTER ELEMENT...BOTTOM 2-3 INCHES OF THE FILTER WAS SOAKED.  THIS IS CONSISTENT WITH COMPLAINTS DOCUMENTED ON THE CLUBTOUAREG FORUM, AND THE RECALL ISSUED BY VW CHINA.  THIS ALSO NEEDS TO BE A RECALL IN THE USA SINCE WATER INGESTION MAY LEAD TO HYDRO-LOCKING AND SUDDEN AND CATASTROPHIC ENGINE FAILURE AT HIGHWAY SPEEDS.",
        "vin": "WVGEP9BP5GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155554,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE READING A VW FORUM I BECAME AWARE OF A KNOWN PROBLEM WITH THE AIR FILTER HOUSING DRAIN BECOMING CLOGGED AND THE AIR FILTER BECOMING WET AND WATER BEING INGESTED INTO THE ENGINE, HYDROLOCKING THE ENGINE AND REQUIRING THE INSTALLATION OF A NEW ENGINE.  I THEN CHECKED MY AIR FILTER AND FOUND THE BOTTOM 3\" - 4\" OF THE AIR FILTER COMPLETELY SOAKED, TO THE POINT THAT WATER WAS DRIPPING FROM THE FOAM PORTION OF THE FILTER.  I CONTACTED VW AND THEY HAVE NOTED MY CONCERNS BUT THERE IS CURRENTLY NO RECALL FOR THIS PROBLEM.  I AM NOW HESITANT TO DRIVE THE VEHICLE AT ALL.  AS THIS HAS BEEN A KNOWN PROBLEM FOR A NUMBER OF YEARS WITH THIS VEHICLE I AM SURPRISED THAT THERE IS NO RECALL IN PLACE.",
        "vin": "WVGEF9BP2GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/25/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154051,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CHANGING AIR FILTER, THE FILTER WAS SOAKED WITH WATER AT THE BOTTOM.  THE AIR INTAKE TUBE WAS FILLED WITH WATER AND WASN'T DRAINING. I'M LUCKY THE WATER WASN'T SUCKED INTO THE ENGINE. THE LITTLE DRAIN AT THE BOTTOM OF THE INTAKE TUBE WAS CLOGGED NOT ALLOWING THE WATER TO DRAIN BUT WHY WAS WATER ALLOWED TO GET IN THERE IN THE FIRST PLACE. THIS IS A VERY POOR DESIGN AND CAN LEAD TO CATASTROPHIC ENGINE FAILURE.",
        "vin": "WVGEF9BP9GD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124584,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTANT ISSUES WITH WATER ENTERING THE AIRBOX FROM FAULTY DESIGN.  THIS CAN ENABLE PARTS OF THE FILTER TO ENTER THE ENGINE AND CAUSE CATASTROPHIC DAMAGE (HYDRO LOCK).  THIS VEHICLE HAS ONLY SAT OUTSIDE IN THE RAIN OR HAS BEEN DRIVEN IN THE RAIN; ALL NORMAL CONDITIONS FOR THE OPERATION OF THIS VEHICLE (CURRENT MILEAGE IS 9000).",
        "vin": "WVGEP9BP6GD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064277,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE PARKED IN DRIVEWAY.  THE EXPLOSION WAS UPWARDS.  THE CAR HAS A PANORAMIC ROOF AND THE FRONT SLIDING SECTION IS THE ONE THAT EXPLODED.  NO ROCK CHIP OR OTHER IMPACT TO ROOF.  THIS IS A 2016 BUT PURCHASED \"NEW\" ON 1/8/18 FOLLOWING VW DIESEL 3.0 FIX AND COURT AUTHORIZATION TO SELL.",
        "vin": "WVGEP9BPXGD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043000,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL GOES ALL THE WAY TO FLOOR, VEHICLE WILL NOT STOP. HAS FLUID, NO WARNING LIGHTS, NO DAMAGED CABLE",
        "vin": "WVGEF9BP2GD"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2016",
        "dateOfIncident": "05/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870833,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED MY 2016 TOUAREG TDI IN SEPTEMBER 2015. THE STEERING WHEEL VIBRATION HAS BECOME QUITE AN ISSUE AS IT IS GETTING WORSE THE LONGER I DRIVE IT. I HAVE HAD IT ROAD TESTED, WHEELS BALANCE TIRES ROTATED ON THREE DIFFERENT OCCASIONS AND IT CONTINUES TO VIBRATE AT THE STEERING. I HAVE ONLY 4000 MILES ON THE ODOMETER. THE VIBRATION BEGINS AROUND 45-50 MPH.  IT DOES NOT MATTER WHAT TYPE OF SURFACE. I CALLED VW OF AMERICA THEY SET UP ANOTHER APPOINTMENT WITH MY LOCAL DEALERSHIP.  NOT ONLY IS THIS VIBRATION WRONG IT IS ALSO A SAFETY ISSUE WHICH CAN RESULT IN EXCESSIVE TIRE WEAR, AND POSSIBLY A BLOW OUT CAUSING AN ACCIDENT.",
        "vin": "WVEP9BP5GD0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2015",
        "dateOfIncident": "11/16/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794374,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "TOUAREG",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING ON A SHORT TRIP. I SMELLED AND NOTICED DIESEL LEAKING FROM DRIVER SIDE FRONT WHEEL WELL. LOOKING MORE CLOSELY NOTICED DIESEL HAD BEEN LEAKING WHILE DRIVING SPLATTERING ON UNDERSIDE AND SIDE OF VEHICLE.",
        "vin": "WVGEP9BP5GD"
    }
]