[
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "05/08/2021",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437642,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 BMW R1200 GS. The contact stated while driving at 65 MPH, there was a sudden loss of motive power and the motorcycle was going at a slower speed, After an hour the motorcyclist was informed by another rider that the contact needed to pull over because they noticed smoke coming from motorcycle saddle bag due to the bag being next to the fuel pipe on the motorcycle. When the contact pulled over their saddleback was on fire due to the catalytic converter becoming so hot it started to catch the item in the saddleback on fire and melting. The contact removed the saddlebag off the bike and threw into a nearby puddle to extinguish the fire. The contact was able to place the saddlebag on top of their seat and continue to drive to their destination. The contact took the motorcycle to a local dealer was able to be diagnosed with a fractured valve spring. The motorcycle was repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 14,000.",
        "vin": "WB10A6108HZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "11/08/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374290,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BMW R1200 GS. THE CONTACT STATED THAT WHILE RIDING 50 MPH AND DEPRESSING THE REAR BRAKE PEDAL, THE MOTORCYCLE FAILED TO STOP.  THE CONTACT DEPRESSED THE FRONT BRAKE TO BRING THE MOTORCYCLE TO A STOP. THE CONTACT CALLED TYTLERS CYCLE (2246 MID VALLEY DR, DE PERE, WI 54115, (920) 347-9144) AND INFORMED THE DEALER OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE MOTORCYCLE WAS NOT UNDER RECALL AND WAS NOT UNDER WARRANTY. THE CONTACT WAS INFORMED TO SCHEDULE AN APPOINTMENT FOR A DIAGNOSTIC TEST. THE VEHICLE WAS NOT TAKEN TO THE DEALER DUE TO THE DISTANCE. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 14,200.",
        "vin": "WB10A120XHZ"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142408,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE MOTORCYCLE WAS DRIVEN AT A CONSTANT SPEED ON THE STREET, SUDDENLY AND WITHOUT WARNING THE ENGINE PROBLEM LIGHT COMES ON THE DASHBOARD.  THE MOTORCYCLE THEN PROCEEDS INTO \"EMERGENCY OPERATION MODE\" WHERE THE RPMS IMMEDIATELY DROP TO 2000 RPMS OR LOWER CAUSING IMMEDIATE DECELERATION.  ON A MOTORCYCLE THIS IS AN EXTREME HAZARD IN TRAFFIC, IN A TURN, OR PASSING.  THIS HAS HAPPENED SEPARATE TIMES.  EACH TIME THE MOTORCYCLE WAS BROUGHT INTO THE BMW SHOP FOR REPAIR OF THE PROBLEM.  EACH TIME THE SHOP PERFORMED A SOFTWARE UPGRADE TO THE MOTORCYCLE COMPUTER.  THIS REPAIR DID NOT FIX THE RECURRING PROBLEM.",
        "vin": "WB10A1106HZ"
    }
]