[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/07/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452579,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Buick Lacrosse. The contact stated that while driving at 20 MPH and making a left turn, there was an abnormal noise coming from the front passenger side of the vehicle. The contact mentioned the failure was related to the bushings. The vehicle was taken to an independent mechanic and then to a dealer where it was informed that the part to repair the vehicle was no longer in production. The vehicle was not repaired. Themnaufactuer was notified of the failure. The failure mileage was 15,000",
        "vin": "1G4ZR5SS7HU"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Buick LaCrosse. The contact stated that while at a stoplight the fuel-saving feature activated and the engine shut-off. After removing his foot from the brake pedal the STOP/START feature failed to activate. The contact used the Push to Start button and restarted the vehicle. The vehicle was taken to the local dealer who was unable to duplicate the failure. The failure persisted. The manufacturer was not notified of the failure. The approximate failure mileage was 45,000.",
        "vin": "1G4ZP5SS9HU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/07/2021",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406833,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DOORS UNLATCHED (BECOMING IN OPEN POSITION [UNLOCKED AND UNLATCHED] BEFORE IT BEING COMPLETELY OPEN). IT HAPPENED TWICE, ONES WHEN I WAS DRIVING AND THE WARNING BUZZER TURNED ON AND THE INSTRUMENT PANEL GIVE ME A MESSAGE TELLING ME THE DRIVING DOOR IS OPEN, THIS IS HAPPENED SUDDENLY AFTER DRIVING FOR 10 MINUTES IN VERY GOOD LOCAL STREETS CONDITION. I STOPPED TO CHECK THE DOOR AND I WAS SURPRISED TO FIND ITS BEEN UNLATCHED TO THE PRE OPEN POSITION. SECOND TIME HAPPENED WHEN WAS THE CAR PARKED AND LOOKED, AFTER ABOUT 30 MINUTES THE CAR HORN STARTS BEEPING AND THE LIGHTS FLASHING, L GOT A MESSAGE FROM ONSTAR ON MY PHONE TELLING ME MY CAR DOORS ARE IN OPEN POSITION. I WENT OUT TO CHECK THE CAR AND I FOUND THE DRIVER SIDE REAR DOOR IS IN OPEN POSITION (PRE OPEN POSITION, UNLOCKED AND UNLATCHED POSITION, IF YOU PULL THE DOOR IT WILL OPEN COMPLETELY). THIS IS A SAFETY CONCERN",
        "vin": "1G4ZR5SS8HU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "11/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE JULY 25, 2020. TOOK THE CAR FOR ITS FIRST OIL CHANGE, IN OCTOBER. ON NOV 23, 2020, THE CAR ENGINE LIGHT CAME ON WHILE DRIVING ON THE HIGHWAY. ERROR CODE: P0430 \"CATALYST SYSTEM LOW EFFICIENCY BANK 2\". ON NOV 24, 2020, I TOOK THE CAR TO \"RICK MATHEWS GMC/BUICK DEALERSHIP\" FOR DIAGNOSTIC AND REPAIR. THEY PLACED AN ORDER FOR THE PARTS NEEDED FOR REPAIR AND TOLD ME, THAT MY CAR WAS DRIVABLE. ON DEC 4, 2020, I WAS HAVING PROBLEMS WITH DRIVING ON A CITY STREET WITH THE CAR SHAKING, I WAS SCARED TO TAKE THE HIGHWAY BUT THAT WAS MY ONLY WAY HOME, AND THE LOUD ENGINE NOISE AND SHAKING CONTINUED. ON DEC 7, 2020, I TOOK MY CAR BACK TO THE DEALERSHIP AND THEY TOLD ME MY CAR WAS INOPERABLE BECAUSE THE CATALYTIC CONVERTER HAD CRACKED AND THE PARTS WERE STILL NOT AVAILABLE TO COMPLETE REPAIRS. THAT DAY THEY PROVIDED A RENTAL/LOANER VEHICLE FOR ME TO DRIVE TO WORK UNTIL THE CAR WAS REPAIRED. ON JAN 13, 2021, I HAD TO SWAP OUT VEHICLES BECAUSE THE PART WAS STILL NOT AVAILABLE TO COMPLETE REPAIRS. IT IS NOW FEB 26, 2021, AND THE DEALERSHIP HAS TOLD ME THAT MY CAR IS FINALLY BEING REPAIRED. THIS ENTIRE TIME, I HAVE CONTINUED TO PAY FOR THE MONTHLY COST OF MY PERSONAL CAR LOAN WHILE NOT BEING ABLE TO DRIVE IT. I ONLY GOT TO DRIVE MY CAR 4 MONTHS BEFORE IT WAS STUCK IN THE SHOP AND I STILL CONTINUE TO PAY FOR MY PERSONAL CAR MONTHLY. THE DEALERSHIP IS NOW ASKING ME TO PAY A \"RENTAL\" FEE FOR THE USE OF THEIR VEHICLE, AND IT HAS TAKEN 3 MONTHS TO FINALLY REPAIR MY VEHICLE, ALL BECAUSE THE MANUFACTURER GMC/BUICK WAS OUT OF STOCK OF A 2017 CAR PART. I HAVE TRIED TO RESOLVE THIS WITH THE MANUFACTURER AND HAVE A CASE# (SR:9-6454995176). I'VE BEEN IN CONTACT WITH THEM AND THE DEALERSHIP SINCE DEC 7, 2020.",
        "vin": "1G4ZP5SS7HU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "04/23/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GEARS OF TRANSMISSION ABRUPT AND HARD CONSTANTLY FLASHING SOME KIND OF SERVICE TRANSMISSION JERKS ON AUTO STOP BEEN HAVING PROBLEMS SINCE I GOT IT STARTING AT ABOUT 10000 MILES NOW HAS 48000 MILES",
        "vin": "1G4ZP5SS6HU"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/24/2020",
        "dateOfIncident": "04/22/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY CAR IN SHOP AT LEAST 10 TIMES FOR THE SAME REASON AND IT NEVER ENDS. THEY KEEP CHANGING OR DOING SOMETHING TO THE GEAR SHIFTER. IT KEEPS SAYING SERVICE TRANSMISSION NOW IT SAYING ALL KINDS OF WARNINGS ABOUT STEERING EXCEEDING SPEED TRACK SOMETHING PLUS SERVICE TRANSMISSION WON'T SHIFT SOON ETC IT'S RIDICULOUS TO PAY THIS MUCH FOR A CAR AND HAVE IT IN THE SHOP THIS MANY TIMES IN 2 YEARS IT'S IN THERE AGAIN NOW AND PROBLEM STILL ISN'T FIXED",
        "vin": "1G4ZP5SS6HU"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BUICK LACROSSE. THE CONTACT STATED WHILE DRIVING ABOUT 35 MPH, WITHOUT WARNING THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO FLOW COMPANIES OF FAYETTEVILLE (1945 SKIBO RD. FAYETTEVILLE, NC 28314) BUT WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 1,345.",
        "vin": "1G4ZP5SS4HU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 BUICK LACROSSE. CONSUMER WRITES IN REGARDS TO ISSUES WITH TRANSMISSION. *LD    THE CONSUMER STATED WHEN ACCELERATING FROM A STOP, THE VEHICLE INTERMITTENTLY SEEMED TO STICK OR DOWNSHIFT INTO LOW GEAR. THE VEHICLE WAS RESTARTED AND APPEARED TO BE NORMAL.  THE DEALER COULD NOT DUPLICATE THE FAILURE. *JS",
        "vin": "1G4ZR5SS7HU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA LIGHT IS SO BRIGHT AT NIGHT THAT IT BLINDS THE DRIVER AND YOU CAN'T DIM IT.",
        "vin": "1G4ZP5SS0HU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE IN JUNE OF 2018. THE CAR DROVE BEAUTIFULLY FOR ABOUT 14000 MILES. THEN I STARTED NOTICING HARSH SHIFTS AT LOWER SPEEDS, SHIFTED FINE ON THE HIGHWAY. THIS CONTINUED ON AND I JUST THOUGHT IT WAS NORMAL WEAR. THEN ABOUT 2 MONTHS AFTER THE HARSH SHIFTING STARTED I WAS GETTING ON THE HIGHWAY AND ACCELERATING UP TO SPEED. I THEN LET OFF MY GAS PEDAL AND THE CAR STUCK IN GEAR. I TRIED SLOWING DOWN AND SPEEDING UP AND THE CAR WOULD NOT SHIFT. I HAD TO PULL OVER SHUT THE CAR OFF AND TURN IT BACK ON DURING RUSH HOUR. THIS HAPPENED AGAIN ABOUT A MONTH LATER, SO I CALLED TO MAKE AN APPOINTMENT AT THE DEALER. TOOK MY CAR IN AND THE SERVICE TECH ASKED ME TO RIDE WITH AND SHOW HIM WHAT IT IS DOING. SO I DROVE THE TECH AROUND ABOUT A HALF HOUR. ON THE WAY BACK IN TRAFFIC AT ABOUT 35 MPH THE CAR STUCK IN GEAR AGAIN WITH THE TECH IN THE CAR. THEY HAD THE CAR A WEEK AND CUD NOT REPLICATE THE ISSUE AGAIN. THEY TALKED ABOUT REPROGRAMMING MY ANS BUT SINCE NO REPORTED PROBLEMS THEY COULD NOT DO IT. I HAVE HAD THE CAR BACK A MONTH AND IT HAS HAPPENED TWICE AGAIN. SO I WILL YET AGAIN MAKE ANOTHER APPOINTMENT. THIS IS VERY UNSAFE WHEN THE TRANSMISSION WILL NOT SHIFT TO HAVE TO TRY AND PULL OFF ON BUSY HIGHWAYS WHERE THERE ARE NOT ALWAYS SAFE PLACES TO DO SO.",
        "vin": "1G4ZS5SS2HU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/23/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD CLUNK NOISE DURING ANY GEAR CHANGE. CAR DOES NOT HAVE TO BE MOVING. I EXPERIMENTED THIS PROBLEM WHILE SHIFTING FROM PARK TO DRIVE, DRIVE TO REVERSE, REVERSE TO PARK. THIS PROBLEM ALSO EXISTS SHIFTING UP AND DOWN GEARS. TOOK IT TO THE DEALER TO GET SERVICED. THEY FLUSHED THE TRANSMISSION, REPROGRAMMED THE TRANSMISSION CONTROL TO NO AVAIL. THE PROBLEM OCCURS WHEN THE ENGINE IS COLD AND HOT",
        "vin": "1G4ZP5SS7HU"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BUICK LACROSSE. THE CONTACT STATED THAT THE GEAR SHIFT LEVER WOULD MISSHIFT AND SWITCH INTO OTHER GEARS THAT WERE NOT SELECTED. SECONDLY, THE TRANSMISSION WOULD NOT GO INTO PARK OR REVERSE PROPERLY. TO REVERSE, THE CONTACT HAD TO MOVE THE LEVER BACK AND FORTH. TO PARK, THE CONTACT HAD TO SELECT PARK, SHIFT INTO ANOTHER GEAR, AND THEN SHIFT BACK INTO PARK. THE VEHICLE WAS TAKEN TO WEBSTER CITY AUTO (129 2ND ST, WEBSTER CITY, IA 50595, (515) 832-6638) WHERE IT WAS DIAGNOSED THAT A NEW SHIFT ASSEMBLY NEEDED TO BE INSTALLED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED SOON AFTER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 20,200. THE VIN WAS INVALID.*BF",
        "vin": "1G4ZP5SS18U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204194,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT A FULL STOP, THE ENGINE AUTO STOP SHUTS THE ENTIRE VEHICLE DOWN.  VEHICLE MUST BE RE-STARTED AND ALL FEATURES LIKE RADIO, CLOCK ETC. RETURN TO THE FACTORY SETTINGS AS IF THE BATTERY HAD BEEN DISCONNECTED.  ONCE THIS HAPPENS, I'VE NOTICE THE ENGINE AUTO STOP DOES NOT WORK FOR AN EXTENDED PERIOD OF TIME.  THE VEHICLE IS A 2017 MODEL WITH ONLY 17,000 MILES.  AT 9,000 MILES THE WATER PUMP HAD TO BE REPLACED.",
        "vin": "1G4ZR5SS5HU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN ISSUE WITH THE CRUISE CONTROL ON MY 2017 BUICK LACROSSE, A VEHICLE WITH 17,004 MILES. WHILE TRAVELING ON THE INTERSTATE WITH THE CRUISE SET TO 70 MPH THE SYSTEM RESET ITSELF TO 105 MPH AND THE ENGINE REVVED 3000 RPM ACCELERATING OUT OF CONTROL. THIS WAS THE SECOND TIME IT HAPPENED, THE OTHER TIME IT RESET TO 95 MPH. STEPPING ON THE BRAKE PEDAL BROUGHT THE SPEED BACK UNDER CONTROL IN BOTH INSTANCES.    I TOOK THE CAR TO MARKLEY MOTORS IN FORT COLLINS COLORADO WHERE THEY COULD NOT REPLICATE THE PROBLEM IN THEIR 4 MILE TEST DRIVE. THEY INSINUATED THAT I MISUSED THE RESUME FUNCTION BUT IN NEITHER SITUATION DID I TOUCH THE CONTROLS. THEY INDICATED THAT THERE ARE NO SERVICE BULLETINS FOR THIS PROBLEM.",
        "vin": "1G4ZS5SS6HU"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 BUICK LACROSSE. CONSUMER WRITES IN REGARDS TO DEFECTIVE ENGINE CONTROL STOP/START SYSTEM. *LD  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132741,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NO IDEA WHETHER THIS CONCERNS THE TAKATA INFLATORS OR NOT.  WHILE ACCELERATING FROM A NORMAL TRAFFIC SPEED (APPROXIMATELY 20 TO 40MPH) , IT SEEMS LIKE THE TRANSMISSION SHIFTS UP AND DOWN RAPIDLY SEVERAL TIMES BETWEEN LOWER GEARS.  IF THE ACCELERATION IS TERMINATED BY BY LIFTING YOUR FOOT FROM THE ACCELERATOR, THE SHIFTING GOES AWAY.  AFTER THAT, A SOFT PRESSURE ON THE ACCELERATOR WILL ALLOW THE VEHICLE TO ACCELERATE WITHOUT FURTHER UNWANTED SHIFTING.  THIS IS A REOCCURRING PROBLEM.",
        "vin": "1G4GB5G3XGF"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL 4 WINDOWS IN THE VEHICLE GO DOWN WHEN THE DRIVER AND KEY FOB ARE NO WHERE NEAR THE CAR. ONLY 1 TIME HAS THIS HAPPENED WHILE THE DRIVER AND KEY FOB HAVE BEEN IN THE CAR AND THE DRIVER WAS NOT TOUCHING THE FOB. IN THIS CASE THE DRIVER PUT UP THE WINDOWS, OPENED THE DOOR, DURING WHICH THE WINDOWS WENT BACK DOWN. ALL OTHER INSTANCES THE WINDOWS WENT DOWN IN VARIOUS LOCATIONS WITH NO COMMONALITY (MY PARENT'S HOUSE WHILE WE WENT SHOPPING, THE GYM, WALMART.) THIS HAS OCCURRED I BELIEVE 6 TIMES OVER 3 MONTHS. THE VEHICLE WAS PURCHASED APRIL 2017 AND HAS UNDER 11,000 MILES. TWICE THIS HAS OCCURRED AND DURING OR IMMEDIATELY FOLLOWING A RAINSTORM. ONCE CAUSING EXTREMELY SOAKED SEATS AND I DON'T KNOW HOW THE INSIDE ELECTRONICS, SUCH AS RADIO AND GPS WERE NOT RUINED. THE FIRST TIME MY CAR WAS LOADED WITH OVER $500 IN TOYS AND THANKFULLY NONE STOLEN.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063227,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BUICK LACROSSE. ON SEVERAL OCCASIONS, WHILE THE VEHICLE WAS IDLING THIRTY SECONDS TO A MINUTE WITH THE BRAKE PEDAL DEPRESSED, THE VEHICLE REVVED AND INDEPENDENTLY ACCELERATED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO COOPER CHEVROLET BUICK (1300 S QUINTARD AVE, ANNISTON, AL 36201, (256) 405-4155) WHERE NO DIAGNOSTIC FAILURE CODES WERE FOUND AND THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 1,500. *TT  *TR",
        "vin": "1G4ZR5SS0HU"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 BUICK LESABRE. CONSUMER WRITES IN REGARDS TO HOLES, CORROSION AND A SPLIT BENCH DRIVERS SEAT. *LD    THE CONSUMER STATED DUE TO THE LESABRE NOT PASSING INSPECTION IT WAS TRADED IN. THE CONSUMER PURCHASED A 2017 BUICK LACROSSE. THE LACROSSE'S BUCKET SEATS EXACERBATED THE CONSUMER'S PRE-EXISTING BACK PAIN.   UPDATED 09/26/2017*JS",
        "vin": ""
    },
    {
        "components": "SEAT BELTS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "04/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990510,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS 500 MILES ON IT.  DRIVER SEAT BELT WILL NOT RELEASE. HAVE TO PUSH PULL NUMEROUS TIMES FOR ABOUT 2-4 MINUTES TO GET BELT TO RELEASE TO ATTACH. THEN WITH CERTAIN MOVEMENT BELT WILL LOCK YOU IN POSITION, NO ROOM TO MOVE UPPER TORSO.  TOLD BY DEALER AND BUICK THAT THE PART IS NOT RELEASABLE, ONLY A PRODUCTION PART.  IT HAS BEEN SITTING AT DEALERSHIP FOR OVER 3 WEEKS, STILL WAITING ON BELT ASSEMBLY.   DEALER CLAIMS THAT THEY CAN ONLY WAIT ON GM, YET DEALER IS SENDING ME INFO ON THEIR GRET CUSTOMER SERVICE AND SALES.  SALESMAN CONTACTED ME AND WANTED TO KNOW HOW AM I ENJOYING NEW VEHICLE--TOLD HIM TO LOOK OUT HIS WINDOW WHERE IT HAS BEEN SITTING FOR LAST 3 WEEKS.        ALSO DRIVER SIDE WIPER ARM WAS HITTING A PILLAR WHEN IN OPERATION, VEHICLE WAS IN SHOP TO GET THIS AND DEFECTIVE PAINT ON BUMPER FOR 1 WEEK.   WITH SEAT BELT ISSUE THIS IS GETTING CLOSE TO 1 MONTH.",
        "vin": "1G4ZP5SS8HU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "11/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928434,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LACROSSE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 19, 2016, I PURCHASED THE 2017 BUICK LACROSSE PREMIUM AWD. ON THAT SAME DAY, WHILE I WAS DRIVING ON THE HIGHWAY THE OVERHEATED ENGINE LIGHT CAME ON, BEEPING SOUND, OIL LIGHT CAME ON, SHORTLY VEHICLE INDICATED IMMEDIATELY TO STOP, WHICH I DID, STRANDED ON THE HIGHWAY IN EN ROUTE TO DEALERSHIP. I HAD JUST LEFT THE DEALERSHIP APPROXIMATELY FIVE MINUTES AGO AFTER I PURCHASED THE VEHICLE. THE VEHICLE WAS TOWED TO DEALERSHIP. SIMULTANEOUSLY AT 4:48 P.M. EST, ONSTAR SENT NOTIFICATION VIA EMAIL STATING, \"A CRITICAL ISSUE WITH THE ENGINE AND TRANSMISSION SYSTEM IN YOUR 2017 BUICK LACROSSE AWD HAS BEEN DETECTED...PLEASE SERVICE YOUR VEHICLE IMMEDIATELY.\" ON NOVEMBER 20, 2016, I RESCINDED MY CONTRACT WITH DEALERSHIP CONNECTED TO THE ABOVE ISSUES. ON NOVEMBER 21, 2016, DEALERSHIP FULLY REFUNDED $47,848.19 AND CONTINUED ITS POSSESSION OF SAID VEHICLE SINCE NOVEMBER 19, 2016. ON SEPTEMBER 10, 2016, I ORDERED THE VEHICLE WITH THE DEALERSHIP WITH HIGH EXPECTATIONS ON A NEW VEHICLE. THE DEALERSHIP DID NOT DISCLOSE TO ME ABOUT THE ABOVE PROBLEMS AND SAFETY ISSUES PRIOR TO MY PURCHASE. I FELT UNSAFE IN THE VEHICLE BECAUSE IT WAS MAKING LOUD NOISES UNDERNEATH THE CAR AS I DROVE IT, FOR EXAMPLE, I FELT LIKE I WAS GOING TO BLOW UP IN THE VEHICLE. I ALSO FELT UNSAFE DRIVING AT LOW SPEED WITH THE EMERGENCY LIGHTS ON  THE HIGHWAY. I FELT UNSAFE STRANDED ON THE HIGHWAY IN THE VEHICLE, WAITING FOR THE TOW TRUCK.  *TR",
        "vin": "1G4ZS5SS4HU"
    }
]