[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC CUE INFOTAINMENT SYSTEM WORKS MAYBE 25% OF THE TIME. THE OTHER 75% THE SYSTEM IS UNRESPONSIVE AND GLITCHY. I CAN NOT ACCESS SOME OF THE MOST IMPORTANT FEATURES. THESE SAME FEATURES ARE THE REASON FOR THE INITIAL PURCHASE. BUT BEING THAT I CAN'T USE THEM WHEN I NEED THEM, I AM NOW REGRETTING THE PURCHASE. THIS IS TOO NICE OF A CAR FOR THE BASIC CONTROLS NOT TO BE WORKING MAJORITY OF THE TIME.",
        "vin": "1G6AX5SX4H0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CADILLAC CUE COMPUTER SCREEN WHICH CONTROLS THE BLUETOOTH, RADIO & GPS, FROZE IN SEPT 2019. WHILE DRIVING OUT OF STATE OUR BLUETOOTH & GPS WERE UNAVAILABLE. THE DEALERSHIP COULDN'T DUPLICATE THE ISSUE. THIS WAS HAPPENING IN DIFFERENT LOCATIONS, A COMPLETE OFF & ON WITH THE SCREEN GOING BLACK. DEALERSHIP AGAIN & THEY COULDN'T DUPLICATE THE ISSUE. THE DEALERSHIP IS AN HOUR DRIVE EACH WAY. I LEFT FRUSTRATED & AND IT WENT OFF AGAIN. I WENT BACK TO THE DEALERSHIP & IT WAS PLAYING WHEN I GOT THERE. WHILE WE WERE DISCUSSING THE ISSUE, THE RADIO WENT OFF. WE WAITED AND IN A COUPLE OF MINUTES IT CAME BACK ON. THEY DIDN'T HAVE A LOANER VEHICLE AVAILABLE SO I HAD TO COME BACK SEVERAL DAYS LATER. I MADE THE TRIP AGAIN AND LEFT MY CAR WITH THEM. WHEN THE RADIO WORKED FINE AGAIN, ONE OF THE SERVICE GUYS WONDERED IF IT MIGHT BE THE BLUETOOTH RELATED. HE LINKED HIS APPLE IPHONE TO MY CAR'S BLUETOOTH & WAITED. THE RADIO WENT OFF & IN A FEW MINUTES CAME BACK ON. HE HAD FOUND THE PROBLEM. HE CALLED GM CORPORATE & THEY CONTACTED APPLE. APPLE IS AWARE THAT THEIR LATEST UPDATE IS CAUSING THIS ISSUE & ARE WORKING ON AN UPDATE TO FIX IT. THIS REVELATION ANSWERED THE ISSUE THAT THIS DEALERSHIP WAS HAVING WITH TWO OTHER VEHICLES IN THEIR SERVICE CENTER THAT HAD A DIFFERENT VERSION OF THE CUE. SO FOR NOW I HAVE TO CHOOSE BETWEEN HAVING GPS & A RADIO OR HAVING MY IPHONE BLUETOOTHED & HANDS FREE. IT IS NOW DECEMBER 2019 AND APPLE HASN'T CORRECTED THE ISSUE. HOW MANY 'HANDS FREE' VIOLATIONS AND ACCIDENTS WILL THERE BE BEFORE THIS GETS FIXED? I REALIZE THIS IS AN APPLE ISSUE RATHER THAN A GM ISSUE BUT I JUST BOUGHT THIS CAR 7 MONTHS AGO & THE SAFETY FEATURES, INCLUDING GPS & BLUETOOTH PLAYED A BIG PART IN MY DECISION. I'M REALLY FRUSTRATED IN NOT BEING ABLE TO USE ALL OF FEATURES OF THE CUE SYSTEM. I'M WRITING THIS IN THE HOPE THAT GM WILL PROGRESSIVELY WORK WITH APPLE TO GET THIS RESOLVED.",
        "vin": "1G6AR5SS3H0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288587,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS 37250 MILES ON IT. 6 MONTHS AGO, IT STARTED SHIFTING ROUGHLY BETWEEN 1ST AND 2ND GEAR. WE TOOK IT TO WALDORF CADILLAC/GM IN WALDORF, MD. THEY ACKNOWLEDGED IT WAS A KNOWN ISSUE AND WOULD TAKE THE FOLLOWING STEPS: FLUSH THE TRANSMISSION, RE-PROGRAM THE TRANSMISSION, REPLACE THE VALVE, AND ULTIMATELY, REPLACE THE TRANSMISSION. THEY HAVE DONE ALL THE ACTIONS EXCEPT REPLACE THE TRANSMISSION AND WON'T TAKE FURTHER ACTION. THE CAR SHIFTS SO VIOLENTLY AT TIMES THAT YOU DON'T KNOW IF YOU'RE GOING TO HIT THE CAR IN FRONT OF YOU. WE LIVE IN THE WASHINGTON DC AREA, SO TRAFFIC IS USUALLY STOP-AND-GO. WHEN THE CAR GETS TO THE TOP END OF 1ST GEAR (AROUND 9 MPH) IT HESITATES, THEN SLAMS INTO SECOND GEAR. IT HAS ALSO GOTTEN \"STUCK\" IN FIRST GEAR, WHILE TURNING ONTO A STREET. THE ENGINE ACCELERATED BUT THE CAR WOULDN'T SHIFT SO I HAD TO PULL OFF IMMEDIATELY OR RISK BEING HIT BY ONCOMING TRAFFIC. IT HAS ONLY DONE THIS ONCE SINCE WE STARTED HAVING PROBLEMS.",
        "vin": "1G6AX5SSXH0"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "12/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287832,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE TOUCHTONE SCREEN HAS FAILED TWICE AND CADILLAC HAS REPLACED IT MORE IMPORTANT THAN THAT IS THE FACT THAT THE CAR WAS ORDERED WITH THE CARBON FIBER WHEEL PACKAGE AND  THOSE WHEELS HAVE CRACKED/ CANT HOLD AIR PRESSURE    THE DEALER HAS REPLACED ONE BUT SAID THEY CANNOT REPLACE THE SET OF 4- MY DAUGHTER HAS HAD 4 ISSUES OF TIRES GOING FLAT WHILE DRIVING- FORTUNATELY SHE HAS NOT HAD AN ACCIDENT YET BUT THIS IS A SEVERE SAFETY ISSUE THAT CADILLAC DOESNT WANT TO RESOLVE  IS THERE A RECALL OR SAFETY ISSUE WITH THESE CARBON FIBER RIMS? MY DAUGHTER NO LONGER FEELS THAT THE VEHICLE IS SAFE AND DOES NOT WANT TO GET IN AN ACCIDENT WH SHE OR SOMEONE ELSE GETS HURT - PLEASE HELP!",
        "vin": "1G6AX5SSXH0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246443,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CADILLAC CTS. THE CONTACT STATED WHILE STOPPED AT A LIGHT THE RPM' S INCREASED, THE VEHICLE ATTEMPTED TO ACCELERATE ON ITS OWN. THE CONTACT STATED AS THE BRAKE PEDAL WAS DEPRESSED HE TURNED OF THE VEHICLE, SHIFTED TO NEUTRAL, RESTARTED THE VEHICLE AND WAS ABLE TO DRIVE THE VEHICLE WITH NO MORE ISSUES. THE VEHICLE WAS TAKEN TO SUBURBAN CADILLAC OF TROY (1810 MAPLELAWN DR. TROY, MI) WHERE THE FAILURE WAS DIAGNOSED AS A THROTTLE BODY ISSUE. THE THROTTLE BODY WAS REPLACED. HOWEVER, A YEAR LATER THE FAILURE RECURRED. THE CONTACT STATED WHILE HIS WIFE WAS PULLING INTO A PARKING SPACE THE VEHICLE INADVERTENTLY ACCELERATED, JUMPING THE CURB BUMPER, CRASHING THROUGH A FENCE, AND COLLIDING WITH A WALL. NO AIR BAGS WERE DEPLOYED AS THE SPEED WAS LOW. THE CONTACT STATED THAT THE FRONT BUMPER, RIGHT FRONT FENDER, AND RIGHT FRONT WHEEL WERE DAMAGED. THE VEHICLE WAS TOWED TO THE DEALER'S BODY SHOP. THE DEALER'S SERVICE DEPARTMENT WAS MADE AWARE OF THE FAILURE HOWEVER, THE FAILURE HAS NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND A CASE WAS OPENED. THE FAILURE MILEAGE WAS 15,000 AND DAMAGE EXCEEDED $20,000. 11 WEEKS TO REPAIR.  *TR*JB",
        "vin": "1G6AX5SX3H0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "04/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS LOCKED IN 2ND OR 3RD GEAR TWO DIFFERENT TIMES, BOTH AFTER LONG DRIVES (2+ HOURS AT HIGHWAY SPEEDS) AND WOULD NOT DOWNSHIFT INTO 1ST TO STOP MOVEMENT.  THE FIRST TIME WAS A STOP LIGHT AND ALMOST CAUSED AN ACCIDENT, THE SECOND TIME WAS IN MY DRIVEWAY AND ALMOST HIT THE HOUSE.  GOOD BRAKES ARE THE ONLY THING THAT SAVED ME.    BOTH TIMES, THE VEHICLE SHIFTED TO 1ST WITH A LOUD BANG.  TRANSMISSION ALSO JERKS THE CAR FORWARD FROM THE STOPPED POSITION WHEN ENGINE STARTS AT A STOP SIGN OR LIGHT (WHEN AUTO-START./STOP IS ENABLED).",
        "vin": "1G6AX5SS1H0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193584,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CADILLAC CTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 19V086000 (STEERING) AND STATED THAT THE REPAIR EXCEEDED A REASONABLE AMOUNT OF TIME. FITZGERALD CHEVROLET (114 BAUGHMANS LANE, FREDERICK, MD 21702) CONFIRMED THAT PARTS WERE NOT AVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1G6AX5SSXH0"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193396,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASES A 2017 CADILLAC CTS. WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL SEIZED WITHOUT WARNING AND BECAME DIFFICULT TO STEER. THE CONTACT CONTINUED TO DRIVE THE VEHICLE TO HER RESIDENCE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V086000 (STEERING); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED KING O'ROURKE BUICK GMC (LOCATED AT 756 SMITHTOWN BYPASS #102, SMITHTOWN, NY 11787, (631) 982-4447) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED CASE NUMBER: 95151697980. THE APPROXIMATE FAILURE MILEAGE WAS 17,100. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1G6AX5SX3H0"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096434,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "4 FLAT TIRES IN WEEKS.  DESIGN FLAW WITH THE WHEEL.  TIRE SIDEWALL IS CUT BY THE WHEEL WHEN HITTING ROAD IMPERFECTIONS.  THEY ARE LOW PROFILE TIRES BUT THEY DO NOT HANDLE BASIC ROAD IMPERFECTIONS.  THE WHEEL AND TIRE COMBO RENDERS THE CAR UNRELIABLE FOR TRANSPORTATION.",
        "vin": "1G6AU5S8XH0"
    }
]