[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/02/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457200,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My BWW X5 hybrid give me a sudden error in the middle of the road. The error was Drive train malfunction and suddenly it stopped couple of seconds after the warning. Leaving me in the middle of the road. Thankfully I was on a low traffic road, so there was no accident.  It was a scary situation to be at.   After that, I managed to start the car after couple of tries and pull it over to a safer place. The car was useless so  I had to call my BMW dealer.   To add to the bad experience the dealer took long to service my car. They are unable to find the problem and it is charging me extra $1,170 for another 8 hours of labor without any guarantees.   My BMW is on excellent condition with 40k miles only. The car never alert me of any signs or warnings. This is a major failure that should not happen to any car owner in these days.",
        "vin": "5UXKT0C33H0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452218,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes are squeaking and vehicle is shaking when attempting to use brakes. Takes an excessively long time to brake and I fear for the safety of my family when using vehicle with faulty brakes. Vehicle paperwork shows that the vehicle is overdue for new front/rear brakes, yet BMW doesn't want to replace them since they key reader isn't indicating that they need to be replaced.",
        "vin": "5uxkr6c35h0"
    },
    {
        "components": "STRUCTURE,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "02/07/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451168,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Sunroof drain clogged, causing leaking of water into vehicle. The dealer tested and found the same issue. They stated that there is a fix for this, to reroute the drain, and that it was not done on my vehicle prior to it clogging.",
        "vin": "5UXKR0C54H0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/02/2022",
        "dateOfIncident": "01/26/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449841,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear tailgate suddenly flew open while driving at a speed of roughly 25 mph without any user input. Car was fully locked and at speed, trunk/tailgate release button was not pushed. The tailgate was fully closed and locked, and there were no warning lights or chimes indicating otherwise. This has only occurred once as of today and has not been able to be replicated, so it is not necessarily \"available for inspection upon request\". My safety, as well as others, were put at risk by this malfunction as our family dog is often transported in her crate that is located in the trunk, and if this malfunction had occurred while she was back there, her crate could have very easily fallen out of the car at high speed, undoubtedly leading to death. In this same instance, her crate falling out of the trunk at highway speeds, or really anything else being transported in the trunk, could have easily penetrated another car's windshield, resulting in injury or death of another vehicle's inhabitants. As previously stated, this problem has not been able to be reproduced by a dealer or independent service center at the time of this writing. The tailgate has not yet been inspected by the manufacturer, police, insurance representatives, or any other parties. There were no warning lamps, messages, or any other symptoms of the problem prior to the failure, nor have there been after the fact.",
        "vin": "5UXKR0C31H0"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "01/24/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448997,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 BMW X5. The contact received a recall notification for NHTSA Campaign Number: 21V907000 (Fuel System, Diesel) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "5UXKS4C37H0"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448103,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 BMW X5. The contact received a recall notification for NHTSA Campaign Number: 21V586000 (Fuel System, Diesel). The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The part was not available for repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "5UXKS4C37H0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444604,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 BMW X5. The contact received notification of NHTSA Campaign Number: 21V586000   ( FUEL SYSTEM, DIESEL ) however, the part to do the recall repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated while driving approximately 30 mph when attempting to accelerate the vehicle when the vehicle suddenly lost power and the fuel pump failed. The contact was able to maneuver and coast the vehicle to the side of the road. They then had the vehicle towed to the dealer. The contact stated that when the vehicle was towed they learned that the gear shifter was locked in position. The approximate failure mileage was 29,000. Vin tool confirms parts distribution disconnect.",
        "vin": "5uxks4c38h0"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/09/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443277,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 BMW X5. The contact received notification of NHTSA Campaign Number: 21V586000 (Fuel System, Diesel) however, the part to do the recall repair was unavailable. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated while driving approximately 30 MPH and attempting to accelerate, the vehicle suddenly loss power, and the fuel pump failed. The contact was able to coast the vehicle to the side of the roadway. The vehicle was towed to the dealer. The contact stated that when the vehicle was towed, he learned that the gear shifter was locked in position. The approximate failure mileage was 29,000. Parts distribution disconnect.",
        "vin": "5uxks4c38h0"
    },
    {
        "components": "Tether, Lower Anchor (on car seat or vehicle)",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436381,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Columbus Trading-Partners USA, Inc.",
                "productMake": "CYBEX",
                "productModel": "SIRONA S",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "The contact owns a Cybex car seat.  Model number:  519004435,Model name: Sirona S.  The car seat was being utilized in a 2017 BMW X5. The contact stated that while, his daughter was in the car seat it wiggled and moved at the base. The contact stated the writing on the chest clip  faded within a week. The occupant of the car seat was able to move the chest clip. The contact stated the latch and seatbelt failed to correct the failure. The manufacturer was made aware of the failure.  The contact stated the car seat was to narrow at the base and was not suitable for several vehicles.  Consumer stated: 1.Not able to securely install with latch method across several vehicle types 2. Not able to securely install with seat belt method across several vehicle types 3. Top belt buckle is easily undone by children while in transit 4. Ink used on seat buckles and hardware fades and rubs off easily.",
        "vin": "5VXKROC38HO"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "08/31/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435736,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Warning on screen came on suddenly while driving indicating charger system failure.  While driving to the dealer for diagnosis and repair, power steering failed, then power brakes failed, then engine stopped running.  Could not put vehicle in park and vehicle rolled back when foot brake was released.  Car was diagnosed as alternator failure.",
        "vin": "5UXKR0C3XH0"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434549,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2016 BMW X5-Diesel. The contact received notification of NHTSA Campaign Number: 21V586000 (Fuel System, Diesel) however, the part to do the recall repair was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact spoke with a dealer, and the dealer confirmed that part was not yet available. The contact had not experienced a failure. The manufacturer was made aware of the issue. VIN tool confirms parts not available.",
        "vin": "5uxks4c37h0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429454,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On July 30, 2021, my 2017 BMW X5 35d, which had only about 49,000 miles on it and which had been serviced only six weeks before, died without warning.  My son and I could have been killed.  The car went into Park and had to be towed on a flatbed to the dealer.  After 5 days of no word, the dealer falsely accused me of putting gasoline in my diesel vehicle. The dealer eventually determined that the high-pressure fuel pump had failed, which caused exactly the problem listed in BMW's July 29, 2021 recall notice to its dealers:  it caused metal fragments to contaminate the entire fuel system.  BMW initially advised me that it  had no \"recall remedy,\"  but when it did, it would replace the fuel pump but would not repair the nearly $13,000 in damage to the fuel system that the fuel pump failure caused.  BMW eventually relented and advised it will complete all repairs caused by the fuel pump failure.  But it has declined to reimburse me for the \"overage\" charges I've incurred in towing the vehicle to the dealer and in connection with the rental vehicle they obtained for me.    And of course, not a single apology for the harrowing experience that could have resulted in our deaths, nor for the considerable inconvenience caused by this defect that BMW has known about for years.",
        "vin": "5UXKS4C38H0"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "06/08/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420147,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Front passage door becomes unlocked/ not secure  while driving  My doors are set to auto-lock when I drive off.  Today’s incident occurred when I hit a normal bump in the road. I heard a pop, which was the front passenger door unlocking. This jarred the door from the locked position to rattling in the door frame. The car’s auto lock issue is activated therefore, it’s trying to lock the door.  Then car system reports a need to stop the car to prevent rolling as the doors are not secure.  It Goes without saying how dangerous this is.     Searchers this issue In the Internet. Seems some X5 owners reporting a issue with the door cables?  Saw no recall.  My car is out of warranty but this is a serious safety issue BMW should address    Help!  Note, this bumpis located in the parking lot entrance to my office’s garage.",
        "vin": "5UXKr0C3xh0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "06/02/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419432,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down the highway at approximately 55mph when the sunroof exploded. Fortunately the sunroof sliding cover was closed and the glass did not enter the car. I did see some pieces flying down the highway behind me. I was not driving under any overpass at time, nor did I hear or see any rocks or objects hit the glass.",
        "vin": "5uxkr0c32h0"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375091,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STOPPED WITHOUT ANY WARNING 3 TIME IN THE MIDDLE OF THE ROAD WHILE DRIVING MY WIFE AND KIDS INSIDE THE CAR. I CONSIDER VERY LUCKY THIS HAPPENED ON COUNTY ROAD TWO TIME AND ONES IN THE SHOPPING CENTER PARKING LOT, INSTEAD OF MIDDLE OF THE HIGHWAY. I HAVE TAKEN THE CAR TO THE DEALERSHIP FOR THE SECOND TIME THEY ARE STILL TRYING TO FIGURE OUT WHAT'S WRONG WITH GAUGES.    LAST TIME IT HAPPENED WAS  11/13 WHILE MY WIFE WAS DRIVING WITH THE DAUGHTER TO DOCTOR'S APPOINTMENT, GAS READING SHOWS ABOVE 1/4 TANK AND 146 MILES REMAINING (I HAVE PICTURES OF THE CLUSTER). BUT THE CAR ABRUPTLY STOP TWITHOUGHT ANY WARNING WHICH WILL BE A DEADLY SITUATION IF HAPPENED IN THE HIGHWAY. THE REASON FOR IT TO STOP WAS NO GAS IN THE TANK THOUGH IT GIVES A READING OF OVER 1/4 TANK 146 MILES REMAINING. MY LAST VISIT TO THE DEALER WAS ABOUT A MONTH BACK AND I WAS TOLD THEY REPLACED THE GAS TANK AND THE SENSOR INSIDE THE TANK WHICH WAS COVERED UNDER VEHICLE WARRANTY. I FEEL VERY UNSAFE DRIVING THIS CAR, I HAVE REPORTED THE ISSUES BMW NA CUSTOMER SERVICE AND THE CAR IS WITH BMW OF ROCKVILLE.",
        "vin": "5UXKR0C34H0"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/20/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360485,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "DUNLOP",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BMW X5 EQUIPPED WITH DUNLOP RUN FLAT TIRES, TIRE LINE: SPORT MAXX SP, TIRE SIZE: 315/35/R20, DOT NUMBER: (UNKNOWN). THE CONTACT STATED THAT ON THE DAY THE VEHICLE WAS PURCHASED, THE VEHICLE WAS TAKEN BACK TO THE DEALER DUE TO LOW TIRE PRESSURE ON THE PASSENGER'S SIDE REAR TIRE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 15 MPH, THE PASSENGER'S SIDE REAR TIRE EXPERIENCED A BLOWOUT. THE CONTACT DROVE THE VEHICLE TO HER RESIDENCE. AN INDEPENDENT MECHANIC OBSERVED THE TIRE AND STATED THAT THE TIRE WAS DEFECTIVE. THE TIRE WAS REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE ON THE VEHICLE WAS 27,000. THE TIRE FAILURE MILEAGE WAS 2,000.",
        "vin": "5UXKT0C32H0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338011,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTO MECHANIC SAID THERE IS A SMALL LEAK IN OIL PAN",
        "vin": "5UXKR2C33H0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/17/2020",
        "dateOfIncident": "06/13/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329377,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BMW X5. THE CONTACT STATED THAT WHILE ATTEMPTING TO MOVE FROM A STOP, THE ACCELERATOR PEDAL WAS DEPRESSED AND THE REAR SUSPENSION RESPONDED BEFORE THE FRONT SUSPENSION. THE CONTACT CALLED AN INDEPENDENT MECHANIC AND SCHEDULED AN APPOINTMENT. NEITHER THE DEALER NOR THE MANUFACTURER WERE MADE AWARE OF THE FAILURE.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 53,100.",
        "vin": "5UXKR0C53H0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2020",
        "dateOfIncident": "02/18/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310424,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 BMW X5 35D  AND THE TRANSMISSION BROKE DOWN WITHOUT A WARNING WHILE I WAS IN MOTION ON THE CITY STREET . I LOST THE ENGINE POWER BUT I WAS  ABLE TO AVOID AN ACCIDENT BY PULLING THE CAR ON THE SIDE . I CHECKED THE FAULT MESSAGE ON THE DISPLAY AND IT SHOWED \"TRANSMISSION MALFUNCTION YOU CAN CONTINUE TO DRIVE AT MODERATE SPEED \" . I WAS ABLE TO DRIVE THE CAR HOME AT  30 MILES PER HOUR MAXIMUM SPEED . WHILE AT HOME I CALLED A TOW TRUCK TO TAKE THE CAR TO THE BMW DEALERSHIP FOR EVALUATION AND REPAIR . I AM GLAD THAT  I AM SAFE IT COULD HAVE BEEN A LOT WORSE IF IT WOULD BROKE DOWN ON THE INTERSTATE .",
        "vin": "5UXKS4C3XH0"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308108,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SATURDAY FEB 8, 2020 AT APPROX 1:30PM  I WAS DRIVING IN MY 2017 BMW X5 M ON HWY 101 FROM PISMO BEACH,CA WHERE WE LIVE TO SANTA BARBARA,CA TO SHOP FOR A DRESS FOR MY 12 YEAR OLD DAUGHTERS UPCOMING VALENTINES DANCE SHE IS HAVING. ABOUT 40 MIN INTO THE DRIVE GOING 65 MI PER HOUR, IT  WAS A BEAUTIFUL CLEAR, SUNNY  DAY WITH TEMPS APPROX 65 DEGREES.I WAS ENJOYING MY DRIVE AND COULD NOT SEE A CAR INFRONT OR BEHIND MY FOR MILES-OUT OF NOWHERE, I HEARD WHAT SOUNDED LIKE A LOUD  SHOTGUN EXPLOSION INSIDE THE CAR.AS SHATTERED GLASS RAINED DOWN AND SLIVERS OF GLASS BLEW ALL AROUND IN THE CAR, MY HEART WAS POUNDING AND MY HANDS BEGAN TO SHAKE, MY MIND SWIRLED AS TO WHAT IN THE WORLD JUST HAPPENED! MY FIRST THOUGHT IS WE HAD BEEN SHOT AT FROM SOMEONE IN THE HILLS WE WERE TRAVELING THRU? WIND BLEW THROUGH THE HUGE HOLE IN MY MOONROOF THAT JUST MOMENTS AGO WAS CLOSED AND SOLID. SHARDS AND PIECES OF GLASS CONTINUED TO FALL ON MYSELF AND MY 12 YEAR OLD DAUGHTER. SHE CALLED OUT TO ME \"WHAT HAPPENED MOM!? ARE WE BEING SHOT AT?\" I TOLD MYSELF TO STAY CALM AND FOCUS ON GETTING OURSELVES TO SAFETY. I FOUND THE NEXT EXIT AND PULLED OFF THE HIGHWAY. I IMMEDIATELY CALLED 911 AND THEY SENT TWO OFFICERS IN TWO DIFFERENT PATROL CARS. MY DAUGHTER AND I GOT OUT OF THE CAR- PIECES OF GLASS IN OUR HAIR AND EVEN DOWN THE BACK OF OUR PANTS AGAINST OUR SKIN. WE COULD NOT FIGURE OUT HOW TINY PIECES OF GLASS COULD GET INTO OUT VERY FITTING JEANS AND I HAD A BELT AND HEAVY SWEATER OVER THEM. WE DID NOT TOUCH ANYTHING AND WANTED TO HIGHWAY PATROL TO SEE THE CAR EXACTLY AS IT LOOKED. WHEN THEY ARRIVED, THEY LOOKED AROUND THE WHOLE EXTERIOR OF THE CAR AND THEN LOOKED INSIDE. AFTER CAREFUL INSPECTION, ONE OFFICER SAID \" THIS DOES NOT LOOK RIGHT, THE GLASS IS BLOWN OUT OF THE CAR, NOT INWARD AS WOULD HAPPEN IF SOMETHING WAS THROWN OR SHOT AT THE CAR. LONG STORY SHORT OFFICER FOUND IT WAS THE DEFECTIVE MOON ROOF.",
        "vin": "5YMKT6C35H0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2019",
        "dateOfIncident": "05/24/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277714,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY WIFE WAS DRIVING TO WORK THE VEHICLE LOST POWER AND STALLED. SHE HAD JUST TURNED OFF THE HIGHWAY, AND ONTO A SIDE STREET. SHE WAS STUCK IN THE MIDDLE OF THE ROAD AND HAD TO BE TOWED. THE VEHICLE WOULD NOT RE-START AND WOULD NOT ENGAGE TO NEUTRAL, SO THE TOW TRUCK DRIVER HAD TO USE SKID BLOCKS. BMW INSPECTED AND FOUND THE FUEL PUMP HAD FAILED AND CONTAMINATED THE ENTIRE FUEL SYSTEM WITH SWARF. THIS LEAVES THE DRIVER AND VEHICLE IN A DANGEROUS POSITION AS THE VEHICLE COMPLETELY STALLS WITH NO PRIOR WARNING.",
        "vin": "5UXKS4C37H0"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/05/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267136,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "SCORPION VERDE ALL SEASON",
                "productYear": "9999",
                "size": "265/50/R19",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT'S SON OWNS A 2017 BMW X5 EQUIPPED WITH PIRELLI SCORPION VERDE ALL SEASON TIRES, SIZE: 255/50R19 107W (NA). WHILE DRIVING 60 MPH, THE VEHICLE SHOOK VIOLENTLY. THE DRIVER VEERED TO THE SHOULDER OF THE ROAD WHERE THE CONTACT NOTICED THE TREAD SEPARATED FROM THE REAR TIRES. THE VEHICLE WAS TAKEN TO A COLLISION CENTER WHERE IT WAS DIAGNOSED THAT THE TREAD SEPARATED FROM THE TIRES. BOTH REAR TIRES WERE REPLACED; HOWEVER, APPROXIMATELY ONE MONTH LATER, THE REAR PASSENGER TIRE TREAD SEPARATED AND WAS REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THEY WOULD INSPECT THE TIRES. THE FAILURE MILEAGE WAS 17,000.",
        "vin": "5UXKS4C36H0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "10/25/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243233,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BMW X5. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V755000 (ENGINE AND ENGINE COOLING). THE CONTACT CALLED HERB CHAMBER BMW OF SUDBURY AT 833-805-4492 (LOCATED AT 128 BOSTON POST RD, RTE 20, SUDBURY, MA 01778) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5UXKS4C30H0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221686,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 18V755000  EXHAUST GAS RECIRCULATION MODULE COOLER LEAKS AND MIXES WITH DIESEL SOOT CAUSING MELTING OF THE    THIS SPECIFIC RECALL HAS NOT BEEN ADDRESSED. NUMEROUS CALLS HAVE BEEN MADE TO BMW TO SEE THE STATUS OF THE REPAIR, BUT THEY CANNOT/WIIL NOT/DO NOT PROVIDE ANY INFORMATION. I THINK THAT 6 MONTHS IS SUFFICIENT TIME TO MAKE A PART AVAILABLE FOR A SAFETY RECALL. WHEN WE SPEAK TO BMW THEY ARE NOT FORTHCOMING AT ALL ON ANY TIMELINE.     QUITE FRANKLY, 8 MONTHS WITH AN OPEN SAFETY RECALL IS NOT OK BY ANY MEASURE. I DO NOT KNOW WHAT A REASONABLE TIMELINE WOULD BE. BUT I WOULD THINK 3 MONTHS MAX MAKES SENSE.    THIS IS NOT CURRENTLY MY VEHICLE. IT IS A VEHICLE I AM ATTEMPTING TO ASSUME THE LEASE ON. BMW WILL NOT ALLOW THE TRANSACTION TO OCCUR SINSE THERE IS AN OPEN RECALL. BUT THEY ARE LESS THAN HELPFUL. CURRENT LESSOR TRULY WANTS TO LET ME ASSUME THE LEASE. I AM HOPEFUL THERE CAN BE A SOLUTION EFFECTED HERE.",
        "vin": "5UXKS4C3XH0"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206263,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE MORNING OF APRIL 17, 2019, MY WIFE SMELLED AND NOTICED SMOKE COMING OUT OF THE BACK SEAT OF OUR BMW X5 2017 MODEL WHILE IT WAS PARKED ON THE STREET OUTSIDE OUR HOUSE. THE SMOKE WAS COMING OUT OF A SMALL HOLE ON THE PASSENGER SIDE REAR SEAT NEAR THE SEAT BELT BUCKLE HOLDER. AREA AROUND THE HOLE WAS EXTREMELY HOT. SHE PUT A WET TOWEL OVER THE HOLE AND THE HOT AREA TO CONTROL THE SMOKE AND TO COOL DOWN THE SEAT. OUR BMW IS EQUIPPED WITH REAR SEAT HEATING SYSTEM. ON THE SAME DAY, SHE TOOK IT TO LOCAL BMW DEALERSHIP. DEALERSHIP KEPT THE CAR AND AFTER TWO WEEKS, INFORMED US THAT THEY HAVE FOUND NO ISSUES WITH ANY OF THE BMW PARTS AND BELIEVE THAT BURN WAS TRIGGERED THROUGH AN EXTERNAL AGENT. WE ARE NOT SATISFIED WITH THEIR EXPLANATION AS I HAVE FOUND MANY REPORTS IN ONLINE DISCUSSION FORUMS WHERE PEOPLE HAVE REPORTED SIMILAR ISSUES AND CAR MANUFACTURERS HAVE FOUND PROBLEMS WITH SEAT HEATING SYSTEMS. I WOULD LIKE AN INDEPENDENT INVESTIGATION TO ENSURE THERE IS NO CURRENT OR FUTURE SAFETY ISSUE WITH BMW SEAT HEATING SYSTEMS.",
        "vin": "5UXKR2C35H0"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197046,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE SEIZED WITH 100,500 MILES WHILE DRIVING AND CAR SHUT DOWN VERY SCARY! AWFUL CAR, EMBARRASSING HOW MANY THO HA GO WRONG WITH THIS SUV THEY SHOULD BAN BMW FROM PUTTING A PRODUCT LIKE THIS IN THE USA MARKET!",
        "vin": "5XXGR4A62FG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "03/06/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192951,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 BMW X5. CONSUMER WRITES IN REGARDS TO PROBLEM WITH THE I-DRIVE. *LD  *JS",
        "vin": "5UXKT0C36H0"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2019",
        "dateOfIncident": "03/19/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194551,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BMW X5. THE CONTACT STATED THAT THE VEHICLE ACCELERATED SPONTANEOUSLY IN THE PRESENCE OF ELECTRIC RADIO WAVES. BMW OF PEABODY (221 ANDOVER ST, PEABODY, MA 01960, 1-(877) 530-0807) INDICATED THAT THE FAILURE WAS A SAFETY LIABILITY AND TURNED OVER THE TECHNICAL GUIDANCE TO A BMW ENGINEER. A LOANER VEHICLE WAS PROVIDED BY THE BMW MANUFACTURER. THE FAILURE WAS UNABLE TO BE DUPLICATED AND DIAGNOSED. THE VEHICLE WAS NOT REPAIRED AND WAS TO BE TRADED FOR ANOTHER VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE SEVERAL TIMES AND PROVIDED NO REMEDY. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 111,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192376,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS BEEN IN FOR SERVICE 5 TIMES WITH ELECTRICAL ISSUES IN THE PAST YEAR.  FIRST, THE AIRBAG AND SAFETY RESTRAINT SYSTEM FAILURE OCCURRED ON 3 DIFFERENT OCCASIONS AND I WAS TOLD IT WAS DUE TO AN ELECTRICAL ISSUE.  NOW, FOR THE SECOND TIME A DRIVETRAIN MALFUNCTION HAS OCCURRED THAT I HAVE BEEN TOLD IS ALSO DUE TO AN ELECTRICAL SOFTWARE ISSUE.  THE VEHICLE SHUT OFFS WHILE IN OPERATION (IN MOTION GOING 70 MPH), PUTS ITSELF INTO NEUTRAL AND THE ENGINE SHUTS DOWN NO MATTER THE SPEED.  I FEEL UNSAFE DRIVING THE VEHICLE BECAUSE IT SHUTOFF ON ME WHILE DRIVING ON THE INTERSTATE PUTTING ME AT RISK OF CAUSING HARM TO MYSELF AND OTHERS.",
        "vin": "5UXKT0C34H0"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170627,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON CITY STREET, VEHICLE LOST POWER AND STALLED. WAS ABLE TO KEEP THE VEHICLE ROLLING INTO A PARKING LOT. WOULD NOT RE-START AND WOULD NOT ENGAGE TO NEUTRAL FOLLOWING EMERGENCY PARK RELEASE PROCEDURE. BMW INSPECTED AND FOUND CATASTROPHIC FUEL PUMP FAILURE THAT SENT PARTICLES INTO FUEL SYSTEM AND INJECTORS. THE VEHICLE IS A 3.5D DIESEL MODEL. OTHER OWNERS OF SIMILAR VEHICLES HAVE COMPLAINED ABOUT SAME ISSUE AND RE-OCCURRING AFTER WARRANTY REPAIR. THIS LEAVES THE DRIVER AND VEHICLE IN A DANGEROUS POSITION AS VEHICLE COMPLETELY STALLS WITH NO PRIOR WARNING.",
        "vin": "5UXKS4C33H0"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2018",
        "dateOfIncident": "11/17/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153627,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE IN OUR 2017 BMW X5 DIESEL DRIVING ON HIGHWAY 14S IN SANTA CLARITA, CA ON THE 17TH OF NOV 2017 AT 1:30PM . ACCELERATED TO PASS A CAR, FELT A SUDDEN SURGE, DRIVETRAIN MALFUNCTION INDICATION CAME ON, INDICATED SAFE TO PROCEED AT A MODERATE SPEED.  ATTEMPTED TO ACCELERATE, NO RESPONSE.  WAS ABLE TO COAST TO THE RIGHT MEDIAN BETWEEN THE FREEWAY AND THE ON-RAMP AWAY FROM ON-COMING CARS.  BMW CAME TO A COMPLETE STOP AND WAS NOT ABLE TO START. CONTACTED BMW ASSIST, WAS INFORMED THAT IT WOULD BE ABOUT A 3 TO 4 HOUR WAIT FOR THE TOW VEHICLE. TOW VEHICLE ARRIVED AT 2:45 PM, UNABLE TO PUT X5 IN NEUTRAL, HAD TO USE SKID PLATES TO GET X5 ONTO THE TOW VEHICLE. GOT THE X5 TO THE DEALERSHIP AT 3:20PM, INFORM THE CONSULTANT WHAT HAPPENED AND LEFT THE X5 THERE.  CONSULTANT CALLED ON MONDAY AND INFORMED US THAT THE HIGH PRESSURE FUEL PUMP WAS THE ISSUE AND THAT BRASS SHAVING FROM THE FUEL PUMP CONTAMINATED THE SYSTEM, INFORMED US THAT THEY WERE GOING TO REPLACE ANYTHING FROM THE BACK TO THE FRONT OF THE VEHICLE THAT WAS EFFECTED BY THE FUEL PUMP.",
        "vin": "5UXKS4C32H0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/16/2018",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140891,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 BMW X5. CONSUMER WRITES IN REGARD TO MANUFACTURER SELLING NEW VEHICLE WITH DEFECTIVE AXLES.  *AS  *JS",
        "vin": ""
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104540,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 BMW X5. THE CONTACT STATED THAT THE ACTIVE DRIVE ASSIST MODULE WAS FAILING. THE CONTACT'S SPOUSE TOOK THE VEHICLE TO SANDY SANSING BMW (186 W AIRPORT BLVD, PENSACOLA, FL 32505, (850) 477-1855) FOR ROUTINE SERVICE AND IT WAS NOTICED THAT THE ANTI-CRASH SYSTEM WAS DAMAGED. THE VEHICLE'S COMPUTER WAS NOT DETECTING CRASH ISSUES OR WARNINGS. WHILE DRIVING, THE VEHICLE FAILED TO DETECT A LARGE AMOUNT OF TRASH AND DEBRIS IN THE MIDDLE OF THE HIGHWAY. THE DEALER STATED THAT THE MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS AWAITING REPAIRS. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 8,461. *TT  *TR",
        "vin": "5UXKR6C31H0"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "03/09/2018",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11078337,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WAS REAR ENDED CAUSING LOSS OF POWER AND CONTROL TO VEHICLE PUSHING HER OVER TRAIN TRACKS IN THE VEHICLE WITH NO CONTROL.",
        "vin": "5UXKR0C38H0"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "12/09/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075351,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW X5 2017 HIT MY GARAGE DOOR AFTER I PUT IT IN PARK MODE. I BELIEVE THAT IT WAS CAUSED BY ITS TRANSMISSION PROBLEMS AND THE FAILED HANDBRAKE. ON THAT NIGHT, I STOPPED MY CAR ON A SLIGHTLY INCLINED DRIVEWAY. I TURNED ON THE HANDBRAKE, PUT THE CAR IN PARK MODE, TURNED OFF THE ENGINE, AND THEN STEPPED OUT OF THE CAR. ABOUT 10 SECONDS LATER, THE CAR ROLLED FORWARD AND HIT MY GARAGE DOOR. IT WAS SNOWING THAT NIGHT, BUT THE SNOW WAS LESS THAN ONE INCH. THE CAR DIDN'T SLIP BECAUSE THE FOUR WHEELS ROLLED FORWARD. I TESTED IT A FEW TIMES RIGHT AFTER THE INCIDENT AND THE CAR STILL ROLLED FORWARD WITH THE HANDBRAKE ON AND AFTER SHIFTING TO P MODE. THE TRANSMISSION AND HANDBRAKE FAILED TO WORK SEVERAL TIMES ON THAT NIGHT, BUT I CANNOT RE-GENERATE THE SAME RESULT SINCE THAT NIGHT.  WHEN I SEARCHED FOR SIMILAR CASES ONLINE, I FOUND THAT A BMW X5 2012 HAD THE SAME ISSUE IN 2013. BMW DENIED THAT MY CAR HAS ANY ISSUES AFTER INSPECTING IT, IT IS THE SAME RESPONSE TO THE CASE IN 2013. THIS CAR IS UNSAFE FOR PEDESTRIANS AND DRIVERS. WE NEVER KNOW WHEN THE TRANSMISSION AND HANDBRAKE WILL FAIL TO WORK PROPERLY. IT HAPPENED ONCE, AND IT CAN HAPPEN AGAIN ANYTIME, ANYWHERE.",
        "vin": "5UXKR0C39H0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "01/21/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11064408,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW X5 HAS A STORAGE PACKAGE, IT ADDS TWO LASHING RAILS AND 4 LASHING EYES IN CARGO/TRUNK. THE FINISH OF THIS LASHING RAILS IS LIKE A RAZOR. I WAS UNLOADING A BOX AND MY PINKY FINGER GOT TRAPPED INSIDE THIS LASHING RAIL AND IT SLICED THE FINGER SKIN. IT TOOK ABOUT 30 MINUTES TO CONTROL THE BLEEDING FROM FINGER AS LASHING RAILS HAD SLICED GOOD CHUNK OF PINKY FINGER.",
        "vin": "5UXKR0C3XH0"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/04/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043164,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY TRAVELING AT 55 MPH THE VEHICLE LOST POWER STEERING AND BRAKES WITHOUT WARNING. THE DASHBOARD IT UP SIMULTANEOUSLY WITH THE BRAKE AND STEERING PROBLEM. HAVINING NOWHERE TO PULL OVER SAFELY; I SLOWED DOWN AND CONTINUED ON TO A SAFE LOCATION. ININTIALLY, I COULD NOT TURN IGNITION OFF. THE VEHICLE IS BRAND NEW, HAVING ONLY 385 MILES ON ODOMETER. VEHICLE  CONTINUED TO LOOSE ALL POWER, AND BY THE TIME THE TOW TRUCK ARRIVED VEHICLE  REAR DOOR WOULD NOT OPEN AND COULD NOT GET CAR INTO NEUTRAL. I WAS TERRIFIED WHILE THIS WAS HAPPENING AND CONTINUE TO TRY TO UNDERSTAND HOW THIS COULD HAPPEN WITHOUT WARNING WHILE DRIVING. THERE WERE  ABSOLUTELY NO WARNING INDICATORS PRIOR TO INCIDENT. VEHICLE IS AT BWW DEALER BEING CHECKED. AT THIS TIME I HAVE NO IDEA WHAT CAUSED THE LOSS OF POWER. HOWEVER, I DRIVEN FOR 45 YEARS AND HAVE NEVER HAD CAR LOOSE POWER CONTROLS WHILE DRIVING. WHAT IF IT HAD HAPPED AT NIGHT? DURING A WINTER STORM? AGAIN, I WAS TERRIFIED.",
        "vin": "5UXKR0C31H0"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/22/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019027,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SEAT BELT ON A BRAND NEW, BMW 2017 X5 XDRIVE 35I HAD A SEAT BELT BUCKLE THAT WOULD RATTLE AND SHAKE WHEN THE DRIVER WAS SEATED. THE BUCKLE WOULD CONTINUE TO RATTLE AS THE DRIVER DROVE DOWN THE ROAD. THE BUCKLE WOULD RATTLE WHEN THE VEHICLE WAS STATIONARY, IN MOTION, OR RUNNING. THE BUCKLE ON THE PASSENGER SIDE DID NOT HAVE THIS ISSUE. IT APPEARS TO BE VERY DANGEROUS TO HAVE A DRIVER SEAT BELT THAT IS NOT PROPERLY MANUFACTURED.",
        "vin": "5UXKR0C54H0"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "07/22/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010463,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING INTO A PARKING SPACE, AT A VERY SLOW SPEED, THE BRAKES FAILED AND THE CAR HIT THE BUILDING BEHIND THE PARKING SPOT.  NEXT DAY, WHILE PARKING AT A CONVENIENCE STORE, ALSO AT A VERY SLOW SPEED, THE BRAKES FAILED AGAIN AND HIT A POST. BOTH TIMES THE BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR. THE FIRST TIME, I THOUGHT I HAD MADE A MISTAKE, BUT AFTER THE SECOND INCIDENT I REALIZED THE BRAKES FAILED. ON THE WAY HOME, I FOUND THAT I COULD DUPLICATE THE PROBLEM AT WILL WHILE AT A VERY SLOW SPEED (SIMULATED PARKING SITUATION). I CONTACTED THE DEALER AND THEY PICKED THE CAR UP FOR DIAGNOSTICS AND REPAIR. BOTH PARKING INCIDENTS CAUSED BODY DAMAGE. I AM GRATEFUL THERE WERE NO INJURIES TO OTHERS OR NO DAMAGE TO PROPERTY OTHER THAN MY CAR.",
        "vin": "5UXKR0C39H0"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004191,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RETURNING FROM TEXAS AND DRIVING AT HIGHWAY SPEEDS MY CAR'S DRIVETRAIN WARNING LIGHT SAID I NEEDED SERVICE BUT I COULD CONTINUE DRIVING AT MODERATE SPEEDS.  I DROVE TO BMW OF DALLAS.  THEY DETERMINED MY #5-CYLINDER FUEL INJECTOR HAD FAILED.  I STAYED THE NIGHT IN DALLAS AND RETURNED TO THE DEALERSHIP THE NEXT DAY.  AFTER REPLACING THE INJECTOR, THE CAR WOULD NOT IDLE PROPERLY.  I DROVE A RENTAL CAR HOME AND LEFT MY CAR.  THE DEALERSHIP DID EXTENSIVE TESTING TO DETERMINE THE CAUSE OF THE ISSUE OVER THE NEXT THREE AND A HALF WEEKS.  EVENTUALLY THEY DETERMINED THE INJECTOR FAILURE CAUSED A BACKFIRE WHICH BENT THE #5 INTAKE VALVE.  THE ENGINE HAD TO BE REMOVED SO THEY COULD REPLACE THE DAMAGED COMPONENTS.  ALL VALVES HAD TO BE LAPPED; THE VALVE STEM SEALS HAD TO BE REPLACED AND THE ENGINE HAD TO BE REINSTALLED.  THE VEHICLE WAS TRANSPORTED TO ME 26 DAYS LATER.  I DISCOVERED THREE OF THE FIVE SCREWS WHICH SECURE THE BATTERY COVER WERE MISSING.  I DROVE THE CAR FOR THE NEXT THREE DAYS AFTER WHICH IT BEGAN MAKING CLANKING NOISES FROM THE DRIVESHAFT.  THE CAR WAS TOWED TO BMW OF KANSAS CITY SOUTH WHO DETERMINED THE DALLAS DEALERSHIP FAILED TO INSTALL ONE OF THE DRIVESHAFT'S CARRIER BOLTS NOR DID THEY PROPERLY TORQUE A SECOND CARRIER BOLT.  THESE ARE SERIOUS PERSONAL SAFETY CONCERNS.  THESE REPAIRS WERE ALSO REPORTED TO CARFAX AS REGULARLY SCHEDULED MAINTENANCE.  I FILED A FORMAL COMPLAINT WITH BMW OF NORTH AMERICA AND ASKED THAT THEY REPURCHASE THE VEHICLE WHICH THEY REFUSED TO DO.  INSTEAD THEY HAVE OFFERED ME A SMALL CASH SETTLEMENT IF I WILL SIGN A GENERAL RELEASE WAIVING MY RIGHTS AND AGREEING THAT I NOT TO PURSUE ANY FUTURE CLAIMS OR LEGAL ACTIONS AGAINST THEM OR THEIR DEALERSHIPS.  I'M REPORTING THIS AS I AM CONCERNED THESE ISSUES MAY BE PREVALENT WITH OTHER BMW X5 VEHICLES WHICH COULD POTENTIALLY RESULT IN SERIOUS INJURY OR DEATH.",
        "vin": "5UXKR0C52H0"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "01/16/2017",
        "dateOfIncident": "12/20/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 2,
        "odiNumber": 10945481,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2017 BMW X5 WAS INVOLVED IN A FATAL CAR ACCIDENT AND THE DRIVER'S SIDE AIR BAG DID NOT DEPLOY CAUSING A HEAD INJURY.  A DRIVER WAS DRIVING SOUTHBOUND LOST CONTROL ON ICE AND WENT INTO THE NORTHBOUND LANE WHERE ANOTHER VEHICLE STRUCK THE OUT OF CONTROL CAR CAUSING THOSE VEHICLES TO HIT OUR BMW AND PUSHING OUR VEHICLE OFF THE ROAD.  *TR",
        "vin": "5UXKR0C34HO"
    }
]