[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "03/27/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The gear shift when in drive can be pushed into other gears without pushing the button. When driving down the highway going 70 mph, my dog has more than 10 times pushed it into neutral. It’s extremely dangerous.",
        "vin": "2GNALBEKXH6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2022",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456837,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Equinox. The contact stated that while driving 65 MPH, the vehicle started sputtering and then lost motive power and stalled. There were no warning lights illuminated.  The contact checked the oil and noticed that there was no oil in the engine. The oil indicator showed 46 percent oil life remaining. The vehicle was taken to an independent mechanic who informed the contact that the rear main seal needed to be replaced. Additionally, there was condensation in the engine and main seal had popped out. The local dealer was contacted. The vehicle was not diagnosed or repaired. The manufacturer was notified but no further assistance was provided. The approximate failure mileage was 134,000. The VIN was not available.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "In February 26, 2022, my wife was driving and I was in passenger seat. At approximately 2123 hours, we came over a slight hill and hit a cow at 70 miles an hour on state Highway 95 between Academy, Texas and Temple, Texas. Our airbags did not deploy and my seatbelt malfunctioned as I hit my head on dash.",
        "vin": "2GNALBEK7H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/14/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451871,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact’s daughter owns a 2017 Chevrolet Equinox. The contact stated that while the vehicle was parked, his daughter noticed that oil was leaking underneath the vehicle. The contact stated that he checked the oil level of the vehicle and noticed that the vehicle was low on oil. The contact added 3 quarts of oil to the engine. The contact stated that while his daughter was driving 50-55 MPH, the vehicle started making abnormal sounds. The contact’s daughter veered to the side of the road. The contact met his daughter and checked the oil level. The contact noticed that the oil level was 2 quarts low and topped off the oil; however, the failure reoccurred the following day and the vehicle was jerking. The warning message “Reduced Power” was illuminated. The vehicle was towed to the dealer where it was diagnosed that the PCV valve had caused a rear main seal failure, which damaged the engine. The vehicle was not repaired. The manufacturer was contacted and the contact inquired why his daughter’s vehicle was not included in GM Technical Service Bulletin No.: 14882 but the manufacturer referred the contact to NHTSA for assistance.  The failure mileage was approximately 90,000.",
        "vin": "2GNFLFEK0H6"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/08/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Equinox. The contact stated while driving approximately 60 MPH and slowing down, the vehicle started to lose power. The contact mentioned there was a strong odor coming from the vehicle. The contact stated that she then saw smoke, and drove her vehicle to the nearest independent mechanic. The contact was advised that her PCV valve had fractured due to it being frozen, causing the rear main oil seal to explode. The contact was also advised that the smoke was due to the oil leakage underneath the vehicle. The contact stated that she then had her vehicle towed to the dealer who advised that they had several vehicles that were the same year, make, and model as her vehicle, already being repaired for the same failure and that she had to take her vehicle to another dealer. The contact stated that she then had her vehicle towed to another dealer where it remains currently. The manufacturer was notified of the failure. The failure mileage was 67,000",
        "vin": "2GNALCEK7H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2022",
        "dateOfIncident": "01/22/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450781,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Equinox. The contact stated while driving at an undisclosed speed, the oil warning light illuminated. The contact was stranded in the cold for approximately four hours. The vehicle was towed to the local dealer. The contact stated that the vehicle was not covered under warranty or TSB: PIP5093C. The vehicle was diagnosed and the contact was informed that the rear main seal needed to be replaced. The vehicle was not repaired. The contact stated that the warranty program should be extended. The manufacturer was contacted but, no further assistance was provided. The approximate failure mileage was 90,261.",
        "vin": "2GNFLEEK9H6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "01/18/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449828,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "This is a well known issue with the Equinox. The rear main seal goes and oil pours out the vehicle causing other issues to the engine, like the intake manifold. My rear exhaust manifold was cracked and now codes are coming up for timing chain. The dealer wanted over $2600 to repair since my warranty was expired. Haven’t had the car 3 yrs and I personally only put under 50 K miles on the vehicle. Still owe $12000 for a junk SUV. The recall only covers 2010-2014 models yet GM is putting the same engine in newer models. This should be recalled due to all the complaints. My mechanic sees this all the time with the Equinox. I found a mechanic to repair for $1560+ but did not include timing chain. Still have check engine light on.",
        "vin": "2GNFLFEK8H6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "It seems to be a known problem with the pvc valve getting moisture in it,  freezes,  and then blowing the main seal. I found lots of records online of other victims.  It caused loss of vehicle power and dumped oil on the road.  Chevy refuses to cover it with a recall and I'm stuck with a $2500 repair on a vehicle with less than 100k miles.  I have it at a shop now.  I have talked to a dealership and Chevrolet customer service and they say they know it's a problem but there's no recall on it.",
        "vin": "2gnalcek3h1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2022",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Excessive oil consumption. My car started burning oil even though I get frequent oil changes and now my engine is blown.",
        "vin": "2GNALBEK2H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/23/2022",
        "dateOfIncident": "12/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle shutters when shifting up and hard shifts down in lower power bands.",
        "vin": "2gnalbek3h1"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2022",
        "dateOfIncident": "01/21/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Yesterday, my son noticed that his 2017 Chevy Equinox LX four-cylinder was not accelerating as much. He purchased this vehicle only one year ago. It is a five-year-old vehicle with not many miles on it. The oil was just changed in November 2021. He only drives 8 miles to and from work. While stopped at a light or stop sign yesterday, my son's SUV would \"putt-putt\" or shut off completely. There was a strong smell of oil coming from the air vents and filling the SUV. When my son pulled over to park, he decided to check it out. From underneath the vehicle, where the transmission is located, there was a huge puddle of oil on the ground. A leak between the oil pan and transmission was discovered when my son took his car to his mechanic.  It shouldn't be like this. I checked if there were any recalls. For 2017, I did not find any under the VIN number, however, there were quite a few complaints from customers about the same issue. Is there anything my son should do? He needs the car for work.",
        "vin": "2GNFLFEK4H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2017 equinox started sounding and running rough. It lost power and engine lights came on. Car died. Tried to drive it to dealership to get looked at and it continued to lose power and ended up having to tow it to dealership. They finally found the problem and said the timing belt stretched, causing all 16 valves to hit the pistons, bending all 16 valves. Only 73,000 miles on vehicle. Power train warranty expired at 60,000 miles (naturally) and will cost us $5500 to have fixed. My husband and i have had Chevrolet all our lives and never am issue like this. I feel this is a safety issue because this could have left me stranded on the side of the road in bitter cold weather. I feel it is a manufacturing defect that caused the issue and it should be covered by a power train warranty lasting longer than 60,000 miles!",
        "vin": "2GNALCEK2H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447691,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My 2017 Chevy Equinox’s engine got ruined because of no oil. It’s impossible for no oil because I took it to the dealership for an oil change two months ago (November 12, 2021). It had 42,922 miles.   On January 10th,  with  approximated 43,500 miles driven, my car started to shake on red lights or when on idle so the next day I took it to the dealership to figure out the problem with my car. They told me that I was driving with no oil. Which caused the engine to fail and has to be replaced, however I never got the low oil light. Warnings did apear on the dashboard, Low Oil Pressure, check engine light, and engine power reduce and service StabiliTrak but once I arrived to the dealership which was already too late by then.   I was never informed by the oil consumption even by the dealership mechanics. Which I always took it there. Since it was my first car and being the newest car model at the time I always wanted to be well taken care of. And it’s impossible that the oil would be completely gone within two months and 590 miles driven.  As of now, my car is currently being work on by a different auto shop. I’m going to pay up to $8,000 to get my engine replace. I’m in need in getting it repaired as fast as possible due to needing it to drive between jobs and picking up my siblings from work/school.  Apparently I’m not the only person that has had this exact problem with their Chevy Equinox.  Thankfully I experienced the problems when I was closed to the dealership and had no one with me. I read other people’s experience that they had a full car packed with family members or having the car staled in the middle of the street. This problem is a high risk to everyone on the road.",
        "vin": "2GNALCEK2H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447701,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Regular oil changes. Most recent was 67 days prior to my 63500 mile engine being ruined due to No Oil. Was driving on the highway, first time the vehicle made any noise, within 2 miles car was completely done. Had it towed and mechanic said there was no sign of a hole, there was just no oil! He said it is a known problem with GM and that there are no motors available because everyone is having to replace! No diagnostic saying oil % was low or at 0%! New engine quote was $9000, would take at least a month to get and will have the same issue most likely.",
        "vin": "2gnalbek1h1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447470,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Equinox. The contact stated that the vehicle was leaking oil as oil was found on the garage floor. The vehicle was taken to an independent mechanic where the diagnosis was that the PCV valve was frozen however, the repairs were unknown to the contact as the mechanic stated that the issue was resolved. The contact stated that while his daughter was driving the oil warning light illuminated. The vehicle was towed back to the independent mechanic. The independent mechanic started the vehicle and noticed oil was leaking from the rear main seal. The engine and transmission needed to be removed to replace the rear main seal. The vehicle had not been repaired. The contact stated that the mechanic informed him that there was a recall for the failure. The contact stated that he called the dealer and manufacture and it was confirmed that the VIN was not included in a recall. The contact was referring the failure to an unknown manufacturer recall. The approximate failure mileage was 58,000.",
        "vin": "2GNALCEK9H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447241,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "So I was driving home from work which is a 28 minute drive, when I was almost 2 miles away from home the car started to make a funny noise and it started to smell like gas inside from the vents.When I turned off a major street the the car slowed completely down without any warning on the dashboard and luckily I was right in front of a autoshop so I hurried up and pulled in. As soon as I pulled in, the car started to get smoky in the inside so I hurry up and jump out wasn't sure if the car was going to start a fire. When I go inside the shop it was a lady with the same car as mine but just gold and she was complaining that oil was pouring out. The owner of the shop asked me what's wrong because I was a little distraught and I told him my car just slowed down and start smoking inside of the car. He said what ok ill take it right in to see what's wrong. 10 mins later he comes out with a video on his phone showing oil leaking all around the the engine, Trans and front of the car all the way to the muffler. He said this is common with these Equinox with the 4 cylinder engine, the rear main seal did not hold and all the oil leaked out. I bust out crying, I didn't even make it to 3yrs yet and still owe 12,000 on the car. I keep up with oil changes and the car never said I was low on oil I checked, it showed 40%. The owner say calm down we can call the dealership to see if they have a recall. So we call they knew exactly what the problem was and ask how many miles I had and he say sorry your your 2,000 miles over your warranty, I'm sorry I can't do anything for you. The owner of the shop say sorry I see this all the time with these Equinox and its ridiculous we just found out the gold one have the exact same issue. I'm writing to you because I did some research and this is a common issue with this model. I seen a lot of the rear main seal fail when the temperature drop and the water build up where the cover of the engine is and freeze inside and the seal don't hold.",
        "vin": "2gnalcekxh6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "01/04/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446581,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Equinox. The contact stated that while the vehicle was in for service, it was discovered that water was present inside the engine PCV. The contact was informed that the condition could lead to engine damage. The contact was informed that a hole needed to be drilled into the PCV unit to allow airflow. The contact was informed that the manufacturer had issued an extended warranty coverage for the issue however, her model year vehicle was not included. The vehicle was not yet repaired. The manufacturer was notified of the failure. The failure mileage was 51,000.",
        "vin": "2GNALBEK2H1"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "12/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444648,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Timing chain system and ABS",
        "vin": "2gnfLfek1h6"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "10/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Had a no start on two times, starter would act like a dead battery. Then a week or so later the Instrument lights went out and back on and then out again, so did the bluetooth went out black screen. not fixed yet",
        "vin": "2gnflgek9h6"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "This was previously reported on March 10 2021 and I was given case #9-6591373301.  It was a lease car that was returned to the dealership on March 31, 2021. After hitting a pothole in March 2020, the airbag light stayed on. The dealership did not take care of the problem and I was told at that time there were no recalls for that problem.  I was told I could get it fixed and save the bill. Once an investigation was started and it was determined that indeed there was a problem, I should be entitled to be reimbursed.  To date there have been no recalls although my mechanic had to replace both seat belts because replacing the driver's seat belt did not correct the problem. The diagnostic showed there was a seat belt problem and when they were removed you could see they were defective. When I returned the car I gave the service department the seat belts and to date, I have heard nothing.  They did say because the defective seat belts had been replaced they would not be able to determine if the seat belts I turned in had a problem, which made no sense.  Is that why no one bothered to contact me?",
        "vin": "2GNFLEEK0H6"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While the vehicle is being driven a message will appear service tire monitor system and all gauges on the dash do not work, the radio, heating a/c also stops.The message quickly changes to service airbag. (Photos of both messages attached) Issue started Nov of 2020 Vehicle has been seen by Gordon Chevrolet MI 4 times for service and they are unable to find the issue.  We did inform them that if we moved the driver seat just a bit that seem to reset it. Doesn't seem to be as responsive to that now. At one point the BCM was mentioned but still as of today not resolved or fixed. My concern is when the vehicle says service airbag and  you are driving it down the road I don't know that this airbag will work if something were to happen. The dealership is well aware of the ongoing unresolved issue and I have another appointment for November 1,2021 so they can look at it again.",
        "vin": "2GNaLCEK1H6"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Wipers stoppeped working while driving while doing 70mph on the interstate do to a linkage issue that is already known about but not recalled.",
        "vin": "2gnalcek4h1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/25/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430484,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I heard some scraping sounds while driving.  It sounded like something dragging on the ground.  Checked and saw nothing.  Continued on driving then a few miles later saw some light smoke in rear view mirror.  Pulled to shoulder of interstate and lifted hood to see smoke from behind engine.  Vehicle was towed to auto dealer where it was purchased.   No warnings of any kind from the systems.  Service department identified the problem as a hole in the transfer case which was covered under the CPO extended warranty.  Chevrolet has not been able to provide the parts for the dealer to fix the vehicle since the beginning of May and is now saying the November 12, 2021 expected delivery of the parts probably will not happen. No customer courtesy vehicles are available and Chevy Corporate customer relations recommended that I rent a GM product from Enterprise and once the vehicle is repaired submit the rental bill for reimbursement.  The vehicle is sitting in the back of the Curry Chevrolet lot collecting dust should the NHTSA want to take a look at it.  It should be there until GM can \"find\" the parts to fix the almost 5 model year old vehicle.",
        "vin": "2gnflfek8h6"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Equinox. The contact stated while driving at an undisclosed speed, the contact heard a loud grinding sound coming from the passenger’s side front of the vehicle. The vehicle was taken to the local dealer, but the mechanic was unable to determine the cause of the failure. The failure persisted and the vehicle was brought back to the same dealer to be diagnosed. The contact was informed that the rotors needed to be cut. The mechanic cut the rotors however after several months the failure recurred. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was 67,000.",
        "vin": "2gnflfek1h6"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "06/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine/timing chain and heads for my 2017 Chevrolet Equinox failed. I only had this vehicle for 4 years 4 months with only 113,000 miles. I feel my safety was put at risk because out of nowhere my vehicle began jerking and bucking back in forth very badly. I had my vehicle totally diagnosed with Gateway Tire Center and Service, which cost me $283.17, just for a diagnosis. My vehicle has not been inspected due to this vehicle was brand new with zero miles when I purchased it on October 30, 2016. All maintenance has been kept up regularly on my vehicle. Before my vehicle all of sudden quit running there were no indications that there was a problem until the engine light popped on after it started the jerking and bucking back in forth. I am highly upset with the dealership who sold me this vehicle because I know they knew this vehicle would not operate any more after a certain amount of mileage. I should not have to be trying to car shop this early on for a new vehicle.  I am only 13000 to 14000 miles outside of my warranty with this vehicle it is no way I should have to either purchase a new engine or buy a new vehicle. I need something done about this immediately.",
        "vin": "2GNALBEK5H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "05/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "power lift gate is falling on it own even when we lift it manualy",
        "vin": "2GNFLGE35H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2021",
        "dateOfIncident": "05/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On May 24, 2021, my 2017 Chevrolet Equinox was sitting in my driveway.  While my son was vacuuming the car out he heard a boom and jumped out.  The rear window had shattered.  No one was around and nothing had hit it.  The temperature outside was 78 degrees and there was a breeze blowing so it was not due to the heat.  Called Chevrolet and they said they have never heard of this happening and it isn't a manufacturer defect but a quick search online and others have had this happen in their 2017 Chevrolet Equinox.",
        "vin": "2GNALBEK9H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/25/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD ROUTINE OIL CHANGES AND ONLY DRIVE THE CAR APPROXIMATELY 5 MILES TO AND FROM WORK DAILY. ON A VERY FRIGID WINTER DAY WHILE DRIVING HOME FROM WORK, MY CAR STARTED SHAKING, AND OIL LIGHT CAME ON, THEN THE ENGINE LIGHT AND CAR CAME TO A STOP. GOT IT TAKEN TO CHEVROLET DEALER WHO SAID THEY HAD 3 OTHER EQUINOXES IN THE SHOP THE LAST 2 DAYS OF FRIGID COLD WITH THE SAME ISSUE. FIX FOR A REAR MAIN SEAL REPAIR, AFTER THEY HAD DONE A DIAGNOSTIC INSPECTION AND MULTI POINT VEHICLE INSPECTION. THIS REPAIR COST US OVER $2000. OUR MECHANIC ADVISED US TO REPORT THIS BECAUSE OF SEEING SEVERAL MODELS WITH SAME ISSUE, INCLUDING MY FATHER'S CHEVROLET EQUINOX WHO WAS IN THE SHOP 3 DAYS BEFORE OURS WITH THE SAME ISSUE. PLEASE HELP US. THANK YOU",
        "vin": "2GNALCEK6H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "02/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402600,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE VEHICLE APRIL 2019. HAVE PROOF OF 6 OIL CHANGES AND PROPER MAINTENANCE WHILE DRIVING FOR LESS THAN 2 YEARS,  BUT DUE TO NO WARNINGS OF LOW OIL ON THE VEHICLE AND WITH A CONFIRMED DEFECT STATED BY MY MECHANIC.  THIS 2.4 L ECOTEC ENGINE HAS MASSIVE OIL CONSUMPTION DEFECTS. THIS VEHICLE NEEDS TO BE RECALLED. IT STOPPED IN THE MIDDLE OF THE STREET WHILE I WAS DRIVING. FURTHER RESEARCH CONFIRMS THIS DEFECT BEYOND THE STATED 2010- 2013 RECALL.",
        "vin": "2GNALCEK4H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST DROPPED MY KIDS OFF AT SCHOOL AND WAS HEADED HOME WHEN MY CAR STARTED STALLING, AND OIL PRESSURE LOW WARNING CAME ON. A FEW MINUTES DOWN THE ROAD, THE ENGINE POWER LIGHT CAME ON AND THE CAR TURNED OFF WHILE DRIVING. I STARTED IT AGAIN LONG ENOUGH TO ROLL INTO A PARKING LOT BESIDE ME. I'VE HAD MY CAR TOWED 3TIMES, FIRST TO A CHEVY DEALERSHIP WHO QUOTED ME A $1,400 FIX FOR A SEAL REPAIR, AFTER THEY HAD DONE A DIAGNOSTIC INSPECTION. I WAS ALSO TOLD THEY COULD ASSIST IN A TRADE IN BECAUSE OF THE REPAIRS NEEDED. I WOULD FIRST NEED TO PAY FOR IT TO BE FIXED. I GOT TWO OTHER OPINIONS AT RESPECTABLE GARAGES WHO SAID IT WAS MY REAR MAIN SEAL AND BOTH QUOTED $2,400. I HAD TO GET A LOAN TO PAY FOR REPAIRS. FOLLOWING THE FIX, THE MECHANIC TEST DROVE IT AND SAID THE BRAND NEW SEAL BLEW AGAIN. THEY DID RESEARCH AND SAW THERE IS A MANUFACTURER MALFUNCTION WITH THE ENGINE AND TO COMPLETE THE TASKS TO RECONFIGURE MY ENGINE SO IT COULD WORK PROPERLY AND THE SAME PROBLEM NOT HAPPEN, IT WOULD BE AN ADDITIONAL $800 BUT THERE'S NO GUARANTEE IT WOULDN'T HAPPEN AGAIN.   WITH MY FIRST STOP BEING THE CHEVY DEALERSHIP, I AM UPSET I'VE HAD TO PAY OVER $3,000 ON MY CAR AND NOW IT'S NOT EVEN GUARANTEED TO BE FIXED. CHEVY MECHANICS SHOULD HAVE CAUGHT THIS ISSUE WHEN I ORIGINALLY TOOK MY CAR THERE. IT'S BEEN A MONTH NOW I'VE BEEN WITHOUT A CAR. AS A SINGLE MOTHER, I'VE SPENT A LOT OF MONEY HAVING TO RENT CARS AND USING UBER/LYFT WHEN THIS PROBLEM SHOULD HAVE BEEN ADDRESSED A MONTH AGO WHEN I ORIGINALLY SOUGHT THE DEALERSHIP' HELP.",
        "vin": "2GNALCEKXH1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A MCDONALDS DRIVE THRU WHEN I NOTICED A STRONG PETROLEUM SMELL. I PULLED INTO A PARKING SPACE AND FOUND OIL GUSHING FROM THE ENGINE. I TURNED THE ENGINE OFF AND HAD IT TOWED TO MY LOCAL CHEVY DEALER. THE DEALER FOUND THAT THE PCV SYSTEM HAD CLOGGED AND CAUSED THE CRANKCASE TO PRESSURIZE, THEREBY BLOWING THE REAL MAIN SEAL. FORTUNATELY I WAS NOT ON THE HIGHWAY AT THE TIME OR I COULD HAVE LOST ALL THE OIL AND SUFFERED AN ENGINE SEIZURE AT HIGHWAY SPEEDS. I GOT NO INDICATION OF A PROBLEM OTHER THAN SMELL AND VISUAL EXAMINATION. THE REPAIRS WERE QUOTED AT $2320. AFTER COMPLAINING TO GM CUSTOMER SERVICE THEY PROVIDED COST ASSISTANCE WHICH REDUCED THE PRICE TO $954 PLUS TAX. ON FURTHER RESEARCH I FOUND THAT THERE IS A RECALL ON THE 2010-2014 CHEVY EQUINOX FOR THIS SAME PROBLEM AND THE WARRANTY WAS EXTENDED TO 10 YEARS OR 120,000 MILES. THE 2015-2017 CHEVY EQUINOX HAS THE SAME 2.4 LITER ECOTEC ENGINE BUT GM HAS NOT SEEN FIT TO EXTEND THE RECALL TO THOSE YEARS. AT THE TIME OF THE INCIDENT I HAD 83,773 MILES ON THE VEHICLE AND ALWAYS HAD IT SERVICED AT THE DEALER I BOUGHT IT FROM, SARCHIONE CHEVROLET IN RANDOLPH, OHIO. FURTHER CONTACT WITH GM GOT THEM TO PAY ANOTHER $400 (WHICH I HAVE NOT RECEIVED YET) BUT THEY REFUSED TO PAY THE ENTIRE AMOUNT. THIS IS A DANGEROUS PROBLEM THAT GM IS AWARE OF BUT NOT ACKNOWLEDGING BY EXTENDING THE RECALL FOR THE ADDITIONAL 3 YEARS THAT THIS ENGINE WAS AVAILABLE IN THE EQUINOX.",
        "vin": "2GNALBEK3H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "05/01/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. THE CONTACT STATED THAT OIL WOULD LEAK OUT OF THE VEHICLE WHILE DRIVING AT VARIOUS SPEEDS AS THE ENGINE LIGHT WOULD ILLUMINATE. THE CONTACT ALSO STATED THAT THE VEHICLE WOULD JERK FORWARD AS THE SERVICE STABILITRAK WARNING LIGHT ILLUMINATED. ONE DAY, THE CONTACT STATED THAT AFTER ADDING OIL INTO THE VEHICLE, THE VEHICLE BEGAN TO JERK UNCONTROLLABLY AND A BLUEISH SMOKE BEGAN TO EMIT FROM THE ENGINE. DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED TO EAST HILLS CHEVROLET OF ROSLYN( 1036 NORTHERN BLVD, ROSLYN, NY 11576) WHERE AN OIL CONSUMPTION TEST WAS PERFORMED AND THEY DISCOVERED THAT HER ENGINE SEALS NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THEY OFFERED NO ASSISTANCE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 200.",
        "vin": "2GNALBEK5H1"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "02/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS 63000 MILES ON IT.  I KEEP UP WITH ALL OIL CHANGES.  I HAVE A 30 MIN HWY DRIVE TO AND FROM WORK DAILY.  I WAS DRIVING HONE FROM WORK ON SUPER COLD DAY BELOW ZERO IN ILLINOIS.  HALFWAY THREW MY RIDE HOME CAR SAID REDUCED ENGINE POWER 50 PERCENT.  YOU CAN TELL CAR WAS DRIVING ROUGH.  THEN EXITED ON MY EXIT AND SLOWED DOWN TO PULL OVER AND CAR SAID LOW OIL TURN OFF ENGINE CAR SHOOK AND SHUT DOWN.  MY HUSBAND CHECKED OIL IT WAS EMPTY!!!  WE FILLED IT AND BROUGHT TO CHEVY DEALER.  THEY GOT BACK TO US TOLD US WE ARE OUT OF WARRANTY AND THE PISTON RING BROKE AND NEED TO FIX FOR 2200.  WE HAVE CONTACTED GM WITH NO HELP TO SEE IF THEY WILL HONOR THIER VEHICLE DEFECT THAT CLEARLY IS AN ONGOING PROBLEM WITH THIER VEHICLES. IT IS CURRENTLY SITTING AT DEALER BECAUSE I CAN'T AFFORD TO FIX AND DON'T KNOW WHAT TO DO.  THEY SAID MY YEAR IS NOT RECALLED YET!!",
        "vin": "2GNALDEK6H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE EXPRESSWAY AND WAS GOING AROUND A CURVE AND NOTICED THAT MY POWER DECREASED AND FELT LIKE MY CAR WAS NOT MOVING AS FAST. I LOOKED AND THE CHECK ENGINE LIGHT ON MY DASH WAS ON AND IT SAID ENGINE POWER REDUCED, AND THE 2ND SCREEN SAID TO CHECK STABILITRAK. I GOT OFF AT THE NEXT EXIT AND PULLED RIGHT INTO A PARKING LOT. WHEN I TURNED OFF THE VEHICLE AND TURNED IT BACK ON IT STILL HAD THE CHECK ENGINE LIGHT ON, BUT THE SERVICE STABILITRAK WAS OFF. I HAD IT TOWED TO MY PARENTS AND THE NEXT DAY IT WAS TOWED TO A REPAIR SHOP. THE MECHANIC INSPECTED IT AND IT IS AN OIL CONSUMPTION ISSUE. HE ADVISED ME TO GET A NEW ENGINE WHICH WOULD COST 5,000 FOR A USED ONE. THIS IS A 2017 VEHICLE, WHICH IS FAIRLY NEW AND HAS ABOUT 70,000 MILES ON IT. THIS IS UNACCEPTABLE AND SHOULD NOT HAVE HAPPENED!!!! THE OIL WAS RECENTLY CHANGED AND WHEN IT WAS CHECKED, THERE WAS NOTHING SHOWING ON THE DIPSTICK. THERE WAS A CLASS ACTION LAWSUIT ON THIS SAME ISSUE AND IT IS A WELL KNOWN. I HAVE RESEARCHED AND READ MANY PEOPLE WITH THE SAME ISSUE, SOME AS RECENT AS JANUARY AND FEBRUARY 2021 AND SOME WERE ALSO LOCATED IN MICHIGAN. I AM A SINGLE MOM ON A LIMITED INCOME AND DON'T HAVE A VEHICLE OR THE MEANS TO FIX MY EQUINOX. IF THIS IS A KNOWN ISSUE, WHY HAS GM SAT BACK AND DONE NOTHING? IF THIS IS A KNOWN ISSUE, WHY HASN'T THERE BEEN A RECALL AND SOME OF THESE PEOPLE WOULDN'T BE WITHOUT A VEHICLE WITH THOUSANDS OF DOLLARS NO NEEDED IN REPAIRS.",
        "vin": "2GNALCEK9H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY TO AN APPOINTMENT AND MY ENGINE LIGHT CAME ON AND THE ENGINE STARTED TO REDUCE SPEED I WAS ABLE TO GET TO A DESTINATION AND PULL OFF AND THEN IT STATED LOW OIL PRESSURE TURN OFF ENGINE. I HAD IT TOWED TO A MECHANIC AND THEY SAID ALL THE OIL DRAINED OUT THE INTAKE MANIFOLD WAS PLUGGED UP AND COULDN'T BREATHE AND BLEW OUT THE MAIN SEAL AND SAID I COULD HAVE BLEW UP MY ENGINE BY CONTINUING TO DRIVE IT. THIS IS A REPAIR HE SAID HE SEES OFTEN IN THESE EQUINOX VEHICLES AND HE REACHED OUT TO A FELLOW GM MECHANIC WHO IS LOOKING AT IT AND SAYS THIS IS A COMMON PROBLEM WITH THESE VEHICLES AND SHOULD BE A RECALL.  THIS REPAIR IS VERY EXPENSIVE AND REQUIRES EITHER THE ENGINE OR TRANSMISSION TO BE REMOVED TO FIX THE PART AND THEN PUT BACK IN  THIS IS HAPPENING ON VEHICLES FAIRLY NEW MINE IS BARELY REACHING 4YEARS OLD THIS YEAR WITH 27, 268 MILES ON IT",
        "vin": "2GNALCEK3H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. THE CONTACT STATED WHILE DRIVING 20 MPH, THE VEHICLE LOSS MOTIVE POWER WITH OIL LEAKING FROM THE ENGINE. THE VEHICLE WAS TOWED TO THE LOCAL DEALER SHELTON BUICK GMC, INC (855 S ROCHESTER RD, ROCHESTER HILLS, MI 48307, (248)266-2156) WHERE IT WAS DIAGNOSED WITH NEEDING THE ENGINE SEAL TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 66,000.",
        "vin": "2GNALCEK6H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "02/10/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395616,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN A STATE THAT HAS COLD WEATHER, DIPPING WELL BELOW FREEZING. I WENT TO GET AN OIL CHANGE WHEN MY CAR PROMPTED ME, AND MUCH TO MY SURPRISE THE MECHANICS FOUND A SEVERE OIL LEAK. I WAS TOLD NOT TO DRIVE THE VEHICLE ANY LONGER AND TO HAVE IT TOWED IMMEDIATELY TO A REPAIR SHOP. I HAD IT TOWED TO THE DEALERSHIP I BOUGHT IT FROM, AND THEIR MECHANIC JUST CALLED ME. ACCORDING TO HIM, THE PCV HAD MOISTURE IN IT THAT FROZE, CAUSING AIR PRESSURE BUILD UP THAT BURST AND DAMAGE A MAJOR OIL VALVE. HE STATED THAT THE PCV HOLE ISN'T BIG ENOUGH TO AVOID THESE ISSUES, AND THAT ONCE THEY REPAIR IT, THEY WILL DRILL THE HOLE TO MAKE IT BIGGER SO IT DOESN'T HAPPEN AGAIN. MY CONCERN IS, IF THESE VEHICLES ARE SOLD NATIONWIDE, AND ARE SO POPULAR, WHY ARE THEY NOT THINKING OF THESE POSSIBLE ISSUES? OWNERS SHOULD NOT HAVE TO PAY OVER $2100 FOR A REPAIR DUE TO AN ISSUE IN MANUFACTURING!",
        "vin": "2GNALCEK2H6"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/30/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 16, 2021, I WAS TRAVELING DOWN MAIN STREET IN ROUND ROCK, TEXAS WHERE I REAR ENDED ANOTHER VEHICLE AT APPROXIMATELY 30 MPH. AS I SLAMMED ON MY BRAKES TO STOP, I FELT MY BRAKES STARTED PULSATING, MAKING IT DIFFICULT FOR ME TO COME TO A COMPLETE STOP. MY CAR WAS DEEMED UNREPAIRABLE, AND WAS A TOTAL LOSS. THE RADIATOR WAS CRACKED, AND THE FRAME WAS BENT MAKING IT DIFFICULT TO OPEN THE DOOR. I HAD A COUPLE BRUISES NOT SEVERE THAT I NEEDED TO GO TO THE HOSPITAL. MY AIRBAGS DID NOT DEPLOY DURING THE ACCIDENT, WHICH TO MYSELF DID NOT SEEM TO BE NORMAL. DUE TO THE SEVERITY OF THE DAMAGES TO MY CAR, IT WAS CONSIDERED NOT OPERATIONAL AND HAD TO BE TOWED.",
        "vin": "2GNFLFEK8H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "01/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ENGINE SEAL BLEW AND RUINED THE MOTOR. SHOP I TOOK IT TO SAID IT'S A COMMON PROBLEM. REGULAR MAINTENANCE HAS BEEN KEPT UP ON IT. HAVE TO REPLACE THE ENGINE NOW. I WAS GOING DOWN A MICHIGAN HIGHWAY 55MPH WHEN IT BLEW.",
        "vin": "2GNFLFEK3H6"
    },
    {
        "components": "AIR BAGS,STRUCTURE,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390265,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DID'T DEPOLY WITH FRONT END  CFRASH GOING ABOUT 25TO30HMPH HWY 278 WEST CULLMAN",
        "vin": "2NGALDNK2H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2021",
        "dateOfIncident": "01/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MORE THAN ONCE MY STEREO HAS FROZEN, I CANNOT USE BLUETOOTH TO ANSWER CALLS, CANNOT SWITCH FROM SOURCE, CAN HEAR ANYTHING; IT'S JUST FROZEN. THEN WHEN I PARK AND TURN THE ENGINE OFF AND OPEN THE DOORS, THE STEREO REMAINS ON. I TRY TURNING ON THE CAR AGAIN DRIVE IT A BIT TURN IT OFF AGAIN AND OPEN DOORS AGAIN AND STILL IT REMAINS ON. IT STAYS ON THROUGHOUT THE NIGHT UNTIL THE BATTER GIVES OUT AND IN THE MORNING I HAVE TO JUMP START IT. AND THEN IT'S AS IT NOTHING HAPPENED AND IT WORKS PERFECTLY AGAIN. THE LAST TIME IT HAPPENED I HAD JUST TURNED MY VEHICLE ON AND I TRIED PUTTING MUSIC AND I REALIZED WHAT WAS HAPPENING AGAIN.",
        "vin": "2GNALBEKXH1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "12/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385228,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE LIVE IN MN AND WENT OUT TO START OUR 2.4 EQUINOX AND IT STARTED AND THEN DIED. THIS WAS SITTING IN OUR DRIVEWAY AND WAS IN PARK WHEN IT HAPPENED. WE HAD IT TOWED TO A SHOP AND WAS TOLD THAT IT THERE WAS A PCV FREEZE UP WHICH CAUSED THE MAIN SEAL TO BLOW LOOSING THE OIL. THIS CAUSED THE TIMING CHAIN TO FAIL. WE REACHED OUT TO GM AND THEY STATED THIS IS OUT OF WARRANTEE AND THAT 2017 WHERE NOT EFFECTED EVEN THOU IT IS THE SAME MOTOR AS THE OTHERS THAT ARE AFFECTED. WE REACHED OUT TO THE DEALERSHIP AND THEY SAID THE SAME THING THAT BECAUSE THE CAR HAS 80,000 MILES WE ARE OUT OF THE POWERTRAIN WARRANTEE.",
        "vin": "2GNFLFEK3H6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT FLAKING OFF ON HOOD. DEALER AGREED NOT NORMAL AND NO SIGN OF HITTING ANYTHING. GM HAS TAKEN OVER A MONTH TO REPLY TO CLAIM BY DEALER AND NOW JUST SAY IT IS OUT OF 3 YEAR WARRANTY SO NO ASSISTANCE CAN BE OFFERED.",
        "vin": "2GNFLGE31H6"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11360174,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOY OR COME OUT UPON EXTREMELY HIGH IMPACT:  THE AIR BAGS IN MY 2017 EQUINOX DID NOT DEPLOY OUT OR COME OUT WHEN WE WHERE HIT AT A EXTREMELY HIGH IMPACT FROM THE HIT AND RUN DRIVER AND THE IMPACT CAUSED US TO HIT HEAD ON INTO AN WHITE SUV THAT WAS IN FRONT OF US ON THE OPPOSITE SIDE OF THE STREET GOING SOUTH ON LARAMIE. MY FIANC WAS DRIVING AND I WAS ON THE PASSENGER SIDE IN WE WAS GOING WEST ON EXPRESSWAY AND WE HAD EXITED OF LARAMIE AND HARRISON.  FIANC LASHANTI SCOTT THAT'S ON MY INSURANCE ON THE MY 2017 EQUINOX WAS DRIVING SO WE MADE AN RIGHT TURN ON LARAMIE GOING NORTH TOWARDS LARAMIE AND HARRISON.     AS WE WHERE APPROACHING AND CROSSINGS THE LIGHT THAT WAS GREEN AT THE NEXT LIGHT, AS WE PROCEEDED CROSSING THE GREEN LIGHT, AN SS BLACK SUV WAS COMING FROM WEST OF HARRISON TOWARDS US AT AN EXTREMELY HIGH SPEED 60-65 MILES PER HOUR.     THERE WAS NO TIME TO ADJUST AND RECOVER TO AVOID THE SUV THAT HIT US AT SUCH A HIGH RATE OF SPEED. THE SS BLACK SUV THAT HIT US IN THE FRONT PASSENGER SIDE OF MY 2017 EQUINOX IN WHICH CAUSED MY 2017 EQUINOX FROM THE IMPACT TO CRASH HEAD ONTO AN WHITE SUV THAT WAS DRIVING THE OPPOSITE SIDE GOING SOUTH OF LARAMIE TOWARDS HARRISON. AND FROM THE HIGH IMPACT OF THE SS BLACK SUV THAT HIT US SPENT AROUND AND HIT US AGAIN ON THE BACK REAR PASSENGER SIDE OF MY 2017 EQUINOX ALSO.",
        "vin": "2GNALBEK2H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 48,500 MILES APPROX. MY TRANSMISSION STARTED SLIPPING AND FAILING. IT STARTED WITH A JOLT WHEN COMING TO A STOP THEN WHEN THE LIGHT TURNED GREEN AND THE AUTOMATIC TRANSMISSION WENT FROM 1ST TO 2ND, 2ND TO 3RD IT WOULD JOLT HARD LIKE IT STRUGGLED TO CHANGE GEARS. IT DOES NOT SHOW ANY ISSUES ON THE MECHANICS COMPUTER. NOW 2 WEEKS LATER IT STALLS AT 14MPH WHEN GOING UP A HILL, IT WONT CHANGE GEARS AND LOSES POWER GOING DOWN TO 11MPH. IT IS A VERY DANGEROUS SITUATION. ITS THE V6, PREMIERE MODEL AND IS VERY DISAPPOINTING SINCE IT HAS LESS THAN 50,000 MILES. IT WAS LOOKED AT BRIEFLY BY ANOTHER MECHANIC WHO SAID MY TRANSMISSION WAS FAILING. I AM HAVING IT REBUILT WHEN THEY HAVE AN OPENING IN 2 WEEKS.",
        "vin": "2GNFLGE3XH6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359755,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE OWNED THIS VEHICLE FOR A YEAR AND A HALF NOW. COUNTLESS TIMES I'VE HAD OIL LEAKING, INCREASED OIL CONSUMPTION, AND FREQUENT OIL CHANGES. THIS PAST TIME HAS BEEN A MONTH SINCE MY LAST OIL CHANGE, AND WHEN GETTING TO WORK THIS MORNING I NOTED SOUNDS COMING FROM THE ENGINE, AND CHECKED THE OIL TO FIND NO OIL LEFT. ONE MONTH, AND IT CONSUMED 5 QUARTS OF OIL. WHEN DRIVING AND COMING TO A STOP, THERE IS A NOTICEABLE HITCH, AS WELL AS WHEN ACCELERATING UP A HILL, ALONG WITH A SLIGHT KNOCK IN THE ENGINE WHEN OIL RUNS OUT.",
        "vin": "2GNFLFEK6H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354344,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A ROUGH IDLE WAS DRIVING FINE. DRIVING HOME FROM REGULAR STREETS TO THENHIGHWAY AND ON THEBHIGHWAY THE ON BOARD COMPUTER SAID STABILITRAC NEEDS SERVICE SOON, ENGINE PEFERFORMANCE REDUCED. TRIED TO GET TO AN OFF RAMP THERE WAS A POP UNDER THE HOOD WHITE SMOKE OUT THE BACK AND THE CAR SHUT OFF ON THE HIGHWAY. HAD IT TOWED TO THE CLOSEST DEALER THEY HAVE INFORMED ME IT WAS CATASTROPHIC ENGINE FAILURE.",
        "vin": "2GNALCEK9H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/01/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LIGHT IS ON",
        "vin": "2GNALBEKXH1"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY WAS DRAINING WITHIN THE FIRST YEAR. REPLACED IT AND HAPPENED AGAIN WITHIN A FEW MONTHS. COULDN'T FIND THE PROBLEM. CONSISTENTLY NEEDED TO CHARGE AND BOOST THE BATTERY. LEFT ME STUCK WITH MY KIDS IN THE CAR SEVERAL TIMES. LIGHTS ON DASH KEPT GOING ON AND OFF GOING BLACK & BACK ON. DIFFERENT LIGHTS KEPT COMING ON LIKE SERVICE AIRBAG, STABILITY TRACK, ENGINE LIGHT, ETC. GIVING FALSE READINGS, FINALLY WHOLE MIDDLE CONSOLE WENT BLACK, HEATER TURNED ON AND WOULD NOT GO OFF, COULD NOT ACCESS TEMP CONTROL, RADIO, BLUETOOTH, ETC. BATTERY AND POWER WAS THE MAIN ISSUE.ELECTRICAL PROBLEMS. STARTED IN MAY OF 2018, MY LEASE RECENTLY EXPIRED AND HERE I AM SITTING AT THE DEALER 05/27/2020 FINALLY HAVING THEM TRYING TO GET TO THE BOTTOM OF THESE PROBLEMS THROUGHOUT MY 3 YEAR LEASE.  *TR",
        "vin": "2GNALCEK7H6"
    },
    {
        "components": "ENGINE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/14/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324582,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 MY 2017 EQUINOX ENGINE DIED IN THE MIDDLE OF THE ROAD I'M COMING TRAFFIC BOTH WAYS START A BACKUP STARTED MAKING KNOCKING NOISES NO OIL LIGHT CAME ON JOIN US FOR THE [XXX]FRONT YARD UP TO GM IN GRAND RAPIDS WHERE I BOUGHT THE VEHICLE THEY SAID THE REAR MAIN SEAL WAS BAD LOOK AT THE [XXX] IN GMC AFTER ALL THIS FIGHTING WITH GM MANY TIMES THEY STATED THAT IT WAS DUE TO THE PVC SYSTEM THAT THE REAR MAIN SEAL WAS OUT I HAD TO HAVE THE CAR TOWED BECAUSE I WAS OUT OF WARRANTY NO ONE WOULD HELP ME SO I HAVE A THIRTY SOMETHING $33000 THAT I COULDN'T DRIVE LOST BOTH OF MY JOBS DUE TO THE 2.4 L HAVING THE SAME ISSUES AS PRIOR-YEAR EQUINOXES AND THEN TRAINS. THEN PASSENGER WIPER ARM STOP WORKING IN WITH STRIPPED AS WELL.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2GNFLEEK5H6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2020",
        "dateOfIncident": "03/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318974,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HOW CAN ONE FIND THE SAFETY OF TRAVEL WHEN CONSIDERING THE CORONAVIRUS PANDEMIC.    BECAUSE OF THE VIRUS WE ARE NOT COMFORTABLE TRAVELING 1200 MILES FROM FLORIDA TO NEW YORK. HOW CAN WE TELL THAT ANY MOTELS WILL BE OPEN ON EACH STOP? WE ARE IN OUR 80S AND HAVE DIFFICULTY ON LONG RUNS.    THANK YOU.",
        "vin": "2GNALDEKXH1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A LETTER FROM CHEVY STATING MY VEHICLE 'MAY' HAVE ISSUES WHERE A LINK BALL CIRCUIT IN THE WIPER TRANSMISSION WILL FAIL AND THE WIPERS MAY NOT WORK.  THE LETTER GOES ON TO SAY THAT I SHOULD NOT TAKE THE VEHICLE IN UNLESS THE WIPERS FAIL.  ARE YOU KIDDING ME?  THIS VEHICLE IS MY MOM'S.  SHE'S 86.  SO SHE, OR ANYONE FOR THAT MATTER CAN BE DRIVING ALONG A DARK HIGHWAY AND THE WIPERS FAIL, A KNOWN ISSUE, AND THIS IS NOT A RECALL OR A SAFETY CONCERN? HOW DID THIS EVER GET PAST ANYONE?  THIS SHOULD BE AN AUTOMATIC RECALL.  IT IS A SERIOUS SAFETY ISSUE",
        "vin": "2GNFLEEK0H6"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED OCTOBER 2019 ONE DAY I WENT TO THE STORE AND ON THE RETURN HOME IT STARTED TO RATTLE LIKE IT WAS OUT OF OIL UPON INSPECTION OIL WAS LEAKING PROFUSLY BETWEEN THE ENGINE AND TRANSMISSION WHEN I SEARCHED THERE IS A PROBLEM WITH THE REAR MAIN OIL SEAL GETTING BLOWN OUT WHEN THE PVC IS PLUGGED BUT WHEN I LOOKED FOR VEHICLE RECALL THERE WAS NOTHING I COULD FIND",
        "vin": "2GNFLFEKXH6"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. DURING A CRASH, THE FRONT DRIVER SIDE SEAT BELT DETACHED FROM THE FLOOR AND FAILED TO RESTRAIN THE DRIVER DURING THE CRASH.    THE CAUSE WAS NOT DETERMINED.      NO INJURIES WERE SUSTAINED BUT THE DRIVER WAS CONCERNED THAT THERE COULD HAVE BEEN SERIOUS INJURIES.    THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH A SECOND VEHICLE CRASHED INTO THE PASSENGER SIDE CAUSING THE VEHICLE TO SPIN AROUND BEFORE COMING TO A STOP. AFTER THE CRASH THE DRIVER DISCOVERED THAT THE DRIVER'S SIDE SEAT BELT HAD DETACHED FROM THE FLOOR. NO INJURIES WERE REPORTED. A POLICE REPORT WAS TAKEN AT THE SCENE. THE VEHICLE WAS TOWED TO THE REINKE FORD (1360 GREELY CHAPEL RD, LYMA OH). THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "2GNALBEKXH1"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2020",
        "dateOfIncident": "02/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308100,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT STOP LIGHT, VEHICLE BEGAN TO JERK. DEALERSHIP COULDN'T REPEAT ISSUE SINCE IT ONLY OCCURRED WHEN ENGINE WAS COLD. ISSUE PERSISTED AND BECAME WORSE. VEHICLE STALLED AS IF IT WAS OUT OF GAS. STARTED AGAIN AFTER A FEW MINUTES. NEXT DAY STARTED WITHOUT ISSUE BUT BEGAN TO JERK WHEN APPLYING BREAKS MORE THAN USUAL. PARKED AND TURNED OFF TO RUN INTO STORE. VEHICLE WOULDN'T START AGAIN. TOWED TO MECHANIC.",
        "vin": "2GNALCEK1H6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306327,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE EXPRESSWAY MY CAR SUDDENLY STARTED SLOWING DOWN AND ON THE DISPLAY IT SAID THAT ENGINE POWER REDUCED, THE CHECK ENGINE LIGHT CAME ON, AND THE TRACTION STABILITY LIGHT CAME ON. I WAS GOING 55MPH AND IT WENT DOWN TO 35MPH. I MADE IT HOME SAFELY WHICH WAS GOOD THAT NO ONE HIT ME ON THE EXPRESSWAY. I TOOK MY CAR IN THE NEXT MORNING AND THE DEALER SERVICE DEPARTMENT TOLD ME THAT I NEEDED A NEW ACCELERATOR PEDAL WHICH WILL COST $720 TO REPLACE CAUSE IT JUST WENT OUT OF WARRANTY BY 300 MILES.  I RESEARCHED ONLINE AND FOUND THAT THIS IS AN ONGOING PROBLEM WITH 2017 CHEVY EQUINOX'S BUT THERE'S BEEN NO BULLETIN OR RECALLS. IT'S LIKE THEY DON'T CARE ABOUT THEIR CUSTOMERS SAFETY.",
        "vin": "2GNALCEK8H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO QUIT WORKING. THE DEALERSHIP DIAGNOSED THE PROBLEM AND SAID I NEED A NEW RADIO. THE CAR IS ONLY 2 YEARS OLD. IN TALKING WITH OTHER OWNERS, MANY ARE HAVING THE SAME PROBLEM. THE RADIO WILL NOT TURN ON. THIS ALSO IS HOW TO CONTROL THE HEAT/AC, THE BACKUP CAMERA, THE NAV SYSTEM. THE DEALERSHIP AND MAKER ARE BOTH REFUSING TO ADMIT TO A DEFECTIVE SYSTEM. THIS IS A 2017 CHEVY EQUINOX.",
        "vin": "2GNALCEK1H6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253993,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH THAT HOLDS THE DOOR SHUT KEEPS COMING LOOSE. I HAVE TIGHTENED IT NUMEROUS TIMES BUT STILL KEEPS COMING LOOSE. IT HAS TROUBLES KEEPING THE DOOR SHUT AND SECURE. THE BRACKET WILL TURN SO THE DOOR WON'T SHUT AT ALL SOMETIMES.",
        "vin": "2GNALBEK7H1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2019",
        "dateOfIncident": "08/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE LOOK INTO THIS ISSUE, VERY DANGEROUS! I WAS ON MY WAY HOME FROM WORK DRIVING ON THE NORTHEAST EXTENSION OF THE PA TURNPIKE HEADING SOUTH, AND I WAS BETWEEN EXIT 95 & EXIT 87 ON FRIDAY 8/2/19 AT APPROX. 3:30 PM. I WAS DRIVING THE POSTED SPEED LIMIT OF 70 MPH AND WAS NOT USING CRUISE CONTROL WHEN THE CAR ABRUPTLY SHIFTED INTO LOW GEAR, FLASHED A 'REDUCED POWER MODE' WARNING, AND WENT INTO A 'LIMP' MODE WHERE IT WAS SLOWING DOWN TO EVENTUALLY STOP ITSELF, BUT I WAS AT 40 OR 35 WHEN I PULLED OVER. THE ENGINE LIGHT WAS ON, AND THANK GOD NO ONE WAS BEHIND ME, I WASN'T IN CONSTRUCTION AND I HAD A SPOT I COULD SAFELY PULL OFF ONTO THE SHOULDER. I HAVE A 2017 CHEVY EQUINOX WITH ONLY 40,000 MILES ON IT. I SHUT THE VEHICLE OFF AND SAT FOR 5 MINUTES OR SO. WHEN I TURNED IT BACK ON, THE REDUCED POWER WARNING WAS GONE, BUT THE CHECK ENGINE LIGHT WAS STILL ON. I WAS ABLE TO DRIVE IT HOME AND CALLED THE DEALER, CHEVY WIND GAP, TO SEE IF I HAD TO HAVE IT TOWED THERE OR IF I COULD DRIVE IT IN MYSELF. THEY TOLD ME THEY THOUGHT IT WAS JUST A SENSOR MALFUNCTION, THAT IT SHOULD RESET ITSELF, AND THAT I COULD DRIVE IT THERE FOR THEM TO LOOK AT WHICH IS EXACTLY WHAT HAPPENED. THE CHECK ENGINE LIGHT WENT OFF AFTER A FEW DAYS, AND CHEVY WIND GAP WAS UNABLE TO FIND ANY CURRENT CODE HISTORY OF THE REDUCED POWER MODE SO NOW I'M JUST DRIVING IN FEAR EVERY TIME I GET INTO THE THING THAT IT'S GOING TO DO THIS AGAIN AT ANY TIME. I DON'T WANT TO TAKE PASSENGERS FOR FEAR OF PUTTING THEM IN DANGER. IF THIS HAPPENED IN HEAVY TRAFFIC WITH A TRACTOR TRAILER ON MY BUMPER, IT COULD MAKE FOR A VERY DANGEROUS SITUATION. I HAVE ALWAYS LOVED THE CHEVY EQUINOX, THIS IS THE 3RD ONE WE'VE BOUGHT, PLEASE LISTEN TO YOUR CUSTOMERS OUT THERE THAT THIS IS HAPPENING TO BECAUSE THAT NUMBER IS GROWING EACH DAY. PLEASE GIVE US PIECE OF MIND TO FEEL SAFE AGAIN IN OUR NEW CHEVY EQUINOX.",
        "vin": "2GNFLFEK1H6"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243999,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 41,000 MILES AND MY CAR STARTED MAKING A WEIRD WOBBLING NOISE ( WORSE WHEN I TURN)AT THE LEFT FRONT DRIVERS SIDE TIRE. I WAS ADVISED TO FIX IT RIGHT AWAY AS IT IS A SAFETY HAZARD. TOOK IT IN AND I HAD TO HAVE MY LEFT FRONT WHEEL BARING REPLACED FOR $600.00 I HAVE 41,000 MILES AND THESE SHOULD BE GOOD FOR 80,000-150,000 MILES. I KEPT THE PART.",
        "vin": "2GNALCEKXH6"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE DISCOVERED THAT I CAN'T GO LONGER THAN 30 MINUTES WITHOUT LOSING MY AIR CONDITIONING. I TOOK IT IN TO MONUMENT CHEVROLET. THEY SAID THERE'S NOTHING THEY CAN DO BECAUSE THERE'S A BULLETIN OUT ON IT.    I HAVE MS, AND WITHOUT MY AIR CONDITIONING I CAN'T GO ANYWHERE OVER 30 MINUTES. IT'S JUST MISERABLE IN TEXAS WITHOUT AIR CONDITIONING. MONUMENT TOLD ME THAT I WOULD JUST HAVE TO WAIT UNTIL SOMETHING COULD BE DONE. SEEMS LIKE MY AIR CONDITIONING COULD BE REPLACED.    THIS IS MY SECOND EQUINOX, I'VE ENJOYED EVERY MILE UNTIL NOW.",
        "vin": "2GNALBEK7H1"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231011,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR IN APRIL, 17, WENT FOR FIRST \"PREPAID\" OIL CHANGEJUNE, MENTIONED OIL LEAK. TOLD BY SERVICEMAN, FIXED.2ND OIL CHANGE AROUND SEPTEMBER, STILL SEEING OIL LEAK. SAID FIXED. LAST JANUARY 2018, I TOOK A VIDEO OF PUDDLE OF OIL IN GARAGE SO THEY CAN SEE IT WAS ACTIVE LEAK. CAR KEEP ALL DAY. FIXED. THIS PAST MAY, TOOK IT IN THEIR REPORT SAID, OIL LEAK, THAT NEEDS TO BE CHECKOUT OUT.  I HAVE NOT TAKEN THE CAR TO ANYONE ELSE. BRUCE LOWRIE CHEVROLET HAS THE HISTORY. I PREPAID FOR OIL CHANGES AND GO REGULARLY. DATES ARE APPROXIMATE BUT I HAVE REPORTS IN MY CAR GLOVEBOX",
        "vin": "2GNALBEK1H1"
    },
    {
        "components": "ENGINE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. WHILE DRIVING 35 MPH, THE CONTACT HEARD AN ABNORMAL NOISE COMING FROM THE DASHBOARD AND SHE DETECTED A CHEMICAL ODOR. THE CONTACT TURNED ON THE AIR CONDITIONER AND IT SWITCHED TO HEAT ON ITS OWN. THE VEHICLE WAS TAKEN TO RYAN CHEVROLET (LOCATED AT 1101 OLIVER RD, MONROE, LA 71201, (318) 390-1765) TO BE DIAGNOSED, BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE CONTACT STATED THAT THE FAILURE OCCURRED THREE TIMES. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 31,355.",
        "vin": "2GNALBEK0H1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. WHILE THE VEHICLE WAS PARKED IN A LOT, THE CONTACT RETURNED TO FIND THAT THE REAR WINDSHIELD WAS SHATTERED. THE VEHICLE WAS TAKEN TO BILL CRISPIN CHEVROLET (72712 E MICHIGAN AVE, SALINE, MI 48176) TO BE DIAGNOSED, BUT THEY WERE NOT ABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "2GNALCEK7H6"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY, MY CAR MAKE A LOUD BANG, IT SAID TRANSMISSION OVERHEATING IDLE ENGINE, ENGINE OVERHEATING, IDLE ENGINE, SERVICE STABILITRACK, SERVICE ANTI LOCK BREAKING SYSTEM, SERVICE POWER STEERING SYSTEM, MY ENGINE LIGHT WAS FLASHING, I WENT TO EXIT THE HIGHWAY TO THE OFF RAMP AND ALL OF A SUDDEN MY CAR CAME TO A SCREECHING HALT AND CAR WOULD NOT MOVE MADE THE LOUDEST BANG I HAVE EVER HEARD. I HAVE HAD THIS ISSUE ONE OTHER TIME! THE DEALERSHIP CLAIMED MY TRANSMISSION HAD A LEAK BUT NO LEAK MARKS IN MY BRAND NEW DRIVEWAY, THEY TOLD ME TO DRIVE IT FOR 200 MILES SO THEY CAN FIGURE OUT WHERE THE LEAK IS, THIS WAS ALL SAID THE DAY I HAD MY OIL CHANGED, THEN WHEN I CAN BACK AFTER DRIVING 200 MILES THEY THEN CLAIMED MY OIL PAN WAS LEAKING AND NEEDED TO BE REPLACED. THANK GOD MY BUMPER TO BUMPER WARRANTY WAS STILL IN EFFECT. THEY LOOKED SHOCKED WHEN I EXPLAINED TO THEM THAT AND I WOULD NOT BE PAYING FOR IT.",
        "vin": "2GNALBEK7H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219591,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS INVOLVES THE AIR CONDITIONER. IT WILL BLOW COOL AIR AND THEN SUDDENLY START BLOWING HOT AIR FROM THE VENTS FOR ABOUT 15 TO 30 SECONDS AND THEN STARTS BLOWING COOL AIR AGAIN. THIS HAPPENS WHILE DRIVING DOWN THE ROAD/HIGHWAY AND HAPPENS WHEN THE CAR IS STOPPED AT RED LIGHT/STOP SIGN. IT DOESN'T HAPPEN EVERY TIME I AM DRIVING, BUT DOES HAPPEN ABOUT ONCE A WEEK. I DRIVE MY CAR TO WORK 5 DAYS A WEEK. NOW MY AIR CONDITIONER HAS STARTED TO HAVE A WEIRD CHEMICAL SMELL. IT IS HARD TO DESCRIBE AND AGAIN, DOES NOT HAPPEN EVERY TIME I DRIVE. I TOOK MY VEHICLE TO A CHEVY CERTIFIED SERVICE DEPARTMENT IN JULY 2018 AND WAS TOLD THEY DID NOT SEE ANY ISSUE WITH THE AIR CONDITIONER. I CANNOT KEEP HAVING THIS PROBLEM WITH MY VEHICLE AND I NEED THIS FIXED SOON.",
        "vin": "2GNALBEK5H1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 EQUINOX CAME WITH MICHELIN LATITUDE TOUR X TIRES. AFTER LESS THAN 2 YEARS (30,000 MILES), TIRE SIDEWALLS ARE SEVERELY CRACKED. I HAVE NEVER SEEN A TIRE DEGRADE AS BADLY AS THESE HAVE. THE FACTORY IN POLAND MUST BE USING SUBSTANDARD MATERIALS TO MAKE THESE TIRES. DOT B53T 031X 4516. ACCORDING TO MICHELIN, I WILL BE RESPONSIBLE FOR AT LEAST 80% OF THE REPLACEMENT COST. I ALWAYS THOUGHT MICHELIN WAS A HIGH QUALITY COMPANY BUT AFTER SEEING HOW THESE TIRES ARE FALLING APART, I NO LONGER THINK THAT.",
        "vin": "2GNALCEK1H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE NOTICED A BAD FUEL SMELL IN THE CABIN OF THE VEHICLE AND HAD OIL LEAKING FROM IT TOOK IT TO THE DEALERSHIP AND THE REAR MAIN SEAL WAS BLOWN. THEY DID THE REPAIR AND A WEEK LATER HAD THE SAME THING HAPPEN AGAIN. IT'S BEEN AT THE DEALERSHIP TWICE FOR THE SAME ISSUE.",
        "vin": "2GNFLFEK0H6"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2019",
        "dateOfIncident": "02/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182708,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "KEEP GETTING  REDUCE ENGINE POWER CODE 2138 WHICH IS THROTTLE PEDAL SENSOR THAT SHOULD NOT HAVE GONE BAD EVEN WHEN THE CAR HAS68000 MILES ON IT.",
        "vin": "2GNALBEK2H1"
    },
    {
        "components": "SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173195,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES PAD BECAME HARD AND FAILED TO STOP THE CAR ALMOST HIT 5 CARS COMING DOWN A STREET THAT WAS A HILL IN LEWISTON NY RPUST 104 EAST",
        "vin": "2GNALCEK7H1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "11/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161384,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HIT A POT HOLE AT 35 MPH, DRIVER SIDE FRONT TIRE BLEW OUT. SERVICE AIRBAG LIGHT AND WARNING CAN ON AND PASSENGER FRONT SEAT BELT LOCKED AS IF VEHICLE WAS IN MAJOR COLLISION. DEALERSHIP FIRST STATED IT WOULD ALL BE COVERED UNDER WARRANTY, NOW STATING BLACK BOX SHOWS VEHICLE WAS IN COLLISION AND AIR BAGS 'PARTIALLY DEPLOYED'. THERE IS NO DAMAGE TO VEHICLE. IF BLACK BOX IS DETERMINING AN ACCIDENT OCCURRED, WHY DID BAGS NOT DEPLOY?",
        "vin": "2GNALCEK8H6"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE CAR ON FREEWAY. I TRIED SLOWING THE CAR BY PRESSING THE BRAKE PEDAL BUT IT WOULD NOT ALLOW ME TO STOP THE SLOW THE CAR HENCE CAME THE SITUATION WHERE I HAD TO HIT THE BRAKE PEDAL HARDER TO ABLE TO STOP THE CAR TO AVOID THE ACCIDENT. I WAS NOT ABLE TO BREAK AT ALL AND IT ENDED UP COLLIDING WITH THE CAR IN FRONT OF ME. IT WAS SURPRISING TO ME THAT NOT A SINGLE AIRBAG WAS POPPED OPEN, GIVEN THE MAGNITUDE OF AN ACCIDENT AND THE DAMAGE IT CAUSED (ESTIMATED DAMAGE OVER $10,000). I HAD MY SON AND TWO OF HIS FRIENDS IN THE CAR. IT IS VERY SHOCKING THAT THE AIRBAGS OR BREAK DID NOT WORK IN BRAND NEW SUV.",
        "vin": "2GNALCEK4H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "11/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154355,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I RENTED A 2017 CHEVY EQUINOX. I STARTED THE VEHICLE AND WENT INSIDE FOR IT TO HEAT UP. SOME HOW THE KEY FOB AND KEY TRANSMITTER GOT LEFT BEHIND. I DROVE APPROXIMATELY 20 MILES. I STOPPED AT A GAS STATION, TURN OFF CAR. WHEN I RETURNED THE CAR SAID NO FOB ON DASH AND I COULD NOT START IT. I DONT THINK I NEED TO EXPLAIN ALL THE REASONS THAT THIS COULD BE A SAFETY ISSUE. LET ALONE I HAVE NEVER BEEN IN A CAR THAT DID NOT WARN YOU THAT THE FOB WAS NOT THERE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/15/2018",
        "dateOfIncident": "06/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11129674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A CRASH WHERE ANOTHER CAR HIT ME IN THE PASSENGER SIDE UP FRONT IN A HARD CRASH.THE ENTIRE FRONT END AND RIGHT SIDE OF THE VEHICLE WAS DAMAGED FRAME RAILS WERE BENT AND AC  COMPONENTS WAS IN THE MOTOR.AIR BAGS DID NOT DEPLOY INSURANCE TOTALED THE VEHICLE 17,200 OF DAMAGES",
        "vin": "2GNALBEKXH1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK GLASS SHATTERED FOR NO APPARENT REASON. IT HAD BEEN PARKED IN A PRIVATE DRIVEWAY APPROXIMATELY 19 HOURS WHEN THE BACK GLASS SHATTERED. IF THIS HAD HAPPENED GOING DOWN THE HIGHWAY OR INTERSTATE, I COULD HAVE HAD AN ACCIDENT OR CAUSED AN ACCIDENT.",
        "vin": "2GNALCEK1H6"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MICE GET IN DASH AREA AND USE THE INSULATION TO BUILD NEST ON TOP OF THE CABIN AIR FILTER.  IF THE MOUSE CHEWS THROUGH THE PAPER FILTER AND RUNS UP MY PANTS LEG, THERE WILL BE A SAFETY PROBLEM.",
        "vin": "2GNFLFE38H6"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "04/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101700,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. THE CONTACT STATED THAT WHEN THE GEAR SELECTOR WAS USED TO SHIFT INTO DRIVE OR REVERSE, THE VEHICLE KEPT ROLLING IN REVERSE AS THE GEAR FAILED TO REMAIN IN POSITION. THE VEHICLE WAS TAKEN TO TWO DEALERS (GILROY CHEVROLET, 6720 AUTOMALL CT, GILROY, CA 95020, 408-842-9301 AND CAPITOL CHEVROLET, 905 CAPITOL EXPRESSWAY AUTO MALL, SAN JOSE, CA 95136, 408-600-1145). THE DEALERS WERE UNABLE TO REPLICATE AND DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED A CASE. THE MANUFACTURER DID NOT PROVIDE FURTHER TESTING TO ASSIST THE DEALER AND CLOSED THE CASE WITH NO REMEDY PROVIDED. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE. *TT  CONSUMER STATED EQUINOX AT CAPITOL CHEVROLET, WITH THE HOPE THAT SOMETHING WILL BE CORRECTED. EQUINOX WOULD NOT GO INTO REVERSE UNLESS I TURNED IT ON AND OFF MULTIPLE TIMES AND SHIFTED GEARS MULTIPLE TIMES. IT HAPPENED AGAIN TO ME IN FEBRUARY. SUV BEGAN TO SHUDDER AND SEEM LIKE IT WAS OUT OF GAS AT IDLE. UPDATED 10/12/18*JB",
        "vin": "2GNALCEK8H1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S SON OWNS A 2017 CHEVROLET EQUINOX. THE CONTACT STATED THAT WHEN THE OIL WARNING GAUGE DECREASED TO ONE PERCENT, THERE WAS A FUEL ODOR IN THE VEHICLE. THE CONTACT NOTIFIED THE DEALER (HUFFINES CHEVROLET PLANO, 1001 COIT ROAD, PLANO, TX), BUT NO LEAKS WERE FOUND. THE MANUFACTURER WAS NOT NOTIFIED AND THE FAILURE RECURRED. THE FAILURE MILEAGE WAS 2,968.",
        "vin": "2GNALBEKXH1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. WHILE DRIVING HIGH SPEEDS, THE VEHICLE SHOOK VIOLENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO KRISTAL AUTO MALL (5200 KINGS HWY, BROOKLYN, NY 11234), BUT THE FAILURE COULD NOT BE DIAGNOSED OR DUPLICATED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000. *TT    CONTACT STATES DEALERSHIP (KRYSTAL AUTOMOTIVE) SOLD THEM A CAR THAT APPEARS TO HAVE BEEN MEANT FOR A WHEEL CHAIR BOUND PERSON. VEHICLE HAS EXTREME WIRING AND PLUGS EXPOSED, DOES NOT DRIVE SAFELY OVER 40MPH, SIDE MIRRORS ARE ABNORMAL, AND THE WINDSHIELD IS TOO LOW. THE INSTRUMENT PANEL IS OVERLOADED AND REQUIRES TOO MUCH MAINTENANCE. CONTACT CANNOT SIT COMFORTABLY AND SAFELY. *TT",
        "vin": "2GNALCEK9H6"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A CRASH WHERE IT BROADSIDED ANOTHER VEHICLE IN A HARD CRASH.  THE ENTIRE FRONT END AND RIGHT SIDE OF THE VEHICLE WAS DAMAGED.  FRAME RAILS WERE BENT AND THE MOTOR MOVED.  AIR BAGS DID NOT DEPLOY. INSURANCE  TOTALED THE VEHICLE.",
        "vin": "2GNALCEK7H1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE CAR THIS MORNING THERE IS NO INTERIOR NOISES. NO BLINKER, NO RADIO, DISPLAY ON RADIO IS BLANK. RADIO AND EVERYTHING WORKED THE EVENING BEFORE WITH NO ISSUES AT ALL. CHECKED ALL FUSES AND STILL NOTHING. AFTER SEARCHING THE INTERNET THIS APPEARS TO BE A WIDESPREAD CHEVY ISSUE. TO SPECIFY THE VEHICLE WAS FIRST IN PARK AND RUNNING WHEN THE PROBLEM WAS NOTICED. IT CONTINUED TO BE A PROBLEM WHILE DRIVING (CITY AND HIGHWAY) AND CONTINUED AFTER THE VEHICLE WAS RESTARTED MULTIPLE TIMES.",
        "vin": "2GNALBEK1H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "05/07/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 CHEVROLET EQUINOX. WHILE WAITING AT A RED LIGHT, A FIRE STARTED UNDER THE DASHBOARD. THE CONTACT EXITED THE VEHICLE BEFORE IT BECAME ENGULFED IN FLAMES. THE POLICE DEPARTMENT WAS NOT PRESENT. THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT. THE VEHICLE WAS TOWED TO A JUNK YARD AND THEN RETRIEVED BY THE MANUFACTURER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS TAKEN TO SWEENEY CHEVROLET/GMC IN YOUNGSTOWN, OHIO DUE TO A BUZZING NOISE EMERGING FROM THE ENGINE, EVEN WHILE PARKED IN THE GARAGE. THE DEALER DIAGNOSED THAT THE NOISE WAS DUE TO THE VEHICLE'S COMPUTER REBOOTING. THE INSURANCE COMPANY DETERMINED THAT THE VEHICLE WAS DESTROYED. THE APPROXIMATE FAILURE MILEAGE WAS 3,800.",
        "vin": "2GNALCEK7H1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "07/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003728,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY ( 7/7/17 ) GOING APPROX 25MPH THE PASSENGER FRONT TIRE BLEW OUT AT THE SIDE WALL CAUSING THE VEHICLE TO SHOOT TO THE RIGHT AND GRAZE THE CURB. PRIOR TO THE FAILURE THE TIRE PRESSURE MONITOR LIGHT WENT ON AND RIGHT AFTER THE LIGHT TURNED ON THE BLOW OUT HAPPENED. THE TIRE HAD 3571 MILES OF WHICH WE PUT APPROX 300 MILES ON IT AFTER PURCHASING THE VECHILE AS A DEMO FROM THE DEALER ON 6/29/17.  VEHICLE HAS MICHELIN LATITUDE TOURING P225/65/R17",
        "vin": "2GNALCEK9H6"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971570,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET EQUINOX. THE CONTACT STATED THAT THE VEHICLE UNINTENTIONALLY ACCELERATED WHILE ATTEMPTING TO REVERSE WITH THE BRAKE PEDAL DEPRESSED. THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO A PARKED, UNOCCUPIED VEHICLE. THE CONTACT'S VEHICLE CAME TO A STOP ON ITS OWN. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO THE LOCAL DEALER FOR DIAGNOSTIC TESTING, BUT A FAILURE CODE COULD NOT BE LOCATED. THE MANUFACTURER WAS NOT NOTIFIED. A POLICE REPORT WAS FILED. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "2GNFLEEK2H6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/11/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954028,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOO HAVE NOTICED THAT THE LIGHTING AT NIGHT IS NOT AS GOOD, ACTUALLY TERRIBLE, WITH MY 2017 EQUINOX AS COMPARED TO MY 2008 EQUINOX WHEN DRIVING AT NIGHT IN THE COUNTRY ROADS AND SURBUBAN NEIGHBORHOOD ROADS WITH LITTLE STREET LIGHTING. I RARELY USED THE BRIGHTS WITH MY 2008 EQUINOX. WITH THE 2017, THE SAME ROADS AND HIGHWAYS  THAT I DRIVE TO AND FROM DAILY ARE DIFFICULT TO SEE WITHOUT FLICKING THE BRIGHTS IN AREAS ON THE ROAD WHICH I WAS ABLE TO SEE CLEARLY ON THE ROAD IN MY 2008 EQUINOX. I AVOID TRAVELING AT NIGHT IF I CAN POSTPONE FOR DAYLIGHT DUE TO LIGHTING ISSUE. MY EYES VISION HAS NOT CHANGED IN THREE YEARS AND DID IMPROVE IN VISION FROM THE PAST. I SUSPECT THIS ISSUE OF BAD LIGHTING ALSO AFFECTS THE CHEVY CRUZ 2014 & 2017 WHICH MY SON HAS BOTH NOW AND ALWAYS TRIES TO \"GET BACK BEFORE DARK\" TO HIS HOME. THAT STATEMENT WAS NEVER MADE DRIVING THE PONTIAC HE DROVE IN THE PAST FOR YEARS. I WILL SPEAK TO MY CHEVY CAR DEALERSHIP ABOUT THIS ISSUE. I AM CONCERNED AS THIS IS A MAJOR SAFETY' ISSUE. CHEVROLET NEEDS TO COMPARE AND RESOLVE. THIS ISSUE NEEDS TO BE ESCALATED!  I WILL CONTACT THE MANUFACTURER AS WELL TO PUT THEM ON NOTICE OF THIS VERY DANGEROUS AND DEFECTIVE MANUFACTURER CONDITION.",
        "vin": "2GNFLFE34H6"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/03/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON THIS VEHICLE ARE TERRIBLE. I UNDERSTAND THAT THEY ARE HALOGEN. I HAVE PREVIOUSLY OWNED A 2011 & 2014 EQUINOX AND DID NOT EXPERIENCE THIS PROBLEM. IT IS DANGEROUS DRIVING AT NIGHT ON COUNTRY ROADS. I AM FORCED TO CONTINUOUSLY DRIVE WITH THE BRIGHT HEADLIGHTS ON.  *TR",
        "vin": "2GNALCEK0H1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/01/2017",
        "dateOfIncident": "12/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING AT APPROXIMATELY 60MPH ON A HIGHWAY.  THE VEHICLES IN THE LANE NEXT TO ME WERE STOPPED FOR AN OBSTRUCTION.  A VEHICLE FROM THAT LANE TRAVELED INTO MY LANE RIGHT IN FRONT OF ME.  I COLLIDED WITH THE VEHICLE - I ESTIMATE THE COLLISION TO HAVE OCCURRED AT 30-40MPH.  NONE OF THE AIRBAGS DEPLOYED.",
        "vin": "2GNALBEK9H1"
    }
]