[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "01/28/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453652,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle stopped engaging in park and unable to remove key. This is a known issue with GM, and the shifter assembly has to be replaced which is NOT covered under the power train warranty. This is a serious safety issue.",
        "vin": "1GCGTDEN7H1"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "05/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have had this complaint before and previously lodged a complaint about the transmission. First time at the dealership, they said they couldn't feel any of the shuttering I was talking about. Second time they ended up doing a transmission flush. It felt exactly the same and seemed to get worse. Third time they said there was nothing they could do. Suggested I run the truck in tow mode. That was better for a short time. Dont know what to do now. Second complaint is the back up camera. Can bearly see out of it no matter how clean I get the camera. Asked dealership if the was any recalls on it they said no but told me they had so many complaints about it. Would seem to be a factory defect but what do I know",
        "vin": "1GCGTDEN3H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2022",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Hard shifting, missed shifts, shudder from TQ converter. For six months the vehicle has been shifting had at random times during shift sequences. Hard shifts occur on both moderate acceleration and hard acceleration. Shifts can only be described as sudden and violent, feeling something like a U-joint failure, broken transmission mount, or a clutch slipping and then slamming into gear. The hard shifts occur and any speed and any gear, but are very noticeable around 3rd / 4th. The TQ converter slips on acceleration only. Has been in the dealer 3 times for a total of 7 days so far with one technician claiming it needs a new TQ converter and possibly a new transmission. Other techs claim they can't find the problem. No codes, no lights. Dealer claims they can feel the problem but have failed to diagnose it. Failure of this could pose to be a serious safety issue if it happens at highway speed in traffic. GM has the inventory of 6L50 transmissions on lockdown.",
        "vin": "1GCPTDE11H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2022",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Colorado. The contact stated while driving 30 MPH, the 4-wheel drive warning light illuminated. The contact was able to continue driving to his destination without the 4-wheel drive. The contact took the vehicle to the local dealer, where it was diagnosed with needing an unknown wire and wiring harness replaced due to rodents chewing on the wires. The vehicle was repaired however, the failure recurred. The contact took the vehicle to the local dealer, where it was diagnosed with needing an unknown wire, wiring harness, and the horn replaced. The vehicle was repaired. The manufacturer had been informed of the failure. The failure mileage was 25,547.",
        "vin": "1GCGTDEN6H1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "07/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11444774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Performed a full pre-repair scan Health Check with the GM GDS2 scan tool.  Fifty-three fault codes were reported through 11 modules via \"Automotive electronics is one of the major problems in this areas. Understanding the control buses that have replaced wiring looms in vehicles. CAN bus is the most important of these – but many vehicles now use both CAN and LIN buses for cost reasons. Solutions for both areas. at this time—recommendations and fault codes are listed below.  At the time of scan National Highway Traffic Safety Administration website was unavailable, and a recall search was unable to be performed. Per GM ADAS calibration recommendations, if an ADAS feature is affected by the collision repair, GM may recommend calibration of affected components after repairs are complete. Please refer to GM document 5577683. These items may include Frontview Camera, Long Range Radar, Park Assist Sensor, Curb View Camera, Surround Vision Camera – Analog and Night Vision Camera",
        "vin": "1GCHSCEN6H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2021",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441693,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "There is an uncontrollable shaking in the driveline when driving at low rpms regardless of speed.",
        "vin": "1GCGTCEN7H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "10/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Colorado. The contact stated while driving 50 MPH, the vehicle downshifted into first gear and failed to exceed 10 MPH. The contact stated no warning light was illuminated. The contact was able to drive to the residence at a slow speed. The contact took the vehicle to an independent mechanic and was unable to duplicate the failure. The contact stated that the failure was experienced for a second time on 11/8/2021. The contact stated that the transmission warning light was illuminated. The vehicle was not diagnosed or repaired. A dealer was not contacted. The manufacturer was not informed of the failure. The failure mileage was 57,643.",
        "vin": "1GCGSDEA4H1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2021",
        "dateOfIncident": "09/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437676,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 Colorado All of a sudden I was just driving down the road going 55mph, and my truck shut off. No warning light just died completely. I almost got rear-ended by the car behind me. I could not start the truck back up at all. If I had been in construction zone someone could have seriously got injured or killed, Huge safety issue. I had the truck towed to the chevy dealer, it took the sever days to find out the issue. The wiring harness behind the motor, was rubbing on the fire wall, causing several wires to become exposed and short out. Dealer even if they put a new wiring harness back in it would have the same problem, based off where it is located. I trying to make sure no one gets killed and recall issued. I contacted chevy customer support they didn't seam interested is fixing a safety issue, no there problem after warranty are over.",
        "vin": "1GCPTCE13H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While traveling down the highway at 70-75 MPH a wrist pin failure occurred. This lead to a rod punching a hole in the bottom part of the engine, obviously I lost all engine power and had to coast to the side of the road in traffic. Looking online there are wrist pin studies conducted by Geen diesel engineering company that shows obvious manufacturing defect in gm wrist pins. Upon further research I have found that this is a common failure with the 2.8 liter diesels. I contacted gm they informed me that this is not a documented problem which has set me back about $14,000. I found out that I’m not alone from what I have found it seems to affect 2016-2017 models. I’ve seen failures occurring within 7000 miles.",
        "vin": "1gcptde14h1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Wire chafing on AC lines causes reduce engine power while driving down the highway with vehicles immediate shut down to 35 miles an hour. Poses an extreme safety hazard to all drivers. As well wire chafing prevents truck from starting",
        "vin": "1GCPTDE14H1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2021",
        "dateOfIncident": "08/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My keys continue to get stuck in the key ignition slot. It doesn't matter if I am parked in a flat, incline or decline position. I have to lock and unlock my vehicle several times and sometimes it works. I live in Texas and it is unbearable to have to do this over and over by turning on and off the vehicle.  Meanwhile, my child is baking in the car seat while this is taking place. It has also drained my battery while I had no choice but to run into work so that I wouldn't be terminated. Only to come back after 20 minutes to a drained battery and then having to call someone to jump start my vehicle. I am fed up and wished I had never bought this Chevy truck. So much for American made vehicles!  My vehicle started having this issue around 45,000 miles and now I am at 59,850. The dealership stated they are months behind and cannot see my truck for at least a month. They want to run a diagnostics test and charge me for it.What good would that be if the power train warranty is over at 60,000? But they claim it's not a power train issue and that they are familiar with this chronic issue because they see it all the time,yet no recall by Chevy?  UPSET SINGLE TEXAS MOM",
        "vin": "1gcgscen7h1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My key gets stuck intermittingly in the ignition and will not turn off.  There is a current bulletin (#PI1429B) on this issue.  In order to be safe and leave the car, I need to be able to turn it off.",
        "vin": "1GCHSCEA9H1"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "08/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Over the course of the past year, I've noticed the seat belt tightening against my body as I drive, even without slowing or braking. In the past two weeks, the tightening is so severe that I am unable to pull the seat belt out from locking up. It becomes difficult to unbuckle. This morning the seat belt would not pull out from the pocket where it retracts, but remained locked up there. With much very slow continuous pulling, after about 30 minutes, I was finally able to pull the seat belt so I could actually use it while driving. When the seat belt locks up, it restrains my ability to turn to check the blind spot before changing lanes, or even to lean forward. I am taking the truck to the dealer tomorrow morning, first thing, 0700 03AUG2021",
        "vin": "1GCGTDEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Colorado. The contact stated while driving approximately 40 mph, the vehicle jerked back and forth while shifting gears. The contact stated no warning lights was illuminated. The vehicle was diagnosed but not yet repaired. The manufacturer was informed of the failure and advised the contact to have the vehicle diagnosed by an authorized dealer. The failure mileage was approximately 84,437.",
        "vin": "1GCGTEEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424496,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Colorado. The contact stated that at low speeds of 20-60 mph, the vehicle failed to accelerate with the accelerator pedal depressed. The vehicle started to shudder as the power train warning light illuminated. The vehicle was taken to the dealer and was diagnosed that the torque converter sensor failed and needed to be replaced. The vehicle was not repaired however, the transmission fluid was replaced. The manufacturer was notified of the failure and informed the contact to take the vehicle back to the dealer. The vehicle was taken back to the dealer and was test-driven however, the mechanic informed the contact that the failure would continue if the torque sensor was not replaced. The failure mileage was approximately 71,900.",
        "vin": "1GCGSCEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Colorado. The contact stated that his vehicle would shutter upon the depression of the accelerator pedal without warning.  The manufacturer was notified of the failure and informed the contact that the vehicle was out of warranty and referred him to a dealer for assistance. The contact had yet to take the vehicle to be serviced or diagnosed for the failure. The failure mileage was 60,000.",
        "vin": "1gcgsben2h1"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2021",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418648,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vibration and shimmy of vehicle while driving. The entire truck shakes about every 10-20 seconds. Brought the truck in twice in for the company to fix and they do not understand or recognize the problem. Still not fixed and the North Branch Chevy dealership will not stand behind the warranty or repair.",
        "vin": "1GCGTDEN6H1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418524,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Right rear shock lower mount / eyelet split in half causing shock to simply hang from upper mount. Vehicle was parked when failure was noticed.",
        "vin": "1gcgteen9h1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415153,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE THIRD TIME I HAVE HAD IT TO THE DEALERSHIP THIS TIME. THE FIRST TIME I WAS TOLD THERE WAS NOTHING WRONG WITH IT. THE SECOND TIME, THEY REPLACED THE TORQUE CONVERTER. THIS TIME THEY ACKNOWLEDGED A PROBLEM AGAIN AND AND SAID GM ISSUED A TECHNICAL SERVICE BULLETIN TO ADDRESS THIS.   I HOPE THIS REPAIR WORKS THIS TIME.   BUT MY CONCERN IS, HAVING BEEN REPAIRED BEFORE, HOW LONG WILL THIS REPAIR LAST, AND 2) WILL IT LAST TILL THE POWERTRAIN WARRANTY HAS EXPIRED?   HAVING LOOKED THROUGH THIS LIST SINCE THE FIRST PROBLEM IN 2018, I HAVE SOME MAJOR CONCERNS WITH THE 8 SPEED TRANSMISSION IN THIS TRUCK.  GM NEEDS TO ADDRESS THIS BY ISSUING A RECALL OR EXTENDING THE POWERTRAIN WARRANTY ON THIS MODEL. I NEED THIS VEHICLE TO LAST AND RIGHT NOW IT DOESNT LOOK GOOD.",
        "vin": "1GCGSBEN4H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WILL NOT TURN OFF WHEN PARKING ON A REGULAR BASIS. I WAS TOLD THE KEY WAS DIRTY, THEN I WAS TOLD IT WAS A PROBLEM IN THE GEAR SHIFT.  IN MY CASE WHEN THE KEY GETS STUCK, I FIND THAT I HAVE TO WAIT FOR THE DOOR ALARMS AND OTHER ELECTRICAL ITEMS TO DO THEIR \"BATTERY PROTECTION SHUT-DOWN\" THAT THEY DO AFTER TEN MINUTES OF CONTINUOUS USE, THEN THE KEY COMES OUT.",
        "vin": "1GCHSBEA0H1"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "02/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414769,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A LOT OF DIFFICULTY GETTING THE SEATBELT TO LOCK INTO PLACE.    ONCE VEHICLE IS PLACED IN PARK, THE KEY WILL NOT ROTATE TO THE OFF POSITION AND CANNOT REMOVE IT.",
        "vin": "1GCPTDE17H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414596,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. THE CONTACT STATED THAT THE KEY FAILED TO BE RELEASED FROM THE IGNITION SWITCH. A CERTIFIED MECHANIC WAS CONTACTED AND CONFIRMED THAT IT WAS A COMMON ISSUE WITH SIMILAR VEHICLES. JIM ELLIS CHEVROLET LOCATED AT 5900 PEACHTREE INDUSTRIAL BLVD, CHAMBLEE, GA 30341, 678-736-8582, WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE DRIVE SHAFT AND STEERING COLUMN NEEDED TO BE DETACHED TO FIX THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND CONFIRMED THAT THE REPAIR WAS NOT COVERED UNDER WARRANTY. THE APPROXIMATE FAILURE MILEAGE WAS 42,000.",
        "vin": "1GCGTDEN2H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413978,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE IGNITION KEY IS TURNED OFF THE KEY IS STUCK AND CAN'T BE REMOVED. HAVE TO RESTART CAR TURN OFF AGAIN AND AGAIN WHILE PUTTING CAR IN PARK VERY FORCEFULLY. HAPPENS VERY RANDOM. DEALER HAS REPLACE SHIFTER KNOB ALREADY BUT THIS DOES NOT FIX THE ISSUE.  CANNOT LEAVE THE VEHICLE WITH THE KEY IN IGNITION BECAUSE JUST TURNING THE KEY YOU CAN START THE TRUCK AND DRIVE AWAY! DIDN'T START TO HAPPEN UNTIL THE TRUCK WAS A LITTLE OVER 3 YEARS OLD , NOW AT LEAST ONCE A WEEK. SOMETIMES I CAN HEAR A RELAY CLICK DOWN UNDER THE GEARSHIFT LEVER AS I WIGGLE THE SHIFTER , WHEN I HEAR THE CLICK THE KEY WILL COME OUT.",
        "vin": "1GCGTCENXH1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408444,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. THE CONTACT STATED THAT THE KEY FAILED TO BE REMOVED FROM THE IGNITION SWITCH OCCASIONALLY. AFTER SEVERAL ATTEMPTS WITH MANIPULATING THE GEAR SHIFTER, THE STEERING WHEEL, AND MANUALLY TURNING THE KEY IN THE IGNITION CYLINDER, THE KEY WAS EXTRACTED FROM THE IGNITION. THE CONTACT TOOK THE VEHICLE TO KEN WARE CHEVROLET BUICK GMC CADILLAC (1595 NEWMARK ST, NORTH BEND, OR 97459, (541) 982-2574) TO BE DIAGNOSED HOWEVER, THE MECHANIC WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE 40,000.",
        "vin": "1GCPTDE17H1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "01/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSTRUMENT PANEL DOES NOT RESPOND TO TOUCH THIS STOPPED WORKING  AT 19000 MILES.  I'VE RESET THE SYSTEM DISCONNECTED THE BATTERY,  STILL DOESN'T WORK.  CURRENT MILEAGE IS 32000 STILL DOES NOT WORK.  THE TRANSMISSION SHIFTS VERY HARD AND SEEMS TO BE SLIPPING,  SEEMS TO BE HAVING TROUBLE FINDING THE NEXT GREAT THEN HAS HARD FEELING OF UPSHOT THEN DOWN SHIFTS.",
        "vin": "1GCGSCEN7H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2021",
        "dateOfIncident": "03/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED LOUD CREAKING NOISES ON THE DRIVER'S SIDE OF MY TRUCK PRIMARILY WHEN CORNERING AND GOING OVER BUMPS. I ASKED FERMAN CHEVROLET (9751 E ADAMO DR, TAMPA, FL 33619) TO CHECK IT OUT FOR ME. THEY FOUND THAT 2 TRANSMISSION BOLTS WERE MISSING, WHICH THEY ATTRIBUTE TO THE NOISE. I'M NOT SURE IF THIS IS SOMETHING THAT OCCURRED RESULTING FROM POOR MANUFACTURING BUT IT SEEMS THAT THIS IS NOT SOMETHING THAT COULD/SHOULD HAVE OCCURRED THROUGH NORMAL USE (DRIVING ON CITY ROADS ONLY ABOUT 50 TO 100 MILES PER WEEK) ON A 4 YEAR OLD VEHICLE WITH ONLY 30650 MILES ON IT. I LOOKED FOR RECALLS FOR MISSING TRANSMISSION BOLTS FOR GM PRODUCTS AND FOUND THAT THERE IS ONE THAT IS POSSIBLY A SIMILAR ISSUE ALTHOUGH ONLY FOR CERTAIN FRONT WHEEL DRIVE MODELS; N202313440.",
        "vin": "1GCGSBEN0H1"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403109,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT LEFT AIRBAG IMPACT SENSOR IS FAULTY AFTER LESS THAN THREE YEARS OF OWNERSHIP. NOT COVERED UNDER WARRANTY BECAUSE OF THE MILES DRIVEN, AND OVER $900 TO REPAIR AT THE DEALERSHIP HAS LEFT ME DRIVING WITHOUT A FUNCTIONAL AIRBAG SENSOR FOR OVER A YEAR.",
        "vin": "1GCGTDEN3H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "02/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402682,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY 2017 CHEVROLET COLORADO IN A PARKING LOT AND HAD NO POWER STEERING.  I RECEIVED A  POWER STEERING FAILURE MESSAGE TELLING ME TO DRIVE WITH CAUTION AND TO HAVE THE POWER STEERING SERVICED.  I LEFT IT RUN FOR 15 MINUTE AND SHUT IT OFF.  I RETURNED A COUPLE HOURS LATER AND THE POWER STEERING HAD RETURNED.  THE DEALER FOUND CODE C056D.  THEY HAD TO REPLACE THE RACK AND PINON ASSEMBLY.  I AM THE ORIGINAL OWNER OF THE TRUCK AND IT HAS 38000 MILES ON IT.  THE DEALER REDUCED THE REPAIR COST FROM $1500 TO $900.  I FOUND THAT THERE WAS A RECALL FOR 2015 AND 2016 COLORADOS FOR THE SAME PROBLEM.  A SERVICE BULLETIN 16-NA-065 WAS ISSUED FOR 2015 AND 2016 MODELS AND THEN LATER INCLUDED 2017 AND 2018 MODELS.  CHEV WOULD NOT PAY ANY OF THE COST BECAUSE IT WAS NOT UNDER WARRANTY OR PART OF THE RECALL.  THIS IS A MAJOR SAFETY ISSUE.  I HAVE FOUND SEVERAL INSTANCES IN FORUMS WHERE THE SAME THING HAS HAPPENED.  APPARENTLY THIS IS NOT JUST A COLORADO/CANYON ISSUE AND IS NOT LIMITED TO 2015 AND 2016 MODEL YEARS.  THERE ARE EXAMPLES OF THIS HAPPENING ON SILVERALDOS ALSO.  IT THE VEHICLE HAD BEEN IN MOTION WHEN I LOST THE POWER STEERING I COULD HAVE CAUSED A MAJOR CRASH.",
        "vin": "1GCHTDEN7H1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. THE CONTACT STATED THAT HIS WIFE WAS DRIVING 60 MPH AND THE VEHICLE LOSS MOTIVE POWER AND STALLED. THE VEHICLE WAS RESTARTED AND SLOWLY DRIVEN TO THE SIDE OF THE ROADWAY. THE VEHICLE WAS TURNED OFF AND RESTARTED AND INDEPENDENTLY ACCELERATED. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS DRIVEN TO THE RESIDENCE. THE VEHICLE WAS TAKEN TO LARIA CHEVROLET - BUICK INC. (112 E OHIO AVE, RITTMAN, OH 44270) TO BE DIAGNOSED HOWEVER, A CAUSE WAS STILL PENDING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 29,000.",
        "vin": "1GCRTEEN8H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK ONLY HAS 30,000 MILES AND ALWAYS KEEP UP ON MAINTENANCE THROUGH CHEVY DEALERSHIP. WHEN DRIVING HOME ON HIGHWAY TRUCK SHUT OFF ON BUSY HIGHWAY WITH CONSTRUCTION GOING ON AND NO WHERE TO TURN OFF WHEN SHUT OFF. RADIO WAS PLAYING BUT LOST TOTOL POWER... NO PROBLEMS WITH TRUCK PRIOR TO THIS AND FULL TANK OF GAS.. WHEN WAS ABLE TO STOP AND PUT IN PARK STARTED UP WITH NO ADDITIONAL PROBLEMS. ALTHOUGH AS LIGHTLY PUSHING PEDAL TO CONTINUE IT PEELED OUT AS IF THE PEDAL WAS PUSHED ALL THE WAY DOWN. WAS GOING 60MPH WHEN ENGINE DIED AND ALL LIGHTS INCLUDING HEAD LIGHTS SHUT DOWN... VERY VERY SCARY SITUATION...",
        "vin": "1GCRTEEN8H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399346,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 CHEVY COLORADO DIESEL WITH APPROXIMATELY 50,000 MILES  WHERE THE DIESEL PARTICULATE SENSOR CONSTANTLY FAILS.  I HAD IT REPLACED FOR THE 4TH TIME THE LAST WEEK IN JANUARY AND NOW ITS FAILED AGAIN.  THE CODE RECEIVED IS A P1476.  I WILL HAVE IT REPLACED FOR THE 5TH TIME NEXT WEEK BUT ACCORDING TO ONLINE COLORADO DIESEL FORUMS THIS IS AN ENDLESSLY FAILING PIECE OF EQUIPMENT.  AS A CONSEQUENCE MANY OWNERS ARE WORKING WITH AFTER-MARKET TUNERS TO REMOVE THIS EMISSIONS CONTROL. THE MESSAGING I SEE ONLINE IS THAT THIS WILL BE AN ENDLESS EXPENSE IF I KEEP MY TRUCK BEYOND THE LIMITED EMISSIONS WARRANTY. TO-DATE THE WARRANTY HAS COVERED THE REPAIRS(~ $500 EACH) BUT THE EMISSIONS WARRANTY WILL BE EXPIRING SOON.  I THINK THE NHTSA AND EPA SHOULD FORCE CHEVROLET/GM TO PROVIDE AN UNLIMITED EMISSIONS WARRANTY.  SAVE THAT, GM WILL IGNORE THE PROBLEM AND MANY THOUSAND OF DIESEL TRUCKS WILL HAVE THEIR EMISSIONS CONTROLS REMOVED.",
        "vin": "1GCPTDE1XH1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST ITEM:  WHEN TRUCK IS PUT INTO PARK, THE STEERING WHEEL LOCKS UP AND THE KEY IS NOT ABLE TO BE TAKEN OUT OF THE STARTER SLOT.  SECOND ITEM:  THE POWER STEERING STOPS WORKING.  THE STEERING MOTOR WAS REMOVED & REPLACED ON FEB. OF 2020.",
        "vin": "1GCGTCEN9H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/09/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING EXTREMELY COLD WEATHER (NEAR OR BELOW 0 DEGREES F), ELECTRONIC POWER STEERING FAILURE HAS OCCURRED UPON VEHICLE STARTUP.  ONCE THE VEHICLE IS THOROUGHLY WARMED UP DURING THESE CONDITIONS POWER ASSIST RETURNS.  I WAS ADVISED TWO WINTERS AGO BY A GM SERVICE MANAGER TO 'LET IT WARM UP FOR A FEW MINUTES' BEFORE DRIVING OFF.  FIFTEEN MINUTES DIDN'T DO IT TWO DAYS AGO WHEN I LEFT WORK, AND ENDED UP MUSCLING IT HOME - TURNS FROM A STOP WERE EXTREMELY DIFFICULT.  TODAY I HAD ERRANDS TO RUN AFTER WORK AND THE SYSTEM DID NOT RETURN TO 'LIFE' UNTIL AFTER MY THIRD STOP -- ABOUT 38 MINUTES OF COMBINED CITY & HIGHWAY DRIVING, LEAVING IT RUNNING DURING MY STOPS.  DRIVER INFORMATION CENTER (DIC) INDICATED THE FAILURE AT VEHICLE START.  MULTIPLE ATTEMPTS TO SHUTDOWN AND RESTART HAD NO EFFECT.",
        "vin": "1GCHTDEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. THE CONTACT STATED THAT THE TRANSMISSION FAILED. THE CONTACT STATED THAT WHILE SHIFTING GEARS THE TRANSMISSION SHIFTED HARD, SLAMMED, AND MADE CLUNKING NOISE WHILE SHIFTING TO PARK, REVERSE OR DRIVE. THE CONTACT STATED THAT THE FAILURE OCCURRED WHENEVER THE TEMPERATURE WAS AT 30 DEGREES OR LOWER. THE VEHICLE WAS TAKEN TO CLASSIC CHEVROLET (6877 CENTER STREET, MENTOR, OH 44060, (440) 953-1070) FOR DIAGNOSTIC TESTING. THE DEALER ADVISED THE CONTACT THAT THE TRANSMISSION GEAR FAILURE WAS A CHARACTERISTIC OF THE VEHICLE AND THERE WAS NOTHING WRONG WITH THE VEHICLE. THE DEALER ALSO PROVIDED THE CONTACT WITH A TECHNICAL SERVICE BULLETIN THAT REFERENCED THE TRANSMISSION ISSUES. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 18,466.",
        "vin": "1GCHTCEN4H1"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389711,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING TRANSMISSION SHIFTING PROBLEMS, SUDDENLY CHANGING GEARS. JUST A FEW, I TOOK THE TRUCK TO THE DEALER ON 1/14/2021, FOR AN OIL CHANGE AND THE DEALER CHECKS THE ENGINE COOLING SYSTEM OK AND EVERYTHING ELSE, I BEEN TAKING THE TRUCK TO THE DEALER FOR MANY YEARS FOR SERVICE AND THEY TOLD ME NO RECALLS, DAYS AGO DRIVING HOME ABOUT 5 MINUTES BEFORE GETTING HOME THE TEMPERATURE GAUGE WHEN TOO COOL AND THE RADIATOR FANS WERE IN HIGH SPINNING WHEN GOT HOME SHUT IT OFF, BUT THE FAN WAS STILL GOING ON, I WILL CALL THE DEALER ON MONDAY 01.25.2021 FOR SERVICE AND TOWING THE TRUCK TO THE DEALER TO FIX IT. HOW MUCH IS GOING TO COST ME NO IDEA, IN THE MEANTIME I WILL RENT A CAR WHILE FIXING THE TRUCK.",
        "vin": "1GCGSCEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE HIGHWAY WHEN ACCELERATING UPHILL THERE IS  A CLUNKING SOUND. IT FEELS LIKE IT'S THE GEARS ARE SLIPPING. ONLY 15,000 MILES ON IT HE TRUCK.",
        "vin": "1GCGTDENXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CHEVY COLORADO TODAY, I NOTICED THERE WAS SEVERAL TIMES IT WOULD SHUDDER WHEN ACCELERATING, AND GOING UP HILLS. THIS OCCURRED WHILE DRIVING 40MPH - 60 MPH. IT FEELS LIKE I'M GOING OVER RUMBLE STRIPS WHILE DRIVING. I WILL BE CONTACTING THE DEALER AND TRY TO GET THIS ISSUE FIXED.",
        "vin": "1GCGTDEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/22/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD ISSUES WITH TRANSMISSION SINCE I BOUGHT THE TRUCK. IT CONTINUES TO DO THE SAME THING ,AND IT SEEMS TO BE GETTING WORSE.IHAD IT IN FOR THE PROBLEM AND THEY SAY ALL THE SHIFT POINTS ARE RIGHT AND SAME SAYS ONSTAR.WENT ONLINE THIS MORNING AND IT SEEMS ITS THE 8 SPEED TRANS ,WHICH IS WHAT I HAVE.WHAT ARE MY OPTIONS WITH DEALER ? CAN I GET IN ON THE CLASS ACTION LAWSUIT?07",
        "vin": "1GCHTCEN1H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 CHEVY COLORADO LT CREW CAB HAS 40000 MILES ON IT AND THE FUEL TANK PRESSURE SENSOR IS NEEDING TO BE REPLACED. THIS DOESN'T SEEM LIKE SOMETHING THAT SHOULD HAPPEN ON A TRUCK THAT'S UNDER 50K AND ISN'T DRIVEN ROUGH.",
        "vin": "1GCGTCEN0H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC TEMPRETURE CONTROL KNOB WHEN SET TO HEAT OR AUTO FUNCTION ON HIGH BLOWS COLD AIR!",
        "vin": "1GCGTDEN4H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "10/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IM HAVING TROUBLES WITH THE ENTERTAINMENT SYSTEM OF MY 2017 CHEVROLET COLORADO, 4X4 V6. THE SCREEN IS OFF, AND THE TURN SIGNALS DOES NOT MAKE SOUND WHEN I ACTIVATE IT. I HAVE LOOSE 7 DAYS ON THE AGENCY AND THEY HAVE NOT FIXED THE ISSUE, THEY CHANGED THE SCREEN, ONE MODULE (HIM SOMETHING LIKE THAT) AND EVERYTHING IS STILL DOWN. IF I DISCONNECT THE + OF THE BATTERY, THEN THE SCREEN IS ON, AND APPARENTLY EVERYTHING IS OK, BUT I TURN THE TRUCK OFF, AND THEN AGAIN ON AND THE ISSUE COMES AGAIN.",
        "vin": "1GCGT9EN1H1"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362397,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. THE CONTACT STATED THAT WHILE DRIVING AT SLOW SPEEDS, THE TRANSMISSION DOWNSHIFTED WITHOUT WARNING. THE CONTACT ALSO STATED THAT WHILE TRAVELING AT A HIGH RATE OF SPEED, THE STEERING WHEEL VIBRATED ABNORMALLY WITHOUT WARNING. THE CONTACT TOOK THE VEHICLE TO CHUCK HUTTON CHEVROLET (2471 MT MORIAH RD, MEMPHIS, TN 38115) WHERE THE MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. AFTER THE FAILURE PERSISTED, THE CONTACT TOOK THE VEHICLE TO JIM KERAS CHEVROLET (2000 COVINGTON PIKE, MEMPHIS, TN 38128) WHERE THE TRANSMISSION FLUID WAS FLUSHED AND TEMPORARILY CORRECTED THE FAILURE HOWEVER, THE FAILURE REOCCURRED AFTER SEVERAL THOUSAND MILES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 21,000.",
        "vin": "1GCGSCEN8H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "07/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361888,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017, COLORADO 2 WD, 33,000 MILES, BEGAN TO RUMBLE, INTERMITTENTLY AT HWY  CRUISING SPEEDS. IT FEELS AND SOUNDS AS IF I'M DRIVING OVER HWY RUMBLE BARS.  RUMBLING STOPS AS SOON AS I TAKE MY FOOT OF THE ACCELERATOR.  THIS PHENOMENON BEGAN AS AN OCCASIONAL ANNOYANCE BUT HAS INCREASED SIGNIFICANT TO A DAILY EVENT.   I'VE SCHEDULED A TRANSMISSION FLUID CHANGE WITH THE DEALER IN TWO DAYS.",
        "vin": "1GCHSCEN8H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "07/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360532,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER CLUTCH 'SHUDDER' AT LOADED STEADY SPEED AND ACCELERATION - VIBRATION FELT IN ENTIRE CABIN @ 15,560 MILES. NON-EXISTENT WHILE COASTING/OFF-THROTTLE.  PREVALENT WHEN DRIVETRAIN IS FULLY WARMED UP & ON HIGHWAY.  EXTREMELY ANNOYING.",
        "vin": "1GCHTDEN4H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/12/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9/10/20 MY STEERING WHEEL SEEMED TO \"FIGHT\" ME OCCASIONALLY WHILE DRIVING TO WORK AT 50MPH. ON 9/11/20 I DROVE TO WORK WITHOUT INCIDENT.  ON 9/11/20 WHILE DRIVING HOME FROM WORK (5 MILES) 3 SEPARATE TIMES WHILE TURNING AT THROUGH AN INTERSECTION AT 20-25MPH THE VEHICLE STEERING WHEEL COMPLETELY LOCKED IN PLACE WHILE THE VEHICLE WAS IN MOTION AND TRAFFIC COMING AT ME FROM TWO DIFFERENT DIRECTIONS.  A COMPLETE LOSS OF MANEUVERABILITY.  ON 9/16/20 I HAVE AN APPOINTMENT WITH MY MECHANIC.",
        "vin": "1GCGTCEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "07/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION: MY VEHICLE WAS MAKING A SOUND, AS IF SOMETHING WAS RUBBING. CALLED DEALER FROM WHERE I PURCHASED IT AND THEY REPLACED THE TRANSMISSION FLUID. I'M NOT COMFORTABLE WITH JUST REPLACING THE TRANSMISSION FLUID.  HOPING TO NOT HAVE SOMETHING ELSE GOING ON WITH TRANSMISSION.  THEY REPLACED THE TRANSMISSION FLUID WITH A DIFFERENT TYPE OF TRANSMISSION FLUID. I HAD JUST ENTERED INTERSTATE 81, WHEN THE RUNBBING SOUND, STARTED TO OCCUR. THE SERVICE ADVISOR TOLD ME THE TRANSMISSION FLUID THAT WAS ORIGINALLY PUT IN WHEN IT WAS MANUFACTURED, WAS THE WRONG FLUID.",
        "vin": "1GCGTCEN2H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "07/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353609,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY HARD SHIFTING WHEN ACCELERATING FROM A STOP TRUCK SHIFTS REAL HARD AND JERKS STEERING WHEEL FROM MY HAND.(VERY DANGEROUS) SHUDDER AND HEAVY VIBRATION DURING ACCELERATING AT ANY SPEED. HEAVY CONSISTENT  VIBRATION AT ANY HIGHWAY SPEED. I AM A HANDICAPPED DRIVER AND I AM AFRAID TO DRIVE THIS TRUCK. UNSAFE AT ANY SPEED.THIS IS NOT A ONE TIME OCCURRENCE AND HAS BEEN DOING THIS EVERY DAY FOR OVER A MONTH.",
        "vin": "1GCGSCEN0H1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/06/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11353436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR A WHILE NOW, MY TRUCK HAS BEEN AGGRESSIVELY SHAKING WHEN I HIT HIGHWAY SPEEDS SO I'VE SPENT MONEY GETTING BALANCES AND ALIGNMENTS AND TIRES TO TRY AND FIX THE ISSUE, BUT NOTHING WORKS. I'VE ALSO BEEN HAVING ACCELERATION ISSUES, BUT WHEN I TAKE IT TO A SHOP TO BE LOOKED AT, NOBODY CAN FIND THE PROBLEM. THEN A FEW DAYS AGO, I WAS ON THE HIGHWAY DOING AROUND 65 OR SO IN THE RAIN AND IT DID ITS USUAL SHAKING. I LOST CONTROL, THE TRUCK SPUN OUT AND HIT THE WALL. THE COP CAME AND ASKED IF MY TRUCK HAD BEEN DOING ANY SHAKING. I TOLD HIM YES... I CAME HOME AND MY FAMILY ASKED IF IT HAD BEEN SHAKING AS WELL. I ASKED WHY EVERYONE WAS MENTIONING THE TRUCK SHAKING. THEY TOLD ME ABOUT THE CHEVY RECALLS. SO I'M REACHING OUT BC I'VE BEEN TRYING TO FIGURE OUT AND PAYING MONEY TO FIX THE SHAKING ISSUES AND THE ACCELERATOR ISSUES WITH NO SUCCESS AND NOW I'VE BEEN IN A WRECK AND COULD'VE LOST MY LIFE. I ONLY HURT MY FOOT AND MY GIRLFRIEND WAS CUT AND BURNED BY AIRBAGS. I NEED HELP. PLEASE.",
        "vin": "1GCGSBEN0H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION ISSUES. HAD IT LOOKED AT WHEN I HIT 10,500 MILES. THE DEALERSHIP SAID IT WAS A COMMON PROBLEM AND JUST PUT THICKER TRANSMISSION FLUID IN. HELPED THE PROBLEM. NOW AT 20,500 MILES IT'S STARTING TO VIBRATE AT SPEEDS ABOVE 45 MPH AGAIN.",
        "vin": "1GCHTDEN8H1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "07/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS CHANGING THE REAR BRAKE ROTORS I FOUND THAT THE PADS ON THE E-BRAKE SHOES WHERE NOT ATTACHED.   THE ARE NOW GLUED ON AND HAD FAILED.   DEALER EXCUSE WAS RUST.  THIS SHOULD NOT BE HAPPENING WITH YOUR E-BRAKES.   I WOULD NOT HAVE KNOW THEY HAD COME LOOSE IF I WAS NOT CHANGING MY BRAKE PADS/ROTORS.   I HAD TO PAY FOR REPLACEMENT FOR AN ITEM THAT SHOULD NOT HAVE FAILED UNEXPECTEDLY.",
        "vin": "1GCGTDEN2H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341761,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 27,2020, MY WIFE WENT TO BAYVIEW TX TO SEE THE EFFECT OF HURRICANE HANNA AT OUR FARM. ON THEIR WAY BACK HOME, THE CHEVY COLORADO GAVE A WARNING THAT IT GOT OVERHEATED. SURE ENOUGH, THE VEHICLE SPLATTERED A GOOD AMOUNT OF COOLANT/WATER IN THE ENTIRE UNDERHOOD OF THE VEHICLE. SO SHE PARKED THE VEHICLE BY THE ROADSIDE AND I CALLED THE MY INSURANCE PROVIDER FOR ROADSIDE ASSISTANCE.",
        "vin": "1GCGSDEN6H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "07/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN MOTION MY CAR TENDS TO SHUDDER, I'VE TAKEN THIS TO THE CHEVROLET DEALERSHIP BEFORE AND THEY TOLD ME IT WAS MY ALIGNMENT AND I NEEDED TO GET 4 NEW TIRES ALONG WITH IT. THE PRICE THEY QUOTED ME WAS WAY TOO EXPENSIVE SO I TOOK IT TO LES SCWAB AND GOT TWO NEW TIRES AND DID AN ALIGNMENT. MONTHS LATER THE SAME ISSUES, I TOOK IT TO BIG O TIRES AND DID ANOTHER 4 WHEEL ALIGNMENT AND BALANCING, ALTHOUGH THIS MADE IT A LITTLE BETTER, THE SHUDDERING CONTINUES.",
        "vin": "1GCGTDEN1H1"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I TEST DROVE THE VEHICLE AT OR AROUND 12 NOON ON 6JULY 2020 FOR THE 15 MAXIMUM TIME ALLOWED TO TEST DRIVE.   THE VEHICLE WAS DELIVERED AT 10 PM...THE NEXT MORNING I NOTICED THE SERVICE THEFT DETERRENT SYSTEM LIGHT WAS ON AND IT WOULD NOT TURN OFF.  AFTER RESEARCHING IT WAS DETERMINED THE DEALERSHIP DID NOT ISSUE ME A MASTER FOB AND THIS COULD HAVE CAUSED THE VEHICLE TO SHUT DOWN AT ANY TIME (WHICH IT DID 3 TIMES IN A 5 DAY PERIOD) .  THE VERY NEXT DAY I WAS DRIVING THE VEHICLE AND THE VEHICLE STALLED IN TRAFFIC ON THE HIGHWAY AND JUST STOPPED.  THE STALLING AND VEHICLE CUTTING OFF IN TRAFFIC HAPPENED 2 ADDITIONAL TIMES IN 5 DAYS BEFORE I CONTACTED THE DEALER...I THOUGHT MAYBE IT WAS THE BATTERY BECAUSE OF LACK OF POWER IN THE VEHICLE BUT I WAS INFORMED AFTER A BATTERY TEST IT WAS THE ALTERNATOR ... THE ALTERNATOR HAD AN OUTPUT OF  ABOUT 15.8 WHICH I WAS INFORMED  IS A DANGEROUS LEVEL THE TRUCK COULD CATCH ON FIRE IS NOT FIXED.  I CONTACTED THE DEALER THE NIGHT OF THE 10TH AND CALLED ON 11 JULY 2020 AND SPOKE TO SERVICE MANAGER SAMANTHA SHE INFORMED ME SHE HAD PASSED THE EMAIL TO HER MANAGER.  I DID NOT RECEIVE A RESPONSE VIA EMAIL OR TELEPHONE.  AFTER A SECOND EMAIL AND CALL RICARDO THE SALESMAN TEXT ME TO INFORM ME MY KEY WOULD BE IN THE MAIL AT MY HOUSE ON MONDAY THE 13TH WHICH IT WAS HOWEVER I HAVE TO PAY THE DEALER TO GET IT PROGRAMMED.   THE VEHICLE WAS SOLD AS IS (WHICH I HAVE NO ISSUE WITH) THEREFORE MY COMPLAINT IS THE DEALER IS SELLING VEHICLES THAT ARE DANGEROUS AND THEY HAD TO KNOW THE VEHICLE HAD ALTERNATOR ISSUES AND DIDN'T FIX IT. INSTEAD SOLD IT AS IS RISKING THE LIVES OF ANYONE IS THE VEHICLE OR AROUND IT. RICARDO TEXT ME AS IF I WAS COMPLAINING ABOUT $200 I PAID $18000 CASH $200 IS MY LAST CONCERN HOWEVER I AM CONCERNED ABOUT MY LIFE AND THOSE AROUND ME",
        "vin": "1GCHSBEA2H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338187,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION/TORQUE CONVERTOR ISSUES CREATED JERKING/SHUDDER WHILE DRIVING AT SPEEDS OF 40 TO 70 MPH.",
        "vin": "1GCGTDEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337800,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUDDERS AT ALL SPEEDS WHEN DRIVING AT LOW RPM'S. (LIKE GOING OVER RUMBLE STRIPS PERIODICALLY). ALSO OCCASIONALLY SHIFTS HARD FROM 1ST TO 2ND GEAR. I ASSUME IT'S THE TORQUE CONVERTER & FLUIDS BUT CHEVY WON'T FIX IT. IT NEEDS TO BE RECALLED ASAP!",
        "vin": "1GCGTDEN3H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337448,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS HAD RECURRENT EXHAUST SYSTEM PROBLEMS THAT CAUSE THE CHECK ENGINE LIGHT TO TURN ON AND NOTICES TO APPEAR ON THE DASH DISPLAY. AT 11557 MILES AND 20 MONTHS OF OWNERSHIP THE PARTICULATE MATTER SENSOR FAILED FOR THE FIRST TIME. THIS VEHICLE IS CURRENTLY ON IT'S 5TH PARTICULATE MATTER SENSOR AND HAS REQUIRED DEALER ATTENTION FOR THIS SAME PROBLEM APPROXIMATELY EVERY 1,000 MILES SINCE THE FIRST OCCURRENCE. THE DEALERSHIP STATED THAT ALL THEY CAN DO IS KEEP REPLACING THE PART, WITH NO IDEA WHETHER THE REPAIR WILL EVEN LAST BETWEEN SERVICE INTERVALS. AT APPROXIMATELY 15,000 MILES A NOTICE APPEARED ON THE DASH THAT SAID 'CLEANING EXHAUST FILTER MUST CONTINUE DRIVING'. IT DID NOT TURN OFF IN THE EXTRA 2 HOURS THAT I CONTINUED DRIVING. THE CHECK ENGINE LIGHT EVENTUALLY CAME ON, ALONG WITH A MESSAGE THAT SAID 'ENGINE POWER IS REDUCED'. I BELIEVE THAT THESE REPETITIVE EXHAUST SYSTEM PROBLEMS ARE A SIGNIFICANT SAFETY ISSUE. NOT ONLY DO THEY REQUIRE A DRIVER TO SOMETIMES DRIVE MUCH MORE THAN INTENDED, WHICH INCREASES THE RISK OF AN ACCIDENT OR OTHER PROBLEMS, BUT THEY COULD RESULT IN BREAKDOWN AND STRANDING. CURRENTLY, THERE ARE 15,250 MILES ON THE ODOMETER AND ACCORDING TO DEALER SERVICE RECORDS THIS TRUCK HAS SPENT 79 DAYS AT THE DEALERSHIP FOR WARRANTY REPAIRS. GM HAS AGREED TO EXTEND THE WARRANTY TO COVER FUTURE EXHAUST SYSTEM REPAIRS BUT HAS DENIED A REQUEST FOR REPURCHASE OR REPLACEMENT. IT SEEMS UNREASONABLE THAT GM IS NOT WILLING TO ACCEPT RESPONSIBILITY FOR AN EXHAUST SYSTEM THAT DOES NOT FUNCTION PROPERLY AND CAN'T SEEM TO BE FIXED. I OBVIOUSLY DID NOT SIGN UP FOR THIS WHEN I PURCHASED A NEW VEHICLE. PLEASE SEE DEALER SERVICE RECORDS (ATTACHED).",
        "vin": "1GCPTCE13H1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2020",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327509,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE IN SHOP FOR FAULTY MODULES. TRANSMISSION/TORQUE CONVERTOR ISSUES CREATED JERKING/SHUDDER WHILE DRIVING ON HIGHWAY AT SPEEDS OF 40 TO 70 MPH. WAS IN SHOP FOR OVER 15 DAYS TOTAL AND REPAIR WAS INEFFECTIVE 3 TIMES WITH ACKNOWLEDGING ISSUES AND TWICE WHERE A DIAGNOSTIC WAS RAN AND WAS TOLD NOTHING WAS WRONG. DEALERSHIPS IN THE BEGINNING YEARS AGO REPLACED THE TORQUE CONVERTOR WITH A PRICE OF $2000K. THIS WAS EXPENSIVE AND NOW THEY FLUSH THE TRANSMISSION 3 TIMES AT A COST OF $400.00 PER. GM HAS OFFERED THE ISSUE FOR AN EXTENDED WARRANTY FROM 3 YEARS TO 4 YEARS AND THE ORIGINAL 60 MONTH DRIVE TRAIN. I WANT A BUY BACK AS THIS PROBLEM IS NOT SOLVABLE FROM THE DEALERS STAND POINT OR IT WOULD HAVE BEEN RESOLVED TWO YEARS AGO. I HAVE SENT 10 PAGES OF SHOP RECORDS TO GMLEGAL AS PER THEIR REQUEST.  *TR",
        "vin": "1GCGSDEN3H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/29/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCE A VIBRATION AT THE FRONT OF MY TRUCK WHEN I ACCELERATED AT HIGHWAY SPEEDS.   I WAS TOLD BY MY DEALERSHIP THAT I NEEDED NEW TRANSMISSION FLUID. THEY SAID THAT SHAVINGS GOT INTO THE FLUID. CAUSING THIS PROBLEM. I ASKED IF MY TRANSMISSION WAS DAMAGED AND THEY SAID NO. THEY WANTED ME TO USE THE CAR FOR 200 HUNDRED MILES AND REPORT BACK TO THEM IF THE PROBLEM PERSISTS. I HAVE DOUBTS THAT THIS IS GOING TO SOLVE THE PROBLEM. WHATEVER CONTAMINATED THE TRANSMISSION THE FIRST TIME WILL PROBABLY HAPPEN AGAIN. I WANT SOME PROTECTION IN CASE MY TRANSMISSION FAILS AFTER WARRANTY PERIOD ENDS. I CANNOT AFFORD THIS OUT OF POCKET REPAIR. I WAS NOT NOTIFIED BY CHEVY THAT THIS WAS A PROBLEM. I WAS GETTING AN OIL CHANGE AND MENTIONED TO THEM IF THEY WOULD CHECK OUT THE FRONT END OF THE TRUCK.. THEN THEY MENTIONED TO ME THAT THEIR WAS A SERVICE BULLETIN FROM CHEVY ABOUT THIS PROBLEM. WHY WASN'T I NOTIFIED ABOUT THIS PROBLEM??  REPAIR DATE, TRANSMISSION FLUID CHANGED 5/27/2020.  *TR",
        "vin": "1GCGTDEN1H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION ON THE 2017 CHEVY COLORADO Z71 SHIFTS VERY HARSH BETWEEN FIRST TO SECOND AN SHIFT HARSH FROM SECOND DOWN TO FIRST. THE TRUCK DID HAVE A TRANSMISSION FLUSH IN THE PASS IN 2019 DUE TO SHUDDERING IN SOME GEARS TRUCK CURRENTLY HAS 58,843 MILES. THE TRANSMISSION SHIFTS VERY HARSH WHEN UNDER LIGHT TO MODERATE ACCELERATION THE SHIFTING FEELS LIKE IT A KICK WHEN IT SHIFTS.  *TR",
        "vin": "1GCGTDEN3H1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2020",
        "dateOfIncident": "06/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322984,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. THE CONTACT STATED THAT WHILE DRIVING 25-50 MPH THE DRIVER'S AND PASSENGER'S SIDE DOORS UNLOCKED INDEPENDENTLY, AND THE TEMPERATURE GAUGE FLUCTUATED BETWEEN HIGH AND NORMAL. THERE WERE NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED TO PETE MOORE CHEVROLET INC. (103 N NEW WARRINGTON RD, PENSACOLA, FL 32506, (850) 462-8494) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT BATTERY VOLTAGE WAS LOW. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 31,000.",
        "vin": "1GCGSBEA1H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2020",
        "dateOfIncident": "03/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322258,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STUDDERS AS IF GOING OVER SPEED BARS BETWEEN 40-70 MPH. SHIFTS HARD IN LOWER GEARS. BOUGHT NEW AND HAS BEEN DOING THIS SINCE DAY ONE.",
        "vin": "1GCGSDEN7H1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE FIFTH TIME MY EXHAUST FLUID QUALITY POOR INDICATOR  COMES ON I PAID $1300.00 A GMC NEW ORLEANS TO FIX, BUT THEY COULDN'T FIND THE PROBLEM.  SINCE THEN WHEN IT COMES ON AND I DRIVE IT UNTIL 75 MPH OR 55MPH MAX IT CORRECTS ITSELF.   I DON'T KNOW WHAT TO DO BECAUSE THE DEALER KNOWS NOT WHAT'S THE PROBLEM.  I MET ANOTHER PERSON WITH THE SAME PROBLEM. PLEASE HELP ME IT HAS COME BACK ON HERE ON I-5 NEAR THE SF BAY AREA.  I MUST DRIVE BACK TO LAS VAGAS.   THANK YOU.",
        "vin": "1GCPTDE18H1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317002,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ORIGINAL OWNER OF MY VEHICLE SUCCESSFULLY HAD GM BUY BACK THIS TRUCK. THE NOX SENSORS AND WIRING HARNESS HAD BEEN REPLACED THREE TIMES WHICH CLEARED THE CODES AND ALLOWED THE VEHICLE TO APPEAR TO BE IN PROPER WORKING CONDITION. WHEN GM BOUGHT THE VEHICLE BACK FROM THE ORIGINAL OWNER, GM WENT THROUGH AND SUPPOSEDLY \"FIXED THE ISSUE\" AND BRANDED THE TITLE AS A MANUFACTURER BUYBACK AND PUT THE VEHICLE BACK ON THE MARKET TO THE GENERAL PUBLIC. I PURCHASED THIS VEHICLE KNOWING ALL OF THIS AND TRUSTING THAT IF GM SAID THEY FIXED THE ISSUE, THEY HAD REALLY FIXED IT. NOW I AM A YEAR INTO OWNERSHIP AND THIS VEHICLE IS STILL UNDER WARRANTY, HOWEVER THIS IS THE THIRD TIME THAT THIS SAME EXACT THING THAT THE ORIGINAL OWNER HAD AN ISSUE WITH HAS SURFACED. THE VEHICLE SPEED IS LIMITED WHEN THIS OCCURS MAKING THE VEHICLE DANGEROUS TO DRIVE ON THE ROADS. THE VEHICLE IS ALWAYS IN MOTION WHEN WHEN THIS OCCURS AND USUALLY ON AN INTERSTATE FAR FROM THE DEALERSHIP.",
        "vin": "1GCPTCE19H1"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLS AND TURNS OFF, WHILE DRIVING, IT HAPPENED TWICE IN 2017 AND FOUR TIMES WITHIN THE LAST 2 WEEKS, I'VE TAKEN IT TO THE DEALER 2 TIMES ALREADY AND THEY CAN'T FIND THE PROBLEM, IT HAS TURNED OFF ON ME ON THE FREEWAY AND I GET SCARED BECAUSE MY CHILD SITS IN THE BACK. THE DEALER CAN NOT DO ANYTHING FOR ME I DON'T KNOW WHAT ELSE TO DO, I FEEL UNSAFE DRIVING MY VEHICLE. I DO HAVE DOCUMENTATION THAT I HAVE TAKEN IT TO THE DEALER AND NOTHING CAN BE FOUND.",
        "vin": "1GCGSDEN6H1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311639,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOUCH SCREEN STOPS WORKING AND GOES BLACK ALL THE TIME. ALSO HAVING TROUBLE WITH REMOVING THE KEY. SHIFT TRUCK INTO PARK GO TO TURN TRUCK OFF AND REMOVE KEY BUT KEY DOESN'T TURN ALL THE WAY. SO YOU HAVE TO RESTART THE TRUCK AND SLAM SHIFTER INTO PARK HARD FOR IT TO GO INTO PARK ALL THE WAY",
        "vin": "1GCGTCEN1H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307611,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHOLE VEHICLE SHUTTERS WHEN ACCELERATING ANYWHERE BETWEEN 35 AND 75 MPH. THIS HAPPENS WHILE DRIVING STRAIGHT ON A CITY STREET OR HIGHWAY. IT IS EQUIVALENT TO RUNNING OVER RUMBLE BARS EVERY OTHER SECOND ON A COMPLETELY SMOOTH ROAD. THE TACHOMETER CAN ALSO BE SEEN JUMPING 100-200 RPMS DURING THE SHUTTERS.",
        "vin": "1GCGTDEN2H1"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "08/18/1919",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301930,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVY SHAKE!.. BEEN EXPERICING A  HEAVY SHAKE/VIBRATION SPEEDS OVER 45MPH, IN CITY.. MORE SO ON HIGHWAY TRAVEL, LOOK UP SEVERAL COMPLAINTS  ABOUT THE COLORADO AND ALL PRETTY MUCH HAVE THE SAME PROBLEM? GM DID NOT ISSUE A RECALL ON THESE TRUCKS..HOWEVER ITS OFF THE TWO YEAR WARRANTY. I DID DO RESEARCH  ASSUME IT THE DRIVESHAFT, WHEEL BALANCE TRANSMISSION, THE LIST GOES ON. GM DEALERS KNOW OF THE,PROBLEM, BUT DECLINE TO FIX THE PROBLEM..IT SEEMS TO BE GETTING WORSE AS I DRIVE IT.",
        "vin": "1GCGSCEN0H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "40+ MPH THE TRANSMISSION SOUNDS A RUMBLE STRIP AS DRIVING OVER",
        "vin": "1GCGSCENXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IT FEELS LIKE I AM RUNNING OVER RUMBLE STRIPS WHEN GOING 40-60 MPH AND LOW RPM.  A BRIEF INTERNET SEARCH REVEALS THAT THIS IS A COMMON ISSUE THAT APPEARS TO BE RELATED TO THE TRANSMISSION.  THE ISSUE BEGAN RECENTLY.  I HAVE 40K COMMUTER MILES ON THE TRUCK.",
        "vin": "1GCGTBEN3H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUDDERS AND VIBRATES. HAPPENS USUALLY AROUND 55-60 MPH, AFTER THE FLUID REACHES ABOUT 80 DEGREES. HARD SHIFTING ALSO FROM FIRST TO SECOND GEAR. GM IS AWARE OF THIS PROBLEM YET CHOOSES TO DO NOTHING ABOUT IT. TRUCK IS OUT OF WARRANTY(40K) SO THEY WANT $400 TO FLUSH TRANSMISSION. IT'S A SHAME THAT GM WON'T STAND BEHIND THEIR PRODUCTS. WHEN WILL THEY BE HELD ACCOUNTABLE?",
        "vin": "1GCGTDEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION HAS LOCKED UP THE REAR WHEELS ON DE ACCELERATION/DOWNSHIFT CAUSING LOSS OF CONTROL. THIS HAS HAPPENED MULTIPLE TIMES AND HAS BEEN BROUGHT TO THE ATTENTION OF GM. THE TRUCK IS A SAFETY ISSUE AND NEEDS TO BE TAKEN OFF THE ROAD. GM RECOGNIZES THE TRANSMISSION IN THESE VEHICLES ARE HAVING MAJOR ISSUES BUT FAILS TO ADDRESS THE PROBLEMS.",
        "vin": "1GCGSBEN8H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2020",
        "dateOfIncident": "01/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUDDERS WHEN GOING DO THE ROAD. HAPPENS AT BOTH LOWER SPEEDS AND AT HIGHER SPEEDS IN TOWN AND ON THE INTERSTATE. HARD SHIFTING AS WELL WHEN VEHICLE IS NOT UP TO OPERATING TEMPERATURE.",
        "vin": "1GCGTDEN3H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291448,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK SHUDDERS WHILE ACCELERATING",
        "vin": "1GCGSDEN1H1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/25/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE NOW MY 2017 W/~41000 MILES HAS GONE INTO INSTANT, NO WARNING OR GRACE PERIOD, BUT AN INSTANT DROP TO A FORCED 10 MPH IN THE MIDDLE OF TRAFFIC, THIS LAST TIME ON A HIGHWAY WITH NO SHOULDERS DURING RUSH HOUR.     THE THREE CODES THROWN THE FIRST TIME (I DON'T HAVE THE CODES FROM THE SECOND TIME BUT THE DEALER IS ORDERING A NEW ECM BASED ON THE U0401 CODE):    RC (RADIO CONTROLS): B1325 - CONTROL MODULE POWER CIRCUIT - LOW VOLTAGE   EBCM (ELECTRONIC BRAKE CONTROL MODULE): U0401 - INVALID DATA RECEIVED FROM ENGINE CONTROL MODULE - INVALID DATA   ECM (ENGINE CONTROL MODULE) P200C DIESEL PARTICULATE FILTER (DPF) HIGH TEMPERATURE    ALONG WITH THE CODES THE CHECK ENGINE, STABLITRAK, AND TRACTION CONTROL LIGHTS CAME ON - HOWEVER BRAKING WAS NOT AFFECTED!    REGARDLESS, THIS PROGRAMMED 'LIMP' MODE IS INSANELY RECKLESS WITH TOTAL DISREGARD FOR THE SAFETY AND WELFARE OF THE VEHICLE OCCUPANTS, THERE IS ABSOLUTELY NO SAFE PLACE OR REASON TO DELIBERATELY CRIPPLE A VEHICLE WHILE IN TRAFFIC! SOME EUROPEAN MANUFACTURES AT LEAST GIVE YOU A WARNING WITH SEVERAL ENGINE RESTARTS TO LET YOU DRIVE NORMALLY TO SAFETY AND THEN A DEALER FOR SERVICE ' BUT APPARENTLY EMISSIONS LAWS IN THE US TAKE PRECEDENCE OVER HUMAN LIFE. LIMP MODE CAN BE DISABLED FOR EMERGENCY VEHICLES BUT THE DEALERSHIP TOLD ME IT WAS ILLEGAL FOR THEM TO DO IT FOR ME.    THE DEALERSHIP HAS BEEN GREAT BUT LIMITED TO WHAT THEY CAN DO BECAUSE OF GM REQUIREMENTS. THEY ARE CURRENTLY LOOKING INTO THE PROBLEM AND HAS ORDERED A NEW ECM AS A SECOND PHASE IN TROUBLESHOOTING THE ISSUE (FIRST WAS REPROGRAMMING THE ECM) HOWEVER THERE IS STILL NO EXCUSE FOR FORCING A VEHICLE INTO LIMP-MODE WHILE IN USE - I HAVE LOST ALL FAITH IN THIS VEHICLE AND GM AND CANNOT TRUST IT FOR MY OWN YET FAMILIES SAFE USE.",
        "vin": "1GCPTDE10H1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "12/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE DSSV SHOCKS ON MY ZR2. IT HAS 58,000 MILES ON IT AND THE DSSV SHOCKS ARE LEAKING. TO MY KNOWLEDGE THIS SHOCK IS SUPPOSED TO BE FOR THE LIFE OF THE VEHICLE. I KNOW THERE WAS A RECALL ON SOME 2015-2017 DSSV SHOCKS MINE IS A 2017 BUT I HAVE NO RECALL AND MY SHOCKS ARE LEAKING LIKE THE RECALLED SHOCKS. SINCE THE SHOCKS ARE NOT WORKING PROPERLY IT HAS A LOT OF BODY SWAY AND IS SOMEWHAT UNSTABLE I BELIEVE THE REASON FOR THIS IS BECAUSE THE DSSV SHOCKS ARE NOT WORKING PROPERLY. BOTH OF MY REAR SHOCKS ARE LEAKING AND THE FRONT SHOCKS SEEM TO BOTTOM OUT IN EVERY BUMP. HERE IS THE RECALL NUMBER I FOUND #17345. THIS TALKS ABOUT THE ROD BEING BRITTLE AND CAUSING A LEAK",
        "vin": "1GCPTEE19H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CAMERA DOES NOT WORK 100% OF THE TIME, THIS HAS BEEN HAPPENING FOR SEVERAL WEEKS.  IT GOES BLUE WITH NO PICTURE AND A SERVICE CAMERA MESSAGE.  CAMERA WAS REPROGRAMMED BY DEALER ON 12/16/19, CAMERA AGAIN FAILED ON 12/17/19 - SAME ISSUE.  VEHICLE RETURNED TO DEALER ON 12/18/19 - CAMERA WAS REPLACED,  THE MORNING OF 12/19/19 - CAMERA FAILED AGAIN.  THIS HAPPENS WHEN VEHICLE IS PLACED IN REVERSE AND CAMERA IS SUPPOSED TO ACTIVATE.  IT ALSO HAS APPEARED TO HAPPEN AS THE TEMPERATURES HAVE GOTTEN LOWER HERE IN THE MIDWEST.  AS VEHICLE WARMS UP - CAMERA FUNCTION RETURNS TO NORMAL.",
        "vin": "1GCGTCEN1H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/16/2019",
        "dateOfIncident": "11/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289532,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 25 OCTOBER 2019, WHILE MOVING FORWARD AFTER BACKING OUT OF THE PARKING SPACE AT MY WORK, THE TRUCK BEGAN AN UNCOMMANDED TURN TO THE LEFT.  WITH SIGNIFICANT FORCE I WAS ABLE TO STRAIGHTEN THE STEERING WHEEL.  IN LIGHT OF THE POTENTIAL LACK OF STEERING CONTROL, I HAD THE TRUCK DELIVERED TO THE COURTESY GMC DEALERSHIP IN LAFAYETTE, LOUISIANA FOR REPAIR.  ACCORDING TO THE REPAIR RECEIPT, THE ELECTRIC BELT DRIVE RACK AND PINION STEERING GEAR WAS REPLACED AND THE TRUCK WAS RETURNED TO ME ON 30 OCTOBER 2019.  ON 22 NOVEMBER 2019, AGAIN WHILE DRIVING THROUGH THE PARKING LOT AT MY WORK THE TRUCK WENT INTO AN UNCOMMANDED LEFT TURN.  THE ACTIONS OF THE TRUCK WERE NEARLY IDENTICAL AS I EXPERIENCED IN THE FIRST TRUCK LOSS OF CONTROL EVENT.  I DELIVERED THE TRUCK TO COURTESY GMC IN LAFAYETTE, LOUISIANA.  WHEN THE CUSTOMER SERVICE ADVISOR TURNED THE TRUCK INTO THE SERVICE BAY, A LOUD METAL-TO-METAL SOUND WAS HEARD FROM THE FRONT OF THE TRUCK.  ON 4 DECEMBER 2019, I MET WITH THE CUSTOMER SERVICE ADVISOR AND THE AUTOMOTIVE TECHNICIAN AT THE COURTESY GMC DEALERSHIP TO DISCUSS THE STATUS OF THE TRUCK.  THE AUTOMOTIVE TECHNICIAN STATED THAT HE WAS GOING TO CONTACT GMC ABOUT THE ISSUE THE NEXT MORNING.  ON 5 DECEMBER 2019, I WAS CONTACTED BY THE AUTOMOTIVE TECHNICIAN WHO INFORMED ME THAT HE HAD DISCUSSED THE ISSUE WITH AN ENGINEER AT GENERAL MOTORS CORPORATION.  THE ENGINEER ADVISED THE AUTOMOTIVE TECHNICIAN TO REPLACE THE PART THAT WAS PREVIOUSLY REPLACED, BUT ORDER THE PART THROUGH A DIFFERENT PARTS WAREHOUSE.  THIS WAS STRANGE TO ME AS I WOULD BELIEVE THAT THE PARTS FROM ANY WAREHOUSE WOULD BE ACCEPTABLE.  ON DECEMBER 2019, THE TRUCK REPAIR WAS COMPLETED AND WAS RETURNED TO ME.  THUS FAR, THE TRUCK HAS OPERATED PROPERLY.",
        "vin": "1GCGSBEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2019",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289096,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS STUTTERING RANDOMLY EVERY MINUTE OR SO, IT VIBRATES THE CAR AND FEELS LIKE I'M RUNNING OVER RUMBLE STRIPS.",
        "vin": "1GCGTDEN1H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288350,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM EXPERIENCING DIFFICULTY REMOVING MY KEY FROM THE IGNITION SWITCH AFTER TURNING OFF THE VEHICLE. THE KEY BECOMES STUCK AND WILL NOT RETRACT.  I HAVE TO START THE VEHICLE AGAIN AND THEN ATTEMPT TO SHUT IT DOWN IN HOPES THAT I CAN REMOVE THE KEY.  VARIOUS ATTEMPTS ARE MADE AND I'VE FOUND THAT IF I TURN THE IGNITION SWITCH OFF \"QUICKLY\", THE KEY WILL COME OUT. I HAD ONE INCIDENT WHERE THE KEY WOULD NOT COME OUT AND I HAD TO SECURE MY VEHICLE WITH THE KEY FOB BUT LEAVING MY KEYS IN THE IGNITION SWITCH AND POSSIBLY ALLOWING SOMEONE TO BREAK INTO MY VEHICLE AND STEAL IT WHICH I SHOULDN'T HAVE TO DO.  THIS ISSUE IS BECOMING VERY FRUSTRATING.  I'M SCHEDULING AN APPOINTMENT WITH A LOCAL CHEVY DEALER TO SEE IF THEY CAN RECTIFY THE PROBLEM.",
        "vin": "1GCGTCEN8H1"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288422,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TURNING INTO AN APARTMENT COMPLEX PARKING LOT IN NOTED VEHICLE WHEN THE VEHICLE SUDDENLY ACCELERATED SENDING ME INTO THE SIDE OF THE APARTMENT BUILDING.  I WAS IN THE PROCESS OF APPLYING THE BRAKE WHEN THIS OCCURRED.  THERE WAS NO TIME TO REACT OR AVOID THE SIDE OF BUILDING AND I INCURRED DAMAGE TO BOTH MY VEHICLE AND THE SIDE OF THE BUILDING.",
        "vin": "1GCGTDENXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 COLORADO, 19632 MILES, HARD UP/DOWN SHIFTS TO FIRST GEAR AND SHUDDERS WHILE DRIVING, FOUND BULLETIN 18NA355, DEALER HUFFINES CHEVROLET PLANO TX REPLACED TRANSMISSION FLUID PER BULLETIN AND RESOLVED SHUDDERING ISSUE BUT NOT HARD SHIFTING IN AND OUT OF FIRST GEAR AND DEALERSHIP WILL NOT RETURN CALLS TO RESOLVE PROBLEM.",
        "vin": "1GCGSCEN0H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "12/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUTTERS WHEN GOING AT A CONSTANT SPEED.  THIS STARTED AROUND 10K MILES AND THE DEALERSHIP HAS TRIED TO FIX IT THREE TIMES WITHOUT SUCCESS.  FIRST TWO TIMES THEY REPLACED THE TORQUE CONVERTER AND THIRD TIME THEY REPLACED THE TRANSMISSIONS FLUID.  THE TRUCK ALSO SHIFTS VERY HARD FROM FIRST GEAR TO SECOND GEAR WITH A HUGE JERKING MOTION AROUND 10 MPH.  THIS IS VERY DANGEROUS WHEN DRIVING IN PARKING LOTS OR ANYWHERE NEAR PEDESTRIANS.  FINALLY, WHEN COMPRESSING THE BRAKE AT 25MPH THE TRUCK JERKS VERY VIOLENTLY DOWN TO THE NEXT GEAR.   THE TRANSMISSION IN THESE TRUCKS NEEDS TO BE RECALLED AND REPLACED SOON.",
        "vin": "1GCGSDEN1H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 COLORADO Z71. I BOUGHT IT SPECIFICALLY SO THAT BOTH MY WIFE AND I COULD USE IT AS NECESSARY, (BEING OF QUITE SMALL STATURE SHE IS UNABLE TO DRIVE A FULL SIZE PICK UP) HOWEVER, DUE TO THE FOLLOWING ONGOING ISSUES SHE HAS YET TO AGREE TO DRIVE IT OUT OF CONCERN FOR HER SAFETY. IT PRESENTED WITH WHAT HAVE BECOME CHRONIC TRANSMISSION PROBLEMS IMMEDIATELY AFTER PURCHASE. I HAVE RETURNED IT TO THE DEALER MULTIPLE TIMES TO NO AVAIL. INITIALLY IT INTERMITTENTLY SHUDDERED TO THE POINT OF VIBRATING THE ENTIRE VEHICLE AS IF DRIVING OVER RUMBLE STRIPS WHILE DRIVING ON EITHER STREETS OR HIGHWAY. THEN IT BEGAN LUNGING FORWARD UNEXPECTEDLY AND UNCONTROLLABLY WHEN PRESUMABLY SHIFTING TO THE POINT WHICH FEELS LIKE HAVING BEEN REAR ENDED BY ANOTHER VEHICLE WHILE DRIVING ON BOTH STREETS AND IN PARKING LOTS. DURING THE SPAN OF MULTIPLE VISITS THE DEALER HAS REPLACED THE TORQUE CONVERTER, AS WELL AS REPLACING THE TRANSMISSION FLUID. DESPITE NO LONGER SHUDDERING, THE VEHICLE STILL LUNGES RANDOMLY. I WAS INFORMED BY THE SERVICE MANAGER DURING MY LATEST VISIT ABOUT THE LUNGING THAT THEY KNEW WHAT THE VEHICLE IS DOING, AND THAT THERE IS NO FIX FOR IT...WHICH IS ABSOLUTELY UNACCEPTABLE. I'M QUITE CONCERNED ABOUT MY VEHICLE LUNGING UNEXPECTEDLY AND UNCONTROLLABLY INTO A PEDESTRIAN OR ANOTHER VEHICLE.",
        "vin": "1GCGSDEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUDDER. SEEMS COMMON AFTER 40,000 MILES ON THE MAJORITY OF 2017-19 COLORADOS. TRUCK WOULD VIBRATE LIKE DRIVING OVER A RUMBLE STRIP AROUND 55+ MPH AFTER TRANSMISSION FLUID WOULD WARM UP ABOVE 80 DEGREES F. SHOULD BE A RECALL BECAUSE I HAD TO GO THROUGH HOOPS TO GET THEM TO EVEN LOOK AT THE TRANSMISSION BECAUSE THEY THOUGHT IT WAS A TIRE OR WHEEL WEIGHT. SUPER INCONVENIENT AND TIME CONSUMING.",
        "vin": "1GCGTDEN1H1"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT A CHECK ENGINE LIGHT WHILE AND ENGINE GOES INTO REDUCED POWER MODE. YOU CAN'T DRIVE IN REDUCED POWER MODE! I HAVE TO CLEAR IT TO MOVE THE TRUCK. I DID A SCAN WHICH SHOWED A P2138 CODE. BUT ITS JUST IN MEMORY AND THE DEALER WONT FIX IT UNLESS ITS AN ACTIVE CODE BUT CAN'T DRIVE TO THE DEALER IN REDUCED POWER MODE. ITS A CATCH 22",
        "vin": "1GCGTDEN2H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/06/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUDDER",
        "vin": "1GCGTBENXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK SHUDDERS HORRIBLY ON HIGHWAY AND IN TOWN. IT STARTED JUST BEFORE MY LAST SERVICE AT 33731 MILES. I MENTIONED IT TO SERVICE ADVISOR AND WAS TOLD WITHOUT A CODE AS OWNER I WOULD BE THE ONLY ONE THAT COULD TELL THIS. NOTHING WAS DONE. THE ISSUE IS IRRITATING I RESEARCHED AND FOUND OUT IT IS AN ISSUE WITH MANY COLORADOS AND GM VEHICLES WITH THE SAME TRANSMISSION. I WILL BE CHECKING WITH THE DEALERSHIP SERVICE AGAIN TO SEE WITH THE INFORMATION I HAVE DISCOVERED IF ANYTHING WILL BE DONE.",
        "vin": "1GCGSCENXH1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UPPER CONTROL ARM, RIGHT HAND SIDE, WENT BAD AND NEEDED REPLACEMENT IN UNDER 20,000 MILES. DETECTED WITH A CLUNKING NOISE, AND CONFIRMED WHEN I WENT IN FOR ALIGNMENT. IT WAS REPLACED BEFORE IT BROKE, BUT A BROKEN CONTROL ARM IS A MAJOR SAFETY RISK.",
        "vin": "1GCGTBEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243190,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUTTERING AND JERKING. RECALL NEEDS TO BE DONE IMMEDIATELY.",
        "vin": "1GCGSCEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCE TRANSMISSION SHUDDER WHILE DRIVING VEHICLE. COULD CAUSE ISSUE WHILE PASSING OTHER VEHICLES DUE TO LOSS OF POWER. THE AMOUNT OF MONEY THESE NEWER VEHICLES ARE CHARGING, TRANSMISSION SHIFTING SHOULD BE FLAWLESS. NOT SURE IF THIS IS GOING TO GET WORSE AND CAUSE AN ACCIDENT. COULD IT JUMP GEARS WHILE TRYING TO COME TO A STOP?  THIS IS ONGOING AND NEEDS TO BE ADDRESSED AND A REMEDY BY THE MANUFACTURER SOON.",
        "vin": "1GCGTDEN2H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SHUDDER AND SLIPPING IN THE GEARS CAUSED BY BAD FLUID AND TORQUE CONVERTER.",
        "vin": "1GCGTDEN1H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GO TO TURN THE KEY OFF AND THE IGNITION WON'T TURN OFF ALL THE WAY, HAVE TO RESTART THE TRUCK A COUPLE OF TIMES TO EVEN GET THE KEY TO TURN OFF TO GET THE KEY OUT, ALSO GO TO START THE TRUCK AND SOMETIMES IT WON'T MOVE THE IGINITION",
        "vin": "1GCGTCENOH1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222074,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU START THE TRUCK IT SMELLS REALLY STRONG OF GAS WHEN RUNNING",
        "vin": "1GCGTCENOH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD SHIFTING & SLIPPING OF THE TRANSMISSION STARTED AT ABOUT 10,000 MILES. DEALER UNABLE TO REPAIR EVEN THOUGH THEY TRIED 4 TIMES INCLUDING A REMANUFACTURED TRANSMISSION. NOT SURE WHAT TYPE OF DAMAGE IS OCCURRING TO THE TRANSMISSION WITH THIS HARD SHIFTING.",
        "vin": "1GCGTCEN6H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "12/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207262,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. THE CONTACT STATED THAT WHEN DRIVING AT AN UNKNOWN SPEED, THE ENGINE HESITATED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE STAR CHEVROLET DEALER (724-790-2046, LOCATED AT 5200 US-30 C, GREENSBURG, PA 15601) WHERE THE TRANSMISSION FLUID WAS REPLACED. THE FAILURE RECURRED AND THE SAME TECHNICIAN REPLACED THE TORT CONVERTER. THE FAILURE RECURRED AND WHEN THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER, THE TECHNICIAN STATED THAT THE VEHICLE WAS PERFORMING AS DESIGNED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE ISSUE WOULD BE INVESTIGATED.  THE CONTACT WAS NOT CALLED BACK. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 18,000. *JB",
        "vin": "1GCGTCEN7H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/09/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206592,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUDDERS/SHAKES WHEN ACCELERATING OR MAINTAINING SPEED.  CAN BE LIGHT SHUDDER, LIKE DRIVING OVER A BUMPY ROAD. OR CAN BE ENOUGH TO MAKE EVERYTHING SITTING IN DASH TO SHAKE VIOLENTLY.",
        "vin": "1GCGSBEN4H1"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE DRIVING LOW SPEEDS, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE CONTACT HAD TO JERK THE STEERING WHEEL TO GET IT TO OPERATE NORMALLY. IN ADDITION, THE BRAKE WARNING INDICATOR ILLUMINATED. THE \"PLEASE CHECK POWER STEERING \"AND \"DRIVE SAFELY\" MESSAGES WERE ALSO DISPLAYED. THE VEHICLE WAS TAKEN TO BARLEY AUTOMOTIVE  (791 STE GENEVIEVE DR, GENEVIEVE, MO 63670, (573) 355-9633) WHERE IT WAS DETERMINED THAT THE VEHICLE WAS OPERATING AS DESIGNED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 19,000.",
        "vin": "1GCHSBEA3H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2019",
        "dateOfIncident": "03/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190279,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOCKED WHEN TURNING INTO A PARKING LOT AND WOULD NOT STRAIGHTEN OUT",
        "vin": "1GCGTCEN5H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN RUN IN HIGH HEAT, A VALVE IN THE AIR CONDITIONING SYSTEM FREEZES UP AND SHUTS DOWN THE SYSTEM.  THE SYSTEM NEEDS TO BE TURNED OFF UNTIL THE VALVE UNTIL IT DEFROSTS BEFORE THE SYSTEM RESUMES TO OPERATE.  I TOOK IT INTO THE DEALERSHIP AND WAS TOLD THAT IT IS A KNOWN PROBLEM AND THAT THE MANUFACTURER IS LOOKING INTO WAYS TO REPAIR IT AND WOULD NOTIFY ME.  I WAS ALSO TOLD THAT THE SYSTEM IN MY VEHICLE IS ALSO USED IN OTHER MODELS AND AFFECTS THEM ALL.  IT HAS BEEN 8 OVER MONTHS AND NOTHING HAS BEEN HEARD FROM THE DEALER.  I SENT THEM A MESSAGE INQUIRING AND THEY HAVE NOT RESPONDED.  I DON'T KNOW IF THIS QUALIFIES AS A SAFETY COMPLAINT THAT YOUR DEPARTMENT INVESTIGATES BUT NOT HAVING A WORKING A/C WHEN DRIVING ACROSS THE DESERT IN 120+ DEGREE HEAT IS NOT CONDUCIVE TO GOOD HEALTH.  THANK YOU FOR YOUR TIME.",
        "vin": "1GCGSCEN9H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "03/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185794,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IS INTERMITTENT AT TIMES. THE STEERING WHEEL WILL NOT TURN SMOOTHLY, INSTEAD IT JUMPS IN 1-2\" INCREMENTS. SEEMS TO RESET OR FIX ITSELF AFTER THE TRUCK IS TURNED OFF FOR A LITTLE WHILE.",
        "vin": "1GCGTCEN7H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181332,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE DRIVING AT HIGH SPEEDS, THE VEHICLE STARTED TO VIOLENTLY VIBRATE. THE FAILURE ALSO OCCURRED WHEN ACCELERATING FROM A STOP. THE VEHICLE WAS TAKEN TO DYER CHEVROLET FORT PIERCE (4200 US HIGHWAY 1, FORT PIERCE, FL 34982, (772) 242-3116) MULTIPLE TIMES FOR THE FAILURE WHERE THE TRANSMISSION WAS SERVICED AND FLUSHED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE CONTACT RECEIVED A CASE NUMBER. THE FAILURE MILEAGE WAS 17,000.",
        "vin": "1GCGSDEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "09/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181016,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPT 2018 HAVE NOTICED THAT TRUCK SEEMS TO VIBRATE, SHUDDER AT 50-60MPH.   VIBRATION, SHUDDERING GOT WORSE, EVEN AT 25MPT.  OCTOBER, I CONTACT SERVICE ADVISOR WHO BELIEVES MIGHT BE TORQUE CONVERTER NEED APPT TO VERIFY NOVEMBER FINALLY GOT APPT WITH SERVICE DEPT .  THEY VERIFY IT IS TORQUE CONVERTOR AND ORDER PARTS. DECEMBER PARTS IN & TRUCK IN FOR 3 DAYS AS PARTS INSTALLED.  TOLD THIS SHOULD SOLVE ISSUE, BUT CHEVROLET WORKING OF ANOTHER FIX FOR 1ST QUARTER OF 2019.  TO DATE, I HAVE NOT NOTICED ANY ISSUES OF VIBRATION.DATE.",
        "vin": "1GCGTDEN4H1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "07/25/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11180051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP WELD CRACK, SERVICE 4WD MESSAGE DISPLAYED, CLUNKING IN REAR END ALL DISMISSED REPEATEDLY FROM DEALERSHIP I PURCHASED MY VEHICLE FROM.      I BOUGHT THIS TRUCK NEW OFF THE LOT WHICH HAS BEEN IN THE SHOP IN EXCESS OF 10 TIMES FOR MULTIPLE ISSUES.  THE 4X4 STARTED NOVEMBER 2017 I WAS TOLD IT WAS BECAUSE WE WERE HAVING ABNORMALLY COLD WEATHER AND IT WOULD COME OUT OF IT.  IT HAS BEEN IN MULTIPLE TIMES SINCE THEN AND THEY WERE UNABLE TO DUPLICATE.    CLUNKING IN REAR WAS DISMISSED AS NOTHING, COULD NOT DUPLICATE.      I STARTED SMELLING BURNING PLASTIC, THEN WHEN STARTING MY VEHICLE IN THE MORNING THE EXHAUST SMELL WAS SO OVERPOWERING THAT IT WOULD GAG US. THE BURNING PLASTIC SMELL WAS INTERMITTENT WHILE DRIVING AND THAT WAS ONLY AFTER DRIVING THE TRUCK BETWEEN 2 TO 20 OR THE FULL DRIVE HOME AND SOMETIMES NOT AT ALL.   I HAD BEEN NODDING OFF, GETTING MASSIVE HEADACHES AND SICK TO MY STOMACH WHILE DRIVING MY TRUCK, SO WAS MY DAUGHTER.  NO MATTER WHAT THEY HAD MY TRUCK FOR, THEY COULD NOT DUPLICATE THE ISSUE AND I HAD A LOANER FOR A WEEK AT A TIME.      I TOOK MY VEHICLE TO ANOTHER DEALERSHIP WHO JUST ENDED UP SEALING MY PICKUP BOX, REPLACING FUEL PUMP MODULE, INSTALLED A BODY PLUG PER A BULLETIN, PER BULLETIN APPLIED LUBRICANT TO BOTH REAR LEAF SPRINGS AND TORQUED LEAF SPRINGS TO SPECS.  TRANSFER CASE CONTROL MODULE HAD A BULLETIN FOR WHICH MY DEALER STATED THEY PUT DIELECTRIC LUBRICANT.    I WAS DRIVING A VEHICLE WITH MY CHILD IN IT WITH CARBON MONOXIDE POISONING US BASED ON THE SYMPTOMS WE WERE BOTH SUFFERING, EXACTLY WHEN WOULD THAT HAVE BEEN DUPLICATED, AT AUTOPSY????  I DON'T TRUST THIS TRUCK, I DON'T WANT TO DRIVE THIS TRUCK, I HATE THIS TRUCK NOW AND I AM STUCK WITH 5 YEARS OF PAYMENTS AND SOMETHING THAT TRIED TO KILL ME.  HOW IS THAT FOR SAFETY!!!!  MY OPINION ONLY!!!",
        "vin": "1GCGTCENXH1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "09/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176263,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE DRIVING 70 MPH, THE CONTACT'S DAUGHTER-IN-LAW PLUGGED IN HER CELL PHONE TO THE CHARGING UNIT. SHORTLY AFTER, THE VEHICLE DECELERATED, YET THE RPMS INCREASED WITHOUT WARNING. THE VEHICLE WAS TOWED TO KREIGERS CHEVROLET BUICK (2113 11TH ST, DEWITT, IA 52742, (563) 659-3225) TO BE DIAGNOSED, BUT NO FAILURE CODES COULD BE LOCATED. THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER FOR INSPECTION AND REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 11,300. *TT  CONSUMER STATED FIRST TIME IT SHUT DOWN CHANGED OUT TRANS CONTROL MODULE, SECOND TIME STOPPED AT THE STOP SIGN BY WOULD NOT MOVE, DEALER THOUGHT IT WAS THE TRANSMISSION. SO AFTER MANY TRIES DEALER REPLACED IT. AFTER IT WAS REPLACED IT FAILED TWO MORE TIMES. CONSUMER THEN PULLED TO THE ROAD AND THE DOOR LOCKS KEPT LOCKING AND UNLOCKING. THIS IS TWO MONTHS IN.*JB",
        "vin": "1GCGSCEN9H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/07/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS ALL THE VEHICLES ON THE ROAD RUNNING WITH NO LIGHTS ON. THIS IS HAPPENING MORE AND MORE EVEN IN ALMOST DARK TIMES OF THE DAY. TODAY I DROVE AN HOUR EACH WAY ON I-696 FROM HOWELL TO I-75 AND SAW AT LEAST 20 VEHICLES WITH  NO LIGHTS IN HEAVY FOG AND RAIN. I LEAVE MY HOME AT DAWN FOR WORK EVERY DAY AND HAVE ALMOST PULLED OUT IN FRONT OF TRAFFIC WITH NO LIGHTS ON. VEHICLES BLEND RIGHT INTO THE SNOW BACKGROUND WITHOUT RUNNING LIGHTS. PLEASE MAKE LIGHTS MANDATORY 24/7 SO ACCIDENTS AND INJURIES/DEATHS CAN BE AVOIDED.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/27/2019",
        "dateOfIncident": "01/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING ON THE FREEWAY FROM APPROXIMATELY 65MPH, THE STABILITY CONTROL SYSTEM ENGAGED AND TOOK CONTROL OF THE ACCELERATION OF THE VEHICLE.  ROADS WERE DRY WITHOUT ICE, SNOW OR RAIN.  THE STABILITY CONTROL REDUCED POWER UNTIL THE ENGINE DIED EVEN WHILE PRESSING THE ACCELERATOR TO THE FLOOR.  THE ENGINE WOULD NOT RESTART FOR APPROXIMATELY 5 MINUTES.  THIS OCCURRED 3 TIMES ON DIFFERENT INTERSTATES ON A TRIP.  WE WERE FORCED TO CAREFULLY MOVE TO THE RIGHT SHOULDER WHILE OUR VEHICLE WAS SLOWING UNTIL THE ENGINE DIED.  MY WIFE AND I WERE LUCKY WE WERE NOT INVOLVED IN A SERIOUS ACCIDENT.  ONSTAR NOTIFICATIONS SENT THE FOLLOWING IN AN EMAIL, \"AN ISSUE WITH THE ENGINE AND TRANSMISSION SYSTEM IN YOUR 2017 CHEVROLET COLORADO HAS BEEN DETECTED. PLEASE SERVICE YOUR VEHICLE WITHIN 7 DAYS.\"",
        "vin": "1GCHTCEN7H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE DRIVING VARIOUS SPEEDS, THE CONTACT SMELLED AN ABNORMAL ODOR COMING FROM THE AIR VENTS. THE VEHICLE WAS TAKEN TO HURD AUTO MALL (1705 HARTFORD AVE, JOHNSTON, RI, 401-372- 3051) TO BE DIAGNOSED, BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 9-4995645432. THE FAILURE MILEAGE WAS APPROXIMATELY 8,930.",
        "vin": "1GCHTBEA5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2019",
        "dateOfIncident": "01/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171123,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT SPEEDS 45 MPH TRANSMISSION MAKES A LOAD THUMBING SOUND AND START SWITCHING BACK AND FORTH FOR GEAR. AT SPEEDS 60 UP TO 70 MPH A SHUDDERING STARTS MOSTLY UP GRADES AND DOWN GRADES. FROM REVIEW THERE IS A BULLETIN GM 16-NA-175. FROM WHAT I READ THIS DOESN'T FIX THE PROBLEM. THERE ARE NUMEROUS OF COMPLAINTS.",
        "vin": "1GCGTDEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2019",
        "dateOfIncident": "07/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK BOGS DOWN, LOOSES POWER WHEN TAKING OFF FROM A STOP. FRONT TIRES FEEL LIKE THEY ARE SKIPPING EVEN THOUGH TRUCK IS IN 2 WHEEL DRIVE ESPECIALLY UP HILL. ONCE TRUCK GETS GOING IT RUMBLES AND VIBRATES SO MUCH IT BOTHERS YOUR EARS, CONSTANTLY LOOSING POWER AND SPEED AS YOUR DRIVING. WAS TOLD IT WAS THE TORQUE CONVERTER AND IT WAS REPLACED. TRUCK CONTINUED TO HAVE SAME ISSUE. TRUCK THEN 'BLEW UP' (DEALERSHIP WORDS) WHILE I WAS DRIVING 75 MPH DOWN THE HIGHWAY. DEALERSHIP STATED 'IT WAS LIKE YOUR TRUCK WENT INTO LOW GEAR WHILE YOU WERE DRIVING AND IT SHOULD NEVER BE ABLE TO DO THAT'. HAD FLUID FLUSH AND REPLACED AGAIN AND RUMBLING AND POWER LOSE STILL OCCURRING.",
        "vin": "1GCGTDEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE DRIVING HIGHWAY SPEEDS, THE CONTACT NOTICED THAT THE TACHOMETER FLUCTUATED AND THE TRANSMISSION SHUDDERED. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION TORQUE CONVERTER FAILED. THE DEALER REPLACED THE TORQUE CONVERTER AND THE TRANSMISSION WAS FLUSHED. THE DEALER ALSO REPROGRAMMED THE TRANSMISSION COMPUTER. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 9-4982753540. THE MANUFACTURER ISSUED TECHNICAL SERVICE BULLETIN NUMBER: 4942742 PIE0405C (ENGINEERING INFORMATION TORQUE CONVERTER SHUDDER). THE APPROXIMATE FAILURE MILEAGE WAS 13,500. *TT  CONSUMER STATED TORQUE CONVERTER HAD WRONG TRANSMISSION FLUID FROM FACTORY.*JB",
        "vin": "1GCGTCEN4H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162161,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 21000 MILES FELT LIKE DRIVING OVER RUMBLE STRIPS AND TACH WOULD MOVE IN CRUISE.  DEALER FLUSHED TRANS. 4 MONTHS LATER AT 29000 MILES SAME PROBLEM BUT NOW SHIFTING HARD NOTICED DURING ACCELERATION AND DECELERATION.  CHANGED OUT CONVERTER AND  FLUSH. NOW 3 MONTHS LATER AND ONLY 2500 MILES LATER IT HAS STARTED ALL OVER AGAIN.  SO BACK TO THE DEALER I WILL GO. AM STARTING TO REGRET BUYING A CHEVY INSTEAD OF STAYING WITH MY TRUSTY FORD",
        "vin": "1GCHSBEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2018",
        "dateOfIncident": "10/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHUDDER.  FELLS LIKE DRIVING OVER RUMBLE STRIPS. GM KNOWS OF THIS ISSUE BUT KEEPS PUTTING THESE 8 SPEED TRANSMISSIONS ON THE ROAD.",
        "vin": "1GCGTDEN4H1"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AUTOMATIC TRANSMISSION DOWNSHIFTS INTO 1ST GEAR COMING TO A STOP, IT LUNGES FORWARD. IF WHEN NOSING INTO A PARKING SPACE WITH ANY KIND OF POLE OR VEHICLE DIRECTLY IN FRONT OF MY TRUCK, NOT LEAVING ENOUGH SPACE MY TRUCK WOULD HIT WHATEVER.    WHEN DRIVING SLOWLY WITH MY 8 SPEED AUTOMATIC TRANSMISSION SOMETIMES IT RATTLES AS IF I AM ON A RUMBLE STRIP AND SOMETIMES IT JUST CLUNKS OR THUDS.  THIS AND OTHER SHIFT ISSUES MAKE ME EVEN MORE HYPER VIGILANT WHEN DRIVING.    6 MONTHS AFTER I PURCHASED MY BRAND NEW 2017 COLORADO, DURING A SPELL OF NEGATIVE DEGREE WEATHER I LOST THE FOLLOWING:  MY CRUISE CONTROL, TRACTION CONTROL, FOUR-WHEEL DRIVE; MY ENGINE LIGHT CAME, OIL LIGHT ALL LIGHTS CAME ON AND MY RADIO STOPPED WORKING.  I WAS TOLD BY MY CHEVY DEALER THAT THIS WAS NORMAL IN COLD WEATHER.  NEXT, I WAS INFORMED IT MUST BE BECAUSE I WASHED MY VEHICLE THE DAY BEFORE.  THIS WENT ON FOR A FEW MONTHS, WITH ME SHOWING THEM VIDEOS AND THEM TELLING ME THEY COULD NOT DUPLICATE THE ISSUE.  OCTOBER OF 2018 THEY REPLACED MY RADIO BECAUSE EVIDENTLY THE RADIO HAD A BULLETIN THAT SHOWED ALL OF THE THINGS I HAD COMPLAINED ABOUT. I WANT TO SAY THIS HAPPENED IN EXCESS OF 10 OR MORE TIMES.  DRIVING TO MY MOTHERS ONE EVENING IN THE DARK MY DASH LIGHTS WERE NOT DIMMING  CORRECTLY AND THEN WENT OUT.  AS I GOT TO A FOUR WAY INTERSECTION WITH CARS COMING THEY CAME ON SO BRIGHTLY I ALMOST GOT IN AN ACCIDENT WHICH PROMPTED ME TO MAKE AN APPOINTMENT AND I WASN'T WILLING TO HEAR SILLY EXCUSES.",
        "vin": "1GCGTCENXH1"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/10/2018",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150689,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING WOULD GO OUT AT ANT TIME AND THEN IT WOULD START WORKING AT DIFFERENT TIMES.WOULD HAVE AN AUDIBLE ALARM SERVICE POWER STEERING WOULD COME ON THE DISPLAY AND MY ABS AND BRAKE LIGHT WOULD TURN ON.ALMOST WRECKED ON 3 DIFFERENT OCCASIONS BECAUSE OF THE LOSS AND THEN WORKING OF THE STEERING",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141100,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DIRT ROAD 11PM AT NIGHT, TURNED LEFT TO GET OUT OF THE UNEVEN GROUND ABOUT 5 MPH, SIDE CURTAIN WENT OFF, SEATBELT PRETENSIONERS DEPLOYED",
        "vin": "1GCHSCENXH1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133388,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONER PERIODICALLY AND AT RANDOM WILL FREEZE UP ON TRIPS OVER 1/2 HOUR.  I HAVE TAKEN IT TO THE DEALER TWICE.  ONCE THEY COULD DUPLICATE THE PROBLEM AND REPLACED THE EVAPORATOR TEMPERATURE SENSOR.  BUT I STILL HAVE THE PROBLEM.  THIS LAST TIME THEY KEPT THE VEHICLE TWO DAYS AND COULDN'T DUPLICATE THE PROBLEM.  I HAVE MEASURED THE VENT AIR TEMPERATURE AS LOW AS 35 DEGREES (THE TEMP SENSOR SHOULD NOT ALLOW THIS) AND HAVE ALSO MEASURED THE TEMP AT 40 DEGREES F AT WHICH TIME IT STARTED TO FREEZE UP.  WHEN THIS OCCURS, THE VOLUME OF AIRFLOW DROPS, THE VENT AIR TEMPERATURE STARTS TO CLIMB AND IF I STOP AND OPEN THE HOOD I WILL SEE ICE ON THE EVAPORATOR LINE. THE PROBLEM HAS OCCURRED ON THE HIGHWAY ON 2 TO 3 HOUR TRIPS BUT ALSO HAS OCCURRED ON A 1 HOUR TRIP AT 50 MPH AND ALSO A 1/2 HOUR TRIP IN CITY (STOP AND GO) TRAFFIC.  THE AC COMPRESSOR DOES NOT APPEAR TO EVER TURN OFF, UNLESS I PUSH THE BUTTON TO TURN OFF THE AC.    THE DEALER CANNOT FIX.  GM ENGINEERS ARE STUDYING BUT DON'T HAVE A SOLUTION.",
        "vin": "1GCGSCEN1H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131648,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING A RIGHT HAND TURN ONTO OUR ROAD THE STEERING WHEEL LOCKED UP.  I WAS UNABLE TO CONTROL THE TRUCK OTHER THAN BRAKING.  AFTER SLAMMING ON THE BRAKES THE STEERING RESUMED.",
        "vin": "1GCGTDENXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD REPEATED ISSUES WITH THE TRANSMISSION AND THE TRANSMISSION WILL NOT SHIFT OUT OF 5TH GEAR WHEN IN TOW MODE AND WHEN TOWING LOAD UNDER SPECIFICATIONS. I HAVE STARTED THE LEMON LAW PROCESS BUT THE MANUFACTURER HAS DENIED MY CLAIM AS OF TODAY.",
        "vin": "1GCHSBEN1H1"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/03/2018",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING IS INTERMITTENT/BLOWS WARM/EMITS FOG FROM VENTS. THE DEALER SAYS NO FIX AVAILABLE YET CITES PER DOC ID:5125499.SAYS ENGINEERING IS STUDYING PROBLEM. MINE STOPS WORKING-BLOWS WARM WITH IN 1/2 HOUR. ALSO IN STOP/GO TRAFFIC THE TRANSMISSION DOWNSHIFTS ABRUPTLY AND CAUSES TRUCK TO ACCELERATE FORWARD-HAVE TO APPLY BRAKES HARD TO AVOID COLLISION. DEALER SAYS CAN NOT REPEAT BUT SHIFTING IS CONSISTENTLY ABRUPT AND I HAVE ASKED ABOUT SOFTWARE UPDATES TO ALLIEVIATE THIS SAFTY CONCERN TO NO AVAIL",
        "vin": "1GCGSDEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122794,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS A SHUDDER IN THE TRANSMISSION UNDER LIGHT THROTTLE ACCELERATION BETWEEN ABOUT 50 AND 80 MPH ON THE HIGHWAY. IT FEELS AS IF I'M DRIVING OVER RUMBLE STRIPS ON THE ROAD FOR ABOUT A SECOND. THEN IT WILL STOP FOR A SECOND OR TWO, AND THEN SHAKE AGAIN FOR A SECOND. WITHOUT THROTTLE, NO SHAKING OCCURS. THIS HAS BEEN OCCURRING FOR ABOUT TWO WEEKS, OR PERHAPS THE LAST 500 MILES. IT MIGHT BE DESCRIBED BY BULLETIN 18-NA-177.",
        "vin": "1GCGSDEN1H1"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "09/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE ACCELERATED AND JERKED. ADDITIONALLY, THE BRAKES WERE APPLIED, BUT FAILED TO RESPOND AND THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD. IN ADDITION, THE CONTACT HEARD AN ABNORMAL SCRATCHING NOISE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN SEVERAL TIMES TO GILROY CHEVROLET (6720 AUTOMALL CT, GILROY, CA 95020, 408-842-9301), BUT THEY WERE UNABLE TO DUPLICATE THE BRAKE FAILURE. THE DEALER DIAGNOSED THE ACCELERATION FAILURE AS THE FOUR WHEEL DRIVE BEING ENGAGED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND PROVIDED CASE NUMBER: 8-4000-730943. NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 17,759.",
        "vin": "1GCGTDEN3H1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "07/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCING ELECTRICAL PROBLEMS CAUSING STARTING ISSUES, WHILE DRIVING FAILURES IN DASH INDICATOR LIGHS, SPEEDOMETER , TACHOMETER, SHIFT CONTROL INDICATOR LIGHTS, AND TRANSMISSION CONTROL. LOSS OF POWER TO THE POINT TRUCK ALMOST COMES TO A STOP AND THEN SURGES, TWICE IT HAS ACCELERATED TRAVELING UP TO 50FT ESTIMATED.",
        "vin": "1GCHTDEN1H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111647,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "8 SPEED AUTOMATIC TRANSMISSION - ROUGH SHIFTING, USUALLY WHEN DRIVING BETWEEN 40 AND 60 MILES PER HOUR.  TRUCK INTERMITTENTLY FEELS LIKE IT IS RIDING OVER RUMBLE STRIPS.  TRANSMISSION SEEMS TO BE HUNTING.  POSSIBLE ISSUE WITH TORQUE CONVERTER.",
        "vin": "1GCGSBEN3H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2018",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104953,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AUTOMATIC TRANSMISSION DOWNSHIFTS INTO  1ST GEAR COMING TO A STOP, IT DOES SO HARSHLY AND LUNGES FORWARD. WHEN NOSING INTO A PARKING SPACE WITH A CONCRETE WALL AT THE FRONT OF THE PARKING SPACE, IF I HAD NOT ALLOWED ENOUGH SPACE FOR THE LUNGE, THE VEHICLE WOULD HAVE IMPACTED THE WALL . THIS CONDITION, ALONG WITH OTHER TRANSMISSION SHIFT IRREGULARITIES, HAPPENS PERIODICALLY AND I MUST REMAIN AWARE, ESPECIALLY COMING TO A STOP NEAR A CROSS WALK.",
        "vin": "1GCGSCENXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "06/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103818,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT LOW SPEEDS MY 8 SPEED AUTO TRANSMISSION - CLUNKS OR THUDS - SPECIALLY FROM 1ST - 2ND  - ITS SOUNDS LIKE A BANG - TOOK IT TO DEALER - SAID CHEVY KNOWS ABOUT IT - BUT THERE IS NO FIX YET.....GREAT!",
        "vin": "1GCGSCEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103107,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "8 SPEED TRANSMISSION HAS HARD SHIFT WHEN AT LOW SPEEDS AND WHEN GOING INTO REVERSE",
        "vin": "1GCGTCEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "8-SPEED AUTOMATIC TRANSMISSION IN INDECISIVE WHEN IT COMES TO SHIFTING BETWEEN LOWER GEARS WHILE DRIVING.  TRANSMISSION MAKING CLUNKING \"THUD\" SOUND WHEN SHIFTING OUT OF PARK AND INTO REVERSE.  GEAR HUNTING EXPERIENCED AT LOWER SPEEDS AND GEARS WHILE VEHICLE ATTEMPTS SHIFTING.",
        "vin": "1GCGSBEN0H1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080894,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE AT A STOP SIGN AND APPLYING THE BRAKE PEDAL, AN ABNORMAL RUMBLING NOISE WAS HEARD. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (SIMMS CHEVROLET, 4220 W. VIENNA ROAD, P.O. BOX 340, CLIO, MI 48420) WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS WORKING AS DESIGNED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND OPENED CASE NUMBER: [XXX]. THE MANUFACTURER REFERRED THE CONTACT TO A LOCAL DEALER (SUSKI CHEVROLET/BUICK, 8700 MAIN ST, BIRCH RUN, MI 48415) WHERE IT WAS DIAGNOSED, BUT THE FAILURE COULD NOT BE IDENTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 6,054. *TT    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "1GCGSBEA2H1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "03/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A DEFECTIVE INTERMEDIATE FUEL LINE COLLAR NOT CRIMPED.   AC DELCO PART NO. 12654115",
        "vin": "1GCHTDEN7H1"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD TEMPERATURES THAT THE NORTHERN STATES EXPERIENCE (AROUND 4 DEGREES F) THE TRUCK WILL INTERMITTENTLY DIE IN THE MIDDLE OF THE ROAD WHILE DRIVING.  COMPLETE POWER LOSS WITH NO WARNING, WHICH SEEMS TO HAPPEN AT ANY TIME.  WHEN THE WEATHER IS ABOVE 10F CONSISTENTLY IT SEEMS THERE ARE NO ISSUES.  EXTREMELY DANGEROUS AND CAN LEAVE YOU SUDDENLY WITHOUT POWER WHILE DRIVING.",
        "vin": "1GCPTCE19H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ABOUT 600-700 MILES ON NEW VEHICLE, AFTER TRUCK SITS OVERNIGHT WHEN FIRST STARTED YOU COULD FEEL WHAT SEEMS TO BE THE THE TORQUE CONVERTER WAS ENGAGING AS IT THE TRANSMISSION HAD LOST PRESSURE. THEN WHILE DRIVING ANYWHERE BETWEEN 40-65MPH CONVERTER SEEM TO BE UNLOCKING AND LOCKING WHICH CAUSE A VERY BAD SHUTTER AS IF YOU WERE DRIVING OVER BRICKS, AND THEN WHEN COMING TO A STOP THE TRANSMISSION DOWN SHIFTED INTO 1ST GEAR VERY VERY HARD, WHICH IS HARD ON THE DRIVE LINE. TOOK BACK TO DEALER THEY KEEP IT 3 DAYS AND FLUSHED TRANS FLUID WITH A NEW SPECIAL FLUID. THE SHUTTERING HAS STOPPED BUT THE OTHER 2 PROBLEMS REMAIN, SO I'M THINKING NOW THEY'LL HAVE TO CHANGE THE CONVERTER OUT.",
        "vin": "1GCGSDEN1H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055431,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM  WITH MY CHEVROLET COLORADO 2017 TRUCK STARTED WITH WHEN THE NEW TRUCK BARLEY HAD UNDER 200 MILES ON ITS ODOMETER. THE ISSUE IS THE TRUCK STARTS TO VIBRATED  AT A SPEED OF 50-55 MPH LIKE IF YOU ARE GOING THRU  SPEED BUMPS AND THE NOISE STOPS WHEN YOU GO OVER 60 MILES PER HOUR. I HAVE DONE A SIMPLE 20 MINUTE RESERCH AND HAVE FOUND OUT THAT THERE ARE OTHER INDIVIDUALS  THAT HAVE HAD THE SAME ISSUE WITH THEIR SAME YEAR COLORADO  TRUCK'S. I TOOK MY TRUCK TO THE DEALERSHIP WHERE I BOUGHT THE TRUCK. THEY KNEW EXACTLY  WHAT THE ISSUE WAS. THEY ARE IN THE PROCESS  OF REPLACING THE TORQUE CONVERTER. LOOKS LIKE A MAJOR CONCERN TO ME.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2017",
        "dateOfIncident": "11/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2017 CHEVY COLORADO Z71 4X4. ONCE BACK ON THE HIGHWAY AFTER OFF-ROADING ON THE BEACH, WHILE FORWARD DRIVING AT ROUGHLY 50 MPH I RAN OVER A CHOPPED PIECE OF FIRE WOOD IN THE ROAD. THE PIECE OF WOOD CONTACTED THE SKID PLATE, WHICH THEN COLLAPSED THE HOLLOW SKID PLATE BRACKET WELDED TO THE FRONT CROSS SECTION/AXLE OF THE CHASSIS, WHICH THEN FLATTENED INTO THE PLASTIC POWER STEERING MODULE(S) CONNECTED TO THE ELECTRIC POWER STEERING (EPS) RACK. THIS CAUSED IMMEDIATE LOSS OF POWER STEERING, LOSS OF ABS VEHICLE CONTROL, LOSS OF ELECTRICAL CHARGE FROM THE ALTERNATOR TO THE BATTERY, LOSS OF ABILITY OF THE VEHICLE TO SHOW CORRECT SPEED, RANDOM TRANSMISSION SHIFTING (INTO AND OUT OF GEARS, AS WELL AS THROWING VEHICLE INTO NEUTRAL) AS WELL AS INTERMITTENT LOSS OF ALL CABIN ELECTRONICS (INCLUDING TACHOMETER RELAYING SPEED AND RPMS, ODOMETER, FUEL GAUGE, BATTERY VOLTAGE GAUGE, ETC.). DUE TO THIS BEING A ROAD HAZARD INCIDENT, AS WELL AS POOR MANUFACTURER DESIGN/PLACEMENT OF A PLASTIC ELECTRIC POWER STEERING RACK, I WAS FORCED TO HAVE THE VEHICLE TOWED AND FILE A CLAIM WITH MY INSURANCE COMPANY. REPAIRS HAVE BEEN ONGOING FOR 3 WEEKS AND ARE STILL INCOMPLETE AS THE VEHICLE'S COMPUTER CANNOT RECOGNIZE THE NEW OEM PART. ATTACHED PHOTOS SHOW DAMAGE WITH THE SKID PLATE REMOVED. MATHEMATICAL MEASUREMENTS WILL PROVE THE COLLAPSIBLE BRACKET, IF FLATTENED IN A SIMILAR DIRECTIONAL MANNER, WILL MOST DEFINITELY MAKE CONTACT WITH AND IMPACT THE ELECTRIC POWER STEERING RACK. THIS PLASTIC RACK ALSO INCLUDES OTHER MODULES THAT IMPACT THE AFOREMENTIONED PERFORMANCE ISSUES. GM HAS FAILED TO ACKNOWLEDGE MY CONCERN OF DESIGN AFTER MULTIPLE ATTEMPTS AND CONACT WITH THEIR",
        "vin": "1GCGTDENXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045294,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 1400 MILES TRUCK STARTED A HEAVY PULSATING VIBRATION BETWEEN 50 AND 55 MILES PER HOUR. TOOK IT TO MYRTLE BEACH CHEVROLET WHERE THEY BALANCED THE TIRES. IT DID NOT FIX THE TRUCK. STILL VIBRATING NOW STARTING AT 20 MILES PER HOUR. SEVERE PULSATING VIBRATION AT 55 MILES PER HOUR. GOING BACK TO THE SHOP NEXT WEEK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "07/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042116,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTO HEADLIGHT FUNCTION CHANGES THE INSTRUMENT PANEL LIGHTS TO DIM WHEN DRIVING.   EXAMPLE: AT 4 O'CLOCK PM YOUR DRIVING EAST. THE SUN IS SETTING TOWARDS THE WEST SO THE LIGHT SENSOR ON THE DASH THAT CONTROLS THE AUTO HEADLIGHT FUNCTION DOESN'T SEE THE SUN DIRECTLY THINKS IT'S DARK OUTSIDE AND TURNS THE HEADLIGHTS ON. WHEN THIS HAPPENS THE INSTRUMENT PANEL LIGHTS GO DIM BECAUSE YOU HAVE SET THE DIM CONTROL THE PREVIOUS NIGHT TO A LOWER LEVEL THAT IS NOT BRIGHT AND DISTRACTING TO YOUR NIGHT TIME DRIVING. WHEN THIS HAPPENS YOU HAVE TO PHYSICALLY TAKE YOUR EYES OFF THE ROAD TO ADJUST THE DIM CONTROL SWITCH SO THE INSTRUMENT PANEL LIGHT IS BRIGHT ENOUGH DURING THE DAYLIGHT HOUR TO SEE AND READ THE INSTRUMENT PANEL. ALSO IT CAN BE 12 NOON WITH OVERCAST SKY'S OUTSIDE AND THE SENSOR CAN NOT TELL THAT IT IS NOT DARK OUTSIDE. THIS IS A HAZARDOUS AND SAFETY CONCERN DUE TO A DISTRACTION ON A DAILY BASIS OF HAVING TO TAKE YOUR EYES OFF THE ROAD WHEN DRIVING DURING THESE HOURS OR CONDITIONS.  NOTE: I HAD A 2012 CHEVROLET COLORADO WITH THE AUTO HEADLIGHT FUNCTION AND HAD NO PROBLEMS WITH ITS FUNCTION BEING A DISTRACTION. IT FUNCTIONED PROPERLY.    I HAVE CONTACTED GM WITH NO RESPONSE FROM THEM WITH A SOLUTION TO THIS SAFETY ISSUE.",
        "vin": "1GCPTDE17H1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "09/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031382,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ENTERING MY VEHICLE, I NOTICED A COMPUTER MODULE HAD FALLEN OUT OF THE DRIVERS SIDE DASH AND WAS RESTING ON THE ACCELERATOR PEDAL. UPON FURTHER EXAMINATION, IT APPEARS THIS MODULE WAS HELD IN PLACE BY TWO SIDED TAPE WHICH FAILED TO SECURE THE UNIT. THE WIRES ATTACHED TO THE UNIT WERE LONG ENOUGH TO BLOCK ACCESS TO BOTH THE ACCELERATOR AND BRAKE PEDAL. THEREFORE, IT IS MY CONCERN THAT HAD THIS UNIT FALLEN OUT WHILE THE VEHICLE WAS IN MOTION, ACCESS TO THE BRAKE AND/OR ACCELERATOR PEDALS COULD HAVE BEEN IMPEDED AND AN ACCIDENT CAUSING SERIOUS INJURY OR FATALITIES COULD HAVE OCCURRED.",
        "vin": "1GCGTEEN5H1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029689,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 CHEVROLET COLORADO. CONSUMER WRITES IN REGARDS TO ISSUE WITH LOW BEAM HEADLIGHTS. *LD    THE CONSUMER STATED THE DEALER NOR THE MANUFACTURER OFFERED ANY ASSISTANCE. UPDATED 09/26/2017*JS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "09/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK WAS PARKED INSIDE MY GARAGE THE WHOLE NIGHT. THE FOLLOWING MORNING I NOTICED 2 AREAS ON MY GARAGE FLOOR UNDERNEATH THE VEHICLE FRESH LIQUID. I TOUCHED TO CHECK WHAT THEY ARE AND I CONFIRMED BY THE APPEARANCE AND SMELL THAT THEY ARE OIL. I CRAWLED  UNDERNEATH MY TRUCK TO CHECK WHICH PART THEY ARE COMING FROM. I SAW ONE AREA ON THE FRONT RIGHT AXLE OIL LEAKING.I ALSO TOOK PICTURES OF THE LEAKING OIL.I BOUGHT MY TRUCK ON AUGUST 24,2017 AND I DISCOVERED THE LEAK ON SEPT 14,2017(.LESS THAN A MONTH OLD)  THE DEALER SAID THEY REPLACED THE AXLE SEAL AND IT SHOULD FIX IT.",
        "vin": "1GCGTCEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/18/2017",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS AFTER ANOTHER CHEVY COLORADO OWNER POSTED ABOUT THIS. I HAVE THE SAME ISSUE. THEIR COMPLAINT IS #11023887.    THERE IS NO INDICATOR ON THE DASH THAT SHOWS WHEN THE VEHICLE IS IN 4 WHEEL DRIVE. THE ONLY INDICATOR IS A SMALL LED LIGHT ON THE KNOB THAT IS PARTIALLY HIDDEN BY THE STEERING WHEEL. THIS IS A HAZARD, BECAUSE THIS IS A PRIME LOCATION FOR A KNEE TO HIT THE KNOB, TURNING THE FOUR WHEEL DRIVE SYSTEM ON BY ACCIDENT. SO YOU CAN ACCIDENTALLY TURN ON 4 WHEEL DRIVE, AND NOT KNOW UNTIL YOU ARE DRIVING DOWN THE ROAD. THIS IS NOT IDEAL. BECAUSE YOU HAVE TO TAKE YOUR EYES OFF THE ROAD TO FIND THE KNOB TO TURN IT BACK TO 2 WHEEL DRIVE. THIS COULD CAUSE AN ACCIDENT.     THERE REALLY NEEDS TO BE A 4 WHEEL DRIVE INDICATOR ON THE DASH, OR GM NEEDS TO COME UP WITH A FIX. DRIVING IN 4 WHEEL DRIVE ON DRY PAVEMENT CAN ALSO CAUSE SEVERE DRIVE TRAIN DAMAGE.",
        "vin": "1GCGTDEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2017",
        "dateOfIncident": "09/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT ALONG WITH THOUSANDS OF OTHER CHEVY COLORADO AND GMC CANYON OWNERS IS THE LACK OF A 4WD INDICATOR REMINDER LIGHT IN THE GAUGE CLUSTER. IT SEEMS THAT GM DECIDED THAT JUST A TINY LED LIGHT WHICH IS BASICALLY IMPOSSIBLE TO EVEN SEE IN DAYTIME WAS ENOUGH. THE ONLY THING THAT COMES UP ON THE DASH IS A MESSAGE THAT READS \"SHIFT IN PROGRESS\" BUT NO OTHER INDICATOR TO LET YOU KNOW THAT THE TRANSFER CASE HAS IN FACT MADE THE SHIFT OR WHAT DRIVE MODE IT SHIFTED INTO.THE OTHER PROBLEM IS THE LOCATION OF THIS 4WD SHIFT KNOB. IT'S LOCATED TO THE LEFT, BELOW AND BEHIND THE STEERING WHEEL NEXT TO THE HEADLIGHT CONTROL KNOB AS MY ATTACHED PHOTOS WILL SHOW. IT IS IMPOSSIBLE TO SEE WHILE DRIVING SINCE IT'S VIEW IS BLOCKED BY THE STEERING WHEEL AND IN ORDER TO ACTUALLY SEE WHAT DRIVE MODE THE VEHICLE IS IN YOU MUST TAKE YOUR EYES OFF THE ROAD WHILE DRIVING, TRY TO EITHER LOOK THROUGH THE BOTTOM OF THE STEERING WHEEL, AROUND IT OR BELOW IT TO SEE THE POSITION OF THIS KNOB. I MYSELF WAS DRIVING ON THE BEACH IN 4WD WHEN I WENT FISHING. WHEN I LEFT THE BEACH MY TRUCK WASN'T DRIVING NORMALLY AND I REALIZED I NEVER SHIFTED BACK INTO 2WD. I LITERALLY HAD TO TAKE MY EYES OFF THE ROAD TO LOOK AT THIS KNOB TO CHECK TO SEE WHAT POSITION IT WAS IN AND I CAME VERY CLOSE TO HAVING AN ACCIDENT. ALSO DRIVING ON PAVEMENT IN 4WD CAN CAUSE SERIOUS DAMAGE TO THE DRIVELINE AND ALSO EFFECTING THE STABILITY CONTROL SYSTEM AND ABS. THIS IS THE FIRST 4 WHEEL DRIVE VEHICLE I'VE OWNED THAT LACKED A 4WD INDICATOR REMINDER LIGHT. GM ACTUALLY HAS AN OFF-ROAD 4WD INFORMATION SCREEN IN THE DIC ON SOME MODELS BUT FOR SOME REASON THEY DIDN'T MAKE THIS SCREEN AVAILABLE ON THE COLORADO. THIS FEATURE SHOULD BE STANDARD ON ANY OF THEIR 4WD VEHICLES OR AT THE VERY LEAST A 4WD REMINDER INDICATOR LIGHT ON THE DASH DUE TO THE UNSAFE LOCATION OF THE 4WD CONTROL KNOB. THIS IS JUST AN ACCIDENT WAITING TO HAPPEN!",
        "vin": "1GCGTDEN9H1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/15/2017",
        "dateOfIncident": "07/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET COLORADO. WHILE DRIVING 35 MPH WITH A FRONT SEAT PASSENGER, THE AIR BAG AND SEAT BELT WARNING INDICATORS ILLUMINATED. THE CONTACT STATED THAT THE FRONT SEAT PASSENGER'S SEAT BELT WAS LATCHED. THE VEHICLE WAS TAKEN TO KARL CHEVROLET (1101 SE ORALABOR RD, ANKENY, IA 50021, (515) 299-4300) WHERE IT WAS DIAGNOSED THAT THE PRESENT PASSENGER MODULE HIGH END INPUT WAS FAULTY AND THE MODULE NEEDED REPLACEMENT. THE VEHICLE WAS NOT IMMEDIATELY REPAIRED BECAUSE THE DEALER NEEDED TO ORDER THE PARTS. THE CONTACT WAS NOTIFIED BY THE DEALER TO PICK UP THE VEHICLE UNTIL THE PARTS BECAME AVAILABLE. WHILE DRIVING HOME FROM THE DEALER WITHOUT A FRONT SEAT PASSENGER, THE AIR BAG AND SEAT BELT WARNING INDICATORS FAILED TO ILLUMINATE.  THE CONTACT STATED THAT THE VEHICLE WAS TAKEN BACK TO THE DEALER 20 DAYS LATER WHEN THE PARTS BECAME AVAILABLE. THE VEHICLE WAS REPAIRED. AFTER THE VEHICLE WAS REPAIRED, THE CONTACT INQUIRED IF THE DEALER DISCONNECTED THE FRONT PASSENGER AIR BAG AND SEAT BELT WARNING SYSTEM. THE OWNER OF THE DEALER CONFIRMED THAT THE SYSTEM WAS DISCONNECTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OF THE DISCONNECTION OF THE WARNING SYSTEM BY THE TECHNICIAN. A CLAIM WAS OPENED WITH THE MANUFACTURER. THE FAILURE MILEAGE WAS APPROXIMATELY 300.",
        "vin": "1GCGTCEN5H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "08/31/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COLORADO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 2900 MILES TRUCK STARTED VIBRATING YOU FEEL IT IN THE CAB & FLOOR AT SPEED OF 50-60  EVERY 5 SECONDS  ON & OFF  ON HWY",
        "vin": "1GCGSBEN8H1"
    }
]