[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "04/03/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459640,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "heard a slight noise from the front of the car, like a faint squeal of a fan belt type noise. Then I had no brakes! No warning.. then a message displayed \"brake assist service\" A little late. No notice and almost plowed into the car in front of me! carefully crawled home and called AAA to tow it to the Chevy dealer.",
        "vin": "1gnskbkc6hr"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/12/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The middle row seat belt on the drivers side is failing to retract and secure my child.  It is premature failure on a 5 year old model vehicle.",
        "vin": "1GNSKBKC4HR"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/09/2022",
        "dateOfIncident": "03/09/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455831,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Tahoe. The contact stated that while inspecting the vehicle with a UV light, he noticed there was a refrigerant leak in the air conditioning condenser. The vehicle was taken to the dealer and diagnosed with an air conditioning condenser refrigerant leak. The contact was informed that the air conditioning condenser needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure but informed the contact that there was no recall associated with the VIN and directed the contact to file a complaint with NHTSA. The contact related the failure to Special Coverage Adjustment 17336: Air Conditioning Condenser (Combi-Cooler) Refrigerant Leak. The failure mileage was approximately 53,000.",
        "vin": "1gnscbkcxhr"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My wife usually drives the Tahoe for short day to day commuting to and from work and bringing kids to practice, but I needed it for work one day and upon trying to accelerate onto the highway I noticed the transmission had no power when accelerating. I took it to a Chevy dealer and they were unable to diagnose the problem due to it not displaying a check engine light nor were they able to guarantee they would be able to determine the problem if they kept it longer for further inspection. I made an appointment with a shop down the road and after an inspection and test drive, they were able to determine that gears 3 and 6 were shot on the transmission. and that the engine was at 100% load going 55 mph. After waiting 4 weeks for a transmission, when we went to pick up our vehicle, he had 2 other Tahoes in the shop (2016 and 2019 with 77,000 and 51000 miles respectively) both needing new transmissions and said he has had many Suburbans and Silverados with same problem around the same miles. Shame on Chevrolet.",
        "vin": "1GNSKBKC8HR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/14/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Tahoe. The contact stated that while driving 65 MPH, the vehicle made an abnormal sound and would not accelerate. Additionally, the brakes failed to engage immediately while the brake pedal was depressed. The vehicle was taken to the dealer and diagnosed with transmission failure. The contact was informed that the transmission needed to be replaced. The vehicle was not repaired. The failure recurred with the gear shifter not shifting into Drive or Reverse. The manufacturer was made aware of the failure. The failure mileage was approximately 103,000.",
        "vin": "1gnskbkc1hr"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450621,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The brakes do not respond at low speeds/stop and go traffic. There is a grinding noise and the car continues to move forward even pressing down fully on break. I had it checked in Nov 2021 for this issue and the dealership said it was the rear brake pads and replaced them. It happened again today so not fixed. No warning lights come on but I am extremely nervous as I almost hit the car in front of me as we waited at a light.",
        "vin": "1GNSKBKC0HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2022",
        "dateOfIncident": "01/19/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448446,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "4 days after getting an oil change, new tires, and a safety inspection I was driving to pick up my kids from school and my 2017 Tahoe stopped accelerating on the freeway. Was able to drive 15mph back to the mechanic who told me the transmission was shot. Needs a whole new transmission, estimated to be $6,000 and a 5 week delivery time. Not only that, mechanic said I’m the 3rd Chevy in the shop with the same problem waiting for a brand new transmission.",
        "vin": "1gnskakc4hr"
    },
    {
        "components": "POWER TRAIN,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/04/2021",
        "dateOfIncident": "12/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My Tahoe had been making bad noises for several days, no check engine light on. Was driving with my children and went to pull out onto US-127 and the car wouldn't go in drive. Then to get out of the road I couldn't even go in reverse putting me and my three children in danger. My Tahoe has 82,000 miles and is only 4 years old. The transmission has been confirmed by multiple Shops that is always the problem with these Tahoe's.",
        "vin": "1GNSKBKC8HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2021",
        "dateOfIncident": "11/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442349,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle was driving fine when parked. 12 hours later, I went to move it from my front driveway to the carport. It started fine and when I put it in drive and pressed the accellerater it wouldn’t move. I pressed it again and the vehicle jerked forward into my lawn causing me to brake hard. I put it in reverse and it backed up fine. Again, I put it in drive but it wouldnt go forward. It acted as if it was in neutral. I turned it off and tried again receiving the same results. Had it towed to dealership. Transmission flush performed but didn’t remedy the problem. Needs a  total new transmission at 66,000 miles.",
        "vin": "1GNSCAKC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2021",
        "dateOfIncident": "11/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439695,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Tahoe. The contact stated while the vehicle was at a standstill at a traffic light while depressing on the brake pedal, the vehicle began to shake. The contact stated no warning light was illuminated. The contact stated she continued driving and experienced the failure three times. The contact stated on the last incident she was able to park on the side of the road. The contact had another person drive the vehicle and experience the failure while parking the vehicle. The contact took the vehicle to the local dealer, where it was diagnosed with needing the vacuum pump to be replaced. The vehicle was not repaired. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 19V761000 (Service Brakes, Hydraulic, Service Brakes, Electronic Stability Control) however, the VIN was not included. The manufacturer had not been informed of the failure. The failure mileage was approximately 63,000.",
        "vin": "1GNSCBKC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "10/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437373,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake assist warning after brakes began to fail. Had trouble stopping in line at drive through. Strange sensation in break peddle and pressure changed from loose to real tight.  Looked up recall, but said there are 0 recall services needed.  Scary",
        "vin": "1GNSKBKC9HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/16/2021",
        "dateOfIncident": "10/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving this vehicle in rush hour traffic and the check engine light came on and it suddenly lost power and wouldn't shift gears.  I pulled off the road and placed the vehicle in park.  At that moment I received an email from Chevy OnStar stating my transmission had a problem and to take it to the dealership.  I had it towed to the dealer and was informed that the torque converted had failed and there were metal bits in the transmission fluid.  The transmission had to be completely replaced to the tune of $6450.00.  This vehicle has under 67K miles.  There were no warnings prior to this incidence.  This vehicle has been maintained at the prescribed GM service intervals.",
        "vin": "1GNSKBKC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "09/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "At low speeds mainly backing up the abs will kick in on dry blacktop. Sometimes slowing down for a stop sign i can feel the brake pedal pulsing which leads me to believe its the abs kicking it when its not supposed to be. The tahoe has newer brakes and new tires.",
        "vin": "1gnskbkc7hr"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "09/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes fixed as part of recall.  Transmission is recent problem and has since been fixed. Code p0741tcc pump , metal in pan, torque converter coming apart, valve stuff off.  Our transmission failed and had to be replaced.  When reviewing with staff, no surprises.  They were aware that this transmission can be problematic.",
        "vin": "1GNSKBKCXHR"
    },
    {
        "components": "Carry Handle, Shell, Base",
        "crash": false,
        "dateComplaintFiled": "08/22/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430034,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Britax Child Safety, Inc.",
                "productMake": "BRITAX",
                "productModel": "MARATHON CLICKTIGHT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "Plastic shell has come unattached. It cannot be put back together manually.",
        "vin": "1gnscbkc5hr"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "07/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427850,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1) \"Service Brake Assist\" sometimes appears on the dashboard when I start my vehicle. When this occurs, the brake pedal is extremely difficult to push, and increasing stopping distance is required because the vaccuum level drops. 2) Since the Electronic Brake Control Module resets within the vehicle's computer when the vehicle is turned off/back on again, the dealership cannot duplicate the problem; as it does not happen all the time. 3) There is an active recall no. 19V645000; Recall date: September 6, 2019; on the make and model year of my vehicle - 2017 Chevy Tahoe - for this exact issue; however, my specific VIN does not have any recalls tied to it. If you can please add my VIN to the same issue happening with recall no. 19V645000, I would appreciate it.  4) I contacted GM, and all they kept telling me is my vehicle does not have a recall tied to my specific VIN; however, my 2017 Chevy Tahoe is exihibiting the exact same symptoms as that which is listed in recall no. 19V645000. The solution is for the dealership to reset the Electronic Brake Control Module; however, they will not do so because they cannot replicate the issue and my VIN is not coming up on the recall list for my vehicle.  5) In the recall notice, it states that GM \"has not yet provided a notification schedule\", so if you can possibly let me know if my vehicle will be recalled for this issue, I would appreciate it since not having acceptable brakes to the vaccuum level drop is a safety issue.  Thanks for your time! Please feel free to contact me with any questions.",
        "vin": "1GNSKBKC1HR"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/02/2021",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 Tahoe Premier 4WD with 53,000 miles.  Originally had a tire going low so I took it to a Discount Tire to find leak.  Upon inspection, they found significant corrosion on the inside of the wheel.  After finding this out, I found that NHTSA along with GM issued a Service Bulletin for this problem. (Bulletin No: 08-03-10-006G).  I called GM corporate and put together a case number then took it to a GM dealer for verification.  Upon inspection, it was found that all four wheels were severely corroded and needed replacing.  I was informed that GM is only giving a 20% assistance on the replacements with $3,800 out of my pocket.  I do not agree.  This should not just apply to a 3yr/36,000 mile warranty.  This is a known defective product from GM and should be replaced with no out of pocket expense to me.  This should not be considered normal wear and tear.  Furthermore, with the possibility of tire pressure loss, this could cause an accident that could harm my family and potentially others.",
        "vin": "1GNSKCKC1HR"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2021",
        "dateOfIncident": "06/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420873,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2017 Chevy Tahoe with 77,000 miles on it.  I will have it 4 years Labor Day Weekend.    I get all the regular service and oil changes on it in a timely fashion.  Last week I was driving my daughter to a friends house and there was a tapping sound.  The car did not sound right.  Suddenly the engine light illuminated and was blinking.  The car smelled of gas.  Thankfully I wasn't too far from home.  I had to drive on a highway to get back to my house.  I could only go about 30 mph.  It was very dangerous.  I had my hazards on but people were still beeping at me since I was causing a safety hazard for myself and others.  I managed to get home safely and called the dealership.  I dropped my car off the next morning since it is not drive-able.  The service rep said it was going in as an emergency.  After 5 days they finally looked at it.  They did not give me a loaner.  If I wanted a loaner I was required to pay $46/day.  The rep said the repairs to my 3 year old car wont be covered and it will cost over $5,000 to fix the engine.  It is a known engine issue to Chevy corporate bulletin 15-06-01-002H Engine Misfire/tick noise, malfunction Indicator Lamp Illuminated.  It is common in 20-15-2019 Tahoe and Suburban.  I had to borrow a 12 year old car to drive around my 4 children because my 3 year old car has a bad engine.  Ethically how can Chevy require their customers to cover a cost of an engine that they know is faulty.  There was nothing that I did to cause this issue.  I will never purchase another chevy.  SHAME ON PARAMUS CHEVROLET.",
        "vin": "1GNSKBKC2HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "05/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO MY LINK SWITCHES AND CAUSES YOUR DISTRACTION WHILE DRIVING. THE SCREEN SWITCHED NAVIGATION, RADIO, PHONE LINKS AND CAUSES MAJOR DISTRACTION WHILE DRIVING. THIS IS VERY UNSAFE AND HAS CAUSED ME TO BE STARTLED AND DISTRACTED. IT HAPPENS WHILE MOVING AND STATIONARY. IT HAPPENS INTERMITTENTLY SOME DAYS THEN CONSTANT OTHER DAYS AND REQUIRES YOU TO POWER-DOWN THE MY LINK TO NOT BE DISTRACTED.  THIS IS VERY UNSAFE.",
        "vin": "1GNSCAKC6HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414099,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING ON THE INTERSTATE THROUGH BIRMINGHAM, AL AND MY 2017 CHEVY TAHOE LT LOST POWER.  THE TRANSMISSION HAD ONE INSTANCE OF A HARD SHIFT DURING HIGHWAY DRIVING, THEN JUST FAILED.  SHE WAS LUCKILY ABLE TO MAKE IT TO THE SIDE OF THE INTERSTATE SAFELY, TRIED TO SHIFT IT INTO DRIVE AND THE CAR ROLLED BACKWARDS.  HAD IT TOWED TO HENDRICKS CHEVY AND THEY FOUND BURNT TRANNY FLUID AND INDICATED THE PLANETARY GEAR APPEARED DAMAGED.  THIS TRUCK IS ONLY 4 YEARS OLD WITH ONLY HIGHWAY MILES AND THE TRANSMISSION NOW NEEDS TO BE REPLACED.  CHEVROLET SHOULD BE REPLACING THESE AT NO CHARGE AS THIS IS A COMMON PROBLEM WITH THEIR 6 SPEED TRANSMISSION.  THERE WERE MULTIPLE TAHOES IN THE SAME SHOP FOR THE SAME PROBLEM.  I HAVE BEEN A CHEVY FAN ALL OF MY LIFE BUT NOW RETHINKING THAT AS THEY DO NOT STAND BEHIND THEIR PRODUCT.  THE CODE YOU NEED TO WATCH OUT FOR IS THE P0796 CODE, WHICH IS A FLUID PRESSURE FAILURE.  IF YOU RECEIVE THIS CODE, YOU ARE LIKELY GOING TO HAVE TO PAT 4-6K FOR A TRANSMISSION.  STEP UP TO THE PLATE CHEVY AND TAKE CARE OF YOUR CUSTOMERS.",
        "vin": "1GNSCBKCXHR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11413708,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE BURNS TO ARMS , HANDS, FOREARMS, WRISTS UPON AIRBAG DEPLOYMENT . THE VEHICLE WAS TRAVELING STRIGHT ON A 2 LANE HIWAY WHEN ANOTHER VEHICLE CROSSED OVER INTO THE ONCOMING LANE AND STRUCK THE TAHOE",
        "vin": "1GNSCBKC9HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 90 THOUSAND MILES THE TRANSMISSION ON MY 2017 TAHOE PREMIER WENT OUT AND WE HAD TO GET A NEW TRANSMISSION INSTALLED. I WAS STOPPED IN TRAFFIC ON THE HIGHWAY AND WHEN I WENT TO ACCELERATE THE VEHICLE WOULD NOT MOVE. I WAS ABLE TO GET THE TAHOE TO LURCH TO THE SLOW LANE AND OFF OF THE ROAD. TRACTOR TRAILERS WERE HAVING TO SWITCH TO THE SLOW LANE AND BACK TO THE FAST LANE TO GET AROUND US AND BACK INTO THE PROPER LANE BECAUSE THE HIGHWAY HAD THE RIGHT SLOW LANE SHUT DOWN. NO SERVICE LIGHTS CAME ON AND I DID NOT NOTICE ANY HARD SHIFTING OR OTHER TRANSMISSION ISSUES BEFORE THIS HAPPENED. THE COST FOR THE TRANSMISSION AND LABOR WAS AROUND $4,500.",
        "vin": "1GNSKCKC2HR"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "01/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405850,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS MISFIRING AND STALLING DUE TO A FUEL INJECTOR PROBLEM SIMILAR TO THE BULLETIN N182198000. THIS BULLETIN SHOULD BE VALID FOR ANY STATE. GM IS HAVING MAJOR ISSUES WITH FUEL INJECTORS. THE PROBLEM IS THAT THIS VEHICLE MISFIRED WHICH FELT LIKE A JUMP AND I CAUSE ME TO HIT THE BRAKE THINKING IT WAS SOMETHING ELSE AND IT MISFIRED AGAIN WHICH MADE THE VEHICLE SLOW DOWN FASTER AND ALMOST CAUSE A WRECK ON THE HIGHWAY",
        "vin": "1GNSCBKC2HR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2021",
        "dateOfIncident": "03/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JANUARY 25, 2020, I PURCHASED A 2017 CHEVROLET TAHOE AND THE A/C CONDENSER HAS A LEAK AND MUST BE REPLACED.  THE DEALER CHARGED ME $148.50 FOR THE DIAGNOSIS AND QUOTED THE REPAIR COST $1095.12.",
        "vin": "1GNSCBKC9HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 70K MILES STARTED HAVING ISSUES. WENT TO PULL OUT ON THE HIGHWAY ROLLED FWD AND IT WOULD NOT GO ALMOST LIKE IT WAS KNOCKED OUT OF GEAR. THEN AT 100300 MILES THE TRANSMISSION IS GONE. PAID 47K FOR A TAHOE AND NOW HAVING TO SPEND $4200 TO REPLACE A TRANSMISSION. I'M LUCKY THAT WE DIDN'T GET HIT WHEN THE TRANSMISSION CAME OUT. GM YOU NEED TO FIX THIS BEFORE SOMEONE IS KILLED!!!! THERE IS TOO MANY PEOPLE HAVING THIS SAME ISSUE FOR YOU NOT TO LOOK INTO IT.",
        "vin": "1GNSKBKC1HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404679,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C STOPPED WORKING. FOUND ON THE INTERNET THAT THOUSANDS OF CHEVY CARS HAS THIS CONDENSER PROBLEM.",
        "vin": "1GNSCCKC1HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "03/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402546,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 TAHOE FELT LIKE IT WAS SKIPPING LAST NIGHT(3/11/21), I WAS THINKING IT COULD BE BAD GAS; HOWEVER, THIS MORNING WHEN LEAVING FOR WORK IT DROVE GOOD FOR ABOUT 2 MILES THEN IT STARTED SKIPPING AGAIN, MAKING A FUNNY NOISE WHEN I TOOK OFF FROM A STOP SIGN, IT DOESN'T WANT TO CHANGE GEARS.  RPM'S STAY THE SAME.....SOMETHING IS DEFINITELY WRONG WITH THE TRANSMISSION AND LOOKS LIKE IT HAS BEEN HAPPENING TO OTHERS WITH THE SAME YEAR.  THESE VEHICLES COST TOO MUCH FOR THIS TO BE HAPPENING!",
        "vin": "1GNSCCKCXHR"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/06/2021",
        "dateOfIncident": "02/05/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WOULDN'T GO INTO REVERSE, NEUTRAL   BRAKES WEAR DOWN EXTREMELY FAST.",
        "vin": "1GNSKBKC7HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389301,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 TAHOE IS JERKING, NOT GOING INTO OVERDRIVE SMOOTHLY, NOT ACCELERATING EASILY. I WAS TOLD THAT THIS YEAR MODEL HAD SEVERAL VEHICLES THAT HAD TO HAVE THE TRANSMISSION REPLACED. I HAVE OWNED THIS VEHICLE FOR ONLY 6 MONTHS. I CALLED MY LOCAL DEALERSHIP TO SEE IF THERE WERE ANY RECALLS AND ALSO CALLED GMC BUT WAS TOLD BY BOTH THAT THERE   WERE NO RECALLS FOR THIS ISSUE. WITH THE COST OF THESE VEHICLES THERE SHOULD BE NO ISSUES ON A FAIRLY NEW MODEL AND FROM THE PREVIOUS COMMENTS I HAVE READ HERE GM NEEDS TO ISSUE A RECALL ON TRANSMISSIONS BEFORE A SERIOUS INJURY OCCURS.",
        "vin": "1GNSCBKC2HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "12/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 CHEVROLET TAHOE FELT VERY STIFF WHILE ACCELERATING AND STARTED SUDDENLY JERKING AND BACKFIRING WHILE IN MOTION AS IF WE WERE REAR-ENDED. IT WOULD FEEL AS IF IT WAS STUCK OR STRUGGLING TO SHIFT GEARS AND BOTH THE TRANSMISSION AND ENGINE LIGHTS CAME ON . WE TOOK IT TO THE NEAREST CHEVROLET DEALERSHIP THINKING IT WAS A MINOR ISSUE BEING STILL FAIRLY NEW BUT WAS TOLD THE WHOLE TRANSMISSION NEEDS TO BE REPLACED. THERE IS NO WAY A 3 YEAR OLD CHEVROLET TAHOE WITH LESS THAN 100K MILES THAT'S BARELY BEEN DRIVEN DUE TO COVID NEEDS A NEW TRANSMISSION. PLEASE INVESTIGATE THIS AS THESE MECHANICAL PROBLEMS COULD CREATE UNSAFE CONDITIONS FOR OTHER OWNERS.",
        "vin": "1GNSKBKC7HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2020",
        "dateOfIncident": "12/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION STOPPED WORKING ! ONLY HAS LESS THEN 70000 MI ON IT !!! WAS STOPPED AT A STOP SIGN TOOK MY FOOT OFF THE BRAKE AND IT STARTED TO ROLL BACKWARDS! I WAITED ABOUT 10 OR 15 MINUTES THEN IT STARTED TO GO AGAIN BUT WITH A STRANGE SHUTTERING FEELING . IT SOON STOPPED AGAIN AND SAME THING WOULDNT GO FOR A FEW MINUTES THEN AGAIN IT FELT WEAK AND UNDERPOWERED",
        "vin": "1GNSKAKC3HR"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383942,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES BECOME VERY VERY HARD TO PUSH WHEN IT SENSES ANYTHING NEAR MY CAR. I NOTICED THIS WAS A RECALL ISSUES SO I TOOK IT TO THE DEALERSHIP (GERRY LANE CHEVY IN BATON ROUGE, LOUISIANA) AND THEY TRIED FIXING IT BUT WERE UNSUCCESSFUL. THE SECOND ATTEMPTED 'WORKED' OR AT LEAST THEY SAID IT DID. I'M STILL HAVING ISSUES WITH IT AND HAVE SINCE THE MOMENT I LEFT THE DEALERSHIP. THEY REFUSE TO LOOK AT IT WITHOUT ME PAYING THIS TIME.",
        "vin": "1GNSCCKC3HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2020",
        "dateOfIncident": "12/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11382914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET TAHOE. THE CONTACT STATED THAT AFTER DRIVING FOR 4 HOURS AT 55 MPH, THE BRAKE PEDAL WAS DEPRESSED TO THE FLOORBOARD WITH AN ABNORMAL GRINDING SOUND. THE SERVICE BRAKE ASSIST WARNING MESSAGE WAS DISPLAYED ON THE INSTRUMENT PANEL. THE CONTACT ENGAGED THE PARKING BRAKE TO STOP THE VEHICLE WHILE DRIVING UP AN INCLINE. THE NEXT DAY, THE BRAKES RESUMED NORMAL OPERATION ON THE DRIVE HOME. THE CONTACT STATED THAT SINCE THE FAILURE, HE HAD EXPERIENCED INTERMITTENT BRAKE FAILURE WHILE TRAVELING AT VARIOUS SPEEDS, WITH THE SAME WARNING LIGHT FLASHING ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO TITUS-WILL CHEVROLET BUICK GMC CADILLAC (2425 CARRIAGE LOOP SW, OLYMPIA, WA 98502) AND IT WAS CONFIRMED THAT THE FAILURE WAS CAUSED BY A DEFECTIVE VACUUM PUMP. THE VACUUM PUMP WAS REPLACED HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHERE IT REMAINED IN THEIR POSSESSION UNREPAIRED. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 75,300.",
        "vin": "1GNSKBKC6HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/02/2020",
        "dateOfIncident": "12/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377587,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 CHEVY TAHOE PREMIER. THE BRAKES ARE NOT ENGAGING IF UNDER 5 MPH ROLLING FOWARD (PHARMACY DRIVE THRU) HARD TO STOP VEHICLE USED 2 FEET TO PUSH THE BRAKE DOWN FINALLY WAS ABLE TO STOP AN ACCIDENT BY USING THE EMERGENCY BRAKE.     THERE WAS A RECALL THAT WAS PERFORMED ON 9/26/2019 FOR SERVICE BRAKE ASSIST. ISSUE OCCURRED AGAIN 11/23/2020. I SPOKE TO GM AND THEY DECIDED TO REOPENED THE CASE. RECALL PROGRAMMING WAS REDONE FOR THE 2ND TIME 12/1/2020 FOR SERVICE BRAKE ASSIST. 12/2/2020 THE SAME SITUATION OCCURRED IN CAR PICK UP LINE AT SCHOOL. TOOK THE VEHICLE OUT OF PARK LET OF THE BRAKE ROLLED FOWARD 30 FEET WENT TO USE THE BRAKES AROUND 3-5 MPH AND PEDAL WAS STIFF AND WOULD NOT ENGAGE HOLDING TWO FEET ON THE PEDAL, USED EMERGENCY BRAKE TO AVOID HITTING THE CAR IN LINE IN FRONT OF ME. MY 2017 TAHOE GOING BACK TO THE CHEVY DEALERSHIP AGAIN. THIS IS A MAJOR LIABILITY SAFETY CONCERN!!!",
        "vin": "1GNSCCKC3HR"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376004,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER INTRUSION VIA GPS ANTENNA DEFECT INTO DRIVER CABIN ABOVE DRIVER AT VISOR ATTACHMENT. LOSS OF GPS, ONSTAR AND ANTENNA FUNCTIONS. THIS OCCURRED FOLLOWING HEAVY RAIN STORMS. AUGUST 2020 AND WAS DIAGNOSED AND REPAIRED. MY RESEARCH SHOWED THAT THIS IS AN ONGOING PROBLEM STEMMING BACK TO AT LEAST 2015. GM PROGRAM BULLETIN NUMBER 15155",
        "vin": "1GNSCBKCXHR"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO WORK ON THE FREEWAY ABOUT 10 MILES OUT I STARTED HAVING TRANSMISSION PROBLEMS,IT WASN'T SHIFTING RIGHT AND AND SOMETIMES IT WOULD STAY ON ONE GEAR TOO LONG AND THE RPM WOULD STAY AT 4500RPM BEFORE IT SHIFTS AND THIS IS WHILE CRUISING AT 65MPH. AND WHEN I TRY TO ACCELERATE I WOULD HEAR A HUMMING/WHISTLING SOUND FROM WITHIN AND I COULDN'T GO PAST 70MPH. THEN THE 'CHECK ENGINE' LIGHT CAME ON. WHEN I GOT TO A STOP SIGN AFTER GETTING OFF THE FREEWAY MY TAHOE WOULD HESITATE WHEN I STEPPED ON THE GAS. WHEN I GOT TO THE PARKING LOT I TRIED TO BACK-IN TO PARKING SPACE AND MY TAHOE WOULD NOT GO ON REVERSE. AND WHEN I WAS LEAVING THE PARKING LOT TO TAKE MY VEHICLE TO THE DEALER TO GET CHECKED OUT,WHEN I PUT IT ON DRIVE NOTHING HAPPENS AND AFTER ABOUT 10 SECONDS THE VEHICLE JUMPED INTO GEAR AND JERKED IT FORWARD WITHOUT STEPPING ON THE GAS SO MUCH SO,THAT THE REAR TIRES EVEN SCREECHED A BIT! IT SCARED THE SH*# OUT OF ME. I WOULD REALLY LIKE TO KNOW IF ANYBODY ELSE HAD THIS PROBLEM AND WHAT WAS DONE TO RECTIFY IT.",
        "vin": "1GNSCAKC7HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY HARD BRAKE PRESSURE NEEDED. CAR WILL STOP AND VERY HAR  D. ACTS LIKE POWER BRAKES DO NOT WORK.. LOSS OF MAYBE DUE TO VACUUM LOSS. THERE SHOULD BE U RECALL ISSUED. NOT SAFE. !!!?",
        "vin": "1GNSCCKC5HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/08/2020",
        "dateOfIncident": "05/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344100,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING INTO TOWN FROM HOME ONE MORNING AND NOTICED THE VEHICLE WAS ACTING FUNNY LIKE IT WASN'T SHIFTING GEARS. I CALLED MY HUSBAND AND THANKFULLY I WAS CLOSE TO OUR LOCAL CHEVEROLET DEALER AND BY THE TIME I PULLED IN WHICH WAS ONLY A COUPLE OF MILES THE TRANSMISSION TEMP WAS VERY HIGH AND WAS NOT SHIFTING GEARS AT ALL. THEY EVALUATED IT AND THOUGHT MAYBE THEY COULD JUST FLUSH TRANSMISSION SINCE IT WAS ONLY A 2017 AND NOT AN OLDER VEHICLE BUT DETERMINED IT NEEDED A WHOLE NEW TRANSMISSION. COULD HAVE CAUSED UNSAFE CONDITIONS IF IT WOULD HAVE JUST QUIT IN THE MIDDLE OF A BUSY INTERSECTION.",
        "vin": "1GNSKCKC1HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD BRAKE PEDAL RESULTING IN LITTLE OR NO STOPPING POWER WHEN APPLYING THE BRAKES.  HAPPENED TWO DAYS IN A ROW.  EXTREME PRESSURE NEEDED TO STOP.  BOTH TIMES IN THE PARKING LOT.",
        "vin": "1GNSCBKC8HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL EXCELERATE FAST OR SHIFT FAST AND ABNORMALLY AFTER STOPPING. ALSO DOWNSHIFTS IN A JERKING MOTION WHEN COMING TO A STOP. IDLES AS IF VEHICLE IS RUINING OUT OF FUEL EVEN WHEN CONTAINING SUFFIENANT FUEL LEVELS AND MAY STALL.",
        "vin": "1GNSCAEC3HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339067,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET TAHOE. THE CONTACT STATED THAT HER AIR CONDITIONING NO LONGER OPERATED AS NEEDED. THE CONTACT THEN TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THE VEHICLE WITH A CRACKED CONDENSER. THE CONTACT THEN REACHED OUT TO THE MANUFACTURER AND WAS GIVEN A CASE; THE CONTACT WAS ALSO REFERRED TO THE NHTSA FOR ASSISTANCE.  THE DEALER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 68,000.",
        "vin": "1GNSCBKCXHR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338012,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON THE HOOD AND ROOF OF THE VEHICLE APPEARS TO BE OXIDIZING. IT IS ROUGH TO THE TOUCH, PATCHY, AND CONTINUES TO GET WORSE. THE CLEAR COAT HAS COMPLETELY WORN DOWN. WE NOTICED IT DETERIORATING WHEN WE GOT IT BACK FROM THE DEALERSHIP FOR A RECALL DUE TO A FAULTY BRAKE SYSTEM. THE PAINT IS CLEARLY DEFECTIVE AS I AM FINDING IN MY RESEARCH OTHERS ARE EXPERIENCING AS WELL. PROFESSIONALS WHO SPECIALIZE IN BODY WORK HAVE ACKNOWLEDGED THAT THERE IS CLEARLY A PROBLEM WITH THE PAINT ON THESE VEHICLES. THIS IS A COMMON PROBLEM WITH GM VEHICLES OF THIS YEAR AND COLOR.",
        "vin": "1GNSCCKC4HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "05/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET TAHOE. THE CONTACT STATED WHILE DRIVING 20 MPH, THE VENTS STARTED TO BLOW HOT AIR. THE CONTACT STATED HE NOTICED A CRACK IN THE AIR CONDITION CONDENSER. THE VEHICLE WAS TAKEN TO EDWARDS CHEVROLET-280 LOCATED AT 5499 US-280, BIRMINGHAM, AL 35242, (205) 980-3325, WHERE THE VEHICLE WAS DIAGNOSED AND THE CONTACT INFORMED THAT THE CONDENSER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 51,000.",
        "vin": "1GNSCBKC4HR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323444,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE AND THE CHECK ENGINE LIGHT CAME ON AND IT STALLED OUT LIKE IT DIDN'T WANT TO GO.  THE OIL LIGHT CAME ON AND I BARELY MADE IT A MILE BACK HOME.      THE DEALERSHIP TOLD ME THAT THE LIFTERS WERE BAD AND THAT THE CAM SHAFT ROD IS BENT.  THIS IS A $60,000 VEHICLE THAT IS LESS THAN 3 YEARS OLD AND THEY ARE EXPECTING ME TO PAY FOR THE REPAIR.  *TR",
        "vin": "1GNSCBKC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/04/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN OPEN RECALL (N192268490) ON MY SUV THAT KNOWINGLY DOES HAVE ISSUES WHEN I AM DRIVING AND THE BREAKS WILL NOT STOP MY VEHICLE PROPERLY.  AFTER SEVERAL ATTEMPTS TO THE LOCAL CERTIFIED CHEVROLET DEALERSHIP AND SERVICE DEPARTMENTS AND I OPENED A CASE NUMBER WITH CHEVROLET CUSTOMER SERVICE, THE ISSUE HAS NOT BEEN REMEDIED AND STILL REMAINS A DRIVING ISSUE AND SAFETY CONCERN.  SINCE DECEMBER 2019, I HAVE TAKEN MY VEHICLE TO THE 2 LOCAL CERTIFIED CHEVROLET DEALERSHIPS AND SERVICE DEPARTMENTS ON 3 DIFFERENT OCCASIONS.  BOTH LOCATIONS TOLD ME THE SOFTWARE IS NOT UPDATED PROPERLY THEREFORE MY VEHICLE WILL NOT EXCEPT RECALL.  AFTER MY FIRST ATTEMPT TO GET THE RECALL FIXED AND THE SERVICE DEPARTMENT WAS UNSUCCESSFUL, I CONTACTED CHEVROLET DIRECTLY AND A CASE NUMBER WAS ISSUED (SERVICE REQUEST NUMBER: 9-5847462774).  I COMMUNICATED FREQUENTLY WITH CHEVROLET ON RESOLVING THE RECALL ISSUE WITH MY VEHICLE.  THE END RESULT, I WAS TOLD BY CHEVROLET CUSTOMER SERVICE THAT THE ISSUE IS UNABLE TO BE REPAIRED AND THE RECALL COULD NOT BE COMPLETED DUE TO A SOFTWARE UPDATE THAT CHEVROLET NEEDED AND THEY WERE UNCERTAIN IF/WHEN THE SOFTWARE UPDATE WOULD BE AVAILABLE. SINCE THE CASE WITH CHEVROLET HAS BEEN OPENED, I HAVE TAKEN MY SUV TO ANOTHER CERTIFIED CHEVROLET DEALERSHIP AND SERVICE DEPARTMENT ON 2 OTHER OCCASIONS AND THE RECALL HAS NOT BEEN RESOLVED.   AFTER THE 3RD TIME I HAVE TAKEN MY SUV IN FOR THIS RECALL, I HAVE ATTEMPTED TO CONTACT CHEVROLET CUSTOMER SERVICE AGAIN VIA EMAIL AND I HAVE GOTTEN NO REPLY BACK OR RETURN PHONE CALL. IS THIS HOW A PERSON, WITH A FAMILY, THAT HAS A SAFETY ISSUE AND A RECALL ON A VEHICLE SHOULD BE TREATED? ESPECIALLY, WHEN THE VACUUM LINE FOR THE BRAKES IN MY CHEVROLET TAHOE KNOWINGLY DO NOT SEAL AND THE BRAKES DO NOT OPERATE AS INTENDED.",
        "vin": "1GNSKCKCXHR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "04/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322430,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER OF 2019, GMC ISSUED A RECALL FOR SEVERAL GMC VEHICLES REGARDING \"SERVICE BRAKES, HYDRAULIC:POWER ASSIST:VACUUM\". AS SUCH, THE VEHICLE WAS SERVICED AT THE DEALERSHIP PER THE INSTRUCTIONS ISSUED BY GMC. HOWEVER, SEVERAL MONTHS LATER, WHILE OPERATING THE VEHICLE IN REVERSE OUT OF A CROWED PARKING LOT, THE BRAKES FAILED TO STOP THE VEHICLE. PLACING THE GEAR IN NEUTRAL ALONG PLUS THE EMERGENCY BRAKE, WAS REQUIRED TO STOP THE VEHICLE. THE WAS AN EXTREMELY CLOSE CALL TO THE SAFETY OF THE SURROUNDING BYSTANDERS IN THE PARKING LOT. UPON DISCUSSIONS WITH BOTH THE DEALERSHIP AND GMC, IT WAS REPORTED THAT THE CURRENT RECALL ONLY REPROGRAMS THE COMPONENTS (REFERENCE THE LETTER ISSUED BY GMC AND THE NHTSA'S WEB SITE FOR THIS RECALL). IT WAS FURTHER COMMENTED BY BOTH THE SERVICE MANAGER AT THE DEALERSHIP AND CUSTOMER SERVICE AT GMC, THAT THIS WILL NOT ADDRESS ALL VEHICLES IDENTIFIED IN THIS RECALL, MEANING MORE ACTION MAY BE REQUIRED TO FIX THE UNDERLINING ISSUE. IN THIS CASE, SEVERAL COMPONENTS WERE NEEDED TO BE PHYSICAL REPLACED, NAMELY THE VACUUM PUMP. IN ADDITION, IT WAS ACKNOWLEDGED BY BOTH THE DEALERSHIP AND GMC THAT A CERTAIN PERCENTAGE OF THESE VEHICLES IDENTIFIED IN THE ORIGINAL RECALL WILL EXPERIENCE SIMILAR ISSUES (BRAKES FAILING TO STOP THE VEHICLE). DURING THE CALL TO GMC CUSTOMER ASSISTANCE (866.790.5600), THE SENIOR MANAGER REFUSED TO TAKE THE ADVICE TO INFORM ALL CUSTOMERS/CONSUMERS OF THIS DANGEROUS ONGOING RISK. EVEN THOUGH IT'S A KNOWN FAILURE, GMC HAS YET TO PROVIDE ADDITIONAL NOTIFICATION TO CONSUMERS THAT THE CURRENT RECALL MAY FAIL TO ADDRESS THE UNDERLINING SAFETY FAILURE TO THE BRAKING SYSTEM. GMC SHOULD ISSUE A NEW RECALL TO ADVICE THE REPLACEMENT OF THE PHYSICAL COMPONENTS OF THE VACUUM BRAKE ASSISTANCE SYSTEM BY ALL EFFECTED VEHICLES IMMEDIATELY. OTHERWISE, THEY WILL NOT REPLACE THE PARTS UNLESS THE CONSUMER EXPERIENCES AN ACTUAL FAILURE.",
        "vin": "1GNSKBKC5HR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/11/2020",
        "dateOfIncident": "04/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A HIGHWAY WHEN I HEARD A LOUD CRASH SOUND AND SOME RATTLING COMING FROM THE SUNROOD . IT WAS RAINING BUT NOT BAD. I DIDN'T SEE ANYTHING THAT MAY HAVE FLEW UP AND HIT THE SUNROOF. I HAD NOT GONE UNDER AN OVERPASS AND THERE WAS NOT MANY CARS ON THE ROAD. I PULLED IN TO A PARKING LOT AND DID NOT FIND ANYTHING THAT WOULD HAVE HIT AND BROKE THE GLASS BUT THE SUNROOF WAS BROKEN. T",
        "vin": "1GNSKCKC5HR"
    },
    {
        "components": "STEERING,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHY IS NHTSA ALLOWING SALE OF MILLIONS OF DANGEROUS UNFIXABLE AIRBAG RECALLED SUVS TO BE DRIVEN WHEN THE CONSEQUENCE IS DEATH BY AN ALLOWED LIFE THREATENING PROBLEM IN A MAJORITY OF CARS ON THE ROAD.  WHY IS THERE NO PROTECTION OF INNOCENT PEOPLE HERE.  THIS IS UNACCEPTABLE REGARDLESS OF WHAT IS OR ISN'T ALLOWED.  EVERY CAR WITH THIS RECALL IS A DEADLY RISK AND NHTSA IS NOT GETTING DEALERS TO STOP SELLING SUCH VEHICLES NOR ARE THEY INVESTIGATING THE MANY DEALERSHIPS THAT ARE HIDING THE ISSUES BY SAYING MULTIPLE DIFFERENT LIES IN THE DESCRIPTION AND HIDING IT IN THE CARFAX BUT KEEPING IT IN THE VIN CHECK.  NHTSA HAS A DUTY TO PROTECT US ALL ESPECUU ITI ALLY NOW I'M THUS RARE INSTANCE WHERE EVERY VEHICLE ON THE ROAD IS A DEATH SENTENCE BY THE VERY SAFETY DEVICE MEANT TO PROTECT , THE AIRBAGS, WHICH IS ONE THING IF DOES NOT INFLATE, BUT IS WORSE THAT IT SHOOTS METAL SHRAPNEL WHEN AIRBAG EXPLODES INSTEAD OF INFLATED AND HAS ALREADY INJURED AND KILLED 19 PEOPLE AND NO WAY TO PREVENT EXPLOSION SINCE NO REMEDY BUT AT THE VERY LEAST, IS IT NOT BETTER TO DEACTIVATE THE POSSIBILITY OF IT EXPLODING INSTEAD OF ALLOWING IT TO BE SOLD AND HARM PEOPLE?  THIS IS VERY SERIOUS AND SHOULD BE INVESTIGATED BY ALL BRANCHES OF GOVERNMENT T RELATED TO VEHICLES DMV, DOT, HEALTH AND SAFETY AND FBI, BECAUSE IT IS SHOCKING THAT IT HAS GOTTEN THUS FAR ALONG WITHOUT ANY PROTECTION EXCEPT IT'S ANNOUNCEMENT THUS FAR PUTTING MILLIONS AT RISK.  I THINK SOMEONE IS GETTING PAID OFF UNDER THE RUG FOR IT TO BE SUCH A HIDDEN DILEMMA.  PLEASE SEND THIS ARTICLE OF CONCERN OUT TO ALL INVESTIGATIVE ENTITIES TO GET OUR KIDS AND FAMILIES PROTECTED.  I HAD TO USE A VIN FROM A VEHICLE IF INTEREST FROM A SAMPLE CAR DEALERSHIP FOR THIS COMPLAINT OTHERWISE IT WOULD BE NEGLECTED FURTHER.  EMAIL:  [XXX].REGARDING MY CONCERNS FOR THIS SAFETY ISSUE.  MY NAME IS [XXX]  WHICH SUV CAN BE BOUGHT?    REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *CC *TR",
        "vin": "1GNSCBKC1HR"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308196,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 CHEVY TAHOE. CONSUMER WRITES IN REGARDS TO BRAKE FAILURE SAFETY RECALL AND WHEEL SENSOR FAILURE SAFETY RECALL. *LD    THE CONSUMER STATED THE SIZE AND WIDTH OF THE LEFT FOOT REST PAD, FOR DRIVERS, ARE TOO WIDE. *JS",
        "vin": "1GNSKBKC7HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301579,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2017 CHEVROLET TAHOE. WHILE DRIVING AT 56 MPH, THE VEHICLE UNINTENDED BRAKED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO PARAMUS CHEVROLET 194 NJ-17, PARAMUS, NJ 07652 (201) 261-7100, BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT STATED THAT THE FAILURE WAS SIMILAR TO NHTSA CAMPAIGN NUMBER: 19V761000 (ELECTRONIC STABILITY CONTROL, SERVICE BRAKES, HYDRAULIC, SERVICE BRAKES). THE FAILURE MILEAGE WAS 18,000.",
        "vin": "1GNSKBKC8HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300864,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET TAHOE. THE CONTACT STATED WHILE PULLING INTO A PARKING SPOT, THE BRAKES HAD HARDENED AND WERE DIFFICULT TO DEPRESS WITHOUT WARNING. THE CONTACT THEN INSPECTED THE VEHICLE FOR ANY OBSTRUCTIONS THAT COULD HINDER HER BRAKING AND DISCOVERED NOTHING. AS SHE PROCEEDED TO PARK THE VEHICLE, THE BRAKES CONTINUED TO HARDEN; HOWEVER, THE BRAKES DID OPERATE AS NORMAL ONCE THE VEHICLE WAS RESTARTED. THE CONTACT'S HUSBAND TOOK THE VEHICLE TO CRAIN CHEVROLET 9911, I-30, LITTLE ROCK, AR 72209 WHERE THE VEHICLE WAS DIAGNOSED WITH A DEFECTIVE BRAKE BOOSTER. THE CONTACT'S REQUEST FOR A LOANER VEHICLE WAS DENIED. THE CONTACT HAD NOT REACHED OUT TO THE MANUFACTURER. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 41,127.",
        "vin": "1GNSKBKC6HR"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286281,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET TAHOE. THE CONTACT RECEIVED AN UNKNOWN RECALL NOTIFICATION. THE CONTACT TOOK THE VEHICLE TO BUZZ CHEW CHEVROLET (656 COUNTY RD, 39A, SOUTHAMPTON, NY 11968, (631) 259-6187) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE FOR THE REPAIR. THE CONTACT ALSO STATED THAT THE FRONT DRIVER'S SIDE TIRE WAS PULLING TO THE RIGHT. THE DEALER INFORMED THE CONTACT THAT THE ALIGNMENT AND BALANCE WERE OK. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED CASE NUMBER: 9-5651337907. THE FAILURE MILEAGE WAS 49,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GNSKBKC5HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GM RECALL",
        "vin": "1GNSKAKC0HR"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271663,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET TAHOE. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 19V761000 (SUSPENSION, ELECTRICAL SYSTEM). THE CONTACT CALLED AND WAS INFORMED THAT THE PARTS WERE PENDING AND UNAVAILABLE. THE CONTACT HAD NOT SPOKEN WITH THE MANUFACTURER REGARDING THE RECALL. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GNSKBKC6HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253332,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I ENTERED WRONG VIN. CORRECT VIN IS [XXX]. 2015 CHEVROLET TAHOE. DRIVER ASSIST SYSTEM MALFUNCTIONING DUE TO A DRIVERS SEAT CUSHION HAPTIC MOTOR ADDRESSED ON SERVICE BULLETIN PIT5445A. MALFUNCTION UPON BACKING. WEB SEARCH SHOWS THIS IS A VERY COMMON PROBLEM THAT GM SHOULD FIX UNDER WARRANTY BUT REFUSES.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1GNSK3ECXFR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/12/2019",
        "dateOfIncident": "08/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DEPRESSING THE BRAKES, FAILED TO BRING THE VEHICLE TO A STOP.  WHILE AT A LOW RATE OF SPEED, THE BRAKE PEDAL WOULD SINK TO THE FLOOR, AND THERE WOULD BE NO STOPPING POWER.  THIS OCCURRED 3 TIMES IN A SINGLE DAY.  WE ROLLED THROUGH THE END OF SEVERAL DRIVEWAYS, DIRECTLY INTO THE MIDDLE OF THE STREET.    WE CONTACTED THE DEALERSHIP, AND THEY CONFIRMED THERE IS A SERVICE BULLETIN FOR THE ISSUE, AND THE VEHICLE SHOULD GET IMMEDIATE AND NECESSARY REPAIRS.    IF IT HELPS, THE SERVICE NUMBER WITHIN CHEVROLET IS: #PIT5361D    ATTACHED IS AN IMAGE OF THE EXACT DIAGNOSIS AND CONFIRMATION FROM THE CHEVROLET DEALERSHIP.    WE WERE FORTUNATE NO OTHER TRAFFIC WAS APPROACHING US. OTHERS MAY NOT BE SO LUCKY!",
        "vin": "1GNSKBKC7HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231778,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PLACED INTO REVERSE THE BACKUP CAMERA AUTOMATICALLY TURNS ON AT MAXIMUM BRIGHTNESS AND CANNOT BE DIMMED OR OVER RIDDEN. THIS CAUSES BLINDING AND INABILITY TO SEE OUT OF THE VEHICLE AT NIGHT. THE BRIGHTNESS IS SUCH THAT YOU CANNOT SEE OUT OF ANY WINDOWS FROM INSIDE THE VEHICLE. TO SEE OUTSIDE YOU MUST ROLL DOWN THE WINDOWS BUT THIS ELIMINATES THE ABILITY TO SEE WHAT IS BEHIND YOU.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231518,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO (ELECTRIC) DOOR LOCK SYSTEM INTERMITTENTLY FAILS TO FUNCTION; WHEN DOORS ARE LOCKED, UNLOCK BUTTON IS FAILING TO UNLOCK THE DOORS.  THIS HAS OCCURRED BOTH WHILE STATIONARY AND WHILE MOVING ON A CITY.  (THIS VEHICLE IS A POLICE CANINE VEHICLE).",
        "vin": "1GNSKDEC7HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230789,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  ON JUNE 20TH 2019 I CAME OUT TO GET IN MY VEHICLE TO LEAVE WORK.  AS I WAS DRIVING, I NOTICED THE AC WAS NOT GETTING COLD AND ANTIFREEZE WAS CHECKED AND FINE.  TOOK IT IN TO A CHEVY DEALERSHIP AND WAS TOLD THE CONDENSER WAS OUT ON MY VEHICLE.  I WAS JUST OVER 37,000 MILES WHEN THIS OCCURRED, DROVE OFF THE LOT BRAND NEW SEPTEMBER 2017, AND WAS TOLD SINCE IT WAS OVER MY 36,000 BUMPER TO BUMPER WARRANTY NOTHING COULD BE DONE.  DID OTHER RESEARCH AND CONDENSERS HAD PREVIOUSLY BEEN RECALLED ON 2015-2017 CHEVY TAHOES, BUT WAS TOLD \"MINE WAS NOT ONE OF THEM\". I WAS ALSO TOLD BY OTHER MECHANICS THAT A CONDENSER SHOULD NOT HAVE GONE OUT SO SOON ON A NEW VEHICLE.",
        "vin": "1GNSCAKC7HR"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE 2017 CHEVROLET TAHOE AND IN THE LAST6 MONTHS ON MY MONTH REPORT THE TIRE PRESSURE IF VARYING AS MUCH A 4-6 LBS.   AND IT CAN BE IN A SINGLE DAY.  I HAVE TRIED TO ADDRESS IT WIITH THE CAR DEALERSHIP AND THE MAUNFUACTURE AND THEY ARE JUST PASSING THE BUCK.  THERE IS NOT LEAK.  I THINK IT IS SIMILAR TO THE FORD FIRESTONE ISSUE. SEVERAL YEARS AGO.    APPARENTLY THE TIRES ARE APPARENTLY THINNER WHICH MIGHT EFFECT THE PRESSURE SENSOR AFTER 1 YEAR.    I WOULD FOR THIS ISSUE TO CASE HARM TO THE GENERAL PUBLIC BECAUSE MANUFACTURER DOES NOT SEEM TO CARE.    CASE # WITH CHEV IS # 9-524821390      I HAVE ALL OF THE RECORD TO PROVE THIS, CAN YOU HELP WITH THIS ISSUE.",
        "vin": "1GNSKBKC9HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205916,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH COMPUTER COMES AND GOES INTERMITTENTLY. UNABLE TO VIEW MILEAGE OR FUEL GAUGE. IT HAPPENS WHEN STARTING THE VEHICLE AND REMAINS OFF FOR THE DURATION UNTIL THE CAR IS SHUT OFF. THE FREQUENCY OF IT COMPLETELY GOING BLACK IS RANDOM.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TAHOE IS HAVING PROBLEMS WITH ACCELERATION.  SOMETIMES THE VEHICLE WILL IDLE OVER THE RPM AND WON'T SWITCH GEARS OR SPEED UNLESS I LET GO OF THE GAS TO BRING THE RPM DOWN AND THEN ACCELERATE AGAIN.  THERE ARE ALSO TIMES WHEN THE CAR JERKS WHEN ACCELERATING AND MAKES A LOUD NOISE AS IF SOMETHING JUST POPPED OR BROKE AND SOMETIMES IT FEELS LIKE IT'S ABOUT TO STALL WHEN ACCELERATING.  CAR IS ALSO VIBRATING/SHAKING WHEN AT A COMPLETE STOP.  LASTLY, HEAT COMES OUT OF THE VENTS OF THE VEHICLE EVEN WHEN THE SYSTEM IS OFF.  THE CIRCULATION IS ALWAYS ON AND THE HIGHER THE SPEED (MAINLY HIGHWAY) THE MORE THE HEAT COMES OUT.",
        "vin": "1GNSKBKC6HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN TRAFFIC SLOW SPEED, BRAKES WENT TO FLOOR, LOST POWER BRAKES, POSSIBLY VACUUM PRESSURE. VERY HARD TO STOP VEHICLE. BRAKES WORKED AFTER DRIVING AT A HIGHER SPEED WHILE ATTEMPTING TO EXIT THE ROAD. THIS IS A BRAKE BOOSTER/VACUUM LOSS ISSUE IN MY OPINION. THIS IS A 1 YEAR OLD VEHICLE. THIS SHOULD NOT BE HAPPENING. I HAVE VIDEO OF THIS HAPPENING.",
        "vin": "1GNSKBKC3HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182274,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOW ACTUATOR ALREADY REPLACED IN DRIVER SIDE DOOR AND NOW THE PASSENGER SIDE DOOR LOCKS DON'T WORK",
        "vin": "1GNSCBKC2HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "12/17/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173213,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON AND I WERE TRAVELING ON HAMPTON RD IN DALLAS TOWARDS CAMPWISDON RD IN DALLAS TEXAS. AFTER MAKING A RIGHT ONTO CAMPWISDOM ANOTHER DRIVER WAVED ME DOWN . I LET MY WINDOW DOWN WHILE IN MOTION AND SHE INFORMED ME THAT MY TRUCK WAS ON FIRE. THERE WERE NO WARNINGS ON MY DASHBOARD, NOR DID SEE SMOKE OR FLAMES.",
        "vin": "1GNSKBKC0HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD BRAKE PEDAL RESULTING IN LITTLE OR NO STOPPING POWER WHEN APPLYING THE BRAKES AT LOW SPEED.  TO GET THE VEHICLE TO STOP, YOU MUST STOMP ON THE PEDAL AS HARD AS YOU CAN.  THE SITUATION TYPICALLY OCCURS WHEN PARKING.  THE BRAKE APPLICATION OR TWO ARE FINE, BUT AFTER THAT THE BRAKES FAIL.  THIS SAME ISSUE APPEARS TO BE WELL DOCUMENTED UNDER NHTSA ID NUMBER 10081053 AND GM PIT5361B, HOWEVER THOSE DO NOT INCLUDE THE 2017 MODEL YEAR, AND I AM SEEING WHAT APPEARS TO BE THE EXACT SAME ISSUE ON MY 2017 TAHOE.",
        "vin": "1GNSKAKC1HR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I AM STILL DRIVING MY CHEVY TAHOE WITH THIS ISSUE WITH GM STILL SAYING NO REMEDY IS AVAILABLE?  CAN I DEMAND WHERE I PURCHASED MY CAR FROM TO CHANGE THE FAULTY AIR BAGS OR TO REPURCHASE AT FMV?",
        "vin": "1GNFK13027J"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TRAVELING ON I-55 SOUTH BETWEEN THE GLUCKSTADT AND MADISON EXITS AROUND 5:45PM ON 12/21/18 WHEN THE SUNROOF EXPLODED SENDING CHARDS OF GLASS THROUGHOUT THE ENTIRE VEHICLE. THERE WERE NO OTHER VEHICLES CLOSE BY AN NO OVERPASSES WITHIN 2 MILES OF WHERE THE GLASS FAILURE OCCURRED. THIS IS A VERY SERIOUS SAFETY CONCERN THAT CHEVROLET NEEDS TO BE AWARE OF. THE SUNROOF GLASS WAS IN PERFECT CONDITION AND NOTHING HIT THE GLASS TO CAUSE THE EXPLOSION. I HAVE PHOTOS OF THE DAMAGE CLEARLY SHOWING THAT THE GLASS BLEW OUT FROM THE INSIDE OF THE VEHICLE, FURTHER SUPPORTING THE FACT THAT THIS WAS A FACTORY DEFECT.",
        "vin": "1GNSCCKC2HR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11122801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DESIGN OF THE BACK PASSENGER DOORS IS DANGEROUS BECAUSE THE SHAPE OF THE DOOR IS IN A POINT AND NOT ROUNDED, IT IS NOT COVERED IN PLASTIC OR RUBBER. MY 3 YEAR OLD DAUGHTER GOT OUT OF THE VEHICLE OVER THE WEEKEND AND STARTED TO RUN TOWARDS THE SIDEWALK AND STRUCK HER FOREHEAD ON THE POINTED END OF THE DOOR CAUSING A DEEP GASH THAT BLEED PROFUSELY.... SHE HAD TO BE TAKEN TO THE ER FOR SUTURING. VERY POOR DESIGN FOR A VEHICLE THAT IS TYPICALLY PURCHASED BY FAMILIES WITH KIDS.",
        "vin": "1GNSKBKC5HR"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "*TAKATA RECALL*  I HAVE BEEN NOTICING A LOT OF DIFFERENT ISSUES WITH MY 2017 TAHOE PREMIER.   THE ENGINE BLOCK IS A DEEP RUST COLOR. ENGINE IS EXTREMELY HOT EVEN HOURS LATER AFTER PARKING. THERE IS A THICK BLACK SLUDGE THAT IS ON NEARLY EVERY PART UNDER THE TRUCK. I STARTED HEARING A TICKING NOISE THAT SPED UP AS MY DRIVING SPEED INCREASES. THIS ISSUE OCCURS OFTEN BUT NOT DAILY. AS WELL AS WHEN TURNING INTO MY DRIVEWAY IT MAKES A HIGH PITCHED POPPING NOISE ( THE SOUND IS SIMILAR TO  A SMALL ROCK BEING FLUNG ONTO THE ALUMINUM WHEEL) I ALSO HEAR GRINDING NOISES WHEN MAKING A SHARP TURN. METAL AGAINST METAL IS AS BEST AS I CAN DESCRIBE IT. I DECIDED TO LOOK UNDER THE HOOD AND CHECKED THE OIL LEVEL AND IT APPEARS FINE. I DON'T KNOW HOW TO CHECK OTHER LEVELS ASIDE FROM THE WINDSHIELD FLUID SO I WILL BE FORCED TO HAVE IT TOWED TO THE DEALERSHIP.   WHILE I WAS UNDER MY TRUCK I NOTICED HOW THERE WAS A LOT OF RUSTED PARTS. THE (IF I AM CORRECT) EXHAUST HOUSING LOOKED NEARLY BURNED AND THE PRODUCT STICKER THAT IS ON THERE IS 100% BITES. AS IF SOMEONE PUT A LIGHTER TO IT. NOT SURE WHAT ALL THE GUNK IS THAT IS CAKED ON EVERYTHING BELOW THE TRUCK BUT IT CAN'T BE A GOOD THING FOR SURE. ALSO, I FOUND A BOLT WEDGED BETWEEN AN AREA. WHY IS THERE A BOLT AND WHERE DID IT COME FROM? DOES THIS MEAN I HAVE MISSING PARTS ON MY ENGINE OR ANYWHERE ELSE? MY TRUCK RUNS SO HOT BUT NO LIGHTS HAVE COME ON. THIS EVENING AFTER SEEING WHAT I DID MADE ME FEAR THE THOUGHT OF DRIVING MY TRUCK THAT I PAY A HEFTY  PAYMENT ON. IT HAS 12,000 MILES ON IT. I'VE HAD IT ONE YEAR AND AWAYS GET MY SERVICES DONE ON TIME WITH OIL CHANGES AND SO FORTH. I SHOULDN'T BE HAVING THIS ISSUE OR BETTER YET ISSUES. WHO'S GOING TO FIX THIS PROBLEM. AND HO LONG BEFORE SOMEONE RECALLS MY TRUCK FOR  THIS ISSUE !?",
        "vin": "1GNSKCKC0HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2018",
        "dateOfIncident": "06/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SHAKE/SHUDDER WHILE DRIVING STRAIGHT ON HIGHWAY AT 72 MPH UP TO AT LEAST 90 MPH.  STEERING WHEEL, CENTER COUNSLE, AND SEATS SHAKE.  GOES AWAY WHEN NOT ACCELERATING.  BALANCED TIRES AND DID NOT FIX.  DEALER THEN BALANCED TIRES AND ALIGNMENT WAS COMPLETED.  THIS ALSO DID NOT FIX.  DEALER KEPT MY CAR FOR ALMOST 2 WEEKS AND REPLACED TORQUE CONVERTER.  THIS STILL DID NOT FIX IT.  HAVE TO TAKE IT IN FOR A 3RD TIME.  MAKE ME FEEL DIZZY AND NAUSEOUS.",
        "vin": "1GNSKBKC2HR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079906,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "1GNFK1304R4"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074517,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 CHEVY TAHOE ENGINE VIBRATION WHEN THE VEHICLE IS IN IDLE OR BELOW 500 RPMS. THE VECHICLE FEELS LIKE IS GOING TO SHUTOFF AND IT STRUGLES TO TURN ON FROM A COLD START.  THIS HAPPENS WHEN THE VECHILE IS STATIONARY.",
        "vin": "1GNSCAKC5HR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I FIRST RECEIVED NOTICE OF THE RECALL IN JULY 2016.  AS OF TODAY, NOVEMBER 21, 2017 WHEN I SPOKE WITH THE DEALER, THERE IS STILL NOT A PLAN TO RECTIFY THE SITUATION / REPLACE THE FAULTY AIRBAG.  TAKATA HAS NOW FILED BANKRUPTCY.  THEY'VE HAD AT LEAST 18 MONTHS TO WORK ON A REMEDY BUT AS OF YET THERE IS NONE.  I DOUBT THERE WILL BE...",
        "vin": "1GNFK13087R"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/21/2017",
        "dateOfIncident": "05/31/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER POOLS SOMEWHERE BETWEEN THE ROOF AND TOP OF THE HATCH ON BOTH SIDES OF THE REAR WINDSHIELD WIPER + DRIPS DOWN THE BACK WINDSHIELD FOR HOURS.",
        "vin": "1GNSKCKC2HR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2017 CHEVROLET TAHOE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V383000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. WEBB CHEVROLET (RT 30, PLAINVILLE, IL 815-261-0121) WAS CONTACTED AND STATED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.*BF  UPDATED 8/14/18*JB",
        "vin": "1GNFK13087R"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035728,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I NEED NEW AIR BAGS  I HAVE RECEIVED NOTICE OF A RECALL",
        "vin": "1GNFC13057R"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2017",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WEDNESDAY, JULY 12, 2017, I SIGNED A LEASE FOR A BRAND-NEW 2017 CHEVROLET TAHOE LS AT ED BOZARTH CHEVROLET IN LAS VEGAS NV.  THREE DAYS LATER AS I WAS DRIVING THE VEHICLE ON THE MAIN STREETS MY VEHICLE KEPT HESITATING AND JUMPING  AS I WOULD HAVE TO STOP IN TRAFFIC THEN MOVE AGAIN WHEN I PRESSED ON THE GAS. THEN AS I WAS WAITING TO MAKE A LEFT TURN IN TRAFFIC, MY VEHICLE STALLED THEN ALLOWED ME TO GO. THEN SUDDENLY MY ENGINE LIGHT CAME ON. I THEN RECEIVED AN EMAIL FROM THE ONSTAR NOTIFICATION STATING THE DIAGNOSTIC DETECTED AN ISSUE WITH MY ENGINE AND MY TRANSMISSION SYSTEM. I BROUGHT MY VEHICLE IN MONDAY 07/17/17 MORNING AT 11 AM. THE SERVICE MAN INFORMED ME THAT THIS WAS A KNOWN ISSUE WITH SOME OF THE BRAND-NEW VEHICLES BY THE DEALERSHIP AND GENERAL MOTORS BECAUSE OF THE EXCESSIVE HEAT IN LAS VEGAS, BUT THERE WAS NO RECALL IN PLACE FOR GENERAL MOTORS AND A LETTER WAS ISSUED DATED JUNE 30, 2017 THAT HE HAD TO PROVIDE TO ME BECAUSE THERE WAS NO SOLUTION TO FIX THE PROBLEM AT THIS TIME.  HE LET ME THAT GENERAL MOTORS HAS NOT ISSUED A RECALL BECAUSE THEY DON'T KNOW WHAT TO FIX ON THE VEHICLE DUE TO THE EXTREME HEAT. I ASKED WHY WAS THIS NOT DISCLOSE TO ME BEFORE LEASING ME THE VEHICLE IF THIS WAS A KNOWN ISSUE TO ALLOW ME THE CHOICE TO DECIDE IF THIS WAS SOMETHING I COULD TOLERATE. THE SALES REP NOR THE SERVICE DEPARTMENT WERE ABLE TO ANSWER THAT QUESTION. I ASKED TO SPEAK TO THE GENERAL MANAGER OF ED BOZARTH CHEVROLET AND WAS INFORMED THAT I WOULD NEED TO WAIT UNTIL MONDAY, JULY 24ONCE HE RETURNS FROM VACATION. I LET THE SALES REP KNOW THAT I WAS UNHAPPY, I WAS DECEIVED AND I FEEL UNSAFE DRIVING THIS VEHICLE. I HAVE THE DATED COPY OF THE LETTER #PIP5507 STALLING - HESITATION, I HAVE THE FIRST DIAGNOSTIC EMAIL STATING THE VEHICLE WAS IN PERFECT CONDITION, AND I HAVE THE DIAGNOSTIC EMAIL FROM ON STAR STATING THAT THE VEHICLE  IS HAVING ENGINE AND TRANSMISSION DEFECTS",
        "vin": "1GNSCAKC3HR"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "07/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006245,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS EXPLODING SUNROOF",
        "vin": "1GNSKCKC9HR"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2017",
        "dateOfIncident": "04/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10981188,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ILLUMINATED AT 500 MILES ON ODOMETER   DIAGNOSED AS FUEL VENTING FROM FUEL SYSTEM INTO CABIN COMPARTMENT   RESULTING IN FUEL SMELL CAUSING NAUSEA, DIZZINESS AND CAUSING DRIVER AND OCCUPANTS TO BE EXTREMELY DROWSY.  THIS OCCURRED WHEN CAR WAS STARTED AND WHEN DRIVING AT ALL TIME. DRIVER SOUGHT MEDICAL ATTENTION AND DEALER HAD GREAT DIFFICULTY REPAIRING VEHICLE LE TO OWNERS SATISFACTION.  DEALER REFUSED TO REPLACE BRAND NEW VEHICLE",
        "vin": "1GNSCBKCXHR"
    }
]