[
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "04/02/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459609,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vacuum levels have dropped, causing a huge increase in braking effort. I could be rolling backwards in reverse and have the brake pedal all the way on the floor with all my strength and my car will still be rolling and eventually come to a stop. This is very unsafe and dangerous for me and also for others because it could cause me to roll into someone else’s vehicle. There has been a recall on this issue but I do not believe my car was serviced for it and it is no longer on the recall list. This is something that can be inspected at anytime seeing as it is only getting worse.  Another issue I am now having is my transmission is kicking when going in and out of reverse, it won’t shift out of second and my transmission is now having to be rebuilt. I have no service lights on, no warnings and this was very sudden and out of no where.",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/28/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458593,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "At low speeds the brakes slip causing the vehicle to glide and not stop in the forward and reverse position. Almost hit pedestrian and other vehicles. This was reproduced by my auto technician. No warning lights on dash.",
        "vin": "1GNSKHKC8HR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "03/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "This vehicle is unsafe as there appears to be a problem with fuel injectors which causes a sudden burst when stopping and a accelerates too quuckly when taking off both problems almost caused an accident. This has been happening since the vehicle was almost brand new. I have already taken to Chevy and they admit there is a problem",
        "vin": "1GNSCGEC9HR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449749,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Suburban. The contact stated that while reversing out of the driveway, the brake pedal was depressed but failed to respond as needed. The contact stated that the brake warning light illuminated, the brake pedal vibrated, and the brakes failed to engage without warning. The contact stated that added pressure to the brake pedal was needed to stop the vehicle. The contact stated that the failure was intermittent. The contact stated that while conducting his own research, he became aware that similar vehicles were subjected to NHTSA Campaign Number: 19V645000 (Service Brakes, Hydraulic) however, his vehicle was not included. Neither the dealer nor the manufacturer was notified of the failure. The approximate failure mileage was 55,000.",
        "vin": "1GNSCHKC8HR"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/27/2021",
        "dateOfIncident": "12/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle became hard to stop/pressing brakes while pulling into my garage. Had to stomp the brakes hard to stop. There were no warnings prior to this issue. No check engine alert etc. Upon research, I see that there was a recall for a flaw with the  suburban’s powered brake-assist system. When I put in my vin number it states that my vehicle is not included in the recall however this is the exact problem I am experiencing.",
        "vin": "1GNSKHKC4HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440123,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes are shuttering at low speeds, and failing at low speeds. While in parking lot, attempting to park in parking space, brakes failed both in reverse and drive, posing a hazard of collision and possibly bodily damage.",
        "vin": "1GNSKHKC6HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2021",
        "dateOfIncident": "10/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving my vehicle, it started to shudder and shake.  The Vehicle acted like it didn’t have any power. I was on top of a hill, and the car would not go.  I tried park, drive, reverse and nothing. I had my 8 yo in the car in a dangerous area. I had to put the vehicle in neutral and drift down a hill, hoping no one  would be coming to get to a safer place to get help.  My car was towed. When they flushed the transmission there was metal shaving, which I now learned this has been an issue with these power trains. My vehicle is just at 60,800, which is just 800 miles over the gmc warranty.",
        "vin": "1GNSKJKC0HR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Chevrolet Suburban. The contact stated while driving 10-15 MPH, the check engine warning light illuminated. The vehicle was taken to the independent mechanic who diagnosed that the fuel injectors had failed. Then the vehicle was taken to the dealer who diagnosed that six of the eight fuel injectors had failed and needed to be replaced. The contact stated that the failure had been reoccurring and the vehicle had been shuddering while driving and while reversing. The contact also stated that the vehicle would jump and hesitate to respond when the accelerator pedal was depressed at the stoplight. The contact also stated that the vehicle had stalled while driving on the highway. The manufacturer was notified of the failure but informed the contact that they would not cover the repair under an unknown service bulletin because the VIN was not included. The vehicle was not repaired. The approximate failure mileage was 35,000.",
        "vin": "1GNSCHKC3HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/11/2021",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The Brake Assist failed while driving slow in a parking lot. I could not stop the vehicle and narrowly missed an alert driver . Warning alerted me while it was happening... no advance warning.",
        "vin": "1GNSCJKC8HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/09/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "There is no Brake assist at low speeds. Vacuum pump seems not to be functioning. Hard pedal hard to stop at parking lot speeds.",
        "vin": "1gnskhkc6hr"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/07/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle brake pedal goes to floor while running 35 MPH or slower at times! I am a mechanic and feels like brake assist system is failing (brake pump)but not all the time! I took to dealer and they could not reproduce problem so sent me on my way. This is a large heavy 8 passenger vehicle and my wife’s so she is scared when this occurs and is now afraid to drive it. This was a $66,000 vehicle that has 64,000 easy highway miles on it and is in mint condition. I ran my vin and there is no recalls on the vin but still has a brake problem. I have all new brake pads and rotors front and rear I do myself as I am a over 30 year mechanic. This is a safety brake issue as I’ve had it happen to me and my wife and it scares you because it takes longer to stop when it occurs!",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "09/29/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I brought my vehicle to Chevy dealer and I told service advisor something is wrong with brakes and/or brake assist. The brake pedal feels really stiff at low speeds. After dropping off keys with service advisor at Puyallup WA Chevy Harnish Auto Family I told them it might be something related to brake booster so something vacuum. After waiting for technician to diagnose the service advisor told me it was the vacuum pump and luckily it was covered under warranty.",
        "vin": "1GNSKJKC3HR"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430332,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The condenser has a faulty design and cracks, causing it to leak flammable R1234YF coolant in the engine bay. Additionally, this leak causes the AC system to stop cooling, thus making the inside of the vehicle a very dangerous place, particularly during summer months, as it is impossible to cool. There are thousands of reports of this issue on all Chevy/GM models between 2015-2020 including tahoe, silverado, suburban, and yukons. The manufacturer has put out a \"special coverage 17336\" adjustment but it only covers the vehicles up to 60,000 miles and because it's not part of a recall it's not automatically sent out to the owners of the vehicles. Further, a large number of vehicles are well beyond the 60,000 mile limit in the special coverage before the owner ever learns of the issue.  According to SAE J1739, \"Manufacturers must conduct Failure Mode and Effect Analysis (FMEA) as provided in SAE J1739 (adopted 2009). Manufacturers must keep the FMEA on file for at least three years from the date of creation.\" I would challenge that chevrolet did not do this FMEA testing or did not do it per standard as it would have shown this issue. Instead they moved forward with production affecting hundreds of thousands of their most popular vehicles from 2015-2020 and resulting in the consumer having to pay an average of $1100 in repair costs due to a known defect from the manufacturer.",
        "vin": "1GNSCJKC3HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/21/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The entire electrical system shuts down including lights while driving down the road. No driving light or display at night for about 30 seconds then come back on. System also loses all displays on dash during the day as well.",
        "vin": "1gnskhkc7hr"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/25/2021",
        "dateOfIncident": "06/14/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Service Brake Assist comes in at random times. Brakes seem unresponsive while in reverse or at slow speeds. Brakes become muddy and non responsive. Very to maneuver. Have had several near misses in parking lots. Never seen this issue with any vehicle ever before.",
        "vin": "1GNSKJKC4HR"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "07/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425018,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the cars loses all power and you can’t steer. It used to only happen when turn at a slow speed. And now when you’re driving it matter what speed it shuts off and you lose all power.  Nothing comes up for service on diagnostic it is very dangerous I have a family have sex and no one can find out what’s wrong with it",
        "vin": "1GNSKHKC5HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "05/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission failure at 66,909 miles on 5/19/21. Dealership has original replaced transmission. Our safety was put at risk by breaking down and not being able to move vehicle to a safe location. Advised by service agent at dealership that  a lot of 2017 Chevrolet suburban transmissions have had problems.  The problem was confirmed by dealership  and a remanufactured transmission was installed. I have invoice from dealership describing issue and work done. No warning lamps or messages advised of the problem.  Slight Transmission slippage started on 5/18/21 complete failure the next day.",
        "vin": "1GNSKHKC4HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418873,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GM has a special coverage TSB for A/C issues relating to a condenser unit and leakage of refrigerant. My 2017 Chevy Suburban has had the same issue just occur at 68,000 miles. Complete loss of A/C. After researching online, this is a VERY common problem.  Most instances are just outside of the manufacturer warranty as well.   Special Coverage TSB No. 17336-04 covers this issue for specific VIN numbers based on where they were manufactured. Regardless of where manufactured there are MANY other vehicles having the same issue. PLEASE INVESTIGATE.   As it is just now getting extremely hot in Georgia, there is no telling how long this has been an issue. And of course, I will need to have the A/C fixed long before any action is realized from this submission.. Hopefully other will benefit from the post!! Thanks for you help and consideration.",
        "vin": "1GNSCHKC4HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STUCK IN DRIVE GEARS. GEARS WILL NOT SHIFT. BRAKE PEDAL STUCK. OCCURRED SUDDENLY WITH WARNING. VERY DANGEROUS.  PREVIOUSLY THE VEHICLE BRAKES PEDAL WAS STUCK IN THE UPWARD POSITION. WOULD NOT GO DOWN. HAD TO FIX IT . CHEVY IS NOT TAKING RESPONSIBILITY. THIS IS LIFE THREATENING.",
        "vin": "1GNSKHKC8HR"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395164,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DASH AND HEADLIGHTS TURN OFF WHILE DRIVING, ENGINE STALLS AND DIES, POWER STEERING BECOMES INOPERATIVE. TRANSMISSION POPS OUT OF GEAR AND FREEWHEELS. SERVICE STABILITRACK LIGHT. VERY DANGEROUS SITUATION FOR MY WIFE AND 5 KIDS WHEN THIS HAPPENS ON CURVY BACKROADS AT NIGHT LIKE JUST HAPPENED LAST NIGHT! THIS IS ALSO THE SAME PROBLEM AS OUR PREVIOUS CHEVY TAHOE SO WE KNEW THE PROBLEM WAS LIKELY RELATED TO POOR QUALITY BATTERY CABLES THAT ARE DEGRADING PREMATURELY. THIS SHOULD NOT BE HAPPENING ON A 3-4 YEAR OLD VEHICLE. AFTER SEARCHING A GM WEB FORUM AND FINDING OTHER PEOPLE COMPLAINING ABOUT THE SAME ISSUE, THERE WAS A REFERENCE TO GM TSB 18-NA-161 ON THIS EXACT ISSUE I AM ABSOLUTELY AMAZED THAT GM HAS NOT DONE A RECALL ON THIS YET, AS IT IS A MAJOR SAFETY FAILURE LIKELY TO CAUSE A CRASH AND POTENTIALLY A FATALITY. I CHECKED THE TIGHTNESS ON THE CONNECTIONS BY HAND, WHICH WERE BOTH VERY TIGHT, THEN I RESEATED AND TORQUED THE BATTERY TERMINAL CONNECTION. I MEASURED THE RESISTANCE ACROSS THE POWER JUMPER, LUG TO LUG. THIS IS GM PART NUMBER 84494554, AND I MEASURED 0.3 OHMS ACROSS THIS LITTLE SECTION OF WIRE AT MULTIPLE POINTS ON THE LUGS. TRIMMING BACK THE INSULATION AND CONTINUING THE MEASURE, THE HIGHEST RESISTANCE APPEARS TO BE COMING FROM THE WIRE TO THE LUG CONNECTION AT THE FUSE BUS, AND NOT THE CRIMP CONNECTION AT THE BATTERY TERMINAL, AND NOT THE BOLTED CONNECTION TO THE BUS. THERE WERE SOME STRANDS BROKEN AT THIS CONNECTION. I MADE AND ADDED A TEMPORARY JUMPER OF THE SAME WIRE GAGE, AND THE RESISTANCE ACROSS THE SAME MEASURED POINTS DROPPED TO 0.0 OHMS. ABSOLUTELY A MAJOR SAFETY ISSUE IF THE VEHICLE SUDDENLY DIES WITHOUT WARNING. I CAN SEE THIS SAME ISSUE HAPPENING ONCE, I FORGAVE GM ONCE YEARS AGO, BUT WITH THE SAME ISSUE HAPPENING TO TWO DIFFERENT VEHICLES 8 MODEL YEARS APART, THE SAFETY OF MY FAMILY IS TOO IMPORTANT TO BUY GM PRODUCT IN THE FUTURE.",
        "vin": "1GNSKJKC8HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386874,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER APPLYING AND RELEASING THE BRAKE PEDAL AT A SLOW SPEED TO COME TO A STOP THE BRAKE PEDAL FELT HARD AND VEHICLE FELT LIKE IT WOULD NOT STOP. I HAD TO PUSH THE PEDAL  ALL THE WAY TO THE FLOOR BUT THE VEHICLE WOULD STILL SLOWLY ROLL AND THEN FINALLY COME TO A STOP. I TOOK IT TO THE DEALER AND THEY TOLD ME IT'S THE VACUUM PUMP AND OIL LINES. I DID A GOOGLE SEARCH AND FOUND THAT GM HAD A RECALL BACK IN 2018 ON 2014-2018 MODELS LIKE MINE HOWEVER, I WAS NEVER NOTIFIED AND IF YOU SEARCH MY VIN IT SAYS NO RECALLS AVAILABLE. HOW IS THIS POSSIBLE??? I AND MY FAMILY COULD HAVE BEEN SERIOUSLY INJURED OR INJURED OTHER PEOPLE IN A CRASH!",
        "vin": "1GNSKJKC9HR"
    },
    {
        "components": "UNKNOWN OR OTHER,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386100,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE A/C CONDENSER EXPERIENCED A PREMATURE FAILURE, LOOSING ALL THE FREON.  THIS IS A KNOWN ISSUE AND CHEVY HAS A SPECIAL PROGRAM TO ADDRESS THE ISSUE FOR A SELECT NUMBER OF VEHICLES. HOWEVER, MY VEHICLE IS NOT COVERED UNDER THIS RECALL EVEN THOUGH I HAVE THE SAME PROBLEM AS THE ONES COVERED UNDER THE RECALL. THIS IS AN ENVIRONMENTAL CONCERN AS WELL AS A SAFETY ISSUE AS IT CAN CAUSE WINDOW FOG. CHEVY NEEDS TO STEP UP AND PAY TO FIX THE ISSUE FOR ALL THE AFFECTED VEHICLE'S.  IN ADDITION, THE FRONT COLLISION WARNING SYSTEM IS A JOKE, ITS INCONSISTENT AND RARELY WORKS.",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383388,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TURNING AT A \"T\" INTERSECTION INTO ONCOMING TRAFFIC. WHEN CRANKING ON THE STEERING WHEEL TO TURN LEFT AND ACCELERATE, VEHICLE STEERING WHEEL JAMMED UP. THANKFULLY, VEHICLE WAS ABLE TO KEEP DRIVING & CLEAR INTERSECTION BEFORE APPROACHING CARS ARRIVED. UPON RESTARTING VEHICLE MEMORY SYSTEMS IN VEHICLE WERE ERASED AND AN ERROR MESSAGE FLASHED STATING TO ROLL DOWN THEN BACK UP DRIVER SIDE AND PASSENGER SIDE WINDOWS. LATER THAT EVENING WHEN PUTTING VEHICLE INTO REVERSE AND SHARPLY TURNING WHEEL TO THE LEFT THE VEHICLE LOST ALL POWER AND TURNED OFF COMPLETELY WHILE IN REVERSE. AGAIN, THANKFULLY, I WAS IN A DRIVE-WAY WITH NO OTHER TRAFFIC AROUND. WHEN I RE-STARTED THE VEHICLE THE STEREO MEMORY ERASED AND THE ROLL DOWN, THEN BACK UP DRIVER AND PASSENGER WINDOWS WARNING FLASHED AGAIN. THIS IS ALL UNSETTLING BECAUSE I FREQUENTLY DRIVE IN AREAS OF HEAVY TRAFFIC AND INTERSECTIONS THAT CAN BE  TRICKY TO CROSS/TURN INTO THEREFOR REQUIRING MY VEHICLE TO RESPOND APPROPRIATELY AND NOT TURN OFF WHILE IN GEAR.",
        "vin": "1GNSKJKCXHR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376268,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR 2017 CHEVROLET SUBURBAN PREMIERE 2018 AT CLAY COOLEY, IRVING, TX AND HAVE COMPLETED EVERY MAINTENANCE SERVICE REQUIRED. WHEN WE PURCHASED THE VEHICLE IN 2018 THE CERTIFIED CHEVROLET SUBURBAN PREMIERE HAD 50, 000 MILES. AS OF  11/23/20 OUR TRUCK BEGAN SLIPPING WHEN PRESSING DOWN ON THE ACCELERATOR PEDAL WHILE DRIVING ON THE HIGHWAY. THE TRUCK WAS PAUSING BEFORE ACCELERATION AND NOISILY IDLING. WE TOOK THE CAR TO THE DEALERSHIP THE NEXT DAY AND WAS TOLD OUR TRANSMISSION NEED REPLACEMENT AND WILL COST US $6, 000. OUR CURRENT ONSTAR REPORT NEVER REPORTED ENGINE PROBLEMS, BUT ONLY SUGGESTED MAINTENANCE DUE AT 112, 500 MILES REPORTED 11/15/20. OUR PEDOMETER READ 110, 800 MILES PRESENTLY 11/23/20. THE SERVICE REPRESENTATIVE SAID WE HAD ALL OF THE SERVICE DONE LAST MONTH BUT WILL CHECK IT OUT. THIS IS A FAULTY VEHICLE THAT IS NOT SAFE AS CHEVROLET MAKE CLAIM THESE VEHICLE TO BE FOR FAMILY AND LONG DISTANCE TRAVELING. BUYER BEWATE AND DO NOT SPEND YOUR MONEY ON THIS HIGH END 2017 CHEVROLET SUBURBAN PREMIERE. AFTER 3 YEARS, THE TRANSMISSION IS GONE, REGARDLESS OF FOLLOWING ALL OF THE OWNER MANUAL SPECIFIC MAINTENANCE SERVICE GUIDELINES.",
        "vin": "1GNSCJKC2HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/07/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SERVICE BRAKE ASSIST\" WARNING LIGHT CONTINUES TO COME ON ON MY 2017 SUBURBAN. I TOOK IT TO THE DEALER AND THEY RESET THE SOFTWARE THAT CONTROLS THE BRAKES, BUT IT IS NOW SHOWING THE LIGHT AGAIN. COULD THIS HAPPEN IF THE BRAKES NEED TO BE REPLACED?",
        "vin": "1GNSCHKC8HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363138,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LOW SPEED AROUND 2-5 MILES IF YOU STEP ON THE BRAKE TOO FAST THE ABS WILL ENGAGE IVE EXPERIENCE THIS A LOT ESPECIALLY I PUT THE CAR ON REVERSE . YOU CAN HEAR THE ABS NOISE AND FEEL IT WHILE STEPPING G ON THE BRAKE LIKE SOMETHING IS SKID",
        "vin": "1GNSKJKC9HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "09/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOUCH SCREEN IS DEFECTIVE. IT HAS A MIND OF ITS OWN AND CONSTANTLY CHANGES RADIO STATIONS, CHANGES FROM RADIO TO CD, CHANGES FROM NAVIGATION TO RADIO, CHANGES VOLUME AND IS VERY DISTRACTING WHILE DRIVING AND HAS ALMOST CAUSED NUMEROUS ACCIDENTS.",
        "vin": "1GNSKHKC9HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352520,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NO BRAKES AT LOW SPEED",
        "vin": "1GNSCHKC5HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2020",
        "dateOfIncident": "06/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER IS BLOWING WARM AIR. A CHEVROLET CERTIFIED SERVICE DEPARTMENT FOUND A/C CONDENSER SPLIT AT THE SEAM AND LEAKING OUT FREON. IT NEEDS A NEW CONDENSER.   THIS IS THE EXACT SAME ISSUE AS STATED IN SPECIAL COVERAGE BULLETIN NO. 17336-05. REFERENCE NUMBER N162080780. OUR MAKE, MODEL AND NODE YEAR ARE KNOWN TO HAVE THIS ISSUE. HOWEVER, OUR VIN IS NOT LISTED AS ELIGIBLE FOR THIS SPECIAL COVERAGE. IT NEEDS TO BE ADDED!",
        "vin": "1GNSKHKC9HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326411,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION DRIVER ASSIST SYSTEM THAT INCLUDES SEAT VIBRATORS THAT ACTUATE WHEN IN CLOSE PROXIMITY TO OBJECTS FAILED.  WHEN THAT HAPPENED A WARNING MESSAGE WOULD APPEAR THAT SAID SERVICE DRIVER ASSIST SYSTEM.  THE SYSTEM ISSUE WAS DUE TO A FAILED HAPTIC SENSOR MOTOR THAT HAD A BROKEN WIRING PIGTAIL.  *TR",
        "vin": "1GNSKHKC3HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2020",
        "dateOfIncident": "03/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA HAS BEEN FOGGY SINCE NEW. THEY TOLD ME THAT'S THE WAY IT IS...FOGGY AND FUZZY. NOW IT HAS GOTTEN NOTICEABLY WORSE IN THE LAST MONTH. 2 DIFFERENT PEOPLE AT THE DEALERSHIP  SERVICE DEPT. HAVE TOLD ME THEY WILL NOT FIX IT TILL IT BREAKS. IT IS ESPECIALLY BAD IN THE DARK..I CANNOT EVEN SEE A BLACK CAT UNLESS IT HAS SOME WHITE ON IT !  I HAVE A PICTURE HERE BUT THE CAMERA SCREEN ACTUALLY LOOKS BETTER IN THE PHOTO THAN IT DOES IN PERSON. LOOKS LIKE YOU ARE LOOKING THRU FOG. YOU CAN SEE IN THE PHOTO THE $220. GARMIN DASH CAMERA LOOKS WAS BETTER THAT THE REAR.",
        "vin": "1GNSCJKC4HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319350,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3/25/20 AT APPROXIMATELY 7:20PM I WAS TRAVELING A NORTH BOUND DIRECTION ON US HIGHWAY 51 IN LANE 1 (FAST LANE). MY 2017 CHEVROLET SUBURBAN STARTED TO JERK  AND THE RPM GAUGE EXCELLED TO 5/6 RPM. THEN, THE SUBURBAN CAME TO AN ABRUPT STOP IN THE MIDDLE OF  LANE 1. AT THAT TIME I WAS REAR-ENDED BY A LAW ENFORCEMENT OFFICER. THE OFFICER WAS UNAWARE I WAS STOPPED, BECAUSE I DID NOT HAVE ANY INDICATIONS SUCH AS BRAKE LIGHTS. I WAS TRYING TO PRESS THE ACCELERATOR PEDAL TO TRY MOVE OUT OF THE HIGHWAY, AND THE SUBURBAN WOULD NOT MOVE. I HAD MY TWO SMALL BABIES IN THE CAR AND THANKFULLY NO ONE WAS INJURIED.",
        "vin": "1GNSCJKC7HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11311486,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET SUBURBAN 1500. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 19V645000 (SERVICE BRAKES, HYDRAULIC) WHICH WAS SERVICED AT BONIFACE HIERS CHEVROLET (800 S HARBOR CITY BLVD, MELBOURNE, FL 32901). MONTHS LATER, WHILE HIS WIFE WAS AT A STOP LIGHT, SHE EASED OFF THE BRAKE PEDAL TO INCH FORWARD AND AS SHE ATTEMPTED TO DEPRESS THE BRAKE PEDAL AGAIN, IT VIBRATED AND THE BRAKES FAILED TO ENGAGE WITHOUT WARNING. THE CONTACT'S WIFE HIT THE VEHICLE IN FRONT OF HER AT APPROXIMATELY 5 MPH. A POLICE WAS REPORT WAS FILED AND THE OTHER DRIVER HAD REPORTED UNKNOWN INJURIES. THE DEALER WAS NOTIFIED OF THE FAILURE AND INFORMED THAT CONTACT THEY HAD UPDATED THE ELECTRONIC CONTROL MODULE; THEY OFFERED NO FURTHER ASSISTANCE. THE MANUFACTURER HAD NOT BEEN NOTIFIED OF THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED OR DIAGNOSED FOR THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1GNSCHKC2HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2020",
        "dateOfIncident": "02/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT DIFFERENT SPEEDS, OR DURING BREAKING AND ACCELERATION, THE ENTIRE VEHICLE SHIRTS OFF INCLUDING THE ENGINE, A MESSAGE FLASHES IN THE DASH STABIL BRAKE, THEN THE VEHICLE IS DEAD WHILE MOVING. SOMETIMES IT TURNS BACK ON AUTOMATICALLY, OTHER TIMES I HAVE TO ATTEMPT TO START IT MULTIPLE TIMES.",
        "vin": "1GNSKJKC5HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A PROBLEM WITH MY TRANSMISSION, I TOOK IT THIS AUTO SHOP TO FIX . HE CHARGED ME 3200$ TO CHANGE THE TRANSMISSION HOWEVER THEY LIED TO ME , THEY DIDN'T CHANGE IT THEY JUST REBUILT IT . GAVE ME 6 MONTHS WARRANTY. I HAD SAME PROBLEM 5 MONTHS AFTER I WAS AT THEIR SHOP . I WENT TO THEM . THEY SAID WE CAN FIX IT BUT YOU HAVE TO PAY . OTHERWISE WE NOT GOING TO FIX IT . I PAID THEM TO FIX IT . THEY MADE ME BUY ALL THE PARTS FROM CHEVROLET DEALER  TWICE . AFTER ALL THEY TOLD ME TO BUY BRAND NEW TRANSMISSION. WHICH I DID . THE CAR STAYED AT THE SHOP 15 CONSECUTIVE DAYS . I LOST MY JOB BECAUSE OF THEIR RECKLESSNESS . I LOST A LOT OF MONEY BECAUSE OF THEM .    THE SHOP NAME IS (37 AUTO SHOP . WHICH LOCATED IN 37-43 57TH ST WOODSIDE NY 11377.  *TR",
        "vin": "1GNSKHKC8HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301920,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENGINE REVS UP TO 3-5 RPMS THEN JERKS FORWARD, THOUGHT I HAD GOT HIT FROM BEHIND, LUCKILY THERE WASNT ANYONE IN FRONT OF ME THIS HAS HAPPEND SEVERAL TIMES. BROUGHT TO DEALER 1ST TIME THEY SAID IT WAS A BENT PUSH ROD AND THAT IT WAS \"FIXED, BUT MAY HAPPEN AGAIN\" TRUCK WASNT RUNNING THE SAME WHEN I GOT IT BACK STILL HESITATING VERY SLIGHTLY. 1/24 AT A RED LIGHT WHEN IT TURNED GREEN, STEPPED ON THE GAS IT JUMPED SO FAR FORWARD AND THAT MY BODY REACTED AND I THOUGHT FOR SURE I HAD BEEN HIT, THERE WAS NO ONE BEHIND ME. HAPPEND AGAIN, BUT THIS TIME THE ENGINE REVVED 1ST. DIDNT DRIVE IT AFTER THIS, NEXT DAY TRIED TO DRIVE IT IT WAS REVVING SO FIERCLY AND JUMPINH SO BAD ON A 12 MIN RIDE THAT I HAD TO DRIVE WITH MY HAZARDS ON ON THE SHOULDER OF THE ROAD IN ORDER TO AVOID GETTING HIT OR AVOID HITTING ANYONE ELSE. BY THE TIME I GOT HOME THE TRUCK WOULDNT EVEN DRIVE THE ENGINE WAS JUST REVVING. IT WAS THEN TAKEN BY FLATBED TO THE DEALER. THIS IS AN EXTREMELY DANGEROUS SITUATION FOR ALL, AND CHEVROLET/GENERAL MOTORS NEEDS TO REMEDY THIS ASAP",
        "vin": "1GNSKJKC7HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C OUT. ABOUT $1600 TO REPLACE COMPRESSOR, 2 SEALS AND FREON. THIS CAR IS AT 39K MILES (36 WAS BUMPER TO BUMPER) 2017 MODEL. I BOUGHT IT NEW AND HAVE OWNED JUST OVER TWO YEARS.",
        "vin": "1GNSCHKCXHR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300652,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN REVERSING APPLYING MORE PRESSURE TO THE BRAKES IS REQUIRED THAN THE NORMAL AMOUNT. THE SUV SEEMS LIKE IT DOESN'T WANT TO COME TO A COMPLETE STOP AND THE BRAKES ARE FAILING.",
        "vin": "1GNSKHKC4HR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11300867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 CHEVROLET SUBURBAN. THE CONTACT STATED HE RECEIVED NHTSA CAMPAIGN NUMBER: 19V761000 (ELECTRONIC STABILITY CONTROL, SERVICE BRAKES, HYDRAULIC, SERVICE BRAKES) AND THE VEHICLE WAS TAKEN TO DEALER PARKS CHEVROLET CHARLOTTE LOCATED AT 8530 IKEA BLVD, CHARLOTTE, NC 28262,  (704) 227-5848 TO RECEIVE THE RECALL REMEDY ON NOVEMBER 19, 2019. THE CONTACT STATED WHILE DRIVING 25 MPH, WHEN HE DEPRESSED THE BRAKE PEDAL AND THE VEHICLE ACCELERATED ON IT'S OWN. THE ENGINE WAS CUT OFF BUT THE VEHICLE CONTINUED TO ACCELERATE FORWARD. THE CONTACT STATED HE DROVE THROUGH A STOP SIGN AND IMPACTED ANOTHER VEHICLE AND KEPT ACCELERATING UNTIL IT CAME TO A STOP CRASHING INTO A TREE. THE AIR BAGS DID DEPLOY. THE CONTACT SUSTAINED EMOTIONAL DISTRESS AND HIS WIFE SUSTAINED INJURIES ON HER CHEST BONE INJURIES, RIGHT HAND, AND A CUT LIP. THE CONTACT STATED THEY DID NOT SEEK MEDICAL ATTENTION. THE CONTACT STATED THE OTHER VEHICLE WAS TOTALED AND A CHILD SUSTAINED NECK INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DRIVABLE. THE VEHICLE WAS TOWED TO IMPOUND LOT. THE CONTACT CALLED THE DEALER AND WAS MADE AWARE OF THE FAILURE. THE CONTACT BELIEVES THE RECALL REPAIRS WAS RELATED TO THE ACCIDENT. THE VEHICLE WAS TOTALED. THE MANUFACTURER HAD NOT BEEN AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS 24,720.",
        "vin": "1GNSKHKC6HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300307,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A MESSAGE WILL FLASH SERVICE STABILITRAK LIGHT WILL COME ON THEN A SECOND OR TWO LATER THE VEHICLE WILL LOOSE ALL IT'S POWER. THE VEHICLE WILL SHUT DOWN WHILE DRIVING. ONCE WHILE DRIVING AT 53 MILES PER HOUR WHILE ON CITY STREET DURING MID TRAFFIC  AND TWICE WHILE DRIVING A LOW SPEED MAKING A TURN.",
        "vin": "1GNSKHKC7HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET SUBURBAN. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED. THE CONTACT STATED THAT THE ELECTRONIC STABILITY CONTROL WARNING LIGHT WAS ILLUMINATED. THE GEAR SHIFT LEVER WAS PLACED IN THE PARK POSITION AND THE VEHICLE WAS TURNED OFF AND BACK ON. THE VEHICLE WAS TAKEN TO DAN VADEN BRUNSWICK LOCATED AT 121 ALTAMA CONNECTOR, BRUNSWICK, GA 31525, (912) 292-4089, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE BODY CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "1GNSCJKC8HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/31/2019",
        "dateOfIncident": "12/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET SUBURBAN. WHILE DRIVING DOWNHILL AT APPROXIMATELY 40 MPH, THE BRAKE PEDAL WAS DEPRESSED AND FELT FIRM. THE CONTACT STATED THAT IT REQUIRED ADDITIONAL EFFORT TO SLOW DOWN THE VEHICLE. JOHN ELWAY CHEVROLET (LOCATED AT 5200 S BROADWAY, ENGLEWOOD, CO 80113, (720) 259-0391) WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS UNSURE IF THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBERS: 19V761000 (ELECTRONIC STABILITY CONTROL, SERVICE BRAKES, HYDRAULIC, SERVICE BRAKES) OR 19V645000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS ALSO INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 56,546. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO THE EXCESSIVE BRAKING NECESSARY AND THE UNEVEN BRAKING THAT THIS VEHICLE HAS BEEN RECALLED TWICE SINCE SEPT. 2019, I HAVE BEEN EXPERIENCING EXCESSIVE AND UNEVEN BRAKE AND TIRE WEAR.  I HAVE TOLD THE DEALER MULTIPLE TIMES SINCE LEASING THIS VEHICLE THAT IT DID NOT RIDE RIGHT AND THE STEERING WHEEL WOULD SHAKE EVERY TIME I USED THE BRAKES.  IT ALWAYS FEELS LIKE I HAVE TO SLAM THE BRAKES TO EVEN SLOW DOWN.  THEY FIXED ONE RECALL AND DO NOT YET HAVE THE FIX FOR MY MODEL YEAR, FOR THE SECOND.  THE DEALER HAS NOTES THAT I NEEDED BRAKE REPAIR AT 29,000 MILES, BUT THEY DID NOT INFORM ME.  I BROUGHT THE CAR BACK 3 TIMES SINCE THEN, NOTING THE EXACT SAME THING.  AT 36,000 MILES THEY TOLD ME I AM NOW DOWN TO THE ROTORS AND THE PADS AND ROTORS NEED REPLACEMENT DUE TO UNEVEN WEAR.  I EXPRESSED CONCERN DUE TO THE RECALLS AND DUE TO THE FACT THAT I HAVE BEEN TELLING THEM REPEATEDLY ABOUT THE DRIVEABILITY OF THIS VEHICLE, I FIRMLY STAND THAT THIS IS A DIRECT PRODUCT OF THE ISSUE FROM THE TWO RECALLS.  THE DEALER TRIED TO USE SCARE TACTICS. I OPENED A CASE WITH CHEVY AND I AM GETTING NO ASSISTANCE.  I AM FEARFUL IN THIS CAR.  I AM GOING TO GET THE BRAKES AND TIRES DONE BECAUSE MY KIDS ARE IN THIS VEHICLE, BUT WHAT ABOUT AFTER THAT, IT WILL JUST KEEP HAPPENING BECAUSE THE ON ISSUE IS NOT FIXED AND THE OTHER IS NOT PROPERLY FIXED.  THEY DO NOT SEEM TO WANT TO STAND BEHIND THE PRODUCT AND I AM GUESSING WILL NOT CARE WHEN GOD FORBID SOMEONE OR SOMEONE'S FAMILY IS KILLED.",
        "vin": "1GNSKHKC9HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE KEEPS HAVING KEY FOB, ELECTRICAL ISSUES, TIRE SERVICE MAINTENANCE ISSUES, AND NOW ENGINE ISSUES RELATED TO THE KEY FOB.  THE KEY FOB KEEPS SAYING IT IS NOT DETECTED.  RECENTLY, WHILE DRIVING ON ROAD AT ABOUT 48 MPH, KEY FOB NOTIFICATION CAME ON DASHBOARD SAYING KEY FOB WAS NOT DETECTED, ENGINE SHUT OFF AND CAR HAD TO BE RESTARTED AGAIN USING FOB BOX INSIDE GLOVE COMPARTMENT, THIS WAS PARTICULARLY ALARMING.  THE KEY FOB HAS HAD BATTERIES REPLACED AND THEY WORK BECAUSE THE CAR WILL REMOTE START AND HAVE TRIED BATTERIES IN OTHER ITEMS.  THE FOB DOES NOT HOWEVER LET YOU UNLOCK THE CAR OR FINISH STARTING IT OUT OF THE REMOTE START ONCE YOU GET INTO THE CAR AND TRY TO START IT, THE CAR TELLS YOU IT CANNOT DETECT THE REMOTE.  THE CAR HAS HAD NUMEROUS KEY FOB ISSUES AND HAS BEEN TAKEN INTO LOCAL CHEVROLET DEALER WHO CANNOT FIND ISSUE.  THE CAR HAS ALSO HAD 142 HARD BRAKING EVENTS SINCE APRIL 2019 TO NOVEMBER 2019 ACCORDING TO ON STAR REPORTS.  THE TIRE SERVICE MONITOR KEEPS FLASHING THAT THERE ARE ISSUES WITH TIRES.  THE REAR WIPER WOULD NOT SHUT ITSELF OFF EVEN THOUGH BUTTON WAS IN OFF POSITION.  ALL OF THESE ISSUES HAVE NOT BEEN ABLE TO BE REPAIRED AT THE CHEVY DEALER.  THIS CAR IS GOING BACK IN FOR SERVICE 11/18/19 FOR THESE ISSUES AGAIN.  NOT SURE WHAT THE OUTCOME WILL BE UNTIL AFTER THIS APPOINTMENT.  MY GUESS IS THAT IT IS SOME KIND OF ELECTRONIC CIRCUITRY PROBLEM(S) BUT UNFORTUNATELY THE DEALER SAYS THEY CANNOT FIND ANY ISSUE(S) OR PROBLEM(S) UNTIL IT COMPLETELY SHUTS DOWN.  THESE EVENTS ARE ONGOING AND HAVE BEEN OCCURRING INTERMITTENTLY SINCE NOVEMBER 2018.  ALL I CAN PROVIDE IS PHOTOS OF THE DASHBOARD SHOWING WHAT IT RELATES TO ME UNFORTUNATELY I HAVE NO DOCUMENTATION OF ENGINE SHUTTING OFF ONLY A PHOTO OF WHAT DASHBOARD SHOWED WHEN IT HAPPENED.",
        "vin": "1GNSKHKC8HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "03/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277164,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 21, 2019 I WAS IN AN AUTOMOBILE ACCIDENT DUE TO BRAKE ISSUES. I WAS AT A RED LIGHT IN THE LEFT TURN LANE AROUND THE CORNER FROM MY HOUSE.  THERE WERE 3 OR 4 CARS IN FRONT OF ME TO TURN LEFT.  LIGHT TURNED GREEN, EVERYONE PROCEEDED. THE CAR IN FRONT OF ME PASSED THE CROSS WALK AT THE INTERSECTION, SHE SLAMMED ON HER BRAKES AND DECIDED NOT TO PROCEED.  I SAW HER MAKING A SUDDEN STOP, I STEPPED ON THE BRAKE.  SINCE WE WEREN'T GOING VERY FAST, MY EXPECTATION WAS FOR MY CAR TO STOP.  I FOUND THAT THE BRAKE PEDAL SEEMED TO BE MORE DIFFICULT TO PUSH.  INSTEAD THE HARDER I PRESSED ON THE BRAKE THE MORE I REALIZED I WAS ABOUT TO HIT THE CAR IN FRONT OF ME.  AT THAT POINT I FELT LIKE I HAD TO SLAM ON MY BRAKES.  THINGS WERE HAPPENING SO FAST.  AFTER MY VEHICLE BUMPED THE CAR IN FRONT OF ME, I ASKED THE GIRL TO PULL OFF THE ROAD SO WE WOULDN'T BLOCK TRAFFIC.  I CALLED THE POLICE TO COME OUT TO TAKE A REPORT.  SHE STATED THAT HER VEHICLE ALREADY HAD A HOLE IN THE BUMPER SO MY VEHICLE DIDN'T DO MUCH DAMAGE TO HER CAR.  WE BOTH HAD OUR VEHICLES REPAIRED.  SOMETIME IN EARLY TO MID MAY I RECEIVED A GENERIC LETTER FROM GM (DATED APRIL 2019) DISCUSSING THE FACT THAT THERE MAY BE A CONDITION WITH THE 2017 SUBURBAN MAY HAVE A CONDITION WHERE CUSTOMERS MAY EXPERIENCED INCREASED BRAKE PEDAL EFFORT.  I CONTACT GM AFTER STUDYING UP ON THIS ISSUE AND FILED A COMPLAINT. I RECD A CASE #.  SOMETIME LATER HE CONTACTED  ME SAYING MY CASE HAD BEEN MOVED TO ANOTHER AREA.  NEVER HEARD FROM ANYONE  CALLED THEM ON JUNE 18.  WAITED FOR ANOTHER CALL. FINALLY HEARD CASE WAS BEING MOVED TO ANOTHER AREA AND WAS TOLD IT COULD TAKE 30 DAYS OR MORE.  I SUPPLIED ALL THEY ASKED FOR.  THEY SENT SOMEONE OUT TO RETRIEVE DATA. WAITED AND WAITED. AFTER MUCH EFFORT RECEIVED AN EMAIL SAYING THAT THE ACCIDENT OCCURRED 5 MONTHS AGO & THE CONDITION MAY NOT HAVE BEEN PRESENT AT THAT TIME AND DECLINED TO ASSIST",
        "vin": "1GNSKHKCXHR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PERFORMED SAFETY RECALL 'REPAIR'  UNDER NHTSA CAMPAIGN NUMBER 19V645 AT LOCAL CHEVROLET DEALERSHIP ON 17 OCTOBER 2019. VEHICLE CONTINUES TO EXPERIENCE DECREASED BRAKING PERFORMANCE AT LOW SPEED - CONSISTENT WITH CHIEF COMPLAINT DESCRIBED IN THE CAMPAIGN DESCRIPTION. CURRENT SYMPTOMS STILL INCLUDES INCREASED BRAKE PEDAL EFFORT AND VIBRATION WHEN APPLYING BRAKES DURING LOW SPEEDS SUCH AS CONTROLLING VEHICLE SPEED IN SLIGHT DECLINES AND STOP-AND-GO TRAFFIC CONDITIONS. OWNER SUSPECTS DETERIORATED VACUUM PUMP AND RECOMMENDS REPLACEMENT OF VACUUM PUMP AS PART OF GM SAFETY RECALL REPAIR PROCEDURE (NOT JUST SOFTWARE UPDATE/MODIFICATION) UNDER NHTSA CAMPAIGN NUMBER 19V645.",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2019",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET SUBURBAN. WHILE DRIVING VARIOUS SPEEDS, THERE WAS A VIBRATION IN THE BRAKE PEDAL AND IT FAILED TO STOP THE VEHICLE. THE VEHICLE WAS RESTARTED AND OPERATED AS DESIGNED. THERE WERE NO WARNING INDICATORS ILLUMINATED. ADDITIONALLY, THE VEHICLE TOOK A LONG TIME TO STOP. THE VEHICLE WAS TAKEN TO BOB MCCOSH CHEVROLET BUICK GMC CADILLAC (1 BUSINESS LOOP 70 W, COLUMBIA, MO 65203, (573) 442-6156),  BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 9-5584337574. THE CONTACT STATED THAT THE FAILURE WAS SIMILAR TO WHAT WAS LISTED IN NHTSA CAMPAIGN NUMBER: 19V645000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS PREVIOUSLY REPAIRED PER THE RECALL. THE FAILURE  MILEAGE WAS APPROXIMATELY 45,000.",
        "vin": "1GNSKJKC2HR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255614,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM TRYING TO HAVE GM REINSTALL THE SAFETY FEATURE, LANE DEPARTURE WARNING. GM RECENTLY LITERALLY TOOK AWAY THE HAPTIC WARNING FUNCTION RECENTLY BY \"UPDATING\" THE SOFTWARE IN THE 2017 SUBURBAN. ON PAGE 298 OF THE OWNER'S MANUAL IT STATES THAT WHEN THE CAR DRIFTS TO THE LEFT OR RIGHT, THE LANE DEPARTURE FEATURE WILL EITHER BEEP OR THERE WILL BE A RUMBLE IN THE SEAT ON THE LEFT OR RIGHT SIDE DEPENDING ON THE DRIFT. THIS IS A SAFETY FEATURE I PAID FOR AND LIKE VERY MUCH. IT IS VERY USEFUL TO BE SUBTLETY REMINDED THAT THE CAR IS DRIFTING TO THE RIGHT OR LEFT. I HAVE CONTACTED CUSTOMER SERVICE TWICE TO NO AVAIL. I HAVE WRITTEN MARY T BARRA, CEO OF GM, AND HAVE NOT EVEN RECEIVED A \"WE'RE WORKING ON IT\" REPLY FROM HER. THIS IS A PURE AND SIMPLE SAFETY FEATURE THAT GM HAS TAKEN AWAY FROM ME, WITH NO EXPLANATION OR REGRETS. PLEASE ADVISE ON THE BEST WAY TO RESOLVE THIS ISSUE. THANKS, [XXX]. *JS    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GNSKJKC8HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "08/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254878,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING NORMALLY ON THE HIGHWAY THERE APPEARED TO BE A HARD SHIFT BETWEEN FIRST AND SECOND GEAR AND WHEN SECOND GEAR DID KICK IN, THERE WAS A SUDDEN JERK.  ALREADY HAVING MADE AN APPOINTMENT WITH THE DEALERSHIP THE NEXT DAY,  THAT MORNING A WHIRLING SOUND APPEARED EACH TIME THE ACCELERATION PEDAL WAS PRESSED.  WHEN WE GOT THE VEHICLE TO THE DEALERSHIP,  THEY RAN A DIAGNOSTIC AND IT CAME BACK CLEAR.  I ALSO PAY FOR ON STAR, AND THEY PROVIDE ME WITH REGULAR DIAGNOSTIC REPORTS,  WHICH NEVER INDICATED A PROBLEM AND THE CHECK ENGINE LIGHT NEVER CAME ON.  THE VEHICLE APPEARED FINE ON PAPER BUT WITH A TEST RUN, THE DEALERSHIP WAS ABLE TO SEE THE PROBLEM AND TOLD US WE NEEDED A NEW TRANSMISSION.   A MECHANIC TOOK OUR OLD TRANSMISSION APART AND SAID THERE WAS A PROBLEM WITH THE TORQUE CONVERTER AND WHEN IT WENT UP IT SENT SHRAPNEL INTO THE PUMPS AND DESTROYED THE TRANSMISSION.  THIS SEEMS TO BE A COMMON PROBLEM WITH CERTAIN GM TRUCKS",
        "vin": "1GNSKJKC4HR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM TRYING TO HAVE GM REINSTALL THE SAFETY FEATURE, LANE DEPARTURE WARNING ... I WOULD LIKE TO TALK WITH [XXXX], WHO IS QUOTED IN A [XXX] ARTICLE PUBLISHED 9-11-19. GM RECENTLY LITERALLY TOOK AWAY THE HAPTIC WARNING FUNCTION RECENTLY BY \"UPDATING\" THE SOFTWARE IN THE 2017 SUBURBAN. ON PAGE 298 OF THE OWNERS MANUAL IT STATES THAT WHEN THE CAR DRIFTS TO THE LEFT OR RIGHT, THE LANE DEPARTURE FEATURE WILL EITHER BEEP OR THERE WILL BE A RUMBLE IN THE SEAT ON THE LEFT OR RIGHT SIDE DEPENDING ON THE DRIFT. THIS IS A SAFETY FEATURE I PAID FOR AND LIKE VERY MUCH. IT IS VERY USEFUL TO BE SUBTLETY REMINDED THAT THE CAR IS DRIFTING TO THE RIGHT OR LEFT. I HAVE CONTACTED CUSTOMER SERVICE TWICE TO NO AVAIL. I HAVE WRITTEN MARY T BARRA, CEO OF GM, AND HAVE NOT EVEN RECEIVED A \"WE'RE WORKING ON IT\" REPLY FROM HER. THIS IS A PURE AND SIMPLE SAFETY FEATURE THAT GM HAS TAKEN AWAY FROM ME, WITH NO EXPLANATION OR REGRETS. PLEASE ADVISE ON THE BEST WAY TO RESOLVE THIS ISSUE.**THANKS, [XXXX]  ## VIN FAILED ## , ## *TT    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).' *AS",
        "vin": "1GNSKJKC8HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING STOPPED WORKING. LEAK FROM CONDENSER EXCACTLY AS PICTURED IN TSB COVERING SUBURBAN ESCALADE AND YUKON'S. GM STATES MY SUBURBAN WASN'T IDENTIFIED AS HAVING THE ISSUE. INSPECTION REVEAVELS IDENTICAL PROBLEMS WITH DEFECTIVE CONDENSER AS NOTED IN THEIR TSB.",
        "vin": "1GNSKHKC2HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/11/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243105,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTTOM LINE INJECTORS! HAVE HAD THIS CAR FOR LESS THAN A YEAR AND REPLACED AC CONDENSER, BACK UP CAMERA, WHOLE FUEL SYSTEM DROPPED OUT BC OF CODES, FULL TUNE UP, WIRES, PLUGS XS 2, STILL HAD MISFIRES, ROUGH IDLE CODES FINALLY AFTER 2000$ FIX AND OUT OF WARRANTY FIXED THE PROBLEM! MIGHT LOOK NICE BUT WILL NEVER BUY AGAIN!",
        "vin": "1GNSKHKC0HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY SON AS A PASSENGER.I PULLED UP TO A RED LIGHT AT VERY LOW SPEED FROM A HIGH SCHOOL PARKING LOT. IT WAS A RED LIGHT. 1ST CAR MAKING A LEFT.I CAME TO A COMPLETE STOP BEFORE THE CROSSWALK.AFTER BEING STOPPEF FOR OVER A MINUTE,I BEGAN TO RELEASE THE BRAKE PEDAL. AS I RELEASED THE BRAKE SLIGHTLY THE BRAKE PEDAL GOT VERY STIFF AND THE CAR STARTED TO SHAKE.  NO EMERGENCY STOP/LIGHTS/SEAT VIBRATE OR ABS SYSTEMS WERE ACTIVATED. AS THE CAR CREPT PAST THE CROSSWALK WITH THE BRAKE BEING DEPRESSED FULLY, SHAKING VIOLENTLY. THE VEHICLE ENDED UP 5-8 FEET FURTHER THAN WHEN I HAD STOPPED PRIOR. I NEVER RELEASED THE BRAKE ENOUGH TO EVEN MOVE. AFTER THE CAR STOPPED SHAKING MY SON HAD LOOKED AT ME AND VERY SCARED ASKED IF IT WAS AN EARTHQUAKE. I SAID NO THE CAR HAD NOT STOPPED. HE SAID TO ME WOW THAT WAS THE SAME FEELING FROM WHEN OUR VEHICLES BRAKES FAILED ONCE BEFORE AND PLOWED INTO THE VEHICLE IN FRONT OF US WHILE MY WIFE WAS DRIVING. MY SON WAS THERE FOR BOTH INCIDENTS BUT MY WIFE AND I WERE SEPARATE DRIVES FOR BOTH INSTANCES. I THEN TESTED THE BRAKES TO BE OPERATIONAL AND CONTINUED HOME. I BROUGHT THE VEHICLE TO PARADISE CHEVROLET AT THE FIRST APPOINTMENT THEY HAD AVAILABLE EVEN AFTER I STATED IT WAS A SAFETY EMERGENCY ON A VEHICLE THAT HAD HAD BRAKE FAILURES IN THE PAST. AFTER THE FIRST TIME THEY REPLACED THE VACUUM PUMP DUE TO FAILURE CAUSING A TRAFFIC COLLISION WITH INJURIES. CHEVROLET INSPECTED THE VEHICLE ONLY TO FIND THAT THIS TIME THE VACUUM PUMP WAS WITHIN PARAMETERS AND BRAKES WORK SUFFICIENTLY AFTER THE VACUUM UPDATE FROM A YEAR AGO.I AM NOW DRIVING THE SAME VEHICLE BASED ON THE INSPECTION FROM LOCAL CHEVROLET DEALER.I DO NOT FEEL SAFE IN THIS VEHICLE AFTER THE VACUUM PUMP BEING REPLACED 2 TIMES DUE TO FAILURE AND A THIRD TIME WITH A FAILURE AND NO PROPER REPLACEMENT.MY FAMILY IS IN DANGER AND SO ARE OTHER DRIVERS ON THE ROAD.",
        "vin": "1GNSCHKC2HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/06/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229715,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT THE TOP OF A BOAT RAMP BEGINNING TO BACK UP IN ORDER TO LAUNCH OUR BOAT WHEN THE BRAKE PEDAL FELT HARD AS A ROCK, IT WOULD NOT PRESS DOWN. QUICKLY, I SHIFTED INTO DRIVE AND MOVED SLOWLY TO LEVEL GROUND. THE BRAKE PEDAL REMAINED HARD, BUT STOPPED WHEN EXERTING TREMENDOUS PRESSURE, AKA \"STANDING ON THE BREAK.\" I HAD THE VEHICLE TOWED TO A CHEVROLET DEALERSHIP FOR REPAIR. THE PROBLEM WAS A FAILED BRAKE ASSIST VACUUM PUMP. APPARENTLY, THERE IS A CLASS ACTION LAWSUIT AGAINST GM FOR THIS VERY PROBLEM.",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221691,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL BECAME VERY HARD TO PRESS AND WOULDNT STOP THE VEHICLE, NEARLY CAUSING AN ACCIDENT. THE SERVICE BRAKE ASSIST LIGHT CAME ON. I HAD THE CODE PULLED BY A LOCAL GARAGE. THE CODE SAID THE BRAKE VACUUM PUMP HAD FAILED. VEHICLE ON HAS 60000 MILES.",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/10/2019",
        "dateOfIncident": "06/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON HIGHWAY AND WHEN TO APPLY BRAKE PEDAL WAS HARD AND DIDN'T RESPOND I HAD TO SLOWLY PULL TO THE SIDE AND THE CAR FINALLY BRAKES AFTER I LITERALLY HAD TO STAND ON BRAKE PEDAL . NO WARNING LIGHTS BRAKE PEDAL EXTREMELY HARD",
        "vin": "HR324406"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2019",
        "dateOfIncident": "05/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218687,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AN ISSUE TWICE WITH MY 2017 SUBURBAN PREMIER 40K MILES WHILE AT THE BOAT RAMP WHERE THE BRAKE PEDAL GIVES OUT A BIT AND I HAVE HAD TO PUMP THE PEDAL DOWN HARD THEN APPLY THE  EMERGENCY BRAKE AS A BACKUP.   I HAVE A SMALL BOAT WHICH IS WHY I AM CONCERNED IT MAY BE A BRAKE MALFUNCTION. HAVEN'T HAD AN ISSUE WHILE ON THE ROAD YET BUT BOTH TIMES IN AN INCLINE BOAT RAMP.     AFTER READING SEVERAL SIMILAR ISSUES LIKE MINE ON THE WEB I WILL BE CALLING GM CUSTOMERS SERVICE AND HAVING MY BRAKE SYSTEM CHECKED AGAIN.",
        "vin": "1GNSCJKC3HR"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197264,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY VERY VERY BAD AC CONDENSER TO COSTLY TO FIX",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "04/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194284,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER FAILURE. LEAK CAUSING ALL REFRIGERANT TO LEAK OUT. APPARENTLY, THIS IS A COMMON PROBLEM FOR THIS MODEL AND YEAR. CAR HAS 49K MILES AND IS OUT OF WARRANTY ON MILES EVEN THOUGH IT IS LESS THAN 3 YEARS OLD. JUST LEAKED OUT RAPIDLY. BLOWING HOT AIR. NOT REALLY DRIVEABLE WITH 3 CHILDREN.",
        "vin": "1GNSKHKC2HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THIS VEHICLE AND IMMEDIATELY HAD ISSUES WITH THE BRAKES. WHEN YOU TRY AND PUMP THE BRAKES AT A SLOW RATE, THE BRAKES HARDEN UP AND HAS ALMOST CAUSED SEVERAL ACCIDENTS. WE CALLED THE DEALERSHIP AND THEY SAID IT WAS SOMETHING WE HAD TO FIX ON OUR OWN AND THERE WAS NO RECALL. LOOKS LIKE THIS IS VERY COMMON IN THESE CARS AND YOU NEED TO BE AWARE. THIS IS AN EXPENSIVE MAINTENANCE THAT HAS TO BE FIXED.",
        "vin": "1GNSCHKC7HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173257,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PUMPING BRAKES THE BRAKES AT LOW RATES OF SPEED THE PEDAL WOULD GET VERY HARD OR LOCK UP AND THE VEHICLE WOULD NOT STOP AND WOULD ROLL FORWARD ALMOST CAUSING ACCIDENT. I WAS ABLE TO IMMEDIATELY RECREATE THE EVENT SO I DROVE STRAIGHT TO CHEVY DEALER WHERE IT WAS DIAGNOSED AS INTERNAL FAILURE OF THE BRAKING VACUUM PUMP. I HAVE NEVER IN ANY OTHER VEHICLE HAD THAT ISSUE AND THIS CAR WAS BOUGHT BRAND NEW SO I BELIEVE IT SHOULD NOT BE HAVING THAT ISSUE AT JUST 2 YEARS OLD. THIS WAS ALSO NOT A CHEAP FIX AND AM FRUSTRATED THAT IT HAS BEEN REPORTED AS COMMON AMONG CHEVY CARS RECENTLY. THESE VACUUM PUMPS ARE OVER AND OVER AGAIN MALFUNCTIONING FOR CHEVY OWNERS AND NEEDS TO BE RECALLED IT SEEMS TO AVOID ACCIDENTS AND UNNECESSARY DAMAGE",
        "vin": "1GNSKHKC8HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165712,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HI I?M NOT SURE IF THIS WILL EVER BE READ BUT THIS WEEK WHILE TRAVELING ACROSS THE US (IN A BLIZZARD) IN MY 2017 CHEVY SUBURBAN THE VACUUM PUMP ON MY BRAKE ASSIST WENT OUT AND LEFT ME WITH VERY LITTLE BRAKES     I WAS LUCKILY ENOUGH TO GET IT TO A DEALERSHIP WHERE THEY REPLACED THE VACUUM PUMP ALONG WITH THE BELT THAT BROKEN BECAUSE OF IT.  THEY DID SAY IT WAS A BAD DESIGN AND WOULD MOST LIKELY GO OUT AGAIN. I HAVE 4 CHILDREN WHO ARE IN THE CAR WITH ME AT ALL TIMES. I LOOKED ONLINE AND THERE IS NOT A RECALL FOR MY VEHICLE YET BUT I READ THAT OTHER PEOPLE ARE HAVING THE SAME ISSUES   I SAVED MY RECEIPTS AND I AM HONESTLY SCARED TO CONTINUE TO DRIVE MY FAMILY AROUND IN MY CAR.  I HOPE TO GET SOME KIND OF A REPLY WITH SOME DIRECTION TO TAKE TO GET THIS FIXED.  THANK YOU [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": "1GNSKHKC7HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "04/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES HARD TO STOP WHEN TRYING TO PARK CAR. FEELS AS IF BRAKES NOT WORKING PROPERLY AND CAR SLOWLY MOVING FORWARD OR BACKWARD WHEN IN REVERSE",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/03/2018",
        "dateOfIncident": "10/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155769,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT COMES ON WHEN DRIVING. ISSUES WITH AIRBAG WIRING UNDER SEAT. WIRING HARNESS IS ON BACK ORDER MEANING THIS IS A COMMON PROBLEM. GM SHOULD BE RECALLING AND TAKING CARE OF THESE ISSUES. WHEN ONE BUYS A 2017 SUBURBAN AND PAYING OVER $40K YOU DON'T EXPECT TO BE INVESTING MONEY TO BE FIXING SAFETY ISSUES.",
        "vin": "1GNSCHKC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149878,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET SUBURBAN. WHILE DRIVING 10 MPH, THE BRAKES SEIZED WHEN THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE BRAKE VACUUM HOSE SYSTEM FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THEY WOULD REVIEW THE CONTACT'S CASE AND GET BACK WITH HER. THE CONTACT HAD NOT HEARD BACK FROM THE MANUFACTURER. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 38,000.",
        "vin": "1GNSKHKC1HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "08/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121160,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH IDLE FOR A COUPLE OF WEEKS THEN CHECK ENGINE LIGHT AND SERVICE TRACTION CONTROL LIGHT CAME ON.  COULD NOT GEAR DOWN WITHOUT JERKING.  TOOK TO DEALERSHIP AND THE CORRECTED THE PROBLEM.  THREE DAYS LATER ROUGH IDLING AGAIN.",
        "vin": "1GNSCHKC3HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER BRAKE PAD WEARING OUT UNEVENLY. THE INSIDE PAD IS 6MM DIFFERENT FROM THE OTHER 3 PADS. VERY DANGEROUS BRAKES WORE OUT IN 4 MONTHS. NOW BRAKES ARE SQUEAKING TERRIBLY WHILE DRIVING. STOPPING EFFORT HAS INCREASED AND FEELS UNSAFE",
        "vin": "1GNSKJKCXHR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114624,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 CHEVROLET SUBURBAN. THE CONTACT STATED THAT THE BRAKES FAILED TO OPERATE PROPERLY. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER (CHEVROLET OF TURNERSVILLE, 3400 NJ-42, TURNERSVILLE, NJ 08012) WHERE IT WAS DIAGNOSED THAT THE BRAKE ROTORS FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 41,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/07/2018",
        "dateOfIncident": "02/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092369,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A FLAT TIRE ON MY LIGHT DUTY TRUCK EQUIPPED WITH TRAILERING CAPABILITY. TRUCK SPARE TIRE IS RATED FOR TEMPORARY USE ONLY AND SLIGHTLY SMALLER THAN THE TIRES ON THE TRUCK. IF THE TEMPORARY USE TIRE IS ON THE FRONT AXLE WHILE TOWING A TRAILER AT A SPEED IF 55MPH IS IT SAFE IN AN EMERGENCY BRAKING SITUATION ? IS THE MAJORITY OF WEIGHT NOW ON THE FRONT AXLE? GM TOLD ME THE SPARE IS 17 1/2'  THE REGULAR TIRES ARE 18'  THE OWNERS MANUAL ALERT THE OWNER NOT TO USE 4WD BECAUSE OF A SMALLER TIRE. IS IT SAFE ? HAD TIRE FIXED AND WENT TO COSTCO AND PURCHASED A NEW FULL SIZE TIRE TO REPLACE THE REPAIRED ONE.",
        "vin": "1GNSKHKC3HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "11/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051337,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE IN MOTION AND THE CAR SUDDENLY DIED COMPLETELY. WE WERE LATER TO LEARN THAT THE BODY CONTROL MODULE (BCM) HAD SHORTED OUT. WE LEASED THE CAR BRAND NEW AND HAD ONLY HAD IT FOR THREE MONTHS WHEN THIS OCCURRED. THANKFULLY WE WERE NOT IN A BUSY ROAD WHEN IT HAPPENED, OTHERWISE WE COULD HAVE BEEN KILLED. ON TOP OF THIS, THE CHEVROLET DEALERSHIP TO WHERE THE VEHICLE WAS TOWED TOLD US THAT IT WAS NOT COVERED UNDER WARRANTY AND REQUIRED US TO PAY TO REPLACE THE BCM (INITIALLY THEY QUOTED AROUND $700, BUT THEN AFTER WE COMPLAINED, THEY SAID THEY'LL \"SPLIT IT WITH US\" AND REDUCED IT TO AROUND $350).",
        "vin": "1GNSKGEC1HR"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/09/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040305,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THE SUBURBAN IT WAS DAYLIGHT...EVERYTHING CHECKED OUT FINE. THEN THE NEXT MORNING I WENT TO BACK OUT OF MY DRIVEWAY IN THE DARK AND ALMOST HIT A CAR. THE BACKUP CAMERA SCREEN IS SO BRIGHT YOU CANNOT SEE ANYTHING EXCEPT VERY BRIGHT LIGHT IN YOUR EYES.   THAT FIRST FEW MORNINGS I THOUGHT WELL I'LL READ THRU THE MANUAL ABOUT HOW TO ADJUST THE BRIGHTNESS. I HAVE NOW LOOKED THRU THE BOOK SEVERAL TIMES AND WE HAVE ESTABLISHED ...THERE IS NO ADJUSTMENT OFFERED..  THIS IS A DEFINITE HAZARD AND NOW I SEE FROM A SEARCH ON THE INTERNET..WE ARE NOT THE ONLY ONES WITH THIS PROBLEM. MY 2014 SUBURBAN DID NOT HAVE THIS ISSUE...SO THEY MUST HAVE CHANGED SOMETHING, THE ADJUSTMENT..BRAND OF CAMERA, SOMETHING.  THIS NEEDS TO BE FIXED BEFORE SOMEONE GETS HURT..IF A PERSON IN DARK CLOTHES WALKED BEHIND ME I COULD NOT SEE THEM BECAUSE OF THE BRIGHTNESS. SOMEONE IS GOING TO GET HURT IF THEY DON'T FIX THIS.",
        "vin": "1GNSCJKC4HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980289,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS PUT INTO REVERSE, THE REAR BACK-UP CAMERA COMES ON. THE DISPLAY OF THE CAMERA IS EXTREMELY TOO BRIGHT, AND MAKES IT DIFFICULT TO BACK UP PROPERLY WITH A GLARING LIGHT IN YOUR FACE. THERE IS CURRENTLY NOT AN OPTION TO DECREASE THE BRIGHTNESS OF THE CAMERA. I HAVE CONTACTED THE CHEVROLET DEALERSHIP IN PERSON AND THE CHEVROLET CORPORATION BY CHAT AND BY PHONE. EACH TIME, NO OPTIONS WERE PROVIDED TO ASSIST WITH THE ISSUE. WHEN I CONTACTED THE CHEVROLET CORPORATION, I WAS TOLD TO CONTACT THE NHTSA IF I FELT THAT THERE WAS AN ISSUE. I FEEL THAT THE BRIGHT DISPLAY OF THE REAR BACK-UP CAMERA COULD POTENTIALLY BE A SAFETY ISSUE, SINCE IT IMPEDES THE DRIVER'S ABILITY TO SEE CLEARLY WITH THE SIDE VIEW MIRRORS. THIS ISSUE HAS OCCURRED SEVERAL TIMES.",
        "vin": "1GNSCGKC0HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970628,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER TAILGATE HAS CLOSED BY ITSELF AND HIT PERSONS ON THE HEAD THREE TIMES IN THE FIRST TWO WEEKS FOLLOWING PURCHASE.  VEHICLE WAS PURCHASED MARCH 21, 2017, TODAY IS 4/4/17.  TAILGATE FOOT ACTIVATION HAS TRIGGERED WITHOUT FOOT MOVEMENT UNDER SENSOR, CAUSING UNWANTED OPENING OF THE TAILGATE.",
        "vin": "1GNSKJKC0HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "03/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970627,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PRESSURE IN CABIN FELT STRONGLY IN EARS AT SPEEDS BELOW 40 MPH (CITY).  WE HAVE HAD THIS PROBLEM FIRST ON A 2015 SUBURBAN, THEN A 2017 SUBURBAN PURCHASED BY OUR OFFICE LAST DECEMBER, AND NOW ON THE SECOND SUBURBAN PURCHASED MARCH 2017.  WHILE DRIVING IN CITY, PARTICULARLY OVER SLIGHTLY BUMPY ROADS, CABIN PRESSURE IS VERY STRONG AND PAINFUL TO THE EARS.",
        "vin": "1GNSKJKC0HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "01/31/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954215,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE INTERSTATE THERE WAS A LINE OF MOTORCYCLES OF AT LEAST 50. AHEAD AND BEHIND THEM WERE A FEW OF THE NEWER SUBURBANS AND TAHOES BY CHEVY/GMC. I DIDNT HAVE ISSUES WITH THE LINE AND DELAY. I HAD AN ISSUE WITH THEIR HAZZARDS/EMERGENCY LIGHTS BLINKING. WHEN THOSE VEHICLES HAVE THEIR HAZARD LIGHTS BLINKING, THE BRAKE LIGHTS DO NOT WORK WHEN THEY ARE PRESSING ON THE BRAKES!!!! SO IT IS AN EXTREME SAFETY HAZARD FOR OTHER DRIVERS WHEN THE BRAKE LIGHTS DO NOT WORK WHEN THE HAZARD LIGHTS ARE ON AND BLINKING.",
        "vin": ""
    }
]