[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Entegra Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426969,
        "products": [
            {
                "manufacturer": "Entegra Coach",
                "productMake": "ENTEGRA",
                "productModel": "CORNERSTONE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Spartan Entegra Cornerstone RV. The contact stated while starting the RV to leave a campsite, he became aware that the check engine warning light was illuminated. The contact took the vehicle to the local dealer who inspected the vehicle and diagnosed the failure as a diesel exhaust fluid (DEF) system sensor head that needed to be replaced. The dealer replaced the sensor system however, the failure recurred. The vehicle was taken back to the same dealer and the sensor was replaced again. The contact was concerned that the failure would recur. The vehicle was repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 35,000.",
        "vin": "4vzvu1e94hc"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Entegra Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387991,
        "products": [
            {
                "manufacturer": "Entegra Coach",
                "productMake": "ENTEGRA",
                "productModel": "CORNERSTONE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEF MEASURING DEVICE IN THE DEF TANK FAILED AT AROUND 27,500 MILES. THE DEF MEASURING DEVICE MEASURES QUANTITY AND QUALITY OF THE DEF FLUID. WHEN THIS DEVICE FAILS TO WORK PROPERLY, IT THROWS ECM CODES THAT START TO LIMIT THE ENGINE FOR SPEED AND WILL LIMIT THE MILES THE COACH CAN BE DRIVEN. IF THE COACH CONTINUES TO BE DRIVEN, THE ECM CAN DE-RATE THE ENGINE TO 5MPH. AS YOU CAN IMAGINE, A 45' LONG 13' TALL 8' WIDE COACH WEIGHING 45,000 LBS WHILE TOWING ANOTHER VEHICLE IS DE-RATED AND CAN TRAVEL AT NO MORE THAN 5MPH DOWN THE INTERSTATE WILL CREATE A HUGE PROBLEM FOR BOTH THE OWNER OF THE COACH AND THE TRAFFIC THAT IS TRAVELING AROUND IT. THE COACH IS BASICALLY YOUR HOME ON WHEELS, SO WHEN IT FAILS, IT LEAVES YOU STRANDED WHILE YOU TRY TO FIND A REPAIR SHOP WITH THE CAPABILITIES TO DO THE REPAIR. THEN IN OUR CASE WE HAD TO WAIT 2 WEEKS FOR THE PART DUE TO SO MANY FAILURES WITH THIS DEVICE AND THE MANUFACTURER COULD NOT PRODUCE ENOUGH TO FILL DEMAND. SEARCHING THE INTERNET OR USER FORUMS, YOU CAN EASILY FIND POSTS ABOUT THIS PROBLEM. WHEN THE DEVICE FAILS, YOU ARE STRANDED AND YOU CAN ONLY HOPE THAT WHEN IT HAPPENS, IT WILL BE IN A PLACE WHERE YOU CAN FIND A PLACE TO PULL OVER. THESE DEVICES DO NOT APPEAR READY FOR \"PRIME TIME\" AS THEY ARE FAILING FAR TOO OFTEN. I HAVE READ WHERE SOME PEOPLE HAVE SUFFERED FAILURES ON NEW COACHES WITH FEW MILES, ONLY TO HAVE IT REPAIRED AND IT FAIL AGAIN IN A FEW THOUSAND MILES. PRESSURE NEEDS TO BE PUT ON THE DEF MANUFACTURERS TO PRODUCE UNITS THAT WORK. IN OUR CASE WE HAD A 5 YEAR EMISSION SYSTEM WARRANTY. THE REPAIR COSTS RUN ABOUND 1,200 TO 2,000 TO DO A REPAIR, NOT COUNTING ANY TOWING COSTS WHICH COULD EASILY RUN INTO THE SEVERAL THOUSAND DOLLAR RANGE. THERE SHOULD BE A WAY TO ALLOW THE COACH TO BE CONTINUED TO BE USED BY DEACTIVATING THE DE-RATE OF THE ENGINE TO ALLOW A USER TO GET SAFELY TO A REPAIR FACILITY. PLEASE LOOK INTO I",
        "vin": "4VZVU1E94HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "10/14/2018",
        "fire": false,
        "manufacturer": "Entegra Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384379,
        "products": [
            {
                "manufacturer": "Entegra Coach",
                "productMake": "ENTEGRA",
                "productModel": "CORNERSTONE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OCTOBER 2018, 21199 ODOMETER READING, ON PUBLIC TWO LANE HIGHWAY, THREE FAULT CODES ANNUNCIATED.  PULLED OFF HIGHWAY ON NARROW SHOULDER WITH HEAVY TRUCK TRAFFIC PASSING.  NOT SURE WHAT WAS ISSUE WITH FLASHING CODES AND BUZZER SCREAMING. ALL CODES RELATED TO DEF SYSTEM. UNSURE HOW FAR I COULD DRIVE BEFORE VEHICLE WENT INTO LIMP HOME MODE.  DID NOT WANT IT TO HAPPEN ON ISOLATED MAJOR HIGHWAY. CONTINUED ON 20 MILES TO NEAREST RV PARK.  REPAIR REQUIRED SHAW DEVELOPMENT DEF CONTROL HEAD TO BE REPLACED IN KINGMAN, AZ.  ACTION RESULTED IN UNSCHEDULED STOP AND TRIP INTERRUPTION OF TWO WEEKS WHILE WAITING FOR REPLACEMENT PART.  JULY 2020, 30831 ODOMETER READING, SAME THREE FAULT CODES RELATED TO DEF SYSTEM ANNUNCIATED.  SHAW DEVELOPMENT CONTROL HEAD WAS AGAIN REPLACED IN MISSION, TX.  ISSUE DOES NOT APPEAR TO BE ENTIRELY CORRECTED.  NO CONFIDENCE IN 6TH REVISION OF SHAW DEVELOPMENT CONTROL HEAD.  WAITING FOR NEXT FAILURE AND HOPEFULLY NOT WHERE PERSONAL SAFETY IS COMPROMISED.",
        "vin": "4VZVU1E92HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Entegra Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363318,
        "products": [
            {
                "manufacturer": "Entegra Coach",
                "productMake": "ENTEGRA",
                "productModel": "CORNERSTONE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL DOES NOT LIMIT THE SPEED WHEN DESCENDING A GRADE. THE LOWER DROOP WHICH DECREASES THE FUEL FEED TO THE DIESEL ENGINE IS NOT EITHER WIRED OR PROGRAMMED TO THE ECM OF THE CUMMINS DIESEL BY SPARTAN ON THE SPARTAN K3 CHASSIS. DOCUMENTATION IS PROVIDED BY THE CUMMINS INSITE 7 DIAGNOSTICS PROGRAM.  ALSO INVOLVED IS ON ALL 4 OF THE SWITCH LOCATIONS FOR THE CRUISE THERE IS ELECTRICAL POWER AT EACH SWITCH LOCATION WHEN THE SWITCH IS IN THE OFF POSITION. AGAIN AS PROVIDED BY THE CUMMINS INSITE DIAGNOSTIC SYSTEM.    LATEST INCIDENT WHILE DRIVING ON US131 GOING BY CADILLAC MICHIGAN ALLOWS RV WHEN CRESTING HILL AT 67 MPH WITH CRUISE ON TO FREEWHEEL DOWN GRADE AND REACH 80 MPH AT BOTTOM OF SLOPE. IN WESTERN MOUNTAINOUS AREAS IT IS MUCH WORSE.  OUR CUMMINS MECHANIC CAN PROVIDE DOCUMENTED INFORMATION ON THIS SITUATION. *JS *JS",
        "vin": "4VZVU1E91HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "Entegra Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308285,
        "products": [
            {
                "manufacturer": "Entegra Coach",
                "productMake": "ENTEGRA",
                "productModel": "CORNERSTONE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIATOR TANK STARTED LEAKING AT A RATE OF OVER 15 QTS PER HOUR ON TRIP TO FLORIDA. KEPT FILLING WITH WATER TO GET 2 HOURS TO FINAL DESTINATION. REPLACEMENT OF RADIATOR WAS DONE AT NORTH TRAIL RV IN FORT MEYERS AT MY EXPENSE OF $6,195.34. SPARTAN MOTORS IS THE MANUFACTURER OF THE CHASSIS AND THIS IS A WELL KNOWN AND DOCUMENTED PROBLEM WITH API RADIATORS. THEY HAVE REPLACED MANY OF THEM TO DATE, MY COACH WAS JUST 6 MONTHS OUT OF WARRANTY AND THEY SAID THEY WOULD HELP ME OUT  THEY OFFERED $1,000.00 AGAINST ALMOST $6200 BILL. WHY ISN'T THE RV INDUSTRY HELD TO THE SAME ACCOUNTABILITY STANDARDS AS THE AUTO INDUSTRY?",
        "vin": "4XZVU1E99HC"
    }
]