[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "04/03/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459734,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Upon starting out on a trip and with the navigation end point plugged into the onboard 8.4 NAV system, the NAV stopped working within a mile of the house.  The arrow indicating the cars position on the map was totally wrong and the arrow did not follow the actual road.  The NAV indicated the car was going off road and even into bodies of water.  This was a dangerous issue because it required the driver to take their eyes off the road to ascertain what the issue was and cancel and restart NAV guidance.  Cancelling and restarting NAV did not help.  Once at the desired location the NAV was reset to come HOME and that failed totally.  The car is parked 40 minutes from the previous destination, but the NAV is still showing the vehicle at the previous destination.  A dealer recommended reset at home was done with no favorable results. The car has not been taken in for repairs while the internet is being searched for others that have had the same issue.  Apparently this is a common problem and potential safety issue for the driver and occupants. This issue happened without warning and there was no warning.",
        "vin": "2c3cdxjg3hh"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457834,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My airbag light came on my 2017 charger and I took it to the dealership. The dealership informed me that the seatbelt pretensioner needed to be replaced. The issue posses as a safety risk due to this device pulls a seat belt tight if there is a sudden movement or stop. A seat belt tensioner main factor increases the passenger protection afforded by the safety belts in the case of an accident.  I called my extended warranty company and they informed me that they do not cover safety vehicle issues. (I have the preferred policy). I then called Dodge Manufacture warranty and stated the concern I had being it was a safety issue and the representative Atacha stated they will not be able to cover repairs due to there has been no recall even though I express the concern of it being a safety related risk.",
        "vin": "2c3cdxbg6hh"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/02/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449058,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "As I’m driving the vehicle the Uconnect system will go haywire. Randomly switching between every button from heated seats to not allowing navigation and randomly calling 911. This issue is very distracting while driving and can cause an accident due to the constant distraction and headache. This issue has been confirmed from the manufacturer and has been denied for repair free of charge. This is outrageous as new equipment especially for a car shouldn’t have to be replaced so suddenly especially not being caused by damage but just by malfunctioning on its own. Instead the dealer and manufacturer say to buy a new one which is expensive at about $1500 which is also outrageous. This needs to be addressed as it was a huge selling point on the car that turned out not to be operational and hazardous to any driver in this car.",
        "vin": "2C3CDXCTXHH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448241,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The radio screen glitches selecting options on its own  which it controls nearly everything in the car",
        "vin": "2C3CDXGJXHH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "11/23/2021",
        "dateOfIncident": "05/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441461,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The fuse box and screen inside car is going haywire causing the headlight to go out while driving, causing the screen to blink on and off while driving constantly dialing 911, not letting you use your navigation or being able to use the back up camera. I almost got into a wreck with my newborn due to this issue!!! You can’t even use some of the safety features due to this issue. When driving at night the screen going on and off , dim to bright causes trouble seeing at night..you can’t turn the screen off because it’ll just turn right back on. I’ve seen your company has gotten multiple reports on this but no recall has been made. If we get hurt or someone else does you are aware that it can be a legal issue correct??",
        "vin": "2c3cdxctxhh"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437329,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicles uConnect system screen delaminated on its own and did not impose a safety issue at first but now it is pushing buttons and dialing SOS/911 calls while driving which serves as a distraction because I quickly have to stop it from proceeding with the SOS calls mid driving. I have contacted Dodge who, because I am out of warranty, won’t fix it. This is a very common issue and I found this out when I did a simple Google search. Many people have experienced this same issue. This should have been a recall.",
        "vin": "2c3cdxct7hh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/09/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436120,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The Uconnect radio has a defect where the touchscreen separates from the radio.  The  touchscreen starts doing phantom touches on its own and it is very startling.  It goes out of control and repeatedly changes settings and applications.  It becomes a very serious road hazard as well as health hazard.  It is distracting with the beeping noises it makes and the jumping around of the screen.  It phone dials people on it's own while I am driving.  It will also change the A/C to heat and that is not good during a Florida summer.    An additional issue is as the glue melts, it can leak onto the wiring of all the components under the screen including the AC, all the parking sensor and traction control off controls.  Yes it is available for inspection.  The dealership said the only resolution is for me to purchase a brand new radio.  This is a defect!",
        "vin": "2C3CDXCT1HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435005,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Door panel detaching at the top by the window. Passenger side first and drivers side is starting. Pinch hazard and possible additional damage due to it being loose if side airbag deploys. First noticed 9/27/21.",
        "vin": "2C3CDXJG6HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/20/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433779,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Uconnect screen is delaminating. This is a huge safety concern because the screen is used to see the backup camera, use the phone to call 911, switch vehicle option to assist in driving the vehicle and simply hearing the radio for reported hazards, weather, etc. I would have had this repaired sooner under warranty, but I was not aware that this was such an issue. The screen is continuously getting worse. I am in numerous forums that are reporting the same by hundreds or more owners of dodge, ram, Chrysler, jeep owners.",
        "vin": "2c3cdxgj7hh"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Door panels seem to be separating/coming apart.  I have a concern this could negatively affect side impact/airbag function.",
        "vin": "2C3CDXGJ0HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432170,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "interior door panel is separating from the door its self where the door and the panel meets at the top where the window is. This was first noticed on the front passenger door about 3 years ago and is now on all of the doors to some extent.   This is causing an opening and gap where fingers could get caught or foreign objects could enter the interior of the door causing possible failure or malfunction of either or both of the doors or windows.  This was addressed with the dealer who tried to say it was temperature related (as this is in the south west) and not covered under the extended warranty however, I have seen many posts from all over the country where several years and makes of dodge vehicles have similar issues.",
        "vin": "2c3cdxhg5hh"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431219,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "What component or system failed or malfunctioned, and is it available for inspection upon request?  1.) The touch screen display (UConnect 8.4 with Nav) has fluids forming under the screen that are causing 'ghost clicks'. It had started as an innocuous air bubble in the corner of the screen, then gradually spreading across half of the display. Areas within the fluid are becoming subject to ghost clicks. This part is available for inspection at most dealerships, but not repair.   How was your safety or the safety of others put at risk?  2.) While driving, the ghost clicks are causing unintended phone calls, navigation changing, and climate control interactions. This is extremely distracting while driving, and causing the driver to redirect their vision to the screen while driving. This has a high potential to cause driving accidents, as the ghost touches effect navigation, which can fluster drivers with random changes in rapid succession.   Has the problem been reproduced or confirmed by a dealer or independent service center?  3.) This is a widespread and well documented problem that is known to Dodge, and their family of dealerships. It spans across 2017/2018 vehicle models with 8.4inch UConnect displays.   Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others?  4.) Not to my knowledge.  Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear?  5.) There are no warning indications for this issue. The only sign is a small air bubble that starts in the corner, underneath of the touch screen.",
        "vin": "2C3CDXHG2HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2021",
        "dateOfIncident": "08/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429095,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Head lights flicker on and off while driving at night, also cruise control flickers on and off and sometimes needs to be shut off manually. Also Dash lights and fan and radio Flickers on and off!",
        "vin": "2C3CDXCT3HH"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/04/2021",
        "dateOfIncident": "06/09/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427745,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Dodge Charger. The contact stated while driving approximately 50 mph, there was smoke and oil coming from under the hood of the vehicle. The vehicle was driven to a nearby local mechanic who diagnosed that the engine oil cooler hose had failed and needed to be replaced. The hose was replaced, and the failure was remedied. The manufacturer was notified of the failure and the contact was informed that the VIN was not included in NHTSA campaign number: 17V496000 (Engine). The contact indicated that the vehicle had experienced the failure listed in the recall. The local dealer was not contacted. The failure mileage was 44,000.",
        "vin": "2C3CDXL95HH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "08/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427573,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have noticed this problem a Coulee times and couldn't diagnose because it would flash on the display behind the steering wheel for less than a second over the last 2-3 days driving the vehicle.  8/3/21 The issue got worse due to the message flashing flashed in longer increments,  service stability system.  I automatically got worried,  but as i climbed a mountain in Western North Carolina the message also said ABS SYSTEM,  Power steering system and turned off power steering automatically making new use force to turn the vehicle on a curvy road up to clingmans dome. The power steering got me shook as i have enough skill to not cause an accident,  but after getting down the mountain to Sevierville,  tn it got worse.  All the lights starting random flashes,  and then nothing.  No issue,  no warning lights,  nothing.  The emergency brake light came on and went off in no specific rhythm, again the abs system,  and mainly the stability system started coming on,  and power steering went off again with no reason.  I then drove to my jobsite with 0 other incidents for the next 20 minutes. I do not know the issue but it started with the stability system flashing.  The electrical seems to not be functioning correctly placing my safety at risk.",
        "vin": "2C3CDXBG6HH"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427106,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Dodge Charger. The contact stated that the interior door panels had separated from the door frame causing the locking mechanisms to malfunction and the doors would not remain secured. The failure was present on all four doors. The cause of the failures were not determined. The local dealer and manufacturer were notified of the failure. The failure mileage was 35,000.",
        "vin": "2C3CDXHG7HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "06/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425013,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Dodge Charger. The contact stated while entering the vehicle, she noticed that the door panels were detaching from the door frame. The vehicle was taken to the local dealer and the contact was informed that the door panels needed to be replaced. The vehicle was not repaired. The contact was informed by the dealer that approval was needed from the manufacturer to service the vehicle. The manufacturer was informed of the failure but offered no assistance. The failure mileage was approximately 64,000.",
        "vin": "2C3CDXCT6HH"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "06/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421427,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Delamination of the cars uconnect screen makes viewing the cars reverse camera nearly impossible causing a safety issue while reversing i cant  see if there is a kid or incoming traffic that i may be backing into this is a Comon issue that the dealer won’t replace once the car is out of warranty the vehicle hasn’t been inspected but the dealer has said that this is a Comon issue",
        "vin": "2c3cdxct8hh"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416642,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO SCREEN CONTAINS A BIG BUBBLE THAT DISABLES TOUCH AND ACCESS TO FEATURES SUCH AS MAPS, PHONES SYSTEM AND ENGINE CONTROL. THIS CAUSES THE RADIO TO CRASH AND MAKE EXTREME LOUD SOUNDS THAT YOU'RE UNABLE TO CONTROL UNLESS YOU POWER OFF THE ENGINE. WHEN TURNING THE ENGINE BACK ON THE ISSUE CONTINUES TO EXIST. THIS CAN HAPPEN AT ANY TIME WHILE DRIVING OR WHILE STARTING UP THE VEHICULE. MY RADIO HAVE MADE 2 UNWANTED CALLS TO 911 DUE TO THE SCREEN OF THE RADIO CHANGING STATIONS AND SELECTING OPTIONS ON IT'S OWN. DODGE KNOWS THIS ISSUE EXIST ON MULTIPLE YEARS AND MODELS OF THE DODGE CHARGER LINE UP AND IS NOT DOING ANYTHING TO HELP THEIR CUSTOMERS.",
        "vin": "2C3CDXHG8HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415351,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 DODGE CHARGER THAT HAS AN ISSUE WITH THE RADIO BECOMING DELAMINATED FROM THE INSIDE OF THE SCREEN. THIS IS A SAFETY HAZARD AS IT TURNS ON AND OFF, CALLS PEOPLE FROM MY PHONE, AND WILL NOT LET ME TURN THE RADIO OFF WHEN IT HAPPENS. I HAVE BEEN DRIVING AND THIS HAPPENS AND IT'S A MAJOR DISTRACTION WHEN YOUR CAR KEEPS DIALING 911 AND WILL NOT LET YOU TURN IT OFF. I CAN'T STRESS ENOUGH HOW UNSAFE THIS IS. IT GOES AGAINST ALL WARNINGS THAT DISPLAY ON RADIO WHEN POWERED ON.",
        "vin": "2C3CDXHG3HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415183,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIO TOUCH SCREEN SYSTEM PRESSES/SELECTS ALL TYPES OF BUTTONS BY ITSELF. CHANGES SCREEN SETUPS ETC.",
        "vin": "2C3CDXHG1HH"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "01/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413976,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UCONNECT 8.4 INCH SCREEN USED IN A WIDE VARIETY OF DODGE VEHICLES IS HAVING WIDESPREAD PROBLEMS WITH DELAMINATION. MY VEHICLE HAS RECENTLY SEEN BEHAVIOR MOVE FROM COSMETIC TO DANGEROUS FUNCTIONAL BEHAVIOR CHANGES. THE DELAMINATION EVENTUALLY WILL CAUSE \"GHOST\" OR \"PHANTOM\" TOUCHES ON THE SCREEN THAT OCCUR WITHOUT ANY ACTUAL USER INPUT. THIS SCREEN CAN ADJUST DRIVE MODES AND SETTINGS THAT IMPACT VEHICLE HANDLING AND POWER DELIVERY. AT WORST, THE CHANGE IN VEHICLE SETTINGS VIA GHOST TOUCHES ON THIS SCREEN COULD CAUSE UNEXPECTED CHANGES IN HANDLING DYNAMICS AND POWER DELIVERY WHICH MAY RESULT IN AN ACCIDENT AT SPEED. THIS SCREEN IS ALSO RESPONSIBLE FOR CONTROL OF RADIO AND CLIMATE, WHICH IS LIKELY TO CAUSE DISTRACTED DRIVING AS THE DRIVER ATTEMPTS TO NEGATE OR RECTIFY THE FREQUENT CHANGES BEING MADE WITHOUT THEIR INPUT. THE DEGRADATION OF THE SCREEN SEEMS TO BE A ADHESIVE MATERIAL DEFECT WHICH COULD DRIP ONTO FURTHER ELECTRONIC COMPONENTS BEHIND THE DASH, CAUSING A SHORT OR FURTHER MISBEHAVIOR OF IMPORTANT ELECTRICAL SYSTEMS.",
        "vin": "2C3CDXCT8HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "04/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407219,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IS SHAKING EVEN AFTER REPAIRS WERE  DONE.",
        "vin": "2C3CDXHG2HH"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406275,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOUCHSCREEN RADIO IS DELAMINATING. THE ENTIRE VEHICLE IS CONTROLLED BY THE RADIO. THE DELAMINATION CAUSES 'GHOST' TOUCHES ON THE RADIO. THIS CAUSES THE RADIO TO MAKE PHONE CALLS, TURN ON/OFF EQUIPMENT, BLARE MUSIC...ETC. IT'S EXTREMELY DISTRACTING TO THE DRIVER. AND YOU CANNOT TURN IT OFF. YOU ARE STUCK WITH THIS MALFUNCTION.     THIS HAPPENS AT ANYTIME THE VEHICLE IS RUNNING. WHEN PARKED OR IN GEAR.",
        "vin": "2C3CDXGJ4HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "09/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405869,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE BEEN EXPERIENCING ELECTRICAL PROBLEMS WITH MY SCREEN. IT'S AFFECTING THE USE OF MY RADIO, HEAT, DEFROST (WHICH I NEED FOR VISIBILITY).  THE DOOR PANELING IS ALSO PULLING AWAY FROM THE DOOR FRAMES.",
        "vin": "2C3CDXHG0HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "10/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400194,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE TIMING IS OFF.MECHANIC STATED THAT THE ENGINE WASN'T PUT TOGETHER RIGHT.",
        "vin": "2C3CDXHG2HH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398570,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STARTED RUNNING ROUGH, THEY DISAGNOSE THIS AS A FAILED CYLINDER HEAD.",
        "vin": "2C3CDXHG0HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/10/2021",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395537,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LESS THAN A YEAR AFTER OURCHASING NEW 2017 DODGE CHARGER RT THE DOOR PANELS ON ALL 4 DOORS STARTED TO BOW AND SEPARATE FROM THE PANEL",
        "vin": "2C3CDXCT9HH"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/04/2021",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394619,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. THE CONTACT STATED WHILE DRIVING DURING NIGHT TIME AND ATTEMPTING TO USE THE DEFROSTER, ONLY COLD AIR CAME FROM THE SYSTEM CAUSING THE FRONT WINDSHIELD TO BECOME FOGGY. THE CONTACT WAS UNABLE TO SEE THE ROADWAY CLEARLY. THE CONTACT ALSO STATED AFTER USING THE REAR BACKUP CAMERA, THE SYSTEM HAD A GLITCH CAUSING THE IMAGE TO FREEZE AND REMAIN ON THE SCREEN. THE CONTACT CALLED HARTSVILLE CHRYSLER DODGE JEEP RAM (900 E BOBO NEWSOM HWY, HARTSVILLE, SC 29550, (843) 309-9892) AND MADE THE DEALER AWARE OF THE FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED NOR REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 74,000.",
        "vin": "2C3CDXHG1HH"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390700,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. THE CONTACT STATED THAT THERE WAS AN ODOR OF FUEL AROUND THE VEHICLE. THE CONTACT STATED THAT WHEN HE WALK AROUND THE VEHICLE HE NOTICED THAT FUEL WAS POURING OUT FROM THE PASSENGER REAR WHEEL. THE VEHICLE WAS TAKEN TO ARRIGO CHRYSLER DODGE JEEP RAM MARGATE (2250 FL-7, MARGATE, FL 33063) BUT WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 38,214.",
        "vin": "2C3CDXCT3HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/08/2021",
        "dateOfIncident": "12/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387160,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD, ONLY TOUCHING THE STEERING WHEEL (AT 70 MPH), THE RADIO CHANGES STATIONS, BEEPS CONSTANTLY, & THE SEAT WARMERS ARE TURNED OFF IN THE CONTROL CENTER.  NOBODY TOUCHED ANYTHING.  THE CONTROL CENTER WON'T QUIT BEEPING AS IF SOMEONE IS CHANGING THE RADIO STATION.",
        "vin": "2C3CDXHG6HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/31/2020",
        "dateOfIncident": "12/31/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385967,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTERIOR DOOR PANELS ON ALL FOUR DOORS ARE LIFTING OFF AND PEELING AWAY FROM THE DOORS.  THE PANELS ARE PEELING MORE AND MORE EVERY WEEK.  EVENTUALLY, IT LOOKS AS THOUGH THE PANELS WILL COMPLETELY COME OFF AND EXPOSE THE INNER DOORS.",
        "vin": "2C3CDXCT3HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383155,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO CONTINUES TO BEEP & CHANGE STATIONS WHILE NOBODY IS TOUCHING ANYTHING.  THE HEATED SEAT TURNS ITSELF OFF & THE PASSENGER SIDE TEMPERATURE RANDOMLY CHANGES ITSELF WHILE NO ONE HAS TOUCHED ANYTHING ALL WHILE DRIVING DOWN THE ROAD. IT OCCURS ON CITY STREETS AND AT HIGHWAY SPEEDS ALSO.",
        "vin": "2C3CDXHG6HH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "07/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377380,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW VEHICLE HAS BEEN BROUGHT TO THE DEALER MULTIPLE TIMES FOR BREAK PROBLEMS AND SUSPENSION PROBLEMS. MORE THAN ONE CERTIFIED DEALER HAVE REPLACED DRUMS, BREAK PADS AND TIE-ROD BUSHING WITHOUT ANY SUCCESS. THE CAR SEVERELY SHAKES AT THE FRONT SUSPENSION SYSTEM WHEN BREAKING, PARTICULARLY AT HIGHWAY SPEEDS AND COMING DOWN HILLS. THE CAR HAS BEEN AT THE CAR DEALER(S) FOR AS LONG AS OVER A MONTH ON MULTIPLE OCCASIONS. A DRUMMING SOUND CAN BE HEAR WHEN VEHICLE IS EXPERIENCING THESE SYMPTOMS. TO THE DEALER'S RESPONSE (FREMONT CDJR) NO PROBLEMS ARE FOUND. LAME EXCUSES I HAVE HEARD FROM THE SERVICE DEPARTMENT: ED MORGA/SERVICE AND PARTS DIRECTOR; [XXX]/SERVICE ADVISOR AND OTHERS STATE THAT THERE ARE NOT PROBLEMS; THAT THE VEHICLE IS TOO HEAVY FOR THIS TYPE OF BREAKING; NOISE WILL GO AWAY ONCE THE PARTS WARM-UP; SERPENTINE BELT AND OTHERS. ON THE OTHER HAND, SERVICE TECHNICIANS SUCH AS [XXX]/SHOP FOREMAN; [XXX]/ SERVICE TECHNICIAN AND OTHERS HAVE DRIVEN THE CAR ALONE WITH ME FOR TESTING; AND CORROBORATING SUCH PROBLEMS TO EXIST. THESE PROBLEMS HAVE BEEN ADDRESSED TO THE DEALER SINCE THE SERVICE ON WITH 18,1403 MILES. VEHICLE HAS NOW 60,123 MILES AND THE PROBLEMS NEVER FIXED. A CARE CASE  WAS FILED WITH FORD MOTOR COMPANY WITHOUT ANY SUCCESS (CARE CASE # [XXX]). ALSO THE ELECTRONIC SYSTEM FAILS. ALL DASHBOARD LIGHTS AND COMMANDS LOCK/FREEZE OR DISAPPEAR WITHOUT WARNING, AFFECTING THE VEHICLE'S FUNCTIONALITY. DEALER STATES THAT THIS IS A SOFTWARE UPDATE ISSUE. NEVER GOT IT RESOLVED EITHER.  I'M DESPERATELY SEEKING YOUR HELP SINCE I DON'T KNOW WHERE ELSE TO TURN FOR ASSISTANCE. THESE ARE VERY SERIOUS SAFETY CONCERNS THAT THE DEALER HAS TAKING FOR GRANTED. SAFETY CONCERNS THAT MAY AWAIT A TRAGEDY FOR ME AND MY FAMILY AS WELL AS OTHER VEHICLES ON THE ROAD.  PLEASE ASSIST.   REGARDS, [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "2C3CDXHG0HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/03/2020",
        "dateOfIncident": "09/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372832,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR DOOR PANELS ON MY 2017 DODGE CHARGER ARE LIFTED FROM THE DOOR. THIS BEGAN TO OCCUR APPROXIMATELY 2 MONTHS AGO. I BELIEVE THAT THIS ISSUE HAPPENED WHEN THE CAR IS PARKED OUTSIDE.",
        "vin": "2C3CDXBG5HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372669,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC THROTTLE CONTROL APPEARS TO BE SENDING ERROR CODES TO A HUM.  THE CAR IS NOT GETTING ENOUGH FUEL TO ACCELERATE ON THE HIGHWAY.",
        "vin": "2C3CDXHG6HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2020",
        "dateOfIncident": "07/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366682,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR DEFINITELY HAS A WIRING ISSUE.  SOMETIMES THE CAR WON'T START.  IT IS NOT THE BATTERY & IT IS NOT THE STARTER. OCCASIONALLY THE RADIO WON'T WORK.  SOMETIMES WHEN YOU ARE DRIVING DOWN THE ROAD, IT LOSES ALL POWER.  SOMETIMES THE HEADLIGHTS JUST GO OUT.  NOBODY CAN SEEM TO FIND THE ISSUE.",
        "vin": "2C3CDXHG6HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "07/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365440,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. THE CONTACT NOTICED THE DASHBOARD AND REAR PASSENGER DOOR PANEL WERE RAISED. THE VEHICLE WAS TAKEN TO LARRY H. MILLER DODGE RAM AVONDALE (10101 W PAPAGO FWY, AVONDALE, AZ 85323) WHERE THE VEHICLE WAS INSPECTED AND IT WAS DETERMINED THAT THE FRONT AND REAR PASSENGER'S SIDE DOOR PANEL NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE ON THE DASHBOARD RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE WARRANTY WAS EXPIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 32,000.",
        "vin": "2C3CDXHG3HH"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364273,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SCREEN GOES OFF AND ON AT DIFFERENT TIMES WHILE DRIVING AND MY AIRBAG LIGHT KEEPS COMING ON.",
        "vin": "2C3CDXHG0HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "10/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364396,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UCONNECT 8.4INCH NAV TOUCHSCREEN HAS A GIANT BUBBLE ACROSS THE TOP THAT IS STILL EXPANDING IN SIZE. WITH THE VEHICLE RUNNING, THE TOUCHSCREEN ACTS ON ITS OWN WITHOUT OPERATOR INTERFACE, TOUCHING VARIOUS PORTIONS OF THE SCREEN AT RANDOM, DEPENDING ON THE STATUS OF THE BUBBLE. WHILE ON THE MEDIA PAGE, THE SYSTEM WILL ANNOYINGLY SWAP BETWEEN BLUETOOTH, USB, AUXILLARY SOURCES, WHILE ON THE CLIMATE SCREEN, IT WILL SWAP BETWEEN THE DIFFERENT MODES OF CIRCULATION OF AIR IN THE VEHICLE. THE SAFETY CONCERN IS IT WILL TRY TO DIAL EMERGENCY SERVICES, OR TRY TO START LAUNCH CONTROL OF THE VEHICLE. I WAS LUCKY IN THAT I DON'T HAVE THE SOS SYSTEM ENABLED, AND I WAS STATIONARY WHEN LAUNCH CONTROL WAS TURNED ON BY THE TOUCHSCREEN, BUT I AM CONCERNED FOR OTHERS WHILE THE VEHICLE MAY BE IN MOTION. I HAVE DONE SOME RESEARCH AND THIS ISSUE APPEARS TO BE WIDESPREAD ACROSS DODGE CHARGER'S AND CHALLENGER'S.",
        "vin": "2C3CDXGJ4HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355234,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UCONNECT TOUCHSCREEN RADIO HAS BEEN REPORTED ONLINE BUBBLING AND MESSING UP A COMMON ISSUE IN DODGE AND I AM BEING TOLD THIS IS MY PROBLEM TO FIX WHEN THIS IS A KNOWN ISSUE I DON'T AGREE THIS NEEDS TO BE TAKEN CARE OF.",
        "vin": "2C3CDXCT8HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351127,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER AND PASSENGER INTERIOR DOOR PANELS ARE WARPING NEAR THE WINDOW SEAL.  THE INTERIOR OF THE DOOR ASSEMBLY IS EXPOSED WHICH WILL LIKELY CAUSE ADDITIONAL PROBLEMS.  A SIMPLE SEARCH ON THE INTERNET REVEALS THAT THIS IS A VERY COMMON PROBLEM.",
        "vin": "2C3CDXJG4HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349011,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. THE CONTACT STATED THAT WHILE IN THE VEHICLE, THE FRONT PASSENGER'S AND FRONT DRIVER'S DOOR PANEL DETACHED FROM THE DOOR FRAME. THE VEHICLE WAS TAKEN TO THE DEALER VICTORVILLE MOTORS (14617 CIVIC DR, VICTORVILLE, CA 92394, (760) 843-8317) WHERE BOTH THE DRIVER'S AND PASSENGER'S DOOR PANELS WERE INSPECTED AND IT WAS CONFIRMED THAT THE DOOR PANELS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, HOWEVER NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000.",
        "vin": "2C3CDXHG1HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/10/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344322,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. THE CONTACT STATED THE DRIVER'S SIDE AND PASSENGER'S SIDE DOOR PANELS WERE SEPARATED AT THE TOP OF THE DOOR FRAME. THE CONTACT CALLED FIELDS CHRYSLER JEEP DODGE SANFORD (750 TOWNE CENTER BLVD, SANFORD, FL 32771, (407) 878-7710) HOWEVER, THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "2C3CDXBG1HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/09/2020",
        "dateOfIncident": "08/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11344251,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER DOOR PANEL LIFTING. YOU CAN SEE THE WHITE BODY DOOR FRAME FROM THE OUTSIDE OF THE WINDOW.",
        "vin": "2C3CDXHG3HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343237,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HIS WIFE WHO OWNS A 2017 DODGE CHARGER. THE CONTACT STATED THAT THE PASSENGER SIDE DOOR PANEL WAS DETACHED FROM THE DOOR FRAME. THE CONTACT ALSO STATED THAT THE HOME SCREEN WAS DEFECTIVE AND THAT AN AIR BUBBLE HAD FORMED ON THE TOP OF THE SCREEN. THE CONTACT TOOK THE VEHICLE TO WAYNESBORO CHRYSLER DODGE JEEP RAM (480 HIGHWAY 25 NORTH, WAYNESBORO, GA 30830) WHERE HE WAS INFORMED THAT THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE VEHICLE HAD YET TO BE REPAIRED. THE FAILURE MILEAGE WAS 38,000.",
        "vin": "2C3CDXHG4HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342430,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSAGE SIDE DOOR PANEL IS PEELING ON MY 2017 DODGE CHARGER. 11",
        "vin": "2C3CDXBG0HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340243,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR PANELS LIFTING ALONG WINDOWS",
        "vin": "2C3CDXCT4HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/27/2020",
        "dateOfIncident": "06/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331266,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR PANEL IS PEELING OFF.  *TR",
        "vin": "2C3CDXBG8HH"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329133,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR PASSENGER DOOR SEPARATING DOOR PANEL. SHOWING THE LOCKING MECHANISM AND INSIDE DOOR PARTS. 2017 CHARGER. CAR IS ONLY 3 YEARS OLD. HAVE READ MANY PEOPLE HAVE THE SAME PROBLEM. DOOR PANEL SEPARATES WHERE IT MEETS THE GLASS WINDOW.$1000 TO FIX ACCORDING TO DODGE . REALLY ?? VEHICLE WAS PARKED.  *TR",
        "vin": "2C3CDXHGXHH"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2020",
        "dateOfIncident": "05/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327991,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR BRAND NEW IN 2017, A MONTH AGO I NOTICED WHAT LOOKED LIKE A WATERMARK IN THE SCREEN OF MY RADIO, IT IS STRETCHING ACROSS THE SCREEN. I USE THIS TO MAKE PHONE CALLS SINCE WE ARE NO LONGER ALLOWED TO USE OUR CELL PHONES. WHEN I CALLED THE DEALER THEY SAID THAT THE 2017 DODGE CHARGER HAS BEEN HAVING THIS ISSUE AND THAT IT SHOULD BE COVERED UNDER WARRANTY AND SINCE THEY ARE AWARE OF THE DEFECT THEY SHOULD FIX IT AT NO CHARGE. THEY CAN'T JUST REPLACE THE SCREEN THEY HAVE TO REPLACE THE WHOLE RADIO AND IT IS ALMOST 2,000$. WHEN I CALLED THE DODGE REPAIR SHOP WHERE I LIVE THEY SAID THEY WOULD REACH OUT TO DODGE SINCE THIS HAS BEEN A MAJOR ISSUE WITH THIS VEHICLE AND SEE IF THEY WOULD FIX IT. MY VEHICLE WAS STATIONARY WHEN I NOTICED THE PROBLEM.  *TR",
        "vin": "2C3CDXHG7HH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321668,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EVAP HAS SYSTEM HAS A SMALL LEAK. MY GAS IS LEAKING FROM THE OPPOSITE SIDE OF THE GAS TANK .THE CHECK ENGINE LIGHT JUST CAME ON. THE GAS LEAKED 2 WEEKS AGO AND NOW THE CHECK ENGINE LIGHT IS ON AND I KEEP SMELLING GAS .THE CAR WAS STATIONARY.*DT*JB",
        "vin": "2C3CDXHG5HH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316417,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 DODGE CHARGER. THE TRANSMISSION TAKES TOO LONG COMING OUT OF SECOND GEAR. THE VEHICLE JERKS AND HESITATES VIOLENTLY. ALSO, THE VEHICLE HESITATES WITHOUT WARNING HAPPENS WHEN THERE IS TRAFFIC. WHEN COMING TO A STOP AND NEEDING ACCELERATE IT WILL NOT GO AND THE GEARS WILL GET STUCK.",
        "vin": "2C3CDXCT1HH"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "02/24/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11312248,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ABOUT TWO CAR LENGTHS BEHIND AN 18 WHEELER ON HWY 231 SOUTH BOUND IN MONTGOMERY, ALABAMA. I WENT TO GET OVER TO THE LEFT TO PASS, WHEN MY VEHICLE STARTED TO HYDROPLANE AND SWAY SIDE TO SIDE. MY FRONT RIGHT SIDE OF MY VEHICLE IMPACTED THE BACK RIGHT CORNER OF THE 18 WHEELER. MY VEHICLE THEN FLIPPED ON ITS SIDE, THEN UPSIDE DOWN. MY SIDE AIRBAGS DID DEPLOY, BUT MY STEERING WHEEL NOR FRONT PASSENGER AIRBAG DEPLOYED. THE 18 WHEELER DID NOT STOP, MAYBE IT DID NOT FEEL THE IMPACT. IT WAS A WET AND STORMY MORNING ON 2/24/20, @ APPROXIMATELY 5:25-5:27 A.M.. THE REASON THAT I DID NOT PASS THE 18 WHEELER EARLIER WAS DUE TO STANDING WATER IN THE LEFT LANE.    I WAS TAKEN TO BAPTIST SOUTH MEDICAL VENTER BY MY MOTHER IN LAW, IN WHICH I HAD A CT DONE ON MY NECK, AND AN X-RAY ON MY LEFT SHOULDER. I ALSO MADE AN APPOINTMENT FOR WEDNESDAY 2/26/20 FOR PAIN AND SPASMS.    MY COMPLAINT IS THAT THE VEHICLE'S IMPACT WAS IN THE FRONT, AND THE AIRBAGS DID NOT DEPLOY IN THE FRONT. I WOULD LIKE THERE TO BE AN INVESTIGATION AS TO WHETHER THEY SHOULD'VE DEPLOYED, AND IF WHY DIDN'T THEY IN SUCH AN SEVERE ACCIDENT.*DT  *TR*DT*JB",
        "vin": "2C3CDXBG2HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297302,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER DOOR INTERIOR COVERING IS SEPARATING FROM DOOR FRAME.  NO GLUE RESIDUE APPARENT ON SUBFRAME OF DOOR.  DEALER INFORMS PARTS ARE UNAVAILABLE UNTIL POSSIBLY MARCH 2020.  PROBLEM REPORTED JULY 2019.",
        "vin": "2C3CDXL98HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269473,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE ON A CHICAGO STREET 40 DEGREES OUT, AND MOONROOF SPONTANEOUSLY SHATTERED AND EXPLODES. REALLY SHOULD BE A RECALL ON THIS CALLED CHRYSLER AND THEY WANT TO ACCEPT RESPONSIBILITY.",
        "vin": "2C3CDXGJ3HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265752,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE FRONT DOOR PANEL SEPARATING AND EXPOSING THE DOOR LOCK MECHANISM AND OTHER PARTS OF THE DOOR MECHANISM. IT WAS SITTING IN A PARKING LOT WHEN IT SEPARATED.",
        "vin": "2C3CDXHG6HH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254613,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A DODGE CHARGER WITH A 5.7 ENGINE AND AFTER IT SETS FOR A FEW DAYS AND THEN I START IT THE ENGINE PECKS FOR A COUPLE OF MINUTES THEN STOPS IT STARTED DOING THIS AROUND 19,000 MILES AND HAS BEEN GETTING WORSE, IT NOW HAS 22,000 MILES ON IT!",
        "vin": "2C3CDXCT3HH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246363,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. THE CONTACT STATED THAT THE TRANSMISSION TOOK TOO LONG COMING OUT OF SECOND GEAR. THE VEHICLE JERKED AND HESITATED VIOLENTLY. ALSO, THE VEHICLE HESITATED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO PORT LAVACA DODGE (1901 HIGHWAY 35 SOUTH, PORT LAVACA, TX 77979, (361) 693-5195), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO TAKE THE VEHICLE TO THE DEALER. THE FAILURE MILEAGE WAS 32,000.",
        "vin": "2C3CDXHGXHH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234852,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, MY UCONNECT SCREEN IS FAULTY AND GLITCHES OUT AND CHANGES SETTINGS, TEMPERATURE, RADIO STATIONS, TURNS MY SEAT WARMERS ON AND BASICALLY WHATEVER ELSE IT PRESSES ON BY ITSELF. IT HAPPENS WHILE THE VEHICLE IS BOTH IN MOTION AND IDLE. THE INCIDENT STARTED HAPPENING RANDOMLY FOR NO APPARENT REASON AND I STILL HAVE NO CLUE AS TO WHAT COULD HAVE CAUSED IT.",
        "vin": "2C3CDXHG5HH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218390,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I DISCOVERED A BREAK IN ONE OF THE  PLASTIC ' WHEEL SKINS' ON MY CAR.  I INQUIRED ABOUT REPLACING THE WHEEL SKIN AND DISCOVERED I CAN'T REPLACE IT AND INSTEAD I WOULD NEED TO BY A NEW RIM INSTEAD. THERE IS NOTHING WRONG WITH MY RIM SO NO NEED TO REPLACE IT. MY COMPLAINT IS WE ARE MADE TO BUY NEW RIMS WHEN THESE PLASTIC WHEEL SKINS BREAK DOWN EVEN THOUGH OUR RIMS ARE I PERFECTLY GOOD CONDITION.",
        "vin": "2C3CDXHG7HH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "10/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194373,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAD PROBLEMS JUST AFTER THE 1 YEAR MARK. IN OCTOBER 2018 FILLED THE GAS TANK AND BEGAN TO PULL AWAY FROM THE PUMP, AT THIS TIME THE CAR WAS IN \"DRIVE\" BUT DOWN-SHIFTED INTO WHAT FELT LIKE NEUTRAL. AN ERROR CODE RAN ACROSS THE DASH SAYING \"PUSH P TO PARK, SELECT DESIRED GEAR\".  I PUT IT IN PARK AND TURNED IT OFF THEN ON AGAIN. THIS HAPPENED  TWICE BUT IT STILL DID IT. I PARKED THE CAR, TURNED IT OFF AND HAD IT TOWED- DEALER SAID IT WAS FINE, AND WASN'T THROWING ANY CODES AND LET ME DRIVE AWAY. NOT 5 MILES DOWN THE ROAD AND IT STARTED SMELLING OF GAS AND WAS RIDING VERY ROUGH AND BACKFIRING. I PULL OVER TO THE NEAREST NEXT DEALERSHIP AND THEY NOTICE THAT GAS IS POURING OUT THE BACK OF THE CAR. DIAGNOSED AS AN 'OVERFILLED CHARCOAL CANISTER' STATING THAT I OVERFILLED THE GAS TANK. WAS REPAIRED, I HAD TO SUBMIT TO HAVE IT COVERED UNDER WARRANTY. I GET THE VEHICLE BACK AND NOT 2 MONTHS LATER THE EXACT SAME ISSUE AFTER FILLING TANK WITH GAS. GAS IS POURING OUT THE BACK, GAS GAUGE IS GOING CRAZY RISING AND FALLING AND FINALLY DROPPING OFF AS GAS POURS OUT THE BACK. HAD IT TOWED AGAIN AND REPAIRED AT A 3RD DEALERSHIP. GIVEN BACK TO ME AND TOLD IT WAS COVERED UNDER WARRANTY BUT THAT WE OVERFILLED THE TANK. HAPPENED A THIRD TIME NOT 3 MONTHS LATER AND FINALLY THE ENTIRE GAS TANK WAS REPLACED. BROUGHT IT HOME AND WAS TOLD I SHOULD BE ABLE TO FILL IT, AS THE FIRST TWO TIMES IT WAS LIKELY A SENSOR IN THE GAS TANK CAUSING THE ISSUES. THE CAR SMELLED OF GAS AGAIN WHEN I STOPPED TO FILL THE TANK ON THE WAY BACK FROM THE DEALERSHIP. MY HUSBAND PULLED THE SEATS BACK AND HAD TO SOAK UP THE OVERFLOW FROM THE CANISTER HIMSELF- I DON'T FILL THE TANK ALL THE WAY ANYMORE FOR FEAR OF A FIRE. MY DAUGHTER COMPLAINS OF HEADACHES WHEN IN THE CAR- WONDERING IF ITS RELATED TO THE POOLING GAS UNDER HER CARSEAT. VERY CONCERNED THAT THIS IS NOT BEING TAKEN SERIOUSLY BY DODGE.",
        "vin": "2C3CDXCT5HH"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "02/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174403,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY I'VE BEEN HAVING SOME ISSUES WITH MY VEHICLE WITH IT TURNING ON AND OFF WHEN I FIRST GO TO START IT UP. NOW I AM HAVING A BIGGER ISSUE BECAUSE THE CAR DECIDED TO TURN OFF ON ME MULTIPLE TIMES WHILE DRIVING. LUCKILY I AM FULLY AWARE OF WHAT IS HAPPENING TO ME WHILE DRIVING. I'VE TAKEN IT TO DODGE AND THEY SEEM TO NOT CAR OR EVEN TRY TO FIGURE OUT WHAT IS WRONG BECAUSE I CAN NOT REENACT THE PROBLEM, EVEN THOUGH I HAVE VIDEO OF IT NOT STARTING UP IN THE BEGINNING. SIMPLY BECAUSE THERE ARE NO CODES THAT COME UP, WHICH OF COURSE MAKES IT EASIER ON THEM TO JUST PUSH THE CUSTOMER AWAY. NOW IN MY OPINION I FEEL LIKE THIS CAN BE A LIFE AND DEATH SITUATION IF SOMEONE LIKE MY MOTHER OR MY GRANDMA OWN THE VEHICLE BECAUSE THEY WOULD NOW KNOW HOW TO CONTROL SUCH A HEAVY VEHICLE. I BELIEVE DODGE SHOULD LOOK DEEPER INTO THIS PROBLEM CONSIDERING THE FACT THAT THERE ARE A LOT OF FORUMS ONLINE SUGGESTING A PROBLEM.",
        "vin": "2C3DXCT4HH5"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171802,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BULLETIN ON MOPAR WEBSITE IS IN REGARDS TO ELECTRICAL PANEL. NOT ONCE WAS THERE A RECALL. STARTING ON 1/23/19 MY HUSBAND WAS DRIVING AND THE STEERING WHEEL LOCKED ON HIM AND HE COULDN'T MOVE THE VEHICLE. THE POWER STEERING WARNING CAME ON. WE TOOK IT TO A DEALERSHIP THEY SAID OH IT'S THE POWER STEERING ASSEMBLY MODULE BUT YOU'RE PAST MILEAGE FOR COVERAGE. SO I CALL MOPAR THEY GET ANOTHER DEALERSHIP ON THE LINE WE SET UP AN APPOINTMENT. TODAY 1/24/19 MY HUSBAND IS DRIVING TO CLASS IN MORNING TRAFFIC THE VEHICLE SHUTS OFF ALL CAPABILITY'S TO STEER BRAKE DO ANYTHING. THE VEHICLE LUCKILY CAME ON LONG ENOUGH TO MOVE TO SIDE OF ROAD THEN THE VEHICLE AGAIN SHUT OFF HE COULDN'T BRAKE VEHICLE JUST KEPT MOVING THEN EVENTUALLY IT STOPPED AND SHUT OFF ON IT'S OWN.  HE WAS DRIVING ON DALLAS NORTH TOLLWAY IN MORNING TRAFFIC AND TRAFFIC ISN'T LIGHT THE THOUGHT OF HIM BEING REAR ENDED AND SOMETHING MORE HAPPENING IS DISHEARTENING KNOWING THEY KNEW THEY HAD ISSUES WITH THE ELECTRICAL PANEL BUT DIDN'T DO A RECALL",
        "vin": "2C3CDXGJ2HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/08/2019",
        "dateOfIncident": "01/06/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165165,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEEMS HEAT ELEMENT CREATED A BURN AND REAR WINDSHIELD SHATTERED.  THE CAR HAD BEEN PARKED IN GARAGE FOR OVER 8 HOURS WHEN WE HEARD A POP LIKE A GUN THE WINDOW CRACKED FOR SOME TIME AND YOU HEARD GLASS CHATTERING CAR WAS NEVER ENTERED OR STARTED AFTER BEING PULLED IN FROM WORK THAT DAY.",
        "vin": "2C3CDXCT6HH"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/23/2018",
        "dateOfIncident": "11/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153366,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT REAR SEAT BELT BECAME LOCKED OUT WHILE UNBUCKLED DURING A STOP AT A RESTAURANT. WE RETURNED TO THE CAR TO FIND IT WOULDN'T RELEASE SO WE COULD BUCKLE UP TO CONTINUE OUR JOURNEY. WE TRIED LOOSENING THE SMALL PART THAT WAS ON A BOOSTER SEAT AND IT RETRACTED BUT STILL REFUSED TO RELEASE. THE SEAT BELT IS UNUSABLE AT THE MOMENT. WILL VISIT A DEALER.",
        "vin": "2C3CDXGJ3HH"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142292,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW SHATTERED WHILE DRIVING DOWN ROAD",
        "vin": "2C3CDXJG6HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "10/17/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141349,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL FIRE:  OPENED CAR TO GO TO WORK IN THE MORNING 10/17/18 AND FOUND THAT INSIDE MY CAR IT WAS COVERED IN SOOT. THEN NOTICED ARM REST CONSOLE WAS MELTED AND UNDERNEATH WAS MELTED DOWN; EXPOSING WIRES. ALSO UPPER LIGHT IN TOP, FRONT, CENTER WAS MELTED (FROM HEAT). CAR WAS PARKED IN DRIVE WAY OF MY HOME. THANKFUL WINDOWS WERE UP SO NO OXYGEN COULD FUEL THE FIRE. THIS COULD HAVE CAUSED MORE DAMAGE TO THE VEHICLE AND POSSIBLY CAUGHT THE HOUSE ON FIRE WITH MY FAMILY INSIDE.   VEHICLE HAS BEEN TOWED TO DODGE WHERE THEY STATED AN INVESTIGATION HAS TO BE OCCUR BEFORE THEY WILL HELP US OR LOOK INTO WARRANTY (WHICH WE HAVE).    CPSC: 11/6/2018 UPDATE *DT  *JS",
        "vin": "2C3CDXCT3HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122806,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. THE CONTACT STATED THAT THERE WAS A PROGRESSING FAILURE WITH THE FACTORY OEM RIMS, WHICH WERE INTERNALLY AFFECTING THE STEMS OF THE TIRES WITH THE PRESENCE OF A CRACK. THE FRONT PASSENGER AND REAR PASSENGER SIDE RIMS WERE CRACKED AND THE TIRE PRESSURE MONITORING SYSTEM INDICATOR FLASHED. THE CONTACT ADDED AIR TO BOTH TIRES, BUT THE FAILURE RECURRED. THE DEALER (BERGLUND CHRYSLER JEEP DODGE RAM, 2525 FRANKLIN RD SW, ROANOKE, VA 24014, (540) 345-9881) WAS MADE AWARE OF THE FAILURE MORE THAN TWICE, BUT FAILED TO PROVIDE A PERMANENT REMEDY. IN ADDITION, THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V332000 (ELECTRICAL SYSTEM, VEHICLE SPEED CONTROL) AND WAS TO CHECK WITH THE MANUFACTURER TO DETERMINE WHEN THE DEALER WOULD SCHEDULE THE RECALL REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 3,000. *TT  CONSUMER STATED ON AROUND THE 1ST OF JUNE, 2018 WHEN I WAS AT WORK THE CAR WAS FINE AT ABOUT 5 O'CLOCK THE INDICATE LIGHT FLASHED LOW PRESSURE ON THE RIGHT REAR TIRE, STOP AT REPAIR SHOP TO CHECK TIRE FOUND CRACK ON INSIDE OF WHEEL AT BEAD, CHECKED WITH DEALER AT BERGLUND CHEVORLET, JEEP AND DODGE RAM AT 2525 FRANKLIN RD NW. ROANOKE,VA 24014, WAS TOLD THE 36 MONTH WARRANTY DID NOT COVERED THE WHEELS. I CHECKED BACK ON 2ND WHEEL AND TOLD SAME THING. IF THE WHEEL HAD CRACKED ON HIGHWAY AND COULD HAVE SPUN OUT OF CONTROL CAUSING A SERIOUS ACCIDENT TO MYSELF OR OTHERS!!! UPDATED 10/17/18*JB",
        "vin": "2C3CDXCT0HH"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114154,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. WHILE DRIVING AT AN UNKNOWN SPEED, AN ABNORMAL WINDING NOISE WAS HEARD. THE CONTACT NOTICED THAT THE HOOD LATCH WAS CORRODED. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO THE LOCAL DEALER. THE FAILURE MILEAGE WAS 9,000.",
        "vin": "2C3CDXGJ1HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099983,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE CHARGER. ON SEVERAL OCCASIONS, WHILE DRIVING VARIOUS SPEEDS, THE RADIO CONSOLE THAT CONTROLLED THE GPS, RADIO FEATURES, AND THE DEFROST FUNCTIONS BECAME INOPERABLE. THE CONTACT STATED THAT THE SCREEN WOULD OCCASIONALLY FREEZE OR DISPLAY A BLANK SCREEN. THE VEHICLE WAS TAKEN TO FERMAN CHRYSLER JEEP DODGE RAM OF NEW PORT RICHEY (4023 US-19, NEW PORT RICHEY, FL 34652, (727) 847-5555) WHERE IT WAS DIAGNOSED THAT THERE WAS A SOFTWARE UPDATE AVAILABLE TO REMEDY THE FAILURE. THE FAILURE RECURRED AND THE DEALER STATED THAT THE RADIO CONSOLE NEEDED TO BE REPLACED. THE RADIO CONSOLE WAS NOT REPLACED. THE FAILURE WAS INTERMITTENT. THE MANUFACTURER WAS CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 6,000. *TT    THE CONSUMER STATED THE DEALER REPLACED THE RADIO CONSOLE. *JS",
        "vin": "2C3CDXGJ6HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2018",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097729,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED VIBRATION AROUND 10,000 MILES TOOK IN TO LOCAL DEALERSHIP THAT DOES MY OIL CHANGES/ROUTINE MAINT.WENT AHEAD HAD OIL CHANGED,ROTATED/BAL TIRES, STILL HAD VIBRATION TOOK IT BACK IN, ALIGHNE FRONT END, THEY COULD NOT GET TO IT THAT DAY HAD A CITY DUMP TRUCK ON MACH WAITING ON PART SO I DROVE IT TO CHATTANOOGA TN WHERE I PURCHASED IT TOLD THEM IT FELT LIKE A BELT MIGHT BE BROKEN IN TIRE  HAD A PROMINENT VIBRATION LEFT IT SOMETIME THE NEXT WEEK WAS CALLED IT WAS READY THIS WAS IN OCT 2017 IT STILL HAD VIBRATION BETWEEN OCT 2017/JAN 2018 IT WENT BACK AND FORTH 5 TIMES TO CROWN DODGE OF CHATTANOOGA I WAS TOLD SOMETHING DIFFERENT EVERY TIME I PICKED CAR UP,,  FROM I WAS FEELING IT DOWN SHIFT, IT WAS BREAKING IN POINT,I NEEDED TO RUN ADDITIVE THROUGH ENGINE I HAD BOUGHT  BAD GAS   I OPENED UP A CASE WITH DODGE IN THIS 4 MONTH TIME FRAME.    JAN 2018 AT 14,000 PLUS MILES I WAS TOLD IT WAS IN FACT THE TIRES THEY WERE CUPPING AND BRIDGESTONE/FIRESTONE WOULD NOT MAKE THEM UP DUE TO I HAD NOT KEPT UP MY ROUTINE MAINT I DO HAVE ALL COPIES OF MANIT ON CAR.  IT WAS ONLY SERVICED BY DODGE DEALERSHIP , IT HAS NOT BEEN HOT RODED, RACED, OR MISTREATED I OWN A $40,000 PLUS CAR THAT HAD 14,770 MILES ON IT I COULD NOT EVEN DRIVE IT IN THE RAIN!!!!!!!  IAM FILING THIS COMPLAINT BECAUSE NOT OF A CRASH BUT COULD EASILY BEEN  I HAVE PURCHASED A NEW SET OF TIRES AT A 50% DISCOUNT AND STILL COST $800  I NEVER IN MY LIFE, FELT SO DISAPPOINTED THIS IS BAD BUSINESS BOTTOM LINE!! FOR BRIDGESTONE AND DODGE  I DIDN'T PICK THESE TIRES, YALL DID I INTRUSTED YOU AS A TIRE MANFACTURE AND DODGE AS A CAR COMPANY TO PUT THE BEST PERFORMANCE SPEED RATED TIRE FOR MY CAR  ON THAT CAR  I LIVE IN SEWANEE,TN ABOUT AN HOUR FROM YOUR LA VERN TENN PLANT  I ALWAYS TRY TO STAY USA BUT IF THIS IS WHAT MY HARD EARNED MONEY GETS ME , ITS A SAD DAY IN THIS WORLD  HOW WOULD YOU FEEL IF YOU WERE ME?",
        "vin": "2C3CDXCTXHH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/10/2018",
        "dateOfIncident": "03/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093254,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I GET REPEATED WEATHER ALERTS FROM U-CONNECT SCREEN SYSTEM.  THE ALERTS COME FROM SERIUS SATELLITE TRAVEL LINK SYSTEM.  THEY POP UP AND BLOCK WHATEVER IS DISPLAYED ON THE SCREEN LIKE RADIO OR MAPS.  THEY CONTINUE TO BLOCK THE SCREEN UNTIL THE DRIVER REACHES OVER TO TURN THEM OFF - DISTRACTING THEIR EYES AND HAND FROM DRIVING!  NEITHER  SERIUS OR DODGE  ARE UNWILLING OR UNABLE TO TURN THEM OFF.  DURING A RECENT WINTER STORM THIS WAS VERY HAZARDOUS BECAUSE MANY ROADS WERE CLOSED AND I COULDN'T FIND A WAY HOME BECAUSE THE ALERTS WERE SO FREQUENT THEY CONTINUOUSLY BLOCKED THE MAP APP - AS I WAS TRYING TO DRIVE HOME.",
        "vin": "2C3CDXJG7HH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "10/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088904,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISE FROM THE REAR DIFFERENTIAL AREA. WHEN GOING SPEEDS OF 65+ MPH THERE IS A HOWLING/WHINING NOISE THAT IS CONSTANT. WHEN I LET OFF THE GAS IT GOES AWAY. WHEN I GET BACK ON THE GAS IT COMES BACK. I HAVE HAD THE REAR DIFF REPLACED AND HAVE HAD IT IN MULTIPLE TIMES FOR DIAGNOSTICS/FLUID CHANGES WITH NO FIX IN SITE. FCA TOLD ME, TO BAD, THAT IS A NORMAL NOISE AND THERE IS NOTHING ELSE WE CAN DO TO FIX THE ISSUE. A BRAND NEW CAR WITH AN OLD CAR NOISE? UNACCEPTABLE. I HAVE VIDEOS, REPAIR DOCUMENTATION SHOWING THE NOISE. *TT  *TR",
        "vin": "2C3CDXGJXHH"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/10/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SPEEDING ABOUT 80MPH AND HIT THE BREAKS AND MY SEAT BELT LOCKED WHEN I STOPPED AND IT NEVER UNLOCK I HAD TO GET EMERGENCY TO COME AND CUT OFF MY SEAT BELT AND MY STEERING WHEEL LOCKED UP",
        "vin": "2C3CDXGJ2HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061186,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"SEVERE WEATHER ALERTS\" THAT SHOW UP ON THE RADIO SCREEN FOR WEATHER THAT IS HUNDREDS IF NOT THOUSANDS OF MILES AWAY ARE DISTRACTING AND DANGEROUS.  THE ONLY WAY TO CLEAR THE ALERTS IS TO TAKE YOUR HAND OFF THE WHEEL AND USE THE TOUCH SCREEN.  THESE ALERTS ARE GENERATED BY THE SIRIUS XM TRAVEL LINK APP AND SIRIUS IS UNABLE, OR MORE LIKELY, UNWILLING TO DISABLE THE ALERTS EVEN WHEN ASKED.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051461,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DEFECT IN THE FABRICATION IN ALL THE HOODS OF THE DODGE CHARGERS THAT CAUSES THE HOOD LATCH PIN TO CORRODE.  MY CHARGER IS BRAND NEW AND HAS CORROSION ON THE HOOD.  THIS IS A WIDESPREAD PROBLEM.  LET UNCHECKED, THIS COULD CAUSE ACCIDENTS IF THE HOOD CORRODES ENOUGH TO WHERE THE LATCH PIN BECOME DETACHED FROM THE HOOD WHILE DRIVING.",
        "vin": "2C3CDXGJ5HH"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11046924,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER I PURCHASED A NEW VEHICLE I NOTICED A STRONG FUEL SMELL OUTSIDE AND INSIDE MY CAR AND WHEN THE AIR WAS ON THE SMELL WAS COMING THROUGH THE AIR VENTS.  I BROUGHT IT IN THE DEALERSHIP AND THEY SMELLED THE GAS OUTSIDE THE CAR.  THEY PULLED UP MY BACKSEATS AND THERE WAS A PUDDLE OF GAS THAT LEAKED FROM THE FUEL PUMP.  THEY REPLACED THE FUEL PUMP AND A FEW DAYS AFTER GETTING MY CAR BACK WHEN I FILLED UP MY TANK AGAIN THE SAME THING HAPPENED AND THIS TIME IT WAS LEAKING GAS FROM THE BOTTOM OF MY CAR.  AFTER THAT 2ND REPAIR I GOT MY CAR BACK AGAIN A FEW DAYS LATER AFTER I FILLED UP MY TANK AND THE SAME THING HAPPENED.  THE 3RD TIME THEY ENDED UP REPLACING THE GAS TANK.  THE CAR STILL HAS A STRONG GAS SMELL THAT CAUSES ME TO HAVE HEADACHES, DIZZINESS, AND NAUSEA.  I DO NOT FEEL SAFE IN MY CAR BECAUSE LATELY SINCE I'VE BEEN HAVING THESE PROBLEMS WITH THE CAR LEAKING GAS I'VE BEEN GETTING ALOT OF STATIC SHOCK WHEN I TOUCH MY CAR.",
        "vin": "2C3CDXHG2HH"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039971,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UCONNECT INFOTAINMENT SYSTEM IN FCA VEHICLES HAS A DEFECT THAT WILL CAUSE MULTIPLE WEATHER ALERTS FOR AREAS HUNDREDS OF MILES AWAY.  THE ERRANT WEATHER ALERTS TAKE OVER THE ENTIRE SCREEN AND REQUIRE THE DRIVER TO TAKE THEIR EYES OFF THE ROAD TO EXIT OUT OF THE ALERT.  THE ALERT WILL NOT GO AWAY ON IT'S OWN, AND YOU CANNOT CONTROL THE RADIO OR HVAC SYSTEM WITHOUT READING AND EXITING OUT OF THE ALERT.  ALSO, THE UCONNECT SYSTEM HAS NO OPTION TO DISABLE WEATHER ALERTS.  IN OTHER WORDS, YOU CANNOT STOP THEM FROM HAPPENING IN THEIR CURRENT BUILD.  I'VE CALLED DODGE AND UCONNECT MULTIPLE TIMES, AND THERE IS STILL NO RESOLUTION.  ALL THAT NEEDS TO HAPPEN IS UCONNECT NEEDS TO ADD THE OPTION IN THE SETTINGS TO TOGGLE WEATHER ALERTS ON OR OFF.  IT SHOULD TAKE A PROGRAMMER AN HOUR TO ACCOMPLISH THIS SIMPLE TASK.  JUST TODAY I GOT 4 WEATHER ALERTS FOR COUNTIES BETWEEN 140 AND 400 MILES AWAY FROM MY CURRENT LOCATION ON MY 5 MILE DRIVE, EACH ONE REQUIRING ME TO PHYSICALLY CLOSE THE SCREEN TO GET BACK TO THE NAVIGATION PAGE.  FORCING DRIVERS TO READ AND INTERACT WITH MULTIPLE DEFECTIVE WEATHER ALERTS CAN BE AS DANGEROUS AS TEXTING AND DRIVING.  WHEN I CALLED DODGE, THEY SAID THE ISSUE IS WITH UCONNECT.  UCONNECT TOLD ME NOTHING CAN BE DONE.  WHEN I MESSAGED DODGE, THEY TOLD ME SIRIUS XM IS TO BLAME FOR SENDING THE ALERTS.  SO WE HAVE A 3 WAY FINGER POINTING CONTEST HERE THAT NOBODY WANT TO ACCEPT RESPONSIBILITY FOR.  ALL I WANT IS FOR UCONNECT TO GIVE DRIVERS THE OPTION TO DISABLE WEATHER ALERTS TO KEEP THEIR ATTENTION ON THE ROAD.",
        "vin": "2C3CDXGJ5HH"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2017",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040071,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NEWLY PURCHASED STOCK VEHICLE WITH 1641 MILES WITH VERY LIGHT USE. DRIVING LOW SPEED IN STREET TRAFFIC THE MODULES WENT OFFLINE OCTOBER 20, 2017 CAUSING INSTRUMENT CLUSTER TO SHOW BRAKE, CHECK ENGINE, LANE SENSE WARNINGS. REPORTED THE INCIDENT TO THE DEALER AND THEY REPAIRED AND REPROGRAMMED THE MODULES. VEHICLE WAS RETURNED AND WITHIN 24 HOURS A SECOND INCIDENT OCCURRED WHILE DRIVING THE VEHICLE WHERE INSTRUMENT CLUSTER SHOWED BRAKE, CHECK ENGINE, SERVICE SHIFTER, ELECTRONIC STABILITY CONTROL WARNINGS. STOPPED THE VEHICLE AND ITS TRANSMISSION JAMMED IN REVERSE WHILE PARKING. VEHICLE COULD NOT BE REVERSED OR MOVED. TOWED VEHICLE DUE TO SAFETY CONCERN TO THE DEALER OCTOBER 22. WAITING SAFETY EVALUATION. *BF  CONSUMER5 STATED NO ROOT CAUSE OF THE FAILURE WITH THE BCM (ETC) MODULES WAS FOUND. DODGE DEALER SIMPLY REPLACED THE MODULES. UPDATED 9/13/18*JB  UPDATED 9/13/18*JB",
        "vin": "2C3CDXGJ1HH"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/21/2017",
        "dateOfIncident": "09/21/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024858,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR IS POSSESSED.  IT WILL SLAM ON THE BRAKES AND COME TO A STOP.  THERE WILL BE NOTHING IN FRONT OF YOU AND THE CAR WILL SLAM ON THE BRAKES AND STOP.  IT HAS DONE IT AT SLOW SPEEDS AND AT HIGHWAY SPEEDS.  I HAVE TAKEN IT IN FOR THE DEALER TO LOOK AT IT BUT THEY COULDN'T REPRODUCE THE ISSUE.  THIS CAR IS GOING TO CAUSE A SERIOUS ACCIDENT.",
        "vin": "2C3CDXGJXHH"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 DODGE CHARGER DAYTONA 392 (R/T SCAT PACK) HAS AN INHERENTLY DANGEROUS INTERMITTENT ELECTRICAL FAILURE. WHILE TRAVELING 77MPH ON INTERSTATE 70 THE  EVIC SCREEN INDICATED A FCW WARNING WITH THE SYSTEM TURNED OFF, LOSS OF THE ABS, ESP, SRS, THEN TOTAL LOSS OF ELECTRIC STEERING WITH NO THROTTLE OR BREAKING INPUT RESPONSE. SAID VEHICLE THEN VIOLENTLY DOWNSHIFTED FROM 8TH GEAR TO 3RD GEAR CAUSING THE REAR WHEELS TO BREAK TRACTION SUBSEQUENTLY RESULTING IN FULL LOSS OF LATERAL CONTROL OF THE VEHICLE. I FULLY DEPRESSED THE EMERGENCY BREAK AS THE REAR OF THE VEHICLE BEGAN TO DRIFT TO THE LEFT RESULTING IN FLAT SPOTS ON BOTH REAR TIRES AS I SKIDDED TO A HAULT. I HAVE ADDRESSED THIS ISSUE WITH 4 LOCAL DEALERS IN KANSASCITY TO NO RESOLVE. AFTER THIS FAILURE OCCURS AND THE VEHICLE IS SHUT OFF FOR ANY LENGTH OF TIME THE GAGUE LIGHTNING FLASHES INTERMITTENTLY THEN FLASHING/CLEARING THE PCM WIPING EVERY CODE OUT. ONCE CAPTURED BY A SERVICE WRITER STATIONARY AFTER HAVING THE VEHICLE TOWED TO A DEALERSHIP USING THE OBD2 DATA RECORDER WERE 277 FAULTS ALL SIGHTING ELECTRICAL OVER VAULTS AND ELECTRICAL FAILURE OF THE TCM. FCA ASSIGNED A CASE MANAGER WHO DID NOTHING. AFTER CONSISTENT CALLS TO FCA CORPERATE I WAS ASSIGNED A \"STAR CASE\" AND SAID CASE WAS GIVEN TO THE 91 TEAM WHO HAVE ALSO DONE ABSOLUTELY NOTHING. THIS VEHICLE ISN'T JUST DANGEROUS FOR MY FAMILY AND MYSELF BUT OTHER MOTORISTS AS WELL SIGHTING TOTAL LOSS OF CONTROL WHEN THIS EVENT OCCURS. I PURCHASED SAID VEHICLE MARCH 20, 2017 AND HAVE DEALT WITH THIS SINCE DAY 8 OF OWNERSHIP. THE VEHICLE NOW HAS 8,522 MILES AND THERE'S NO RESOLUTION IN SIGHT. I CAN'T EVEN GET LOCAL DEALERS TO CHANGE THE OIL UNDER THE MVP MAXCARE UNLIMITED WARRANTY.",
        "vin": "2C3CDXGJXHH"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993882,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 DODGE CHARGER IS EXPERIENCING \"HARD SHIFTING\" WHEN I GET IN THE VEHICLE AND START DRIVING IT. I JUST GOT IT BACK FROM THE DEALER YESTERDAY (THE SECOND TIME I DROPPED IT OFF) AND THEY SAY THEY EXPERIENCED THE PROBLEM BUT BECAUSE THERE WERE NO CODES, THEY ARE REFERRING THE PROBLEM BACK TO DODGE.  THEY APPLIED COMPUTER UPDATES TO THE PCM AND TCM ON THE FIRST TRIP AND THAT DID NOT CORRECT THE PROBLEM.  THIS HAS BEEN GOING ON FOR THE LAST COUPLE OF MONTHS. THE CAR ONLY HAS 6,700 MILES ON IT.",
        "vin": "2C3CDXJGXHH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/02/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10982984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOW BEAM HEADLIGHTS DO NOT PROVIDE ENOUGH LIGHT FOR SAFE DRIVING AT NIGHT. THE VEHICLE IS NOT USABLE AT NIGHT WITHOUT OPERATING THE HIGH BEAMS. A STATE POLICE OFFICER CHECKED THE LIGHTS AND COMMENTED THEY WERE THE WORST HE HAS SEEN.    THIS NEEDS TO BE CORRECTED!",
        "vin": "2C3CDXFG6HH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967785,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CHARGER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD NOT START. TOWED TO DEALER. DEALER STATES THE BODY CONTROL MODULE NEEDS TO BE REPLACED. VEHICLE IS NOT DRIVABLE.  THE ORIGINAL MODULE #68354142 IS NO LONGER AVAILABLE AND HAS BEEN REPLACED WITH REVISION AA AND REVISION AB BOTH ON BACKORDER.  VEHICLE HAS BEEN AT THE DEALERS FOR 24 DAYS WAITING ON NEW MODULE. MODULE IS SCHEDULED TO ARRIVE AT DEALERS LOCATION 4/10/2017. THIS MODULE CONTROLS EVERYTHING INSIDE THE VEHICLE AND IS LINKED TO THE BATTERY. THIS MODULE CREATED A CONSTANT DRAIN OF POWER, MAKING THE VEHICLE UNSAFE TO TAKE ANYWHERE. ONLY HAD THE VEHICLE FOR 3 WEEKS UNTIL THIS PROBLEM OCCURRED.",
        "vin": "2C3CDXGJ5HH"
    }
]