[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455545,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a gap between the lift gate lamp and the frame of the vehicle allowing for water build up in the lighting causing for the brake lights to malfunction and go out at random times. Dealer wants to charge 1,500 to replace light but refuses to acknowledge that the issue is cause by the gap between the frame and the light. Constantly have to bleed out water from my brakes until they went out",
        "vin": "1C4RDJAG9HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "01/07/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454438,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear tailgate lights, which operate in conjunction with the tail lights, fills up with water over time. The water then shorts out the LED lights.",
        "vin": "1C4SDJET0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453854,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Water is able to leak into the rear hatch “racetrack” tail light by means of a faulty sealing system used on the tail Light across the back hatch. The water then grounds out the break and tail light function as well as numerous other electrical systems (in my case the radio and whole vehicle control system located in the dash). The seal on the light is a non serviceable item and the manufacturer claims the only fix is to replace the entire light at a cost in excess of $1,500.00. The gap in the seal is large enough for insects to enter the light as well, so not at all water tight as a external light should be.",
        "vin": "1c4sdjct1hc"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451228,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving the vehicle there is loss of acceleration and doesn't go faster than 10 miles per hour while I was on the freeway. I had to pull over to a stop on a busy freeway with 4 children and myself a single mother. I was scared that I may be rear ended while on the freeway. I had it towed to the dealer and they said it was the transmission.",
        "vin": "1C4RDHAG2HC"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2022",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450277,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Dodge Durango. The contact stated that while driving, the vehicle stalled while utilizing the AUTO STOP/START feature. The contact was able to pull over. The shift to park message was blinking and the AUTO STOP/START exclamation was displayed. The check engine warning light was illuminated. Additionally, the headlamp was inoperable. There was an abnormal knocking noise detected from the transmission. The vehicle was taken to the local dealer but was unable to duplicate the failure. The vehicle was not diagnosed or repaired. The vehicle was taken to another local dealer; Star Chrysler Dodge Jeep Ram (211-10 Jamaica Ave, Queens, NY 11428(844) 291-4802) who was also unable to duplicate the failure. The vehicle was not diagnosed or repaired. The manufacturer contacted the owner and informed him a specialist would be looking at the vehicle; however, no further assistance was provided. The approximate failure mileage was 80.",
        "vin": "1C4RDJDG7HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2022",
        "dateOfIncident": "01/30/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449429,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "When shifting the vehicle it says “service shifter”. Once again I look up this issue on the web and hundreds of others are saying they have the same issue with jeeps and a variety of dodge vehicles.",
        "vin": "1C4RDJDG6HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449182,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The tail light on the tail gate accumulates water and causes the light to go out. This could cause the entire brake light to short and could result in a rear end collision. 85 percent of the Dodge Durangos I see have the same issue. This isn’t a wear and tear problem, the lights weren’t sealed properly from the factory. Attached are just a few photos demonstrating the problem. Dodge owes it to the consumer to have this recalled",
        "vin": "1C4RDJDG6HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436087,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The air bags light goes of and on and I got it fixed when I purchased the car and it is doing it again and air bags light is coming of and on and is always beeping saying its urgent the dealer won't look at I any more because they say it might be a recall",
        "vin": "1c4rdhdg1hc"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434043,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Back on Aug 24th, I brought in my 2017 Dodge Durango for what I suspected was a burnt out headlight bulb on the left side.  Turned out, I needed a new ballast.  Today, it's now my right side that needs a new ballast.  I have looked over the complaints for this SUV and it is not an uncommon issue.",
        "vin": "1C4RDJDG9HC"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11433155,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle was traveling around 60 moh.. Jumped curve and hit a tree. Air bags failed to deploy. Driver sustained multiple injuries including fractured pelvis, torn aeorta, hemothorax under ribcage, and several cuts, scrapes, and bruises requiring stitches.",
        "vin": "1C4RDJDG7HC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/11/2021",
        "dateOfIncident": "05/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428632,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle has a rear parking assist function. Via a Uconnect (touchscreen) system, the function can be enabled or disabled. The Uconnect system allows the operator to select whether the function will provide an audible warning or brake automatically if an object behind the vehicle is detected by any of 4 sensors installed in the rear bumper. The function can also be enabled or disabled via a physical button below the Uconnect system.  I purchased the vehicle new and have owned the vehicle for 3 years. I have towed boats many times. Until recently, I was able to successfully use the touchscreen or physical button to disable the function when backing up with a trailer connected. Now I cannot disable the function or braking via either method. It appears to turn off for about 1 second before turning back on. I've tested in various conditions such as park/neutral, with/without a trailer, etc. to no avail.   I thought I would try resetting software in the rear parking assist controller, so I disconnected both batteries and removed the proper fuse, but that didn't fix the issue. That got me worried because the failsafe should be that if the control system goes bad, the function should be disabled. I believe this to be true, because sometimes you need to back up to avoid collisions with irresponsible drivers, etc. If you are towing a trailer, you wouldn't be able to back up if the system failed. I understand about failsafe design from working on safety-critical aircraft computers.  I reviewed the users manual and information online, and found that if connected to a trailer or exceeding 7 mph in reverse, the function should disengage. However, the function has NEVER, in 3 years, disengaged when towing a trailer, and I am unable to exceed 7 mph when towing due to the automatic braking. I tested this again by plugging a trailer into both factory-installed electrical receptacles provided with the tow package. I could not disable it. Other vehicle owners have the same issue.",
        "vin": "1C4RDJDGXHC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/21/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425822,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Dodge Durango. The contact stated while driving 40 mph, the contact was pulled over by the police and was informed that their rear center taillight was inoperable. Additionally, the license plate light was also inoperable. The contact was able to continue driving back to the residence. The vehicle was taken to the local dealer to be inspected. The contact was informed that there was a cost for a diagnostic test. The contact declined due to the cost. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure mileage was 84,506.",
        "vin": "1c4rdjdg1hc"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424569,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Dodge Durango. The contact stated that the headlights would turn off inadvertently after driving for 30 minutes. The contact was made aware of the headlight failure when she was pulled over by the police. The vehicle was taken to an independent mechanic and diagnosed that the headlight assemblies were faulty, but only the light bulbs were replaced. The failure recurred. The manufacturer was made aware of the failure. The failure mileage was unavailable. The Vin was unavailable.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423792,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The climate control system is malfunctioning, and the windows will not roll down. The heat comes on full blast and cannot be turned down or off, and it is summertime. On a hot day the car cannot be driven more than a couple of miles because the interior becomes so hot that it becomes difficult to breathe and remain conscious with the heat on full blast and the windows up. The controls for the windows do not work. The controls for the heat do not work. The climate control system is connected to, or is controlled, by the Uconnect System, which also does not work. I cannot safely operate this vehicle for more than about 5 minutes on a hot day. The vehicle is available for inspection. The problem was reproduced by an auto dealer, who said that it is likely a problem in the electrical system and would take about 3 hours to diagnose. The vehicle was not inspected by the manufacturer, police, insurance representatives or others. However, I called FCA. They told be to do a software update for the Uconnect System. I successfully updated the software, but it did not resolve the problem. There were no warning lamps, messages, or other symptoms of the problem prior to the failure. However, about three months ago the Uconnect System began malfunctioning by occasionally and intermittently rebooting – i.e., flashing on and off.  After a couple of weeks, the rebooting occurred more frequently, and now it will work at all.",
        "vin": "1C4RDJDG2HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421677,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear center tail light, or track light, was poorly designed and it allows water to get trapped inside and sit, resulting in the lights burning out. This single light assembly consists of a brake light that is the width of the rear hatch, a backup camera, and reverse lights. The only way to fix this problem is to replace the entire light assembly which costs over $1,000. This is a very widespread problem with Dodge Durangos based on the vast number of complaints for this specific issue, and I am surprised that this is not a recall considering the number of complaints associated with this problem. As you can see from the picture that I have attached, the bottom lights on both sides no longer work because of the sitting water inside. I tried to get this problem fixed, being that it is a manufacturer defect, but Dodge is unwilling to help me because my 2017 Durango is just out of warranty. I would greatly appreciate help with this problem.  Thank you",
        "vin": "1C4RDJAG3HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/23/2021",
        "dateOfIncident": "04/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418217,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Water in the rear tailgate light(race track)",
        "vin": "1c4rdjeg5hc"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "05/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger headrest deployed without being in a car accident",
        "vin": "1c4rdjdg7hc"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "05/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415912,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SECOND ROW SEAT BELTS FAILED.  THE DEALER COMMENT IS THAT BOTH RETRACTORS BROKEN.  THE SEAT BELTS FAILED WITHIN 3 YEARS, BUT OUTSIDE THE MILEAGE RESTRICTION FOR WARRANTY REPAIR.  THE VEHICLE IS PREDOMINANTLY FOR BUSINESS TRAVEL, WITH LIMITED SECOND ROW PASSENGERS, AND AVERAGING 25K MILES PER YEAR.   A DODGE CASE WAS OPENED ON MY BEHALF, BUT I WAS INFORMED THAT THE VEHICLE IS OUT OF WARRANTY AND NO ACTION WILL BE TAKEN.  THE PARTS ARE ROUGHLY $250, BUT LABOR TO INSTALL THEM IS SUBSTANTIALLY MORE, AS THE INTERIOR HAS TO BE DISASSEMBLED.  IT IS UNREASONABLE FOR SEAT BELTS TO FAIL WITH 75,000 MILES ON THE VEHICLE, AND UNDER 200 USES.",
        "vin": "1C4SDJCT4HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "03/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415189,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LIGHT CRACKED ALLOWING WATER IN LIGHTS CAUSING LIGHTS TO GO OUT.  NOTICED THIS ABOUT 1.5 YEARS AGO. NO OTHER DAMAGE,  LOOKS LIKE IT WAS CUT WITH A LASER.  CAR WAS STATIONARY",
        "vin": "1C4RDHDG6HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/04/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406303,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACETRACK LIGHTS HAS WATER IN IT AND IT HAS FLASHED OFF AN ON. ONCE THE WATER WAS OUT IT CAME BACK ON",
        "vin": "1C4RDJDG5HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404097,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR LIGHTS ARE FILLING WITH WATER.  THIS WILL EVENTUALLY CAUSE SHORT OR PROBLEM WITH LIGHTS AND I FEEL IS A SAFETY ISSUE.  I WILL ATTEMPT TO HAVE DEALER REPAIR, BUT I AM NOT SURE WHAT IS CAUSING THIS.  I SEE OTHER ISSUES STATING THE RACETRACK LIGHT IS FILLING WITH WATER.  WE HAVE DRAINED THE WATER NUMEROUS TIMES.  I SEE THIS IS AN ISSUED FOR 2014, 2015, 2016 YEARS AS WELL  I AM ATTACHING SIMILAR COMPLAINTS",
        "vin": "1C4RDJDG6HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TAIL LIGHT BAR FILLED WITH WATER AND STOPPED WORKING. THIS PART WAS 1ST REPLACED IN DECEMBER 2018, AND NOW THE 2ND ONE IS NO LONGER WORKING. THIS IS A SAFETY HAZARD AND A KNOWN ISSUE FOR THIS VEHICLE. I HAVE CALLED THE DEALERSHIP AND CHRYSLER AND THEY ARE NOT WILLING TO REPLACE OR FIX THIS KNOWN DEFECT.",
        "vin": "1C4RDJDG0HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/20/2021",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404016,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 DODGE DURANGO RT.  MY TAILGATE LIGHTS HAVE WATER IN THEM AND DURING MY TRAVELS I AM NOTICING MY TRUCK IS NOT THE ONLY ONE. TRYING TO FIGURE OUT A FIX FOR THIS PROBLEM. IS IT MY RESPONSIBILITY DODGES?",
        "vin": "1C4SDJCT3HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "10/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397462,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT TURN SIGNAL AND THE BACK TRACK LIGHT GO OUT AT THE SAME TIME INTERMITTENTLY.  ALSO THE STOP AND START FUNCTION IS STILL NOT WORKING CORRECTLY AND I HAD IT AT THE DEALER, DUTCHESS DODGE 2X'S NOW. 1ST TIME THEY STATED THE STOP/ START BATTERY AND THE 2ND TIME THEY REPLACED THE CEL AND STILL HAVING ISSUES WITH NOT WORKING CORRECTLY.  I HAVE ONLY HAD THIS TRUCK SINCE OCTOBER.  THERE'S NO WAY I SHOULD BE HAVING THESE ISSUES.  THERE IS DEFINITELY GOING ON WITH THIS TRUCK AND NOT SURE WHY THERE IS NOT A RECALL.  WHEN I WAS DRIVING AND MADE A STOP THE START/STOP FUNCTION STARTED WORKING  BUT THEN THE LEFT TURN SIGNAL AND THE BACK TRACK LIGHT STOPPED WORKING .  THE FIRST DAY I GOT THE TRUCK HOME THE START/STOP FUNCTION WAS NOT WORKING BUT THE TURN SIGNAL AND TRACK LIGHT WERE FINE.  I PURCHASED THE TRUCK AND IT HAD 70751 MILES ON IT.  THE STOP START/ STOP FUNCTION WAS NOT WORKING FROM THE DAY I PURCHASE IT AND THEN CAM ONE PROBLEM AFTER ANOTHER.",
        "vin": "1C4RDJAG1HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "01/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396719,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT MY DURANGO COUPLE MONTHS AGO AND THE CENTER TAILLIGHT STOPPED WORKING AND FOUND OUT IT IS FULL OF WATER AND WHEN I WENT TO DEALERSHIP THE SAID THEY SELL SO MANY THAT THEY ARE ON BACK ORDER AND PRICE WAS $1200.00 SO AFTER READING SOME FORUMS I REALIZE THIS IS A VERY COMMON PROBLEM AND DON'T UNDERSTAND WHY THE MANUFACTURER IS NOT REPLACING THEM AS A RECALL WHEN THEY KNOW THAT THIS IS A HUGE PROBLEM",
        "vin": "1C4RDJDG3HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/14/2021",
        "dateOfIncident": "02/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396155,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CENTER TAIL LIGHT KNOWN AS THE RACE TRACK LIGHT HAD GOTTEN MOISTURE IN IT AND SOME OF THE LED LIGHTS WENT OUT. I WAS IN THE PROCESS OF TRYING TO FIND A SOLUTION AS TO WHY THIS HAPPENED AS MY VEHICLE IS NOT EVEN 4 YEARS OLD YET. THIS ISSUE STARTED NOVEMBER OF 2020. WELL FAST FORWARD TO 2-13-21 THE WHOLE CENTER PART HAS NOW COMPLETELY WENT OUT AND DOESNT WORK AT ALL. I HAVE BEEN DOING ALOT OF RESEARCH AND SEE THERE IS ALOT OF ISSUES WITH PEOPLE HAVING THE SAME PROBLEMS AND THE MANUFACTURER NOT DOING ANYTHING ABOUT THE ISSUE TO FIX THEM. THIS IS A HUGE SAFTEY CONCERN AND WOULD LIKE SOME MORE FEEDBACK ON WHAT COULD BE DONE TO HAVE IT FIXED AS ITS NOT A CHEAP FIX AT ALL. THANK YOU IN ADVANCE AND HOPEFULLY WE CAN GET SOMETHING GOING FOR THIS.",
        "vin": "1C4RDJDG1HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395283,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LIGHTS KEEP BLINKING ON AND OFF MY WINDOW KEEPS GOING UP AND DOWN THE PASSENGER WINDOW MY REMOTE STARTER SOMETIME DON'T WANT TO START",
        "vin": "1C45DJCT3HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395318,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING ISSUES WITH WATER IN RACE TRACK TAILLIGHT AND NOW. THE WHOLE RACETRACK TAIL LIGHT IS OUT",
        "vin": "1C4RDJDG7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390727,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GEAR SHIFT WILL SHIFT FROM PARK TO DRIVE.  VEHICLE WAS PARKED WHILE RUNNING AND SHIFTED TO DRIVE WITHOUT ANYONE IN THE VEHICLE.  VEHICLE ALSO SHIFTED OUT OF GEAR WHILE STOPPED AT A TRAFFIC SIGNAL.  WOULD NOT SHIFT OUT OF PARK. HAD TO SHUTOFF VEHICLE AND RESTART IT TO GET OUT OF PARK.",
        "vin": "1C4RDJEG5HC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/16/2021",
        "dateOfIncident": "01/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388460,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR ON FREEWAY WHEN THE COMPUTER LOCKED UP SYSTEM OF AWD AND SENSORS. THE BACK TIRES WOULD NOT TURN AND CAR STARTED TO JERK AND SLOWED DOWN. THE DASH BOARD LIGHTED UP AND ALL SENSORS SAID OFF OFF OFF . THE MILEAGE SPEEDOMETER CHANGED TO KILOMETERS AND THE MAPPING SCREEN HAD THE CAR GOING IN A CIRCLE. THE STEERING WHEEL WAS STIFF AND CARS WHERE PASSING ME BY.  THE CAR MADE A CLUNKING SOUND WHEN IT FIRST HAPPENED. I GOT SCARED TRYING TO FIGURE OUT WHAT TO DO.  I SLOWLY GOT OUT OF TRAFFIC AND OFF THE FREEWAY TO PARK THE CAR.  HAD THE TOW PERSON COME AND WE HARD TIME GETTING IT TO STAY IN NEUTRAL.  I HAD TO STAY IN THE CAR SO IT WOULD NOT SHUT OFF.  WHEN GOT IT TO DEALERS FOR REPAIR THE REPAIR PLACE SAID THE COMPUTER MUST HAVE RESET ITSELF AND THEY COULD NOT FIND ANYTHING WRONG??   I FEEL THIS IS A BIG PROBLEM?  THIS SHOULD BE LOOKED INTO AS IT COULD BE LIFE THREATING WHEN DRIVING ALONG AND THE COMPUTER TAKES OVER LIKE THAT AND YOU HAVE NO CONTROL OF THE WHEELS.  MY TOW PERSON SAW WHAT IT WAS DOING ALSO NOT JUST ME. SO I KNOW IT WAS HAPPENING.  SOMETHING IS WRONG WITH THAT COMPUTER SYSTEM WHERE IT JUST SHUTS DOWN LIKE THAT.  IT HAS DONE IT BEFORE ON A SMALLER AREA OF JUST THE HIGH BEAM CONTROLS BUT THIS TIME IT WAS THE WHOLE DRIVING MECHANIZM.    PLEASE LOOK INTO THIS PROBLEM.  I WOULD LIKE TO SEE A NEW COMPUTER OR SOMETHING DONE WITH MY CAR SO IT IS SAFER AND MORE RELIABLE.   SINCERELY,  JAN MILOS",
        "vin": "1C4SDJCT7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "01/08/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DRIVING OR JUST HIT THE GAS IT FEEL LIKE MY REAR DIFFERENTIAL TRYING TO JUMP OUT THE CAR IDK I'M PRETTY SURE IT HAS SOMETHING TO DO WITH THE HALFSHAFT SEPARATION I DEFINITELY NEED TO GET THIS LOOKED AT BECAUSE  JUST GOT THE CAR 3 DAYS AGO",
        "vin": "1C4SDJCT1HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/24/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 DODGE DURANGO HAD WATER INTRUSION IN THE LIFT-GATE TAIL LIGHT.  I HAD ONE REPLACED UNDER WARRANTY AFTER I NOTICED THAT THE LIGHTS HAD FAILED AND COULD SEE THE WATER POOLING IN THE LIGHT.  THE REPLACE TAIL LIGHT ALSO HAS WATER POOLING IN THE BOTTOM PART OF THE LIGHT.  THE DEALER WON'T REPLACE THIS ONE FOR FREE BECAUSE THE WARRANTY HAD EXPIRED.",
        "vin": "1C4RDJEG8HC"
    },
    {
        "components": "LANE DEPARTURE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375630,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE LIGHTS ON THE DASH CONTROL PANEL (SPEED, RPM'S, BLINKERS, ETC) TURN OFF AND ON RANDOMLY MULTIPLE TIMES.  WHILE DRIVING, THE LANE SENSE WILL TURN OFF AND ON RANDOMLY MULTIPLE TIMES.  WHILE DRIVING, THE ACC/FXCW WILL TURN OFF AND ON RANDOMLY MULTIPLE TIMES.  WHILE DRIVING, THE PASSENGER WINDOW WILL ROLL DOWN MULTIPLE TIMES.  WHILE DRIVING, THE AM/FM/XM RADIO CUTS IN & OUT.    THESE THINGS HAPPEN ON CITY STREETS AND THE HIGHWAY WHILE THE VEHICLE IS IN-MOTION.  ISSUES TYPICALLY TAKE PLACE WHEN THE TEMPERATURE IS BELOW 30-DEGREES FAHRENHEIT.    ISSUES WERE OBSERVED  JANUARY 2019   FEBRUARY 2019  NOVEMBER 2019  DECEMBER 2019  JANUARY 2020  NOVEMBER 2020    SERVICE DATES WITH AUTHORIZED DODGE DEALERS INCLUDE:   FEBRUARY 4, 2019  FEBRUARY 12, 2019  DECEMBER 12, 2019  DECEMBER 21, 2019  **ALL WERE UNDER WARRANTY & NONE EVER OFFICIALLY DIAGNOSED THE ISSUE.    I'VE HAD THE VEHICLE TESTED BY 3 DIFFERENT DODGE DEALERS WHO TOLD ME THEY WERE UNABLE TO DIAGNOSE THE ISSUE. THE DEALERS WERE UNABLE TO PROVIDE ME WITH THE INFORMATION THEY WERE SEEING FROM THEIR DIAGNOSTICS MACHINES AS IT WAS DEEMED CONFIDENTIAL.       IN ADDITION, THE FOLLOWING ISSUES ALSO OCCUR:   - KEY FOBS WILL NOT START THE VEHICLE  - U-CONNECT WILL NOT START THE VEHICLE",
        "vin": "1C4SDJCT7HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/10/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER ENTERS THE REAR TAIL LIGHT TRACK LIGHTING SYSTEM, CAUSING SHORTS IN THE LED LIGHTS. I HAVE HAD IT REPLACED 2 TIMES NOW BECAUSE OF THIS DEFECT. THE NEW TRACK LIGHT HASN'T BEEN INSTALLED FOR 1 YEAR YET AND WATER HAS GOTTEN BACK INTO THE TAIL LIGHTS CAUSE SHORTAGES AND OUTAGES. THIS IS A HAZARD THAT NEEDS TO BE ADDRESSED BY DODGE",
        "vin": "1C4SDJCT0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363039,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL DOORS LOCK EXCEPT FOR THE DRIVER'S DOOR",
        "vin": "1C4RDJDG8HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362393,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIFT GATE BRAKE LIGHT GETS MOISTURE INSIDE DURING RAIN. THE WATER BUILDS UP AND BURNS OUT THE LED LIGHTS. THIS IS A SAFETY ISSUE. YOU NEED BRAKE LIGHTS.",
        "vin": "1C4RDJEG9HC"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362173,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1. MY FUEL TANK WILL NOT FILL UP ALL THE WAY AND WILL STOP AT EACH FILL UP. I HAVE TO MANUALLY KEEP TRYING TO PUMP THE FUEL. ALMOST ALWAYS I CAN NEVER FILL FULLY UP. THIS IS A KNOWN ISSUE AND NEEDS TO BE RESOLVED. 2. I ALSO HAVE AN ISSUE WITH MY RACETRACK TAIL LIGHT WITH CONDENSATION AND WATER GETTING INSIDE. I HAVE A FAULTY LIGHT AS I HAVE HAD MY DEALER CHECK FOR CRACKS OR OPENINGS.3. AUTO START ON/OFF JERKY AND SOMETIMES DOES NOT START ON TIME AND WILL JOLT FORWARD WHEN TRYING TO ACCERATE AT STOP LIGHT.",
        "vin": "1C4RDJDGXHC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361611,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE HEADREST POPPED OUT AND WON'T GO BACK IN",
        "vin": "1C4SDHFT4HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354031,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PREVIOUSLY REPORTED A FUELING PROBLEM WITH THIS CAPLESS FUEL SYSTEM.  THIS IS TO UPDATE THE INFORMATION AND PROBLEM.  FUEL STILL CAN'T BE PUT INTO THE TANK.  THE RELIEVE VALVE OR SOMETHING IN THE SYSTEM FORCES THE GAS STATION FUEL PUMP TO CUT OFF EVERY FEW SECONDS.  THE SOLUTION FROM THE DEALER AND ONE MECHANIC IS TO REPLACE THE ENTIRE FUEL TANK AT $1500-$1600.  IF YOU CAN'T PUT FUEL IN A VEHICLE THAT'S 3 YEARS OLD WITH 45K MILES, HOW CAN IT BE SAFE TO DRIVE?  I BASICALLY HAVE TO STAND THERE FOR 10-15 MINUTES CLICKING THE FUEL PUMP OVER AND OVER WHILE HOLDING THE FUEL PUMP LEVER AT 1/3 ON.  I NOW HAVE NO WAY TO KNOW IF THE TANK IS ACTUALLY FULL OR NOT OTHER THAN GUESSING BY HOW MANY GALLONS I THINK SHOULD BE GOING INTO THE TANK.  GUESSING INCORRECTLY RESULTS IN GAS POURING OUT OF THE TANK, DOWN THE VEHICLE AND ALL OVER THE GROUND.  GREAT FOR THE ENVIRONMENT.",
        "vin": "1C4RDHEG9HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "05/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351182,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACE TRACK TAIL LIGHT HAS WATER IN IT AND CONDENSATION. THE LED LIGHTS SHORT IT OUT WHILE DRIVING AND ALMOST CAUSED AND ACCIDENT. GOT STOP BY THE COPS BECAUSE IN HIS WORDS MY LIGHTS KEEP FLICKERING IS A QUALITY CHECK DEFECT.THERES A WHOLE COMMUNITY GOING TROUGH THIS PROBLEM WE NEED A SOLUTION. THIS HAPPENS IF THE TRUCK IS STOP OR MOVING GETS WATER INSIDE THE RACE TRACK TAILED LIGHTS.WE GETTING A HURRICANE HERE IN TEXAS SO MUCH WATER MY HOUSE MIGHT NOT FLOOD BUT MY LIGHTS WILL.",
        "vin": "1C4SDHCT6HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343666,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAPLESS (NO GAS CAP) FUEL SYSTEM WILL NOT ALLOW YOU TO PUT FUEL IN THE VEHICLE.  IT HAS SOME SORT OF CHECK VALVE THAT IS FAILING AND CAUSES THE FUEL PUMP TO SHUT OFF EVEN WHEN YOU ARE RUNNING ON EMPTY.  IF YOU SEARCH THE INTERNET, THERE ARE MANY COMPLAINTS ABOUT THIS SAME PROBLEM.  IT STARTED AS AN OCCASIONAL PROBLEM WHEN THE VEHICLE WAS 2 YEARS OLD.  NOW AT 3 YEARS OLD, THE ONLY WAY TO FILL IT, IS TO TURN THE GAS PUMP HANDLE UPSIDE DOWN WHICH CAN CAUSE GAS TO LEAK OUT ON THE SIDE OF THE VEHICLE AND THE GROUND.  EVEN THIS METHOD ONLY WORKS 60% OF THE TIME.  IF YOU CAN'T PUT GAS IN THE VEHICLE, YOU ARE AT RISK OF RUNNING OUT OF GAS ON A BUSY INTERSTATE WHICH IS A MAJOR SAFETY PROBLEM.",
        "vin": "1C4RDHEG9HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340187,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKSENSE MODULE FAILED. VEHICLE HAS LESS THAN 33,000 MILES. WHEN PARKSENSE BUTTON IS PRESSED IT CHIME ONCE.",
        "vin": "1C4SDJCT8HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338857,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER POOLING IN TAILLIGHTS CAUSING CORROSION TO LED'S AND BURNING THEM OUT - CAN LEAD TO SHORT CIRCUIT AND POSSIBLE FIRE.",
        "vin": "1C4RDJDG2HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/03/2020",
        "dateOfIncident": "05/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337358,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER ENTERED TAILGATE LIGHT HOUSING AND POOLED UP OVER TIME. THIS CAUSED SOME OF THE LIGHTS TO GO OUT. THE DURANGO HAS LESS THAN 35,000 MILES AND DUE TO IT COMING FROM CANADA THERE IS NO FACTORY COVERAGE. SEEMS AFTER LITTLE RESEARCH IT IS A VERY COMMON PROBLEM AND VERY COSTLY TO OWNERS. TO THE TUNE OF $1200 AND UP FOR DEALERSHIP REPLACEMENT AND LABOR.  *TR",
        "vin": "1C4SDJCT9HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/20/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329852,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE HEADLIGHT WENT OUT. MY CAR WAS STILL UNDER WARRANTY SO I TOOK IT IN FOR SERVICE. THEY INFORMED ME THAT THE WHOLE HEADLIGHT ASSEMBLY HAD TO BE REPLACED BECAUSE THE BALLEST WAS BAD WHICH CAUSED THE BULB TO BLOW. WITHIN TWO OR THREE WEEKS THE PASSENGER SIDE ONE WENT OUT AND WAS TOLD THE SAME THING. THE CAR WASN'T UNDER THE MANUFACTURE WARRANTY AT THAT POINT SO ENDED UP COSTING ME MONEY TO REPLACE IT. THIS IS CLEARLY A FAULT IN THE DESIGN BECAUSE THERE WAS ANOTHER CUSTOMER THERE THAT HAD THE VERY SAME ISSUE. BOTH LIGHTS WHEN YOU STARTED THE CAR THE LIGHT WOULD FLASH ON AND THEN AFTER STARTING TO DRIVE THE LIGHT WOULD THEN GO OUT.  *TR",
        "vin": "1C4RDJDG7HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327641,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHTS IN THE CAR ARE GOING OFF AND ON BY THEMSELVES, THE PASSENGER WINDOW GOES DOWN WITHOUT THE WINDOW BEING TOUCHED. AND THE CAR WILL TURN OFF WHEN IDLING IN THE PARK POSITION AND THE AUTOMATIC SHUT OFF IS NOT ON OR OFF.",
        "vin": "1C4RDHAG3HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "05/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326262,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAVING A FRIENDS HOUSE MY '17 DD WITH 32K MILES STALLED OUT WHILE I WAS IN A TURN LANE ON A BUSY STREET JUST AT AN INTERSECTION LEADING TO THE HIGHWAY. THE DASH LIT UP WITH SEVERAL LIKES AND THE ONLY LIGHT I COULD CATCH WAS 'POWER STEERING ISSUE CAR WILL CUT OFF SOON' THE CAR WAS STILL IN THE 'RUN' POSITION AND TURNING TO 'OFF' OR 'ACC' WAS NOT ENGAGING. I COULD NOT MOVE OR PUSH THE VEHICLE AS ENGAGE THE NEUTRAL POSITION WAS NOT HAPPENING. AFTER CALLING THE TOW TRUCK AND SITTING FOR ABOUT AN HOUR (SCARED I'D GET HIM BY ONCOMING TRAFFIC) I LOOKED IN THE MANUAL AND ONLINE  TO SEE HOW TO MANUALLY ENGAGE THE NEUTRAL POSITION. AFTER A FEW FAILED ATTEMPTS I WAS ABLE TO ENGAGE IT AND MOVE IT SAFELY FROM THE STREET. TOW TRUCK ARRIVED AN HOUR LATER AND NOW NO BUTTONS WORKED. HE HAD TO USE THE MANUAL KEY TO UNLOCK DOORS AND THE DASH WAS LIGHTING UP WITH SEVERAL WARNINGS. GOING TOO FAST TO SEE OR DESCRIBE. APPT IS SCHEDULED FOR 5/28 PREVIOUSLY SCHEDULED BECAUSE TWO DAYS PRIOR TO THIS EVENT GAS GAUGE INDICATED ALMOST EMPTY. WENT TO FILL UP AND WAS ONLY ABLE TO FILL 7.7 GALLONS BEFORE GAS PUMP INDICATED THE CAR WAS FULL. AFTER I STOPPED PUMPING THE NEEDLE ONLY READ HALF A TANK BUT WOULD NOT LET ME CONTINUE TO FUEL AS IT INDICATED IT WAS ALREADY FULL.  *TR",
        "vin": "1C4RDJDG1HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/17/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321366,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE HEAD LAMP REPEATEDLY FAILS AND BURNS OUT AFFECTION NIGHT TIME DRIVING VISIBILITY.   WHEN EACH AND EVERY BULB IS REPLACED IT HAS BURNED TERMINALS CAUSING LIGHT BULB TO SHORT OUT.   NOT ONLY IS THIS EXPENSIVE TO REPLACE EVERY 3 TO 4 WEEKS, IT IS UNSAFE TO OPERATE THE VEHICLE WITH LOW VISIBILITY AT NIGHT. IT ALSO, MAKES MY VEHICLE LESS VISIBLE TO ONCOMING DRIVERS. IN ADDITION, IT IS CAUSING UNDO DISTRESS BEING CONSTANTLY PULLED OVER BY LAW ENFORCEMENT AND BEING EITHER FINED OR WARNED FOR DRIVING ILLEGALLY WITH ONE HEAD LAMP  I HAVE SEEN ON YOU TUBE AND OTHER OUTLETS ON LINE THAT THIS IS A TYPICAL PROBLEM FOR THIS MAKE AND MODEL OF VEHICLE.",
        "vin": "1C4SDJCTXHC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/26/2020",
        "dateOfIncident": "03/19/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319401,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER POOLING INSIDE THE RACETRACK TAILLIGHTS, DECKLID AREA. LIGHTS SEEM TO NOT BE WATERPROOF OR WATERTIGHT.",
        "vin": "1C4RDJAG3HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/12/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317791,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LEFT TURNING SIGNAL KEPT GOING OUT AND COMING BACK ON. THEN I NOTICED IT WAS EFFECTING THE HEAD LIGHTS. IT SEEM LIKE SOMETHING IS LOOSE BECAUSE SOMETIMES IF I HIT A BOMP THEY START WORKING NORMAL AGAIN. NOW BOTH HEAD LIGHTS ARE OUT AND THE BULBS ARE FINE.",
        "vin": "1C4SDJCT1HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "01/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315632,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER COLLECTED IN THE REAR LIGHT BAR HOUSING CAUSING THE LIGHTS ON EACH LOWER CORNER OF THE HOUSING TO BURN OUT.",
        "vin": "1C4SDJCT9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308139,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS TRANSMISSION GEAR ISSUE OR SOFTWARE PROBLEM WHEN DOWNSHIFTING. CAR IS SUPPOSEDLY LEARNING TO DRIVING HABIT BUT TRANSMISSION SHIFTING JERKS ESPECIALLY WHEN YOU ARE DECREASING SPEED BEHIND CAR IN FRONT AND AS IT IS FULLY STOPPED AND ENGAGES INTO IDLE(1) IT JERKS HARSHLY TO POINT OF ALMOST HITTING CAR IN FRONT. EVEN WHEN PUTTING CAR INTO AUTOMATIC TO PADDLE SHIFTING MODE IT JERKS JUST TO ENGAGE THE GEAR. ECO MODE IS SPORADIC, SPORT MODE IS LESS, AND MANUAL PADDLE SHIFTING IS LEAST NOTICEABLE SINCE IT IS CONTROLLED BY USER. SIMILAR ISSUES HAVE BEEN REPORTED BY MULTIPLE DODGE USERS REGARDING TRANSMISSION JOLTING EVEN FOR 2015 TO 2019 MODELS, MAYBE EVEN FURTHER BACK. VEHICLE IS GOING TO SHOP TODAY ON 2/10/20.",
        "vin": "1C4RDHDG8HC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308354,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG SERVICE LIGHT CONTINUES TO FLASH AND BEEP WHILE VEHICLE IS IN MOTION.",
        "vin": "1C4RDJDG2HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2020",
        "dateOfIncident": "01/13/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307776,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 55 MPH, THE CONTACT NOTICED THAT THERE WAS GREY AND WHITE SMOKE COMING FROM THE TAIL PIPE. IN ADDITION, THE VEHICLE WAS RUNNING HOT WHILE THE START AND STOP WARING LIGHT AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED INTERMITTENTLY. THE CONTACT MENTIONED THAT COOLANT WAS PUT IN THE VEHICLE TO COOL DOWN THE ENGINE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE COIL NEEDED TO BE REPLACED AND THE HEAD GASKET WAS CRACKED AND LEAKING AND NEEDED TO BE REPLACED.  THE CONTACT CONTACTED REDLANDS CHRYSLER JEEP DODGE RAM (500 W REDLANDS BLVD, REDLANDS, CA 92373) WHERE THEY INFORMED THE CONTACT THAT THE VEHICLE WAS UNABLE TO BE REPAIRED DUE TO WARRANTY EXPIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "1C4RDHAG5HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306687,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH IN THE PAST 8 MONTHS AND STARTING AT 38,000 MILES THE LED RACING TAIL LIGHTS ON THE PASSENGER SIDE HAS  AN 8\" INCH BURNT OUT SPOT AND NOW THE LEFT DRIVERS SIDE HAS THE SAME ISSUE.",
        "vin": "1C4RDJEG5HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301513,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LIGHT HAS WATER IN THEM. WEATHER CAUSES WATER TO FREEZE AND DAMAGE LIGHTS. MAKES IT HARD TO SEE WHEN BRAKING AT NIGHT.",
        "vin": "1C4SDJCT4HC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301564,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE WEARS PREMATURELY CAUSE VIBRATIONS IN STEERING WHICH CAN CAUSE LOSE OF STEERING CONTROL. BOZAK OF MERRILLVILLE IN TECHNICIAN DESCRIBES THE ISSUE AS DODGE USING LOWER QUALITY TIRES ON A PERFORMANCE SUV.  THESE VEHICLES ARE MOST COMMONLY USED FOR HAULING AROUND FAMILIES.  I FIND IT DISAPPOINTING THAT THIS WOULD BE THE CASE WHEN A VEHICLE OF THIS PERFORMANCE AND PRICE TAGS HAS BEEN SUBJECTED TO LOWER QUALITY PARTS ESPECIALLY ON AN IMPORTANT ITEM LIKE TIRES.",
        "vin": "1C4SDJCT4HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/10/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300686,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT THE FRONT LEFT TURN SIGNAL QUIT WORKING. I ASSUMED IT WAS A BURNT-OUT BULB.  IN SEARCHING ON THE INTERNET FOR A \"HOW-TO\" FOR REPLACING THIS BULB (IT'S IN PRETTY CRAMPED QUARTERS), I FOUND THAT IT WAS COMMON FOR THE TURN SIGNALS TO WORK INTERMITTENTLY FOR THIS VEHICLE AND SEVERAL MODEL YEARS BEFORE AND AFTER IT.  FURTHER, THERE WAS A DIAGNOSIS OF BURNT CONTACTS THAT WERE THE CULPRIT.  IN REMOVING THE BULB, IT APPEARED TO BE NOT BURNT OUT, BUT THE CONTACT WAS BURNT.  I REPLACED IT AND THE NEXT DAY IT FAILED TO WORK AGAIN.  NOW IT AND THE OTHER ONE WORK INTERMITTENTLY.  IN REMOVING THEM, I FIND THAT THE CONTACT IN THE RECEPTACLE IS ALSO BURNT.  I FEEL THAT THIS IS A PREVALENT PROBLEM ON THIS VEHICLE MODEL (GIVEN THE INTERNET COMPLAINTS), AND THAT THIS IS A SAFETY ISSUE.  FURTHER, I AM REQUIRED (FOR SAFETY REASONS) TO HAVE FUNCTIONING TURN SIGNALS ON THIS VEHICLE.  I CONTACTED THE DEALER AND THEY CLAIM THAT THERE ARE NO OUTSTANDING RECALLS ON THIS VEHICLE.  BEYOND THAT THEY REFUSED TO COMMIT TO WHETHER THIS WAS A KNOWN PROBLEM OR IF THERE WAS A KNOWN SOLUTION.",
        "vin": "1C4SDJET5HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300356,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED WATER GETTING INTO THE MIDDLE LED RACE TRACK LIGHTING. THE MIDDLE LED LIGHT IS ALREADY OUT BECAUSE OF THIS. I BELIEVE THE HOUSING IS A FACTORY DEFECT, MY TRUCK ONLY HAS 40,000 AND THIS IS ALREADY HAPPENING. EXTENDED WARRENTY WONT COVER THIS BECAUSE OF \"CONDENSATION.\"",
        "vin": "1C4SDJCT5HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299571,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 6, 2020, I PLACED MY 2017 DODGE DURANGO INTO PARK IN MY HOME'S DRIVEWAY AND EXITED THE VEHICLE, LEAVING THE EMPTY VEHICLE IDLING. APPROXIMATELY 30 SECONDS LATER, THE VEHICLE SLIPPED OUT OF PARK AND INTO DRIVE AND ROLLED AWAY, FORWARD, INTO MY GARAGE, CAUSING SIGNIFICANT PROPERTY DAMAGE. I HAVE THE INCIDENT RECORDED ON VIDEO, BUT I AM UNABLE TO UPLOAD IT TO THIS WEBSITE. I WILL HAPPILY FORWARD IT BY EMAIL OR OTHER MEANS IF REQUESTED. I ALSO HAVE PHOTOS OF THE GARAGE DAMAGE. I AM AWARE THAT DODGE/JEEP/RAM HAVE HAD THIS ISSUE WITH THE DIAL GEAR SHIFTER SLIPPING OUT OF GEAR RESULTING IN ROLLAWAY INCIDENTS. NO RECALL HAS BEEN ISSUED AND THIS IS A VERY SERIOUS SAFETY CONCERN. I HAVE THREE SMALL CHILDREN THAT THANKFULLY WERE NOT NEAR THE VEHICLE WHEN THE INCIDENT OCCURRED. CONSUMERS SHOULD BE MADE AWARE THAT THIS ISSUE WITH THE DIAL SHIFTER REMAINS ONGOING AND A RECALL SHOULD BE ISSUED BY THE MANUFACTURER. I HAVE CALLED CHRYSLER'S CORPORATE OFFICE TO REPORT THIS ISSUE BUT TO DATE, NO ONE HAS BEEN IN CONTACT WITH ME REGARDING THIS ISSUE OR THE IMMEDIATE REPAIRS THAT ARE NECESSARY.",
        "vin": "1C4RDJDGXHC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299109,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS GETTING IN THE TAIL LIGHTS AND CAUSING THE LIGHTS TO GO OUT.",
        "vin": "1C4SDJCT2HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299112,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO R/T AWD. THE CONTACT STATED THAT THE RACE TRACK LIGHTS WERE BURNED OUT BY WATER. THE VEHICLE HAD NOT BEEN SEEN AT THE DEALER FOR A DIAGNOSTIC TEST. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE EXTENDED WARRANTIES EXPIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000.",
        "vin": "1C4SDJCT2HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "09/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298463,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BUENAS TARDES, LA LUZ QUE VA EN LA PUERTA TRASERA DEL BAL, AUNQUE NO ESTA ROTA, PRESENTA FILTRACIN DE AGUA, Y YA DEJARON DE ILUMINAR ALGUNOS LED.  MI NOMBRE ES [XXX], ESTOY EN BOGOTA COLOMBIA, EMAIL [XXX], EL VEHCULO TIENE 36.000 KM, Y EL CONCESIONARIO, LA NICA SOLUCIN QUE DA ES CAMBIARLA PERO NO DAN GARANTA.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1C4RDJDG7HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/26/2019",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291403,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER COLLECTS IN THE REAR TAIL LIGHT ASSEMBLY (THE ONE ACROSS THE TAILGATE WITH THE BACK-UP CAMERA). SO BAD, SOME LAMPS HAVE BLOWN OUT ON THE LOWER RIGHT OF THE ASSEMBLY. IT ONLY DRAINS OUT WHEN REMOVING A.BOLT ON EACH SIDE, BUT WITHIN A FEW WEEKS, THE WATER RETURNS.",
        "vin": "1C4RDHAG4HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287516,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR LIGHTS FILL UP WITH WATER WHEN IT RAINS AND MAKES THE LIGHTS IN OPERABLE, IT'S A KNOWN ISSUE THAT IS AFFECTING SEVERAL MODEL YEAR DURANGO'S BUT CHRYSLER REFUSES TO DO ANYTHING ABOUT.",
        "vin": "1C4RDJDG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/22/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. APPROXIMATELY FOUR HOURS AFTER PARKING THE VEHICLE IN THE DRIVEWAY, FLAMES APPEARED FROM THE REAR PASSENGER SIDE QUARTER PANEL OF THE VEHICLE. AS A RESULT, THE REAR WINDSHIELD SHATTERED AND REAR PASSENGER SIDE TIRE EXPLODED. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FLAMES. A FIRE REPORT WAS FILED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED AS OF YET. THE FAILURE MILEAGE WAS 60,000.*DT*JB",
        "vin": "1C4RDJAGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279412,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TAIL LIGHTS (DODGE CALLS IT THE 'RACE TRACK') HAD WATER INTRUDE INTO IT AND CAUSED THEM TO BURN OUT.   I ENDED UP BUYING A USED ONE FROM A JUNK HARD AND FIXED WHERE I FEEL THE WATER WAS GETTING IN.  SO FAR SO GOOD BUT IT'S A REQUIRED BY LAW TO HAVE IT WORKING AS IT'S THE ONLY PARKING LIGHTS ON THE BACK. L WOULD HAVE RATHER HAD MINE REPLACED WITH A NEW OE BUT NOT FOR $1500 FOR A NEW ONE.",
        "vin": "1C4RDJDG5HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277395,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I DID MY OWN INVESTIGATION AND I FOUND OUT THAT ALMOST EVERY DODGE DURANGO 2017 HAS A PROBLEM ON THE LEFT FRONT TURN LIGHT SWITCH. IT IS AN ELECTRICAL PROBLEM, IT DOESN'T MATTER IF YOU CHANGE THE BULB SEVERAL TIMES",
        "vin": "1C4SDHCT1HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11271754,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS DESCRIPTION OF THE INCIDENT HAS HAPPENED NUMEROUS TIMES. WHEN THE VEHICLE IS STATIONARY I GO TO THE REAR OF THE VEHICLE AND OPEN UP THE BACK HATCH. ONCE IT IS OPEN ON SEVERAL OCCASIONS I HAVE CUT MY UPPER ARM/FOREARM AT THE POINT WHERE THE REAR TAILLIGHTS ARE SEPARATED. I HAVE FELT THE AREA AND HAD FAMILY AND FRIENDS DO THE SAME. THEY ALL AGREE IT IS VERY SHARP AND HAZARDOUS.",
        "vin": "1C4RDHAG8HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265998,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER SIDE TURN SIGNAL INTERMITTENTLY STOPPED WORKING A COUPLE MONTHS AGO. IT EVENTUALLY STAYED OUT. THINKING THE BULB WAS BAD, BOTH FRONT TURN SIGNAL BULBS WERE REPLACED WITH LEDS. A FEW DAYS AGO, THE ISSUE RESURFACED AND CONTINUES TO INTERMITTENTLY WORK. THIS HAPPENS RANDOMLY WHILE MOVING OR STATIONARY. I HAVE SEEN OTHERS POST OF THIS SAME ISSUE AND I FEEL IT IS A SAFETY ISSUE AND SHOULD BE RECALLED FOR REPAIR AT NO OWNERS EXPENSE.",
        "vin": "1C4RDJDGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2019",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258781,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST 2 WEEKS THE LIFT GATE WILL OPEN ON IT'S ON UNLESS DOORS ARE LOCKED. LATELY THE DOORS WILL UNLOCK OWN THEIR OWN AND THE LIFT GATE WILL OPEN IMMEDIATELY. TODAY THE HOOD AJAR ALERT IS ON MY DASH WHICH IS A SECURITY GUARD FOR THE REMOTE START.",
        "vin": "1C4SDJCT6HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257770,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DEER WAS STRUCK BY VEHICLE WHILE TRAVELING ABOUT 50 MILES PER HOUR ON A CITY ROAD. SEVERE DAMAGE TO FRONT DRIVER SIDE TO INCLUDE UNDERCARRIAGE AND ELECTRICAL PARTS. AIR BAGS DID NOT DEPLOY AND I FEEL LIKE THEY SHOULD HAVE. I WAS INFORMED BY THE TOW TRUCK DRIVER THAT THE AIRBAG SENSORS WERE DESTROYED AND THE BAG SHOULD HAVE GONE OFF.",
        "vin": "1C4SDJCT9HC"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "09/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255042,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I DOWNLOADED AND SUCCESSFULLY INSTALLED A RECOMMENDED SOFTWARE UPDATE TO MY 2017 DODGE DURANGO THIS PAST SUMMER. SINCE THEN I HAVE NOTICED THAT I HAVE DIFFICULTY SHUTTING OFF THE VEHICLE BECAUSE SOMETHING HAS CHANGED IN THE TIMING OF THE THE AUTOMATIC SHUT-OFF AND WHEN I TURN IT OFF.  I HAVE OCCASIONALLY STARTED TO LEAVE THE VEHICLE AND FOUND THAT I HAD NOT TURNED IT OFF, BUT BACK ON.   THIS IS AN AGGRAVATION ALL BY ITSELF, BUT THE REASON FOR MY REAL COMPLAINT WAS NOT DISCOVERED UNTIL I HOOKED UP MY TRAILER. I FOUND THAT I CANNOT TURN OFF OR DISABLE MY PARK ASSIST. WHEN THERE IS A NEAR OBJECT SUCH AS A TRAILER, WHEN I TRY TO BACK UP, THE BRAKES LOCK ON. I DISCOVERED THIS WHILE IN THE MIDDLE OF THE ROAD ON A BLIND CORNER TRYING TO BACK INTO A DRIVEWAY. I LIVE IN THE COUNTRY SO I HAD TO GO A MILE DOWN THE ROAD IN ORDER TO FIND A PLACE THAT I COULD U-TURN.  I THEN HAD TO DETACH AND MANUALLY PARK MY TRAILER.  I CAN TELL YOU THAT WAS A LITTLE SCARY NOT BEING ABLE TO BACK INTO THE DRIVEWAY TO GET OUT OF HARMS WAY.  OH, THE BEST PART, EVEN THOUGH THE SOFTWARE PROBLEM WAS CAUSED BY DODGE SOFTWARE ENGINEERS, I HAVE TO PAY TO GET IT FIXED. THE SOONEST APPOINTMENT IS 2 WEEKS FROM NOW. BETWEEN NOW AND THEN I HAVE TO TAKE A TRIP TO CHICAGO AND PARK WHERE I KNOW I WILL HAVE TO PARK IN TIGHT SPACES.",
        "vin": "1C4RDJDG7HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/27/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246689,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR RACE TRACK LIGHT HAS HAD WATER IN IT FOR MONTHS AND HAS NOW SHORTED OUT PART OF THE LIGHT.  WHEN I BOUGHT THE VEHICLE USED THEY SAID THAT WAS NORMAL AND WILL DRAIN ON IT'S OWN.  NOW THAT THE WARRENTY IS UP THEY WILL NOT COVER IT.",
        "vin": "1C4RDJDG8HC"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233849,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. WHILE DRIVING 65 MPH, THE VEHICLE STALLED, THE ENGINE SEIZED, AND THE STEERING WHEEL WAS DIFFICULT TO TURN. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TAKEN TO HUNTER DODGE CHRYSLER JEEP RAM FIAT (LOCATED AT 1130 AUTO MALL DR, LANCASTER, CA 93534, (661) 948-8411), BUT THE FAILURE COULD NOT BE DUPLICATED. THE CONTACT STATED THAT THE FAILURE CONTINUED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 20,500. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232034,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. THE CONTACT STATED THAT THE TRANSMISSION GEARS CONSTANTLY SEIZED WITHOUT WARNING. IN ADDITION, WHEN THE ACCELERATOR PEDAL WAS DEPRESSED THERE WAS A DELAY WITH THE TRANSMISSION GEARS CHANGING OVER AND THE VEHICLE ACCELERATING, CREATING THE RISK OF A POTENTIAL CRASH. STEVENS CREEK CHRYSLER JEEP DODGE RAM (4100 STEVENS CREEK BLVD, SAN JOSE, CA 95129, (408) 248-1800) WAS CONTACTED, BUT COULD NOT DUPLICATE THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER HAD NOT ISSUED A POWER TRAIN RECALL CAMPAIGN. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 17,000.",
        "vin": "1C4SDJCTXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/04/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229438,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNAL STOPPED WORKING FOR A FEW DAYS; THEN IT STARTED BACK WORKING FOR ABOUT A WEEK. THE FIRST TIME IT HAPPENED I WAS STATIONARY AT A LIGHT WAITING TO TURN. THEN IT STOPPED WORKING AGAIN, SO I TOOK MY VEHICLE IN TO GET IT FIXED. THE FRONT PART OF MY AIR CONDITIONING STOPPED WORKING ON NUMEROUS OCCASIONS. IT STOPS, THEN I DRIVE AND HAPPEN TO HIT UNEVEN ROAD AND IT WOULD JUMP BACK ON. AT THE MOMENT IT IS NOT WORKING. THE FRONT SECTION OF THE AIR CONDITIONING BREAKS DOWN OUT OF NOWHERE, BUT THIS HAS NEVER HAPPENED TO THE BACK PORTION OF MY AIR CONDITIONING. THIS OCCURRENCE HAPPENS WHEN STATIONARY, OR WHEN THE VEHICLE IS IN MOTION.",
        "vin": "1C4RDHAG2HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217749,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO HEAD HOME FROM VACATION AND STOPPED AT A STORE WITH THE ENGINE RUNNING. VEHICLE ENGINE SPUTTERED THEN CUT OFF. TRIED TO START VEHICLE AND VEHICLE WOULD NOT START. SOUNDED LIKE IT WAS TURNING OVER.HAD TO HAVE CAR TOWED 2 1/2 HOURS TO OUR DEALERSHIP. ONCE IN DEALERSHIP FOUND TIPM TO BE DEFECTIVE WHICH CAUSED THE FUEL PUMP TO BREAK. 16 DAYS LATER THE WATER PUMP FAILED.  AT 28,000 MILES 3 MAJOR ENGINE PARTS HAVE BEEN REPLACED. NOT TO MENTION ALL THE OTHER FLAWS IN THIS VEHICLE. PASSENGER SIDE WINDOW ALSO WORKS INTERMITTENTLY.   VEHICLE  IS STILL IN SERVICE DEPARTMENT FOR THE SECOND TIME IN LESS THAN A MONTH.",
        "vin": "1C4SDHCT8HC"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "05/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217788,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PUT THE 2017 DURANGO AND THE SHOP ABOUT 5 TIMES FOR THE SAME THING AND THEY SAID THE WARRANTY WAS OUT AND IT COULDN'T BE FIXED AND I DIDN'T UNDERSTAND THAT FOR THE SAME THING OVER AGAIN THEY KEEP MESSING UP",
        "vin": "1C4SDJCT5HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210296,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A VEHICLE THAT WAS PREVIOUSLY BOUGHT BACK DUE TO THE ENGINE AND CONSOLE SHUTTING OFF WHILE IN OPERATION WAS SOLD TO ME BY BILL LUKE DODGE IN PHOENIX, AZ.  I WAS INFORMED THAT THIS PROBLEM WAS FIXED AND THAT IT HAD BEEN ANALYZED AT A FACILITY FOR MONTHS PRIOR TO BEING PUT BACK ON THE MARKET.  WHEN WE WENT TO TEST DRIVE IT THE SALESMAN DID EXPLAIN THAT IT HAD BEEN DIFFICULT TO START, BUT FURTHER EXPLAINED THAT THE SHOP WOULD FIX ANY ISSUES PRIOR TO IT BEING TURNED OVER TO US.  HE STATED IT WAS A DEAD BATTERY PROBLEM.  THE ENGINE LIGHT WAS ILLUMINATED.  LATER THAT WEEK WE WERE DELIVERED THE VEHICLE AND INSURED THAT THEY COULD NOT FIND ANY PROBLEMS.  THIS WAS MAY 1.  ON MAY 3, MY WIFE DROVE TO A LOCAL BUSINESS, AND WHEN SHE RETURNED TO THE VEHICLE, IT WOULD NOT START.  WHEN IT WOULD FINALLY START THE ENGINE LIGHT WAS ON, AND IT STAYED ON FOR TWO MORE CYCLES OF THE ENGINE.  THIS HAPPENED ON TWO MORE OCCASIONS.  ON MAY 6, WHEN THE PROBLEM OCCURRED AGAIN WE WERE ABLE TO DRIVE IT TO A LOCAL AUTO SHOP AND HAVE THEM RUN THE CODE.  THE READER DIAGNOSED THAT THERE WAS A U0100- \"LOST COMMUNICATION WITH THE ENGINE CONTROL MODULE\".  I DROVE THE VEHICLE FOR SERVICE ON MAY 7.  OVER THE COURSE OF THE NEXT SEVERAL WEEKS THE SERVICE PERSONNEL HAVE DISCOVERED NUMEROUS LOOSE WIRING HARNESSES, THOUGH THEY STILL HAVE BEEN UNABLE TO COMPLETELY REMEDY THE ISSUES.  THIS ISSUE HAS ALSO BEEN REFERRED TO THE BETTER BUSINESS BUREAU.",
        "vin": "1C4SDHCT8HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO FILL TANK WITH GASOLINE, THE PUMP CONSTANTLY SHUTS OFF.  I'VE ATTEMPTED MULTIPLE GAS STATIONS AND SEVERAL PEOPLE HAVE TRIED FILLING THE TANK AS WELL.  DOESN'T MATTER WHAT THE LOCATION/DIRECTION OF THE NOZZLE IN THE TANK FILL VALVE AREA....YOU CANNOT FILL THE TANK.  I'VE TAKEN THE VEHICLE IN 4 TIMES TO THE DEALERSHIP FOR REPAIR AND I AM STILL UNABLE TO FILL THE TANK.  THEY HAVE REPLACED THE FUEL NOZZLE, REPLACED THE GAS TANK, REPLACED THE FILTER & COMPLETELY DISASSEMBLED AND REASSEMBLED THE GAS TANK.",
        "vin": "1C4RDJDG5HC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205242,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 DURANGO, THE REAR SHOCK ARE BAD ON IT, THE VEHICLE ONLY HAS 26500 ON IT. DODGE CURRENTLY HAS 200+ OF THESE SHOCKS ON BACK ORDER. WITH THE SHOCKS BEING BAD IF I GO OVER A SMALL BUMP IT CAUSES THE BACK END OF THE VEHICLE TO GET LOOSE AND YOU ALMOST LOSE CONTROL OF THE VEHICLE. I'VE LOOKED AT SEVERAL DODGE DURANGO FORUMS AND THIS SEEM LIKE A COMMON ISSUE WITH THEM. I'VE CONTACTS DODGE ALL THEY TELL ME IS THEY ARE WORKING ON MAKING REPLACEMENT PARTS. I'M NOT DRIVING IT CURRENTLY BECAUSE I AM  CONCERNED  ABOUT LOOSING CONTROL OF THE VEHICLE BECAUSE OF THIS ISSUE. I HAVE BEEN WAITING ABOUT A MONTH OF REPLACEMENT PARTS AND IT'S GOING TO BE A FEW MORE WEEKS BEFORE THEY HOPEFULLY  HAVE THE PARTS. ALSO LOOKING AT THE DODGE FORUMS SOME PEOPLE HAVE HAD 3+ SET OF SHOCKS PUT IN THERE VEHICLE WITH THE SAME RESULT. IT DOES NOT SEEM LIKE DODGE IS TAKING THIS ISSUE SERIOUSLY AND I WOULD HATE FOR SOMEONE TO GET HURT OR KILLED BECAUSE OF THIS ISSUE.",
        "vin": "1C4RDJDG5HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203228,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER IS ENTERING LED TAIL LIGHTS ON REAR HATCH CAUSING LIGHTS TO FAIL WITHOUT WARNING",
        "vin": "1C4RDJAGHC7"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195767,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A ONGOING SAFETY ISSUE WHERE I HAVE ALMOST BEEN HIT IN A INTERSECTION FROM NOT BEING ABLE TO PUT THE SUV IN REVERSE. I HAVE BEEN ABLE TO DUPLICATE THE ISSUE ON MULTIPLE 2017 DURANGOS TO FCA THEY SAY IT IS NORMAL FOR THE CAR TO NOT GO IN REVERS FROM DRIVE, I AM DRIVING WRONG. THERE IS ONLY ONE WAY TO ROTATE THE SELECTOR FROM DRIVE TO REVERS. I SEE NOW MULTIPLE ISSUES WITH THIS FROM OTHER DRIVERS. CASE NUMBERS AS FOLLOWS   11081258  11041523  11185594  THIS SEAMS TO BE A PROGRAMMING ISSUE THAT IS ALLOWING OUR SUV'S TO HAVE THIS UNSAFE CONDITION. IF THIS HAPPENS IN A PARKING LOT IT MAY NOT BE A BIG DEAL, HOWEVER WHEN YOU NEED TO GET OUT OF THE WAY TO PREVENT A SAFETY INDECENT IT IS A BIG DEAL. THIS ISSUE HAS AND CONSISTENTLY HAPPENS STILL TO THIS DAY.",
        "vin": "1C4RDHAG8HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195944,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON FREEWAY,  RECEIVED A QUICK TEMP ICON (POPPED UP TOO QUICK TO SEE WHAT IT SAID), BUT I LOOKED AT TEMP AND SAW THE NEEDLE WAS CLOSE TO THE H (HOT).  AFTER STOPPING AT A GAS STATION AND CHECKING THE WATER/COOLANT LEVEL SAW IT WAS ALMOST EMPTY.  ADDED COOLANT. TOOK IT TO THE DEALER THE NEXT DAY AND AFTER TROUBLESHOOTING THEY FOUND IT WAS THE LEFT HEAD GASKET WAS LEAKING COOLANT AND THEY HAD TO REPLACE IT.",
        "vin": "1C4RDHAG4HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2019",
        "dateOfIncident": "03/08/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185594,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED AT IDLE FOR A FEW MINUTES - CHECK ENGINE LIGHT CAME ON, TRIED TO SHIFT INTO REVERSE - LIGHT ON SHIFT INDICATOR AND DASH BLINKED, NO REVERSE. TRIED DRIVE - LIGHT ON SHIFTER AND DASH BLINKED, NO DRIVE.  LUCKILY I WAS IN A PARKING LOT, BUT IF THIS HAD HAPPENED ON AN INTERSTATE?  TRIED TURNING THE CAR OFF SEVERAL TIMES FOR UP TO 30 MINUTES - IMPOSSIBLE TO MOVE THE VEHICLE!  SCARY!  HARD FAILURES NEED IMMEDIATE CORRECTION.  TOWED TO DEALER - THEY SAID THEY WILL LOOK AT IT NEXT WEEK.   WOO HOO!",
        "vin": "1C4RDJEG6HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183297,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2017 DODGE DURANGO RT AT 37,000 MILES I NOTICED WHEN RAINING WATER ENTERS THE CENTER RACING LIGHTS (SPECIFICALLY ON THE RIGHT SIDE) AND POOLS INSIDE SHORTING THE LIGHTS SO THEY DON'T WORK ANYMORE. CONDENSATION COLLECTS IN SEVERAL AREAS BECAUSE OF THE POOLING WATER.",
        "vin": "1C4SDJCT2HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182644,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. WHILE DRIVING VARIOUS SPEEDS, THE LIFTGATE LIGHTS FLICKERED. THERE WERE NO WARNING INDICATORS ILLUMINATED. DUROCHER AUTO SALES (4651 U.S. 9, PLATTSBURGH, NY 12901, (518) 563-3587) DIAGNOSED THAT THE LIFTGATE LIGHTS NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "1C4RDJEG7HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162458,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER COLLECTING IN LIFT GATE RACETRACK TAIL LIGHT.",
        "vin": "1C4RDHAG0HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162611,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS BELOW 11,000 MILES AND HAS WATER POOLED IN THE BACKUP LAMP ASSEMBLY (RACETRACK LIGHT) IN THE REAR OF THE VEHICLE. THIS IS CAUSING THE LED'S TO FLICKER AND SHORT OUT AT RANDOM. THIS ASSEMBLY IS ALSO THE CENTER BRAKE LIGHT FOR THE VEHICLE. WITHOUT BEING CORRECTED THIS ISSUE WILL LEAD TO THE ENTIRE ASSEMBLY TO FAIL.",
        "vin": "1C4SDJCT1HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "10/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11139110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "YES, I HELPED I THINK SOLVE THE REASON FOR A CRASH I SAW TODAY IN REGO PARK, NYC THERE AT 99 ST AND 63 DRIVE THERE WITH AN UNDERCOVER NYPD VAN AND A WHITE CAR BEING SMASHED THERE BY AN NYPD VAN EN ROUTE THERE SPEEDING THROUGH A RED LIGHT. YES, I TOLD IAB THERE OF THE NYPD THAT LIKE I BELIEVE THAT THE HORN ON THE VEHICLE THERE THE DARK UNDERCOVER NYPD VAN THERE SPEEDING THROUGH THE LIGHT THERE ON 99 ST AND 63 DRIVE THERE WAS NOT LOUD ENOUGH WITH THE SIRENS THERE, THE OPERATOR OF THE BLACK NYPD VAN THERE UNDERCOVER JUST USED HIS RED LIGHTS AND LIKE A SMALL SOUND THERE. THEY SHOULD USE LOUDER SOUNDS THAN THAT AND A LOUDER HORN I TOLD THE IAB THERE OF THE NYPD THERE. YES, WHEN I SAW IT, I WAS STUNNED THERE AND WAS THE FIRST TO DIAL 911 THERE AND TOLD THE 911 OPERATOR OF THE NYPD THERE ON 10-8-2018 AROUND 1 PM \"I THINK ONE OF YOUR NYPD CARS WAS IN AN ACCIDENT...\" YES, LATER ON, I THINK I FOUND OUT THE ERROR OF THE NYPD OFFICER IN THE BLACK VAN THERE, HE DID NOT USE LOUD ENOUGH HORNS SPEEDING I THINK NORTH ON 99 ST THERE BY 63 DRIVE THERE CAUSING HIM TO SMACK RIGHT INTO THE WHITE CAR THERE THAT BADLY. WHEN THE STREET HAD CLEARED WITH THE FDNY AND EMS AND THE NYPD 112 WERE JUST THERE, I FOUND ALL MIRRORS AND THOUGH SOMEBODY GOT INJURED THERE AT THE SCENE. I DID NOT THINK OF THIS AT THAT TIME SO EVEN IF I SAW THE NYPD 112, I POINTED THEM TO THE CRASH THERE, I WOULD NOT THINK THIS BACK THEN. YES, INDEED, THE HORN ON THE VEHICLE THERE OF THE UNDERCOVER NYPD VAN WAS NOT LOUD ENOUGH WHEN THE OFFICER WAS SPEEDING THROUGH THE RED LIGHT THERE AND LIKE HE SMACKED INTO THE VEHICLE THERE. BAD ENOUGH DAMAGE THERE. *DSY",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133433,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A BLACK 2017 DURANGO GT WITH 37,000 MILES AND THE PAINT IS STARTING TO BUBBLE ON THE HOOD",
        "vin": "1C4RDJDG8HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/25/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131125,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VECHILE STOP AT LIGHT TRUCK SHUTS OFF AND WONT START BACK UP GEAR SHIFT IS BLINKING EVEN WHEN SHIFTED BACK TO START VEHICLE FAILED TO START. AFTER 3X FINALLY STARTED AND I COULD GET OUT THE ROAD SO DANGEROUS",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2018",
        "dateOfIncident": "08/04/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130789,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SUPPOSED TO HAVE HAD RECALL SERVICE COMPLETED ON MY VEHICLE JULY 23, 2017. A FEW DAYS LATER, I STARTED EXPERIENCE A BANGING NOISE AND SHAKING OF THE CAR. I CONTACTED SERVICE TO SCHEDULE AN APPOINTMENT AND NO ONE RETURNED MY CALL. A LITTLE MORE THAN A WEEK LATER ON AUGUST 4TH, WHILE DRIVING BETWEEN 40 AND 50 MPH, THE CAR STARTED MAKING A GRINDING NOISE, LOST POWER, SLOWED DOWN AS IT STARTED TO SPUTTER. THE SOUNDS AND FEELING, REMINDED ME OF DRIVING A MANUAL CAR AND HAVING IT IN THE WRONG GEAR. I HAVE TAKEN THE CAR IN TO THREE DEALERSHIPS, FIVE TIMES NOW. ONLY TO BE TOLD, NO CODES WERE FOUND SO NOTHING CAN BE DONE. DODGE NEEDS TO TRAIN ITS MECHANIC HOW TO DIAGNOSE CARS WITHOUT A CODE AND LISTEN TO THEIR CUSTOMERS.",
        "vin": "1C4SDHCT2HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/14/2018",
        "dateOfIncident": "09/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129585,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. WHILE DRIVING 75 MPH, THE STEERING WHEEL SEIZED. THE CONTACT HAD TO USE EXTRA STRENGTH TO STEER THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 34,104.",
        "vin": "1C4RDHAG5HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113642,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. WHILE ATTEMPTING TO REFUEL, THE FUEL WOULD NOT PROPERLY ENTER THE FUEL TANK AND CAUSED THE FUEL NOZZLE TO CONTINUOUSLY STOP. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (SUBURBAN DODGE/CHRYSLER, 32850 FORD RD, GARDEN CITY, MI) WHO INDICATED THAT AN UNKNOWN PART WAS NEEDED AND WAS ON BACKORDER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 2,000.",
        "vin": "1C4RDJAG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "07/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112191,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WOKE UP ONE MORNING AND STARTED MY CAR AND A GREY SCREEN COVERED THE SPEEDOMETER. I RESTARTED MY CAR AND NOW HALF OTHE SCREEN IS GRAYED OUT.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102301,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2017 DURANGO WITH 3000 MILES, HAD AN ENGINE LIGHT FOR OVERHEATING,   QUICKLY THEREAFTER AN ENGINE LIGHT POPPED ON, TRANSMISSION LIGHT POPPED ON,   ALL GAUGES THEN CEASED TO OPERATE AND THE CAR TURNED OFF AS WE WERE COASTING DOWN HILL (LUCKILY INTO SERVICE STATION). THE TRANSMISSION IS A DIAL AND THEN PUTTING IT IN NEUTRAL BECOMES AN ISSUE FOR THE TOW OR TO PUSH IT. THE ENGINE STARTING KNOCKING TERRIBLE.",
        "vin": "1C4RDJDG5HC"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2018",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099283,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE CURRENTLY 2 RECALLS FOR MY VEHICLE THAT I WAS ONLY MADE AWARE OF DUE TO ME CALLING THE DEALSHIP FOR REPORTING A NOISE COMING FROM THE REAR UNDER CARRIAGE OF MY VEHICLE. I AM A CDL CLASS A HOLDER AND AFTER CALLING THE DEALERSHIP ON JUNE 2ND, THEY TOLD ME THEY CAN'T LOOK AT MY VEHICLE UNTIL JUNE 27TH. HAVING SAID THAT AND ME BEING A CDL CLASS A HOLDER, YOU CANNOT DRIVE A VEHICLE THAT IS A POSSIBLE HAZARD ON THE ROADWAY SO WHY IS THE DEALERSHIP TELLING ME I CAN DRIVE THE VEHICLE UNTIL THEN KNOWING THAT IT POSES AND IMMEDIATE THREAT TO ME, MY FAMILY, AND OTHER CITIZENS ON THE ROADWAY?",
        "vin": "1C4RDJDG0HC"
    },
    {
        "components": "STEERING,SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091980,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WILD SHIELD WIPERS ARE NOT EFFECTIVE DURING HEAVY RAIN. STEERING WHEEL MAKES NOISE WHILE TURNING. BREAKS ARE NOT GOOD QUALITY.",
        "vin": "1C4RDHDG7HC"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081258,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT INVOLVING SHIFTING PROBLEMS.   WHEN I GET IN MY CAR AND I PUT IN DRIVE THE LIGHT  STARTS FLASHING AND MY VEHICLE DOES NOT MOVE. I HAVE TO PUT IN PARK TURN OFF THE VEHICLE AND TURN IT BACK ON AND DO IT ALL OVER AGAIN UNTIL IT FINALLY CATCHES THE GEARS AND LETS ME DRIVE OFF. I ALSO HAVE THE SAME PROBLEM  WHEN I PUT THE VEHICLE IN REVERSE. THE LIGHT THAT FLASHES IS THE ONE ABOVE THE SHIFTING NOB.",
        "vin": "1C4RDJDG5HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081344,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING HOME (APPROXIMATELY 25 MINUTES OF DRIVING), WHEN WE PUSHED THE BUTTON TO TURN OFF THE CAR, IT STAYED ON \"RUN\". WE PUSHED IT AGAIN, AND THE CAR TURNED OFF. AFTER OPENING THE DOOR, THE RADIO AND LIGHTS STAYED ON. EVEN AFTER CLOSING AND LOCKING THE CAR, THE RADIO STAYED PLAYING. AFTER SEARCHING THE HANDBOOK AND GOOGLING, WE DETERMINED THAT THE ONLY WAY TO GET IT TO TURN OFF WAS TO DISCONNECT THE BATTERY. THIS HAS HAPPENED TWICE MORE, WITH JUST THE CAR STAYING ON \"RUN\" AFTER PUSHING THE BUTTON, BUT AFTER PRESSING IT A COUPLE MORE TIMES, THE CAR AND RADIO TURNED OFF. AFTER CONTACTING THE DEALERSHIP, WE WERE TOLD THAT THEY HAVEN'T HEARD OF THIS HAPPENING. *TT    *CN  *JS",
        "vin": "1C4RDHDG2HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/09/2018",
        "dateOfIncident": "03/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078419,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING RAIN OR WASHING, WATER COLLECTS IN THE REAR BACKUP LIGHT ASSEMBLY CAUSING CONDENSATION INSIDE THE ASSEMBLY.",
        "vin": "1C4SDJCT6HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "01/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062711,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE VEHICLE BRAND NEW HAS A LITTLE OVER 10,000 MILES ON IT NOW, STARTED NOTICING STANDING WATER IN THE RACETRACK (BACK GATE) LED LIGHTS TOOK IT TO THE DEALERSHIP TO FIND OUT WHY WATER WAS GETTING IN THEY INFORMED ME THE BRAKE LIGHT HAD A CRACK WHICH I THOUGHT WAS A SEAM (WHERE THE 2 PARTS MET) IT IS A STRAIGHT LINE DOWN, VEHICLE HAS NEVER BEEN IN A ACCIDENT OR DAMAGED, SO THE BRAKE LIGHT CRACKED IN ITS OWN. AFTER A LITTLE RESEARCH I FOUND OUT THIS IS VERY COMMON AND DON'T UNDERSTAND HOW THIS CAN BE SAFE SINCE WATER IS GETTING INTO SOMETHING ELECTRICAL AND CAUSING LED BRAKE LIGHTS TO FAIL OR BURN OUT.",
        "vin": "1C4RDHAG9HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2017",
        "dateOfIncident": "11/27/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048876,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPORTED MY CAR NOT GOING IN THE  GEAR SELECTED AND INSTEAD GOING INTO NEUTRAL OR PARK. IT HAS ALSO DRIVEN FORWARD WHEN IN PARK. THERE HAS ALSO BEEN ISSUES WITH THE AUTO PARK NOT ALWAYS WORKING IF DOOR IS OPENED AND THE CAR IS IN GEAR. NOW I AM BEING TOLD MY CAR EVEN THOUGH IT CAME WITH THIS SAFETY FEATURE WAS NOT SUPPOSED TO COME WITH IT, AND DODGE IS LOOKING TO REMOVE THIS FEATURE. DODGE HAS ALSO REFERRED TO THESE SAFETY ISSUES AS CHARACTERISTICS OF MY CAR. WHEN THEIR IS A SAFETY DEFECT IT CANT BE A CHARACTERISTIC THAT CAN BE OVERLOOKED. MY CAR NOW HAS BEEN IN THE SHOP FOR 37 DAYS NOW AND UNABLE TO BE REPAIRED.  SEE ALSO ODI 11041523.  *DSY *BF  *TR",
        "vin": "1C4RDHAG8HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "10/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041523,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS PUT INTO PARK AND YOU EXIT IT WILL SOMETIMES STILL DRIVE FORWARD. WHEN SWITCHING INTO REVERSE OR PARK THE CAR SOMETIMES LOCKS UP AND WONT MORE. THE RPMS GO UP BUT ITS STILL AS IF ITS IN PARK. I HAD TO PUT MY CAR INTO REVERSE TO TRY TO AVOID AN ACCIDENT AND THE TRANSMISSION WOULD NOT ENGAGE INTO REVERSE. MY  WIFE WAS REMOVING GROCERIES AND THE CAR STARTED TO MOVE FORWARD. SHE HAD TO GET INTO THE CAR AND PRESS THE BREAK. THESE CONDITIONS HAVE HAPPENED WHEN THE CAR WAS AT A STOP OR PARKED. I HAVE STARTED TO RECORD WHEN IT HAPPENS IF IT IS SAFE TO DO SO. THIS HAS HAPPENED ON DIFFERENT OCCASIONS. IT ALSO HAS HAPPENED SINCE I PURCHASED THE CAR  ..UPDATED 12/13/17 *BF  SEE ALSO ODI 11048876. *DSY  UPDATED 9/13/18*JB",
        "vin": "1C4RDHAG8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "05/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034447,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BURNING SMELL COMING THROUGH THE VENTS DURING ENGINE OPERATION ABOVE 4000 RPM. IT IS CONSISTENTLY HAPPENING SINCE BRAND NEW AND NOW AT 10,000 MILES. THE VEHICLE HAS BEEN TO THE DEALER 4 TIMES FOR VARIOUS OTHER REASONS AND THIS WAS REPORTED EVERY TIME. DEALER ADVISED US TO LEAVE CLIMATE CONTROL ON RECIRCULATION. THERE IS ALSO A DIFFERENT STRONGER EXHAUST SMELL THAT COMES INTO THE VEHICLE WHEN IDLING FOR S LONG PERIOD OF TIME. THIS HAPPENS INCONSISTENCY BUT IS SO STRONG THAT IT MAKES THE OCCUPANTS SICK. WE HAVE BEEN UNABLE TO DUPLICATE THIS SMELL FOR THE DEALERSHIP SERVICE TECHNICIAN. DODGE CUSTOMER SERVICE HAS BEEN CONTACTED REGARDING THESE ISSUES.",
        "vin": "1C4SDJCT7HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/25/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025472,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2017 DODGE DURANGO CITADEL (6980 MILES) HOME FROM WORK, I HAD THE ADAPTIVE CRUISE CONTROL SET. I WAS IN A STEADY LINE OF TRAFFIC AND CARS LINED UP BEHIND ME. THE TRUCK STARTED TO STEADILY DECREASE IN SPEED, THERE WERE NO OBJECTS IN THE PATH OF THE VEHICLE AND THE CAR IN FRONT WAS AT LEAST 6 CAR LENGTHS AHEAD. WHEN I TRIED TO ACCELERATE THE VEHICLE NOTHING HAPPENED WHEN I TRIED TO ACCELERATE, I THEN ATTEMPTED TO BRAKE, MY BRAKES WERE NOT ACTIVE AS WELL. I PLACED MY HAZARD LIGHTS ON AND ATTEMPTED TO TURN THE STEERING WHEEL SLIGHTLY TO MOVE MY VEHICLE FROM THE ROAD. HOWEVER, AT THIS TIME MY STEERING HAD TIGHTENED AND I COULD NOT MOVE MY VEHICLE. I ENDED UP COASTING TO THE RIGHT SIDE OF THE ROAD UNTIL MY VEHICLE CAME TO A STOP. NOTHING WAS WORKING ON MY TRUCK. I COULD NOT OPEN MY DOOR OR LET MY WINDOWS DOWN. IT WAS LIKE I WAS TRAPPED INSIDE. FINALLY, I WAS ABLE TO GET MY WINDOWS DOWN AFTER 3 OR MORE MINUTES. WHEN THE TOWING SERVICE PICKED MY VEHICLE UP, THE BACK WINDOWS WOULD NOT ROLL UP AND MY LIFT GATE OPENED BY ITSELF. WE GOT THE LIFT GATE BACK DOWN MANUALLY. HOWEVER, THE VEHICLE WOULD NOT START. IF YOU PLACED YOUR FOOT ON THE BRAKE, PUSHED THE START BUTTON IT JUST MADE A CLICKING NOISE. THE VEHICLE IS CURRENTLY AT THE DEALERSHIP AND WILL BE LOOKED AT TOMORROW, 9/26/17. THIS COULD HAVE BEEN A HORRIBLE, FATAL ACCIDENT. SOME TYPE OF INVESTIGATION NEEDS TO TAKE PLACE INTO THIS MATTER. MY SON AND I TRAVEL MANY MILES A WEEK AND THIS WOULD HAVE DEFINITELY BEEN FATAL IF WE WERE ON THE INTERSTATE ON AN INSIDE LANE.",
        "vin": "1C4RDHEG9HC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022852,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TWO INCIDENTS OCCURRED WHILE THE VEHICLE WAS PARKED AND IDLE. THE VEHICLE WOULD NOT TURN ON AND ALL SYSTEM INDICATIONS WERE BEING ALERTED ON THE DASHBOARD SCREEN (POWER STEERING OFF, PARK ASSIST OFF, CHECK ENGINE LIGHT, ETC.). THE THIRD INCIDENT OCCURRED WHILE DRIVING THE VEHICLE DOWN A MAIN THOROUGHFARE. THE VEHICLE STARTED \"BEEPING\" WITH A RED LED FLASHING IN THE DASH. THE DASHBOARD SCREEN WAS ALERTING ME TO PUT THE VEHICLE IN PARK. ONCE IN PARK, THE VEHICLE SHUT OFF AND I WAS UNABLE TO RESTART IT. I HAVE VIDEO SHOWING THE INDICATIONS IF SOMEONE NEEDS TO REACH OUT TO ME. IT IS AT A DEALERSHIP SERVICE DEPARTMENT FOR THE THIRD TIME, INVOLVING THE SAME ISSUES....UPDATED 12/11/17 *BF  UPDATED 7/17/18*JB  .",
        "vin": "1C4RDHDG5HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11022384,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I RENTED 2017 DODGE DURANGO GT I HAVE THE TAILGATE OPEN AND THEN GRABBED BOTTLE CASE OF WATER I WAKE CLOSER TO THE TAILLIGHTS I CUT WITH THAT ,TAILLIGHTS HAVE PIECE OF THE TAILLIGHTS POINTING OUT IS DANGEROUS FILL LIKE A BLADE IF A CHILD GET CLOSER SOMETHING BAD GET I HAVE PIC FROM MY INJURY AND THE PLACE ON THE TAILLIGHTS",
        "vin": "1C4RDHDG4HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2017",
        "dateOfIncident": "07/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012549,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. WHILE DRIVING 55 MPH, THE VEHICLE BEGAN TO LOSE POWER AND THE TRANSMISSION INDICATOR ILLUMINATED. THE VEHICLE WAS ABLE TO RESTART. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE OCCURRED TWICE. AFTER THE SECOND FAILURE, THE VEHICLE WAS UNABLE TO RESTART. THE LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO THE LOCAL DEALER. THE FAILURE MILEAGE WAS APPROXIMATELY 2,700.",
        "vin": "1C4RDJAG8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003320,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAND NEW DODGE DURANGO SXT 2017 WAS STOLEN AT A SERVICE STATION. I GOT OUT OF MY CAR THAT WAS ON AND LOCKED. THIS PERSON USED SOME TYPE OF DEVICE TO OPEN IT WITHOUT THE KEY. IT IS 36 DAYS OLD.",
        "vin": "1C4RDHAGXHC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/20/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000211,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED TO BACK OUT OF MY DAUGHTERS GARAGE AND FELT THE TIRE HIT SOMETHING. I DIDN'T WANT TO BACK OVER IT SO I PULLED FORWARD, PUT THE VEHICLE IN PARK, OPENED THE DOOR AND STARTED TO GET OUT. I GOT ONE FOOT ON THE GROUND AND THE VEHICLE TOOK OFF IN REVERSE. I WAS THROWN BACK INTO THE SEAT. THE DOOR BEING PARTIALLY OPEN HIT A BOX WHICH FLUNG THE DOOR COMPLETELY OPEN. THE DOOR CLIPPED THE GARAGE DOOR JAM AND PUSHED THE DOOR INTO THE FRONT FENDER DAMAGING IT AND THE DOOR. I'M NOT SURE IF THE VEHICLE ACCELERATED BUT MY WIFE WHO WAS STANDING OUTSIDE SAID SHE WONDERED WHY I WAS BACKING OUT SO FAST. I GOT THE VEHICLE STOPPED JUST OUTSIDE THE DOOR AND SHUT IT OFF. IT ALL SEEMED TO HAPPEN PRETTY FAST.",
        "vin": "1C4SDHCT1HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/24/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980343,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A NOISE COMING FROM THE FUEL TANK (RIGHT SIDE SECOND ROW) I HAD TAKEN THE CAR TO THE DEALERSHIP AND THEY STAYS THAT THERE IS NO NOISE, THEY HAD BROUGHT ANOTHER DODGE DURANGO WITH THE SAME FUEL TANK AND THAT PARTICULAR VEHICLE DID NOT MAKE THE NOISE AS MINE DOES.",
        "vin": "1C4RDHEG1HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "03/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10970551,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. WHILE THE VEHICLE WAS IDLING AT A TRAFFIC LIGHT WITH THE AUTOMATIC MODE OR STOP/START FEATURE ACTIVATED, IT LUNGED FORWARD WHEN THE CONTACT'S FOOT RELEASED THE BRAKE PEDAL. THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF ANOTHER VEHICLE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES CONSISTENT WITH A CERVICAL STRAIN AND BRUISED RIBS, WHICH REQUIRED MEDICAL ATTENTION. THE OCCUPANT IN THE OTHER VEHICLE SUFFERED NO INJURIES. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE AWAY FROM THE SCENE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 6,999.",
        "vin": "1C4RDJAG4HC"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/29/2017",
        "dateOfIncident": "03/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969213,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OFFICER DRIVING THIS VEHICLE HAD PUT THE VEHICLE IN PARK.  THIS VEHICLE HAS THE ROTARY KNOB STYLE GEAR SELECTOR.  THE OFFICER WAS GETTING HIS K9 PARTNER'S FOOD AND WATER READY IN HIS BACKYARD.  ACCORDING TO THE OFFICER, AFTER ABOUT 10 MINUTES, HE HEARD A LOUD NOISE.  WHEN HE WENT TO INVESTIGATE THE NOISE, HE FOUND THAT THE SUV HAS DROVE THROUGH HIS GARAGE DOOR.  THE OFFICER STATES THAT THE GEAR INDICATOR SHOWED THAT THE VEHICLE WAS IN PARK.",
        "vin": "1C4RDJFG5HC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "02/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955350,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DISTINCT THUD OR LOW PITCHED BANGING SOUND WHEN DRIVING OVER A TRANSITION CURB FROM A CITY STREET INTO A SERVICE TYPE DRIVEWAY OR VICE VERSA, DRIVING OVER MAN HOLE COVERS, DRIVING OVER INSIGNIFICANT ROADWAY POT HOLES, HITTING SHARPER BUMPS IN THE ROADWAY. MOST TIMES THERE WILL BE A SIDE TO SIDE MOTION, BUT ALWAYS A BANG OR THUD AT THE LEFT REAR SHOCK ASSEMBLY AT SPEEDS BETWEEN 25 TO 40 MPH.    THIS CONCERN HAS BEEN PREVIOUSLY ADDRESSED FROM THE NHSTA TO CHRYSLER DATING BACK TO 2011 AND CHRYSLER HAS ISSUED 4 TSB'S THAT CONTINUE TO BE INEFFECTIVE.    CHRYSLER CONTINUES TO IGNORE THE SAFETY RELEVANCE, REGARDING THE VEHICLES REAR SUSPENSION.",
        "vin": "1C4SDHCT6HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2017",
        "dateOfIncident": "12/26/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947914,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 DODGE DURANGO. THE CONTACT STATED  THAT THERE WAS OIL LEAKING FROM THE BOTTOM OF THE VEHICLE. THE DEALER DIAGNOSED THAT THE REAR MAIN SEAL WAS LEAKING AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER, WHO DETERMINED THAT THE OIL PAN WAS LEAKING. THE OIL PAN WAS REPLACED; HOWEVER, THE REMEDY FAILED TO CORRECT THE FAILURE. AS A RESULT, THE TRANSMISSION PUMP NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 300.",
        "vin": "1C4SDJCT5HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947922,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TWO DAYS OF USE AND THREE HUNDRED TOTAL MILES ON MY VEHICLE I DISCOVERED AN OIL LEAK. VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE TECHNICIANS INFORMED ME THAT THE LEAK FROM THE REAR MAIN SEAL ON THE TRANSMISSION. THE VEHICLE WAS REPAIRED, THE NEXT MORNING I NOTICE OIL LEAKING FROM THE SAME AREA. I TAKE THE VEHICLE TO THE DEALERSHIP FOR A SECOND TIME AND AFTER A COUPLE OF DAYS I WAS INFORMED THAT THE VEHICLE HAD A DEFECTIVE OIL PAN THAT NEEDED TO BE REPLACED. A WEEK GOES BY AND THE DEALERSHIP INFORMS ME THE VEHICLE IS READY FOR PICKUP. THE NEXT DAY I  CONTACT THE DEALERSHIP TO ARRANGE TO PICK UP THE VEHICLE AND WAS TOLD THE LEAK IS STILL PRESENT WHICH RESULTED IN A STAR CASE WHICH THE MANUFACTURERS ENGINEERS ARE ASSISTING THE LOCAL TECHNICIANS IN RESOLVING THE ISSUE. APPROXIMATELY TEN DAYS LATER I WAS TOLD THAT THE TRANSMISSION PUMP WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE IS CURRENTLY IN THE SHOP WITH NO RESOLUTION BY THE MANUFACTURER. AFTER REVIEWING COMPLAINTS FILED ON WEBSITE VEHICLE FORUMS I DISCOVERED MANY VEHICLES ARE EXPERIENCING THE SAME ISSUES AS THE ONE I OWN. WITH MY EXPERIENCE TO DATE I FEEL THE MANUFACTURER IS NOT DISCLOSING THE SEVERITY AND EXTENT OF THE PROBLEM INHERENT WITH THE VEHICLE TO ITS CUSTOMERS CREATING A SERIOUS RISK OF INJURY TO THE OPERATORS/OCCUPANTS OF THE VEHICLES INVOLVED. IT IS MY RECOMMENDATION THAT  AN INVESTIGATION SHOULD BE INITIATED INTO THIS MATTER.  *TR",
        "vin": "1C4SDJCT5HC"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937043,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NO ACCIDENT HAPPENED YET BUT I BELIEVE ONE WILL. THIS CAR IS EQUIPPED WITH A ROTARY TRANSMISSION SELECTOR FOR DRIVE BY WIRE TRANSMISSION AND HAS AN AUTO ENGINE STOP START FEATURE. THIS START STOP FEATURE CAN BE DISABLED AFTER THE VEHICLE IS STARTED, BUT CANNOT BE SET BY DEFAULT TO DISABLE THIS FEATURE. I UNDERSTAND THE FUEL SAVING ISSUE, HOWEVER BUT MANY OF US HAVE BEEN DRIVING FOR MANY YEARS AND WE DO A LOT OF THINGS UNCONSCIOUSLY BECAUSE THESE ACTIVITIES ARE SO COMMON TO US. WHEN THIS FEATURE IS ACTIVATED AND YOU COME INTO YOUR DRIVE WAY, YOUR GARAGE OR A PARKING SPACE AND FULLY COME TO A STOP, THE ENGINE TURNS OFF AND ALL GOES QUIET. SUBCONSCIOUSLY BECAUSE OF A LIFETIME OF DRIVING EXPERIENCE, YOU THINK THE CAR IS OFF, YOUR TRAVEL IS OVER AND YOU ARE READY TO EXIT THE VEHICLE. YOU START TO OPEN THE DOOR AND RELEASE THE BRAKE PEDAL AND THE VEHICLE IMMEDIATELY RESTARTS AND MOVES FORWARD. IF A CHILD OR SOMEONE ELSE OR A BUILDING WALL IS IT FRONT OF THE VEHICLE, A SERIOUS ACCIDENT COULD HAPPEN.  PLEASE RETHINK THIS. IT IS NOT AN INTUITIVE PROCESS WHEN WE HAVE YEARS OR DECADES OF A DIFFERENT DRIVING EXPERIENCE. WE THINK THE CAR IS OFF, SAFE TO EXIT. WE NEED A WAY TO DEFAULT DISABLE THIS FEATURE RATHER THAN DEFAULT ENABLE.  I KNOW THERE IS AN INVESTIGATION REGARDING DEATH OR INJURY WITH REGARD TO THE TRANSMISSION ON THESE VEHICLES, SPECIFICALLY A CLAIM THAT VEHICLE COULD MOVE WITH SELECTOR PUT IN THE PARK POSITION. I WONDER HOW MANY ACCIDENTS WERE RESULT OF DRIVERS THINKING THE VEHICLE WAS OFF AND THEN IT MOVED. IT MAY BE EMBARRASSING AND NOT BE ADMITTED TO.  *TR",
        "vin": "1C4RDHEG3HC"
    }
]