[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339999,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MAY 3, 2019 NHTSA CAMPAIGN NUMBER: 19V342000    BRAKE LIGHT MAY RANDOMLY ILLUMINATE    IF THE BRAKE LIGHTS INCORRECTLY ILLUMINATE, IT CAN CONFUSE OTHER DRIVERS, POSSIBLY INCREASING THE RISK OF A CRASH.         NHTSA CAMPAIGN NUMBER: 19V342    MANUFACTURER TAYLOR MADE AMBULANCES    COMPONENTS EXTERIOR LIGHTING    POTENTIAL NUMBER OF UNITS AFFECTED 17         SUMMARY    TAYLOR MADE AMBULANCES IS RECALLING CERTAIN 2017-2018 FORD E-350, F-450, E-450, F-550, AND GMC G3500-BASED AMBULANCES EQUIPPED WITH WHELEN BRAKE LIGHTS. DEPENDING ON THE SPECIFIC WIRING OF THE VEHICLE, THESE BRAKE LIGHTS MAY ILLUMINATE WHEN THE BRAKE PEDAL HAS NOT BEEN PRESSED.                      REMEDY    TAYLOR MADE WILL NOTIFY OWNERS AND WHELEN WILL REPLACE THE BRAKE LIGHTS, FREE OF CHARGE. THE RECALL BEGAN JUNE 5, 2019. OWNERS MAY CONTACT TAYLOR MADE AMBULANCES CUSTOMER SERVICE AT 1-800-468-1310.       COMPANY CLOSED, UNABLE TO DRIVE OUR AMBULANCE",
        "vin": "1FDWE3FS4HD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2019",
        "dateOfIncident": "04/30/2019",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207455,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FORD E -350. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AND WAS JUMP STARTED. ADDITIONALLY, THE VEHICLE FAILED TO SHUTDOWN WHEN THE KEY WAS REMOVED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER GRIECO FORD (1651 NEW STATE HWY, RAYNHAM, MA 02767 (508) 219-4544) WHERE IT WAS DIAGNOSED THAT THE CLUSTER MODULE AND INSTRUMENT PANEL CLUSTER NEEDED TO BE REPLACED. IN ADDITION, WHILE AT THE LOCAL DEALER THERE WAS SMOKE EMERGING FROM THE STEP WELL. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "1FDWE3FS8HD"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193234,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON HIGHWAY AND GO OVER A BUMP IN ROAD THE TRUCK GOES INTO A DEATH WOBBLE AND YOU NEED TO IMMEDIATELY  HIT THE BRAKES AND SLOW DOWN TO ALMOST A COMPLETE STOP TO GET THE TRUCK BACK UNDER CONTROL. VERY LIFE THREATENING. THIS IS THE SECOND TIME I HAVE HAD TO TAKE BACK TO DEALER FOR SAME REASON.  THE LAST TIME THIS HAPPENED IT ALMOST THREW ME IN THE DITCH. THIS IS A VERY SERIOUS SITUATION AND THERE SHOULD ABSOLUTELY BE A RECALL DONE BEFORE SOMEONE GETS KILLED WHEN THIS HAPPENS.",
        "vin": "1FT8W3BT4HE"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED THE INFAMOUS FORD \"DEATH WOBBLE\" AFTER HITTING A ROAD DIP AT 65MPH WHILE TRAVELLING TO FL. I WAS PULLING OUR 5TH WHEEL CAMPER. I RE-EXPERIENCED IT AGAIN 15 TIMES DURING THE SAME TRIP!!! FRONT END SHAKES UNCONTROLLABLY UNTIL YOU SLOW DOWN BELOW 40, WHICH IS A HAZARD ON A FREEWAY!  OCCURRED SEVERAL TIMES AROUND 45-50 MPH, TOO.  PLEASE HAVE FORD ISSUE A RECALL!!!  I AM NOT THE ONLY OWNER EXPERIENCING THIS PROBLEM AND IT IS A HAZARD TO DRIVE AND HAVE IT OCCUR.",
        "vin": "1FT8W3DTXHE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182619,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THIS VEHICLE AT HIWAY SPEED OF 60 MPH, I HIT A BUMP IN THE ROAD, THE VEHICLE STARTED VIBERATING VIOLENTLY IN THE FRONT END. THE STEERING WAS NEARLY UN-CONTROLLABLE. I TOOK THE VEHICLE TO MY DEALERSHIP WHERE THE ORDERED A PART THAT WAS SUPPOSED TO FIX THE PROBLEM. IT DID NOT FIX THE PROBLEM. THERE SEEMS TO BE AN ISSUE WITH THIS MODEL OF VEHICLE SINCE OTHER TRUCK OWNERS HAVE EXPERIENCED THE SAME PROBLEM. THIS IS A SERIOUS SAFETY CONCERN, AND SHOULD BE PLACED ON A RECALL.",
        "vin": "1FT8W3BT2HE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182400,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAILGATE OPENS ON IT'S OWN WHILE DRIVING OR IN PARK IN WET WEATHER ON ANY ROAD.",
        "vin": "1FT8W3BT0HE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180979,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS USED AS AN AMBULANCE. ON TWO SEPARATE OCCASIONS THE VEHICLE WAS INVOLVED IN TWO MAJOR ACCIDENTS, ONCE GOING FORWARD FROM A STATIONARY POSITION THROUGH OUR BUILDING GARAGE DOOR AND THE OTHER WHILE IN REVERSE TRYING TO SLOW DOWN BACKING UP AND GOING THROUGH AN INTERIOR BUILDING WALL. THE GAS AND BRAKE PEDAL ARE LOCATED TOO CLOSE TOGETHER. WHEN THE DRIVER WENT TO APPLY THE BRAKES HIS FOOT PRESSES DOWN ON THE THROTTLE PEDAL AT THE SAME TIME, CAUSES THE VEHICLE TO TAKE OFF. THE MORE BRAKE YOU PUSH THE MORE THROTTLE IS PRESSED. WE ALSO ON TWO OTHER OCCASIONS WHEN THE VEHICLE WAS OUTSIDE HAVE HAD THE DRIVERS WHILE DEPRESSING THE BRAKE IN A STATIONARY POSITION SHIFTING FROM PARK TO DRIVE ALSO PRESS THE GAS CAUSING THE VEHICLE TO GO TO A VERY HIGH RPM AS THEY SHIFTED INTO DRIVE CAUSING THE VEHICLE TO LAUNCH FORWARD. EACH INCIDENT THAT OCCURRED INVOLVED DIFFERENT DRIVERS. I PERSONALLY AM RESPONSIBLE FOR ALL VEHICLE MAINTENANCE FOR THE ASSOCIATION, I MEASURED THE CLEARANCE BETWEEN THESE PEDALS AS COMPARED TO OUR OTHER AMBULANCE. THE PEDALS ON THE VEHICLE IN QUESTION IS ALMOST 3/4 OF AN INCH CLOSER THAN OUR F450. THE VEHICLE WAS BROUGHT TO THE DEALER AFTER THE FIRST ACCIDENT AND CHECKED AND NO ISSUE WAS FOUND. ACCIDENTS OCCURRED 1/18/2018 AND 2/7/2019 *DT*JB  *BF*JB",
        "vin": "1FDWE3FS3HD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132654,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UNINTENDED ACCELERATION OCCURRED TWICE IN SEPTEMBER 2018. ONCE WHILE IN REVERSE; THE OTHER WHILE IN DRIVE. NO ACCIDENT OR INJURY OCCURRED. THIS IS A NEW VEHICLE. THE TRUCK WAS STATIONARY AT A RED LIGHT. WHEN THE INCIDENT OCCURRED WHILE IN DRIVE. I WAS SLOWLY BACKING UP IN A PARKING LOT, WITH MY FOOT ON THE BRAKE WHEN THE INCIDENT OCCURRED WHILE IN REVERSE.",
        "vin": "1FDWE3FS6HD"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/23/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131154,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON INTERSTATE AT THE SPEED OF 75 MPH WENT OVER A SMALL BUMP ON ROAD THAT HAD BEEN REPAIRED AND MY TRUCK WENT INTO A SEVERE FRONT END SHAKE AND WOBBLE THAT I JUST ABOUT WENT INTO THE DITCH. (SCARED TO DEATH) SLOWED DOWN TO 10 MPH AND IT STOPPED SO I SLOWLY REGAINED SPEED ONLY TO FIND THAT THE NEXT LITTLE BUMP I WENT OVER IT DONE IT AGAIN.  I AM HEAR TO SAY THAT IF I HAD BEEN PULLING MY LIVING QUARTERS HORSE TRAILER I AM SURE THE OUTCOME WOULD HAVE BEEN DIFFERENT.  SO I SEE OTHERS HAVE HAD THIS SAME ISSUE SO WHAT IS TAKING THE FORD MOTOR COMPANY SO LONG IN DOING A RECALL TO FIX THIS DEATH TRAP THAT WE ARE DRIVING ON PUBLIC HIGHWAYS?  I AM HEAR TO SAY THAT IF SOMETHING WOULD OF HAPPENED TO ME OR MY HUSBAND YOU WOULD BE HEARING FROM MY LAWYER.  LETS GET THE PROBLEM FIXED BEFORE SOMEONE IS KILLED IF THEY HAVEN'T BEEN ALREADY.  THIS IS THE FOURTH TIME IN THREE MONTHS THAT THIS HAS HAPPENED TO ME.  THE DATE LISTED BELOW IS THE LAST TIME THIS HAPPENED WHILE ON INTERSTATE.",
        "vin": "1FT8W3BT4HE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/03/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021294,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-350",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ORDERED A 2017 WITH AN ADVERTISED GVW OF 14,500 AND GCVW OF 22,000 (E450) BUT THE MANUFACTURER SUBSTITUTED A 2018 PRODUCT WITH A GCVW OF 18,500 (E350) AND GVW OF ONLY 12,500 WHICH IN MY OPINION IS A MAJOR SAFETY CONCERN CONSIDERING THAT MOST VEHICLES SOLD WILL LIKELY BE OVERWEIGHT WHEN IN USE AND IT CLEARLY WILL NOT MEET THE NEEDS OF WHAT WE EXPECTED TO RECEIVE. THOR IGNORES OUR CONCERNS AND HAS OFFERED NO SOLUTION AS TO HOW WE CAN SAFELY USE THIS MOTORHOME CONSIDERING IT IS BORDERLINE OVERWEIGHT WITH MINIMAL LOADING AND PASSENGERS.",
        "vin": "1FDWE3FS4HD"
    }
]