[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339980,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FOREST RIVER GEORGETOWN. THE CONTACT NOTICED THAT THERE WAS WATER LEAKING FROM THE ROOF ENTERING THROUGH THE DRIVER'S SIDE WALL. THE VEHICLE WAS TAKEN TO HITCH RV - DELAWARE (2152 BAY RD, MILFORD, DE 19963) WHERE IT WAS DIAGNOSED THAT THERE WAS A PART MISSING FROM THE ROOF. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED HOWEVER, THE CONTACT WAS UNABLE TO SPEAK TO ANYONE. THE APPROXIMATE FAILURE MILEAGE WAS 850.",
        "vin": "1F65F5DY5H0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/30/2020",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326615,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A BAD LEAK COMING FROM THE ROOF EDGE OF THE MOTORHOME TO THE INSIDE. IT WAS REPAIRED LAST NOVEMBER OF 2017 AND IT HAPPENED AGAIN THIS MONTH OF MAY. IT'S DAMAGING THE INSIDE WALL WITH WALLPAPER ON IT AND THE ELECTRONIC SWITCHES WHICH ARE ON THE DRIVER  SIDE. THIS DAMAGE COSTING ME $500.00.  *TR",
        "vin": "1F66F5DY0H0"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298414,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING OUR MOTORHOME WHEN SUDDENLY WE HAD NO POWER, LIGHTS OR STEERING. THANKFULLY I GOT IT PULLED TO THE SIDE OF THE ROAD AND CAME TO A COMPLETE STOP. I TURNED THE IGNITION OFF AT THIS TIME AND WAITED APPROXIMATELY 3 MINUTES BEFORE STARTING THE ENGINE. IT STARTED WITHOUT ISSUES AND WAS ABLE TO DRIVE IT APPROXIMATELY 50 MILES TO OUR FINAL DESTINATION WITHOUT PROBLEMS . WE FULL TIME RV SO WE WILL BE HERE UNTIL FEBRUARY1ST THEN MOVE ON TO OUR NEXT DESTINATION. THIS INCIDENT WAS VERY UNSETTLING AND HOPE THIS DOES NOT HAPPEN AGAIN. WE ARE AT A LOSS AS WHAT TO DO NEXT.",
        "vin": "1F66F5DY8H0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255882,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FOREST RIVER GEORGETOWN GT3. THE CONTACT STATED THAT THE REAR DRIVER'S SIDE WALL FRAME SEPARATED DUE TO A WELDING FAILURE. THE RV WAS TAKEN TO CAMPING WORLD OF THE VILLAGES (14200 US HIGHWAY 441 SUMERFIELD, FL, 34491, 888-3678134) WHERE THE CONTACT WAS INFORMED THAT THE RV COULD COLLAPSE IF THE WALL WAS NOT REPAIRED. THE RV WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 9,100.",
        "vin": "1F65F5DY7G0"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/02/2018",
        "dateOfIncident": "11/05/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099343,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PICKUP IN NOV,2017 STARTED LEAKING WATER RIGHT SIDE OF DASH, IT HAS BEEN BACK TO DEALER FOR REPAIRS IN MARCH 2018 PICKUP IN MAY 2018 STILL LEAKING WATER NOW INSIDE WINDSHIELD RIGHT CENTER -FORD BALANCED TIRES IN JAN 2018 STILL HAS VIBRATION ABOVE 65 MPH.OTHER WARRANTY WORK WORK WAS DONE REFRG.OUTSIDE DOOR PANEL WAS REPLACE,CRACK INSIDE CEILING BATHROOM VENT AREA REPAIRED, BULGE INSIDE WALL LIVING ROOM WAS FIXED, PROBLEM WITH SLIDEOUT LIVING ROOM BINDING GOING OUT & IN ,STILL HAS FRONT SHADE DAMAGE NEEDS TO BE REPLACED BUT DEALER NEEDE MORE TIME FOR WARRANTY FROM MANUFACTURER, RECLINING SEAT FOOT REST TORN LEATHER MATERIAL UNDERNEATH FOOT REST STILL NEEDS TO BE REPAIRED",
        "vin": "1F66F5DY3H0"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/15/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045775,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FOREST RIVER GEORGETOWN. THE CONTACT STATED THAT THE PROPANE TANK EMITTED AN ABNORMAL ODOR. THE CONTACT ALSO STATED THAT THE GENERATOR FOR THE RV DID NOT OPERATE AS INTENDED. THE CONTACT STATED THAT THE VEHICLE GENERATOR DID NOT CEASE TO FUNCTION AFTER THE VEHICLE WAS AT A QUARTER TANK OF FUEL. THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. DENNIS DILLON AUTO PARK (6560 W TARGEE ST BOISE, ID) WAS CONTACTED AND REFUSED TO PERFORM THE REPAIR. THE VEHICLE WAS ALSO TAKEN TO AN INDEPENDENT MECHANIC WHERE THEY DIAGNOSED THAT THE NUMBER SIX CYLINDER WAS DEFECTIVE UPON PURCHASE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS APROXIMATELY 11,820.",
        "vin": "1F66F5DY4G0"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "05/23/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002391,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "GEORGETOWN",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RV HAS ONLY ONE SLIDE BUT IT SOUNDS LIKE IT WILL FALL OUT AT ANYTIME AFTER CAMPINGWORLD REPLACED MOTOR AND INSTALLED LONGER CARPET DUE TO FLOOR COMING UP NOW WINDSHIELD IS LEAKING WATER AND THEY REFUSE TO REPLACE EVEN AFTER RESEALING. MORE MINOR INTERIOR ISSUES Q& C ISSUES. ALL THIS AFTER 3 WEEKS OLD AND I'VE ONLY PUT 300 MILES ON IT.",
        "vin": "1F66F5DY9H0"
    }
]