[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/12/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268618,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "CEDAR CREEK",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2017 CEDAR CREEK 38FBD WITH DUAL 7000 POUND AXLES AND OEM ALLOY WHEELS.  THE SECOND OF MY FOUR ALLOY WHEELS CRACKED SOMETIME DURING THE 3 DAYS WE WERE SETUP AT COE RIVERSIDE PARK @ LAKE KANOPOLIS, KS.  I FOUND THIS OUT WHEN MY AFTERMARKET TPMS ALARMED THAT THE TIRE WAS AT 5 PSI RATHER THAN NEAR 110PSI WHEN I TURNED IT ON.  IF THE CRACK AND RESULTING PRESSURE LOSS HAD OCCURED WHILE WE WERE PULLING OUR FIFTH WHEEL, WE MAY HAVE LOST CONTROL OF THE TRAILER AND INJURED NOT ONLY OURSELVES, BUT OTHERS ON THE ROAD.  AS I STATED, THIS IS THE SECOND WHEEL TO FAIL. THE PREVIOUS FAILURE WAS ABOUT TWO MONTHS AGO WITH PRETTY MUCH THE SAME CIRCUMSTANCES.  WE WEIGH OUR FIFTH WHEEL EVERY SO OFTEN AND SO FAR WE'VE NEVER HAD OVER 6700 POUNDS ON EITHER AXLE. OUR TIRES ARE G RATED TO ~3800 POUNDS WHEN IN A DUAL AXLE CONFIGURATION (SAILUN 235/85R16) THAT WERE PURCHASED NEW IN MARCH 2019.",
        "vin": "4X4FCRP21HS"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231809,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "CEDAR CREEK",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON ST",
                "productYear": "9999",
                "size": "ST235/80R16",
                "type": "Tire"
            }
        ],
        "summary": "VEHICLE IS A 2017 5TH WHEEL TRLR.. ON 7/12/2019 I WAS TOWING THE TRLR AT 70 MPH AND PULLED INTO A STOP. TRLR IS 2 AXLES AND THE RT. FRONT TIRE WAS FLAT WITH ABOUT A 7 INCH STRIP OF TREAD HANGING LOOSE AT THE JUNCTION OF THE TREAD/SIDEWALL. I REPLACED THE TIRE AT A COST OF $140.00. TIRE PRESSURE WAS 75 PSI AND THE AIR TEMP WAS 90 DEG. ON 7/14/2019 I HAD ANOTHER BLOWOUT WITH THE LEFT REAR TIRE AT 70MPH. THE TIRE CAME APART AND DAMAGE THE TRAILER FLOOR AND SIDE SKIRTING. THE AIR TEMP WAS 77 DEG. BOTH TIRES WERE ORIGINAL EQUIPMENT GOODYEAR MARATHON'S ST 235/80R16 LOAD E. DOT 2VUN 1LHV. I INTEND TO REPLACE THE REMAINING MARATHON'S AS SOON AS POSSIBLE. I HAVE PICTURES OF THE SECOND TIRE AS WELL AS TRLR. DAMAGE. TRLR IS A FOREST RIVER, SANIBEL 3591.",
        "vin": "5ZT3SN1B9HG"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/10/2018",
        "dateOfIncident": "04/21/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093206,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "CEDAR CREEK",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON ONE OF THE FIRST TRIPS WITH THE FIFTH WHEEL WE WERE TRAVELING AND WHILE IN MOTION, SUDDENLY LOST ALL TRAILER BRAKES.  WE WERE ON A TOWN STREET, IN THE BUSINESS DISTRICT DURING HEAVY TRAFFIC.  WE WERE ABLE TO PULL OVER SAFELY AND INSPECT THE VEHICLE.  THE BRAKE LIGHTS WERE FUNCTIONAL AND THE FIFTH WHEEL HAD POWER.  WHEN MY HUSBAND CRAWLED UNDER THE VEHICLE TO SEE IF HE COULD DETERMINE THE ISSUE HE FOUND THAT THE ELECTRICAL LINE TO THE BRAKES WAS NOT SPLICED TOGETHER PROPERLY AND HAD COME APART. MY HUSBAND WAS ABLE TO TAPE THE APPROPRIATE WIRES TOGETHER SO THAT THE BRAKES WERE FUNCTIONAL AND THE TRAILER IS DUE TO BE INSPECTED BY THE DEALER IN JUNE. *TT  VIN NOT VALID UPDATED 9/20/18*JB",
        "vin": "4X4FCRN2XHS"
    }
]