[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2022",
        "dateOfIncident": "12/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "APIM module failure, 2017 Ford Taurus. Car was bought new from dealer. APIM failed after 2.5 years. Will cost approx $900 to fix.  In 2013, Ford issued service action number 12M02 for APIMs in 2011-2013 vehicles because they also failed.  This is a known issue for Ford, and from what I have seen on the lists of Ford complaints, it looks like this is still a problem. I hope Ford will make this right and extend this warranty.  Otherwise they will have a lot of unhappy customers.",
        "vin": "1FAHP2E82HG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "09/26/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434574,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I went to start the car and it would not roll over, acted as the battery had no charge. Opened the hood to attach jumper cables and seen smoke coming from the positive. Peeled back the red cover and seen there was a thick layer of blue corrosion caked all over the positive. The car was last driven within two hours prior. Last service was performed within 6 months. The acid ate through the clamp for the positive. The corrosion was removed and the battery was taken out. There are three small holes at the base of the positive knob where the acid came out. I researched online and found this is a common problem among Ford vehicles, specifically Taurus vehicles.",
        "vin": "1fahp2kt4hg"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "08/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431927,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Ford Taurus. The contact had taken the vehicle to an unknown dealer for an oil change and the contact was informed that all four tires showed significant tread wear and needed to be replaced. An alignment check was also performed on the vehicle and it was discovered that the rear tires were out of alignment. Upon investigation, the contact discovered NHTSA Campaign Number: 20V072000 (Suspension) which he linked to the failure; however, the VIN was not included. The manufacturer was notified of the failure and a case was filed. The vehicle was not repaired and remained in the possession of the dealer. The failure mileage was 17,202.",
        "vin": "1fahp2e8xhg"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/13/2021",
        "dateOfIncident": "08/14/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424624,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Ford Taurus. The contact stated while driving at various speeds, the keypad lock detached from the driver’s side door. The contact also stated that whenever it rained, he was not able to enter the vehicle using the keypad lock. The contact stated no warning light was illuminated. The vehicle was taken to a local dealer where it was diagnosed with the keypad lock needing to be replaced. The vehicle was repaired however, the failure recurred. The manufacturer had been informed of the failure and referred the contact to a local dealer for assistance. The failure mileage was approximately 5,000.",
        "vin": "1FAHP2E86HG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328847,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED WITH THE LEFT REAR TAIL LIGHT OUT. PROGRESSED TO BOTH HEADLIGHTS GOING OUT AND NEEDING REPLACED AND SOMETIMES THE PIG TAILS TO PLUG INTO THE HEADLIGHT NEEDING REPLACED DUE TO THEM MELTING. IT HAS PROGRESSIVELY GOTTEN WORSE. HAVE REPLACED BOTH HEADLIGHTS AND PIG TAILS THE WEEK OF 5/17/2020 AND AGAIN JUST HAD THE RIGHT HEADLIGHT AND PIGTAIL REPLACED THE WEEK OF 6/7/2020. CALLED FORD AND WAS TOLD \"NO ISSUES REPORTED BEFORE\". CAN'T BELIEVED WE ARE THE ONLY POLICE DEPT HAVING THIS ISSUE.  *TR",
        "vin": "1FAHP2MK3HG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN HEAR THE GAS SLOSHING AROUND IN MY GAS TANK WHILE I'M DRIVING MY CAR IS THIS A NORMAL FUNCTION",
        "vin": "1FAHP2E81HG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "05/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267401,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE A FIXED POINT BEAM FOR BRIGHTS WITH SHUTTERS FOR DIMS. THE LIGHTS POINT DOWN AND TO THE RIGHT, THEY NEVER CHANGE, SO WHEN THE SHUTTERS ARE LIFTED THE BEAMS DON'T CHANGE THEY ARE STILL POINTED DOWN AND TO THE RIGHT. THE ONLY THING THAT CHANGES IS A LITTLE REFLECTED LIGHT THAT CATCHES THE REFLECTIVE ROAD SIGNS, WHICH ILLUMINATE WITHOUT MUCH LIGHT ON THEM, BUT THE ROAD AHEAD IS DARK. THE BEAMS ARE NOT POINTED DOWN ROAD, WHICH IS WHERE THEY SHOULD BE. ON BRIGHTS, THE HEADLIGHTS CAUSE THE ROAD TO GO DARK WITHIN 3 CAR LENGTHS. YOU CANNOT SEE CURVES, OBJECTS IN THE ROAD, INCLUDING DEER AND WITH RAIN IT'S EVEN WORSE.     I HAVE GONE THROUGH THE PROCESS WITH FORD, THE LOCAL DEALERSHIP AND THE REGIONAL MANAGER, AND STILL THERE IS NO SOLUTION. THE SERVICE MANAGER SAID HE HAD NEVER HEARD OF THIS, BUT HE COULD SEE BY MY PHOTO THAT I WAS DESCRIBING THE PROBLEM CORRECTLY. HE RESEARCHED THE PROBLEM AND ANY POSSIBLE FIX, BUT WAS NOT ABLE TO DISCOVER ANYTHING, OTHER THAN HIS FORD RESOURCES SAID THERE IS NO ADJUSTMENT FOR THESE HEADLIGHTS. I HAVE INCLUDED A COPY OF THE SERVICE DOCUMENT THAT STATES THIS ALSO. THERE IS A VERTICAL ADJUSTMENT, BUT THAT DOES NOT BRING THE LIGHTS BACK ONTO THE ROAD.     THE SERVICE MANAGER DID WHAT HE COULD, BUT HE WAS AT A LOSS FOR WHAT TO DO ALSO. THIS PROBLEM MAKES AN OTHERWISE GREAT CAR DANGEROUS TO DRIVE EXCEPT FOR ON WELL LIT CITY STREETS. THIS PROBLEM WAS DISCOVERED SHORTLY AFTER I PURCHASED THE CAR IN 2018. I HAVE BEEN TRYING TO GET THIS CORRECTED SINCE THAT TIME. IT'S A CERTIFIED PRE-OWNED, PROBABLY A LEASE VEHICLE OR RENTAL, SO NOBODY CARED TO REPORT THE ISSUE SINCE IT WASN'T THEIRS.     I AM AT THE END OF TRYING TO FIND A WAY TO GET THIS CORRECTED. THUS, I'M WRITING TO TELL YOU ABOUT THIS SAFETY CONCERN THAT FORD MUST BE MADE TO CORRECT.",
        "vin": "1FAHP2F83HG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229273,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FORD TAURUS. THE CONTACT STATED THAT WHEN THE KEY WAS PLACED IN THE IGNITION, THE VEHICLE WOULD NOT START IMMEDIATELY. IT TOOK THE CONTACT A COUPLE OF ATTEMPTS TO FINALLY START THE VEHICLE. FAIRWAY FORD (2323 LAURENS RD, GREENVILLE, SC 29607, (864) 242-5060) STATED THAT THERE WAS NO RECALL AND WANTED TO CHARGE THE CONTACT $180 FOR DIAGNOSTIC TESTING. THE MANUFACTURER ALSO STATED THAT THERE WERE NO RECALLS AND THE CONTACT WOULD BE RESPONSIBLE FOR THE REPAIR COST. THE FAILURE MILEAGE WAS 37,800.",
        "vin": "1FAHP2D89HG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "04/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203656,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELLING ON A FREEWAY ~70MPH IN LEFT HAND LANE.  WITHOUT WARNING THE INSTRUMENT CLUSTER WENT BLACK AND THE ENGINE STOPPED.  THE VEHICLE STARTED TO DECELERATE AND THERE WAS NO RESPONSE FROM THE THROTTLE PEDAL.  AN ORANGE BOX APPEARED ON THE LEFT HAND SIDE OF THE SPEEDOMETER SAYING 'TRANSMISSION NOT IN PARK'.  I SIGNALED INTENTION TO PULL ONTO LEFT HAND SHOULDER BUT THERE WAS NO SOUND OR FLASHING FROM THE INDICATOR ARROW LIGHT IN THE INSTRUMENT CLUSTER.  I BRAKED AND THE VEHICLE CAME TO A STOP.  I PUT THE GEAR SELECTOR INTO 'PARK' AND DEPRESSED ENGINE START BUTTON.  THE INSTRUMENT LIGHTS THEN ILLUMINATED, AND THE INDICATOR LIGHT STARTED FLASHING.  I THEN DEPRESSED THE BRAKE PEDAL AND ENGINE START BUTTON AND THE ENGINE STARTED.  ALL CHECK LIGHTS WENT OUT, ENGAGED 'D', WAITED FOR BREAK IN TRAFFIC, INDICATED AND ACCELERATED INTO LEFT HAND LANE.  I CONTACTED THE DEALER AND EXPLAINED THE SITUATION AND THEY WANTED ME TO WAIT UNTIL THE PROBLEM REPEATED OR THE CHECK ENGINE LIGHT WAS TO ILLUMINATE.  I TOLD THEM THAT THIS WAS A SAFETY CRITICAL PROBLEM AND THAT I WOULD NOT WAIT UNTIL THIS PROBLEM REPEATED.  I TOOK THE CAR TO THE DEALER AND THEY FOUND FAULT CODES - B11D8:14, U0423:82, U0415:00, U0028:08.  THE FAULT CODES WERE CLEARED, AND THE DEALER DROVE THE VEHICLE FOR ~70 MILES BUT WERE UNABLE TO  DUPLICATE THE PROBLEM.  ON APRIL 25, 2019, THE FORD REGIONAL CUSTOMER SERVICE MANAGER TOLD ME THAT AS THE PROBLEM COULD NOT BE DUPLICATED, FORD MOTOR COMPANY CANNOT OFFER ANY ASSISTANCE AT THIS TIME.  SHE STATED THAT THE VEHICLE IS SAFE TO DRIVE AND ANY ISSUE IS NOW BETWEEN MYSELF AND THE DEALER.  OVERALL, THERE WAS NO ACKNOWLEDGEMENT OF THE GRAVITY OF THIS ISSUE.  THE FACT THAT THE PROBLEM CANNOT BE DUPLICATED SHOULD BE EVEN MORE CONCERNING WHEN, AT RANDOM, CONTROL OF THE VEHICLE CAN BE LOST.  FORD MOTOR COMPANY HAS NOW WALKED AWAY FROM THIS SAFETY CRITICAL ISSUE.",
        "vin": "1FAHP2KT0HG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON THE HIGHWAY AND TRYING TO ACCELERATE, WHEN THE CAR GOT TO ABOUT 55 MPH THE ENGINE DROPPED DOWN TO ABOUT 10 MILES PER HOUR.  IT STAYED THERE FOR WHAT FELT LIKE 15 OR MORE SECONDS. THE FIRST TIME WAS BACK IN NOVEMBER. IT HAPPENS IN FEBRUARY AS WELL",
        "vin": "1FAHP2F80HG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "12/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11181351,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 FORD TAURUS. WHILE DRIVING APPROXIMATELY 15 MPH, ANOTHER VEHICLE CRASHED INTO THE FRONT PASSENGER SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE FRONT PASSENGER SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOTALED AND WAS TOWED TO A TOW YARD. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE FAILURE MILEAGE WAS 14,600.",
        "vin": "1FAHP2E87HG"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171473,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC PROBLEM WITH LIGHTS TAKE AWHILE BEFORE COMING ON.A POPPING ON THE RIGHT UNDER THE CAR IN THE FRONT .AND A FUNNY NOISE IN THE STEERLING WHEEL WHEN TURNING EITHER WAY.",
        "vin": "1FAHP2E86HG"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163028,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A CLICK IN STERLING WHEEL MY DAD BOARD LIGHTS TAKE ABOUT 30 SECONDS BEFORE THEY COME ON THE DASHBOARD",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FORD TAURUS. THE CONTACT STATED THAT SOME OF THE INSTRUMENT PANEL GAUGES WERE TOO DIM TO READ WHILE DRIVING DURING THE DAYTIME. THE VEHICLE WAS TAKEN TO HART FORD LINCOLN (117 LAKE ST, ROSCOMMON, MI 48653, (989) 275-8922) WHERE IT WAS DETERMINED THAT THE VEHICLE WAS DESIGNED THAT WAY AND SUGGESTED THE CONTACT CALL THE MANUFACTURER. THE DEALER STATED THAT FORD CHANGED THE BACKGROUND COLOR OF THE GAUGES, WHICH MADE THEM DIFFICULT TO READ. THE MANUFACTURER WAS CONTACTED AND AGREED WITH THE DEALER. THE FAILURE MILEAGE WAS 150.",
        "vin": "1FAHP2D86HG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "05/17/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FORD TAURUS. THE CONTACT STATED THAT THE KEY WAS ABLE TO BE REMOVED FROM THE IGNITION WITHOUT THE VEHICLE BEING ENGAGED IN THE PARK POSITION. THE FAILURE OCCURRED WITHOUT WARNING. SUNNY KING FORD (1507 S QUINTARD AVE, ANNISTON, AL) WAS CONTACTED AND CONFIRMED THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 9,000.",
        "vin": "1FAHP2E88HG"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "04/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092674,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING >2 HOURS NON-STOP ON HIGHWAY THE STEERING BECAME DIFFICULT TO CONTROL.  THERE WAS RESISTANCE TO SUBTLE STEERING EFFORTS IN BOTH DIRECTIONS.  IT FELT LIKE THE STEERING WAS STICKING.  WHEN ENOUGH STEERING FORCE WAS APPLIED IT WOULD SUDDENLY RESPOND.  BECAUSE OF THE FORCE BEING APPLIED TO THE STEERING WHEEL IT WOULD OVER STEER.  AFTER THE UNIT COOLED DOWN OVER NIGHT THE SYMPTOMS DISAPPEARED.  THIS HAS HAPPENED TWO TIMES IN THE 19K MILES ON THE UNIT.  BOTH TIMES THE UNIT WAS DRIVEN >2 HOURS BEFORE THE SYMPTOMS STARTED.",
        "vin": "1FAHP2J84HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091708,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS ABOUT TO DEPART MY HOME I ADJUSTED THE BRAKE AND GAS PEDAL WHEN I PRESSED BRAKES TO START CAR PEDAL WENT TO FLOOR. I STARTED AND TRIED AGAIN SAME RESULTS. RELEASED HOOD TO CHECK ISSUE AND NOTED A POOL OF BRAKE FLUID UNDER CAR. LUCKILY THIS HAPPEN BEFORE DEPARTURE AS I WOULD HAVE BE TAKE THE EXPRESSWAY SHORTLY.  SOUTHGATE FORD WOULD NOT GIVE ME THE BROKEN LINE AND SAID THAT IT NEED TO GO TO FORD SINCE THIS WAS A WARRANTY ISSUE.",
        "vin": "1FAHP2F92HG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/11/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014607,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A PARKING LOT I PUT OUR CAR IN DRIVE AND IT WENT INTO REVERSE.  I STEPPED ON THE BRAKE AND THE BRAKE PEDAL WAS VERY HARD TO PRESS. I WAS ABLE TO PUT ENOUGH PRESSURE ON THE BRAKE TO  STOP IT FROM HITTING OTHER CARS.THE FORD DID VERY TESTS AND FOUND NO PROBLEMS WITH THE CAR.",
        "vin": "1FAHP2D89HG"
    }
]