[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330192,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Specialty Tires of America, Inc.",
                "productMake": "STA",
                "productModel": "SUPER TRANSPORT",
                "productYear": "9999",
                "size": "8-17.5",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FOREST RIVER SALEM LITE RV, EQUIPPED WITH FOUR CASTLE ROCK ST BRAND TIRES N/A.  TIRE LINE: UNKNOWN - DOT NUMBER: JUMR2MT, SIZE: 23580/R16. THE HE CONTACT STATED THAT WHILE DRIVING, THE LEFT REAR TIRE BLEW AND A COUPLE OF MILES LATER THE RIGHT REAR TIRE ALSO BLEW OUT. THE CONTACT PULLED TO A SAFE PLACE AND CALLED A ROAD SAFETY COMPANY. THE TECHNICIAN DIAGNOSED THAT THE FAILED TIRES WERE DUE TREAD SEPARATION. HE ALSO STATED THAT TWO FRONT TIRES WERE SWOLLEN AND WOULD BLOW OUT ANY TIME. THE CONTACT CALLED THE AYNOR TIRE MART DEALER, LOCATED AT 605 M STREET, AYNOR, SC 29511, (843-358-6837), PURCHASED AND REPLACED ALL FOUR TIRES. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE TIRE LINE WAS NOT PROVIDED. THE FAILURE MILEAGE WAS 3,000 FOR THE RV AND THE TIRES.",
        "vin": "4X4FSBN29HV"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/30/2019",
        "dateOfIncident": "10/27/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277106,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FOREST RIVER SALEM. THE CONTACT STATED THAT A LEAK EMERGED FROM UNDERNEATH THE DRIVER'S SIDE SLIDE OUT PORTION OF THE TRAILER. THE LEAK CAUSED MOLD TO FORM. THE DEALER AN MANUFACTURER WERE NOT CONTACTED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 1,000.",
        "vin": "4X4TSMY25HE"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/07/2018",
        "dateOfIncident": "04/07/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083773,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPLACED A LEAKING PROPANE TANK HOSE A FEW MONTHS AFTER PURCHASING OUR TRAVEL TRAILER IN MARCH 2017.  WHILE PREPARING THE TRAILER FOR A TRIP NEXT WEEKEND, I FOUND THAT THE 2ND TANK HOSE IS LEAKING PROPANE IN THE SAME WAY AS THE FIRST.  I AM CONCERNED THAT THIS IS AN ISSUE WITH MORE THAN JUST MY TRAILER AND THAT THESE DEFECTIVE HOSES MAY BE ON MORE TRAILERS FROM FOREST RIVER OR OTHER MANUFACTURERS.  THE HOSE IS A MODEL #GHA7 BY DEKING CORPORATION CO., LTD.  LOT #610937, US WORKING MAX PRESSURE OF 350 P.S.I.    THE HOSE LEAKS PROPANE AT THE HOSE CONNECTION TO THE FITTING THAT CONNECTS TO THE PROPANE TANK.  MOVING THE HOSE WHILE CHANGING TANKS OR EVEN TAKING THE TANK COVER OFF RELEASES GAS AT THIS CONNECTION.  ON MY SYSTEM WITH 2 TANKS AND A COMMON SWITCHABLE REGULATOR, THE TANK WITH THE DEFECTIVE HOSE CAN BE SHUT OFF AND THE OTHER TANK WILL STILL PRESSURIZE THE DEFECTIVE HOSE AND LEAK. *TT    *CN  *TR",
        "vin": "4X4TSMA23HT"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/31/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020948,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 NISSAN TITAN HAULING A 2017 FOREST RIVER SALEM CRUISE LITE TRAVEL TRAILER. WHILE DRIVING LESS THAN 40 MPH, THE AWNING ON THE RV PREMATURELY FRACTURED. THE TWO BOTTOM POLES FRACTURED ONTO THE ROADWAY AND THE CONTACT HAD TO PULL THE VEHICLE OVER TO MAKE AN ADJUSTMENT BECAUSE OF THE FAILURE. A DEALER WAS NOTIFIED (BLUE DOG RV, 714 W SELTIZE WAY, POST FALLS, ID 83854) AND THE CONTACT WAS INFORMED THAT THE AWNING WOULD NEED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BY THE DEALER, BUT THEY DID NOT FILE A CLAIM. THE APPROXIMATE FAILURE MILEAGE WAS 300.",
        "vin": "4X4TSMT18HT"
    }
]