[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2019",
        "dateOfIncident": "02/26/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183485,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SUNSEEKER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TAIL LIGHTS AND REVERSE LIGHTS ARE NOT  WATERPROOF,  THERE IS NO GASKET TO STOP WATER FROM ENTERING THE LENS AND FILLING UP WITH WATER. THERE IS A RECALL  ON OTHER FOREST RIVE REAR TAIL LIGHT FILLING WITH WATER.  I CALLED FOREST RIVER AND TOLD THEM THAT THERE WAS A HALF INCH OF WATER  IN THE TAIL LIGHTS AND WAS TOLD TO TAKE IT UP WITH THE DEALER WHO SOLD ME THE UNIT ,   AND ALSO WAS TOLD YOU ARE THE SECOND OWNER SO THERE IS NO WARRANTY IN EFFECT.   I ASKED IF THEY HAD DIFFERENT REAR LIGHTS THAT WERE SEALED   AND THAT I WOULD REPLACE THEM , FOREST RIVER SAID THERE IS NO RECALL AND THAT IS IT.  IF THE WATER GOT ANOTHER 1/4 OF AN INCH HIGHER IT WOULD SHORTED  OUT THE REAR TAIL , BRAKE AND TURN SIGNAL LIGHTS PLEASE LOOK IN TO THIS.",
        "vin": "1FDXE4FS3HD"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11094090,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SUNSEEKER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FOREST RIVER SUNSEEKER. THE CONTACT STATED THAT THE PASSENGER SIDE MIRROR CLEARANCE FAILED AND PREVENTED THE CONTACT FROM SEEING AROUND THE VEHICLE. OUTLET RECREATION (1015 US-59, DETROIT LAKES, MN 56501, (218) 844-6969) WAS CONTACTED AND WAS UNABLE TO DETERMINE A REMEDY TO ADJUST, MANEUVER, OR REPLACE THE MIRRORS FOR THE PROPER CLEARANCE FOR VISIBILITY. THE CONTACT ALSO STATED THAT THE MOBILE HOME'S SIDE VISION CAMERA ALSO PROVIDED LIMITED VISIBILITY. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT WAS WAITING ON A RESPONSE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "WDAPF4CC2G9"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "09/21/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081138,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SUNSEEKER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RV HAS SIDE AND REAR CAMERAS FOR SAFETY PURPOSES.  THE CAMERA IMAGES ARE TO BE SEEN, BY THE DRIVER, THROUGH THE DASH RADIO SCREEN.  THE WAY THE RADIO IS MOUNTED IN THE DASH OF THE RV, THESE IMAGES CANNOT BE SEEN BY THE DRIVER OF THE RV, DO TO A GLARE DURING DAYLIGHT HOURS.",
        "vin": "1FDXE4FS4HD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2016",
        "dateOfIncident": "05/28/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876366,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SUNSEEKER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FOREST RIVER SUNSEEKER. UPON PURCHASING THE VEHICLE, THE TECHNICIAN STATED THAT THE PRESSURE RELIEF VALVE LOCATED ON THE PROPANE TANK WAS FRACTURED AND LEAKING. THE VEHICLE WAS NOT REPAIRED BECAUSE A REMEDY WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 1,290. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    }
]