[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149990,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lionshead Specialty Tire & Wheel LLC",
                "productMake": "LIONSHEAD",
                "productModel": "RADIAL ST",
                "productYear": "9999",
                "size": "225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "ON MY THIRD USE OF MY 2017 FOREST RIVER R-POD TRAVEL TRAILER, A TRIP TO TEXAS FROM INDIANA, THE LEFT SIDE SINGLE AXLE TRAILER TIRE COMPLETELY DELAMINATED, TEARING THE STEEL FENDER WITH LIGHT AND WIRING FROM THE VEHICLE.  THIS WAS ON A 4 LANE DIVIDED HIGHWAY WHILE TRAVELING AT ABOUT 65 MILES PER HOUR.  THE INFLATION OF BOTH TIRES WAS CHECKED PRIOR TO LEAVING AND BOTH WERE INFLATED TO THE RECOMMENDED PSI.  I INSTALLED THE SPARE AND BOUGHT A REPLACEMENT TIRE ON THE SAME DAY.  THE NEXT DAY WHILE TRAVELING ON AN INTERSTATE HIGHWAY AT ABOUT 70 MPH THE TIRE ON THE RIGHT SIDE BLEW OUT AND WAS TORN TO SHREDS, ALSO TEARING OFF THE FENDER AND WIRING.  NEITHER FENDER WAS LOCATED AND I TRUST THAT THERE WERE NO INJURIES OR VEHICLE DAMAGE AS I WAS NOT NOTIFIED.  BOTH OF THESE INCIDENTS WERE VERY SERIOUS BUT THE TRAILER WAS KEPT UNDER CONTROL AND WAS SAFELY MOVED OFF OF THE ROADWAYS.  FOREST RIVER HAS REFUSED TO PAY FOR ANY DAMAGES AS THE 1 YEAR WARRANTY WAS OVER.  THE TIRE DISTRIBUTER, LION'S HEAD, GOSHEN, IN, ALSO REFUSED TO PAY FOR REPLACEMENT OR DAMAGES AS THE 1 YEAR WARRANTY WAS OVER.  THESE TIRE POSE A SAFETY HAZARD AND SHOULD BE RECALLED AND REMOVED FROM ANY VEHICLES USED ON THE HIGHWAY SYSTEM.",
        "vin": "4X4TRPT12HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/29/2018",
        "dateOfIncident": "08/09/2018",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123288,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OTHER DAY I CONNECTED A WATER HOSE TO THE BLACK TANK FLUSHING CONNECTION.  AFTER MY FIRST FLUSHING I CLOSED THE SPIGOT HANDLE AND PROCEEDED TO WORK INSIDE THE R-POD.  SHORTLY AFTER A NEIGHBOR CAME OVER TELLING ME WATER WAS POURING OUT THE BOTTOM OF R-POD.  SPIGOT FAILED TO SHUT WATER FLOW COMPLETELY OFF AND WATER FILLED THE TOILET TANK AND VENT PIPE.  WATER THEN FLOWED OUT THE TOP OF VENT PIPE AND DOWN THROUGH THE WALLS AND BOTTOM OF RV TO THE GROUND.  IF FOREST RIVER WOULD HAVE MANUFACTURED RV TO NFPA 1192 PLUMBING STANDARDS WATER WOULD HAVE OVER FLOWED ONTO THE TOP OF ROOF.  STATIONARY AT RV PARK IN WALLOWA, OREGON. FOLLOWING IS FROM FOREST RIVER TRAVEL TRAILERS OWNERS MANUAL THAT CAME WITH OUR R-POD.  YOUR FOREST RIVER TRAVEL TRAILER COMPLIES WITH THE REQUIREMENTS SET FORTH BY THE RECREATIONAL VEHICLE INSTITUTE ASSOCIA- TION, AS WELL AS VARIOUS OTHER FEDERAL AND STATE AGENCIES.  ON FEB 8, 2016, AT 11:54 AM, BRUCE HOPKINS<BHOPKINS@RVIA.ORG<MAILTO:BHOPKINS@RVIA.ORG>> WROTE:  [XXX],  RVIA IS A NATIONAL TRADE ASSOCIATION. AS A CONDITION OF MEMBERSHIP, MANUFACTURERS HAVE TO AGREE IN WRITING TO COMPLY WITH THE NFPA 1192 RV STANDARD AND TO UNANNOUNCED INSPECTIONS BY RVIA STAFF.    FOLLOWING IS AN EXCERPT FROM A DIFFERENT EMAIL MR. BRUCE HOPKINS SENT ME.    APRIL 4, 2018    STANDARD AND TO UNANNOUNCED INSPECTIONS BY RVIA STAFF. WE VISIT EACH PLANT EVERY 8 WEEKS ON AVERAGE AND INSPECT EACH PRODUCTION FACILITY ABOUT 6 OR 7 TIMES PER YEAR.     FAILURE OR REFUSAL TO COMPLY WITH THE STANDARDS AS ADOPTED BY THE RVIA BOARD OF DIRECTORS IS GROUNDS FOR EXPULSION FROM THE ASSOCIATION.  *JS    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "4X4TRPT13H2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2017",
        "dateOfIncident": "06/24/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001256,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "R-POD",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TONGUE WEIGHT DISTRIBUTION\". I FILLED THE WATER TANK, LOADED THE STORAGE AREA AND PROCEEDED TO DRIVE THE R-POD. AT 50 MPH THE TRAILER BEGAN TO FISHTAIL. MY TRUCK AND TRAILER ALTERNATED ON 2 WHEELS. I DID GET CONTROL, HAD TO TRAVEL HOME AT UNDER 35 MPH. I GOT HOME AND WAS ABLE TO LIFT THE FRONT OF THE TRAILER. ALL OF THE STORAGE AND WATER TANK ARE BEHIND THE SINGLE AXLE. THERE IS NO STORAGE AVAILABLE IN THE FRONT OF THE TRAILER TO DISTRIBUTE THE WEIGHT. THE DINING AREA IS IN THE FRONT. THE PASS-THRU STORAGE IS BEHIND THE AXLE. THERE IS NO WAY FOR ME TO ADDRESS THIS DESIGN FLAW. I CANNOT ADD HUNDREDS OF POUNDS TO THE FRONT OF THE TRAILER WHERE THERE IS NO STORAGE SPACE AVAILABLE. I AM AFRAID TO DRIVE THE TRAILER AND AFRAID TO SELL IT TO ANYONE ELSE. I RESEARCHED ONLINE AND FOUND SEVERAL OTHER SIMILAR COMPLAINTS, SOME RESULTING IN ACCIDENTS, HITTING OTHER CARDS, HITTING THE GUARD RAIL, ETC. *JS",
        "vin": "4X4TRPT15H2"
    }
]