[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2022",
        "dateOfIncident": "02/27/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My key frequently gets suck in the ignition.  During this event, I cannot remove the key and the vehicle will NOT shut down electrically (motor turns off).   I have had it in the dealer shop 3 times for this same issue.  I have had the key lodged at times for several hours which may require battery assistance.  The \"repairs\" were made at Ideal buick GMC in Frederick, Maryland but the problem persists.  I have read online blogs describing this problem by other owners.  What can I expect as far as actually resolving this issue?",
        "vin": "1GTG6EEN0H1"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "08/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Windshield defrost failed when HVAC Module Temp Door failed similarly to failures in 2015 and 2016 year models.  GMC confirmed and repaired the 2015 and 2016 model years; but, has so far refused to acknowledge or repair my 2017 model; even though, from information available to me, it is the same part with the same problem.  The dealership quoted me $2,500 for repairs.",
        "vin": "1GTG6DEN7H1"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a fuel leak coming from the top of the fuel tank and running down the side of the tank.  The leak occurs when the vehicle is running so it's appears to be coming from the high pressure fuel line or top of the fuel pump.  It appears to be exactly what is described in NHTSA Campaign Number 18V358000 and in GMC Recall 18188 however GMC Customer Support told me recall 18188 only applies to the 2018 year model and not my 2017.  When I search for recalls on NHTSA by VIN it tells me 0 unrepaired Recalls.  My wife and I both smelled gasoline Friday afternoon when we returned from a trip.  We have not driven the vehicle since.  I started the vehicle and let it idle in our driveway and after a couple of minutes fuel began to leak and run down the side of the gas tank.",
        "vin": "1GTG6DEN9H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "At highway cruising speed I am experiencing a shake or a shutter coming from the transmission.",
        "vin": "1GTG6CEN6h1"
    },
    {
        "components": "ENGINE,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "07/31/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427418,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "This is the 2nd time this has happened. The 1st time making a left onto route 23 from route 296 in Windham NY. Almost got T-Boned. Stalled wouldn't start. Waited 5 minutes and it started again. Ran rough then died again thankfully in a more opportune spot.  MY car randomly & without warning loses all power and electric and shuts down. The 1st time I had it towed to Matthews GMC (where I purchased 4 pick ups) and they stated it was a NOX sensor and repaired it. Saturday this happened again while driving at 55 MPH and stalled on a blind curve (very scary). I left a complaint on this website to hopefully prevent a fatality. I thought I would recieve a response from you the NTSB but didn't. I went online and noticed there a a number of folks that had the same problem. Do you wait for fatalities before action is taken??",
        "vin": "1GTP6DE18H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "07/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Truck turned just over 62000 miles and appears to have engine oil cooler line failure. No oil on engine just dripping in protective plastic between radiator and engine. Spraying back underneath when moving. Checked on lone and blogs are showing many others with same problem with near catastrophic failure. I have dealer appointment for Wednesday August 4th 2021 to have it checked.",
        "vin": "1GTG6DEN4H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2021",
        "dateOfIncident": "06/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422502,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 GMC Canyon with 77,000 miles, key does not come out of ignition when shutting vehicle off.  Key is 'stuck' in accessory mode and will not turn all the way to allow it to be removed.  Have to restart vehicle, then shut off, and maybe key will come out.  This issue is reported frequently on internet forums as a problem with GMC Canyon and Chevy Colorado vehicles.",
        "vin": "1gtg5den1h1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2021",
        "dateOfIncident": "05/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416569,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED WHEN I WAS MAKING A LEFT TURN ONTO ROUTE 23 FROM ROUTE 296 IN WINDHAM NY. CAR SHUTTERED AND STALLED. ALMOST GOT T-BONED BY A SEMI. EXTREMELY LUCKY THAT I WAS ABLE TO ROLL BACKWARDS ONTO THE BRIDGE BEHIND ME. I DID GO ONLINE AND SAW THAT WERE OTHER OWNERS WITH THE DURAMAX DIESEL THAT EXPERIENCED SIMILAR PROBLEMS. THIS COULD HAVE BEEN A FATAL ISSUE. I'M ACTUALLY WORRIED ABOUT DRIVING THIS PICK UP. CONTACTED THE DEALER AND THEY TOLD ME WITHOUT THE ERROR CODE THEY COULDN'T  HELP ME. DISCONNECTED THE BATTERY TO CLEAR THE CHECK ENGINE LIGHT. ANY SUGGESTIONS?",
        "vin": "1GTP6DE18H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408293,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC CANYON. THE CONTACT STATED WHILE DRIVING AT APPROXIMATELY 5 MPH, THE STEERING WHEEL WAS DIFFICULT TO TURN. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER CRAIN BUICK GMC OF CONWAY (710 S. AMITY RD, CONWAY, AR 72032, (501) 436-4781) WHERE IT WAS DIAGNOSED WITH NEEDING THE STEERING GEAR TO BE REPLACED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 64,564.*DT",
        "vin": "1GTG6DEN6H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M HAVING PROBLEMS WITH MY 2017GMC CANYON.  SOMETIMES I CAN'T GET THE KEY OUT OF THE IGNITION.  MAIN PROBLEM KEY IN CAN'T GET IT OUT.",
        "vin": "1GTP6EE18H1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/16/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION CONTINUALLY HAS ISSUES WITH THE FIRST TO SECOND GEAR CHANGE, SHUDDERS AT LOW SPEEDS AND WHEN DECELERATING, AND PRODUCES A LOUD 'CLUNK' NOISE WHEN WHEN REVERSE GEAR IS ENGAGED. IN ADDITION TO THE ' CLUNK', THE BODY OF THE VEHICLE IS SUBJECT TO A RAPID MOVEMENT AS THE REVERSE GEAR IS ENGAGED. THE VEHICLE HAS BEEN RETURNED TO THE DEALERSHIP IN ORDER TO RESOLVE THE ISSUE HOWEVER, I HAVE BEEN TURNED AWAY FOR REPAIRS AS THEY CLAIM IT IS A CHARACTERISTIC TRAIT OF THE 8L90 ( 8 SPEED) TRANSMISSION. THE TSB OF CHANGING THE TRANSMISSION FLUID TO THE MOBIL1 DID TEMPORARILY MASK THE ISSUE. THE ISSUE HAS RETURNED AND WORSENED AND THIS HAS HAPPENED TO MANY PEOPLE. ON TO THE SUSPENSION, MY VEHICLE IS EQUIPPED WITH THE ' ALL-TERRAIN' SUSPENSION PACKAGE. MY VEHICLE IS SUBJECT TO A VERY LOUD SUSPENSION ' SQUEAK' ALONG WITH A POOR RIDE.",
        "vin": "1GTH6CEN9H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAKING FROM A HIGH PRESSURE OIL LINE.  IT WAS A PIN HOLE IN MIDDLE OF LINE, RUBBER PART LOCATED BETWEEN RADIATOR AND ENGINE. IT WAS DISCOVERED AFTER BEING PARKED FOR AN HOUR IN DRIVEWAY, AFTER A 100 MILE DRIVE. IT HAPPENED WHILE DRIVING BECAUSE THE OIL WAS EVERYWHERE AROUND ENGINE AND ON INSIDE OF TIRES.THIS WAS A VERY SIGNIFICANT LEAK. LOST PINTS OF OIL.  WHEN I STARTED CAR TO CHECK FOR LEAK IT COULD BE CLEARLY SEEN PUSHING OUT WITH PRESSURE. THE PLACEMENT OF THIS HOLE MAKES IT HARD TO BELEIVE THAT ANYTHING COULD OF PUNCTURED IT. FROM SOME SEARCHING IT SEEMS THIS IS NOT AN UNCOMMON PROBLEM.  THERE ARE CLAIMS THAT THE BURST IS DUE TO STARTS IN COLD WEATHER.  THE DAY IT HAPPENED WAS 1/1/21, IT WAS COLD BUT NOT EXTREME  I WOULD SAY LOW 30'S F I AM FILING THIS AFTER TRUCK WAS BROUGHT TO SHOP, I DID NOT TAKE PICTURES OR VIDEO, REGRETTABLE. OF COURSE THIS WAS (IS) A MAJOR INCONVENIENCE, A MESS IN DRIVEWAY ETC.BUT I CONSIDER MYSELF LUCKY THAT MY ENGINE DID NOT GO ON FIRE.  FEEL FREE TO CONTACT ME FOR ADDITIONAL INFO",
        "vin": "1GTG6CEN6H1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DIFFERENTIAL IS BEGINNING TO MADE A NOISE WHILE MOVING DOWN THE ROAD, YOU CANNOT HEAR IT FROM THE INSIDE THE VEHICLE, YOU NEED TO BE ON THE OUTSIDE WHILE THE VEHICLE IS IN MOTION.",
        "vin": "1GTG5CENXH1"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354315,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2017 GMC CANYON DIESEL WITH 56570 MILES ON IT. WHILE WE WERE DRIVING DOWN THE STREET (IT WAS RAINING) GOING ABOUT 30 MILES AN HOUR AND ALL OF THE SUDDEN THE \"SERVICE STABILITRAK\" CENSOR CAME ON AM IT INSTANTLY PUT THE BRAKE ON. WE TURNED THE TRUCK ON AND OFF. OVER AND OVER LETTING IT SIT FOR MORE THAT A MINUTE COMPLETELY AND STILL NOTHING....WE WERE DOWN THE STREET FROM OUR HOUSE AND MY HUSBAND HAD TO PUSH IT HOME. THIS COULD HAVE BEEN SUCH A DANGEROUS SITUATION &#128563; THERE HAPPENED TO BE NO ONE BEHIND US BUT IT WAS SO ABRUPT THAT IF WE DID THEY MOST DEFINITELY WOULDN'T HAVE HAD TIME TO STOP AND CRASHED RIGHT INTO US. I WILL BE CALLING GMC IN THE MORNING BUT WE WERE DEFINITELY GRATEFUL WE MADE IT HOME SAFELY THOUGH PUSHING A TRUCK THROUGH THE RAIN UP HILL WAS NOT FUN FOR MY HUSBAND.   WE HAVE READ UP ON THIS AND WAS COMPLETELY SURPRISED HOW MANY PEOPLE HAVE HAD THIS SAME PROBLEM. YOU DEFINITELY SHOULD HAVE SOMETHING PUT OUT FOR THIS LETTING PEOPLE KNOW....THIS IS CRAZY GM HAS EITHER BASICALLY IGNORED THIS OR SIMPLY DOES NOT CARE FOR SAFETY. I ABSOLUTELY LOVE MY TRUCK BUT THIS TRULY DISAPPOINTS ME I HOPE WE ARE NOT PUT IN THE SAME SITUATION AS ALL THESE OTHER FOLKS WHO WERE PUT THROUGH THE RINGER WITH NO RESULT FOR THIS ISSUE!",
        "vin": "1GTP6CE15H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "07/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WAS IN MOTION ON THE HIGHWAY TRAVELLING AT 110 KM/HR WHEN THE POWER ASSISTED POWER STEERING WARNING LIGHT CAME ON AND THE VEHICLE LOST ALL FUNCTIONALITY TO STEER THE VEHICLE.  I PULLED OVER TO THE HIGHWAY SHOULDER AND SHUT THE VEHICLE OFF.  I WAITED TWO MINUTES AND THEN STARTED THE VEHICLE .  THE WARNING LIGHT WAS STILL VISIBLE, BUT THE POWER ASSISTED STEERING WAS WORKING INTERMITTENTLY.  I TOOK THE VEHICLE TO THE DEALER FOR INSPECTION.",
        "vin": "1GTP6DE17H1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331158,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT WHEN DRIVING THE \"SERVICE STABILITRAK\" MESSAGE APPEARS, AND TRACTION CONTROL/ STABILITY CONTROL IS DISABLED    INTERMITTENTLY WHEN STARTING THE \"SERVICE STABILITRAK\" MESSAGE APPEARS, AND TRACTION CONTROL/ STABILITY CONTROL IS DISABLED    CODE READER RETURNS MESSAGE U0077.  *TR",
        "vin": "1GTP6EE10H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/16/2020",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329212,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE VEHICLE IN PARK AND THE STEERING LOCKED AND THE KEY REMOVED.  PUT THE KEY IN THE IGNITION AND IT WILL NOT TURN. SO IMMEDIATELY YOU THINK THE STEERING MUST BE TURNED SHARP EITHER ONE WAY OR THE OTHER AND A LITTLE PRESSURE OR JIGGLE WOULD LOOSEN IT. NOPE. IN FACT, THE WHEELS ARE POINTING STRAIGHT AHEAD.  SO NEXT, ONE WOULD THINK IT MUST BE THE GEAR SHIFTER SAFETY WITCH MUST BE THE ISSUE AND A LITTLE JIGGLE OF IT SHOULD ALLOW YOU TO TURN THAT KEY. NOPE.  SO, LET'S GET LOTS OF HELP AND HAVE SOMEONE JIGGLE THE WHEEL, WHILE ANOTHER JIGGLES THE GEAR SHIFTER AND STILL ANOTHER TRIES TO TURN THE KEY. NOPE.  A BRIEF SEARCH OF THE INTERWEBS TELLS YOU THIS IS A PROBLEM OTHER HAVE EXPERIENCED. NOT A PROBLEM YOU WOULD EXPECT ON A NEW VEHICLE, BUT LET'S FACE IT, GM IS NOTORIOUS FOR STEERING COLUMN ISSUES.  AND THE DEALER WANTS A GRAND TO FIX IT'BUT THEY DON'T KNOW WHAT THE PROBLEM IS EITHER.  *TR",
        "vin": "1GTG5CEN1H1"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2020",
        "dateOfIncident": "09/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STALLS AS IF IN NEUTRAL AFTER STARTING. UNFORTUNATELY, I HAVE TO LET THIS TRUCK RUN FOR T LEAST 10 MINUTES OR MORE BEFORE I CAN TAKE OFF. IF I START THE TRUCK AND PUT IT IN DRIVE ANY SOONER, TRUCK WON'T MOVE. ACTUALLY, IT RUNS THEN SEND TO SLAM (VERY HARD JERK) INTO DRIVE, STUDDERS, THEN FUNCTIONS NORMAL.  I TOOK IT BACK TO DEALER AND THEY SAY THERE HAS BEEN MULTIPLE COMPLAINTS ABOUT THESE TRUCKS. I ALSO WAS TOLD GM PUT A STATEMENT OUT ABOUT THESE COMPLAINTS AND SAID THERE IS NOTHING THEY CAN DO TO FIX, IN SO MANY WORDS.  DEALER SAY IT WILL GO AWAY. I'VE HAD THIS VEHICLE SINCE JULY 4 2019 AND STILL HAPPENING ALMOST EVERYDAY.",
        "vin": "1GTG6CEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321290,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC CANYON. THE CONTACT STATED THAT WHILE DRIVING DOWNHILL, THERE WAS A LOUD REVVING SOUND COMING FROM THE TRANSMISSION. THE CONTACT STATED THAT THE TRANSMISSION WAS SLIPPING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC HOWEVER, THE MECHANIC WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 155,994.",
        "vin": "1GTP6CE18H1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "POOR QUALITY SEAMING JOB ON LEATHER VINYL SEATS IS COMING APART AT THE SEAMS ON THE DRIVERS SEAT AND SPLITING, WHICH MAY CAUSE ISSUES FOR SIDE AIRBAGS.  POOR QUALITY PRODUCT, LACK OF MATERIAL CAUSING SEAMS TOFALL APART.",
        "vin": "1GTG5DEN3H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION EXPERIENCES TORQUE CONVERTOR SHUDDER. WITH VERY HARD SHIFTS AT 5 AND 18 MPH. DEALER COMPLIED WITH BULLETIN 18-NA-355. HAD IMPROVEMENT IN SHIFT FOR A WHILE. THEN HARD SHIFT RETURN AT 5 AND 18 MPH. DURING DECELERATIONS THERE WOULD BE A SHUDDER. WHEN USING CRUISE CONTROL WHEN REDUCING SPEED TRANSMISSION WOULD SHUDDER. RETURN TO DEALER, WHEN OIL PAN WAS REMOVED FOUND ALUMINUM CHIPS AND ONE METAL CHIP. DEALER REPLACE WITH REMANUFACTURED TRANSMISSION. DROVE VEHICLE HOME. THEN WENT OUT AND DROVE THE VEHICLE UPON EXITING DRIVE WAY EXPERIENCE TORQUE CONVERTOR SLIPPAGE AT AROUND 12 MPH WITH ENGINE RPM GOING FROM 2000 TO 4000. CONTINUED TO DRIVE VEHICLE ONCE TORQUE CONVERTOR REENGAGED. CONTINUED DRIVING MADE COUPLE OF SHORT TRIPS IN TRAFFIC CONTINUE TO EXPERIENCE BANGING IN DRIVE TRAIN. I BELIEVE THIS VEHICLE PUTS MY SAFETY AT RISK",
        "vin": "1GTG6EEN1H1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288552,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING PROBLEM WITH MY 2 YEAR OLD TRUCK SOMETIMES I CAN`T GET THE KEY OUT SOMETIMES LIGHTS STAY ON IN THE SUNNY DAY BUT MY MAIN PROBLEM IS THE KEY STUCK IN AND CAN`T GET IT OUT",
        "vin": "1GTGSBEN6H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GM HAD A RECALL ON THE 3.6 LGZ EQUIPPED IN TRUCKS IN CANADA.  COLD WEATHER CAUSED OIL PUMP TO OVER PRESSURIZING OF OIL AND DAMAGE TO OIL COOLER AND LINES.  LEAKING OIL IN TO ENGINE COMPARTMENT AND ON ROADWAY.  THIS HAS HAPPENED TO ME TWICE NOW ONCE IN MARCH OF 2018 AND NOW AGAIN IN NOVEMBER 2019.  DOING RESEARCH THIS IS A COMMON COMPLAINT.  I WOULD LIKE NATIONAL HIGHWAY TRAFFIC SAFETY DEPARTMENT TO LOOK INTO THIS AN DO SIMILAR RECALL AS CANADA.  HERE IN MINNESOTA IT GETS AS COLD OR COLDER THAN CANADA.",
        "vin": "1GTH6CEN5H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2019",
        "dateOfIncident": "11/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GM HAD A RECALL ON THE 3.6 LGZ EQUIPPED IN TRUCKS IN CANADA.  COLD WEATHER CAUSED OIL PUMP TO OVER PRESSURIZING OF OIL AND DAMAGE TO OIL COOLER AND LINES.  LEAKING OIL IN TO ENGINE COMPARTMENT AND ON ROADWAY.  THIS HAS HAPPENED TO ME TWICE NOW ONCE IN MARCH OF 2018 AND NOW AGAIN IN NOVEMBER 2019.  DOING RESEARCH THIS IS A COMMON COMPLAINT.  I WOULD LIKE NATIONAL HIGHWAY TRAFFIC SAFETY DEPARTMENT TO LOOK INTO THIS AN DO SIMILAR RECALL AS CANADA.  HERE IN MINNESOTA IT GETS AS COLD OR COLDER THAN CANADA.",
        "vin": "1GTH6CEN5H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271670,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS 2ND $40,000 CANYON I'VE BEEN TAKEN FOR! 1ST WAS 2016, AND TRANSMISSION WOULD TAKE OFF AFTER FLOORING IT, AS IT WOULD JUST 'LAY DOWN' AND SCARED THE WIFE SO MUCH, AND WOULDN'T DRIVE IT! HAD TO REPURCHASE AN 2017, WITH THE 8 SPD TRANS, AND EVEN WORSE! IT SHAKES AND SHUDDERS EVEN AFTER FLUID FLUSH, THEN NEW TORQUE CONVERTER! THEN WAS TOLD, THERE'S NOTHING MORE GM CAN DO FOR YOU!?? REALLY? NOW GM IS NOT RESPONDING TO MULTIPLE CALLS! $43,000 TRUCK REALLY? NEVER AGAIN, THESE VEHICLES SHOULD NOT BE ON THE ROAD! WAS PROMISED TO HAVE THIS RESOLVED THIS AFTERNOON,10-28-19, AND ONCE AGAIN NO RETURN CALLS! WILL SEEK REAL COUNCIL IN AM, AS GM RESOLUTION IS A JOKE! DON'T WASTE YOUR TIME, GO STRAIT TO QUALIFIED FIRM.",
        "vin": "1GTG6DEN5H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266122,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF STEERING WHILE DRIVING POWER LOSS STEERING DISPLAYED ON SCREEN CALLED  DEALER SHIP SAID TO BRING IN AFTER READING ON THE WEB EXPLAINED ON 2015 AND 2016 CANON HAD BEEN RECALLED FOR SAME THING",
        "vin": "1GTH5AEA3H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257745,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC CANYON. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE SHUDDERED AND VIBRATED WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. AFTERWARDS, THE VEHICLE ACCELERATED RAPIDLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO KEY CHEVROLET (32 KEY AUTO DR, WHITE RIVER JCT, VT) WHERE THE TRANSMISSION WAS FLUSHED AND THE TORQUE CONVERTER WAS REPLACED, BUT THE FAILURES CONTINUED. THE CONTACT STATED THAT AFTER TWO REPAIRED WHEN PULLING UT INTO TRAFFIC STILL HESITATE AND SHAKES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES AND PROVIDED CASE NUMBER: [XXX]. THE FAILURE MILEAGE WAS 28,000.*PM *TP          'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'",
        "vin": "1GTG6DEN5H1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "06/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD 4 LOADS OF MULCH LOADED IN MY 2017 GMC CANYON IN EARLY JUNE 2019. SOME MULCH FELL BETWEEN THE CAB AND CARGO BOX WHERE IT SMOLDERED ON TOP OF THE TRUCK GAS TANK FOR WEEKS UNTIL IT MELTED TUBES PROMPTING ONSTAR TO SEND ME TWO EMAILS 6-27-19 AND 6-29-19 TO SEE MY GMC DEALER WITHIN 7 DAYS FOR \"AN ISSUE WITH THE EMISSION SYSTEM\". THE DEALER IGNORED MY FIRST VISIT AND MAY HAVE IGNORED THE SECOND BUT NOW THE VEHICLE WOULD NOT ALLOW ME TO PUMP GASOLINE DUE TO A MELTED TUBE AND OTHER PARTS ON TOP OF THE FUEL TANK. I DISCOVERED THAT THE GAP THAT ALL PICKUP TRUCK HAVE, HAD NOTHING TO DIRECT MULCH AWAY FROM THE FUEL TANK. IF I HAD ANY IDEA THIS WAS HAPPENING I WOULD HAVE COVERED THE GAP WITH A TARP WHILE HAVING MULCH DUMPED IN. I FEEL VERY LUCKY TO BE ALIVE.  MY WIFE AND I TOOK A LONG DRIVE AND THE TRUCK THEN PARKED IN OUR ATTACHED GARAGE WHILE WE WATCHED TV A FEW FEET AWAY.  I CAN'T HELP BUT WONDER IF THIS IS THE FIRST TIME THIS HAS HAPPENED OR HAVE MANY BEEN KILLED IN MYSTERIOUS EXPLOSIONS THAT DESTROYED THE EVIDENCE.  *JS",
        "vin": "1GTG6CEN2H1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "10/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11210603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/07/2018 I WAS INVOLVED IN AN ACCIDENT WHICH TOTALED MY VEHICLE . IT WAS A LEFT TURN ACCIDENT I WAS DRIVING STRAIGHT AND THE IMPACT WAS FRONT AND CENTER OF MY VEHICLE. DAMAGE WAS OVER $22,000.00 I SUSTAINED A MINOR INJURY BACK AND NECK PAIN AND RECENTLY HAD SURGERY  FOR A HERNIA WHICH I HAD 10 YEARS PRIOR , AFTER THE ACCIDENT IT BECAME PAINFUL . I AM 55 YEARS OLD AND THAT TYPE OF VIOLENT IMPACT COULD HAVE BEEN REDUCED IF THE AIRBAG(S) DEPLOYED PROPERLY. I PURCHASED A NEW 2017 VEHICLE ALL SYSTEMS AND COMPONENTS SHOULD HAVE WORKED. ON THE DATE OF THE ACCIDENT MY VEHICLE HAD JUST OVER 6400 MILES ON IT. I SUBMITTED A CLAIM TO GM OR  ESIS (LISA ROZELLE)  91800 888-0164 AND THEIR RESPONSE , I QUOTE \" AT THIS TIME, BASED ON ALL DOCUMENTATION RECEIVED AND REVIEWED ESIS ON BEHALF OF GENERAL MOTORS LLC , WILL NOT BE IN A POSITION TO HONOR YOUR REQUEST FOR DAMAGES\" . I SENT 26 PICTURES , THE TOTAL LOSS WORK SHEET AND THE POLICE REPORT. I ALSO INFORMED THEM OF MY INJURY. NO ONE FROM GM OR ESIS EVER CAME OUT TO LOOK AT MY VEHICLE OR EXAMINE THE BLACK BOX. THEY BASICALLY JUST BLEW ME OFF. I WILL ATTACH A FEW PHOTOS FOR NHTSA TOO REVIEW.   THANK YOU FOR YOUR CONSIDERATION TO THIS MATTER.",
        "vin": "1GTG6CEN6H1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC CANYON. THE CONTACT STATED THAT WHILE EXITING THE FREEWAY AT 30 MPH, THE COLLISION BRAKE SYSTEM ENGAGED WITH THE BRAKE WARNING LIGHTS ILLUMINATED. THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE VEHICLE RESUMED BACK TO NORMAL. THE DEALER PRINCE CHEVROLET BUICK GMC CADILLAC OF ALBANY 2701 LEDO RD, ALBANY, GA 31707 (229)-299-4591 WAS CONTACTED BUT NO DIAGNOSED TEST WAS PERFORMED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE REOCCURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "1GTG5DEN6H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193332,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS 6600 MILES- WHILE NORMAL DRIVING AROUND TOWN, NOTICED A GASOLINE/OIL SMELL. AFTER BEING PARKED FOR 5 MINUTES RECIEVED A WARNING MESSAGE TO TURN OFF THE ENGINE DUE TO LOW OIL PRESSURE, THEN NOTICED A LARGE POOL OF OIL SPREADING UNDER THE ENGINE BAY OF THE TRUCK. THIS IS THE SECOND TIME OIL HAS LEAKED FROM THE ENGINE, FIRST REPAIR PERFORMED BY THE DEALER WAS TO REPLACE AN OIL COOLER HOSE. CONTACTED DEALER SERVICE DEPARTMENT, THEY SAID THEY HAD NEVER SEEN THIS ISSUE BEFORE. CONTACTED DEALER WHERE TRUCK WAS PURCHASED AND THEY HAVE REPAIRED THIS ISSUE MULTIPLE TIMES BY SWAPPING THE OIL PUMP FOR ONE WITH LOWER FLOW RATES (SIMILAR TO/SAME AS GM RECALL #N1821800260, WHICH DOESN'T YET APPLY TO THIS MODEL SOMEHOW).",
        "vin": "1GTG6DEN7H1"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "01/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 GMC CANYON EQUIPPED WITH DIESEL ENGINE WILL SPORADICALLY SHUT-OFF WHILE OPERATING WHEN DRIVING WITH A TANK THAT IS LESS THAN 1/4 FULL.  ON 1/31/19 (ODOMETER ~14200 MILES) VEHICLE WAS DRIVING FINE WITH AN AMBIENT AIR TEMPERATURE OF ROUGHLY 0F, FUEL TANK AT 1/3, WHEN ALL OF SUDDEN THE ENGINE DIED IN TRAFFIC WITH NO WARNING.  VEHICLE THEN NEEDED TO BE TOWED TO THE DEALERSHIP FOR SERVICE AT WHICH POINT THEY COULDN'T FIND ANYTHING WRONG WITH IT.  AGAIN ON 3/4/19 (ODOMETER ~15100 MILES) VEHICLE WAS DRIVING FINE WHEN THE DASH LIT UP WITH MULTIPLE CODES AND TRUCK WENT INTO REDUCED POWER MODE, AMBIENT AIR TEMPERATURE 10F GAS TANK AT 1/8TH.  GOT OUT OF TRUCK AND IT SMELLED LIKE IT WAS ON FIRE.  CALLED TO HAVE VEHICLE TOWED TO DEALERSHIP.  VEHICLE KEPT FOR MULTIPLE DAYS AT DEALERSHIP, DEALER WORKED WITH GM TO IDENTIFY AN ISSUE AND NO FIX WAS FOUND.  DEALER CALLED TO INSTRUCT ME TO NOT DRIVE THE VEHICLE WITH LESS THAN 1/4 TANK DURING WINTER AND ALSO MENTIONED THAT THIS HAS BEEN AN ISSUE WITH A FEW OTHER CANYON AND TERRAIN DIESEL MODELS.    GM NEEDS TO FIND A FIX FOR THIS!  IT IS TOTALLY UNSAFE AND UNACCEPTABLE TO HAVE A TRUCK THAT WILL UNEXPECTEDLY LOOSE TOTAL POWER WHEN DRIVING DUE TO A DESIGN FLAW IN THEIR SYSTEMS.",
        "vin": "1GTP6CE18H1"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER FAILS AT 12000 MILES FOR MANY.  THERE IS A GMC NOTICE OUT SINCE 2016.  MINE FAILED AT 16000 MILES AND THE ONE THEY REPLACED WILL LIKELY FAIL AGAIN IN ANOTHER 16K MILES.  THIS IS BAD.  I NOTICED IT WHEN I PRESSED ON THE ACCELERATOR AND AS I INCREASED SPEED UP TO 45 MPH.  IT RATTLED AND ROCKED BADLY.  THE GMC REPAIRMAN SAID, \"YEAP.....EVER SINCE 2016 ALL THESE [XXX] TORQUE CONVERTERS HAVE BEEN FAILING IN THE CANYONS AND COLORADOS BECAUSE GM AND CHEVY CHANGED THE SIZE AND STRENGTH OF THE METAL USED IN ORDER TO REDUCE THE WEIGHT OF TRHE VEHICLE.  WE WILL REPLACE IT, BUT I CAN ASSURE YOU IT WILL FAIL AGAIN AND YOU'LL HAVE TO BRING IT BACK TO USE FOR CHANGE OUT AGAIN.\"  WOW....WHAT A BUNCH OF CRAP.    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GTG5DEN3H1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "11/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11145316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC CANYON. WHILE DRIVING APPROXIMATELY 37 MPH, THE DRIVER REAR ENDED ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THERE WAS NO WARNING INDICATOR ILLUMINATED. A POLICE REPORT WAS FILED. THE DRIVER AND THE FRONT PASSENGER RECEIVED MINOR INJURIES THAT DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS DAMAGED, BUT DRIVEN TO THE CONTACT'S RESIDENCE. THE CONTACT CALLED HARDY CHEVROLET BUICK GMC AT 770-445-9411 (LOCATED AT 2026 MACLAND RD, DALLAS, GA 30157) AND WAS INFORMED TO CONTACT THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT SOMEONE WOULD BE SENT TO INSPECT THE VEHICLE. THE CONTACT WAS NOT CALLED BACK. THE FAILURE MILEAGE WAS 27,000.",
        "vin": "1GTG6CEN1H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURAMAX 2.8 ENGINE SUFFERED GCATASTROPHIC ENGINE FAILUREH AT LESS THAN 72,000 MILES. DOCUMENTATION AVAILABLE TO SHOW ENGINE HAS RECEIVED PROPER MAINTENANCE. THIS OCCURRED IN CENTER LANE OF I-95 IN HEAVY TRAFFIC. THIS OCCURRED ON 07SEP18 IN STAFFORD VA.",
        "vin": "1GTP6DE19H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124380,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNED THIS 2017 GMC CANYON FOR 1 YEAR AND 1 MONTH WITH 5000 MILES WHEN IT DEVELOPED AN OIL LEAK. BROUGHT TO DEALER WHO FOUND THE OIL LEAK COMING FROM A \"PINHOLE\" IN THE OIL COOLANT HOSE. WHEN I RESEARCHED THIS SPECIFIC OIL LEAK ONLINE A FOUND A FORUM POST WITH MANY OTHER PEOPLE WHO HAVE HAD THIS SAME ISSUE SINCE THE 2015 MODEL YEAR. OTHER PEOPLE DID NOT NOTICE THE LEAK UNTIL ALL OF THEIR OIL HAD DRAINED AND HAD TO BE TOWED TO SERVICE. I NOTICED IT EARLY ENOUGH THAT I STILL HAD OIL WHEN I ARRIVED AT THE DEALERSHIP TO GET IT CHECKED OUT. IT LOOKS LIKE THIS IS STILL AN ONGOING ISSUE WITH THE 2018 MODELS TOO, BUT NOT MUCH IS BEING DONE BY GM TO PROACTIVELY FIX THE BAD HOSES.",
        "vin": "1GTG6DEN7H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/01/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION BEGAN SHIFTING HARD. BEFORE LONG WHOLE TRUCK RATTLED WHEN SHIFTING. ALMOST A GRINDING SOUND. CHEVY DIAGNOSED TORQUE CONVERTER HAS GONE BAD. BACK ORDERED FOR 2 WEEKS.",
        "vin": "1GTG6EEN4H1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2018",
        "dateOfIncident": "04/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088484,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOX SENSOR POSITION 2 FAILED, SECOND OCCURRENCE, DIESEL VEHICLE ENTERED LIMP MODE.  LIMP MODE IS DANGEROUS AND INDICATED DEF FLUID ISSUE.  THIS IS A FALSE POSITIVE (AS DESCRIBED IN MANY PLACES ON THE INTERNET AND BY THE DEALER) AS A RESULT OF THE SENSOR FAILURE. FIRST DEALER DID NOT STOCK THE PART, DEALER 178 MILES AWAY HAD THE PART IN STOCK.  LIMP MODE IS A CONTINUED DECREASE IN VEHICLE MAX SPEED.  WHILE A FAILURE OF THE EXHAUST SYSTEM IS CRITICAL, IT SHOULD NOT BE ALLOWED TO PLACE AN OWNER AT RISK. BY THE TIME I REACHED THE SECOND DEALER, I HAD 4 MILES UNTIL THE VEHICLE WOULD DEGRADE TO 4MPH.  I WAS ASKED TO LEAVE WITHOUT EXECUTION OF A CRITICAL STEP, BECAUSE GM DOCUMENTS DID NOT RECOMMEND THAT STEP AS PART OF THE REPAIR.  2 SCENARIOS EXIST, SENSOR FAILURE WITHOUT LIMP MODE AND FAILURE WITH LIMP MODE.  IN LIMP MODE THE VEHICLE CANNOT BE DRIVEN LONG ENOUGH TO RESET THE FAILURE AND GM SHOULD INCLUDE THIS IN THE REMEDIATION.  INCREMENTALLY, THE DEALER SHOULD HAVE A PROCESS TO RESET LIMP MODE TO ALLOW TRAVEL WITHOUT THIS MODE UNTIL THE NEXT IGNITION CYCLE.  ALSO THIS WOULD BE A PREFERABLE SERVICE FROM ONSTAR.  THE LIMP MODE IS GREAT FOR THE CASUAL ISSUE BUT CREATES A RISK TO LIFE AND LIMB FOR TRAVELERS AND SHOULD HAVE LIMITED OVER RIDE CAPABILITY.  BEING THE FAILURE HAPPENED ON A MAJOR HIGHWAY, IN A CONSTRUCTION AREA WITH CONCRETE BARRIERS ON EACH SIDE THIS CREATED GREAT STRESS.  NO AMERICAN SHOULD OWN A VEHICLE COSTING $41000 THAT LEAVES YOU AT RISK OR STRANDED.  THIS IS IRRESPONSIBLE.",
        "vin": "1GTP6EE17H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082464,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING WATER INSIDE ON DRIVERS FLOOR A LOT OF WATER CAN CAUSE A ELECTRIC SHORT EVERY TIME IT RAINS ALOT",
        "vin": "1GTH5CEAXH1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/05/2018",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066975,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GMC 2017 CANYON VIBRATES AT HIGHWAY SPEED 60MPH TO 70MPH. THE 2ND DAY AFTER I BOUGHT IT TOOK IT ON LONG TRIP FOUND IT  HAD VIBRATION PROBLEMS. AFTER TAKING IT TO THE DEALERSHIP FOR TIRE BALANCE TWICE REPLACED FRONT WHEEL BEARING THEN TRANSMISSION FLUSH. THEN AFTER TRANSMISSION FLUSH HAD VIBRATION BETWEEN 40-45  THEY SAID IT WAS NORMAL THAT THERE WAS NOTHING ELSE THEY COULD DO. DUE TO VIBRATIONS OVER TIME THIS CONCERNS ME. FOR BEING STRANDED OR WORSE CAUSING AN ACCIDENT FROM SOMETHING COMING LOOSE. I`VE ALREADY HAD TO TIGHTEN UP MY SPARE TIRE. I BOUGHT THIS PICKUP FOR LONG TRIPS SINCE I`VE RETIRED. LIKE THE ONE MY WIFE AND I ARE GOING ON IN JUNE OF THIS YEAR.   I ALSO FEEL IF THERE GOING TO SELL CRAP LIKE THIS THEY NEED TO PUT THE VIBRATION ISSUES ON THE ACCESSORY `LIST SO BUYERS WILL HAVE THE OPTION WHETHER TO BUY OR NOT. I WOULD HAVE NOT BOUGHT A $40,000.00 VIBRATOR!!!",
        "vin": "1GTG6DEN2H1"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2018",
        "dateOfIncident": "10/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066252,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 GMC CANYON. CONSUMER WRITES IN REGARDS TO TRANSMISSION ISSUE. *LD    THE CONSUMER STATED THE DEALER INITIALLY COULD NOT DUPLICATE THE FAILURE. THE VEHICLE WAS LATER LEFT WITH THE DEALER TO ATTEMPT TO DUPLICATE THE FAILURE. THE POWER STEERING, TRACTION CONTROL, AND STABILITY MESSAGES APPEARED.  *JS",
        "vin": "1GTG6DEN2H1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS A COLD DRY MORNING, WARMED TRUCK UP FOR @ 10 MIN AND THEN DROVE @ 30 MINS. SHUT TRUCK OFF FOR ABOUT 2 HOURS. STARTED TRUCK AND LET IT WARM UP FOR @ 10 MINUTES AS USUAL. WHEN I STARTED TO DRIVE AND NOTICED STEERING WAS ALMOST IMPOSSIBLE TO DRIVE. NOTICED WARNING ON DASH THAT STATED SERVICE POWER STEERING, DRIVE CAREFULLY. CALLED LOCAL DEALER TO SCHEDULE APPOINTMENT. MILES ON TRUCK 1800.",
        "vin": "1GTG6DEN3H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "09/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024718,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO 4X4 INDICATOR LIGHT AND THE 4X4 MENU IN THE INFORMATION DISPLAY IS UNAVAILABLE.   REFERENCE COMPLAINT # 11023887",
        "vin": "1GTP6CE15H1"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991425,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER REAR DEFROST NOT WORKING ON THAT 1/3 OF THE REAR WINDOW",
        "vin": "1GTG6EEN1H1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/19/2017",
        "dateOfIncident": "02/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955469,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2/12/2017 7:30AM STOPED @ 4 WAY STOP, STARTED ACROSS TRANSMISSION WENT INTO NEUTRAL, LEFT ME STUCK IN ROAD, COULD NOT GET TRANSMISSION TO ENGAGE IN DRIVE OR REVERSE,HAD TO PUSH OUT OF ROAD, TRIED SEVERAL MIN TO ENGAGE TRANSMISSION FAILED, CALLED  AAA TO TOE BACK TO DEALER. DEALER KEPT 2 1/2 DAYS  SAID COULD NOT FIND A PROBLEM.",
        "vin": "1GTG5DEN6H1"
    }
]