[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11415300,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 FREIGHTLINER CASCADIA. THE CONTACT STATED WHILE DRIVING AT 40 MPH, THE VEHICLE BRAKED WITHOUT WARNING. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT SUSTAINED A PINCHED NERVE IN NECK. THE CONTACT DOES NOT KNOW IF THE VEHICLE WAS TAKEN TO LOCAL DEALER OR IF IT HAD BEEN REPAIRED. THE CONTACT DOES NOT KNOW IF MANUFACTURER WAS INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 271,455. THE VIN WAS NOT AVAILABLE.",
        "vin": "3AKJGEDV6GS"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244671,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX], FORMER EMPLOYEE OF AUTOBAHN, OVERSEEING 8 DRIVER TRUCKS HAD ALL TRUCKS REQUIRE POWER STEERING BOXES DUE TO A LOSS OF ASSIST.  HER TESTIMONY WILL BE ADDED AS AN ATTACHMENT SINCE IT IS LONGER THAN THE ALOTTED 2200 CHARACTERS *TT*JB    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "1FUJGLDR6HL"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "04/28/2019",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210401,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT DROVE A 2017 FREIGHTLINER CASCADIA. THE CONTACT STATED THAT THE VEHICLE HAD A CRASH MITIGATION SYSTEM INSTALLED BY A COMPANY CALLED WABCO. THE SYSTEM WAS A RADAR-BASED SYSTEM SET TO APPLY THE BRAKES AUTOMATICALLY TO AVOID COLLISIONS. WITHIN THE PAST FEW MONTHS, THERE WERE SOME SOFTWARE UPDATES AND THE SYSTEM WAS PICKING UP OTHER OBJECTS, SUCH AS OVERHEAD SIGNS THAT COULD CAUSE THE AUTO BRAKE SYSTEM TO ACTIVATE UNNECESSARILY. THE CONTACT'S VEHICLE WAS TESTED BY THE WABCO MANUFACTURER WHO STATED THAT THE SYSTEM WAS WORKING NORMALLY. THE CONTACT STATED THAT THERE WERE THREE INCIDENCES WHEN THE AUTOMATIC BRAKING ENGAGED WHEN THE CONTACT'S VEHICLE PICKED UP ROAD SIGNS 20 FEET ABOVE THE HIGHWAY INSTEAD OF VEHICLES. THE CONTACT STATED THAT THE FAILURE OCCURRED WITH OTHER DRIVERS NATIONWIDE. THE DEALER WAS NOT CONTACTED. THE CONTACT REFUSED TO DRIVE THE VEHICLE UNTIL THE FAILURE WAS REMEDIED. THE CONTACT WAS AN EMPLOYEE OF RIDER INTEGRATED LOGISTICS, WHO OWNED THE VEHICLE. THE FAILURE MILEAGE WAS 240,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195150,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WORKED FOR A TRANSPORT FLEET THAT HAD NUMEROUS POWER STEERING GEARBOX ISSUES ON 2017 FREIGHTLINER CASCADIA'S.  DURING MY TENURE THERE I OVERSAW 8 TRUCKS THAT HAD STEERING BOX REPLACEMENTS DUE TO EITHER STEERING PULL OR LACK OF POWER ASSIST.  I DIAGNOSED ANOTHER 5 UNITS AT THE MAIN OFFICE IN ROMULUS, MICHIGAN THAT NEEDED POWER STEERING BOXES.  I HAVE ALSO WORKED CLOSELY WITH A FREIGHTLINER DEALER TO DETERMINE THE BOXES WERE FAILING DUE TO INCREASED HEAT BUILDUP, INTERNAL BEARING FAILURE AND FLUID DEGRADATION.  I NOTED IN THE COMPLAINT OF 13 OCCURRENCES.  THIS NUMBER WAS THE 8 REPLACED BOXES AND THE OTHER 5 I INSPECTED.  THESE TRUCKS DEVELOPED STEERING PROBLEMS BETWEEN MAY 2018 THROUGH SEPTEMBER 2018",
        "vin": "1FUJGLDR0HL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/19/2018",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141519,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING WIPERS THEY WILL QUIT WORKING PERIODICALLY I CAN SWITCH TO HIGH SPEED OR TO INTERMITTENT AND THEY WILL WORK I CAN ALSO PUSH THE WASHER FLUID BUTTON IN REAL QUICK AND THEY WILL START WORKING AGAIN THEY MAY WORK FOR A FEW SECONDS AND QUIT AGAIN AND THEY MAY WORK A FEW MINUTES AND QUIT AGAIN. FREIGHTLINER IN KINGSPORT TN CHECKED IT OUT ON A DRY DAY AND SAID NOTHING WRONG I THINK IT'S A PROBLEM WHEN IT'S RAINING SOMETHING IS GETTING WET AND STOPPING A COMPLETE CONNECTION THIS IS A MAJOR PROBLEM IN A 80 THOUSAND POUND VEHICLE TO NOT BE ABLE TO SEE WHEN RAINING",
        "vin": "3AKJGLDR7HS"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073329,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON INTERSTATE AND BEGIN TO SMELL FUEL SO PULLED OVER AND FUEL WAS LEAKING FROM HIGH PRESSURE LINE GOING TO PUMP",
        "vin": "1FUJGLDR6DL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "10/27/2016",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926597,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT PERTAINS TO ADAPTIVE CRUISE CONTROL (ACC), FORWARD CRASH AVOIDANCE (FCA) AND LANE DEPARTURE WARNING SYSTEMS (LDWS).  I HAVE BEEN DRIVING THIS SPECIFIC VEHICLE BUT IT WILL PERTAIN TO ALL VEHICLES WITH THESE SYSTEMS. THE ACC AND FCAS BECAUSE OF ITS STRAIGHT LINE OF SIGHT IS MISINTERPRETING THE DATA ON APPROACH TO BRIDGES, OVERPASSES AND OVERHEAD SIGNS AND WILL INITIATE A HARD BRAKING EVENT ON THE INTERSTATE WHEN NO BRAKING IS REQUIRED CAUSING THE POTENTIAL TO LOSE CONTROL AND FOR A FOLLOWING VEHICLE TO CRASH. THIS PROBLEM WOULD BE INTENSIFIED ON WET, ICY AND SNOW COVERED ROADS.   I HAVE ALSO EXPERIENCED A HARD BRAKING EVENT ON INTERSTATES ON APPROACH TO A CURVE IN THE ROAD WHERE VEHICLES AHEAD WILL ALREADY BE IN THE CURVE IN ANOTHER LANE AND THE DATA IS MISINTERPRETED AS A CRASH AND BRAKES HARD BECAUSE THE OTHER VEHICLES ARE DIRECTLY IN THE LINE OF SIGHT. AGAIN, NO BRAKING WAS REQUIRED.  ON APPROACH TO A VEHICLE ON THE HIGHWAY READY TO MOVE INTO ANOTHER LANE TO EXECUTE A PASSING MANEUVER THE VEHICLE IS BRAKED FORCING A LOSS IN VEHICLE MOMENTUM WHEN NO BRAKING WAS REQUIRED.  IN INCLEMENT WEATHER, RAIN, SNOW, FROST AND FOG THE SENSORS BECOME UNABLE TO SEE WHICH IS THE BEST THING THAT COULD HAPPEN AND THE ONLY WAY TO DISABLE IT THAT I KNOW OF.   THESE EVENTS OCCUR EVERY SINGLE DAY ON MY TRIPS. I AM A PROFESSIONAL DRIVER WITH 35 YEARS' EXPERIENCE IN COMMERCIAL VEHICLES AND 40 IN A CAR. I DRIVE 570 MILES A NIGHT. THESE TECHNOLOGIES IN THEIR CURRENT STATE HAVE NO PLACE IN VEHICLES ON THE PUBLIC HIGHWAY SYSTEMS. WITH WINTER COMING I AM VERY CONCERNED FOR MY SAFETY AND THAT OF THE MOTORING PUBLIC AND WANT A RECORD OF MY COMPLAINT ON FILE. TRUCK IS EQUIPPED WITH THE DETROIT ASSURANCE 2.0 SYSTEM.",
        "vin": "1FUGGEDV8HL"
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "11/16/2016",
        "dateOfIncident": "10/23/2016",
        "fire": false,
        "manufacturer": "Daimler Trucks North America, LLC",
        "numberOfDeaths": 2,
        "numberOfInjuries": 2,
        "odiNumber": 10926527,
        "products": [
            {
                "manufacturer": "Daimler Trucks North America, LLC",
                "productMake": "FREIGHTLINER",
                "productModel": "CASCADIA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 FREIGHTLINER CASCADIA. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE BEGAN TO SWERVE BACK AND FORTH VIOLENTLY. THE WHEELS SEPARATED FROM THE AXLE CAUSING THE VEHICLE TO VEER TO THE RIGHT AND THE FRONT PASSENGER SIDE WHEEL FRACTURED, BUT DID NOT DETACH FROM THE VEHICLE. THE CONTACT MENTIONED THAT THE STEERING ROD SNAPPED AND BECAME LOOSE FROM THE HUB. DURING THE INCIDENT, THE PASSENGER SIDE OF THE VEHICLE ENCOUNTERED THE ROAD AND THE REAR OF THE TRACTOR TRAILER SWERVED AND DID A U-TURN, WHICH CAUSED THE CAB TO CRASH AND LAND ON THE DRIVER SIDE AND INTO A TREE LINE. IN ADDITION, THE FRONT OF THE CAB DISINTEGRATED. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER DIED ON IMPACT. THE PASSENGER SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION; HOWEVER, THE PASSENGER DIED EIGHT HOURS AFTER THE CRASH. THE VEHICLE WAS DESTROYED AND TOWED. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3AKJGLDR9HS"
    }
]