[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222743,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON INTERSTATE 75 BELOW LEXINGTON KY, I EXPERIENCED TWO BLOWOUTS ON EACH SIDE OF MY CAMPER 3 MONTHS APART. I HAVE HAD THE CAMPER FOR THREE YEARS AND THE TIRES ARE ONLY 3 1/2 YEARS OLD WITH GOOD TREAD ON THEM. I CONTACTED THE COMPANY AND RECEIVED NO RESULTS.",
        "vin": "5ZT3WCTB1HG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2017",
        "dateOfIncident": "07/30/2017",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015118,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: 2017 WILDCAT MAXX         MODEL T32BHXS          PURCHASE DATE:  MAY 22, 2017    DEAR MR. MAGNACCA:    I AM WRITING TO INFORM YOU MY RECENT PURCHASE OF THE ABOVE CITED TRAVEL TRAILER WHICH HAS SERIOUS MANUFACTURE DEFECTS AND POSES A RISK OF HEALTH AND SAFETY TO ME AND MY FAMILY.  THE VEHICLE WAS STATIONARY.    PART OF THE DEFECTS FIRST PRESENTED ON OUR FIRST CAMPING TRIP IN LATE MAY WHEN THE SLIDERS WOULD NOT FUNCTION.  WE RETURNED THE COACH TO SPRAD'S RV AND WAS TOLD IT WAS AN 'ELECTRICAL' ISSUE AND WAS REPAIRED.    ON JULY 30, 2017, WE FOUND THAT THE BATTERY WAS DEAD AS WE PREPARED TO LEAVE FOR A LONG PLANNED CAMPING TRIP.  AFTER USING THE MANUAL CRANK TO HOOK UP THE TRAILER TO TOW, WE PROCEEDED ON OUR TRIP UNDER THE MISTAKEN BELIEF THAT THE BATTERY WOULD RECHARGE ONCE WE WERE HOOKED UP TO SHORE POWER.  THAT DID NOT HAPPEN AND THE COACH REACHED AN INSIDE TEMPERATURE OF 109 DEGREES.      FROM THAT POINT FORWARD BEGAN A NIGHTMARE WEEK FOR ME AND MY GUESTS.  I HAVE NEVER ENCOUNTERED SUCH POOR SERVICE WITH ANY BUSINESS IN MY LIFE.  DURING THE ENTIRE EPISODE THAT I WILL DETAIL BELOW, NEVER ONCE DID ANYONE INFORM ME THAT THERE WAS A 1-800 NUMBER TO CALL FOR ROADSIDE SERVICE.    DEFECTS KNOWN AT THIS TIME:    'FAULTY WIRING  'CONVERTER (INSTALLED IMPROPERLY)  '2 BATTERIES (WILL NOT TAKE A CHARGE)  'INCONSISTENT POWER TO ALL PLUGS IN THE COACH  'MISALIGNED CRANK HOLE FOR BACK SLIDER  'NO ACCESS OR HOLE FOR LIVING ROOM SLIDER  'GFCI MALFUNCTION  'NO MANUAL ABILITY TO RETRACT AWNING (WITHOUT A PROFESSIONAL)  'TRIM PULLING AWAY FROM COACH  'CABLE AND TV NOT FUNCTIONING PROPERLY  'HANDLE ON BLACK WATER TANK IS MISSING",
        "vin": "4X4TWCH22HT"
    }
]