[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/23/2021",
        "dateOfIncident": "09/12/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434056,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Grand Design Solitude RV. The contact stated that while driving, the rear axle suspension separated from vehicle. The contacted noticed that the rear axle shifted three inches towards the driver’s side. The vehicle was taken to a rest stop where an independent mechanic replaced the left and right leaf springs. The local dealer was not contacted. The manufacturer was notified of the failure, but no further assistance was provided. The approximate failure mileage was 8,000.",
        "vin": "573FS4220H1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "04/29/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415522,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GRAND DESIGN SOLITUDE FIFTH WHEEL TRAILER. THE CONTACT STATED WHILE DRIVING AT AN UNDISCLOSED SPEED, THE CONTACT WAS MADE AWARE BY ANOTHER DRIVER THAT THE REAR WALL OF THE TRAILER HAD SEPARATED FROM THE SIDEWALL. THE CONTACT PULLED OVER AND RATCHET STRAPPED THE BOTTOM OF THE REAR WALL ONTO THE SIDEWALL OF THE RV AND DROVE HOME. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. A DEALER WAS NOT MADE AWARE OF THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE RV NEEDED TO BE INSPECTED BY AN AUTHORIZED DEALER. THE FAILURE MILEAGE WAS 940. INVALID VIN.",
        "vin": "573FS4339H1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "11/25/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071988,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT NEW, AFTER 6 MONTHS OF USE THE BRAKES FAILED. THE LIPPERT AXLES ON THE COACH HAD FAILURE ON THE SEALS AND COATED THE BRAKES WITH GREASE. THIS IS A SAFETY ISSUE ON A 16,000 TRAILER WITH NO BRAKES. LIPPERT KNOWS ABOUT THIS ISSUE BUT HAS NOT ISSUED A RECALL ON ALL OF THE TRAILERS WITH THEIR AXLES. MOST OF THE GRAND DESIGN COACHES ARE HAVING THIS PROBLEM",
        "vin": "573FS4322H1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/03/2018",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066830,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICE - LATE EMAIL....    11/13/17    GRAND DESIGN RV  11333 COUNTY ROAD 2  MIDDLEBURY, IN 46540    GREETINGS,     THIS LETTER IS REGARDING  OUR 2017 SOLITUDE 375RES, VIN #[XXX].   WE PURCHASED THE UNIT IN FEBRUARY OF 2017 FROM LAZY DAYS RV IN TUCSON, AZ.     WHEN WE ARRIVED IN UTAH WE FOUND THAT WE A BROKEN LEAF SPRING ON DRIVERS SIDE REAR AXEL AND THAT THE TIRE HAD BEEN DAMAGED. WE HAD THOSE REPLACED AT LES SCHWAB TIRES IN PROVO, UTAH AT OUR EXPENSE. THIS OCCURRED ON JUNE 14, 2017. I THEN CONTACTED THE FACTORY AND SPOKE WITH [XXX]. I EXPLAINED TO HIM THE PROBLEMS AND HE SAID THAT GRAND DESIGN WOULD REIMBURSE ME FOR REASONABLE COSTS.    THE FOLLOWING DAY WE LEFT UTAH AND WENT CALDWELL, ID. AFTER ARRIVING THERE WE FOUND THAT THE OTHER THREE LEAF SPRINGS HAD COLLAPSED. I CONTACTED THE FACTORY AGAIN AND SPOKE TO [XXX] WHO SAID THAT HE COULD UNDERSTAND HAVING ONE BAD SPRING BUT TO HAVE ALL FOUR GO BAD WAS UNLIKELY AND THAT WE SHOULD HAVE IT WEIGHED. I AGREED. IN THE MEAN TIME I HAD THE WORK DONE AGAIN AT MY EXPENSE AND I THEN PARKED THE UNIT UNTIL WE COULD GET IT BACK TO THE DEALER FOR OTHER WORK. ONCE THERE WE FOUND THAT YET ANOTHER SPRING HAD COLLAPSED. I HAD THE DEALER WEIGH THE UNIT AND IT WAS FOUND TO BE WITHIN THE PUBLISHED WEIGHTS FOR THIS UNIT. AS OF THIS WRITING THE DEALER SAYS THAT THEY ARE STILL WAITING  ON A RESPONSE FROM GRAND DESIGN.    SO IN CLOSING WHILE WE AWAIT YOUR RESPONSE, I CAN'T HELP BUT TO CONSIDER THE BIGGER PICTURE AND THAT IS, ARE THESE AXEL/SPRINGS UNDERSIZED FOR THIS SIZE RV AND IS IT SAFE TO DRIVE THE HIGHWAYS?     [XXX]        CELL- [XXX]    CC:FILE       NHTSA        GRAND DESIGN FORUM    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "573FS4321H1"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011343,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER SERVICED WHEEL BEARING HUBS AT FACTORY BY LCI CAUSED FAILURE OF REAR BEARING GREASE SEALS ON ALL 4 WHEELS CONTAMINATING BRAKE PADS RENDERING BRAKING INEFFECTIVE WHEN IN MOTION MAKING IT UNABLE TO STOP QUICKLY IN AN EMERGENCY.",
        "vin": "573FS4225H1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "07/13/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005291,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TRAILER HAS A LIPPERT SUSPENSION ORIGINALLY WITH 7,000# AXLES THAT HAVE BEEN UPGRADED TO 8,000# AXLES JUST 4,200 MILES AGO. ONE OF THE FOUR SPRING PACKS CAME APART ON THE INTERSTATE CAUSING THE AXLE TO BECOME MISALIGNED AND NEARLY CAUSING US TO DRIVE OVER THE EDGE OF A GUARDRAIL ON A NARROW BRIDGE WITH TWO LANES AT 50MPH. THIS IS THE 3RD LIPPERT SPRING FAILURE WE HAVE HAD, BUT THE 6TH SUSPENSION FAILURE. UPON INSPECTION WE ALSO HAVE DISCOVERED THAT EACH TIME THE BRONZE BUSHINGS ARE PREMATURELY, COMPLETELY, WORN THROUGH SO THAT THERE IS NO ANTI-FRICTION SURFACE REMAINING. PICTURES ATTACHED.",
        "vin": "573FS4229H1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/27/2017",
        "dateOfIncident": "05/15/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991920,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A BRAND NEW 2017 GRAND DESIGN SOLITUDE 310GK. UPON REVIEWING THE GRAND DESIGN OWNER'S FORUM, NUMEROUS PEOPLE REPORTED THEIR BRAKES BEING COVERED IN GREASE FROM THE LEAKING SEALS. 75% OF OWNERS POLLED IN THE FORUM REPORTED  THEIR BRAKES ARE FAULTY. WE HAD OUR RV DEALER PULL THE DRUMS AND THEY REPORTED THAT ALL OF THE BRAKES ARE FAULTY AND COVERED IN GREASE. WE'RE NOW WAITING FOR THE REPAIR PARTS TO ARRIVE FROM GRAND DESIGN AND LIPPERT MFG. WE WERE SUPPOSED TO LEAVE ON A CANADIAN ROCKIES TRIP LAST WEEK. IT'S A GOOD THING WE HAD THE BRAKES CHECKED AS THIS COULD HAVE BEEN A SERIOUS PROBLEM RESULTING IN INJURY OR EVEN A FATALITY SHOULD THE BRAKES FAIL. THIS IS A 12,000 LB. 5TH WHEEL. IT'S EXTREMELY  DISAPPOINTING THE GD AND LIPPERT KNOW THIS IS A SAFETY ISSUE AND HAVE NOT REPAIRED THE PROBLEM IN THE LAST 3 OR MORE YEARS. I AM ONE DISSATISFIED CUSTOMER!",
        "vin": "573FS3629H1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/20/2017",
        "dateOfIncident": "05/20/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990759,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "SOLITUDE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR GRAND DESIGN SOLITUDE 310GK WAS MANUFACTURED IN SEP 2016.  THE LCI/LIPPERT AXLES LEAKED GREASE OUT THE BACKSIDE PAST THE LIP SEAL AND GOT ALL OVER THE BRAKES AND MAGNET.  NOTHING WRONG WITH THE LIP SEAL.  SUSPECTED CAUSE IS OVERFILLING WITH GREASE DURING MANUFACTURING. IF YOU HAVE A GRAND DESIGN ANY MODEL MADE IN THE LAST THREE YEARS YOU BETTER PULL YOUR BRAKE DRUMS AND INSPECT.  HAVE LOTS OF SHOP TOWELS...IT MAY BE A MESS.  LUCKILY I WASN'T COMING DOWN SOME MOUNTAIN WITH GREASE ALL OVER MY BRAKES, SOMEBODY MAY HAVE BEEN KILLED.",
        "vin": "573FS3627H1"
    }
]