[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447015,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 GMC Sierra 2500. The contact received a notification for NHTSA Campaign Number: 21V496000 (Equipment) however, the part to do the recall repair was not yet available. The dealer had been notified about the recall and confirmed that the parts were not yet available. The manufacturer was also notified of the recall but offered no assistance. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. VIN tool confirms parts not available.",
        "vin": "1gt12uey8hf"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/14/2021",
        "dateOfIncident": "08/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443734,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 GMC Sierra 2500. The contact received notification of NHTSA Campaign Number: 21V496000 (Equipment) however, the part to do the recall repair was unavailable. The local dealer was contacted, and it was confirmed that the part was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact indicated that the engine block heater cord was disconnected upon purchasing of the vehicle. VIN tool confirms parts not available.",
        "vin": "1GT12UEY9HF"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "12/13/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "When connect my trailer i get a service trailer brake system, then the stability waring start to show up and the brakes on the vehicle seem to act funny. Very unsafe while towing a trailer and kids in the truck. VERY UNSAFE",
        "vin": "1gt12ueg0hf"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "12/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443490,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I auto started my truck. We jumped in and I put the key in to start and turned down the heater and pushed the rear defroster off and the passenger side rear window blows up like a shot gun blast. It shaders into a million pieces. Our 2 year old in a car seat right in front of it rear facing.  If I was driving with the amount of noise it produced I could of crashed.  I see there is a bandage recall but not for the hundred of thousand of the 2014/2020 for back windows just blow out.",
        "vin": "1GT12UEY6HF"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "11/28/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Ok my issues is the same recall on many other 2017 gmc 2500HD but not my VIN. Recall number N172120230 (rear wheel hub but loose). In my situation I was driving at low speed went to stop and abs light came on from oil on my rotator, I also heard a knock from the rear wheel. I pulled over and looked under the truck to find my axel seal leaking fluid all over my tire and breaks. I looked into the Facebook form on this problem and found many people with the same issue. Had the truck towed to the dealer where the are refusing to repair and not coving under warranty for 1” bigger tires. My truck only has 39,000 miles and a axel seal should not be going out, and if so should be covered",
        "vin": "1GT12TEY2HF"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 GMC Sierra 2500. The contact initially received a notification for NHTSA Campaign Number: 21V496000 (Equipment) however, the part to do the recall repair was unavailable. The dealer was notified about the recall; however, the contact was informed that the part was not yet available. The manufacturer had also been notified of the recall and the contact was provided a case number. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. VIN tool confirms parts are not available.",
        "vin": "1GT12UEY7HF"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436860,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Break lights activate by them selves. Can be driving, parked, vehicle off. Parked and locked. The break lights activate randomly. Most recently car was parked in drivevway over the coarse of 2 days. Break lights came on and off until batteries were dead. When parked I Can hear clicking noise coming from under the hood periodically, not sure if related or not. Also noticed cruise control will shut its self off some times.",
        "vin": "1gt12uey9hf"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339894,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GM ISSUES A SAFETY RECALL ON ENGINE BLOCK HEATERS FOR 6.6L DURMAX ENGINES STATING USING THE EQUIPMENT MAY CAUSE A FIRE. TWO YEARS, THE EQUIPMENT HAS NOT BEEN REPLACED AND DEALERSHIPS PASS BLAME TO GM",
        "vin": "1GT12UEYXHF"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "08/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330379,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLED OUT REAR MIDDLE SEAT BELT TO PUT MY GRANDCHILD IN IT AND IT WON'T RETRACT.WAS TOLD BY DEALERSHIP THAT THEY WOULD NOT FIX IT AT NO COST BECAUSE I WAS 120 MILES OUT OF MY WARRANTY.  THERE IS A RECALL ON SEATBELTS BUT NOT THE PICKUP.  *TR",
        "vin": "1GT22SEY0HZ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/07/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316706,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'M DRIVING AT A SLOW SPEED TURNING THE TRUCK LOOSES ALL POWER AND THE STEERING WHEEL JERKS OUT OF MY HAND, STABILITRAK IS ON THE DISPLAY AND IT SAYS ROLL DOWN DRIVER WINDOW AND ROLL BACK UP!  IT ALSO LOOSES ALL POWER JUST DRIVING DOWN THE ROAD NO MATTER THE SPEED!  I HAVE ALSO BEEN STOPPED AT A STOPLIGHT AND IT LOST ALL POWER WOULDN'T COME BACK ON SO I HAD TO GET OUT POP THE HOOD AND BANG I. THE BATTERY BOX AND CABLES AND IT STARTED AGAIN!  VERY SCARY GOING 75 MPH AND IT SHUTS OFF LEAVING YOU NO STEERING NO BRAKES NO LIGHTS NO NOTHING! SOMETIMES IT SAYS POWER STEERING FAILURE SOMETIMES  AND SOMETIMES IT SAYS STABILITRACK PROBLEM AT SOMETHING ABOUT TOWING! THE BRAKES WERE ALSO AFFECTED NO BRAKES",
        "vin": "3GTU2NEC3HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "02/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315540,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING AND BACKING UP WHEN I HIT THE BRAKES, THEY GOT HARD AND DID NOT OPERATE PROPERLY. WHEN PULLING FORWARD THE BRAKES WERE HARD TO OPERATE AND BARELY STOPPED THE VEHICLE. AFTER SITTING A WHILE AND RESTARTING THE TRUCK THEY OPERATED AS THEY SHOULD HAVE. NOT SURE IF THIS IS AN OPERABLE SAFETY ISSUE BUT, IT WAS VERY CONCERNING THAT THE BRAKES DID NOT OPERATE PROPERLY.",
        "vin": "3GTU2NEC3HG"
    },
    {
        "components": "SUSPENSION,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/01/2020",
        "dateOfIncident": "02/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN OREGON, MY TRUCK THAT I PURCHASED FROM A PRIVATE OWNER FROM UTAH IN JUNE OF 2019 HAD 37,300 MILES TODAY'S DATE MARCH 1 2020 MY TRUCK HAS 39,100 MILES. A COUPLE OF DAYS AGO I CHANGED TO MY OREGON LICENSE PLATE. WHILE UNDER THE TRUCK I NOTICED A LOT OF RUST ON MANY PARTS OF THE BRAKES, SUSPENSION AND FRAME ESPECIALLY WHEN I LOWERED THE SPARE TIRE WHICH SHOWED SEVERE RUST DAMAGE. THIS TRUCK HAS AN EXTREME AMOUNT OF RUST FOR A VEHICLE BUILT IN 2017. I CONSIDER THIS TO BE A SAFETY HAZARD ESPECIALLY BECAUSE DRIVERS USE THIS TYPE OF TRUCK TO HAUL OR TOW HEAVY LOADS.",
        "vin": "1GT22TEY3HZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/29/2020",
        "dateOfIncident": "02/13/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WAS RECALLED FOR BRAKES. RECALL COMPLETED WAS COMPUTER ISSUE. THAT RECALL CAUSED BRAKE VACUUM TO MALFUNCTION. ALMOST COST ME MY LIFE. 70 MPH IN DALLAS TX TRAFFIC. HAD TO SLOW DOWN QUICKLY. ONCE IT SLOWED DOWN THEN IT WOULDN'T STOP!!! GOT IT TO A PARKING GARAGE ALMOST HIT 3 VEHS. IT WAS TRAUMATIC. GM KNOWS ABOUT THIS ISSUE. MANY OTHERS HAVE REPORTED. NOT HAPPY!!!!! GM EXTENDED THE BRAKE WARRANTY TO 150000 MILES. THAT MAKES ME FEEL BETTER. THEY PUT SAME PART BACK ON.  SO I GUESS IT WILL HAPPEN AGAIN.  I'M VERY LEARY OF MY TRUCK.",
        "vin": "3GTP1NEC6HG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11312136,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LIGHT CONTINUES TO COME ON. I'VE HAD IT TO THE SHOP AND THEY SAY THAT IT IS A MANUFACTURING PROBLEM. HOWEVER THEY ARE NOT WILLING TO FIX IT. I HAVE THE SAME PROBLEM ON MY CHEVY HIGH COUNTRY THAT HAS THE SAME 6.6 DIESEL ENGINE IN IT. THE MECHANICS ALL ACKNOWLEDGE THAT THIS IS A PROBLEM FOR ALL OF THESE MODEL 6.6 DIESEL REGARDLESS OF WHETHER IT IS GMC OR CHEVY. THIS SHOULD DEFINITELY BE A RECALL. THE WARNING LIGHT CONTINUALLY COMES UP ON THE DISPLAY SAYING I AM LOW ON FLUID. HOWEVER, WHEN I CHECK IT IT IS ALWAYS FULL. THERE IS A HIGH CHANCE THAT IF IT IS LOW I WILL AUTOMATICALLY RESET IT THINKING THAT THE WARNING LIGHT IS NOT FUNCTIONING CORRECTLY. AGAIN, THE GM TEXT KNOWS THAT THIS IS A PROBLEM THROUGHOUT THE FLEET. AGAIN, THIS SHOULD BE A RECALL. IF YOU HAVE FURTHER QUESTIONS YOU CAN REACH ME AT [XXX] THANK YOU FOR YOUR TIME, [XXX].  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GT12UEY5HF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311579,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD THIS INTO THE DEALER AT THE FIRST OIL CHANGE AND COMPLAINED ABOUT TRANSMISSION SHIFTING ISSUES AND IT BEING UNSAFE TO DRIVE.  COMPLAINTS ARE: HARD SHIFT, IT CLUNKS BOTH UPSHIFTING AND DOWNSHIFTING.  GOING AROUND CORNERS FROM A STOP THE TRUCK WILL EITHER FALL ON ITS FACE OR JERKS YOU VIOLENTLY FORWARD.  IN STOP OR GO TRAFFIC IT IS UNSAFE  AND HAPPENS VERY FREQUENTLY- IT RANDOMLY ACCELERATES (JUMPS) QUICKLY ON ITS OWN WITH SLIGHT PEDAL PRESSURE TO THE POINT WHERE YOU CONSTANTLY HAVE TO BE AWARE AND HAVE YOUR FOOT NEAR THE BRAKE OR YOU CAUSE AN ACCIDENT BY REAR ENDING THE CAR IN FRONT, ITS AS IF THE TRANSMISSION ELECTRONICS GET CONFUSED ON HOW TO ACT.   FEEL SHUDDERING FROM TRUCK'S MOTOR WHERE COLUMN SHIFT LEVER WOULD SHUDDER VIOLENTLY WHERE I WAS AFRAID IT WOULD VIBRATE OUT OF POSITION.  ROUGH IDLE IS INCONSISTENT AT LOWER SPEED WHERE YOU SEE TACH GOING UP AND DOWN.   STARTING COLD YOU GIVE IT AN EASY PEDAL TO MOVE AND WOULDN'T GO.  TRANS DOESN'T KICK IN UNTIL YOU PRESS HARDER AND SOMETIMES WILL LUNGE. HAVE TAKEN INTO THE VARIOUS DEALERS 5-6 TIMES, VALVE BODY CHANGE, ENGINE MOTOR MOUNTS CHANGE AND DEALERS CAN FIND NO FIX.  GM POWERTRAIN WAS EVEN INVOLVED WITH NO HELP.  COMPLAINED TO THE GMC HOTLINE AND THEY SAID NEED 12,000 MILES ON TRUCK BEFORE THE TRUCK KNOWS HOW TO DRIVE BECAUSE OF THE 'SMART' TRANSMISSION  WHERE IT LEARNS YOU'RE DRIVING HABITS.  COMPLAINED THERE ARE 2 OF US THAT DRIVE IT HOW CAN IT LEARN EACH INDIVIDUALS DRIVING WHEN IT DOESN'T REALLY KNOW WHO IS DRIVING.  THEY FINALLY SAID THERE IS NOTHING THAT CAN BE DONE FOR IT, THAT IS THE WAY IT IS.  THIS ALL HAPPENS SPORADICALLY IN BOTH CITY LOW SPEED DRIVING AND HIGHWAY DRIVING, TURNING, BACKING UP OR GOING FORWARD FROM PARKING. BECAUSE OF THESE ISSUES, DIDN'T REALLY DRIVE THE TRUCK MUCH BECAUSE OF THE PROBLEMS.",
        "vin": "1GTV2NEJ1HZ"
    },
    {
        "components": "SEATS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311089,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED MUSHY, VIBRATING BRAKES. TOOK IT TO TIRE STORE AND WAS ADVISED THE BRAKE BOOSTER AND VACUUM PUMP ARE BAD.  I'VE HAD SEVERAL CLOSE CALLS IN PARKING LOTS, AS THE VEHICLE IS SLOW TO RESOND TO THE APPLICATION OF THE BRAKES.     THE DRIVERS SEAT IS ALSO LOOSE. IT MOVES FROM SIDE TO SIDE AS I GO AROUND CORNERS. I'M AFRAID IT WILL COME OFF THE RAILS OR WORSE YET, NOT SECURE ME IN THE EVENT OF AN ACCIDENT.",
        "vin": "3GTU2NEC2HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/23/2020",
        "dateOfIncident": "02/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 GMC SIERRA DENALI HAD ALREADY BEEN THE SUBJECT OF THE RECALL RELATING TO THE BRAKE ISSUE. SHORTLY AFTER THEY PERFORMED THIS RECALL WORK THE BRAKES BEGAN FAILING AT LOW SPEED.   WHEN DRIVING BELOW 5 MPH, THE PEDAL WHICH SUDDENLY FALL AND THE ABS WOULD TRIGGER. DURING THIS TIME, THE CAR WOULD CONTINUE MOVING WITH THE ABS FULLY VIBRATING. THANKFULLY, MY TRAILER HITCH ABSORB THE REAR IMPACT AGAINST A WALL. THE PROBLEM CONTINUED. I THEN TOOK THE TRUCK IN FOR SERVICE AND THEY REPORTED THAT THERE HAS BEEN A SIGNIFICANT FAILURE RATE OF THE VACUUM ASSIST.  THE DEALER REPLACE THE VACUUM PUMP AND VACUUM LINES. I'M EXTREMELY CONCERNED THAT THIS WOULD HAPPEN TO SOMEONE ELSE NEAR AN INTERSECTION, NOT JUST SLOWLY BACKING INTO PARKING SPACES.  I HAVE CONTACTED GMC BY EMAIL BUT STILL HAVE RECEIVED NO RESPONSE OR ACKNOWLEDGMENT OF MY COMMUNICATIONS.",
        "vin": "3GTU2PEJ3HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "01/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307032,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES ARE NOT WORKING TO ITS FULL POTENTIAL.   I BELIEVE MY VACUUM PUMP IS GOING BACK ON MY TRUCK.  I NOTICED LAST WEEK THAT I WAS DRIVING  OUT OF A PARKING LOT AND COMING TO A STOP SIGN AND I PRESSED MY BRAKES AND IT WAS NOT WORKING PROPERLY.  I HAD TO RELEASE THE BRAKE AND SLAM ON THE BRAKES AGAIN ALMOST CAUSING A ACCIDENT WITH INCOMING TRAFFIC.  I CALLED ALL MY LOCAL DEALERSHIPS AND STATED THAT THERE WAS NO RECALL ON THIS JUST YET FOR MY TRUCK, BUT THERE IS A RECALL ON THE VACUUM PUMP.  THEY STATED THEY ALREADY DID THE SOFTWARE UPDATE TO MY TRUCK BACK IN SEPTEMBER 2019.  MY TRUCK WAS GOING MAYBE 10 MPH TO A STOP SIGN AND I APPLIED MY BRAKES ONCE AND WAS NOT COMPLETELY STOPPING, SO I TOOK MY FOOT OFF THE BRAKE PEDAL, AND IT GOT WORSE AND I HAD THE BRAKES PRESSED ALL THE WAY DOWN TO THE FLOOR.  THIS IS NOT SAFE!  THIS IS MY DAILY DRIVER AND I DROP MY KIDS OFF TO SCHOOL EVERY DAY AND ITS NOT A GOOD FEELING KNOWING MY BRAKES CAN GO OUT AT ANY TIME!",
        "vin": "3GTU2PEC4HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFTS VERY HARD IN AND OUT OF 1ST AND 2ND GEAR.  WHEN STARTING TO GO AT LOW SPEEDS THE VEHICLE ALMOST STOPS WHEN SHIFTING AND THEN JERKS WHEN IT SHIFTS. SAME OCCURS WHEN SLOWING TO A STOP. VEHICLE WAS TAKEN TO THE DEALER AND THE POWER TRAIN WAS REPROGRAMMED. THE ISSUE WAS A LITTLE BETTER FOR A WHILE. A FEW WEEKS LATER THE SAME ISSUE APPEARED AGAIN. VEHICLE WAS TAKEN BACK TO THE DEALER IN JANUARY 2020 AND THERE IS NOW A CHECK ENGINE CODE. DEALER PLANS TO CHANGE 2 HARNESSES AND CHANGE THE FLUID. UNFORTUNATELY THE PARTS ARE ON BACK ORDER WHICH KIND OF TELLS A STORY.",
        "vin": "3GTU2NEC9HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306627,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MY DRIVEWAY ON DRY PAVEMENT AT SLOW SPEEDS WHEN PRESSING THE BRAKE PEDAL THE VEHICLE DOES NOT STOP SATISFACTORY. THE BRAKE PEDAL WAS THEN PRESSED UNTIL IT WAS VERY HARD THE VEHICLE CONTINUED TO MOVE BUT SLOWLY BEGAN TO STOP. WHEN PRESSING THE BRAKE PEDAL TO THE MAXIMUM AND A FIRM PEDAL A NOISE COULD BE HEARD FROM UNDER THE HOOD. THE NOISE SOUNDED LIKE A MOAN, SIMILAR TO THE BRAKE ANTI SKID SYSTEM BEING ACTIVATED. I WAS ABLE TO SIMULATE THIS BRAKING PROBLEM MULTIPLE TIMES WHILE BACKING UP AND MOVING FORWARD AT SLOW SPEEDS. CYCLING THE IGNITION ON AND OFF DID NOT CORRECT THE PROBLEM.",
        "vin": "3GTU2NEC8HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE THE COMPLAINT NUMBER 11306627. THE VEHICLE HAD THE BRAKE RECALL NOTICE N192268490 COMPLIED WITH AT THE DEALER IN NOVEMBER 2019. THE VEHICLE THEN EXPERIENCED A BRAKE FAILURE IN FEBRUARY 2020. PLEASE ADD THIS INFORMATION TO MY ORIGINAL COMPLAINT.",
        "vin": "3GTU2NEC8HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE VACUUM PUMP FAILURE. VEHICLE BRAKE PEDAL BECOMES VERY HARD TO DEPRESS AT SLOW SPEED AND VERY HARD TO STOP. USUALLY HAPPENS WHEN IN SLOW TRAFFIC AND AFTER THE PEDAL IS DEPRESS MORE THAN 2-3 TIMES IN A ROW.",
        "vin": "3GTU2NEC2HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306166,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA. THE CONTACT STATED THAT WHILE DRIVING AT 70 MPH THEIR WAS SUDDEN LOSS OF MOTIVE POWER AND THE GEARS DISENGAGED. THE CONTACT STATED THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT PULLED THE VEHICLE TO THE SIDE OF THE ROAD AND RESTARTED VEHICLE AND THE CHECK ENGINE WARNING LIGHT DISAPPEARED. THE VEHICLE WAS TOWED TO (DUBLIN CHEVROLET GMC BUICK, 2042 VETERANS BLVD, DUBLIN, GA 31021 (478-246-4916) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION SHOWED EVIDENCE OF LARGE AMOUNTS OF METAL SHAVINGS FROM THE TORQUE CONVERTER. THE OIL PAN ALSO SHOWED EVIDENCE BURNT METAL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND A CASE WAS OPENED. THE FAILURE MILEAGE WAS 61,719.",
        "vin": "3GTU2MEC8HG"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER 19V328000 (ENGINE) HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED ANY FAILURE. THE CONTACT CONTACTED THE DEALER (WHEELER CHEVROLET BUICK LOCATED AT 11401 N STRAITS HWY, CHEBOYGAN, MI  49721) WHO INFORMED THE CONTACT THAT THE PART FOR THE REPAIR WAS UNAVAILABLE. THE DEALER WAS UNABLE TO PROVIDE AN ESTIMATED TIME FOR THE REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE.  VIN TOOL CONFIRMS PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1GT12UEYXHF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/24/2020",
        "dateOfIncident": "10/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OCTOBER 2019 WENT TO THE DEALERSHIP TO HAVE BREAKS WORKED ON GIVEN RECENT RECALL ABOUT THE MECHANICAL VACUUM PUMP OUTPUT MAY DECREASE OVER TIME, DECREASING THE AMOUNT OF VACUUM/POWER BRAKE ASSIST. HOWEVER, SHORTLY AFTER GETTING THE RECALL DONE ON MY TRUCK (1 WEEK LATER) I WAS IN THE PARKING LOT BACKING UP OUT OF MY PARKING SPOT AND THE BREAK PEDAL BECAME REALLY STIFF AND I COULDN'T PUSH HARD ENOUGH TO STOP THE VEHICLE FROM MOVING. I JUST KEPT ROLLING UNTIL I HIT THE CURB. SO FAR THIS HAS HAPPENED A DOZEN TIMES AND ALL WHEN I WAS MOVING ABOUT 5 MILES AN HOUR THE EXACT SAME WAY, PEDAL BECOMES STIFF AND I COULDN'T STOP THE TRUCK FROM MOVING. I FEEL LIKE THINGS ARE WORSE NOW AFTER GETTING THE RECALL DONE. THIS WAS NEVER AN ISSUE BEFORE AND AS I LOOK AT THE RECALL NOTICE, IT STATE INCOMPLETE, TELLING ME POSSIBLY THE MANUFACTURE KNOWS THERE'S STILL AN ISSUE BUT NO FIX HAS BEEN DONE YET, EVEN AFTER 4 MONTHS.",
        "vin": "3GTU2NEC2HG"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "09/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298142,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 GMC SIERRA DENALI 1500. I BOUGHT IT NEW AND IT HAS VERY, VERY LOW MILEAGE.  AT VARIOUS SPEEDS THERE IS A VIBRATION. FEELS LIKE I AM DRIVING OVER RUMBLE STRIPS. I HAVE ALWAYS NOTICED IT BUT MOSTLY THOUGHT IT WAS JUST SPOTS ON THE ROAD THAT WERE CAUSING IT.  I STARTED TO DO A LITTLE RESEARCH AND LEARNED THAT THIS IS A KNOW ISSUE IN CHEVROLET AND GMC TRUCKS. NUMEROUS STORIES OF DEALERS IGNORING IT, COMPLAINTS ON MANY FORUMS, WHOLE WEBSITE DEDICATED TO IT, A NUMBER OF CLASS ACTION LAWSUITS, AND REPORTS TO THE NHTSA. LITERALLY THOUSANDS OF OWNERS ARE INVOLVED.  GM HAS ISSUED A PRELIMINARY INVESTIGATION SERVICE BULLETIN (BULLETIN NO.: PI1354I), BUT DEALERS WANT TO CHARGE FOR DIAGNOSING AND POSSIBLY REPAIRING THIS MANUFACTURER'S DEFECT.",
        "vin": "3GTU2PEJ5HG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/05/2020",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297243,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT ON THIS TRUCK ARE EXTREMELY HORRIBLE AND UNSAFE AT NIGHT TIME. THE LIGHT OUTPUT IS WORST THEN ANY OTHER VEHICLE I HAVE EVER DROVE. GM NEEDS TO STAND BEHIND THE ISSUE AND PROVIDE A SOLUTION",
        "vin": "1GT12UEY1HF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FREQUENTLY EXHIBITS LOSS OF BRAKING POWER.  WHEN THIS OCCURS, SOMETHING SOUNDING LIKE THE ABS SYSTEMS IS SOMETIMES ENGAGED BY THE VEHICLE AND OTHER TIMES NOT.  WHILE GM CLAIMS BRAKING PERFORMANCE MEETS FEDERAL STANDARDS, THE BRAKING POWER IS GREATLY REDUCED WHEN THE HYDRAULIC SYSTEM IS ENGAGED AND ALMOST NON-EXISTENT WHEN NEITHER VACUUM PUMP NOR THE HYDRAULIC SYSTEM FUNCTIONS.  EVEN IF THE BRAKING PERFORMANCE MEETS FEDERAL STANDARDS, IT CREATES A DANGEROUS SITUATION WHEN THE DRIVER IS NOT EXPECTING A FAILURE.  A GMC DEALERSHIP HAS ADMITTED THERE IS AN ISSUE AND RECOMMENDS REPLACING THE VACUUM PUMP BUT HAS BEEN UNABLE TO SOURCE THE PARTS IN OVER TWO WEEKS AND HAS NO ETA FOR WHEN THE PART WILL BE AVAILABLE.  MEANWHILE THE BRAKING POWER LOSS CONDITION OCCURS EVERY TIME THE VEHICLE IS DRIVEN.  DURING THE FIRST INSTANCE, I WAS TOWING A TRAVEL TRAILER IN STOP AND GO TRAFFIC DOWN A 7% GRADE.  HAD IT NOT BEEN FOR THE TRAILER BRAKES, THIS COULD HAVE BEEN CATASTROPHIC.  THE SECOND OCCURRENCE INVOLVED BACKING INTO MY DRIVEWAY AND NEARLY CAUSING A COLLISION BECAUSE OF POOR BRAKING PERFORMANCE.  NOW THAT I FULLY AWARE OF THE ISSUE, THE VEHICLE IS DRIVEN SPARINGLY (ONLY WHEN ABSOLUTELY NEEDED) AND WITH GREAT CARE.  THE CHARACTERIZATION OF THIS ISSUE BY GM AS NOT BEING A GRAVE SAFETY CONCERN IS INACCURATE.  THEIR INABILITY TO SOURCE PARTS IN A TIMELY MANNER IS INEXCUSABLE.",
        "vin": "3GTU2NEJ0HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SHUTTERING IN THE TRANSMISSION AS THE VEHICLE ATTEMPTS TO CLIMB SLIGHT/STEEP GRADES AT SLOW TO MEDIUM SPEEDS.  AROUND 1500 RPM THE VIBRATION IS SENT THROUGHOUT THE WHOLE VEHICLE.  HAVING TO INCREASE ACCELERATION TO ALLOW THE TRUCK TO SHIFT PROPERLY TO OVERCOME THE LACK OF POWER HAS CREATED A DANGEROUS SITUATION WHILE NAVIGATING UP SNOWY/ICE HILLS.     THE VEHICLE ALSO PERFORMS A LURCHING OR SUDDEN SPEEDING UP WHEN DOWNSHIFTING WHEN SLOWING TO COME TO A STOP.  DEPENDING ON ROAD CONDITIONS THIS CREATES A DANGEROUS SITUATION WHEN APPROACHING ICY/SLIPPERY INTERSECTIONS.",
        "vin": "3GTU2NECXHG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING VEHICLE ON HIGHWAY, I EXPERIENCE A SHAKE/SHUDDER WHEN AT SPEEDS OF 50 MPH AND HIGHER.  VEHICLE WAS TAKEN TO DEALER STATED THAT THE TORQUE CONVERTER DID SHUDDER.  DEALER CHANGED TRANSMISSION FLUID AND I WAS ADVISED TO DRIVE FOR 200 MILES TO SEE IF PROBLEM WAS CORRECTED.  SHUDDER STILL REMAINS AND NOW THE VIBRATION IS CONSTANT AT 70 MPH.  I CALLED DEALER AGAIN WHO SAID THAT IT WAS PROBABLY A TIRE BALANCE ISSUE.  I ARGUED WITH THEM AND STATED I HAD NO SUCH ISSUE BEFORE FIRST BRINGING VEHICLE IN.  DEALER IS SETTING UP APPOINTMENT FOR ME TO TAKE IN AGAIN.  VIBRATIONS HAVE LITERALLY CAUSED MY 6 YR OLD DAUGHTER TO VOMIT ON 3 DIFFERENT OCCASIONS WHEN IN THE VEHICLE.  SHE HAS ONLY BEEN IN VEHICLE 5 OR 6 TIMES. VEHICLE FEELS UNSAFE AT HIGHWAY SPEEDS.  I HAVE READ MANY FORUMS ONLINE STATING THIS ISSUE IS ON MANY VEHICLES GM HAS MADE.  I AM CURIOUS AS TO WHEN GM WILL BE MANDATED TO TAKE CORRECTIVE ACTION OR BUY THE VEHICLES BACK FROM THE OWNERS.",
        "vin": "3GTU2NEJ8HG"
    },
    {
        "components": "SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST AND MOST IMPORTANTLY MY BRAKES ARE MY MAIN ISSUE AND SAFETY PROBLEM.   I NEARLY RAN INTO THE CAR IN FRONT OF ME AT A BUSY INTERSECTION.  MY TRUCKS BRAKES LOSE PRESSURE AFTER THE FIRST INITIAL STOP COMING TO ANY TRAFFIC LIGHTS, STOP SIGN, SLOW TRAFFIC, PARKING LOTS ETC... NO MATTER HOW SLOW OR FAST THE TRUCKS MOVEMENT IS.  FIRST BREAK ATTEMPT IS OK BUT 2ND STARTS LOSING PRESSURE AND 3RD ATTEMPT IS COMPLETE LOST OF PRESSURE ANF AND THE TRUCK JUST ROLLS UNTIL IT SLOWLY COMES TO A STOP.  I WORRY ABOUT THE SAFETY OF MYSELF AND OTHERS MOTORIST REGARDING THIS ISSUE.          MY SECOND COMPLAINT IS MY DRIVER SIDE MIRROR.  EVERY TIME I GET INTO MY TRUCK AND START IT. MY DRIVER SIDE MIRROR MOVES OUT OF ITS SETTING AND I CONSTANTLY HAVE TO FIX IT.",
        "vin": "3GTP1NEC2HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287017,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS SHUDDERING AND SHACKING AT SPEEDS ANY WHERE FROM 35 TO 55 MPH. I TOOK IT TO THE DEALERSHIP AND WAS TOLD IT'S A KNOWN TORQUE CONVERTER ISSUE.",
        "vin": "3GTU2PEJ0HG"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279784,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER USING THE REMOTE STARTER WHILE VEHICLE WAS PARKED IN MY DRIVEWAY, I STARTED TO DRIVE MY GRANDSON TO SCHOOL. A SHORT DISTANCE FROM HOME SMOKE AND SPARKS STARTED TO EMIT FROM THE REAR SEAT NEXT TO THE SLIDING WINDOW AND ELECTRIC REAR WINDOW DEFROSTER. AS I PULLED OVER THE REAR WINDOW PANEL ON THE PASSENGER SIDE BURST. I ASSUME FROM EXCESSIVE HEAT GENERATED BY THE REAR WINDOW DEFROSTER.",
        "vin": "3GTU2PEC6HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279922,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAST MONTH AS I PUSH ON THE BRAKES DRIVING ON THE ROAD MY STEERING WHEEL STARTS TO SHAKE AS THE BRAKES ARE BEING APPLIED.  DOES NOT HAPPEN ALL THE TIME HAS ACTUALLY ONLY HAPPENED 3 TIMES IN A MONTH.",
        "vin": "1GT12UEY8HF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "10/31/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271464,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 GMC SIERRA SHUTTERS AND JERKS WHEN GOING INTO AND OUT OF 1ST GEAR AND GOING AROUND CORNERS WHEN IT CHANGES GEARS.  ESPECIALLY WHEN COLD.  DOES NOT HAPPEN ALL THE TIME. AT TIMES IT HAS JERKED INTO AN INTERSECTIONAND WAS SCRY.  MY WIFE WILL NOT DRIVE THIS VEHICLE.  HAVE HAD IT LOOKED AT NUMEROUS TIMES AND THEY HAVE CHANGED THE FLUID.  THEY TELL ME I HAVE A QUIRKY TRANS OR IT IS INHERENT TO THIS TRANSMISSION.  IT IS EXTREMELY FRUSTRATING AND SCARY AT TIMES.  I DON'T KNOW WHAT TO DO TO GET GM TO FIX IT.  THIS HAS BEEN GOING ON SINCE I PURCHASED THE TRUCK ON 10/31/2017.",
        "vin": "3GTU1NEJ0HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2019",
        "dateOfIncident": "10/26/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING PEDAL FEELS LIKE GURGLING AND AT TIMES COMPLETE LOSS OF POWER ASSIST MAKING PEDAL VERY HARD TO DEPRESS ALL WERE IN MOTION AND INTERMITTENT MAKING DEALER DIAGNOSIS DIFFICULT AND NOT YET ABLE TO REPLICATE SO DEALER REFUSES TO DO WORK",
        "vin": "3GTU2PEJ0HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR NHTSA RECALL 19V645, WHY DID NHTSA ACCEPT A 'REPROGRAMMING' OF THE FUNCTIONALITY TO 'BAND AID' THE ISSUE RATHER THAN REQUIRING REPLACEMENT OF THE VACUUM PUMP, WHICH IS THE IDENTIFIED DEFECTIVE ITEM?",
        "vin": "1GTV2MECXHZ"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2019",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXHIBITS VIBRATIONS THAT CAN BE RATHER EXTREME AT TIMES. IT SEEMS TO BE MOST NOTICEABLE IN THE 70-75 MPH RANGE BUT CAN SOMETIMES BE FELT AT OTHER SPEEDS. IT FEELS LIKE THE VIBRATION ORIGINATES FROM THE REAR OF THE VEHICLE. TWO DEALERSHIPS HAVE REPLACED MULTIPLE PARTS AND HAVE PERFORMED NUMEROUS ALIGNMENTS AND ROAD FORCE BALANCES BUT CAN NOT IDENTIFY/REMEDY THE PROBLEM. THERE ARE THOUSANDS OF COMPLAINTS ON MULTIPLE ONLINE FORUMS OF THIS SAME ISSUE FOR 2014-2015 GM 1500 SERIES PICKUP TRUCK. SO FAR THERE HAS BEEN NO FIX FOR THEM EITHER. GM TREATS IT AS AN ANNOYANCE IN THE COMFORT OF THE RIDE, HOWEVER IF THEY CAN NOT IDENTIFY THE ISSUE HOW DO THEY KNOW IT IS NOT A SAFETY RISK.",
        "vin": "1GTN1LEC0HZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING UP A SLIGHT INCLINE IN A PARKING GARAGE WHEN THE ENGINE STARTED SPUTTERING AND SHUT OFF. AFTER SEVERAL ATTEMPTS IT STARTED AND WE WERE ABLE TO MAKE IT TO A PARKING SPACE WITH THE ENGINE STILL SPUTTERING. I RECEIVED A NOTIFICATION FROM THE TRUCK, DECREASED ENGINE POWER. THE NEXT DAY I BROUGHT IT TO BE CHECKED BY THE LOCAL GMC DEALER. THEIR DIAGNOSIS IS VAPOR LOCK WHEN THE FUEL PUMP GETS NEAR OR OVER 100 DEGREE. ITS MY OPINION THAT GMC PLACED A FAULTY PART WHEN MANUFACTURING THE VEHICLE. I WOULD LIKE THIS TO BE CONSIDERED FOR RECALL.",
        "vin": "3GTU2MEC2HG"
    },
    {
        "components": "POWER TRAIN,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD WIPER FLUID ONLY SPRAYS OUT 30% OF THE TIME. USUALLY IN THE MORNING THEN ANY OTHER TIME OF THE DAY IT WILL NOT SPRAY OUT. THEY REPLACED THE PUMP AND THAT DID NOT FIX IT AND THEY WON'T DO ANYTHING ELSE AND NOW IT IS OUT OF WARRANTY.    WHEN RUNNING LOWER RPMS DRIVING THE TRUCK IT BEGINS TO FEEL LIKE ITS SHAKING FORWARD AND BACKWARDS, LIKE A SHUDDERING FEELING. I HAVE READ ABOUT OTHER PEOPLE HAVING THIS PROBLEM AND IT DESCRIBES MINE PERFECTLY. I HAVE THE 8SPEED",
        "vin": "3GTU2NEC4HG"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GMC HAS REFUSED TO FIND A FIX FOR THE HEATER CORD DEFECT WHICH IS ONE OF THE MAIN REASON WHY I PURCHASED THE VEHICLE. I LIVE IN IDAHO. GMC SHOULD COMPENSATE OWNERS UNTIL FIXED.",
        "vin": "1GT42YEY4HF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTREMELY HARD SHIFTS UP-AND-DOWN IN THE 1ST 2 GEARS FOLLOWED BY HESITATION AFTER STOPPING AND STARTING",
        "vin": "3GTU2NEJ1HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257530,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA 1500. WHILE THE VEHICLE WAS IDLING AT A TRAFFIC LIGHT, IT BEGAN TO RATTLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO FRESNO BUICK GMC (LOCATED AT 5515 N BLACKSTONE AVE, FRESNO, CA 93710, (559) 742-4113) WHERE AN UNKNOWN DIAGNOSIS AND REPAIR WERE PERFORMED; HOWEVER, THE FAILURE CONTINUED. THE MANUFACTURER  WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 24,000.",
        "vin": "3GTP1MEC8HG"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/22/2019",
        "dateOfIncident": "09/19/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11257171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD MAJOR HEAD ON COLLISION AND THE AIR BAGS DID NOT DEPLOY",
        "vin": "1GT12UEY2HF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256321,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS BACKING UP I APPLIED MY BRAKES AND FOR SOME REASON NOTHING HAPPENED WHICH RESULTED IN MY HITTING MY WIFE'S CAR AND DAMAGING HER DRIVERS SIDE QUARTER PANEL. WHEN I ASKED GMC ABOUT THE ISSUE THEY SAID IT WAS JUST AN ERROR ON MY PART. NOW I FIND OUT THAT THERE IS A RECALL ON THE BRAKING SYSTEM THAT THE PRESSURE TO THE BRAKES MAY BE AFFECTED. WHO IS RESPONSIBLE FOR THE DAMAGE TO HER CAR?",
        "vin": "3GTU2PEJ0HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/11/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE DECEMBER OF 2017 THE TRANSMISSION, WHEN COLD, AT APPROX. 25 MPH AND AT 40-44 MPH WHEN NEUTRAL THROTTLE IS APPLIED, BANGS BETWEEN GEARS FORCING THE OPERATOR TO EITHER ACCELERATE OR DECELERATE  SO THE CONDITION WILL CEASE. IF THERE IS NO CHANGE BY THE OPERATOR, IT FEELS AS IF THE TRANSMISSION WILL BREAK THE U-JOINTS IN THE DRIVELINE OR BLOWOUT THE REAR-END GEARS. I HAVE MADE NUMEROUS ATTEMPTS WITH GMC TO REMEDY THE ISSUE TO NO AVAIL. THE VEHICLE HAS BEEN IN THE DEALERSHIP IN EXCESS OF 40 DAYS FOR THE SAME PROBLEM WITH NO RESOLUTION",
        "vin": "1GT42YEY6HF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11251908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION AT HIGHWAY SPEEDS.  BEEN TO THE DEALER 6 TIMES.  TIRES REPLACED ORIGINALLY, THEN TIRES BALANCED THE SECOND TIME, THIRD TIME \"ACCEPTABLE VIBRATION\", FOURTH TIME \"COULD NOT DUPLICATE ISSUE\", FIFTH TIME \"PROBLEM RECOGNIZED, TORQUE CONVERTER REPLACED\", SIXTH TIME \"ACCEPTABLE VIBRATION\".",
        "vin": "1GTV2NECXHZ"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY HAVE 18,820 MILES ON OUR TRUCK AND THE AIRBAG LIGHT IS ON.  SHOULDN'T HAVE ISSUES WITH AIRBAGS ON A TRUCK THAT'S BARELY DRIVEN.",
        "vin": "3GTU2NEJ6HG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CROSSCONTACT LX",
                "productYear": "9999",
                "size": "225/75R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA EQUIPPED WITH CONTINENTAL CROSSCONTACT LX TIRES, SIZE: 275/552/0352 (NA). THE CONTACT STATED THAT THE TIRES FLATTENED. THE TIRES WERE THE ORIGINAL TIRES AND THEY LOST AIR IMMEDIATELY. DIAMOND AUTO GROUP (768 WASHINGTON ST RT. 20, AUBURN, MA 01501, (508) 635-4207) WAS CONTACTED, BUT THEY DID NOT WANT TO REPAIR OR CHANGE THE TIRES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE VEHICLE FAILURE MILEAGE WAS 33,731 AND THE TIRE FAILURE MILEAGE WAS 73,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220732,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK HAS LANE DEPARTURE SENSOR, SENSORS YOU ARE TOO CLOSE, BACKUP SENSORS. LAST DECEMBER THESE QUIT WORKING. THEY THOUGHT BE CAUSE I PUT A NEW WINDSHIELD IN SO THEY CHANGES THE WINDSHIELD, THEN CHANGED THE CAMERA AND IT DIDN'T HELP. FOR 6 MONTHS THEY HAVE BEEN TELLING ME THEY ARE WORKING WITH GM TECHNICAL ASSISTANCE. LAST WEEK GM TELLS DEALER NEED TO CHANGE WINDSHIELD, CAMERA AND A SENSOR, STILL DOESN'T WORK AND NOW NEITHER DO ANY OF THE OTHER SAFETY SENSORS. GM CALLS AND SAYS THEY ARE WORKING WITH TECHNICAL ASSISTANCE.",
        "vin": "1GT12UEY5HF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD SHIFTING BETWEEN GEARS AND COMING TO A STOP",
        "vin": "3GTU2NEC9HG"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/10/2019",
        "dateOfIncident": "10/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219070,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA. WHILE REVERSING, THE VEHICLE HESITATED AND SURGED FORWARD. WHILE DRIVING VARIOUS SPEEDS, THE ACCELERATOR PEDAL WAS RELEASED AND THE VEHICLE  ACCELERATED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO SILVER STAR BUICK GMC (3601 AUTO MALL DR, THOUSAND OAKS, CA 91362, (805) 222-4789) WHERE IT WAS DIAGNOSED THAT THE SOFTWARE NEEDED TO BE UPDATED AND THE VEHICLE WAS PERFORMING AS DESIGNED. THE VEHICLE WAS REPAIRED; HOWEVER ,THE FAILURE RECURRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 415.",
        "vin": "3GTU1NEC1HG"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/23/2019",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STABILITRAK SENSOR KEEPS GOING ON AND OFF. I'VE HAD THIS ISSUE WHEN I FIRST GOT THE TRUCK IN THE END OF OCTOBER IN 2017. THE DEALERSHIP COULD NOT FIX IT AT FIRST BUT FINALLY HAD TO FIX SOME WIRING. I'VE SEEN IT GO ON A FEW TIMES SINCE THEN BUT NEVER STAYED ON. AND FOR ABOUT 2-3 WEEKS IT'S BEEN COMING ON AND OFF BUT STAYING MORE ON AND NOT GOING AWAY NOW. I FEEL LIKE THIS SHOULDN'T HAPPEN TO A NEWER TRUCK",
        "vin": "3GTU2NEC8HG"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "02/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 19V088000 (FUEL SYSTEM) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTICE IN FEBRUARY OF 2019. SPRINGFIELD BUICK GMC (431 RIVER ST, NORTH SPRINGFIELD, VT 05150) STATED THAT THE PARTS WERE UNAVAILABLE TO PERFORM THE REPAIR. THE MANUFACTURER WAS ALSO CONTACTED AND CONFIRMED THAT THE PARTS WERE UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GD32VCG8HZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I REMOTE STARTED THE VEHICLE TO ALLOW IT TO WARM UP.  THE REAR WINDOW DEFROSTER AUTOMATICALLY TURNED ON.  AFTER A FEW MINUTES, I GOT INTO THE VEHICLE AND NOTICED A BURNING SMELL AS WELL AS SMOKE COMING OUT OF THE SQUARE CONTROL UNIT ON THE REAR SLIDING WINDOW.  QUICKLY, I SHUT OFF THE VEHICLE IN CASE THERE WOULD BE A FIRE.  AFTER DOING SOME RESEARCH, I NOTICED THAT THERE HAVE BEEN SEVERAL SIMILAR COMPLAINTS.  OTHER PEOPLE HAVE REPORTED THAT THEY NOTICED REAR DEFROSTER WIRES GLOWING AND MELTING TRIM WHILE OTHER HAVE REPORTED SMOKE AND SUBSEQUENT SHATTERING OF THE REAR WINDOW.  THIS HAPPENED ABOUT ONE MONTH AGO (I DO NOT HAVE THE EXACT DATE).",
        "vin": "1GT12UEY5HF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK LAGS POWER WHEN PRESSING THE GAS PEDAL AT TIMES AFTER PUTTING TRANSMISSION INTO DRIVE FROM REVERSE. TRANSMISSION SHIFTS HARD INTO AND OUT OF FIRST GEAR AND AT TIMES FEELS LIKE IT IS SKIPPING 2ND GEAR DURING A DOWNSHIFT.",
        "vin": "3GTU2NEC9HG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/28/2019",
        "dateOfIncident": "01/27/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING MY 2017 GMC SIERRA WITH MY WIFE AND YOUNG SON. I WENT TO STOP AT A RED LIGHT AND HAD NO BRAKES. THE BRAKE WAS VERY HARD TO PUSH AND MADE A FUNNY CLICKING NOISE WHEN I SHOVED IT TO THE FLOOR. I WAS BARELY ABLE TO AVOID A COLLISION AND PULL INTO A PARKING LOT. I NOTICED THEN, THAT THE SERVICE BRAKE ASSIST LIGHT WAS ON. THE TRUCK GAVE NO PRIOR WARNING THAT ANYTHING WAS WRONG. THIS WAS A VERY SCARY SITUATION THAT COULD HAVE RESULTED IN A TERRIBLE ACCIDENT.",
        "vin": "3GTU2NEC4HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "10/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS SURGING AND HESITATION. DEALER CANNOT FIX.",
        "vin": "3GTP1PEJ9HG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154567,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN REVERSE IS ACTIVATED AT NIGHT, THE BACKUP CAMERA COMES ON AT FULL BRIGHTNESS AND IS NOT DIMMABLE. THE BRIGHT SCREEN PREVENTS VIEW OF THE PASSENGER SIDE MIRROR AND SIGNIFICANTLY REDUCES VISIBILITY IN THE DRIVER SIDE MIRROR WHILE REVERSING. THE SCREEN CANNOT BE DEACTIVATED AND BLINDS THE DRIVER. THIS IS AN ONGOING ISSUE.",
        "vin": "1GTV2NEC3HZ"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154030,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY AT 70MPH, A SERVICE BRAKE ASSISTANT WARNING CAME ON.  THE BRAKES AT THAT POINT WERE EXTREMELY DIFFICULT TO USE AND THERE WAS NO WAY FOR A QUICK STOP.  WAS ABLE TO GET TO A DEALERSHIP WHERE THEY HAD TO REPLACE THE MASTER CYLINDER, THE BOOSTER PUMP, VACUUM PUMP AND TUBING.  COST FOR THE REPAIR WAS OVER $1,200.",
        "vin": "3GTP1NEC1HG"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2018",
        "dateOfIncident": "10/07/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN REVERSE IS ACTIVATED AT NIGHT, THE BACKUP CAMERA COMES ON AT FULL BRIGHTNESS AND IS NOT DIMMABLE. THE BRIGHT SCREEN PREVENTS VIEW OF THE PASSENGER SIDE MIRROR AND SIGNIFICANTLY REDUCES VISIBILITY IN THE DRIVER SIDE MIRROR WHILE REVERSING. THE SCREEN CANNOT BE DEACTIVATED AND BLINDS THE DRIVER. THIS IS AN ONGOING ISSUE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122903,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"CHEVY SAKE\". AT SPEEDS OVER 70MPH EXCESSIVE VIBRATION INSIDE THE VEHICLE.  THIS IS WELL DOCUMENTED ON-LINE, PARTICULARLY VARIOUS GM FORUMS AND YOU TUBE VIDEOS. IT IS MY UNDERSTANDING THAT GM DENIES IT IS A PROBLEM, BUT THEY HAVE BEEN DOING SOME BUY BACKS AND IF YOU READ SOME OF THE DEALER BLOGS IT IS EVIDENT THAT GM KNOWS IT IS A PROBLEM.",
        "vin": "3GTU2NEC8HG"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK IS A 3500 HD. I WAS PULLING A CAMPER ON A 1100 MILE TRIP. WITH 50 MILES LEFT I NOTICED THAT THE TRUCK WAS LEAKING TRANSMISSION FLUID FROM UNDER THE TRANSMISSION COOLER. UPON FURTHER INVESTIGATION I FOUND THAT THE RETURN HOSE FROM THE TRANS COOLER WAS POSITIONED SO THE IT RUBBED ON A FRAME COMPONENT WHICH CAUSED A HOLE TO RUB IN THE ALUMINUM TRANS COOLANT RETURN LINE. I NOTICED THIS WHEN THE TRUCK WAS PARKED RUNNING AT A REST AREA FOR AN HOUR BUT IT WAS OBVIOUSLY AN ONGOING ISSUE. HAD I NOT NOTICED IT WHEN I DID THIS CONDITION COULD HAVE CAUSED CATASTROPHIC FAILURE OF THE TRANSMISSION. THE DEALER SAYS THERE IS NO RECALL AND IT IS NOT UNDER WARRANTY. I CONSIDER THIS TO BE A SERIOUS DESIGN FLAW AND A MAJOR SAFETY ISSUE. I WAS ABLE TO GET TO MY DELIVERY STOP AND GET THE LINE PATCHED. IT IS AT THE DEALER FOR REPAIRS RIGHT NOW.",
        "vin": "1GT42YEY0HF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/02/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091384,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURAMAX TICKING NOISE. CONSISTENT TEMPO TICKING NOISE COMING FROM ENGINE BAY. AUDIBLE ONLY WHEN MOVING AT LOW SPEEDS DUE TO INCREASED VEHICLE/ROAD NOISE AT HIGHER SPEEDS. NOT CONSISTENT WITH RPM OR SPEED. NO WARNING LIGHTS OR SYMPTOMS AT THIS TIME. DEALER SAYS NOT COMMON, BUT APPEARS COMMON ON THE INTERNET. CANNOT FIND SOURCE OF NOISE. TRUCK HAS 18K MILES.",
        "vin": "1GT12TEY2HF"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2018",
        "dateOfIncident": "03/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH HAS CRACKED IN 2 PLACES, AND THIS POSES A SAFETY RISK OF SHRAPNEL SHOULD THE AIRBAGS DEPLOY. I UNDERSTAND THIS IS A COMMON PROBLEM WITH THIS AND RELATED MODELS. GMC SHOULD REPLACE THE DASH.",
        "vin": "1GTHK23657F"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "07/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080220,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY VEHICLE IN FOR REPAIR SEVERAL TIME ON THE PASSENGER SEAT BELT DOES NOT PROVIDE A WARNING WHEN DISCONNECTED WHILE OPERATING.  THE DEALER IS TELLING ME THAT IS WAS NOT INSTALLED IN THAT MODEL AND YEAR.  I DO NOT FEEL SAFE HAVE A PASSENGER IN THE SEAT WITH OUT THE WARNING LETTING ME KNOW THAT ARE UNBUCKLED.  MY WIFE RODE FOR OVER 200 MILES WITH IT DISCONNECTED BY NO FAULT OF HER OWN.  I FEEL THIS IS A SAFETY ISSUES AND NEED ADDRESSED WITH GMC THE CHEVY SAME YEAR IT WORKS.",
        "vin": "1GT12TEG6HF"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076600,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALMOST KILLED A KID TODAY PARKING FOR A BASEBALL GAME. I WAS TRAVELING SLOWLY AND PARKING WHEN MY BRAKES BECAME HARD TO PUSH AND FAILED. TRUCK WENT OVER CURB AND TOWARD KID PUTTING ON HIS CLEATS AND NOT FACING ME. I WAS ABLE TO PUSH AS HARD AS I COULD AND IT STOPPED. I BACKED UP AND BRAKES WORKED AGAIN. I HAVE 46,000 MILES ON THE TRUCK. I AM NOW AFRAID TO DRIVE IT, BUT IT SEEMS THEY ARE WORKING AGAIN. IF THIS IS COMMON, GMC NEEDS TO TAKE CARE OF THIS. SOMEONE WILL SOON BE HURT SERIOUSLY!",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/23/2018",
        "dateOfIncident": "01/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074484,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HARSH 1-2 SHIFT WHEN IT IS UNDER LIGHT THROTTLE AND SOMETIME DOES NOT SHIFT OR MAKE NOSE. GMC DEALER ARE AWARE ABOUT THIS ISSUES ON ALL GM TRUCK MODEL OF 2015 TO 2017 WITH 8SPED TRANSMISSION SINCE APRIL 2017. I HAVE ATTACHED DOCUMENTS GIVEN BY DEALER.",
        "vin": "3GTU2NEC4HG"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/01/2018",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING I-81 S IN MARYLAND, APPROXIMATELY MILE 290, ACCELERATOR STUCK IN FULL THROTTLE.  I HAD ACCELERATED TO PASS A CAR, BUT THE ACCELERATOR WENT TO FULL THROTTLE, AND STUCK ON FULL ACCELERATION.  I STAYED IN THE LEFT LANE, APPLIED BRAKES SPORADICALLY TO LIMIT THE    INCREASED SPEED, AND QUICKLY HIT THE ACCELERATOR PEDAL WITH MY FOOT AND IMMEDIATELY RELEASED SEVERAL TIMES TO TRY TO \"BREAK\" THE ACCELERATOR FREE.  I DID THIS MULTIPLE TIMES WITH NO RESULTS UNTIL FINALLY, WHEN WE WERE AT 94 MPH, THE ACCELERATOR BROKE FREE, AND DISENGAGED.  THE BRAKES SMELLED STRONGLY FROM THE EFFORTS TO RETAIN THE ACCELERATION.  THE TRUCK HAD APPROXIMATELY 2,300 MILES ON IT WHEN THIS OCCURRED.  I HAD PLANNED TO PUT THE TRUCK IN NEUTRAL AND MOVE OFF THE ROAD BEFORE WE HIT 100 MPH.  IF MY HUSBAND HAD BEEN DRIVING, HE MIGHT HAVE TURNED OFF THE CAR AND LOST CONTROL (DUE TO LOSS OF POWER).  THIS WAS EXTREMELY TROUBLING, AND EXTREMELY DANGEROUS.  THANKFULLY, TRAFFIC WAS LIMITED ENOUGH NOT TO CAUSE A WORSE OUTCOME.  I CONTACTED MY DEALER AND THE DEALER WHERE I WAS TRAVELING TO.",
        "vin": "1GT12REG9HF"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/22/2017",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON MY NEW GMC SIERRA 2500HD DENALI ARE HORRIBLE AND UNSAFE FOR DRIVING AT NIGHT.  THE 25 WATT RATING AND 2,000 LUMENS ON THE OEM HID BULBS DO NOT PROVIDE ADEQUATE, SAFE LIGHTING FOR OPERATING MY VEHICLE.  I ALREADY HIT A DEER WITH MY BRAND NEW TRUCK BECAUSE I COULDN'T SEE IT WELL ENOUGH IN ADVANCE OF THE COLLISION.  GMC SHOULD BE HELD ACCOUNTABLE FOR PUTTING SUCH A LOW POWER, POOR QUALITY AND UNSAFE HEADLIGHT IN THEIR $70,000 VEHICLES.  I'M RENTING A HYUNDAI WHILE MY TRUCK IS BEING REPAIRED AND THE HEADLIGHTS ON THIS $30,000 FOREIGN CAR ARE 10XS BETTER THAN THE ONES ON MY TRUCK.  WHY?",
        "vin": "1GT12UEY9HF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "10/16/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054695,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE BEGAN TO SHUTTER WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (DONOVAN AND BAUER AUTO GROUP, 11579 HYDETOWN ROAD, TITUSVILLE, PA 16354), BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER WAS ABLE TO DUPLICATE THE FAILURE, BUT THERE WAS NO REMEDY TO CORRECT THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000. *TT  CONSUMER STATED TRANSMISSION-SHUTTERING FEELS LIKE ENGINE MISS.  UPDATED 8/14/18*JB",
        "vin": "3GTU2NEC5HG"
    },
    {
        "components": "STEERING,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "09/26/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039665,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION 65+ MPH, FELT IN STEERING WHEEL AND SEAT.    STEERING WHEELS QUIVERS AT 65+ MPH.  TRUCK FEELS VERY UNSTABLE AT HIGHWAY SPEEDS.  DEALER STATES IT'S NORMAL.",
        "vin": "3GTU2PEJ1HG"
    },
    {
        "components": "SUSPENSION,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK TRUCK IN FOR FIRST OIL CHANGE.I HAD SEVERAL PROBLEMS INCLUDING THE BACK TIRES BEING OVER 50% WORN OUT. ALIGNMENT WAS OFF AND DEALER REPAIRED THAT AND ROTATED THE TIRES. NOW WHEN I STOP AT ABOUT 5 MPH THE TRUCK JUMPS. I REMOVED THE ABS FUSE AND PROBLEM GOES AWAY. DEALER STATES THERE IS NO WARRANTY ON TIRES EVEN IF THEY WEAR OUT IN 6000 MILES AND THE PROBLEM WAS THE VEHICLE WASN'T PUT TOGETHER PROPERLY THE FIRST TIME.IF THE ROADS WERE COVERED WITH SNOW I WOULD BE IN REAL TROUBLE.NORMAL HIGHWAY  TRAVEL AROUND TOWN",
        "vin": "1GT02SEG2HZ"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011130,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC SIERRA. WHILE DRIVING APPROXIMATELY 5 MPH, THE VEHICLE FAILED TO SHIFT OUT OF GEAR AND THERE WAS A DELAY OF THREE TO FOUR SECONDS BEFORE SHIFTING INTO SECOND GEAR. THE FAILURE RECURRED EVERY MORNING. THE VEHICLE WAS TAKEN TO THE DEALER (JIM CAUSLEY, LOCATED AT 38111 GRATIOT AVE, CLINTON TOWNSHIP, MI 48036) WHERE IT WAS CONFIRMED THAT GM WAS AWARE OF THE ISSUE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THERE WAS NO RECALL ON HIS VIN. NO FURTHER ASSISTANCE WAS OFFERED. THE APPROXIMATE FAILURE MILEAGE WAS 4,500.  UPDATED 11/13/17 *BF  *TR",
        "vin": "3GTU2PEJ5HG"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "05/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NATURE OF CONCERN: WHEN THE VEHICLE IS PUT INTO REVERSE, THE REAR BACK-UP CAMERA COMES ON. THE DISPLAY OF THE CAMERA IS EXTREMELY TOO BRIGHT, AND MAKES IT DIFFICULT TO BACK UP PROPERLY WITH A GLARING LIGHT IN YOUR FACE. THERE IS CURRENTLY NOT AN OPTION TO DECREASE THE BRIGHTNESS OF THE CAMERA.",
        "vin": "1GT12SEY9HF"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "02/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 2500",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 GMC 2500 SIERRA DENALI DURAMAX HAS HAD THIS THROTTLE ISSUE, IT SEEMS TO ONLY DO IT WHEN THE EXHAUST STINKS, AND AT SPEEDS BETWEEN 5 - 55 MPH. IF I TAKE MY FOOT OFF THE ACCELERATOR THE TRUCK MAINTAINS RPM (1200 - 1400) OR EVEN HAS INCREASED SOME AND HAS LASTED 2 - 5 SECONDS (ESTIMATED AND GREATLY REDUCES THE EFFECTIVENESS OF THE BRAKING CAPACITY AND RESPONSIVENESS/STOPPING DISTANCE). WORST WAS WITH A HUGE TRAILER BEHIND AND I GOT UP TO SPEED 55 ON COUNTY HWY 8, AND I LET OFF THE ACCELERATOR AND IT KEPT GOING HARD AND I GOT ON THE BRAKES AND I COULDN'T SLOW IT DOWN UNTIL THE TRUCK DECIDED TO RELEASE OFF THE THROTTLE.(TWO WITNESSES IN THE VEHICLE, ONE A GM TECH, STATING YOUR VEHICLE IS NOT SAFE AND NEEDS TO BE LOOKED AT) IT'S HAPPENED ABOUT 25 TIMES IN 5700 MILES IN VARIOUS SETTINGS & SPEEDS AND HAS OCCURRED FREQUENTLY IN TOWN AT SPEEDS OF 25 - 35 MPH. THERE MAYBE SEVERAL HUNDRED MILES IN BETWEEN EPISODES IF YOU WILL, AS THEY OCCUR IN CLUSTERS WHEN EXHAUST STINKS AND GONE WHEN EXHAUST DOES NOT STINK. TRUCK ALSO HAD TORQUE CONVERTER NOT UNLOCK AND [XXX] NEAR CHOKED THE ENGINE OFF AT STOP SIGN RIGHT AFTER A THROTTLE STUCK CONDITION. GOT HOME THE OTHER NIGHT AND FUEL GAUGE STOPPED WORKING! BACK UP CAMERA IS DAYLIGHT BRIGHT AT NIGHT, LOW COOLANT ISSUES, MAP SENSOR ISSUE, ENGINE SURGED THE OTHER DAY, WHAT NEXT? IT'S CONSTANTLY BEEN AT DEALERSHIPS WITH NO ANSWERS. MY WIFE WON'T DRIVE IT ANYMORE AND WISHES I WOULDN'T EITHER FEARING IT WILL CAUSE AN ACCIDENT AND SHE'S PROBABLY RIGHT. GM HAS STATED THEY ARE AWARE OF THE PROBLEM BUT WILL NOT PROVIDE ANY TRADE IN ASSISTANCE DOLLARS TO GET IT OFF THE ROAD AND THERE IS NO FIX. $70,000+ TRUCK, LIVES AT RISK AND NO SERIOUS RESPONSE FROM GM?    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GT12UEY1HF"
    }
]