[
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/05/2022",
        "dateOfIncident": "08/20/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear break lights malfunctioned and will quite working periodically there has been no inspection from a dealership at this moment and driving at night time puts me and my family at risk due to the fact that I could be rear ended and cause a major accident and my vehicle has no warning light or service light for this problem.",
        "vin": "1gks2gkc4hr"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/13/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Just driving along yesterday in my Yukon, and when I stopped another driver pulled up to me and informed me my right rear brake light is not working. Upon further investigation, it comes in and out (sometimes it works sometimes it does not). I had this same issue with my 2015 Yukon, I would have thought GM would have this fixed by now, very expensive fix on my 2015, assuming it’s the same cost or close. Very dangerous to have a brake light out and reduce another drivers reaction time to stop and prevent a rear end collision. Furthermore the vehicle has no indication that a light or bulb is out, a lot of vehicles have that programming, surprisingly this does not.",
        "vin": "1GKS2HKJ0HR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/07/2022",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Adaptive cruise control system is not properly designed to recognize vehicles that are adjacent to the traveling lane and not directly in front of the vehicle. When traveling on the interstate with adaptive cruise engaged, we came around a bend in the road approaching an entrance ramp. There was a slow moving vehicle on the entrance ramp which was apparently identified by the adaptive cruise system as being in front of our vehicle in the same lane. The adaptive cruise caused our vehicle to brake violently while still in the bend in the road, which in turn caused us to swerve into the next lane where there was a car traveling adjacent, but just behind us. This was a very unexpected series of events, and could have resulted in catastrophic consequences had the adjacent car been any closer at the time. This is a major flaw in the adaptive cruise system. And it is compounded by the fact that the adaptive cruise system cannot be switched over to a manually controlled more traditional cruise system. This is a severe design flaw with the GMC Yukon. Some of this could be remedied by issuing a firmware update that allows the driver to disengage the adaptive cruise and switch to a more traditional cruise control method. But GMC has no interest in providing this update, even with multiple message board threads talking about the dangers of the adaptive cruise control.",
        "vin": "1gks1gkcxhr"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "01/05/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450600,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "This complaint is not in response to an event.  It is a safety issue resulting from a common problem with this vehicle model, i.e.:  brake light failure.  The tail/brake light LED circuit board has a design weakness resulting in cracking of the board in 2 common locations, resulting in stop light illumination failures, which could lead to rear end collisions.  GM has not issued a recall and their extended warranty allowance is inadequate, thereby leaving a significant repair expense falling to owners when the problem is encountered.  The proper safety response is for GM to recall all of the vehicles with this style tail light in order to repair the circuit board weakness.",
        "vin": "1gks2hkj8hr"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/02/2022",
        "dateOfIncident": "11/25/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Taillights and brake lights inoperative. GMC knows of problem and refuses to repair vehicle outside of manufacturer warranty (lights failed after warranty period). I have seen SEVERAL other Yukons on the road with NO brake lights or tail lights. Extremely dangerous situation.",
        "vin": "1GKS1GKCXHR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/24/2021",
        "dateOfIncident": "12/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444903,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear LED brake light stopped working. Supposed to have a vehicle lifetime lifespan. i.e. never require replacing.  This light assembly was found to be defective in the previous year model and not fixed.",
        "vin": "1GKS2GKCXHR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "10/30/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438993,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger rear tail lamp/brake lamp failure. This is a known issue with GMC Yukon vehicles MY 2015-2019 with LED tail lamps. Metal within the lamp vibrates loose and cause the brake lamp to fail - thus resulting in no BRAKE Lamps illuminating at braking. This would be the second time this issue has occurred in 4 months, with the previous repair occurring rear drivers side and logged with NHTSA for this issue under 11436519. Opening this case as now the other side (passenger failed) with the EXACT same issue.",
        "vin": "1GKS2HKJ9HR"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/02/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439120,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Car is shaking when accelerating.  Feels like it will cause more damage.",
        "vin": "1GKS2GKC1HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "We were on the freeway with my 4 small children. The freeway speed is 75 mph. The car had been jerking and hard shifting for over a week and I had it scheduled with a mechanic. As we were driving on the freeway, it lost total power as cars were going to the left and right around us. I was barely able to get it to the side of the road without being hit. This could have been tragic! I took it to the mechanic and the transmission is shaving a lot of metal (that was in the bottom of the pan). I have had to pay to have a whole new transmission redone. This is absurd with a car that is only 4 years old.",
        "vin": "1GKS2GKC7HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436519,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LED Taillight failure REAR DRIVERS SIDE. This seems to be a common occurance amongst GMC Yukon Denali XL, where the circuit housing for the LED board begins failure with fissure within the electrical contact points. The fissure soon erupts causing a shunt within the LED semiconductor and causing the brake lights to cease functioning.",
        "vin": "1GKS2HKJ9HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "08/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Driving on city streets at approximately 45-50 MPH the transmission began shifting erratically and made significant squealing noises. After stopping, the transmission could not be shifted to another gear and was stuck in drive (D) for approximately 30 minutes. After evaluation from a professional auto mechanic, these transmissions were equipped with the incorrect fluid type from the factory that has since been taken off the market. The transmission needed to be replaced at ~99,000 miles.",
        "vin": "1GKS2GKC6HR"
    },
    {
        "components": "LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "08/03/2021",
        "dateOfIncident": "07/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "There is a known issue with the wiring harness that warns the driver by vibrating the driver's seat.  The original wiring harness will short out causing malfunction of the safety feature.  The wiring harness has been redesigned to correct the defect, yet GM has not issued a recall.  The safety feature is an important factor in the operation of the vehicle and when this feature does not work property, safety is compromised.",
        "vin": "1GKS2GKC7HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/29/2021",
        "dateOfIncident": "07/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Brake lights are going out due to cracking in the LED strip.  Slight jars to lights will make them work for a short time.",
        "vin": "1GKS2GKC6HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/15/2021",
        "dateOfIncident": "06/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1) LED tail-lights fail intermittently - this is a known problem GM does not proactively address unless customers complain repeatedly.  Puts driver and passenger in danger.  this began happening at 25K miles. 2) AC condenser fails - GM will not address as part of a broader recall despite extensive late model customer complaints.  This put passengers in danger on any road trip across desert terrain.  GM has been unresponsive despite numerous calls asking for resolution.  This occurred at 36k miles. 3) Electrical failings - numerous electrical failings - from entertainment system (at 10k miles), starter motor and internal lighting - all failing at 36k miles.  NHTSA must take a look at these manufacturing defects - they are putting customers at risk!",
        "vin": "1GKS1GKC7HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/14/2021",
        "dateOfIncident": "07/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "led lights are malfunctioning on my 2017 Yukon xl. causing my brake lights to flicker and then go out completely. I've been pulled over and almost hit from behind due to these lights not working correctly. they have to be replaced by completely removing and replacing the entire light fixture for the high cost of 800+. they are not built to be fixed, just replaced. What's worse is that replacing them only buys you a little time before those again go out. its unsafe and puts my family at risk daily.",
        "vin": "1gks2fkc3hr"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle is misfiring and rough idling while driving. This vehicle has four of the eight fuel injectors misfiring while in operation. Although the dealership only diagnosed two of them I took it to another shop who diagnosed that 4 and 8 are also misfiring.",
        "vin": "1GKS2HKJ0HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423483,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The brake lights fail. First the left light failed, and two days later the right light failed. After researching, this is a common problem with GM and these models. The fix is not just a bulb- the whole rear light assemblies (each side) needs replacing with GM price quotes of $900 a side. We were over 1000 miles away from home.",
        "vin": "1GKS2GKC3HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "04/11/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 GMC Yukon XL. The contact stated while driving at various speeds, the contact noticed that the passenger rear tail light was inoperable. The contact stated no warning light was illuminated. The vehicle was taken to the local dealer where it was diagnosed with the tail light unit needing to be replaced. The vehicle was not repaired. The contact was relating the failure to an unknown recall. The manufacturer had not been informed of the failure. The failure mileage was approximately 106,632.",
        "vin": "1GKS2HKJ6HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/25/2021",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418480,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Passenger side brake light goes in and out and often time stays out.  I have read about numerous other people dealing with same issue as it is a manufacturing/quality issue.  This is very dangerous.  GMG apparently puts the same faulty brake parts back in car while under warranty then when the issue arises again when not in warranty sell customers a pricey part that actually works.  Again, very unsafe and terrible business practice as well.",
        "vin": "1GKS2HKJ9HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/20/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 500 MILES PAST THE ORIGINAL POWERTRAIN WARRANTY OF 60,000 MILES, THE TRANSMISSION FLUID TEMPERATURE SENSOR FAILED.  I KNOW THIS BECAUSE AN ENGINE LIGHT CAME ON DISPLAYING P0700 AND P0711 AND THE GAUGE ON THE DASH IS ERRATIC.  I DID RESEARCH, AND THE TRANSMISSION FOR THESE VEHICLES MODEL GEAR 2015 AND 2016 HAVE SEVERAL ISSUES INCLUDING THIS ONE AS OUTLINED IN SPECIAL COVERAGE N192291660 WHICH EXTENDS THE COVERAGE FOR THIS ISSUE TO 120,000 MILES.  IF GMC HAS THE SAME ISSUE WITH THE PREVIOUS YEAR TRANSMISSIONS AND KNOWS ABOUT IT ENOUGH TO ISSUE A SPECIAL COVERAGE, THEY SHOULD DO THE SAME FOR THE 2017 MODELS.",
        "vin": "1GKS2HKJ0HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "04/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE REAR LED BRAKE LIGHT HAS STOPPED WORKING. IT DOES NOT LIGHT UP.THIS IS A PROBLEM THAT HAS OCCURRED IN THE 2015 AND 2016 YUKONS. I WAS INFORMED BY A FELLOW MOTORIST THAT MY BRAKE LIGHT WAS OUT. THE REPAIR IS ESTIMATED AT $850.00 AS THE WHOLE REAR LIGHT UNIT MUST BE REPLACED.",
        "vin": "1GKS2GKC4HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404824,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING AT A STOP ON A 9DEGREE INCLINE BEHIND ANOTHER VEHICLE I STARTED TO ACCELERATE TO MOVE UP TO THE STOP SIGN. AS I PRESSED ON THE ACCELERATOR THE ENGINE RPM'S INCREASED BUT  THE VEHICLE DIDN'T MOVE AS IF THE TRANSMISSION WAS NOT ENGAGING, THEN WITHOUT WARNING IT JERKED FORWARD. I HAD TO APPLY THE BRAKES TO KEEP FROM HITTING THE VEHICLE IN FRONT OF ME. I HAVE ALSO HAD PROBLEMS WITH THIS VEHICLE TRANSMISSION SUCH AS TRANSMISSION FLUTTER, HARSH SHIFTS IN LOWER GEARS, ETC ETC.",
        "vin": "1GKS2HKJ1HR"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "03/13/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS WORK INTERMITTENTLY. VERY DANGEROUS! PASSENGER SIDE BRAKE LIGHT, STOPPED WORKING COMPLETELY, THEN CAME BACK ON.",
        "vin": "1GKS2GKCXHR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT FAILURE OF ONE BRAKE LIGHT WHILE MOVING.  VEHICLE HAS ONLY 38000 MILES.  THIS APPEARS TO BE A COMMON COMPLAINT (JUDGING BY CAR FORUMS). I UNDERSTAND GMC MAKES AN IMPROVED VERSION OF THIS ASSEMBLY.  GIVEN THE POTENTIAL SAFETY ISSUE, THIS SHOULD BE A RECALL.",
        "vin": "1GKS2GKCXHR"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "01/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STRUGGLED TO START WHEN I STARTED IT. IDLE WAS/HAS BEEN REALLY SHAKY. ENGINE LIGHT CAME ON. I GOT A DIAGNOSIS FROM 2 COMPANIES FOR MY ENGINE. BOTH SAID I NEEDED TO REPLACE ALL 8 FUEL INJECTORS. GMC HAS AN EXTENDED WARRANTY TO COVER THESE ISSUES, BUT IT IS NOT AVAILABLE FOR MY STATE OF UTAH. HERE IS THE CODE FOR REFERENCE FOR YUKON #N182198000. MY CAR IS A YUKON XL 2017 THAT NEEDED FUEL INJECTORS AT 85,000 MILES! HOW IS THIS OKAY? THE REPAIR COST $1,990.28. THE POWER TRAIN WARRANTY HAS BEEN CHANGED FOR 2016 AND 2017 GMC VEHICLES SO THAT IT IS NOW 60,000 MILES OR 5 YEARS. MECHANICS HAVE REPORTED THAT GM HAS CHANGED THE WAY THEY ARE BUILDING ENGINES IN ORDER TO REDUCE COSTS, BUT IT APPEARS THAT CONSUMERS SUCH AS MYSELF ARE BEARING THE BRUNT OF THE COSTS.   I WOULD APPRECIATE IF THE EXTENDED SERVICE WARRANTY COULD BE EXTENDED TO ALL STATES IN THE U.S. VS. THOSE WHO HAVE MANDATED IT BECAUSE OF LEGISLATION OR LEGAL ENFORCEMENT.",
        "vin": "1GKS2GKC4HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "02/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER BRAKE LIGHT IS INTERMITTENT.  CLEARLY ISSUE WITH THE INTERNAL ASSEMBLY.",
        "vin": "1GKS2HKJ0HR"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396662,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NAVIGATION AND INFOTAINMENT  FAILS ON A REGULAR BASIS.  CANNOT USE TOUCH SCREEN WHEN IT FAILS.  FLORIDA DEALER SAID NOTHING WRONG.  THE SCREEN WILL TURN TO A CLOCK WITHOUT TOUCHING IT.  CANNOT USE NAVIGATION  ON MANY DAYS. HAD  TO LOCATE A NEW DOCTOR AND THE NAVIGATION FAILED! HAPPENS WHEN STATIONARY OR IN MOTION. THIS STARTED IN MAY 10, 2018 THROUGH TODAY, FEBRUARY 17, 2021. IT IS ONGOING DAILY.",
        "vin": "1GKS2HKJ8HR"
    },
    {
        "components": "SUSPENSION,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2021",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390222,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE TRANSMISSION WENT OUT MOTOR MOUNDS WENT OUT AND SEAT STOPPED WORKING AT CONDENSOR WENT OUT. AND A FEW OTHER THINGS. SUV IS A 2017 WE HAVE ALREADY SPENT OVER 11,000 IN 2 YEARS FIXING IT NOW THE AC IS 2400 TO GET FIXED.",
        "vin": "1GKS2GKC3HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/28/2020",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 YUKON IS EXHIBITING THE EXACT SAME BRAKE BEHAVIOR AS THE BELOW COMPLAINT, BUT MY VEHICLE IS NOT ELIGIBLE FOR THE RECALL FOR SOME REASON.     NHTSA CAMPAIGN NUMBER: 20V603. GM'S OWN NUMBER FOR THIS RECALL IS N202300860.",
        "vin": "1GKS2GKCXHR"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PROBLEMS WHEN STARTING BRAKES LOOSE VACUUM PRESSURE STILL NO FIX AFTER RECALL.  2ND CHECK ENGINE LIGHT CAME ON AT ABOUT 36,500 MILES FUEL INJECTORS DEFECTIVE  3RD TRANSMISSION PROBLEMS VALVE BODY DEFECTIVE PAID OVER 85,000 AND THIS SUV ITS NOT WORTH IT DEFECTIVE ALL DEFECTIVES UNDER 43,000 MILES",
        "vin": "1GKS2HKJ9HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "08/21/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC YUKON XL. THE CONTACT STATED THAT WHEN ATTEMPTING TO PARK, IN ORDER TO HAVE THE VEHICLE COME TO A COMPLETE STOP THE BRAKE PEDAL HAD TO BE DEPRESSED ALL THE WAY TO THE FLOORBOARD. THE CONTACT STATED THAT THE SAME FAILURE HAD OCCURRED TWICE AFTER THE ORIGINAL FAILURE. ON ONE OCCASION, THE SERVICE BRAKE ASSIST WARNING MESSAGE APPEARED ON HER INSTRUMENT PANEL. LAFONTAINE BUICK GMC OF ANN ARBOR (500 AUTO MALL DR, ANN ARBOR, MI 48103) WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS INFORMED THAT THERE WERE NO RECALLS. THE CONTACT THEN TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THE VEHICLE WITH A FAULTY BRAKE ASSIST THAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT WAS MADE AWARE OF NHTSA CAMPAIGN NUMBER: 19V645000 (SERVICE BRAKES, HYDRAULIC) WHICH HE LINKED TO THE FAILURE. THE MANUFACTURER HAD YET TO BE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 58,000.",
        "vin": "1GKS2HKJXHR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348612,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "8 SPEED TRANSMISSION BUFFETS AT LOW RPM'S BETWEEN THE SPEED OF 40 AND 80.  THE VEHICLE'S TRANSMISSION DOES NOT ENGAGE WHEN COLD.  THIS HAS BEEN AN ONGOING ISSUE SINCE THE VEHICLE HAD APPROXIMATELY 25,000 MILES ON IT.",
        "vin": "1GKS2HKJ5HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "06/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340728,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT READ TAIL LIGHT, BRAKE LIGHT AND REVERSE LIGHT STOPPED WORKING AT 61,135 MILES ON ODOMETER READING FOR NO APPARENT REASON.",
        "vin": "1GKS1GKC4HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT BRAKE LIGHT FAILURE. *TR",
        "vin": "1GKS2GKC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/27/2020",
        "dateOfIncident": "04/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322429,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR TO GMC BECAUSE I LIVE ON A HILL AND WHEN I PARK MY CAR THEN PUT IT INTO DRIVE OR REVERSE THE BRAKES DON'T FUNCTION PROPERLY. THE BRAKES SLIDE AND SKIP AND THE VEHICLE HAS A VERY HARD TIME STOPPING. IT HAPPENS WHILE PUTTING THE CAR INTO PARK ON ANY HILL, THEN PUTTING IT BACK INTO GEAR. IT ALSO HAPPEN WHEN DRIVING A SLOW SPEED ON FLAT GROUND. GMC FOUND THE PROBLEM AND STATED IT'S UNDER A SPECIAL COVERAGE WARRANTY #N182202780-01. I'VE ALMOST HAD IT TOWED MULTIPLE TIMES BECAUSE I WAS AFRAID TO CONTINUE DRIVING, I'D HAVE TO GO EXTREMELY SLOW DOWN HILLS IN FEAR THE BRAKES WOULDN'T BE ABLE TO HOLD ME BACK IF I GAINED SPEED. GMC DOESN'T KNOW WHEN THE PART WILL BE IN AND STATES THEY WON'T PROVIDE A RENTAL CAR. I AM PREGNANT, SO IF I GET IN A CRASH GOING 5MPH, IT DOESN'T MATTER, I'LL STILL HAVE TO GET CHECKED BY A DOCTOR. I'M AN ESSENTIAL WORKER AND STILL NEEDING TO HAVE A DAILY VEHICLE. I DON'T UNDERSTAND HOW THERE IS A FOUND/KNOWN BRAKE PROBLEM AND THEY ARE TELLING ME IT'S SAFE TO DRIVE WHEN THERE WAS BEEN OVER 100 ACCIDENTS. THEY NEED TO PROVIDE A RENTAL CAR AND FIX IT.",
        "vin": "1GKS2FKC1HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/03/2020",
        "dateOfIncident": "03/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320151,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS ACTING SPORADIC AND CAUSING DELAY IN RESPONSE TO ACCELERATION. CAN BE VERY DANGEROUS WHEN ENTERING CROWDED INTERSECTIONS/ ROADWAYS.",
        "vin": "1GKS1GKC2HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317025,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION ISSUE THAT MAKES THE VEHICLE TO NOT ACCELERATE AND THEN SURGE WHEN YOU PULL UP TO AT A STOP LIGHT, STOP SIGN, ON HIGHWAY, OR IN TRAFFIC. NOT SAFE  GOING TO END UP HITTING SOMEBODY OR SOMETHING.  GMC DEALERSHIPS SAY 'IT IS A KNOWN ISSUE' WITH NO REPAIR.",
        "vin": "1GKS2HKJ5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATEST ISSUE BEGAN WHEN DRIVING ON THE HIGHWAY, I NOTICED THAT THE BRAKE PEDAL WOULD BOUNCE WHEN TRYING TO SLOW DOWN AT HIGHWAY SPEEDS. I DIDN'T THINK MUCH OF IT. EXACTLY 2 DAYS LATER, WHILE APPROACHING TRAFFIC AT A RED LIGHT AT RELATIVELY LOW SPEEDS, THE VEHICLE WOULD NOT STOP. I TRIED TO PUSH THE PEDAL, THE PEDAL WOULD GO ALL THE WAY DOWN LIKE IT HAD NO PRESSURE. LUCKILY THERE WAS NOT ONCOMING TRAFFIC AND I WAS ABLE TO SWERVE ONTO THE LEFT LANE AND FINALLY INTO A PARKING LOT WHERE I WAS ABLE TO PARK USING THE EMERGENCY BRAKE. MY VEHICLE HAD RECENTLY BEEN SERVICED FOR THE VACUUM PUMP RECALL SINCE MY BRAKES WOULD BECOME HARD TO PUSH BUT ONLY WHEN MOVING AT VERY LOW SPEEDS LIKE IN HEAVY TRAFFIC OR IN A DRIVE THROUGH SERVICE. I AM CONCERNED ABOUT THE ISSUE SURFACING FOR A THIRD TIME WHEN I HAVE MY FAMILY IN THE VEHICLE.",
        "vin": "1GKS1GKC6HR"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "11/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 91K MILES MY TRANSMISSION WENT OUT COMPLETELY. THE VEHICLE WAS LESS THAN 3 YEARS OLD AT TIME OF INCIDENT",
        "vin": "1GKS1GKC6HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/31/2020",
        "dateOfIncident": "01/29/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306231,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAILLIGHT FAILURE: THE FAILURE OF LED LIGHT IS A DIRECT RESULT OF THE ALLOY BASE CIRCUIT USED TO MAINTAIN CONTINUITY. THE ALLOY'S INABILITY TO EXPAND AND CONTRACT DUE TO THE CURRENT DESIGN, CAUSES FAILURE OF THE PRODUCT. EVIDENT BY THE VIDEOS OF REPAIRS ONLINE. THE ALLOY IS BREAKING, INTERRUPTING THE CURRENT FROM MAINTAINING CONTINUITY RESULTING IN FAILURE. THIS IS A MANUFACTURING DEFECT WHERE THE PRODUCT SHOULD HAVE HAD EXPANSION AND CONTRACTION POINTS ON SUCH A PART TO PREVENT PREMATURE FAILURE. THE LIGHT IS NONREPAIRABLE WITHOUT BREACHING THE PERMANENTLY SEALED SHELL.",
        "vin": "1GKS2GKCXHR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301811,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGERS BRAKE LIGHT FLICKERS OFF AND ON CAUSING A SAFETY RISK WHILE DRIVING. PREVIOUS YEARS OF SAME MAKE AND MODEL ARE HAVING SAME ISSUES CAUSING A SHORTAGE IN $400-800 REPLACEMENT OF TAIL LIGHT ASSEMBLY. RATHER, GMC SHOULD RECALL AND CORRECT THE ORIGINAL MANUFACTURING QUALITY TO BEGIN WITH.",
        "vin": "1GKS2GKC9HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "10/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299745,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK PASSENGER SIDE BRAKE LIGHTING WENT OUT.  ORIGINALLY IT WOULD WORK SOMETIMES AND NOT WORK OTHERS. NOT IT NEVER WORKS...  DEALER SAID EARLIER YEARS WERE COVERED BY RECALL BUT NOT 2017.  VERY EXPENSIVE TO REPLACE AND IVE HAD THE CAR 2 YEARS.  CRAZY.",
        "vin": "1GKS2HKJ1HR"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298421,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED TO PULL ALL THE WAY TO THE RIGHT SIDE WHILE DRIVING ON THE 710 FREEWAY IN LONG BEACH, A NOISE STARTED TO BE AUDIBLY HEARD WHILE I WAS DRIVING. I I CONTACTED THE EXECUTIVE OFFICES OF GENERAL MOTORS AND NOBODY COULD ASSIST ME WITH THE REPAIRING THIS VEHICLE. I WAS TOLD THERE IS NO REMEDY FOR THIS ISSUE.",
        "vin": "1GKS2GKC5HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER LED BRAKE LIGHT FAILURE. DEALER SAID THIS IS A KNOWN FAILURE ITEM SO MUCH SO THAT PARTS ARE ON BACKORDER NATION WIDE.",
        "vin": "1GKS2HKJ1HR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "12/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONING IN MY 2017 YUKON XL STOPPED BLOWING COLD AIR. THERE IS A KNOWN ISSUE WITH GMC CONDENSERS.  I BROUGHT MY YUKON TO THE DEALERSHIP AND WAS TOLD THAT INDEED IT WAS THE CONDENSER WHICH CAUSED REFRIGERANT TO LEAK.  HOWEVER, IT WAS NOT COVERED UNDER THE SPECIAL COVERAGE ADJUSTMENT 17336 AS MY VIN # WAS NOT INCLUDED FOR SOME REASON.  SAME PROBLEM, BUT I HAVE TO PAY FOR THIS OUT OF MY POCKET - $1200.  I LIVE IN THE DEEP SOUTH, HAVE SMALL CHILDREN, AND CANNOT GO WITHOUT AC.",
        "vin": "1GK51GKC5HR"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "11/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE AFTER RECALL WAS DONE BRAKES STILL FAIL WAS DRIVING AND WAS BRAKING THE PEDAL WENT IN ALL THE WAY AND THE YUKON XL DENALI DID NOT STOP ALSO HAVE BAD FUEL INJECTORS TOOK IT TO THE DEALERSHIP AND THEY DONT KNOW WHAT FUEL INJECTORS GO ON THE SUV ALSO GM DOESNT KNOW THEY HAVE TO TAKE APART THE ENGINE TO FIND OUT WHAT FUEL INJECTORS THEY PUT ON THE ENGINE THEY WONT GIVE ME A CAR RENTAL AND DOES NOT ALL THE FUEL INJECTORS ARE ON BACK ORDER THERE IS 3. TYPES HIGH PRESSURE LOW PRESSURE AND THEY DONT KNOW THE FUEL INJECTOR THAT WAS USED I PAID OVER 90,000 WITH TAXES AND INTEREST ON THIS 2017 YUKON XL DENALI AND THEY HAVE REPLACED 3 SHOCKS, BRAKE VACUUM PUMP, BRAKE AND ROTORS THEY HAD TO REPAINT THE FEONT BUMPER REAR BUMPER HOOD AND BACK DOOR AND NOW THE FUEL INJECTORS WITH ONLY 37,500 MILES THIS SUV IS A JUNK AND NOW I BELIEVE ALL GM CARS ARE NOW JUNK",
        "vin": "1GKS2HKJ9HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/30/2019",
        "dateOfIncident": "11/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY VEHICLE IN WINTER WEATHER CONDITIONS, IN AUTOMATIC 4 WHEEL DRIVE OPTION. I TURNED THE CORNER BY MY HOUSE ON A CITY STREET GOING NO MORE THAN 7 MPH. I WAS TAPPING THE BRAKE AS I TURNED. I'M NOT SURE WHAT REALLY HAPPENED AS I WAS BRAKING (THE BRAKES SEEMED WEIRD; KIND OF LIKE ABS), BUT MY VEHICLE SLID AND HIT THE CURB ON THE STREET I WAS TURNING IN. THIS IS KITTY CORNER FROM MY HOUSE. MY RIGHT REAR TIRE DROVE UP ONTO THE CURB AND HALF WAY ONTO THE SIDEWALK, BEFORE GOING BACK OFF. I DROVE RIGHT INTO MY GARAGE FROM THERE AND THE VEHICLE WAS MAKING A WEIRD NOISE. MY WHOLE TIRE/WHEEL WAS BENT AT AN ANGLE WITH THE BOTTOM GOING INWARD. THE TIRE AND WHEEL DID NOT HAVE ANY DAMAGE. THERE WERE SCRAPES ON THE HUB CAP. WE TOOK THE TIRE OFF AND SAW THAT THE HALF SHAFT HAD SNAPPED RIGHT IN HALF. AFTER LOOKING AT THIS, THERE WAS BUBBLING AROUND IT. IT SEEMS THAT THE WAY THIS WAS MANUFACTURED IS NOT IN ANYWAY SAFE. THANKFULLY, I WAS RIGHT BY MY HOUSE. IF I HAD BEEN GOING ANY FASTER IN WINTER WEATHER CONDITIONS, WHO KNOWS WHAT COULD HAVE HAPPENED IF I SLID INTO SOMETHING ELSE GOING FASTER. I AM GLAD MY WIFE AND KIDS WERE NOT IN THE VEHICLE. I WOULD THINK THIS WOULD BE COVERED IN THE POWERTRAIN WARRANTY; 5-YEAR/60,000. ONE PERSON WITH GM STATED IT WAS INCLUDED WITH THE 3-YEAR/36,000 OPTION. OUR MILEAGE IS BARELY OVER AT 36,352. THE DEALERSHIP I TOOK IT TO, STATED THEY WILL NOT BUDGE OVER 36,000 MILES. I BELIEVE THIS IS A HUGE SAFETY ISSUE AND THAT IT SHOULD BE COVERED NO MATTER WHAT! THIS SHOULDN'T HAVE HAPPENED WHEN THERE WAS NO DAMAGE AT ALL TO THE TIRE. HOW COULD SOMETHING LIKE THIS JUST SNAP IN HALF? IT JUST DOESN'T SEEM RIGHT! THIS VEHICLE WAS EXPENSIVE AND APPARENTLY BUILT VERY CHEAP!!! WE JUST HAD A RECALL FIXED TOO! WE HAVE ONLY PAID TO GET IT TOWED TO THE NEAREST DEALERSHIP, WHICH IS IN THE NEXT TOWN OVER ABOUT 15 MILES AWAY. MY PICS ARE MORE THAN 5MB. THEY ARE 7+MB.",
        "vin": "1GKS2HKJXHR"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/17/2019",
        "dateOfIncident": "11/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WENT OUT AT 88K MILES. MY SISTER IN LAW ALSO HAS A 2017 BOUGHT FROM ANOTHER STATE AND IT WENT OUT AT 79K MILES A WEEK AFTER MINE. PASSENGER SIDE TAIL LIGHT WORKS IF YOU PUSH ON IT THEN RANDOMLY GOES OUT (WIRING/ELECTRICAL ISSUE). OF COURSE THE DRIVERS SIDE TAIL LIGHT IS THE ONLY ONE ON RECALL. CRUISE CONTROL SET ITSELF AT OVER 100MPH AND RAPIDLY ACCELERATED UNTIL I HIT THE BRAKES. I RECEIVED A RECALL FOR THE BREAKING SYSTEM SPECIFICALLY FOR MY VIN NUMBER THAT NEEDS TO BE FIXED NOW THAT MY TRANSMISSION IS COMPLETE.",
        "vin": "1GKS2GKCXHR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278102,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC YUKON XL. WHEN ATTEMPTING TO  ENGAGE IN REVERSE OR DRIVE, THE VEHICLE HESITATED. THERE WAS ALSO A VIBRATION UNDERNEATH THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DETERMINED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BY THE INDEPENDENT MECHANIC. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 121,000.  *BF*JB",
        "vin": "1GKS2FKC2HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC YUKON XL. THE CONTACT STATED THAT THE BRAKE LIGHTS FAILED TO ILLUMINATE INTERMITTENTLY. THE CONTACT TOOK THE VEHICLE TO MARVIN K BROWN AUTO CENTER (LOCATED AT 1441 CAMINO DEL RIO S, SAN DIEGO, CA, 619-272-6867) WHERE IT WAS DIAGNOSED THAT THE BRAKE LIGHTS NEEDED TO BE REPLACED. HOWEVER, DUE TO THE COMMONALITY OF THE FAILURE, THE PARTS WERE ON BACKORDER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 64,000.",
        "vin": "1GKS2GKC9HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/22/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270105,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR TAILLIGHTS STOPPED WORKING. UNIT IS SEALED AND WHOLE ASSEMBLY MUST BE REPLACED, AT GREAT EXPENSE. THIS APPEARS TO BE A COMMON PROBLEM BUT GM WILL NOT FIX.",
        "vin": "1GKS2GKC2HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268758,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GMC YUKON XL. WHILE DRIVING VARIOUS SPEEDS, THE CONTACT NOTICED THAT THE REAR BRAKE LIGHTS STOPPED WORKING WITHOUT WARNING. THE VEHICLE WAS TAKEN TO MIDLAND BUICK GMC (3205 W WALL ST, MIDLAND, TX 79701, (432) 897-0665) WHERE IT WAS DIAGNOSED THAT THE LED BRAKE SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED MULTIPLE TIMES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE CONTACT WAS ADVISED TO CALL NHTSA TO FILE A COMPLAINT. THE FAILURE MILEAGE WAS APPROXIMATELY 49,000.",
        "vin": "1GKS2HKJ3HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT TAIL/BRAKE LIGHT HAS INTERMEDIATE PROBLEM.  ADVISED DEALERSHIP, THEY HIT THE LIGHT WITH HAND AND IT FLASHED.  GMC IS AWARE THAT THIS IS A PROBLEM.  NO DETECTION FROM ANY OF THE SENSORS  ADVISING THERE IS A PROBLEM WITH THE TAIL/BRAKE LIGHT.  THIS IS OBVIOUSLY AN ISSUE WITH GMC YUKONS WHEREIN THERE IS A BROKEN WIRE IN THE LIGHT ITSELF AND IT IS A FULL UNIT THAT COST APPROXIMATELY $650.00.    PRINCE DEALERSHIP DID NOT EVEN ADVISE THAT THERE IS A RECALL ON MY VEHICLE AT THE TIME OF CHECKING THE TAIL/BRAKE LIGHT WAS WARRANTED.",
        "vin": "1GKS1GKC1HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254518,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SYMPTOMS - VEHICLE SHUDDERS DURING GEAR CHANGE.                        -BETWEEN 20 TO 75 MPH                        -HAS BEEN HAPPENING RANDOMLY",
        "vin": "1GKS1HKJ4HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "09/06/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254198,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERYBODY WAS TELLING ME NOT TO BUY A 15 OR 16 GMC DENALI SO I  BECAUSE THEY KNOWN TO HAVE TRANSMISSION PROBLEMS SO FOR MY THANKSGIVING GIFT I BROUGHT A BRANDO   2017 YUKON 8 PASSENGER LESS IN 2 YEARS  NOW THE TRANSMISSION HAS GONE BADD TOOK A TO THE SHOP I NEED A BRAND NEW TRANSMISSION I DO NOT HAVE $3800 TO REPLACE THE TRANSMISSION I FEEL IT SHOULD BE A RECALL ON THIS VEHICLE YOU CAN FEEL FREE TO REACH ME [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "1GKS2FKC2HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONER HAS A LEAK, AND WILL NOT BLOW COLD AIR. THIS WAS IDENTIFIED AFTER A TECHNICIAN DID NOT WANT TO RECHARGE THE AC SYSTEM ON A VEHICLE THAT IS ONLY 2 YEARS OLD.",
        "vin": "1GKS2GKC6HR"
    },
    {
        "components": "STEERING,SEATS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/25/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246264,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES GET HARD WHEN DRIVING IN SLOW TRAFFIC. AND STERRING WHEEL GETS STIFF WHEN PRESSED DURING TURNING CORNERS OR TURNS",
        "vin": "1GKS2GKC4HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243807,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS ARE GOING OUT WITHOUT NOTICE",
        "vin": "1GKS2GKC0HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233427,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING QUIT WORKING - CLEARLY AN ISSUE AS DESCRIBED IN LAWSUITS AND ON-LINE SEARCH REPORTS, NOT COVERED BY MANUFACTURER",
        "vin": "1GKS1GKC5HR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233243,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS A 101 DEGREE OUT HERE IN DENVER, COLORADO. WHILE DRIVING ON A TOLL WAY AT 75 MILES PER HOUR AN \"ABS\" LIGHT WITH A \"SERVICE  STABILITRAK\"  MESSAGE POPPED OUT. THE VEHICLE WAS DRIVING OK WITH LIGHTS ON UNTIL I FINISH THE TOLL WAY (30 MILES) AND THEN FOR THE NEXT  50 MILES ON A HIGHWAY. I NOTICED THE FIRST PROBLEM WHEN I EXITED THE HIGHWAY AND DRIVING AT A LOWER RPM. AT 30-45 MILES PER HOUR THE VEHICLE STARTED SETTING THE BREAK ON BY ITSELF AND DRAFTED TO THE LEFT LANE. THEN I HAD TO STEER QUICKLY TO THE RIGHTSCOUPLE TIMES UNTIL I REACH TO MY DESTINATION. I ALSO NOTICED THAT WHEN I STEER HARDER EITHER TO THE LEFT OR RIGHT AT A LOW RPM, THE VEHICLE STOPES ROLLING BY ITSELF BEFORE I PUSH ON THE BREAK.",
        "vin": "1GKS2GKC6HR"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LED REAR BRAKE LIGHTS ARE CONSISTENTLY FAILING ON THOUSANDS OF THESE VEHICLES. DEALER TOLD ME THEY ARE ON BACK ORDER AND ARE UNAVAILABLE AS THEY CAN'T KEEP UP WITH DEMAND. WITHOUT A FIX, HOW CAN I SAFELY DRIVE THE CAR? I HAVE ONE OUT, IF THE OTHER GOES OUT, WHAT IS THE SOLUTION?",
        "vin": "1GKS2GKC3HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194996,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHOLE BACK TAIL LIGHT HAD TO BE REPLACED AFTER FAILING. POOR DESIGN AND A COMMON PROBLEM ON THE 2015-2017 GMC YUKONS. THERE IS A COMMON AREA THAT BREAKS.    NOT ONLY A BIG EXPENSE BUT ALSO A LARGE WASTE OF MATERIAL CONSIDERING THE WHOLE UNIT HAS TO BE REPLACED. COST IS OVER $800.00 AND THE DEALER BUYS BACK THE OLD LIGHT FOR $50 SEEMS A BIT SUSPICIOUS BY GMC.    THESE LAMPS ARE A SEALED UNIT AND WERE NEVER DESIGNED TO BE REPAIRED. AS DESIGNED, IF THERE IS A PROBLEM, THE LAMP IS REPLACED AS A COMPLETE AND VERY EXPENSIVE UNIT.     MORE CAN BE FOUND HERE:  HTTPS://WWW.CARCOMPLAINTS.COM/GMC/YUKON/2015/LIGHTS/TAILLIGHT_NOT_WORKING_PROPERLY.SHTML",
        "vin": "1GKS2GKC0HR"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/20/2018",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE BREAKS FAILED ON ME WHILE DRIVING   A VERY KNOWN ISSUE ON PREVIOUS YEAR",
        "vin": "1GKS2GKC0HR"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS ABOUT A 2017 YUKON XL   BREAK FAILING TO OPERATE   THE PREVIOUS 2016 YUKON MODELS HAVE THE SAME ISSUE AND HAVE A RECALL  BULLETIN NO: PIT5361B  AND THE DEALER DOES NOT WANT TO ADDRESS OR  ACKNOWLEDGE THE PROBLEM",
        "vin": "1GKS2GKCOHR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2018",
        "dateOfIncident": "11/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE LIGHT IS OUT AND THE VEHICLE ISN'T EVEN 3 YEARS OLD BUT OVER 36,000 MILES. DEALERSHIP STATED LIGHT IS OUT SO WHOLE HOUSING HAS TO BE REPLACED AT $900/EACH.",
        "vin": "1GKS2GKC6FR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2018",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STANDING BEHIND THE VEHICLE AND ATTEMPTING TO REMOVE ITEMS FROM THE REAR CARGO AREA, THE LIFT GATE RANDOMLY SLAMS SHUT WITHOUT NOTICE OR WARNING. THIS OCCURRED SEVERAL TIMES WHILE I WAS BEHIND THE VEHICLE. ON SOME OCCASIONS MY CHILD(REN) WAS WITH ME ANDWAS ALMOST HIT AS WELL. SINCE I AM TALLER I WAS HIT AND WAS ABLE TO SAVE MY CHILD FROM INJURY. I WAS HIT SEVERAL TIMES ON DIFFERENT OCCASIONS EITHER I THE HEAD OR IN THE BACK, DEPENDING ON MY POSITION AT THE TIME. I ENSURED THAT I DID NOT HAVE THE KEY FOBIN MY POCKET TO ACCIDENTLY ACTIVATE THE CLOSURE, AND I ENSURE THAT I DID NOT ACCIDENTLY ACTIVATE THE CLOSURE SENSOR UNDERNEATH THE REAR BUMPER AREA. UPON INVESTIGATION THE DEALER DETERMINE THE CAUSE TO BE A LIFT GATE MODULE DEFECT, AS WELL AS SENSOR AND LIFTGATE CALIBRATION.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STANDING BEHIND THE VEHICLE WITH THE LIFT GATE OPEN, AND ATTEMPTING TO REMOVE ITEMS FROM THE REAR AREA THE LIFT GATE RANDOMLY SLAMS SHUT WITHOUT NOTICE OR WARNING.  ON SEVERAL OCCASIONS MY CHILDREN WERE IN THE WAY OF THE LIFT GATE CLOSING AS WELL, HOWEVER, SINCE I AM TALLER I WAS HIT FIRST SAVING MY CHILDREN. ON SEVERAL OCCASIONS I WAS HIT IN THE HEAD AND IT THE BACK BY THE SLAMMING REAR LIFT GATE.  I ENSURED THAT I DID NOT HAVE THE KEY FOB ACCIDENTLY ACTIVATED IN MY POCKET AND THAT I DID NOT ACTIVATE THE CLOSURE SENSOR UNDERNEATH THE REAR OF THE VEHICLE. UPON INVESTIGATION BY THE DEALER THE CAUSE WAS IDENTIFIED TO BE THE LIFT GATE MODULE.  THE LIFT GATE ALSO REQUIRED RECALIBRATION AND SENSOR ALIGNMENT.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STANDING BEHIND THE VEHICLE AND ATTEMPTING TO REMOVE ITEMS FROM THE REAR CARGO AREA, THE LIFT GATE RANDOMLY SLAMS SHUT WITHOUT NOTICE OR WARNING.  THIS OCCURRED SEVERAL TIMES WHILE I WAS BEHIND THE VEHICLE.  ON SOME OCCASIONS MY CHILD(REN) WAS WITH ME AND WAS ALMOST HIT AS WELL.  SINCE I AM TALLER I WAS HIT AND WAS ABLE TO SAVE MY CHILD FROM INJURY.  I WAS HIT SEVERAL TIMES ON DIFFERENT OCCASIONS EITHER I THE HEAD OR IN THE BACK, DEPENDING ON MY POSITION AT THE TIME.  I ENSURED THAT I DID NOT HAVE THE KEY FOB IN MY POCKET TO ACCIDENTLY ACTIVATE THE CLOSURE, AND I ENSURE THAT I DID NOT ACCIDENTLY ACTIVATE THE CLOSURE SENSOR UNDERNEATH THE REAR BUMPER AREA.  UPON INVESTIGATION THE DEALER DETERMINE THE CAUSE TO BE A LIFT GATE MODULE DEFECT, AS WELL AS SENSOR AND LIFT GATE CALIBRATION.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "09/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132450,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED AND RUNNING WITH NO DRIVER IN THE VEHICLE, THE VEHICLES KEY FOB WAS LOCKED IN THE CAR BY A PASSENGER EXITING THE VEHICLE.  THE PASSENGER, A CHILD, EXITED THE VEHICLE AND PUSHED THE \"DOOR LOCK\" BUTTON AND THEN CLOSED THE DOOR, LOCKING IT WHILE RUNNING WITH THE KEY FOB IN THE VEHICLE.  NO WARNING ALERT NOISE WAS EMITTED AND THE VEHICLE DID NOT AUTOMATICALLY UNLOCK THE DOORS AS DESIGNED. THE WEATHER WAS APPROX. 80 DEGREES.  THIS HAZARD IS NOT SUPPOSE TO OCCUR AND POSES A HIGH RISK OF CAUSING HARM OR DEATH TO AN UNSUSPECTING PASSENGER.  THE HAZARD MITIGATION FOR THIS EVENT FAILED.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "01/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132460,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE DASH DISPLAYED NUMEROUS AND RANDOM ERROR MESSAGES: (WORDING MAY NOT BE EXACT) SERVICE FRONT COLLISION SYSTEM. FRONT RADAR BLOCKED. FRONT COLLISION SYSTEM UNAVAILABLE. THESE MESSAGES INDICATED A PROBLEM WITH THE FORWARD COLLISION AVOIDANCE SYSTEM.  THE WEATHER ON THE PARTICULAR DAY VARIED.  ERRORS OCCURRED AT VARIOUS SPEEDS. THIS HAZARD CAN CAUSE SERIOUS HARM IF THE SENSORS DETECT AN IMMINENT FORWARD CRASH IN ERROR AND APPLY THE BRAKES IN TRAFFIC.  THIS DANGEROUS SITUATION IS LIKELY TO RESULT IN SERIOUS PERSONAL INJURY OR DEATH.  THE ROOT CAUSE WAS DETERMINED TO BE RELATED TO AN ADDITIONAL FAILURE MODE IDENTIFIED IN THE OILY SUBSTANCE LEAKING FROM THE CONTROL BOX MOUNTED ON THE FRONT WINDSHIELD.  THIS OILY SUBSTANCE WAS IDENTIFIED BY THE VEHICLE OWNER AND REPORTED TO THE DEALER.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "03/27/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STOPPED, PLACED IN PARK ON A HILL, CHILD IN THE CAR, VEHICLE ENGINE RUNNING AND EMERGENCY BRAKE APPLIED.  THE VEHICLE BECAME UNRESPONSIVE. UNABLE TO TURN VEHICLE OFF, UNABLE TO SHIFT INTO ANY GEAR, UNABLE TO DRIVE, UNABLE TO OPEN WINDOWS, UNABLE TO OPEN REAR HATCH. ONSTAR WAS CONTACTED AND ADVISED THE VEHICLE HAD A COMPLETE ONBOARD SYSTEM FAILURE.  ONSTAR WAS UNABLE TO OFFER ANY ASSISTANCE.  ADVISED DRIVER TO CALL A TOW TRUCK.  TOW DRIVER ADVISED TO ALLOW VEHICLE TO BE TOWED RUNNING AND IT WOULD RUN OUT OF GAS. DEALER CONFIRMED A MANUFACTURING DEFECT CAUSED THE COMPLETE ONBOARD SYSTEM FAILURE.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132337,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON DRIVING VEHICLE WATER WAS OBSERVED TO DRIP FROM UPPER LEFT HAND DRIVERS COMPARTMENT ONTO DRIVER.  THE WEATHER HAD PREVIOUSLY BEEN RAINING.  ROOF FABRIC WAS SATURATED AND WATER WAS ACTIVELY FALLING.  THE DEALER CONFIRMED THE ANTENNA ASSEMBLY ON THE ROOF WAS A KNOWN FAILURE MODE FOR THIS HAZARD.  WATER CAN PASSIVELY MIGRATE THROUGH INTERIOR COLUMN.  VEHICLE HAD NOT BEEN THROUGH ANY MECHANICAL OR AUTOMATED WASHING SYSTEM. VEHICLE HAD NOT BEEN SUBJECT TO ANY EXTERNAL CAUSE.  FAILURE WAS CAUSED BY FAULTY MANUFACTURING ASSEMBLY PROCESS.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH THE NAVIGATION SYSTEM ACTIVELY NAVIGATING THE DESTINATION PATH, THE CENTER CONSOLE DISPLAY SCREEN TURNS TO A BLACK SCREEN WITH NO NAVIGATION FEATURES.  THE CONSOLE RANDOMLY REBOOTS AND MUST RESTART. THIS FAILURE MODE CAN CAUSE EXTREMELY HAZARDOUS DRIVING CONDITIONS BY DELAYING THE DRIVERS ABILITY TO FOLLOW THE CORRECT ROUTE. THE DEALER IDENTIFIED THE CAUSE TO BE THE RADIO ASSEMBLY. RADIO REPLACED.  SIMILAR SITUATION CONTINUE TO OCCUR WITH THE REPLACEMENT RADIO.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "09/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CHECK ENGINE LIGHT INTERMITTENTLY FLASHES. VEHICLE RUNS EXTREMELY ROUGH, SLUGGISH AT TIMES. DEALER CHECKED VEHICLE OVER A PERIOD OF TIME AND EVENTUALLY CONFIRMED RANDOM MISFIRES. UNABLE TO FIX ISSUE.  UNABLE TO DETERMINE CAUSE.  VEHICLE WAS LATER CONFIRMED TO HAVE A FAULTY TRANSMISSION TRANSMISSION REPLACED BY DEALER.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY THE VEHICLE WOULD NOT SHIFT GEARS CAUSING THE DRIVER TO PROCEED WELL UNDER THE POSTED SPEED LIMIT. THE DRIVER ATTEMPTED TO INCREASE SPEED SLOWLY AND THE VEHICLE HESITATED, THE ENGINE REVER BUT THE SPEED WOULD NOT INCREASE. THIS CAUSED CARS AT THE CORRECT SPEED TO VEER OUT OF THE LANE TO AVOID A CRASH. ONCE OFF THE HIGHWAY THE VEHICLE WAS HESITANT TO SHIFT GEARS AND EMITTED LOUD REVVING SOUNDS FROM THE ENGINE. PROCEEDING FROM A STOP AT A RED LIGHT THE VEHICLE HESITATED MOVEMENT CAUSING THE WHEELS TO SPIN ON THE PAVEMENT AND AGAIN CARS TO VEER QUICKLY OUT OF THE PATH.",
        "vin": "1GKS2GKC8HR"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118196,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ANY VIBRATIONS OR CHANGES IN ROAD SURFACE AT SLOW SPEED OR AT HIGHWAY SPEEDS CAUSES A CHANGE IN CABIN PRESSURE, WHICH CAUSES DISCOMFORT IN EARS AS WELL AS EARS POPPING.  THIS \"BUFFETING ISSUE\"  HAS BEEN BROUGHT TO A DEALERS ATTENTION, BUT THEY SAY THAT ITS NORMAL WITH GM'S LARGER SUV'S.  IT'S A DESIGN FLAW AND OR MANUFACTURING FLAW THAT GM SHOULD STEP UP AND TAKE CARE OF.",
        "vin": "1GKS2GKC4HR"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "05/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  WE RECEIVED A RECALL NOTICE FOR THE AIRBAG APPROXIMATELY 1-2 YEARS AGO. WHEN I CALLED SILVEIRA, THEY HADN'T RECEIVED THE PART FROM TAKATA YET.  I'VE CHECKED WITH SILVEIRA A COUPLE OF TIMES SINCE AND STILL NO REPLACEMENT PART!",
        "vin": "1GKFK16307J"
    }
]