[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "08/09/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428412,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Noticed the left side of the 5th wheel seemed lower, the smell of burning rubber was highly present. Upon further investigation noticed the front axle leaf spring had broken.  Noticed the new tire was hot and rubbed up on and caused damage to the metal of the chassis and ruined the new tire.",
        "vin": "573FR3326H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/19/2021",
        "dateOfIncident": "02/07/2021",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396988,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT BRAKES (LOST BRAKES) ON FIFTH WHEEL DUE TO THE USE OF UNDERSIZE WIRE AND OVERUSE OF SCOTCHLOK GUILLOTINE CONNECTORS.  EACH BRAKE HAS A MAXIMUM CURRENT DRAW OF 4AMPS.  4X4 = 16 AMP POSSIBLE DRAW ON 14 AWG WIRE AT APPROXIMATELY 60+ FOOT LOOP ROUND TRIP FROM PIN BOX TO BRAKES BACK TO PIN BOX.  THIS IS AN EXTREMELY DANGEROUS SITUATION.  THE BRAKE WIRING IS SUBSTANDARD IN EVERY CONCEIVABLE WAY.  SHOULD BE AT LEAST CONNECTED 10AWG USING CRIMPED BUTT SPLICES AND CIRCLE CONNECTORS.  IT WOULD ALSO HELP TO HAVE A GROUND BOND AT THE AXLE TO REDUCE THE LOOP BY 50%.  SOMEDAY SOMEONE WILL DIE (PROBABLY HAVE ALREADY) BECAUSE OF CHEAP UNDERSIZED WIRE WITH CHEAP GUILLOTINE CONNECTORS EVERYWHERE.   FOR LIGHTS OK FOR BRAKES?  NEVER!*DT*JB",
        "vin": "573FR3621H3"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365917,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Foreign Tire Sales, Inc.",
                "productMake": "FTS",
                "productModel": "WESTLAKE",
                "productYear": "9999",
                "size": "LT225/75R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GRAND DESIGN REFLECTION FIFTH WHEEL TRAILER EQUIPPED WITH WESTLAKE SUPER ST TIRES, SIZE: ST225/75/R15, DOT NUMBER: JULT1CM4016. THE CONTACT NOTICED A BULGE ON THE SIDEWALL OF THE FRONT PASSENGER TIRE UPON INSPECTION AT A REST STOP. THE CONTACT STATED THAT WHILE DRIVING UP A HILL AT 45 MPH, THE FRONT PASSENGER'S SIDE TIRE EXPERIENCED A BLOWOUT. THE CONTACT REPLACED THE WHEEL WITH THE SPARE TIRE ON THE TRAILER AND DROVE TO A TIRE SHOP. HE WAS INFORMED BY THE MECHANIC THAT THE BLOWOUT WAS CAUSED BY INTERNAL TREAD SEPARATION. THE TIRE WAS REPLACED AND THE FAILURE RECURRED ON THE DRIVER'S SIDE FRONT TIRE WHILE DRIVING 60 MPH. THE CONTACT PLACED THE SPARE TIRE ON THE TRAILER AND PURCHASED NEW SET OF TIRES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT WAS INFORMED TO SUBMIT A CLAIM FOR REIMBURSEMENT. THE APPROXIMATE TIRE AND VEHICLE FAILURE MILEAGE WAS 5,000.*DT*JB",
        "vin": "573FR3226H3"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/01/2020",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362230,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN ARKANSAS IN OCTOBER 11TH 2019 WHEN I NOTICED THE RV DID NOT APPEAR TO BE TRACKING STRAIGHT BEHIND THE TRUCK.  I PACKED UP AND LEFT THE CAMPGROUND ABOUT 2 HOURS EARLIER.  THERE WERE NO ISSUES WITH THE AXLES AT THAT TIME.  THERE WERE NO UNUSUAL ROAD HAZARDS OR SHOCKS TO THE FRAME DURING THAT PERIOD PRIOR TO WHEN I NOTICED THE ISSUE.  I STOPPED AT A REST AREA IN HELENA ARKANSAS AND FOUND THE RIGHT REAR AXLE SPRING HANGER HAD BROKEN FROM THE FRAME.  THE SPRING AND REAR AXLE WAS SHIFTED TO THE LEFT AND LODGED PRECARIOUSLY UP INSIDE THE FRAME.      IT WAS LATE ON A FRIDAY EVENING.  I WAS ABLE TO FIND A TRUCK/TRAILER SHOP OPEN IN BATESVILLE, MISSISSIPPI.  I DROVE THERE FOR EMERGENCY REPAIRS.  THEY JUDGED THE FAILURE WAS DUE TO POOR WELDS.  I'VE DONE SOME WELDING AND IT WAS EASY TO RECOGNIZE POOR PENETRATION.      THE TRUCK SHOP WELDED THE HANGERS AND PULLED THE REAR AXLE AS CLOSE TO PROPER ALIGNMENT AS POSSIBLE.  HOWEVER THE AXLE HAD SHIFTED SLIGHTLY IN THE U-BOLTS.  THE U-BOLTS NEEDED TO BE CUT OFF, THE AXLE PROPERLY ALIGNED AND NEW U-BOLTS INSTALLED.  THEY DID NOT STOCK THE BOLTS BUT THE TRAILER WAS SAFE TO TOW HOME.     UPON RETURNING FROM THAT TRIP, I PUT THE TRAILER IN MY WAREHOUSE AND INSPECTED THE FRAME AND AXLES.  I NOTICED IMMEDIATELY THE FRAME AT THE RIGHT REAR CORNER DIRECTLY BEHIND THE FAILED REAR AXLE SPRING HANGER HAD SEPARATED.  THE EXTERIOR SHEET METAL IS WARPED AND THERE IS A VISIBLE GAP.      THE FACTORY HAS REFUSED TO COVER THE AXLE REALIGNMENT OR RIGHT REAR FRAME SEPARATION UNDER THEIR 3-YEAR STRUCTURAL WARRANTY. MY RV HAS BEEN AT THE DEALER JUNE 5, 2020 UNTIL TODAY OCT 1 REGARDING THESE ISSUES AND AN UPPER DECK FRAME ISSUE THAT THEY FAILED TO REPAIR CORRECTLY 2 YEARS AGO.",
        "vin": "573FR3129H3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/13/2020",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360350,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT REAR LEAF SPRING HANGER FOR THE REAR AXLE BROKE OFF FROM THE TRAILER FRAME,  THIS HAPPENED WHEN VEHICLE WAS IN MOTION ON THE HIGHWAY. NOTICED REAR AXLE OUT OF PLACE WHEN WE WERE PARKED IN OUR DRIVEWAY UPON FURTHER INSPECTION THAT IS WHEN WE NOTICED THE RIGHT REAR HANGER BROKEN COMPLETELY OUT OF FRAME AND THE LEFT REAR HANGER CRACKED.",
        "vin": "573FR3326H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/29/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228422,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO SEPARATE ISSUES:  1. LIPPERT WHEEL BEARINGS LEAKED GREASE ALL OVER THE DRUM BRAKES WITH LESS THAN 4000 MILES. LIPPERT REFUSED TO PAY FOR REPAIRS BECAUSE IT HAS BEEN MORE THAN ONE YEAR.  2. WITH BRAND NEW BRAKES PROPERLY ADJUSTED, BRAKES ARE STILL VERY WEAK. APPLYING 12 VOLTS FROM BRAKE CONTROLLER RESULTS IN MINIMAL BRAKING. SUSPECT UNDERSIZED FINAL WIRING TO BRAKES (20 GAUGE). BRAKES HAVE BEEN UNDERPERFORMING SINCE DAY 1. *DT*JB*DT*JB",
        "vin": "573FR3329H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2018",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118831,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING MOSTLY HIGHWAY TRAVEL WITH OUR CAMPER THE AXLE GREASE SEALS FAILED WHICH ALLOWED GREASE TO CONTAMINATE THE BRAKE SHOES AND BRAKE DRUMS AFFECTING BRAKING PERFORMANCE.  REVIEWING OTHER POSTS ON-LINE A LOT OF OTHER OWNERS OF THESE CAMPERS ARE EXPERIENCING THE SAME PROBLEM, WHICH IS A SIGNIFICANT SAFETY ISSUE.",
        "vin": "573TR382XH3"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/04/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115720,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS FOR WHEEL BEARINGS. I'VE CONTACTED BOTH SELLER BYOUNG RV IN PORTLAND OREGON (XXXX) AND MANUFACTURE GRAND DESIGN RV (XXXX). MY TRAILER HAS BEEN HAVING ISSUES WITH EXCESSIVE RESIDUE BUILD UP ON WHEELS. ANOTHER REFLECTION OWNER TOLD ME HIS TRAILER WAS DOING SAME THING. THE DEALER WHERE HE PURCHASED TRAILER (BLUE DOG RV IN REDMOND OREGON) TOLD HIM REFLECTIONS WITH THIS PROBLEM IS BECAUSE THE WRONG SIZE BEARINGS WERE USED. MY TRAILER NOW HAS 5800 MILES. I'VE SENT ON PICTURES TO BOTH DEALER AND MANUFACTURE. MARK ARPIN TOLD ME NO ISSUES OF IMPROPER BEARING EXISTS. IF SO WHY WOULD BLUE DOG SAY DIFFERENT? COULD THIS TURN INTO A HAZARD OR SAFETY CONCERN? THANK YOU FOR YOUR TIME.    (XXXXX)      PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "573FR3222H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "05/18/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016116,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES, SEALS AND BEARINGS ON MY 5TH WHEEL TRAVEL TRAILER WILL HAVE TO BE REPLACED FOR THE THIRD TIME DUE TO THE SEALS LEAKING GREASE ONTO THE BRAKES.    ALL FOUR BACKING PLATES, THE FRONT TWO HUBS AND ALL FOUR GREASE SEALS AND BEARINGS WERE REPLACED ON OUR FIRST TRIP AFTER TAKING POSSESSION OF THE FIFTH WHEEL IN MAY 2017. THIS WAS DONE AT A CAMPING WORLD DEALERSHIP IN NORTH CAROLINA AND RESULTED IN BEING WITHOUT THE USE OF OUR TRAILER FROM MAY 18 ' 23.    ON OUR SECOND TRIP, STARTING ON JULY 9, 2017, THE BRAKES AGAIN BEGAN PERFORMING POORLY. RAY DUFFY, OF GRAND DESIGN, ARRANGED TO HAVE THEM INSPECTED IN WEST YELLOWSTONE, MONTANA ON JULY 14, 2017 AT JAKE'S AUTOMOTIVE. HE PRE-SHIPPED REPLACEMENT PARTS IN ANTICIPATION OF BAD SEALS.      THE TECHNICIAN AT JAKE'S AUTOMOTIVE FOUND GREASE CONTAMINATION ON THE RIGHT FRONT, RIGHT REAR AND LEFT REAR BRAKES.  HE ALSO FOUND THAT THOSE SEALS AND BEARINGS HAD SEPARATED FROM THE HUBS AND REMAINED ON THE SPINDLE WHEN THE HUBS WERE REMOVED.  THE RECEIPT STATES, 'HAD TO REPLACE 3 OF FOUR BACKING PLATES AND HARDWARE DUE TO WHEEL SEALS BLOWING OUT.'  THE FOURTH WHEEL, THE LEFT FRONT, WAS NOT REMOVED OR INSPECTED BY THE REPAIR FACILITY SINCE THEY DID NOT HAVE REPLACEMENT PARTS AVAILABLE AND THEY WERE CONCERNED THAT REMOVAL OF THE WHEEL COULD DAMAGE THE GREASE SEAL.     I REMOVED ALL FOUR HUBS TODAY.    THE INTERIORS OF THE TWO LEFT HUBS WERE COMPLETELY COATED WITH GREASE.  THE LEFT FRONT WAS WORSE THAN THE LEFT REAR.  THE TWO RIGHT HUBS DID NOT HAVE AS MUCH GREASE ON THEM AND WERE EVIDENTLY DOING THE MAJORITY OF THE BRAKING.  THE INSIDE OF BOTH HUBS WERE PRETTY SEVERELY SCORED BY THE MAGNETS AND NEED TO BE REPLACED.  ALL FOUR GREASE SEALS AND THE INNER BEARINGS STAYED ON THE SPINDLES WHEN THE HUBS WERE REMOVED.  SINCE THE SEALS ARE SUPPOSED TO BE PRESSED IN, I FOUND THEIR REMAINING ON THE SPINDLES PROBLEMATIC.",
        "vin": "573FR3627H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015835,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES WERE NOT WORKING VERY WELL, WITH THE TRAILER BRAKE CONTROLLER GAIN IN MY TRUCK SET AT 10.0 (FULL ON).  PROBLEM WAS CAUSED BY LEAKING AXLE SEALS ON THE PASSENGER SIDE OF THE VEHICLE WHICH RESULTED IN THE BRAKE SHOES AND DRUMS BEING COATED WITH AXLE GREASE.  ALL FOUR BRAKE ASSEMBLIES AND AXLE SEALS WERE REPLACED BY THE DEALER UNDER WARRANTY.",
        "vin": "573FR3321H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/22/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010102,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "3 OF 4 WHEELS HAD GREASE LEAKING FROM THE INNER HUB SEAL ONTO THE BRAKE SHOES AND DRUMS, WITH LOSS OF BRAKING POWER.  ALL BRAKES HAD TO BE REPLACED.",
        "vin": "573FR332XH3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/01/2017",
        "dateOfIncident": "06/25/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002665,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AXLES/BRAKE ASSEMBLIES HAD DEFECTIVE INTERIOR SEALS.  THE SEALS FAILED AND CONTAMINATED THREE OUT OF FOUR BRAKES WITH GREASE.  THIS NEARLY CAUSED ME TO HAVE A SERIOUS ACCIDENT DUE TO UNABLE TO STOP THE TRAILER TO AVOID VEHICLE THAT PULLED OUT IN FRONT OF ME.  I HAD TO RUN OFF ROAD TO AVOID ACCIDENT.  THIS IS A KNOW ISSUE WITH LIPPERT COMPONENTS THAT THEY CONTINUE TO TRY TO DENY.  I ATTACHED TWO PHOTOS OF WHAT I FOUND IN THREE OUT OF FOUR BRAKE HUBS UPON INSPECTION.",
        "vin": "573FR3322H3"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994208,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL BEARING GREASE TOO THIN AND LEAKS PAST SEALS CONTAMINATING BRAKE MAGNETS AND BRAKES.   MANY CUSTOMERS IMPACTED BASED ON FACEBOOK GROUP POSTS.",
        "vin": "573FR3523H3"
    },
    {
        "components": "WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/27/2017",
        "dateOfIncident": "05/13/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991924,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAILER HAS LEAKING GREASE SEALS WHICH CONTAMINATED THE BRAKE SHOES. THIS IS A NEW TRAILER AND ARRIVED FROM DEALER IN THIS CONDITION. THIS IS A 2 AXLE TRAILER.",
        "vin": "573FR3323H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/27/2017",
        "dateOfIncident": "04/08/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991946,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AXLE SEAL LEAKED CAUSING GREASE TO LEAK ONTO BRAKE FRICTION SURFACE, GREATLY REDUCING BRAKING ABILITY. PROBLEM WAS FOUND DURING OWNERS SELF INSPECTION. THIS PROBLEM WAS BROUGHT TO MY ATTENTION FROM THE GRAND DESIGN OWNERS FORUM. \"HTTP://WWW.GRANDDESIGNOWNERS.COM/FORUM/SHOWTHREAD.PHP/8531-POLL-HOW-MANY-OF-YOU-HAVE-HAD-YOUR-GREASE-SEALS-FAIL \"",
        "vin": "573FR3622H3"
    },
    {
        "components": "WHEELS,EQUIPMENT,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2017",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958446,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH LESS THAN 3000 MILES, THE WHEEL GREASE SEALS HAVE LEAKED CONTAMINATING THE TRAILER BRAKES. RESULTED IN REDUCED BRAKING ABILITY. POTENTIAL SAFETY PROBLEM REDUCING TRAILER BRAKES EFFECTIVE STOPPING POWER.",
        "vin": "573FR3622H3"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957990,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE ON A TRIP FROM CALIFORNIA TO TEXAS AND THE GREASE SEALS ON ALL 4 WHEELS FAILED AND CONTAMINATED THE BRAKES.  I HAVE OWNED THE VEHICLE FOR 1 MONTH AND IT HAD LESS THAN 1,200 MILES ON IT.",
        "vin": "573FR3627H3"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/23/2017",
        "dateOfIncident": "02/23/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956632,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL GREASE SEALS ARE LEAKING ON THE NEW TRAILER (2 OF 4 SEALS).  THIS IS A NEW TRAILER AND I HAVE ONLY PUT ON ABOUT 50 MILES. THERE HAS BEEN NUMEROUS COMPLAINTS ON THIS ISSUE WITH GRAND DESIGN TRAILERS.",
        "vin": "573FR3629H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2017",
        "dateOfIncident": "02/09/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955430,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING GREASE SEALS ON BOTH PASSENGER SIDE AXLES CONTAMINATING BRAKE SHOES. I HAD DEALER PULL THE BRAKE DRUMS PRIOR TO DELIVERY OF OUR NEW TRAILER AND WE FOUND GREASE CONTAMINATION.  THE TRAILER ONLY HAD BEEN TRANSPORTED FROM INDIANA TO FLORIDA DEALER.",
        "vin": "573FR3626H3"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2017",
        "dateOfIncident": "01/01/2017",
        "fire": true,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947412,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 GRAND DESIGN REFLECTION RV. THE CONTACT STATED THAT THERE WAS AN ABNORMAL PROPANE FUEL ODOR EMITTING FROM THE RV. THE RV WAS INSPECTED BY A SERVICE TECHNICIAN WHO STATED THAT THE FUEL LINE SHOWED EVIDENCE THAT A RODENT CHEWED THROUGH THE PROPANE FUEL LINE, WHICH NEEDED TO BE REPLACED. THE RV WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60.",
        "vin": "573FR3828H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946574,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS NEW VEHICLE, A 9000 LB UVW, WAS DELIVERED WITH BRAKES CONTAMINATED WITH GREASE RENDERING THEM INEFFECTIVE AND CREATING AN UNSAFE CONDITION. NO ACCIDENT OCCURED. THE BRAKES ARE GOING TO BE REPLACED. WHEEL BEARING GREASE BREACHED THE HUB SEALS, CONTAMINATING THE BRAKE DRUMS AND BRAKE SHOES.",
        "vin": "573TR3829H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/03/2017",
        "dateOfIncident": "12/16/2016",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939516,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PURCHASED AN NEW TRAVEL TRAILER. MANY, MANY REPORTS OF LCI AXLE SEALS LEAKING AND DISPERSING GREASE ON BRAKE ASSEMBLIES. SURE ENOUGH, DEALER HAD TO REPLACE TWO OF FOUR BRAKE ASSEMBLIES, AS WELL AS ALL FOUR SEALS AS THEY ALL HAD LEAKED (TRAILER WAS NEW, JUST DROVE TO DEALER FROM FACTORY). THIS ISSUE NEEDS TO BE CORRECTED BEFORE SOMEONE IS HURT.",
        "vin": "573TR3426H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/17/2016",
        "dateOfIncident": "12/13/2016",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935970,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A JUST PURCHASED NEW REFLECTION 337RLS THAT HAS A 11/30/16 DATE IN THE VEHICLE INFORMATION SHEET AND 11/24/16 DATE ON THE SERIAL NUMBER DATA SHEET.  THE ONLY MILES ON THE UNIT WERE THE DELIVERY MILES FROM THE PLANT TO THE DEALER IN COLORADO AND THE ~400 MILES ADDED TO THOSE.    ON THE TRIP HOME (THE 400 MILES), THE ELECTRIC BREAKS BECAME SIGNIFICANTLY LESS EFFECTIVE TO THE POINT WHERE THE BRAKE CONTROLLER GAIN HAD TO BE SET TO ITS MAXIMUM LEVEL RESULTING IN LIMITED 5TH BREAKING.      THE DISCOVERY WAS SIGNIFICANTLY NERVE-RACKING AS DISCOVERY HAPPENED WHEN EXITING THE INTERSTATE AT 65MPH AND A DOWN HILL RAMP!  AT THAT TIME, THE GAIN ON THE BRAKE CONTROLLER WAS SET TO THE PREVIOUS SUFFICIENTLY WORKING LEVEL OF 5 (50% OF MAX).    AFTER FURTHER INVESTIGATION, THE GREASE SEALS WHERE DISCOVERED TO BE BAD ON BOTH AXELS.    THIS IS A VERY DANGEROUS ISSUE AS DISCOVERY OF A LACK OF BRAKES ON THE TOWED VEHICLE CAN OCCUR AT ANYTIME WITHOUT WARNING.",
        "vin": "573FR3626H3"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920407,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 1,850 MILES, THE BRAKES ON THIS UNIT WERE COMPLETELY SATURATED IN WHEEL BEARING GREASE CAUSING THEM TO BECOME INEFFECTIVE AT EVEN THE HIGHEST BRAKE CONTROLLER SETTING.  ALL FOUR BRAKES WERE AFFECTED.  A TRAILER OF THIS SIZE IS REQUIRED TO HAVE FUNCTIONING BRAKES.  THE BRAKES ARE DESIGNED THAT THEY WILL STOP THE VEHICLE IF THE TRAILER BREAKS AWAY FROM THE TOW VEHICLE BY ACTIVATING A BATTERY CONTROLLED BREAK AWAY SWITCH.  HOWEVER, SINCE THE BRAKES ARE CONTAMINATED WITH GREASE, THE VEHICLE WILL NOT BE ABLE TO STOP IN A SAFE DISTANCE.  THIS IS MY SECOND GRAND DESIGN VEHICLE EQUIPPED WITH LIPPERT MANUFACTURED BRAKES THAT ARE CONTAMINATED WITH GREASE.",
        "vin": "573TR3428H3"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/30/2016",
        "dateOfIncident": "10/30/2016",
        "fire": false,
        "manufacturer": "Grand Design RV, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920095,
        "products": [
            {
                "manufacturer": "Grand Design RV, LLC",
                "productMake": "GRAND DESIGN",
                "productModel": "REFLECTION",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GREASE LEAKING FROM AXLE SEALS WITH EXTENSIVE CONTAMINATION OF BRAKES ON 2 OUT OF 4 WHEELS.  A 3RD WHEEL IS JUST STARTING TO SHOW SIGNS OF GREASE LEAKING PAST SEAL WITH ONLY THE START OF CONTAMINATION OF BRAKE PAD.  LIPPERT AXLE AND BRAKE ASSEMBLIES.  APPROXIMATELY 3,420 MILES SINCE MANUFACTURE OF TRAILER IN JUNE 2016.  SAFETY CONCERN IS LOSS OF BRAKING ABILITY ON A TRAILER WITH A GVWR OF 11,995 LBS.  CONTAMINATION NOTED ON OCTOBER 30, 2016 WHEN OWNER PERFORMED INSPECTION OF AXLE AND BRAKE ASSEMBLIES AFTER LEARNING OF NUMEROUS OTHER OWNERS WITH SIMILAR ISSUES ON THE ONLINE GRAND DESIGN OWNERS FORUM.",
        "vin": "573FR3329H3"
    }
]