[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242859,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD GASKET LETS LOOSE AND OIL ALL OVER REAR TIRE! VEHICLE ON HIGHWAY IN MOTION, NOT GOOD.",
        "vin": "1HD1FCC11HB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/01/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992776,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"DAY MAKER HEADLIGHT \" FOUND ON THE HARLEY DAVIDSON ULTRA CLASSIC IS COMPLETELY UNUSABLE.IN USING THE LED BULBS ON THIS SYSTEM THE REFRACTORY NATURE OF THE LENS DICTATES THAT A HORIZONTAL LINE WITH LIGHT BELOW THE LINE AND DARKNESS ABOVE IT A DISTANCE KEEPS THE LIGHT FROM SHINING INTO THE ONCOMING DRIVERS.  THIS WORKS FINE IN AN AUTOMOBILE, BUT ON A MOTORCYCLE, IT BECOMES UNRIDEABLE .THE REASON BEING IS THAT WHEN YOU LEAN INTO A CORNER THE HORIZONTAL LINE DIPS TO THE SAME DEGREE AS THE MOTORCYCLE, AND THE DARKNESS ABOVE DIPS DOWN WITH THE BIKE SO THAT IT IS NOT POSSIBLE TO SEE INTO OR THRU THE CORNER (IF YOU DO NOT UNDERSTAND THIS SITUATION PLEASE PASS IT ON TO SOMEONE WHO DOES).   I AM NOT A NEWBIE TO RIDING AS I HAVE 30 YEARS AND ALMOST A QUARTER MILLION MILES UNDER MY BELT ALL ON HARLEYS I CAN ALMOST GUARANTEE THAT THIS HAS CAUSED NOT ONLY INJURIES BUT ALSO DEATHS.  THIS LIGHTING SYSTEM HAS BEEN CHECKED AND CHECKED AGAIN AND IS IN SPECS ACCORDING TO HARLEY DAVIDSON  I WOULD INVITE ANY SPECIALIST  OR OFFICIAL TO RIDE THE DARK COUNTRY ROADS THAT I RIDE AND TELL ME THIS LIGHTING SYSTEM IS SAFE PLEASE LOOK INTO THIS IT IS UNSAFE AND WILL INJURE OR KILL PEOPLE",
        "vin": "1HD1FCC17HB"
    }
]