[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2019",
        "dateOfIncident": "05/27/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218866,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "TRIKE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE ENGINE ON MY 2017 HARLEY DAVIDSON TRIGLIDE GETS HOT, IT WILL STALL WHEN I COME TO STOP.  THIS ISSUE BEGAN AFTER 5000 MILES, AND I'VE HAD IT IN THE SHOP 2 TIMES, BUT PROBLEM STILL EXISTS.  MY TRIKE STILL HAS ONLY HD STOCK PARTS.  IT ALSO WILL NOT START IN GEAR WITH THE CLUTCH ENGAGED, WHICH CAUSES A HUGE SAFETY ISSUE WHEN IT STALLS, AS I MUST TRY TO GET IT IN NEUTRAL BEFORE I CAN RESTART IT.  LAST YEAR, IT STALLED WITH THE CLUTCH ENGAGED, IN THE MIDDLE OF A VERY BUSY INTERSECTION, ON A HOLIDAY WEEKEND.  I HAD TO TRY TO GET IT IN NEUTRAL BEFORE I COULD RESTART IT.  FORTUNATELY, TRAFFIC WAITED FOR ME TO MOVE.  I UNDERSTAND HARLEY DAVIDSON IS AWARE OF THIS SAFETY ISSUE WITH THE 2017 TRIKE, BUT HAS NOT ISSUED A RECALL TO FIX IT YET.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/16/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189760,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "TRIKE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING THE TRIKE STALLS OUT WHILE STOPPED AT TRAFFIC LIGHTS, OR STOP SIGNS. TOOK IT TO HARLEY, THEY SAID NOTHING WAS WRONG WITH IT. AFTER RIDING FOR FOURTY YEARS, PRETTY SURE I KNOW IS SOMETHING IS WRONG, AND THERE IS! AFTER RESEARCHING ONLINE, I FIND THAT I AM NOT ALONE WITH THIS PROBLEM, AND THAT THE FIX IS A FAULTY SAFETY SWITCH ON THE CLUTCH. THE TRIKE WILL ONLY START IN NEUTRAL, WHICH IT SHOULD START IN GEAR WITH THE BRAKES APPLIED, THIS IS A SIGN THAT THE SWITCH IS BAD. AFTER SPENDING $150.00 FOR HARLEY TO TELL ME NOTHING WAS WRONG WITH IT, AND WASTING FIVE HOURS THERE, I AM NOT HAPPY. AS SOON AS I LEFT THERE, I PULL OUT INTO TRAFFIC, AND IT STALLS OUT ON ME RIGHT IN THE MIDDLE OF A INTERSECTION. I TRY TO START IT, AND AGAIN, IT WON'T START UNTIL IT IS BACK IN NEUTRAL, BY NOW, I AM ABOUT GETTING RUN OVER BY SERIOUSLY TICKED OFF PEOPLE IN CARS, BECAUSE I AM BLOCKING TRAFFIC. I REALLY THINK THAT THE FIRST TIME THAT SOMEONE GETS SERIOUSLY HURT, OR KILLED, SOMEONE WILL TAKE NOTICE TO THIS ISSUE, AND HOPEFULLY IT ISN'T ME, BECAUSE I WILL MAKE SURE THAT SOMEONE GETS SUED OVER THIS, ESPECIALLY AFTER I WAS TOLD THAT NOTHING WAS WRONG WITH ME TRIKE. YOU WOULD THINK AFTER SPENDING 35,000 I WOULD HAVE A DEPENDABLE TRIKE THAT I COULD RIDE SAFELY, AND ENJOY.",
        "vin": "1HD1MAD13HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185755,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "TRIKE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HARLEY-DAVIDSON TRIKE FREE WHEELER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V734000 (POWER TRAIN). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO DESPERADO HARLEY-DAVIDSON (1201 S BENTSEN RD, MCALLEN, TX 78501) AND THE CONTACT WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. *BF.",
        "vin": "1HD1MCC11HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "12/04/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170013,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "TRIKE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HARLEY-DAVIDSON TRIKE. OCCASIONALLY, WHEN PLACING THE VEHICLE INTO GEAR, THE CLUTCH SEIZED, FAILED TO SHIFT, AND REMAINED STUCK. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED LUMBERJACK HARLEY-DAVIDSON (2518 NW STALLINGS DR, NACOGDOCHES, TX 75964, (936) 715-0100) AND A MECHANIC WAS SUPPOSED TO RETRIEVE THE VEHICLE, BUT NEVER SHOWED UP. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 1,001. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166542,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "TRIKE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HARLEY-DAVIDSON TRIKE MOTORCYCLE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V734000 (POWER TRAIN). THE CONTACT CALLED EISENHAUER'S TIOGA COUNTY HARLEY-DAVIDSON AT 570-659-5000 (LOCATED AT 2911 S MAIN ST, MANSFIELD, PA 16933) AND WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1HD1MAD17HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/03/2018",
        "dateOfIncident": "04/30/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091496,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "TRIKE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIKE CONSTANTLY STALLS WHEN STARTING FROM A STOP, AND HAVE TO APPLY BRAKES BOTH AT SAME TIME OR JUST FRONT OR REAR IT APPEARS AS INTERMITTENT AT TIMES. SAFETY HAZARD HAVING TO COMPLETELY STOP IN AN INTERSECTION WHEN STALLED, INSTEAD OF JUST DISENGAGING CLUTCH AND COASTING TO START AS OLDER BIKES/ TRIKES.",
        "vin": "1HD1MAD30HB"
    }
]