[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286559,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  KIT 71500248C REQUIRED REPLACEMENT THE SAME  LISTED ON THE SITE. WOULD NOT START IN GEAR AND ENGINE KILLED SLOWING DOWN. THE TECH WHO REPLACED THE PART AT HD KNEW THE PROBLEM AND SAY IT OCCURS FREQUENTLY.A RECALL SHOULD BE ISSUED ,A RIDER COULD BE HIT BY A VEHICLE FOLLOWING.",
        "vin": "1HD1KGD14HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/21/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153105,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HARLEY-DAVIDSON FLTRU. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 18V734000 (POWER TRAIN). BIGGS HARLEY-DAVIDSON (1040 LOS VALLECITOS BLVD SUITE #113, SAN MARCOS, CA 92069, (760) 481-7300) AND SAN DIEGO HARLEY-DAVIDSON (4645 MORENA BLVD, SAN DIEGO, CA 92117, (858) 616-6999) STATED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1HD1KGD34HB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2017",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022927,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLTRU",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING AT ABOUT 1,5000 MILES THE BIKE STARTED RUNNING VERY ROUGH, ESPECIALLY AT IDLE AND WHEN THE CLUTCH WAS PULLED IN, SUCH AS WHEN SLOWING OR STOPPING AT AN INTERSECTION. THE BIKE WOULD THEN SOMETIMES STALL, EVEN WHEN IN MOTION. TWO OF THE TIMES MY BIKE STALLED IN MOTION WAS IN HEAVY TRAFFIC, AND WE WERE ALMOST HIT BY APPROACHING VEHICLES. EXACERBATING THE PROBLEM IS THAT WHEN THE BIKE STALLS IT WILL NOT RESTART IN GEAR. INSTEAD I MUST FUMBLE AROUND TRYING TO GET THE BIKE BACK INTO NUETRAL IN ORDER FOR THE BIKE TO START AGAIN. ADDITIONALLY, WITH THE ONSET OF THESE PROBLEMS NUETRAL HAS BECOME INCREASINGLY DIFFICULT TO \"FIND.\" WHEN I TOOK MY BIKE BACK TO THE DEALER I WAS TOLD \"HARLEY DOESN'T WANT YOU TO START THEIR BIKES IN GEAR.\" I REPLIED THAT I DIDN'T CARE WHAT HARLEY WANTS, AND THAT WHEN THE BIKE STALLS IN TRAFFIC I HAD BETTER BE ABLE TO QUICKLY RESTART IT NO MATTER IF IT IS IN GEAR OR NUETRAL. AT MY INSISTENCE THE DEALER AGREED TO LOOK AT MY BIKE. AFTER A FEW HOURS A TECH CAME OUT AND TOLD ME THAT MY BIKE \"RUNS LIKE SHIT\" BUT THEY WERE UNABLE TO FIX IT. THEY WANTED TO KEEP IT FOR AN ENTIRE WEEK TO WORK ON IT, BUT SINCE THEY WOULDN'T GIVE ME A LOANER BIKE (OR AT LEAST A RIDE HOME) I LEFT AND TOOK MY BIKE TO A SECOND DEALER. THE SECOND DEALER TOLD ME THEY \"FIXED\" MY BIKE AFTER ONLY A FEW HOURS BY BLEEDING THE HYDRAULIC CLUTCH. THE BIKE DID RUN BETTER FOR A COUPLE OF WEEKS, BUT THEN IT WENT RIGHT BACK TO THE ROUGH RUNNING AND IDLING, STALLING, AND NOT BEING ABLE TO RESTART IN GEAR. ON MY WAY HOME FROM WORK TODAY I WAS ALMOST REAR-ENDED IN TRAFFIC WHEN THE BIKE STALLED AND I COULD NOT GET IT RESTARTED TO GET OUT OF THE WAY OF TRAFFIC. MY BIKE WILL NOW SIT IN MY GARAGE BECAUSE I AM AFRAID TO RIDE IT FOR FEAR MY WIFE AND I WILL BE IN AN ACCIDENT DUE TO THE BIKE'S FAILINGS.",
        "vin": "1HD1KGD12HB"
    }
]