[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2022",
        "dateOfIncident": "10/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459046,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "rear camera stopped working.. cannot back up as safe as when camera worked dealer confirmed problem no other inspection no warning prior to failure  October 2021",
        "vin": "5fpyk3f46hb"
    },
    {
        "components": "LANE DEPARTURE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/29/2022",
        "dateOfIncident": "03/22/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458861,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Blind Spot warning system failure.   Could not find cause, so took it to the dealer and they determined it was a shorted wires within the wiring harness that leads to the tailgate.  This is the same wiring harness that has the backup camera wires, which are also problematic.  Apparently within the last month or so, you announced an investigation into this issue for 2017 and 2018 Ridgelines.  Dealer is Luther Brookdale Honda in Brooklyn Center, MN.  I paid $114.11 for a diagnostic.",
        "vin": "5fpyk3f74hb"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/24/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458430,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Tailgate backup camera harness failed.  Wires severed.",
        "vin": "5fpyk3f58hb"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "03/23/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458258,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear back up camera is failing, camera view is going in and out. Upon inspection of the rear tailgate it is clear the wiring going from the main body of the truck to the tailgate is exposed from the plastic casing and some of the wires are breaking themselves causing the malfunction. This truck only has ~43k miles on it and the tailgate gets used semi-frequently, by no means is it used excessively. It is ridiculous that such an important piece of safety equipment would not be better made to withstand the normal wear and tear of use and fail at such low mileage. This failure has caused a massive blind spot when reversing and could put pedestrians or other vehicles in harms way.  No I have not taken this into the manufacturer nor has it been confirmed by the dealer. No warning lights have gone off, the only way to know there is something wrong is when in reverse the backup screen is black with no video.",
        "vin": "5fpyk3f86hb"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "12/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457908,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "broken tailgate harness causing the backup camera to no longer work. my vehicle is available for inspection, at this time.  I can no longer see behind my vehicle and may injure animals, children, or damage property when driving in reverse.  This is no longer covered by warranty, but is a poor design where the tailgate itself clamps and eventually cuts the wiring harness. I have confirmed this issue with dozens of other 2017-2018 ridgeline owners.   there was no warning other than my screen going black one day after using the vertical hinge on the tailgate.",
        "vin": "5FPYK3F64HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "01/23/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457594,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Power train PCM failure caused gauge cluster to become unresponsive. While the truck was idling while connecting a trailer the gauge cluster went blank. I then attempted to shut down and restart the truck and it would not start leaving me stranded. While I did eventually get it started by replacing several fuses once it was running it had no turn signals and had an error message for the emissions system. Ended up taking to dealership and was told the PCM had failed. Truck was 49 months old and had 45k miles.",
        "vin": "5FPYK3F52HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2022",
        "dateOfIncident": "02/26/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "- Backup Camera Failed - Specifically the wiring harness that goes to the tailgate.  It can be inspected  by others until it is replaced. - Yes, it is a large vehicle manufactured when it was required to have a backup camera, I back out of my driveway onto a small private street that always has lots of little kids playing. - The dealer confirmed the issue, they have ordered the part and it is $350 to fix a $30 wiring harness because the whole bed and tailgate has to be taken apart. - It has not been inspected by manufacturer (though I read online that Honda has a note in the system to send them the replaced harnesses) or insurance. - There were no warning lights; however, at first the backup camera would only work in one position that did not align with the parking guides for a few months until it finally went black.  It also quickly flipped between views when the problem first arose.    To better describe the issue, I wanted to report a safety issue with my 2017 Honda Ridgeline Black Edition.  I saw that an investigation was already opened and there is a class action lawsuit from last year, but I wanted to formally add my truck to the ones affected by the same backup camera issue.  Mine appears to be typical to the many photos I saw online, it appears the harness that allows the tailgate to swing both ways gets abruptly folded over the bottom edge of the tailgate when it is folded down during normal use, this has resulted in snapping the harness/wires at this flex/pinch point.  It is clearly a design flaw and the issue occurs under normal use.  I do not use my truck for work and I would say the tailgate is moderately used.  My dealership called Honda and they said nothing regarding a recall, or even the first stages of that, are in the works.  My wife won't drive my truck without the camera and I back out of my driveway onto a street that always has lots of kids playing so I really have no choice but to fix it... which was quoted at $350 and they ordered the parts.",
        "vin": "5FPYK3F87HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/08/2022",
        "dateOfIncident": "03/02/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455643,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "After arriving home and turning off the vehicle, there was a lot of flickering of the lights and clicking noises in the engine. The dash displayed all emergency startup lights and performed the following message on the dash, \"Keyless Start System Error.\" I took it to the dealer who ran a diagnostic, and provided me the diagnostic paperwork showing 4 codes in the Security, Power Control Unit, Mode Menu, Lighting, Keyless Transmitter, Gauges, and door locks. The dealer confirmed that this was in no relation to the recent recall of the Ridgeline Keyless Start System Error with DTC B12C5 and that the Keyless System Main Control Unit failed, part number 38320-T6Z-A21. I had to replace the unit and am now out of pocket quite a bit of money. I have reported the issue to Honda directly and hoping a refund will be provided. I am the original owner of this 2017 Honda Ridgeline RTS 2WD model and have only 34, 358 miles on it. Never had I experienced any electrical issues and furthermore I shouldn't have them for a five year old truck with less than 35k on it. I was lucky that I was not driving, or it could have been worse possibly. The dealer kept the defective component and was able to identify the issue and repair it quickly. No other issues had ever occurred on this truck and this was random.",
        "vin": "5FPYK2F46HB"
    },
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "02/24/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The automatic emergency braking system is consistently fooled on right hand turns. It \"sees\" the car approaching as being \"in my lane\" and alerts \"BRAKE\" and vibrates the steering wheel. I believe this is because the system is unable to detect the curve in the two lane road approaching and no steering input has been applied (as the vehicle is not in the corner yet)",
        "vin": "5FPYK3F74HB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/22/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453725,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 Honda Ridgeline RTL-E, keyless entry module wasn't working properly so I had to buy a new one. I was told about the issue when I took my Honda Ridgeline to the Honda dealership for my oil change.The entry control module is currently ordered but we don't know when it will come in. I also informed the service manager about my on/off switch not operating correctly. He informed me that it was on recall so it will repaired for free. I don't know why the keyless entry module wasn't repaired for free since I bought the used 2017 Honda Ridgeline with Honda's extended warranty. Currently I have no vehicle to use because Honda informed me that they don't currently have any because of the pandemic, currently no vehicles in their lot are able to loan to customers.",
        "vin": "5fpyk3f70hb"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453403,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear backup camera has failed at 31,000 miles.  The cause of the failure is appears to be a severed wiring harness going from the main body of the vehicle into the tailgate, where the camera is located.  The harness design or routing of the wires is clearly defective.",
        "vin": "5FPYK3F40HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "02/19/2022",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453044,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1. Reverse camera not operating because of wire harness conductor breakage at tailgate hinge point.    2. Reduced vision and blind spots when backing up.  If this isn't a safety concern, what is?  System stopped working at 3-years, 40K miles.  Dealer told me issue not covered under warranty, wanted $700 for a repair of Honda's inferior harness design.  Aside from the poor flex loop design, the quality of the conductors are insufficient for use in a flex application.  My opinion is based on 31 years of designing robot wire harness's in high flex applications.  I spent four hours splicing the harness back together, all the conductors in the harness were broken.   3. I exchanged several emails with service manager; I'll dig them out of backup data storage if needed. Service manager told me the Honda people he talked too did not see it as a warranty safety issue; $700.  Once again I have to ask, how can not having a complete view of the rear of the truck when in reverse not be a safety issue?  The camera is a mandated safety item. 4. Failure began with a few days of intermittent operation before complete failure.  I'll note that my truck tailgate gets very light use.  The harness design is inferior by any engineering failure mood analysis. THERE ARE THOUSANDS OF RIDGELINE TRUCKS ON THE ROAD WITH THIS ISSUE. 5. As I mentioned, I've made a temporary splice repair.  I've managed to restore rear image although the screen quality is not what it should be. 6. I've owned Honda's for years and have had to deal with other issues Honda does not want to admit is their responsibility, and will secretly do extended coverage because they know it should be covered.  Driving without the camera makes my wife and I very nervous.  7. In summary all owners of second generation Ridgeline's should be entitled to a replacement redesigned rear camera harness for SAFETY REASONS before a child, adult, or bike rider are killed or injured.",
        "vin": "5FPYK3F72HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2022",
        "dateOfIncident": "01/03/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452769,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear back up camera failed, due to tailgate wiring harness frayed due to normal use.  Happened at about 45,000 miles.",
        "vin": "5fpyk3f72hb"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451728,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My rear backup camera failed due to the wear on the wiring harness at the point where the two-way tailgate opens. This seems to be a common failure and my case was typical. My vehicle was out of warranty, and so I performed the repair myself, and improved the shielding at the pinch point.",
        "vin": "5FPYK3F19HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451793,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The wiring to the backup camera on my 2017 Honda Ridgeline is a poor design.  It bends too tightly and every time the two-way tailgate is opened or closed it work hardens the small gauge wiring until it breaks.  Of course this happened just after the warranty expired.  When checking with Miller Honda in Winchester, VA they told me they had never heard of this.  If you go onto the Honda Ridgeline website this same problem is mentioned several times.  I made a temporary repair to get it working again but it is unknown how long this will last.",
        "vin": "5FPYK3F70HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2022",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450413,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Backup Camera not working and wiring harness near tailgate is broken. In reading other reviews this is a common safety problem on the 2017 Ridgeline.",
        "vin": "5fpyk3f72hb"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "12/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447502,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Backup camara failure due to failure of wiring harness through tail gate.",
        "vin": "5FPYK3F88HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "12/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444713,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's wife owns a 2017 Honda Ridgeline. The contact stated that the AWD and battery fan warning lights were illuminated on the instrument panel. The contact took the vehicle to a dealer where he was informed that the alternator needed to be replaced. The manufacturer was also notified of the failure and informed him that there were no recalls on his wife's vehicle. Upon investigation, the contact discovered NHTSA Campaign Number: 16V888000 (Electrical System) which he linked to the failure. The vehicle had yet to be repaired. The failure mileage was approximately 50,000.",
        "vin": "5fpyk3f74hb"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440548,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Backup camera wiring harness has been pinched and broken by opening the tailgate resulting in the backup camera malfunction.",
        "vin": "5fpyk3f77hb"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438476,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The alarm system goes off at random times throughout the day, headlights stay on after the alarm activates, interior dash warning lights flicker and voltage fluctuates with sound.  Happens if Key Fob is in my pocket or not.   Events started in Oct 2019 and continued until Sep2020, when I unplugged the hood alarm activation switch.  This disabled the alarm from going off at random times but didn't stop the dash warning lights from flickering and voltage fluctuating sounds.  As of OCT 2021, now a slew of dash warning lights from \"trailer assist, uphill assistant, lane assistant\" plus many more have taken over my dash.  At random times the brake assist will activate and cause my truck to temporarily lock up, then go back to normal.  It appears to happen to be worse after heavy rains.",
        "vin": "5FPYK3F85HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2021",
        "dateOfIncident": "10/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438571,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving the transmission feels and sounds as if it is slipping.  When this happens the vehicle does not shift smoothly and there  is a hesitation and loud clunk noise.  The vehicle then slows down causing vehicles following to brake.  The vehicle was taken in for inspection and repair but service center could not reproduce the problem.  This is an intermittent problem that has occurred five times over a 6 month period the first year and again the following year.",
        "vin": "5fpyk3f88hb"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438172,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The wiring for the backup camera broke at a hinge point for the tailgate.  The repeated opening and closing of the tailgate in normal operations caused the wire to fatigue and break.",
        "vin": "5FPYK3F52HB"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "08/08/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "After reading about this issue I know it's common, however it just happened to me. My backup camera in my 2017 Honda Ridgeline is now black - and sure enough if you open the tailgate you can see exposed wires where there should be black conduit covering them. I am pretty bummed because this is a car I have had about 18 months. I'm sure they will tell me I need a new harness and it will cost me a bundle to fix. Now I am worried that it will just break again after reading all the other complaints about this issue. I want to be part of the law suit for this issue but not sure how to get on that train.",
        "vin": "5FPYK3F84HB"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422394,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The back up camera stopped working. Can't detect any movement when backing up, ie, children, adults, pets etc. I have small grandchildren and this is a very big concern.  Service scheduled for July 6, 2021.  Work order stated broken wires due to corrosion, camera and wiring harness needed to be replaced. Manufacturer has been contacted.*JB   No warning or message to alert us. It stopped working June24, 2021  From research on line, this is an issue on the 2017 Ridgeline. Wiring harness on tailgate wires are being broken due to location in the tailgate.",
        "vin": "5fpyk3f77hb"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/08/2021",
        "dateOfIncident": "06/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420068,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I own a 2017 Honda Ridgeline and am original owner.  Couple of months ago my backup camera went black with only the yellow space image showing on the screen. Went to dealer and they said it was the camera. Made appointment for this repair for $391. After 2 hours they said it wasn't the camera and that the wiring harness in the tailgate was severed and to replace it was $1,641. I said no thanks. In researching online I guess it is a very common problem.  You tend to rely on it.  There was no warning that it was going to happen. I backed into another vehicle recently that I am sure I would not have had the camera worked. This is not a work truck.  It is my daily driver.  I currently have almost 38,000 miles on it and have owned it just over 4 years so it is beyond the warranty coverage.  In my opinion there should be a recall by Honda Motor Corporation for this serious problem.",
        "vin": "5FPYK3F6XHB"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/04/2021",
        "dateOfIncident": "03/25/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419669,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The back-up camera harness runs through the tailgate.  Through repeated, normal wear and tear, this wires within the camera harness crack / split, requiring a repair of this harness.",
        "vin": "5FPYK3F85HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/10/2021",
        "dateOfIncident": "04/10/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415847,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING FOR THE BACKUP CAMERA HAS BEEN PINCHED BY THE TAILGATE OPENING TO THE POINT OF BREAKING THE WIRES AND THE PROTECTIVE LOOM. BACKUP CAMERA NO LONGER WORKS.",
        "vin": "5FPYK3F75HB"
    },
    {
        "components": "UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415248,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK UP CAMERA HAS CEASED WORKING DUE TO THE WIRING HARNESS BEING CUT AND CRIMPED IN THE TAILGATE ASSEMBLY.  IT APPEARS TO BE A EXAMPLE OF A POOR DESIGN THAT COULD BE A SAFETY ISSUE. THE CONSTANT OPENING AND CLOSING OF THE GATE AND THE CHOICE OF POOR MATERIALS DOES NOT PROTECT THE WIRING.   I NOTICED IT WHEN ATTEMPTING TO LEAVE A PARKING LOT.   THROUGH MY RESEARCH IT IS A COMMON OCCURRENCE ON THESE MODELS.",
        "vin": "5FPYK3F65HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "04/21/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413184,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BACKUP CAMERA THAT IS USED EVERY SINGLE DAY HAS GONE COMPLETELY BLACK. THE WIRE HARNESS THAT RUNS FROM THE TRUCK TO THE TAILGATE HAVE SPLIT DUE TO OPENING AND CLOSING. THIS IS A VERY COMMON PROBLEM THAT IS NOT THE EASIEST TO FIX WHICH COSTS THE OWNERS. THIS WILL HAPPEN TO EVERY SINGLE 2017-2019 RIDGELINE. IT IS SIMPLY CAUSED BY OPENING AND CLOSING TAILGATE IN THE PARKED POSITION.",
        "vin": "5FPYK3F73HB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/19/2021",
        "dateOfIncident": "04/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11412953,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN TO DISPLAY WARNING LIGHTS: VEHICLE STABILITY ASSIST (VSA) PROBLEM, EMISSIONS SYSTEM PROBLEM, ALL WHEEL DRIVE SYSTEM PROBLEM, POWER STEERING SYSTEM PROBLEM, HILL START ASSIST PROBLEM AND TRAILER STABILITY ASSIST PROBLEM (TSA.) CHECK ENGINE LIGHT ON.",
        "vin": "5FPYK3F67HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408414,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HONDA RIDGELINE. THE CONTACT STATED THAT THE TAILGATE WIRING HARNESS FAILED AND CAUSED THE REVERSE CAMERA TO BECOME INOPERABLE. THE REVERSE CAMERA SHOWED A BLACK SCREEN. THE CONTACT ALSO STATED THAT WHEN THE TAILGATE WAS OPENED, THE WIRES WERE EXPOSED. THE FAILURE WAS INTERMITTENT. THE CONTACT PLACED THE WIRES BACK IN PLACE AND THE REVERSE CAMERA OPERATED AS DESIGNED. THE CONTACT RECENTLY BECAME AWARE THAT THE TAILGATE WIRES WERE CUT. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 33,000.*DT",
        "vin": "5FPYK3F73HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404149,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BACKUP CAMERA STOPPED WORKING.  IT LOOKS LIKE THE WIRE HARNESS HAS BROKEN BECAUSE IT IS NOT ABLE TO HANDLE THE OPENING AND CLOSING OF THE TAILGATE OVER TIME.",
        "vin": "5FPYK3F64HB"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403730,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN TO DISPLAY WARNING LIGHTS: VEHICLE STABILITY ASSIST (VSA) PROBLEM, EMISSIONS SYSTEM PROBLEM, ALL WHEEL DRIVE SYSTEM PROBLEM, POWER STEERING SYSTEM PROBLEM, HILL START ASSIST PROBLEM AND TRAILER STABILITY ASSIST PROBLEM (TSA.) ONCE LIGHTS APPEAR, THE TRUCK GOES INTO \"LIMP\" MODE RESTRICTING ACCELERATION TO 2,000 RPMS MAKING IT DIFFICULT TO ACCELERATE (DANGEROUS IF PULLING ONTO A BUSY ROAD) OR IF LIGHTS COME ON WHILE DRIVING AND RPMS OVER 2,000 THE VEHICLE VIOLENTLY DOWN SHIFTS MAKING A DANGEROUS DECELERATION (ESPECIALLY ON THE HIGHWAY.) HONDA DEALERSHIP DIAGNOSED THE PROBLEM AS A BAD CAMSHAFT, CAMSHAFT THRUST COVER AND CMP SENSOR (AS NOTED IN HONDA SERVICE NEWS ARTICLE FROM JANUARY 2018 A18010I VERSION 1.) AFTER RESEARCHING THE PROBLEM I HAVE DISCOVERED THAT THIS NOT UNCOMMON FOR THIS MODEL AND YEAR, IT'S A KNOWN PROBLEM BY HONDA RESULTING FROM A DEFECTIVE CAM SHAFT. HOWEVER, HONDA REFUSED TO STAND BY THEIR PRODUCT. IT'S A $2,300 REPAIR FOR A VEHICLE THAT IS ONLY 4 YEARS OLD AND 69,000 MILES. I'VE MADE A COMPLAINT WITH HONDA CORP, MY LOCAL HONDA DEALERSHIP AND NOW NHTSA.",
        "vin": "5FPYK3F6XHB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403360,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING HARNESS FOR BACK-UP CAMERA IS BROKEN.  THIS IS A VERY COMMON PROBLEM CAUSED BY A DESIGN DEFECT, AS DOCUMENTED ON THE RIDGELINE OWNERS FORUM: HTTPS://WWW.RIDGELINEOWNERSCLUB.COM/THREADS/2017-2018-BROKEN-TAILGATE-HARNESS-CAUSES-BACKUP-CAMERA-FAILURE.217776/",
        "vin": "5FPYK3F70HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403368,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA WIRING HARNESS HAS FAILED TWICE NOW IN THE 39 MONTHS AND 38000 MILES OF OWNERSHIP. BOUGHT NEW AND HAVE BEEN THE ONLY OWNER. PROBLEM IS WELL KNOW BY HONDA AND OTHER OWNERS BUT HONDA USA IS ONLY REPLACING WITH THE SAME PART THAT FAILS THE EXACT SAME WAY. EVEN OWNERS OF 2020 RIDGELINES ARE STILL HAVING THE ISSUE.    WHILE BACKING UP CAMERA IS BLANK AND UNUSABLE",
        "vin": "5FPYK3F52HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2021",
        "dateOfIncident": "02/02/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399178,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA FAILED DUE TO WIRING HARNESS BEING LOCATED ON A BEND POINT.   WHEN YOU OPEN THE TAILGATE YOU CAN SEE THE EXPOSED WIRES THAT BEND WHEN OPENED.  THIS HAPPENED AFTER I OPENED THE TAILGATE ON AN EXTREMELY COLD DAY (-10F). IT LOOKS LIKE THIS FAILED DUE TO REPEATED OPENINGS OF THE TAILGATE.  WHEN THE TAILGATE IS CLOSED THE WIRE HARNESS IS LOOSE BUT WHEN IT IS OPENED THE HARNESS IS STRESSED BY PART OF THE TAILGATE.        UPON TROUBLING SHOOTING THE ISSUE ONLINE I FOUND MULTIPLE PEOPLE ARE HAVING THE SAME ISSUE.  THERE ALSO SEEMS TO BE TSB FOR WORKING HARNESSES BUT NOTHING IF YOURS HAS ALREADY BROKEN.    HTTPS://WWW.RIDGELINEOWNERSCLUB.COM/THREADS/2017-2018-BROKEN-TAILGATE-HARNESS-CAUSES-BACKUP-CAMERA-FAILURE.217776/",
        "vin": "5FPYK3F85HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398930,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK UP CAMERA WIRE BROKE AT TAILGATE HINGE. FLAWED DESIGN",
        "vin": "5FPYK3F87HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/25/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397936,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR VIEW CAMERA FAILED, BECAUSE WIRES IN THE HARNESS LEADING TO THE CAMERA (LOCATED IN TAILGATE) BECAME BARE AND THEN SEVERED THROUGH REGULAR OPENING/CLOSING OF THE TAILGATE.  MANY OTHER RIDGELINE OWNERS HAVE EXPERIENCED THIS ISSUE.",
        "vin": "5FPYK3F68HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "01/22/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397565,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA FAILED WHILE BACKING OUT OF PARKING SPACE.    REAR BACKUP CAMERA FAILED AS A RESULT OF OVERSTRESS OF WIRES IN TAILGATE.  WIRES BROKE AS A RESULT OF NORMAL TAILGATE OPERATION.",
        "vin": "5FPYK3F70HB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "01/29/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391188,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS START SYSTEM PROBLEM KEEPS COMING UP ON THE DASH; WENT OFF AND CAME BACK ON 2/1/2021.",
        "vin": "5FPYK2F59HB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389834,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF SPONTANEOUSLY EXPLODED BY WHILE DRIVING THE CAR ON HIGHWAY 50 FROM SACRAMENTO TO TAHOE, SUSPECT CHANGING OUTSIDE TEMPERATURE  TO AROUND 30",
        "vin": "5FPYK3F83HB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "01/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389927,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH TO OPEN THE TAILGATE ON THE VERTICAL HINGE CLICKS BUT DOES NOT OPEN. THIS CREATES AN UNSAFE CONDITION BECAUSE IT APPEARS THE TAILGATE IS IS SECURED BUT THE LATCH INTERNALLY COULD BE DISENGAGED WHICH WOULD ALLOW THE GATE TO OPEN UNEXPECTEDLY WHILE DRIVING. I CONTACTED HONDA USA DIRECTLY REGARDING THIS AND THEY EXPECT ME TO PAY TO REPAIR IT. I TRIED CONTACTING THEM A SECOND TIME VIA EMAIL WITH NO RESPONSE.  CURRENTLY THIS IS NOT REPAIRED AND I HAVE TO REMEMBER TO CHECK THE TAILGATE TO ENSURE IT IS SECURE EACH TIME BEFORE DRIVING.",
        "vin": "5FPYK2F50HB"
    },
    {
        "components": "BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "01/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388328,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HONDA RIDGELINE. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE IN REVERSE, THE REAR VIEW CAMERA WAS INOPERABLE. UPON INSPECTION, IT WAS DISCOVERED THAT THE WIRE HARNESS WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE LOCAL DEALER CURRY HONDA LOCATED AT 5525 PEACHTREE INDUSTRIAL BLVD, CHAMBLEE, GA 30341 AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE HOWEVER, NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 31,000.",
        "vin": "5FPYK3F77HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2020",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385136,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2 WEEKS AGO MULTIPLE WARNING LIGHTS CAME ON WHEN I STARTED THE VEHICLE (POWER STEERING, VEHICLE STABILITY ASSIST, HILL START ASSIST, TRAILER STABILITY ASSIST, EMISSION CONTROL, ETC.).  AT THE SAME TIME THE VEHICLE'S PERFORMANCE BECAME SLUGGISH. ACCELERATION, SHIFTING AND BRAKING WERE ALL EFFECTED.  THE NEXT DAY THE LIGHTS WERE OFF, ONLY TO REAPPEAR WITH ALL ISSUES THE DAY AFTER.  I DISCONNECTED THE BATTERY TO 'RESET', AND THAT WORKED FOR 1 DAY.  I THEN REPLACED THE BATTERY WITH THE SAME RESULT.  NOW THE PROBLEM HAPPENS EVERY TIME THE VEHICLE IS STARTED.  ALL WARNINGS SHOW UP BEFORE THE VEHICLE IS MOVING.",
        "vin": "5FPYK3F54HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2020",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385073,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2017 HONDA RIDGELINE HAS HAD AN ELECTRICAL PROBLEM EVER SINCE WE BOUGHT IT IN 2018.  THE ENGINE LIGHT GOES ON WHEN DRIVING, ALL SYSTEMS BLINK ESPECIALLY THE EMISSIONS LIGHT AND WARNINGS.  THE HORN HONKS UNTIL I CLICK THE UNLOCK BUTTON AND THEN IT HONKS AGAIN.  WHEN WE TOOK IT IN TO HONDA SERVICE AND IT WAS NOT BLINKING AND THEY SAID IT HAD TO HAVE THE BLINKING GOING OFF TO KNOW THE PROBLEM AND TO BRING IT BACK.  WE TOOK IT SOMEWHERE ELSE AND THEY SAID THE INJECTOR 2 WAS BAD.",
        "vin": "5FPYK3F59HB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375168,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 15, 2020 I NOTICE 2 BUBBLE AND SEAL GAP ON DRIVER SIDE DOOR/WINDOW PANELS. VEHICLE WAS STATIONARY. NO SCRATCHES, PAINTED CRACKS OR APPEARANCE OF BREAKING OR WORN. BUBBLES ARE IN THE CENTER AND TOP EDGE OF DOOR BODY UNDERNEATH THE PAINT.",
        "vin": "5FPYK3F89HB"
    },
    {
        "components": "POWER TRAIN,LANE DEPARTURE",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "10/21/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375179,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 59K +/- THE TRANSMISSION SYSTEM AND BLIND SPOT SYSTEM LIGHT ON MY 2017 HONDA RIDGELINE CAME ON AND WENT OFF WHEN THE CAR WAS PARKED.  THIS PHENOMENON WAS REPEATED TWICE BEFORE THE VEHICLE WAS RETURNED TO THE DEALER FOR SERVICE AT 61K +/-.  THE COMPLAINT WAS NOTED, CHECKED, AND AFTER A $998.19 SERVICE BILL, NO PROBLEMS OR FAULTS COULD BE LOCATED.  AT 62K +/- BOTH WARNING LIGHTS CAME ON AND THE RIDGELINE WAS RETURNED TO THE DEALER.  AT THAT TIME I WAS INFORMED THE TRANSMISSION HAD FAILED AND HONDA REFUSED TO MAKE THE NECESSARY REPAIRS UNDER WARRANTY.  THIS FLAW IS KNOWN TO HONDA AND HAS BEEN CORRECTED IN LATER MODELS.  PROSPECTIVE BUYERS SHOULD BE WARNED ABOUT THE FAULT SO THIS MODEL RIDGELINE CAN BE AVOIDED.  FINALLY, CONSUMERS SHOULD BE AWARE THAT HONDA REFUSES TO TAKE RESPONSIBILITY FOR DEFECTIVE PRODUCTS.",
        "vin": "5FPYK3F78HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374637,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING VEHICLE THE FOLLOWING ERROR CODE APPEARS: 'KEYLESS START SYSTEM PROBLEM'",
        "vin": "5FPYK3F57HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2020",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374112,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING HARNESS FOR THE REAR BACKUP CAMERA SPLIT/CUT FROM ROUTINE OPENING AND CLOSING OF THE TAILGATE. CAMERA TOTALLY USELESS, BLACK SCREEN. CAMERA WAS WORKING ONE MINUTE, PUT THE VEHICLE IN REVERSE AND STOPPED WORKING.",
        "vin": "5FPYK3F72HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BACK-UP CAMERA SUDDENLY STOPPED WORKING.  I DID AN INTERNET SEARCH TO SEE IF THERE WAS SOMETHING I COULD DO TO RESET THE CAMERA.  MULTIPLE POSTS INDICATED THAT THE PROBLEM WAS WITH A PINCHED CABLE AT THE HINGE OF THE TAILGATE THAT SEVERS THE WIRES.  I LOOKED WHERE THE PROBLEM WAS DESCRIBED AND FOUND THE CABLE PINCHED AND SEVERED.  WHEN I BROUGHT THE CAR TO THE DEALERSHIP, THE SERVICE REP WAS NOT SURPRISED AND TOLD ME THAT ONCE IT WAS FIXED, I WOULD NEVER HAVE AN ISSUE WITH THE CABLE AGAIN.  $870 DOLLARS LATER, I AM INCLINED TO BELIEVE THAT THE PROBLEM IS A DESIGN FLAW AND SHOULD BE RECALLED.  THESE BACK-UP CAMERAS ARE SAFETY FEATURES THAT ARE NOW CONSIDERED STANDARD EQUIPMENT IN MOST NEW CARS.  I CAN ATTEST TO THEIR EFFICACY, ESPECIALLY EXPERIENCING WHAT IT WAS LIKE TO DRIVE WITHOUT THE BACK-UP CAMERA.",
        "vin": "5FPYK3F80HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2020",
        "dateOfIncident": "10/31/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372604,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKUP CAMERA STOPPED WORKING DUE TO BROKEN WIRE WHERE IT GOES THROUGH THE TAILGATE. UNABLE TO USE BACKUP CAMERA NOW IT JUST SHOWS BLACK SCREEN. WIRES ARE EXPOSED NOW ALSO",
        "vin": "5FPYK3F61HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2020",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372509,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS START SYSTEM PROBLEMS",
        "vin": "5FPYK3F57HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2020",
        "dateOfIncident": "08/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360119,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A KEYLESS START SYSTEM PROBLEM PERIODICALLY COMES ON MY DASH CONSOLE SCREEN AND MY WALK AWAY AUTO LOCK HAS STOPPED WORKING IN CONJUNCTION WITH THIS SYSTEM ERROR. I REPLACED THE FOB BATTERY, HAD THE SYSTEM RESET BY THE REPAIR SHOP AND IT FAILS TO FIX MY PROBLEM.",
        "vin": "5FPYK3F87HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350026,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRE HARNESS FOR BACKUP CAMERA HAS BROKEN AT THE SPOT WHERE IT GETS PINCHED DURING USE OF TAILGATE.  BACKUP CAMERA IS NO LONGER FUNCTIONAL.",
        "vin": "5FPYK2F57HB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349913,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SURGES ON TAKE OFF AND AT HIGHWAY SPEEDS.   START/STOP BUTTON GIVES READING CODE OF SMART ENTRY START PROBLEM. VEHICLE DOES THIS UPON STARTING VEHICLE.",
        "vin": "5FPYK3F74HB"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343439,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE CHUGS AND HESITATES WHEN ACCELERATING ON THE HIGHWAY OR IN THE CITY.  THE RPM TACHOMETER \"BOUNCES\" AS IT DOES SO.  TOOK TO DEALERSHIP SEPTEMBER 26, 2019 THINKING IT WAS FUEL PUMP ISSUE (RECALL 19-013) AND THEY SAID THIS WAS NOT THE PROBLEM AND THE FUEL PUMP SYSTEM WAS FINE.  PROBLEM IS STILL OCCURRING.",
        "vin": "5FPYK3F57HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACKUP CAMERA IS NOT WORKING.  \"BLINKED/FLASHED\" A FEW TIMES WHILE BACKING OUT OF THE GARAGE AND THEN QUIT WORKING.  MAJOR SAFETY CONCERN. I CALLED HONDA TO REPORT THIS IN FEBRUARY 2020, BUT THEY SAID THERE WERE NO OPEN RECALLS AND THERE WAS NOTHING THEY COULD DO; HOWEVER, IT APPEARS THERE ARE MANY OTHER HONDA OWNERS EXPERIENCING THIS PROBLEM.",
        "vin": "5FPYK3F57HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341373,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING HARNESS TO BACK UP CAMERA HAS A KIK  THAT RESULTS IN ABNORMAL WEAR AND FAILURE. BACK UP CAMERA NO LONGER WORKS. POOR ENGINEERING. OTHERS HAVE COMPLAINED ABOUT SAME PROBLEM BUT NO RESOLUTION FROM HONDA",
        "vin": "5FPYK3F54HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331726,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 70,000 MILES THE VEHICLE BEGAN TO INTERMITTENTLY DISPLAY A 'KEYLESS START SYSTEM PROBLEM'.  THE MESSAGE REMAINS ON THE INSTRUMENT PANEL FOR A DAY OR TWO, DISAPPEARS, THEN REAPPEARS.  THE IGNITION SYSTEM AND LOCKS CONTINUE TO WORK NORMALLY.  I FEEL THAT THIS CREATES SAFETY CONCERNS - AND FROM WHAT I HAVE READ, THIS PROBLEM IS WIDESPREAD.  *TR",
        "vin": "5FPYK2F58HB"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329993,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REARVIEW CAMERA DID NOT WORK. WIRING WAS BROKEN BETWEEN BODY AND TAILGATE WHERE IT FLEXES.  *TR",
        "vin": "5FPYK3F5XHB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "05/07/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324944,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DISPLACE EMISSIONS SYSTEM ISSUE LIGHT.  TOOK VEHICLE TO DEALERSHIP SERVICE AND WAS TOLD THE ENTIRE FUEL TANK NEEDED TO BE REPLACED - ADVISED BY BOTH DEALERSHIP AND INSURANCE ADJUSTER THAT THIS HAS BECOME COMMON IN THE LAST THREE YEARS SINCE A CHANGE IN MANUFACTURING AND THE USE OF A DIFFERENT KIND OF PLASTIC IN THE TANK.  THE SERVICE ASSOCIATE AT THE DEALER THEN SHOWED AN ENTIRE DUMPSTER FILLED WITH REPLACED FUEL TANKS.  *TR",
        "vin": "5FPYK3F42HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2020",
        "dateOfIncident": "04/24/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322940,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2017 RIDGELINE GETTING CODE FOR FAULTING INJECTORS AND RAIL . NO LOSS IN POWER OR SHUDDERING . THIS VEHICLE IS TOO NEW FOR THIS ISSUE",
        "vin": "5FPYK3F26HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/29/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322608,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM EXPERIENCING TRANSMISSION SHUDDER BETWEEN 2ND TO 3RD GEAR. WHEN SLOWING TO A STOP THE VEHICLE MAKES A JERKING MOTION. I TOOK MY VEHICLE INTO THE DEALERSHIP TO HAVE COMPUTER FLASH DONE THAT WOULD STOP THE TRANSMISSION SHUDDER. THE PROBLEM IS NOT FIXED AND I'M NOT SURE WHAT TO DO FROM HERE. MY 2006 5 SPEED RIDGELINE SHIFTS FLAWLESSLY WITH OVER 250K MILES NOT SO MUCH THE 2017 6 SPEED WITH 44K. HONDA MAKES GOOD ENGINES BUT NOT TRANSMISSIONS.",
        "vin": "5FPYK3F16HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318087,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EMISSION SYSTEM PROBLEM LIGHT CAME ON AT ABOUT 50,500 MILES. TOOK IT TO THE HONDA DEALERSHIP I PURCHASED THE TRUCK FROM AND THEY TOLD ME IT WAS THE FUEL INJECTORS. THE ONLY THING I NOTICED BEFORE THE LIGHT CAME ON WAS THE RPM WOULD 'BOUNCE' SLIGHTLY WHILE AT AROUND 35 MPH AND AROUND 47MPH. IT WOULD OCCUR WHILE MAINTAINING THE SPEED OR GOING UP ANY INCLINE, BUT WOULD STOP IF I ACCELERATED AND MAINTAINED A HIGHER SPEED",
        "vin": "5FPYK2F5XHB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2020",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315618,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "\"EMISSIONS SYSTEM PROBLEM\" LIGHT CAME ON AROUND 60K MILES. SERVICE TECH SAID TO IGNORE IT IF IT GOES AWAY. IT DID, THEN IT CAME BACK ON REPEATEDLY OVER S SPAN OF MONTHS. EVENTUALLY, VEHICLE STARTED TO RUN POORLY, HESITATING ON ACCELERATION. HONDA SERVICE DIAGNOSED AS FUEL INJECTORS FAILING, PROBLEM REQUIRES TOTAL REPLACEMENT OF FUEL INJECTORS. WIFE'S 2017 PILOT HAS SAME PROBLEM, BROTHER'S 2017 PILOT HAD SAME PROBLEM. CONTACTED HONDA, THEY DECLINED TO STAND BEHIND EITHER, AS THE VEHICLES ARE PAST WARRANTY ON MILEAGE.",
        "vin": "5FPYK3F62HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2020",
        "dateOfIncident": "02/16/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311068,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HONDA RIDGELINE. THE CONTACT STATED THAT AFTER PARKING THE VEHICLE SEVERAL UNKNOWN WARNING LIGHTS FLASHED CONTINUALLY ON THE INSTRUMENT PANEL. THE CONTACT HEARD WHAT SOUNDED LIKE SPARKING OR AN ELECTRICAL SHORT BEHIND THE CONSOLE. THE CONTACT RECORDED THE ISSUE WHILE IN PROGRESS. FOWLER HONDA PARTS 955 N INTERSTATE DR, NORMAN, OK 73069, (405) 389-3774, WAS CONTACTED AND INFORMED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 93,500.",
        "vin": "5FPYK2F66HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307963,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EMISSIONS LIGHT CAME ON AT 57000 MILES AND CONTINUED TO GO ON AND OFF UNTIL 1-30-2020 WHEN AT 69000 MILES EVERY LIGHT CAME ON AND WENT IN TO SAFE MODE ALMOST CAUSING ANOTHER VEHICLE TO ALMOST REAREND ME. TOOK IT TO A LOCAL HONDA DEALER AND THEY DETERMINED THAT THE FUEL INJECTORS WERE BAD. THEY SAID IT WAS A COMMON PROBLEM KNOWN TO HONDA SINCE THEY HAD REDESIGNED THE REPLACEMENT PARTS. END RESULT: $1610.00. IF THIS IS A COMMON PROBLEM IT SHOULD BE RECALLED IMO.",
        "vin": "5FPYK3F55HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2020",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302469,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALARM GOES OFF EVERY 30-60 MIN",
        "vin": "5FPYK3F63HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301216,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HONDA RIDGELINE IS KEPT OUTSIDE ALL THE TIME.  WE RECENTLY HAD A SEVERAL DAYS OF RAIN FOLLOWED BY TEMPERATURES DROPPING INTO THE 20'S.  WHEN I WENT TO THE GAS STATION A COUPLE DAYS AGO, I WAS UNABLE TO GET THE FLAP THAT TAKES THE PLACE OF A GAS CAP TO PUSH OPEN.  IT WAS FROZEN SHUT SOLIDLY EVEN THOUGH THERE WAS NO SIGN OF WATER ON THE OUTSIDE THE WEATHER FINALLY GOT ABOVE FREEZING TODAY AND I MANAGE TO BREAK THE ICE BEHIND THE FILLER FLAP AND GOT THE PICTURE BELOW.  AT HOME THIS WAS AN INCONVENIENCE.  ON A LONG ROAD TRIP IT COULD HAVE BEEN A BIG PROBLEM.  I PRESUME THIS ALSO MEANS THAT EVERY TIME IT RAINS I'M GETTING  WATER IN THE GAS TANK.  I HAD NO IDEA .",
        "vin": "5FPYK3F58HB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301241,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE BORDER LINE SUICIDAL - THEY DO NOT LIGHT UP ANYTHING REFLECTIVE ON THE ROAD AND NO SIGNS ARE REFLECTED EITHER.  THE HEADLIGHTS ARE SUPER WEAK AND I CAN'T DRIVE THIS TRUCK AT NIGHT.",
        "vin": "5FPYK3F66HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298458,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING UP, THE REAR CAMERA WOULD GO BLACK, OFTEN WHEN THE TRUCK BUMPED OVER THE ENTRANCE TO THE STREET. NOW THE CAMERA QUIT COMPLETELY. I FOUND BROKEN WIRES AT A PINCH POINT IN THE LOWER LEFT TAILGATE HINGE. A MUSHROOM HEAT CLAMP TO SECURE THE CABLE TO THE BODY APPEARED DAMAGED, POSSIBLY DUE TO A WIRING INSPECTION FROM A PREVIOUS RECALL?",
        "vin": "5FPYK3F82HB"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/30/2019",
        "dateOfIncident": "12/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292104,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ROAD DEPARTURE MITIGATION SYSTEM PROBLEM LIGHTS COME ON  ANIT LOCK BRAKE SYSTEM PROBLEM LIGHTS COME ON  COLLISION AVOIDANCE LIGHTS COME ON   THE LIGHTS ALL FLASH ON AND OFF AND THE ISSUE IS INTERMITTENT   THE STEERING WHEEL IS JERKED  OUT OF YOUR HAND IF YOU TRY TO TURN WHEN THE ERROR IS FLASHING   -THE ERROR CODE IS NOT STORED IN THE COMPUTER TO SHOW THE DEALER THERE WAS A PROBLEM SO THEY CAN NOT FIX IT",
        "vin": "5FPYK3F82HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290893,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALARM SYSTEM GOES OFF EVERY 20 MINUTES. THIS JUST STARTED TO HAPPEN. IN CALIFORNIA. VEHICLE IS PARKED STATIONARY. THE LIGHTS COME ON AND STAY ON THEN THE ALARM GOES OFF.   BUT INTERNAL THEN EXTERNAL LIGHTS COME ON FIRST, THEN THE ALARM GOES OFF. IT IS DRY NO RAIN EXISTS. WHEN THIS CONDITION OCCURED.",
        "vin": "5FPYK3F87HB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289749,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKING IN THROUGH RADIO ANTENNA AND RUNS DOWN INSIDE THE VEHICLE ON BOTH SIDES OF THE REAR WINDOW",
        "vin": "5FPYK3F52HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "12/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288645,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE COMES EQUIPPED WITH A CAPLESS FILL DOOR. UPON TRYING TO FILL UP WITH GAS, I FOUND MYSELF UNABLE TO INSERT THE NOZZLE FOR FILLING. AFTER FURTHER EFFORT, THE FIRST FUEL FLAP BROKE. AFTER REMOVING THE BROKEN FLAP, I FOUND THE FUEL FILL NECK FILLED ENTIRELY WITH ICE, THUS PREVENTING INWARD MOVEMENT OF THE FLAP. I WAS UNABLE TO FILL THE VEHICLE UP WITH FUEL AS A RESULT. VEHICLE IS A 2017 WITH 50,000 MILES.",
        "vin": "5FPYK3F70HB"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2019",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279130,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK NECKLINE FREEZES IN COLD WEATHER, AND YOU CAN'T PUT FUEL IN THE TANK. THIS IS VERY DANGEROUS IN THE COLD, THE NECKLINE FREEZES AND YOU CANNOT KNOCK IT LOSE ETC TO GET FUEL...SOMEONE COULD POTENTIALLY FREEZE TO DEATH!!",
        "vin": "5FPYK3F77HB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "08/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269454,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKING FROM 60 MPH FOR TRAFFIC LIGHT. ADEQUATE TIME AND SPACE TO PERFORM BRAKING PROCEDURE. SMOOTH AND EVEN BRAKING FROM 60MPH TO APPROX. 5MPH. AT THAT POINT EVEN WITH BOTH FEET APPLYING PRESSURE TO BRAKE PEDAL, MY VEHICLE FAILED TO COME TO COMPLETE STOP. HIT VEHICLE IN FRONT OF ME  STOPPED AT LIGHT , NO DAMAGE TO HER VEHICLE. BUMPER DAMAGE TO MY VEHICLE. MY VEHICLE WAS IN MOTION GOING APPROX. 5MPH. VEHICLE I HIT WAS STATIONARY. HAPPENED AT TRAFFIC LIGHT ON 4 LANE LIMITED ACCESS HWY IN NORTHERN GA. RURAL AREA. DUE TO RELATIVELY MINOR DAMAGE TO MY BUMPER AND NO DAMAGE TO OTHER PERSON VEHICLE, DRIVER OF VEHICLE I HIT DID NOT WANT TO WAIT TO FILE POLICE REPORT. AIR BAGS DID NOT DEPLOY. NO ONE INJURED.  BRAKING SYSTEM PROBLEM.   DAMAGE TO MY VEHICLE WAS $1,540.40 FOR FRONT BUMPERS, DAMAGED FOG LIGHT, PAINT REPAIR.  WEATHER CONDITIONS WERE IDEAL!",
        "vin": "5FPYK2F58HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267715,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DIAMETER OF SAFETY BAR FOR CHILD SEAT HOOK TO BIG TO ATTACH HOOK ON A 2017 HONDA RIDGELINE",
        "vin": "5FPYK3F47HB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265863,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING TO ACCELERATE MY VEHICLE WOULD BECOME JERKY UP TO AROUND 40 MPH.  THE DEALERSHIP SAID IT WAS POOR TRANSMISSION FLUID AND AN UPDATE ON SOFTWARE.  THIS COST ME $210!",
        "vin": "5FPYK3F64HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265481,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK VIBRATES, SHUDDERS, AND RUMBLE WHEN SPEED HITS 44, 66, 68, 70, 72 MPH UPON LIGHT ACCELERATION/PUSH OF THE PEDAL.  THE EXPERIENCE IS SIMILAR OR EXACTLY LIKE DRIVING OVER THE EMERGENCY RUMBLE STRIP ON THE SIDE OF THE ROAD, BUT ONLY YOU'RE NOT.  THE DEALERSHIP REFUSED TO ADMIT THE PROBLEM NOR FIX THE PROBLEM EVEN AFTER THE MECHANIC WITNESSED THE VIBRATION AND SHUDERRING IN THE TEST DRIVE.",
        "vin": "5FPYK3F70HB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245414,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS UNDER 24,000 MILES ON IT AND HAS NEVER BEEN IN AN ACCIDENT.    UNDER NORMAL DRIVING CONDITIONS, THE REAR VIEW MIRROR VIBRATES TO THE POINT OF DISTORTING THE VISION / VIEW FROM THE MIRROR.  THIS HAPPENS WHEN DRIVING AT LOW SPEEDS ON PAVED CITY STREETS AND AT HIGHER SPEEDS ON PAVED HIGHWAYS. THE PROBLEM SEEMS TO CROP UP  MOSTLY WHEN IT IS HOT OUTSIDE, BUT THE VEHICLE IS IN FLORIDA WHERE HIGH OUTSIDE TEMPS ARE COMMON AND OFTEN YEAR ROUND.       OTHER HONDA RIDGELINE OWNERS HAVE REPORTED THIS ISSUE VIA ONLINE CHAT GROUPS / FORUMS.      I HAVE REPORTED THE ISSUE TO HONDA USA BUT NEVER GOT A RESPONSE OR CALL BACK.    AT THE LEAST, THIS IS AN ANNOYANCE THAT SHOULD BE ADDRESSED BY HONDA.  AT WORST, IT PRESENTS A SERIOUS VISIBILITY / SAFETY ISSUE.",
        "vin": "5FPYK2F51HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244247,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DECELERATES IMMEDIATELY AND WITHOUT WARNING TO LIMP MODE.  ALL WARNING LIGHTS COME ON ON THE DASH AND THE THROTTLE PEDAL IS DEAD.  THE VEHICLE WILL NOT MOVE OVER 10 MPH.  THIS PROBLEM HAPPENS AT ANY SPEED WHEN ATTEMPTING TO THROTTLE UP THE VEHICLE I.E. SUCH AS MERGING ONTO A HIGHWAY FROM AN OFF RAMP.  THE SITUATION WILL OCCUR IN NORMAL CITY DRIVING AS WELL.  WHEN THE VEHICLE DECELERATES IT IS IMMEDIATE AND WILL NOT RECOVER.  IF YOU ARE TRAVELING AT HIGHWAY SPEEDS YOU IMMEDIATELY BECOME A ENCUMBRANCE TO TRAFFIC FLOW AND HAVE NO MEANS OF GETTING OUT OF THE WAY.  THIS IMMEDIATE DECELERATION IS A DANGEROUS CONDITION THAT IS FRIGHTENING AS THE DRIVER.  TO DATE, HONDA HAS NO ANSWER FOR THE PROBLEM.  I HAVE INVESTED SEVERAL HUNDREDS OF DOLLARS IN DIAGNOSTICS AND THE SISTER TRUCK TO THIS VEHICLE HAS BEEN AT THE DEALERSHIP UNDER THE GUIDANCE OF HONDA ENGINEERS FOR A MONTH WITH NO RESOLUTION.  AS WE OWN SIX OF THESE VEHICLES I HAVE PARKED THEM ALL FOR THE SAFETY OF MY COWORKERS AND THE GENERAL PUBLIC.  IN MY OPINION THIS A DANGEROUS SITUATION WITH NO RESOLUTION REQUIRES AND IMMEDIATE RESPONSE FORM THE OEM.",
        "vin": "5FPYK3F4XHB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243872,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ABOUT 40MPH, HEARD A SLIGHT POP, TRUCK LOST POWER AND FELT LIKE THE BRAKES HAD BEEN APPLIED.    ALL THE DIAGNOSTIC ICONS LIT, INCLUDING A CHIME.  DISPLAY WENT THROUGH EACH PROBLEM \"ROAD DEPARTURE MITIGATION SYSTEM PROBLEM\" \"TRAILER STABILITY ASSIST PROBLEM\" \"POWER STEERING SYSTME (ESP) PROBLEM\" AND SEVERAL OTHERS.   ENGINE DIDN'T TOTALLY SHUT DOWN AND WAS ABLE TO DRIVE HOME ABOUT A MILE AWAY.",
        "vin": "5FPYK3F84HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/28/2019",
        "dateOfIncident": "07/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240169,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION IS SHIFTING VIOLENTLY WHEN VEHICLE IS IN MOTION, STICKING IN GEARS UNDER VERY LIGHT OR NORMAL ACCELERATION, HOLDING RPMS TO 4000 BEFORE SHIFTING UP THEN SLAMMING INTO GEAR, SLUGGISH TO START OFF THE LINE.",
        "vin": "5FPYK3F75HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231786,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PROBLEM WAS WITH THE RIGHT REAR WINDOW GLASS. THE OTHER MORNING I STARTED MY CAR AND DROVE ABOUT  HALF A BLOCK. I THOUGHT THAT I HEARD A SLIGHT AIR NOISE LIKE THE REAR WINDOW MAY HAVE BEEN SLIGHTLY OPEN. WHEN I TOUCHED THE RAISE FUNCTION FOR THE REAR WINDOWS THE RIGHT REAR WINDOW EXPLODED INWARD MAKING A LOUD  NOISE THROWING GLASS FRAGMENTS ACROSS THE BACK SEAT,  I WAS DRIVING STRAIGHT AT ABOUT 15 MPH ON A CITY STREET. IT WAS ABOUT 9 AM WITH TEMPS IN UPPER 60'S. I HAD DRIVEN THE CAR THE DAY BEFORE AND DID NOT LOOK AT THE WINDOW BEFORE IT BURST. I CLEANED UP MOST OF THE GLASS AND THERE WAS NO STONE OR OBJECT IN THE CAR THAT MAY HAVE BEEN THROWN AT THE WINDOW. IT WAS SUNDAY AND I WAS ABLE TO  DROP THE CAR AT MY HONDA DEALER. I WISH I HAD TAKEN PHOTOS BUT DID NOT THINK OF IT.",
        "vin": "5FPYK3F69HB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221658,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HONDA RIDGELINE. WHILE DRIVING 50 MPH, THE SUN ROOF EXPLODED AND GLASS SHATTERED. THERE WERE NO INJURIES. THE VEHICLE WAS DRIVEN TO DAPHENE HONDA (9871 JUSTINA AVE, DAPHNE, AL 36526, (251) 202-4557) WHERE IT WAS DIAGNOSED THAT A NEW SUN ROOF NEEDED TO BE INSTALLED. THE VEHICLE WAS SCHEDULED TO BE REPAIRED TODAY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 32,200.  *BF  *AS",
        "vin": "5FPYK3F76HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208009,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPANY OWNS SIX (6) 2017 HONDA RIDGELINES.  EACH OF HTE TRUCKS HAS EXPERIENCED A FUEL RELATED ISSUE WHERE THE TRUCK STOPS IN TRAFFIC UNEXPECTEDLY CAUSING A POTENTIALLY DANGEROUS SITUATION ON THE HIGHWAY.  ALL DASH LIGHTS AND WARNINGS ILLUMINATE AND THE TRUCK WILL NOT TAKE FUEL WHEN THE ACCELERATOR IS PUSHED.  TO DATE, HONDA HAS ONLY ACKNOWLEDGED MY COMPLAINT WITH NO RESOLUTION",
        "vin": "5FPYK3F46HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/07/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208010,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK DECELERATES WITHOUT WARNING AT HIGHWAY SPEEDS.  ALL DASH LIGHTS ILLUMINATE AND THE TRUCK WILL NOT TAKE FUEL WHEN THE ACCELERATOR IS PUSHED.",
        "vin": "5FPYK3F46HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "05/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208011,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK RAPIDLY DECELERATES AT HIGHWAY SPEED AND WILL NOT TAKE FUEL WHEN THE ACCELERATOR IS PUSHED.ALL WARNING LIGHTS ON THE DASH ILLUMINATE AND THE TRUCK WILL NOT MOVE",
        "vin": "5FPYK3F40HB"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205666,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 30K MILES THE CAR BEGAN TO MAKE A THUMPING SOUND FROM THE FRONT OF THE VEHICLE WHEN DRIVING AT ANY SPEED AND PASSING OVER ANY UNEVEN SURFACE ON THE ROAD. THE SOUND SEEMS TO HAPPEN ONLY WHEN THE LEFT FRONT WHEEL HITS A BUMP AND NOT THE RIGHT WHEEL. I TOOK THE CAR TO THE LOCAL DEALER TWICE AND THEY STATED THEY COULD NOT HEAR THE NOISE OR RECREATE IT AND THAT ALL COMPONENTS WHERE WORKING CORRECTLY. I EVEN ROAD WITH THE TECH TO SHOW THEM THE SOUND AND THEY REPORTED AFTERWARDS THAT THE SOUNDS WAS GONE WHEN THEY TEST DROVE IT 4 TIMES BEFORE I PICKED IT UP.  DRIVING OUT FROM THE DEALER, THE SOUND WAS STILL THERE. THEY TOLD ME TO LET IT GET WORSE SO THEY CAN FIND IT EASIER AND DIAGNOSE IT.  THE NOISE CAN BE HEARD ESPECIALLY WHEN PASSING OVER CONSECUTIVE AND SMALL BUMPS. THE CAR NOW SOUNDS LIKE AN OLD CAR WITH STRUCTURAL DAMAGE.",
        "vin": "5FPYK3F76HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205147,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN MOTION ON A CITY STREET, ALL OF THE WARNING INDICATORS ON THE DASH WILL COME ON AND CYCLE THROUGH STATING THERE IS A PROBLEM WITH EACH SYSTEM.  THE INDICATORS WILL REMAIN ON UNTIL I SHUTDOWN AND RESTART THE TRUCK.  THIS DOESN'T HAPPEN EVERY TIME, BUT IT HAS HAPPENED TWICE IN THE PAST 2 DAYS.",
        "vin": "5FPYK3F74HB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/30/2019",
        "dateOfIncident": "04/29/2017",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204774,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE TIME, I WAS UNABLE TO TURN THE WIPER ON AT ALL ON THE HIGH WAY.  LATELY, WIPERS STOP AT THE MIDDLE OF THE WINDSHIELD SO I HAD TO STOP AND RESTART IT.  I TOOK VEHICLE TO HONDA DEALER AND THEY FAILED TO DUPLICATE MY PROBLEMS.  BUT, I KNEW THAT MY VEHICLE HAS THIS PROBLEMS.",
        "vin": "5FPYK3F50HB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204164,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CORRECTION TO LAST REPORT. PLEASE IGNORE THE APRIL 26TH POST.  SORRY FOR THE TYPOS AND WRONG WORDS..  THIS IS THE SECOND OCCURRENCE OF THIS DANGEROUS PROBLEM. TRAVELING ON THE FREEWAY THE VEHICLE SUDDENLY LOST ALL POWER, WARNING LIGHTS AND ALERTS FLASHINF. WAS ABLE TO DRIFT VEHICLE TO SHOULDER (BARELY AVOIDING A COLLISION, THIS WAS DURING RUSH HOUR). TOOK A PIC OF DASHBOARD, THEN TURNED VEHICLE OFF. TRIED RESTARTING A COUPLE OF TIMES AND POWER LOSS WAS STILL THERE. WAITED 10 MINUTES RESTARTED POWER BACK, BUT WARNING LIGHTS STILL FLASHING. MADE IT OFF FREEWAY, TOOK A VIDEO, CALLED HONDA ROADSIDE ASSISTANCE AND REPORTED ISSUE. DECLINED TOW, MADE MY APPT. AND WAS ABLE TO RETURN HOME. I AM NOW AT THE DEALER. AGAIN THIS IT'S THE SECOND TIME THIS HAS HAPPENED, THE FIRST WAS 6 MONTHS AND 7000 MILES AGO.  IN FACT IT EXACTLY 6 MONTHS TO THE MINUTE IT OCCURRED.  TOO MANY COINCIDENCES WITH THIS DANGEROUS PROBLEM.  DEALER HAS SAID IT WAS A PROBLEM WITH THE  VEHICLE WAS AN \"ACCELERATOR PEDAL POSITION CONNECTOR\".  I'LL WAIT AND SEE IF IT HAPPENS AGAIN.  PLEASE IGNORE THE APRIL 26TH POST",
        "vin": "5FPYK2F53HB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "04/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203886,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND OCCURRENCE OF THIS DANGEROUS PROBLEM. TRAVELING ON THE FREEWAY THE VEHICLE SUDDENLY LOST ALL POWER, WASTING LIGHTS AND ALLEYS FLAGGING.  WAS ABLE TO DRIFT VEHICLE TO SHOULDER (BARELY AVOIDING A COLLISION, THIS WAS DURING RUSH HOUR). TOOK A PIC OF DASHBOARD, THEN TURNED VEHICLE OFF.  TRIED RESTARTING A COUPLE OF TIMES AND POWER LOSS WAS STILL THERE. WAITED 10 MINUTES RESTARTED POWER BACK, BUT EATING LIGHTS STILL FLASHING.  MADE IT OFF FREEWAY, TOOK A VIDEO, CALLED JOBS ROADSIDE ASSISTANCE AND TROTTED ISSUE.  DECLINED TOW, MADE MY APPT. AND WAS ABLE TO RETURN HOME.  I AM NOW AT THE DEALER.  AGAIN THIS IT'S THE SECOND TIME THIS HAS HAPPENED, THE FIRST WAS 6 MONTHS AND 7000 MILES AGO.",
        "vin": "5FPYK2F53HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2019",
        "dateOfIncident": "03/31/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192752,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ICE FORMED BETWEEN THE INNER AND OUTER FLAPS OF THE CAPLESS FUEL FILLER SYSTEM.  I HAD TO BREAK THE OUTER FLAP TO GAIN ACCESS TO THE SPACE BETWEEN THE FLAPS.  WITH THE OUTER FLAP REMOVED, I WAS ABLE TO REMOVE THE ICE AND FINALLY REFUEL THE RIDGELINE.  I WAS PARKED AT A GAS STATION IN PLAINFIELD INDIANA, 163 MILES FROM HOME.",
        "vin": "5FPYK3F52HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192613,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HONDA RIDGELINE STARTS TO DO A RARE THINGS : LIKE WARNING LIGHTS ON THE VEHICLE DASHBOARD,THE ALARM ACTIVED MANY TIMES AND A WEEK LATER THERE WERE WATER UNDER THE BACK SEATS. I TOOK IT TO THE DELER AND THEY TOOK THE ALARM OUT AND DIDN'T FIND THE LEAK SO MY RIDGELINE STILL THERE FOR ALMOST ONE MONTH AND L DIDN'T RECEIVE ANY RESPONSE...L DON'T NOT WHAT TO DO ... THANK YOU",
        "vin": "5FPYK3F64HB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181420,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPROACHING A RED LIGHT, I APPLIED THE BRAKES NORMALLY.  THE REAR BRAKES SUDDENLY LOCKED AND I SKIDDED ABOUT 2 FEET ON WET PAVEMENT, NARROWLY MISSING A REAR END COLLISION WITH THE CAR IN FRONT OF ME.  A DASHBOARD WARNING LIGHT FLASHED BUT WENT OFF SO QUICKLY I COULDN'T IDENTIFY WHICH ONE IT WAS.  FROM THE LOCATION ,I BELIEVE IT WAS EITHER THE ABS OR VSA WARNING LIGHT. I TOOK THE VEHICLE TO MY LOCAL DEALER, BUT THEY WERE UNABLE TO FIND AN ISSUE OR RECREATE THE PROBLEM.     \"CUSTOMER STATES BRAKES LOCKED UP AND WARNING LIGHT CAME ON THE DASH.  COULD NOT REPRODUCE CONCERN AT THIS TIME. NO CODES STORED IN PCM OR BRAKING SYSTEM.\"     AS YET THE PROBLEM HAS NOT RECURRED.  HOWEVER, WHEN I RESEARCHED THE PROBLEM ONLINE, I FOUND NHSTA RECALL REPORT 16V-888 WHICH DESCRIBED THE PROBLEM EXACTLY AS IT OCCURRED, BUT DID NOT INCLUDE MY VIN IN THE RECALL.",
        "vin": "5FPYK2F53HB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "02/04/2019",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176124,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 4TH, 2019, I PARALLEL PARKED MY VEHICLE AT 9AM ON THE STREET. AT ABOUT 4PM THAT DAY, THE FIRE DEPARTMENT NOTIFIED ME THAT MY 2017 HONDA RIDGELINE WAS ON FIRE.  MY RIDGELINE WAS STATIONARY, PARKED ON THE STREET, AND IT WAS A RAINY DAY.  THE FIRE FIGHTER TOLD ME THE FIRE STARTED UNDER THE HOOD IN THE ENGINE AREA.  THE RIDGELINE WAS TOWED TO A HONDA DEALERSHIP IN HOPES OF FINDING THE CAUSE OF THE SPONTANEOUS FIRE.    THE HONDA DEALERSHIP DID NOT EVEN OPEN THE VEHICLE AND WOULD NOT DIAGNOSE THE CAUSE OF THE SPONTANEOUS FIRE.      THIS IS VERY DANGEROUS BECAUSE THE SPONTANEOUS FIRE CAN HARM AND POTENTIALLY KILL PEOPLE INSIDE OR AROUND THE VEHICLE AS WELL AS HARM NEARBY BUILDINGS.  THIS IS ALSO NOT THE FIRST 2017 HONDA RIDGELINE TO HAVE THIS SAME ISSUE.",
        "vin": "5FPYK3F76HB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/04/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155915,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS REALLY SPONGY BRAKES.  I TOOK TO THE DEALER AND THEY DID NOT LOOK AT IT, THEY SAID THEY WERE COMPARABLE TO THE OTHER ONES.  PEDAL GOES TO THE FLOOR FAIRLY EASILY AND I'M NOT SURE IF IT WILL EMERGENCY STOP.  EVERY OTHER CAR I HAVE DRIVEN TYPICALLY HAS NO MORE THAN 2 INCHES OF PEDAL TRAVEL.",
        "vin": "5FPYK3F67HB"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "10/19/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142740,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE PRECISE MOMENT THE ODOMETER HIT 12000 MILES, THE VEHICLE LOST POWER, ALL THE WARNING LIGHTS LIT UP AND ROLLING LIST OF PROBLEMS, INVOLVING, HILL CONTROL, POWER STEERING, ETC.. CAME ON.  EVEN AFTER SHUTTING IT OFF AND TURNING IT BACK ON MULTIPLE TIMES THE CONDITION DID NOT  CHANGE.  HONDA  HAD IT TOWED TO THE DEALER.  AFTER A DAY THEY COULD NOT FIND THE PROBLEM EXCEPT  TO SAY IT WAS A LOW VOLTAGE ISSUE.. SEEMED TO COINCIDENTAL THAT IT HAPPENED AT EXACTLY 12000 MILES AND I STATED AS MUCH.  THEY RESET EVERYTHING AND IT HAS BEEN OK FOR LAST 150 MILES.",
        "vin": "5FPYK2F53HB"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141809,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JUDDERING WHILE GOING 32-39MPH. MOST OBVIOUS WHILE TAKING A LOOPING EXIT RAMP GOING UPHIL AND TRYING TO MAINTAIN 35MPH. IT ALSO APPEARED ON AND OFF WHILE GOING UPHILL ANYWHERE FROM 20-50MPH. DURING THIS TIME IT WAS ALSO HAVING SHIFTING ISSUES, NOT BEING ABLE TO FIND THE CORRECT GEAR, ALONG WITH JUDDERING.    I HAD PREVIOUSLY GONE IN FOR A NOISY TRANSMISSION, AND THEY DID THE TRANSMISSION COMPUTER UPDATE. THEN AFTER THIS ISSUE AROSE, THEY DID A TRANSMISSION FLUID FLUSH. THIS APPEARS TO HAVE FIXED THE ISSUE.",
        "vin": "5FPYK3F40HB"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/22/2018",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133348,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 HONDA RIDGELINE. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, IT CAUGHT ON FIRE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE AND A FIRE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO AN INSURANCE TOW LOT. THE CONTACT CALLED FRIENDSHIP HONDA AT (828) 264-6006 (LOCATED AT 1440 BLOWING ROCK RD, BOONE, NC 28607) AND JENKINS HONDA OF LEESBURG (LOCATED AT 8865 US-441, LEESBURG, FL 34788, (352) 815-2482), BUT NO ASSISTANCE WAS OFFERED. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OPENED CASE NUMBER: 09006658. THE APPROXIMATE FAILURE MILEAGE WAS 21,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "10/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133364,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HONDA RIDGELINE. THE CONTACT STATED THAT THE SUN ROOF EXPLODED WITHOUT WARNING AND THE GLASS SHATTERED. THE SLIDER WAS CLOSED WHEN THE FAILURE OCCURRED AND PREVENTED GLASS FROM ENTERING THE VEHICLE. THERE WERE NO INJURIES. THE DEALER (KENDALL HONDA OF FAIRBANKS, 1000 CADILLAC CT, FAIRBANKS, AK 99701, (855) 981-5607) RECOMMENDED THAT A DIAGNOSTIC APPOINTMENT BE SCHEDULED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 13,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/29/2018",
        "dateOfIncident": "07/25/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114437,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ASSISTS BRAKE SLAMMED ON MY BREAKS WHILE I WAS TURNING THROUGH AN INTERSECTION NEARLY CAUSE A REAR END COLISION.   THIS HAPPENED FOR NO REASON",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "12/19/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092736,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2017 HONDA RIDGELINE TRUCK WHEN PUT IN REVERSE FROM DRIVE (STOP POSITION) THE VEHICLE WOULD GO FORWARD NOT BACKWARDS. AFTER ONE MONTH THE TRANSMISSION FAILURE LIGHT CAME ON AND HONDA DEALERSHIP REPLACED THE ENTIRE TRANSMISSION.  THEY REPLACED THE ENTIRE TRANSMISSION WITH A REMANUFACTURED TRANSMISSION.  THE DAY AFTER TRANSMISSION REPLACEMENT THE SHIFT POSITION SHIFTER ON THE REMANUFACTURED TRANSMISSION SWITCH WENT BAD AND WAS REPLACED.  THE VEHICLE CONTINUES TO DOWNSHIFT ODDLY WHEN FOOT IS TAKEN OFF ACCELERATOR. THIS IS WITH THE REPLACED REMANUFACTURED TRANSMISSION ON MY 4 MONTH OLD VEHICLE.  THIS VEHICLE DOES NOT DRIVE LIKE A NORMAL NEW CAR. THE VEHICLE ALSO HAS A VERY LOUD WIND NOISE COMING FROM BOTH DRIVER AND PASSENGER DOOR WHEN DRIVING AT A HIGH RATE/FREEWAY.  DEALERSHIP SAYS NO PROBLEMS EXIST IF A LIGHT DOES NOT COME ON TO SAY FAILURE THEN EVERYTHING IS OK.  THE DEALERSHIPS DO NOT COMPLETELY DOCUMENT WHAT THE PROBLEMS ARE WHEN YOU TAKE IT IN FOR REPAIRS.  NO CONSOLIDATION OF INFORMATION FROM HONDA TO REPORT PROBLEMS FROM MULTIPLE CONSUMERS.  I HAVE SPENT HOURS/DAYS AT THE DEALERSHIP REGARDING THIS NEW VEHICLE AND THE PROBLEMS HAVE NOT BEEN RESOLVED.   I HAVE NUMEROUS REPAIR ORDERS, E-MAILS, LETTERS AVAILABLE UPON REQUEST.  THANK YOU.",
        "vin": "5FPYK2F63HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092386,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LISTENING TO SIRIUS RADIO WITH THE TRUCK BED AUDIO ON. I COULD NOT TURN OFF TRUCK BED AUDIO. THE OFF BUTTON HAD NO EFFECT. I COULD NOT FIGURE OUT HOW TO TURN OFF THE AUDIO COMPLETELY. I DROVE TO STORE A FEW MILES AWAY. I TRAVELED AT 70 M/H. TRUCK BED AUDIO STILL ON. I TURNED OFF THE VEHICLE TO GO IN STORE, RETURNED, AND TRUCK BED AUDIO STILL ON. I TRAVELED 5 MORE MILES AT 80 M/H AND TRUCK BED AUDIO STILL ON. WHEN I VIEWED THE HOME SCREEN TRUCK BED AUDIO WAS GRAYED OUT. I PUSHED EVERY BUTTON I COULD FIND AND FINALLY WHEN PARKED, AT A DRIVE THROUGH, IT TURNED OFF. I DO NOT RECALL THE SEQUENCE OF BUTTONS I PUSHED. ANYWAY, NOT SURE IF IT WAS THE BUTTON PUSHING THAT FINALLY ENDED THE EVENT. I AM NOW AFRAID TO USE THE TRUCK BED AUDIO. I AM AFRAID IF I CANNOT TURN IT OFF IT WILL RUN DOWN MY BATTERY.",
        "vin": "5FPYK3F78HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/04/2018",
        "dateOfIncident": "06/25/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083328,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON PAGE 32 OF THE RIDGELINE OWNER'S MANUAL IT STATES THAT THE FOB WILL LOCK THE TAILGATE.  THE TAILGATE DOES NOT LOCK.  THE CAVITY IN THE BED LOCKS BUT NOT THE TAILGATE.  I HAVE A CAP ON THIS VEHICLE YET CANNOT SECURE VALUABLES IN THE BED OF THE TRUCK.  WILL IT TAKE A LAWSUIT FOR PROPERTY LOSS FOR HONDA TO ADDRESS A FIX ?????  I AM NOT RECOMMENDING THE RIDGELINE TO MY LARGE NETWORK UNTIL THIS IS ADDRESSED.",
        "vin": "5FPYK3F6XHB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "03/18/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080121,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VARIOUS WARNING LIGHTS ARE COMING ON   POWER STEERING. VEHICLE STABILITY. HILL START. EMISSION CONTROLS. HAPPENS AT START AND STAYS ON. GOES OFF. WHEN DRIVING TRANSMISSION FAILED TO UPSHIFT   LIGHTS GO ON BUT EVENTUALLY AFTER A DAY OR TWO GO OFF.",
        "vin": "5FPYK3F60HB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "01/05/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080193,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL FEELS GOOD AT NORMAL DRIVING .  STOPPING IS OK .  BRAKE PEDAL SINKS TO THE FLOOR WHILE  AT A STOP .",
        "vin": "5FPYK3F63HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080295,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO FILL UP GAS DUE TO ICE FORM AND ICE FORM IS DUE TO WATER RETAIN IN THE CAP-LESS GAS FILLER.",
        "vin": "5FPYK3F50HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2018",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RAIN/SNOW WATER LEAKED INTO THE CAP-LESS GAS FILLER NECK.  WATER SETTLES BETWEEN THE OUTER AND INNER FILLER FLAPS.  EXPERIENCED THE WATER FREEZING WHICH PREVENTED THE OUTER FLAP FROM OPENING INWARD.  BECAUSE OF THE ICE BLOCKAGE, WAS UNABLE TO FUEL VEHICLE DURING FREEZING TEMPERATURES.  THE INABILITY TO FUEL THE VEHICLE COULD RESULT IN A LIFE-THREATEN SITUATION WHERE THE VEHICLE IS STRANDED IN FREEZING ENVIRONMENTS.  REQUESTING A RETROFIT TO PREVENT WATER INTRUSION OR TO ALLOW PROPER DRAINAGE.",
        "vin": "5FPYK3F71HB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073116,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS ADAPTIVE CRUISE CONTROL TO REDUCE SPEED BY BRAKING WHEN OTHER  VEHICLES MAY BE STRUCK. UNFORTUNATELY THIS MODELS BRAKES ARE OFTEN APPLIED WHEN THE RADAR DETECTS OTHER TRAFFIC WHICH WILL NOT BE A FACTOR; I.E. A SECOND CAR HAS LEFT THE INTERSTATE AND IS SLOWING TO STOP BEFORE TURNING ON A SECONDARY ROAD.  MY VEHICLE WILL BRAKE REGARDLESS WHETHER A THIRD VEHICLE IS CRUISING A HIGHWAY SPEED BEHIND ME.  SIMILARLY IF I AM MOVING WITH TRAFFIC IN THE CENTER LANE AND OVERTAKING AN 18 WHEELER ON THE RIGHT MOVING 10+ MILES SLOWER.  MY VEHICLE WILL BRAKE TO MATCH THE SPEED OF THE TRUCK REGARDLESS OF THE SPEED OR PROXIMITY OF VEHICLES BEHIND ME. THE MANUFACTURER ADVISES THIS IS MY VEHICLES DESIGN AND NO FIX OR MODIFICATION IS NEEDED.  THIS HAS BEEN AN ISSUE REPORTED TO MULTIPLE DEALERS SINCE ABOUT 5000 MILES.   HI HOW",
        "vin": "5FPYK3F75HB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072976,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC PARTS ON MY VEHICLE ARE BUCKLING AND MELTING, INCLUDING THE TRIM ON THE WINDOWS, THE FRONT BUMPER, THE WHEEL WELL AND REARVIEW MIRRORS.  HONDA REPLACED THESE PARTS ONCE AND THEY STARTED TO BUCKLE AND WRINKLE THE VERY NEXT DAY. HONDA SAYS THAT IT'S BECAUSE OF UV REFLECTIVE MATERIAL ON MY NEIGHBORS' WINDOWS REFLECTING LIGHT ONTO MY VEHICLE, BUT NONE OF THE OTHER CARS ON MY STREET HAVE THIS PROBLEM.  IT DOESN'T SEEM TO MATTER WHERE I PARK MY CAR (STREET, MY DRIVEWAY, NOT NEAR ANY WINDOWS)..THIS HAPPENS AND GETS WORSE AS THE DAYS GO ON. HONDA SAYS THE SAME THING IS HAPPENING TO THEIR CARS AT HONDA HQ...BUT WON'T TAKE RESPONSIBILITY FOR HAVING THE MATERIAL IN THESE PARTS CHANGED TO SOMETHING WHICH DOESN'T MELT. THIS IS A BRAND NEW CAR....... I COVERED THE MELTING PARTS IN REFLECTIVE TAPE IN HOPES OF STOPPING THIS DAMAGE. THE ATTACHED PHOTO SHOWS THE REFLECTIVE TAPE, WHICH IS WHERE THE MELTING IS HAPPENING ON THE REPLACEMENT PARTS. HONDA SAYS THIS IS HAPPENING WHEN MY VEHICLE IS PARKED.",
        "vin": "5FPKY2F42HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071874,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAPLESS FUEL / GAS FILLER SYSTEM FREEZES IN WINTER AND DOES NOT ALLOW FOR VEHICLE TO BE FUELED AT GAS STATION. HAIR DRYER NEEDED TO BE USED FOR 3-5 MINUTES TO THAW THE DOOR AND THEN A SCREW DRIVER USED TO PRY IT OPEN. PICTURES OF REMAINING ICE ARE ATTACHED",
        "vin": "5FPYK3F63HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "04/03/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071747,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAPLESS FUEL FILLER ALLOWS WATER TO COLLECT BETWEEN THE OUTER DOOR AND THE INNER DOOR OF THE FILLER NECK.  APPROXIMATELY 15ML OF WATER COLLECTS IN THIS AREA AFTER ANY RAINFALL.  THE WATER ENTERS THE TANK WHEN THE FUEL NOZZLE IS INSERTED.  WATER IN THE FUEL SYSTEM CAN CAUSE VEHICLE PERFORMANCE PROBLEMS AS WELL AS MAINTENANCE CODES WHICH  REQUIRE DEALER SERVICE TO REPAIR.  IN COLD CLIMATES, THE WATER FREEZES PREVENTING FUELING OF THE VEHICLE.  THIS SITUATION HAS HAPPENED TO ME TWICE ALREADY THIS WINTER, ONE TIME REQUIRED THE VEHICLE TO STAY INSIDE UNTIL THE ICE MELTED AND THE WATER COULD BE EXTRACTED.",
        "vin": "5FPYK3F70HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2018",
        "dateOfIncident": "01/13/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071643,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NEEDED GAS IN SUB-ZERO TEMPERATURES AND COULD NOT INSERT THE GASOLINE NOZZLE INTO THE CAP-LESS FUEL FILLER.  THERE WAS A CHUNK OF ICE BETWEEN THE OUTER DOOR AND INNER DOOR PREVENTING INSERTION OF THE NOZZLE.  I HAD TO FORCE THE OUTER DOOR OPEN WITH THE NOZZLE TIP AND BREAK UP THE ICE WITH THE NOZZLE BEFORE I COULD INSERT TO REFUEL.  THE AREA BETWEEN THE OUTER DOOR AND INNER DOOR IS PRONE TO ACCUMULATION OF WATER DURING HEAVY RAIN OR CAR WASHES.",
        "vin": "5FPYK3F75HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "01/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061586,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A SNOW STORM CAPLESS FUEL FILL FROZE. WAS UNABLE TO INSERT FUEL NOZZLE TO FILL TANK.",
        "vin": "5FPYK3F7HB0"
    },
    {
        "components": "STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "12/29/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061084,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL DOOR FREEZING SHUT. WATER GETTING IN FUEL NECK AND FREEZING. UNABLE TO PUT FUEL IN VEHICLE BECAUSE OF THIS. MANY PEOPLE MAY TRY TO HEAT THIS WITH OPEN FLAME OR HEATING ELEMENT AND CAUSE SAFETY ISSUE.",
        "vin": "5FPYK3F83HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKS IN TO THE CAPLESS FUEL FILLER AND FREEZES CREATING AN ICE DAM THAT PREVENTS FUELING THE VEHICLE.",
        "vin": "5FPYK3F79HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/19/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058437,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH CAP LESS FUEL FILLER SYSTEM. WATER ENTERS FILLER AREA EITHER FROM RAIN OR CAR WASH. IN COLD WEATHER, WATER FREEZES AND YOU CANNOT GET GAS FILLER PUMP INTO CAP LESS FILLER TUBE IN VEHICLE AS ICE FORMS BLOCKING ENTRY. VEHICLE OWNER IS LIKELY TO USE SOME FORM OF HEAT TO MELT THE ICE, WHICH COULD RESULT IN A FIRE OR EXPLOSION HAZARD. MY VEHICLE WAS STATIONARY WHEN THIS HAPPENED, AT A GAS STATION. IT HAS OCCURRED ON TWO OCCASIONS.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058452,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ICE FORMS BETWEEN THE OUTER FLAPPER AND THE INNER FLAPPER OF THE CAPLESS GAS TANK IN THE FUEL DOOR.  THIS PROHIBITS THE OWNER FROM PLACING THE FUEL NOZZLE INTO THE FILLER NECK TO ADD GASOLINE TO THE VEHICLE.  THIS INCIDENT HAPPENS WHEN OUTDOOR AMBIENT TEMPERATURES REACH FREEZING.  IT IS MORE LIKELY TO HAPPEN WHEN IT SNOWS, RAINS, OR THE VEHICLE IS TAKEN THROUGH A CAR WASH.",
        "vin": "5FPYK3F61HB"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058206,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER INTRUSION IN FUEL FILL COVER",
        "vin": "5FPYK2F50HB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/31/2017",
        "dateOfIncident": "05/15/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057743,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS DEFECTIVE.  OVERHEAT AND CAUSE VEHICLE TO SHAKE.  DEALER SAYS NORMAL. OTHERS ARE REPORTING SAME PROBLEM.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2017",
        "dateOfIncident": "12/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053722,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LACK OF INFORMATION AND ACTION REGARDING THE DEGRADATION OF SOY BASED WIRING INSULATION FROM RODENTS.",
        "vin": "5FPYK3F75HB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "05/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048284,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE REVERSING AND APPLYING BRAKES PADS MAKING CLUNKING NOISE. WHEN SWITCHING INTO DRIVE RIGHT AFTERWARD BRAKES MAKE CLUNKING NOISE AGAIN.  DEALER CONTINUES TO LUBRICATE AND ADJUST BUT NOISE KEEPS COMING BACK. LOOSE PADS MIGHT BE A SAFETY CONCERN IF THEY FALL OUT OR MOVE AT HIGH SPEED.",
        "vin": "5FPYK3F87HB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047386,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS ARE INADEQUATE. CAN'T SEE FARTHER THAN THREE [3] CAR LENGTHS AHEAD.",
        "vin": "5FPYK3F60HB"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2017",
        "dateOfIncident": "10/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033335,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE APPLIES THE BACK BRAKES AND JERKS THE PASSENGER AND DRIVER INTO THE DASH BOARD. HE'S A VERY QUICK BRAKES WHICH HAPPEN AT SPEEDS RANGING FROM 35 MILES AN HOUR TO 60 MILES AN HOUR IT HAPPENED FOUR TIMES IN A 20 MINUTE  TIMEFRAME. THIS WAS ON OCTOBER 12, 2017 IT WAS LIGHTLY RAINING AT THE TIME. IT IS CURRENTLY AT THE DEALERSHIP WHERE THEY'RE TELLING ME THEY CAN FIND NO ISSUE. THEY ARE KEEPING IT FOR ONE MORE DAY AS TO DRIVE IN THE RAIN.",
        "vin": "5FPYK3F72HB"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032935,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW CRACKED FOR NO REASON. WAS USING THE DEFROSTER AT THE TIME. ENTIRE GLASS PANEL SHATTERED IN PLACE. STOPPED AT A STOP LIGHT SURROUNDED BY TRAFFIC THAT WAS ALSO STOPPED. HEARD WHAT SOUNDED LIKE AN EXPLOSION. REAR WINDOW HAD A CONCAVE AREA ON THE INSIDE WHICH SEEMED TO BE THE EPICENTER OF THE CRACKING. POLICE EXAMINED THE WINDOW AND BED OF TRUCK AND HAD A SIMILAR THEORY. NO FOREIGN DEBRIS IN BED TO INDICATE A ROCK.",
        "vin": "5FPYK3F21HB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024154,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TERRIBLY POOR HEADLIGHT LOW BEAMS ON RTL MODEL.  SCARY TO DRIVE AT NIGHT!  VERY DIFFERENT THAN DEALER DEMO RIDGELINE THAT WE TEST DROVE.",
        "vin": "5FPYK3F54HB"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2017",
        "dateOfIncident": "08/22/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024509,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/22/17 I BROUGHT MY RIDGELINE TO APPLE  HONDA IN RIVERHEAD NY DUE SEVERAL WARNING LIGHTS BEING ACTIVATED.  THE ACTIVATED WARNING LIGHTS ARE AS FOLLOWS: COLLISION MITIGATION, ROAD DEPARTURE MITIGATION, BLIND SPOT INFO SYSTEM, ADAPTIVE CRUISE CONTROL, LANE KEEPING ASSIST, POWER STEERING SYSTEM, VEHICLE STABILITY ASSIST, HILL START ASSIST, TRAILER STABILITY ASSIST. AFTER A QUERY OF YOUR DATABASE I FOUND THAT SIMILAR PROBLEMS HAVE BEEN REPORTED AND AS A RESULT OF THIS THE FOLLOWING NHTSA CAMPAIGN NUMBER 16V888000 WAS GENERATED.  MY CONCERN IS APPLE HONDA IS UNDER REPORTING AND OR NOT REPORT THESE INCIDENT AS REQUIRED.  IN MY SITUATION I WAS TOLD MY PROBLEM WAS A DIRECT RESULT OF A MISSING FUSE C-28.  WHEN RESEARCHED THIS FUSE IS REFERENCED TO OPTION.   MY PROBLEM LAYS AT THE MISSING FUSE. FUSES JUST DONT GO MISSING. AND AS PER MY CONVERSATION WITH THE HONDA SERVICE REP ALEX COSTA TAG # 765 IF THIS FUSE WAS MISSING THE VEHICLE WOULDN'T OPERATE. AGAIN MY PRIMARY CONCERN IS THE MISLABLING OF THIS RECALL AS A MISSING FUSE.",
        "vin": "5FPYK3F87HB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023462,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SETTING THE CRUISE CONTROL AT 70MPH IT WILL ACCELERATE 5MPH",
        "vin": "5FPYK3F50HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/07/2017",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022237,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A BUSY INTERSECTION WITH A VEHICLE IN FRONT OF MINE SIGNALLING TO TURN RIGHT. WHEN THE LIGHT CHANGED THE FORWARD VEHICLE TURNED RIGHT AND AS I PROCEEDED TO ACCELERATE TO GO THRU THE INTERSECTION MY CMS BRAKING SYSTEM APPARENTLY DEPLOYED, SLAMMING ON MY BRAKES AND BRINGING ME TO A JARRING STOP. I PAUSED AND THEN ACCELERATED ON THRU INTERSECTION WITH NO PROBLEM. THERE WERE NO VEHICLES IN FRONT OF ME OR TURNING IN FRONT OF ME WHEN THE BRAKES DEPLOYED SUDDENLY ON THEIR OWN. THIS WAS A BUSY INTERSECTION OF TWO STATE HIGHWAYS IN A SMALL CITY.",
        "vin": "5FPYK3F7XHB"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "08/29/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020663,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW PROBLEM: SINCE MY PURCHASE I'VE HAD PROBLEMS WITH SPONTANEOUS APPLICATIONS OF MY BRAKES SOMETIMES PUTTING ME IN DANGER OF BEING HIT FROM BEHIND. THIS VEHICLE IS EQUIPPED WITH CRASH AVOIDANCE SYSTEM THAT AUTOMATICALLY APPLIES THE BRAKING SYSTEM MY PROBLEM IS THE SYSTEM IS ACTIVATING FOR NO REASON NO WARNINGS JUST FULLY APPLYING THE BRAKES. IF TAKEN IT TO TWO DEALERSHIPS I GET THE SAME RESPONSE FROM BOTH IT ACTING NORMAL NOTHING WE CAN DO. I CALLED HONDA AMERICA OPENED A CASE REPORTED THE PROBLEM WAS TOLD IF I CAN PROVE IT THEY WILL LOOK IN TO IT.  ON A WEB SITE CALLED CAR COMPLAINTS . COM I FOUND A MAN LOCATED IN PA  WHO HAS THE EXACT SAME ISSUE WITH HIS RIDGELINE HE WROTE DOWN NEARLY WORD FOR WORD WHAT I COMPLAINED TO HONDA ABOUT THEY TOLD HIM THE SAME THING THEY TOLD ME PROVE IT. HOW DOES ONE PROVE THAT THERE IS A GLITCH IN THERE SYSTEM, I ASKED IF THEY COULD RECALIBRATE IT THEY REPLIED NO WE HAVE NO MEANS TO DO THAT. THE SYSTEM ON ITS OWN REACT TO SOME ON COMING CARS THAT ARE POSING NO DANGER AND FULLY APPLIES THE BRAKES I WAS NEARLY RUN OVER BY A SEMI TRUCK FOLLOWING TO CLOSE WHEN THE SYSTEM FALSELY DETECTED DANGER AND WITHOUT WARNING FULLY BRAKED LOWERING MY TRAVEL SPEED FROM 65MPH TO 35MPH IN JUST SECONDS GIVING THE DRIVERS FOLLOWING YOU ZERO REACTION TIME. SOMEONE IS GOING TO GET KILLED OVER THIS DEFECT IN THIS SYSTEM. HONDA CLAIMS THAT IN THERE FULL VERSION OF THE OWNERS MANUAL IT DESCRIBES HUNDREDS OF THINGS THAT CAN CAUSE THE SYSTEM TO ACT THIS WAY FROM A FLY TO RAIN, SHADOWS ETC. THEREFORE THEY HAVE DISCLOSED  AND THEY ARE NOT AT FAULT, OF COURSE THAT MANUAL IS ONLY GIVEN TO CUSTOMERS WHO REQUEST IT, IT'S NOT THE SAME MANUAL THAT COMES WITH THE VEHICLE THIS IS CRIMINAL AND THEY NEED TO BE HELD ACCOUNTABLE PLEASE HELP BEFORE DEATH OCCURS. WHEN THIS OCCURS THE STEERING BECOMES AND UNCONTROLLABLY MY MOTHER BEEN WITH ME3 TIMES WHEN IT HAS HAPPENED",
        "vin": "5FPYK3F81HB"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "07/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016111,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK HAS A VERY NOTICEABLE CLUNKING SOUND IN FRONT OF VEHICLE WHEN GOING OVER BUMPS. SOUND STARTED AROUND 1500 MILES.  DEALER SAID IS WAS MOST LIKELY THE BRAKE PADS AS THERE IS A TSB OUT.  THEY DIDN'T BOTHER TO CHECK AND SEE IF THE STRUTS WERE DEFECTIVE.  THIS NEW TRUCK SOUNDS LIKE IT HAS 100,000 MILES ON IT.  I'M VERY CONCERNED ABOUT THE SAFETY OF THIS VEHICLE WITH THESE TYPES OF NOISES COMING FROM THE SUSPENSION/BRAKES.",
        "vin": "5FPYK2F60HB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11015627,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A ONE HI WAY MY PREVENTION SYSTEM DETECTS AND ON COMING CAR IN ITS OWN LANE PERFECTLY LEGAL AND FULLY APPLIES THE BRAKING SYSTEM WITHOUT WARNING OR CAUSE THEN AND AUDIBLE WARNING AND YELLOW LIGHT ON THE DASH TELLING ME TO BRAKE, THE STEERING BECOMES STIFF AND VIBRATES AND HARD TO CONTROL. MEANWHILE THE SPEED OF 65 HAS DROPPED TO 30 MPH AND THE SEMI DIESEL TRUCK BEHIND YOU IS ABOUT TO RUN OVER YOUR CAR ALL THIS HAPPENS WITHIN SECONDS NOT GIVING ME ANYTIME TO REACT VERY DANGEROUS I'VE OPENED A CASE WITH HONDA AMERICA BUT THEY NEED ME TO PROVE IT MY STATEMENT ALONE IS NOT GOOD ENOUGH. I TOOK THE TRUCK TO STOCKTON HONDA DEALERSHIP THEY HAD IT FOR TWO DAYS NEVER TEST DROVE IT RETURNED TO ME SAID THERE IS NO PROBLEM.  MY MOTHER OF 90 YEARS HAS BEEN HURT BY THE SEAT BELT SUDDENLY TIGHTENING WHEN THE BRAKES ARE FULLY APPLIED THIS PROBLEM HAS OCCURRED OVER A DOZEN TIMES SOMEONE IS GOING TO GET HURT OR KILLED BECAUSE HONDA MOTORS IS WASHING THERE HANDS OF IT BY MAKING ME PROVE IT SOMETHING IS NOT CALIBRATED CORRECTLY AND NO DEALERSHIP HAS THE TOOL OR TECHNOLOGY TO VERIFY THIS TYPE OF PROBLEM. THIS SITUATION OCCURS ON STRAIGHT, CURVES AND HILLS YOU JUST NEVER KNOW WHEN IT'S NERVE RACKING DRIVING ALWAYS TRYING TO STAY A SAFE DISTANCE IN FRONT OF THE TRUCK BEHIND YOU. SOMETIMES THOSE TRUCKS ARE WITHIN FOUR CAR LENGTHS AT 60 MPH CAN YOU HELP OR DO WE NEED TO BECOME ANOTHER  STATISTIC BEFORE ANYTHING IS DONE !      THIS TECHNOLOGY HAS BEEN DEVELOPED TO FAST WITHOUT TESTING IT TO ITS FULLEST ABILITY  NOW THERE'S NO WAY TO  DIAGNOSE IT. THIS STARTED THE WEEK I BOUGHT IT NEW IN MAY 2017",
        "vin": "5FPYK3F81HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013509,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE SOME MAJOR ELECTRICAL ISSUES GOING ON WITH THIS VEHICLE.  THE TAILGATE LOCKS AND WILL NOT OPEN SO WE ARE NOT ABLE TO ACCESS THE BED OF THE TRUCK OR THE TRUNK IN THE BED.  ALSO, THE VEHICLE LOCKS ITSELF OCCASIONALLY EVEN WITH THE KEY INSIDE.  THE USB / PLUGS IN THE BACK SEAT OF THE VEHICLE DO NOT WORK.  THE DEALER DID A DIAGNOSTIC ON THE VEHICLE AND FOUND MULTIPLE FAULTS.  THEY RESET THE SYSTEM BACK IN JUNE HOWEVER THE PROBLEM HAS STARTED AGAIN.  NOW WE ARE NOT ABLE TO USE THE TAILGATE AT ALL.",
        "vin": "5FPYK3F75HB"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993767,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY TRUCK IN SEVERAL TIMES DUE TO THE SEVERE HOOD SHAKING WHEN PASSING LARGE TRUCKS ON TWO LANE ROADS AND ON WINDY DAYS.  I HAVE HAD TO STOP AND VERIFY THAT THE HOOD WAS CLOSED DUE TO THE HOOD LIFTING ON EACH SIDE AND FEAR THAT THE HOOD WAS GOING TO FLY OFF AND KILL ME AND MY FAMILY.  ON NON WINDY DAYS, THE TRUCK HAS NO PROBLEMS BUT JUST LET THE WIND KICK UP AND I FEAR FOR MY LIFE.  HAS CALLED HONDA CUSTOMER SERVICE AND NO RESULTS AND THE DEALER STATES DUE TO NO RECALL, REPAIRS CAN NOT BE MADE. I WENT ON THE INTERNET AND THERE ARE MANY COMPLAINTS FOR THE HONDA RIDGELINE AND PILOT , WHICH IS THE SAME HOOD.",
        "vin": "5FPYK3F62HB"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "05/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991375,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I DO NOT OWN A HONDA RIDGELINE 2017 MODEL YET, BUT I TEST DROVE ONE AND OBSERVED THAT THE EMERGENCY BRAKE IS RIGHT UP AGAINST MY SHIN BONE AND WHEN I BRAKE HARD IT HITS MY SHIN BONE, I FEEL LIKE IN AN ACCIDENT IT MIGHT CAUSE SERIOUS INJURY TO THE LEFT LEG. I WISH SOMEBODY LOOK AT THE SAFETY OF THIS AND FIX IT SO I CAN BUY ONE",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2017",
        "dateOfIncident": "04/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983711,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2017 HONDA RIDGELINE IN SEPTEMBER.  THE VEHICLE CURRENTLY HAS FEW THAN 2000 MILES.  I STARTED IT UP THE OTHER DAY AND RECEIVED A DASHBOARD WARNING ABOUT A GAS-GAUGE MALFUNCTION.  I DIDN'T THINK MUCH OF IT.  I GOT TWO BLOCKS FROM MY HOME AND THE POWER STEERING STOPPED WORKING.  WITHIN A MINUTE I RECEIVED WARNINGS ABOUT TRACTION CONTROL AND ABS MALFUNCTIONS.  THE CAR THEN STALLED.  THE VEHICLE RESTARTED AND I STARTED HOME AND IT STALLED AGAIN IN THE MIDDLE OF AN INTERSECTION. IT WAS VERY UN-NERVING. I HAD THE CAR TOWED TO BABYLON HONDA LOCATED IN WEST BABYLON, NY.  THEY CALLED ME A FEW DAYS LATER AND INFORMED ME THAT A RODENT HAD EATEN THE WIRING HARNESS.  I WAS LOOKING AT OVER $1800 IN DAMAGES NOT COVERED BY THE WARRANTY.  A MECHANIC FRIEND OF MINE TOLD ME ABOUT AN ISSUE WITH HONDA'S INVOLVING RODENTS AND THEIR ELECTRICAL HARNESSES.  HE SENT ME AN ARTICLE FROM NBC NEWS REPORTING ON THE ISSUE.  HONDA IS NOW COATING THE HARNESS WITH A SOY BASED COVERING.  IT ATTRACTS RODENTS.  MY TRUCK NOW HAS A NEW \"EDIBLE\" SOY-BASED WIRING HARNESS.  MANY HONDA OWNERS ARE COMPLAINING THAT THEIR VEHICLE END UP BACK AT THE DEALERSHIP FOR YET ANOTHER HARNESS.  THIS SEEMS TO PUT THE DRIVER'S AT RISK OF AN ACCIDENT OR FIRE.  HONDA CLAIMS THEY DON'T HAVE AN ISSUE.  SOME HONDA OWNERS HAVE HAD LUCK USING AN \"ANTI-RODENT TAPE\" WHICH WRAPS AROUND THE HARNESS.  INTERESTINGLY ENOUGH THE TAPE IS SOLD BY HONDA AN IS AN ACTUAL HONDA PART.  MY DEALER WOULDN'T PUT IT ON.  I WANT TO KNOW IF I'M SAFE IN MY TRUCK.  HERE'S A LINK TO THE NBC ARTICLE.  I'VE ALSO ATTACHED A COPY.  HTTP://WWW.NBCNEWS.COM/BUSINESS/AUTOS/HONDA-S-SOY-BASED-WIRING-COVERS-IRRESISTIBLE-RODENTS-LAWSUIT-N504746",
        "vin": "5FPYK3F70HB"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970839,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGER OBJECT APPROACHING WARNING SYSTEM GOES OFF WHEN WET WHEN NOTHING IS APPROACHING. OCCURS AFTER VEHICLE HAS BEEN SETTING IN RAIN AT LOW SPEED. OCCURRENCE IS INCONSISTENT. NOT EVERY TIME IT RAINS. SOMETIMES AFTER GOING THROUGH CAR WASH TUNNEL. I'VE TALKED TO HONDA CUSTOMER SERVICE AND CARRIED TO DEALER 5 TIMES. THEY CANNOT FIND THE CAUSE.  WHEN THIS IS OCCURRING WHILE DRIVING YOU DON'T KNOW WHEN YOU WILL BE STUCK OR IF YOU SHOULD DRIVE OR STOP MOVING. IT IS A GREAT DISTRACTION.  DEALER SAID THEY GOT IT TOHAPPEN ONE TIME BUT CANNOT FIN ROOT CAUSE.  DEALER SAID HONDA ENGINEERING REPORTED PROBLEMS WITH WARNING SYSTEM ON SOME PILOT VEHICLES.  ONE CALL TO HONDA CUSTOMER SERVICE WAS IN THE RAIN AND THE HONDA REPRESENTATIVE COULD HEAR THE SYSTEM GOING OFF AS I WAS DRIVING.  HONDA DOES NOT APPEAR TO BE CONCERNED.",
        "vin": "5FPYK3F74HB"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/11/2017",
        "dateOfIncident": "03/10/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960142,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON INTERSTATE, WARNING LIGHTS CAME ON AWD MALFUNCTION, THEN  BRAKE SYSTEM MALFUNCTION. I EXITED THE INTERSTATE, AND AT THE END OF THE RAMP AFTER COMING TO COMPLETE STOP, WARNING THE OBJECT WAS APPROACHING, BUT I WAS STATIONARY, AND THERE WERE NO OBJECTS IN THE PATH OF THE VEHICLE",
        "vin": "5FPYK3F80HB"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/06/2017",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949947,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE INSIDE OF THE HEADLIGHT LENS ASSEMBLY, THERE IS DUST/DIRT/DEBRIS PROBABLY OCCURRING DURING MANUFACTURE/STORING/SHIPPING/AND OR ASSEMBLY THAT I CAN NOT GET HONDA TO TAKE SERIOUSLY. THE LAST I WAS TOLD WAS BY MY CASE MANAGER KATHRYN EXT.#117742 THAT THE OWNER OF FERNDALE HONDA ( CHARLIE ) PULLED A BRAND NEW ONE INTO THE SHOP AND IT TOO HAD THE SAME DEBRIS. KATHRYN SAID \"WELL IT MUST BE STANDARD THEN\". ANYTHING THAT TAKES AWAY FROM A VEHICLES LIGHTING ABILITY CAN NOT BE A GOOD THING AND I CAN NOT SEEM TO GET THEM TO CARE OF IT ON MY OWN. WHAT I WOULD LIKE ARE THESE LENSES CLEANED ON THE INSIDE OR NEW ONES INSTALLED BUT ACCORDING TO THEM, THEY WILL COME EXACTLY LIKE THE ONES I HAVE ON. MY HONDA CASE # IS 05025973, AGAIN MY CASE MANAGER IS KATHRYN EXT# 117742 AT 1 800 999-1009 THE FACTORY REP. ( WILLIE ) HAS STOOD ME UP TWICE AT THE DEALERSHIP AND THE LAST TIME TOLD ME TO TELL THE DEALER TO REPLACE WHAT I WOULD LIKE BUT THE DEALERS OWNER ( CHARLIE ) 21350 WOODWARD AVE.(FERNDALE HONDA) FERNDALE,MICHIGAN 1 248 548-6300 WAS AFRAID THAT IF WILLIE DID NOT ORDER IT, THAT HONDA WOULD NOT PAY. I EVEN CALLED KATHRYN AGAIN AND TOLD HER THIS AND SHE SAID SHE WOULD HAVE THE FACTORY REP. ( WILLE ) CALL ME AND SET UP A NEW APPOINTMENT. IT HAS BEEN OVER TWO MONTHS SINCE I HAVE BEEN BACK TO THE DEALER AND AM STILL WAITING FOR WILLIE TO CALL. THE OWNER ( CHARLIE AGREES WITH ME THAT THE DEBRIS IS ON THE INSIDE OF THE LENS AND IT IS NOT RIGHT BUT HIS HANDS ARE TIED. MAYBE IF YOU PEOPLE THERE THINK DEBRIS ON THE INSIDE OF A NEW VEHICLES LENS IS A BAD THING, MAYBE THEY MIGHT LISTEN TO YOU. I JUST WANT THE LIGHTS AS BRIGHT AS POSSIBLE FROM THE FACTORY AND THIS CAN NOT BE AS BRIGHT AS THEY COULD GET, FREE OF DEBRIS I WOULD THINK WOULD BE AS BRIGHT AS THEY COULD GET BUT THAT IS JUST MINE AND CHARLIE'S OPINION SO FAR. THIS HAS BEEN ONGOING SINCE 08/17/2016 I BELIEVE. THANK YOU FOR YOUR TIME",
        "vin": "5FPYK3F43HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SITTING FOR TWO HOURS, IN WET SLUSHY CONDITIONS CAME OUT TO START THE CAR, DASH LIGHTS (WARNING ICONS) FLASHING AT VERY HIGH RATE OF SPEED. DOME LIGHTS BARELY ON VERY DIM LIGHT CAR HAD A EXTREME POWER DRAW (SHORT). WOULD NOT START AND COULD NOT GET ANYTHING TO WORK BUT DOOR LOCKS FROM INSIDE OF THE VEHICLE, FOB WOULD NOT DO ANYTHING. HONDA ROADSIDE CALLED AND VEHICLE TOWED TO DAVID HOBBS HONDA. WHEN REMOVED FROM THE TOW TRUCK VEHICLE STARTED AND WORKED AS IT SHOULD, DEALER FOUND NOTHING WRONG, KEPT IT AND SECOND DAY AND FOUND NOTHING WRONG AND HAD ME PICK IT BACK UP. WAS TOLD WHEN IT HAPPENS AGAIN CALL US. NOT HAPPY WITH UNRELIABLE 2017 HONDA RIDGELINE!!!! I FEEL IT IS LIKELY THE SAME ELECTRICAL DRAW CAUSED BY YOUR RECALL FOR UNDER TRUCK BED ELECTRICAL HARNESS THAT I HAD TO INFORM DEALER ABOUT, BUT WAS TOLD NOTHING CAN BE DONE UNTIL HONDA SENDS ME A  RECALL LETTER AND THEY ARE NOT ALLOWED TO CONTACT HONDA TO REPORT THE CONDITION.   I THINK BY VIN IS NOT INCLUDED IN YOUR RECALL, BUT BELIEVE ITS ONLY BECAUSE OTHERS HAVE NOT REPORTED THIS TYPE IF ISSUE YET!  VEHICLE SITTING IN PARKING LOT, WHEN I ATTEMPTED TO START AND THAT IS WHEN ISSUE CAME TO BE. I HAVE ABOUT 7000 MILES ON IT NOW.  *TR",
        "vin": "5FPYK3F50HB"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917523,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AWD HARNESS THAT HOOKS UP TO THE DIFFERENTIAL DOES NOT SEAL PROPERLY AND LETS IN WATER. THE WATER SHORTS OUT THE ELECTRICAL SYSTEM AND SHUTS DOWN ANTI-LOCK BRAKES, VSA, BLIND SPOT MONITORING AND CROSS TRAFFIC, BLIND SPOT DETECTION. THE VEHICLE IS NOT SAFE TO OPERATE AT THIS POINT AND MAY CAUSE INJURY.",
        "vin": "5FPYK3F87HB"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "09/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903899,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS COLLISION AVOIDANCE BREAKING BUT I NOTICED A TIME WHEN A COLLISION WAS NOT GOING TO OCCUR AND THE BREAKS WERE APPLIED WITHOUT ME ACTUALLY APPLYING THE BREAKS.  I COULD HAVE BEEN REARENDED IF THERE WAS A CAR BEHIND BE BECAUSE THERE WAS NO NEED TO BREAK.  A CAR WAS A FEW HUNDRED FEET IN FRONT OF ME TURNING RIGHT AT AN INTERSECTION IN MY LANE, AND THEN I WAS TRAVELING ABOUT 35MPH AND GOING STRAIGHT THROUGH THE INTERSECTION.  THE CAR HAD COMPLETED ITS TURN IN FRONT OF ME AND AS I APPROACHED WHERE THE CAR WAS, IT APPLIED THE BREAKS AS IF THE CAR WAS STILL THERE BUT IT HAD PREVIOUSLY CLEARED THE LANE BY 5 SECONDS OR SO.  THERE WAS NO NEED TO BREAK AND CAUSED ME TO BE TO POTENTIALLY BE HARMED BY THAT BREAKING ACTION.  THE CAR SLOWED DOWN TO ABOUT 15MPH BEFORE ALLOWING ME TO CONTINUE.",
        "vin": "5FPYK3F73HB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903421,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TPMS FAILURE LIGHT IMMEDIATELY CAME ON DRIVING FROM THE DEALERSHIP. TOOK IT BACK AND AND AS LEAVING IT CAME ON AGAIN. IMMEDIATELY WENT BACK FOR FIX AND UPON NEARING HOME 25 MILES FROM DEALER IT CAME ON AGAIN. HAD TO TAKE IT BACK FOR A LOANER SO THEY COULD DO A 24 HOUR DIAGNOSIS. NEEDED TO ORDER REAR SUB HARNESS PN 32114-TG7-A00. WAITED 2 WEEKS. HAD THE HARNESS INSTALLED AND APPROXIMATELY 45 MILES LATER THE TPMS ILLUMINATED AGAIN. THIS IS A HARD FAULT THAT STAYS ON UNTIL DEALER RESETS. LIGHT ILLUMINATES EACH TIME WHILE DRIVING ON CITY STREET OR HIGHWAY WHILE IN FWD MOTION.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898590,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SUN VISOR CAME LOOSE WHEN I ATTEMPTED TO ADJUST IT ON THE INTERSTATE.  THE SUN WAS SHINING IN FROM THE LEFT AND I WANTED TO PLACE THE VISOR TO THE LEFT SO THAT THE SUN WOULD NOT SHINE IN MY EYES.  WHEN IT CAME LOOSE IT WAS DANGLING BY THE ELECTRICAL WIRE AND OBSCURING MY VISION TO THE ROAD IN FRONT.  FORTUNATELY I WAS ABLE TO PULL OVER, STOP AND PUSH IT BACK IN PLACE AND LOCK IT WITH THE LOCKING TAB.  IT WILL STAY IN PLACE AS LONG AS IT IS NOT UNSNAPPED FROM THE LOCKING TAB.",
        "vin": "5FPYK2F68HB"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898615,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT A SPEED OF 55MPH THE ENTIRE CAB SHAKES AND IT GOT WORSE AS YOU WENT FASTER WITH THE TWO BACK WINDOW OPEN AND THE FRONT WINDOWS CLOSED. MY HEART RATE FLOW OUT OF CONTROL I THOUGHT I HAD 4 FLAT TIRES. I CONTACTED HONDA AND TOOK IT TO THE SERVICE AREA THEY TOLD ME THAT THAT IS NORMAL. I HAD A 2007 HONDA RIDGELINE FOR 7 YEARS AND THAT WAS NOT A ISSUE. I BELIEVE THEY THIS IS A FLAWS IN THE DESIGN. I HAVE CONTACTED HONDA CORPORATION AND THEY TOO TOLD ME THAT THAT IS THE NORM THEY OFFERED ME 200 $ AND BASICALLY TOLD ME TO DEAL WITH IT. I REFUSED THE OFFER. PLEASE ADVISE ME WHAT I CAN DO THANK YOU",
        "vin": "5FPYK2F69HB"
    }
]