[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2022",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455247,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VTC actuator is beginning to fail. If it catastrophically fails while driving, it could cause bent/seized valves, broken timing chain, broken piston rings, broken piston rods, etc.  If these things were to fail whilst a person is driving at speed, it could cause an accident in which people are killed. At the very least, a failed VTC actuator could cost the vehicle owner several hundreds of dollars to repair or replace.  Honda, Toyota, and other auto manufacturers are aware of this issue as demonstrated by Tech Service Bulletins (TSB) put out by the manufacturers. As an example Honda issued TSB # 16-0188. This TSB clearly identifies the issue, the root cause (VTC actuator failure), and the repair required to remedy the problem.  However, Honda has not yet made a recall in regard to the faulty VTC actuator. They have not even identified what mechanical, or pneumatic process,  causes the problem in the first place. The root cause of the VTC actuator failure might be due to poor oil pressure, bent or weak spring inside the VTC actuator, oil sediment causing the spring or locking mechanism to malfunction, etc. The Honda mechanics merely follow the TSB instructions and replace the VTC actuator and throw away the defective one. Nobody is responsible to dismantle the VTC actuator and determine the root cause of the failure. I've talked to Honda local and corporate levels about this lack of follow-through to locate the root cause, and I've sadly learned there is no process in place to allow for early reporting and ownership/responsibility by Honda Corporate for rectifying and/or keeping the customer from having to pay for an engineering or material defect that might cause catastrophic engine failure.  I talked to the Morristown TN Honda dealership and found that they have serviced several vehicles with failed VTC actuators and that the customer's have paid out of pocket for the repair with no recourse.  I have found that no one us responsible to go back through the supply ch",
        "vin": "Jhmgk5h51hs"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2022",
        "dateOfIncident": "01/23/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The fuel, temperature and time gauges intermittently stop working on my dashboard.  This is dangerous because I could run out of gas.  I looked on the internet and this appears to be a common problem with Honda Fits that many people are experiencing.  Honda should be responsible for replacing these faulty parts.  I’ve seen where people were quoted $800 to replace the gauges.  I haven’t taken it to the dealer because I’m hoping Honda will have to pay for this .",
        "vin": "JHMGK5H52HS"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/22/2021",
        "dateOfIncident": "11/06/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444652,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "After the routine transmission fluid flush at about 36K miles, the vehicle stalls out/jerks after switching the selector from P to D. The issue is intermittent though. Also, the vehicle got a worsened MPG which decreased from 38-39mpg (average) to 31-33mpg on the same driving routine. And most important, the CVT transmission \"switches\" to neutral every time you decelerate making the vehicle unstable at higher speeds. The vehicle was inspected at the two different dealerships and none of those bring out a solution, stating that this is beyond their ability to fix something since no warning lights or messages are being illuminating. Called the manufacturer, got advised to follow up with another dealership.",
        "vin": "JHMGK5H55HS"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/21/2021",
        "dateOfIncident": "11/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441182,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I brought my Honda in to Easy Honda in Spring branch Texas for some electrical problems.  Turned out to be a fuse but I had to wait two extra hours until a mechanic who could use the computer came in.The front tie rod ends are completely shot on a well cared for car after only 17000 miles. And they want $250 to fix it. My son is a licensed mechanic and let me know that on a Honda those should never wear out and even in a GM product they are good for 80,000 miles.  I also had the rubber shield around the oil drain area and I had to cut most of it away so I could drive it.  The service writer said it was unnecessary so they would remove the rest. Well of course they lied and did not.  What is really incredible is after he did what he need to do my gas mileage increased 10%!  So what was wrong before that the computer fixed that I didn't know and still don't.  Everyone their is a BS artist out to rip you off. When Penske owned the dealership it was great now they lie cheat and doubled the prices. I wish there was someone at Honda with a brain and cared about there formerly great reputation I could speak to.",
        "vin": "3hggk5h5xhm"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2021",
        "dateOfIncident": "08/24/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431811,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "At cold start up, the engine rattles loudly for about 2 seconds. This is intermittent and occurs on cold starts when the car has not been started for 6-8 hours.",
        "vin": "3HGGK5H93HM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414066,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DIGITAL ODOMETER, FUEL, MPG, TRIP ODOMETER DISPLAY STOPS WORKING INTERMITTENTLY. THIS IS DANGEROUS BECAUSE I CAN'T TELL HOW MANY MILES ARE ON THE ODOMETER FOR REGULAR SERVICE AND THERE'S NO WAY TO CHECK HOW MUCH FUEL IS IN THE TANK.",
        "vin": "JHMGK5H50HS"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2021",
        "dateOfIncident": "03/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404133,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR'S LCD INSTRUMENT GAUGE, SPECIFICALLY THE ONE CONTAINING THE ODOMETER AND FUEL GAUGE, EITHER DISAPPEARS OR BECOMES A JUMBLED MESS. THE PROBLEM MOST OFTEN OCCURS IN COOL, HUMID TEMPERATURES. DURING COOLER, WETTER MONTHS IT HAPPENS ALMOST EVERY MORNING AND SOMETIMES AT OTHER TIMES OF THE DAY. IT TAKES ABOUT 10-15 MINUTES OF DRIVING AND WARMING UP, SOMETIMES MORE, BEFORE THE PROBLEM FIXES ITSELF AND I CAN SEE THE GAUGE AGAIN. IT HAS BEEN HAPPENING MORE OFTEN AND THE PROBLEM LASTS LONGER AS THE CAR GETS OLDER AND I AM WORRIED IT WILL BECOME PERMANENTLY BROKEN EVENTUALLY. IT IS CONCERNING BECAUSE WITHOUT THE GAUGE I DON'T KNOW HOW MUCH GAS OR RANGE IS LEFT IN THE TANK. I HAVE HEARD OF OTHER FIT OWNERS WHO HAVE EXPERIENCED THE SAME ISSUE.",
        "vin": "JHMGK5H7XHS"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/15/2020",
        "dateOfIncident": "10/29/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383552,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT IS PEELING OFF THE ROOF OF MY 2017 HONDA FIT. I HAVE READ UP ON THIS ONLINE AND IT SEEMS TO BE A VERY COMMON ISSUE. HONDA HAS ALREADY RECALLED THE OTHER WHITE VERSION OF MY CAR FOR THE SAME ISSUE, AND I GOT A LETTER SAYING NOT TO WORRY THAT DOESN'T APPLY TO ME. I HAVE READ FROM OTHERS EXPERIENCES WARRANTYING THEIR HONDA'S FOR THIS ISSUE THAT IT'S A ONE TIME FIX AND ANY FURTHER ISSUES WITH PAINT ARE 100% COMING OUT OF THE CONSUMERS POCKET. HONDA HAS STATED THAT THEY WILL NOT PROVIDE ME WITH A LOANER CAR OR RENTAL CAR IF I PUT MY CAR IN THE SHOP TO GET THIS 'FIXED'. THEIR RESPONSE IS 'THAT THEY CAN'T CONTROL WHAT THEIR DEALERS PROVIDE'.     THANK YOU FOR YOUR ASSISTANCE IN THIS MATTER.",
        "vin": "3HGGK5G52HM"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "09/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366458,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE INCLUDES AN EARTH DREAMS ENGINE, DIRECT INJECTION AND CUT TRANSMISSION. THE VEHICLE HAS AN ABNORMAL VIBRATION AT IDLE WHEN IN PARK, NEUTRAL, OR UNDER LOAD IN DRIVE AT A STOP. SOME COMPONENTS OF THE SUSPENSION ARE NOT ADJUSTABLE AND OUT OF SPEC.",
        "vin": "JHMGK5H51HS"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "06/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350236,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PAINT IS PEELING OFF.",
        "vin": "3HGGK5H57HM"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316428,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2017 HONDA FIT LX.  AS I WAS DRIVING DOWN A DECLINE ON A CITY STREET I WAS TAPPING THE BRAKES TO SLOW DOWN THE VEHICLE TO KEEP IT AT OR UNDER THE SPEED LIMIT.  AS I GOT TO THE BOTTOM OF THE DECLINE THE TRAFFIC LIGHT TURNED RED SO I APPLIED THE BRAKES SIGNIFICANTLY HARDER AND CONSTANT.  AS I BRAKED FOR THE STOPLIGHT THE ENGINE REVVED UP AND I HAD A HARD TIME COMING TO A COMPLETE STOP BEFORE THE STOPLIGHT.  EVEN AT A COMPLETE STOP THE ENGINE WAS REVVING.  I PUT THE CAR IN PARK TO TRY TO STOP THE ENGINE FROM REVVING BUT IT DIDN'T HELP.  THE ENGINE CONTINUED TO REV AT A CONSTANT RATE.  I TRIED TO TAKE THE CAR OUT OF PARK AND PUT IT IN A LOW GEAR TO GET THE SYSTEM TO RESET BUT I COULD NOT GET THE VEHICLE OUT OF PARK.  THE ONLY THING THAT STOPPED THE ENGINE FROM REVVING WAS TURNING THE CAR OFF.  I HAVE NO IDEA WHAT CAUSED THE SUDDEN ACCELERATION OF THE ENGINE AS I STOPPED AND WHY IT CONTINUED IN PARK BUT I FIGURED IF IT HAPPENED TO ME THAT IT COULD ALSO HAPPEN TO SOMEONE ELSE IN THE FUTURE SO IT SHOULD BE REPORTED",
        "vin": "JHMGK5H57HS"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "09/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128836,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT SEAT HEAD RESTRAINTS ARE ANGLED TOO FAR FORWARD. I AM 6 FT TALL AND AM NOT ABLE TO REST MY BACK AGAINST THE SEAT WITHOUT THE HEAD RESTRAINT TOUCH MY HEAD FIRST AND PUSH IT DOWNWARD. THIS IS THE CASE, REGARDLESS OF THE HEIGHT OF THE HEAD RESTRAINT. THE MOST NON-UNCOMFORTABLE POSITION IS WITH THE RESTRAINT COMPLETELY DOWN, BUT AT THAT POSITION, IT IS VERY AWKWARD. I AM CONCERNED THAT IF I AM REAR-ENDED, I WILL GET A CERVICAL COMPRESSION OR RELATED FREAK INJURY DUE TO THE UNNATURAL ANGLING.",
        "vin": "3HGGK5H58HM"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/10/2018",
        "dateOfIncident": "06/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100743,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, ORIGNAL TIRES COME FILLED WITH NITROGEN ON HONDA FIT LEAKING AIR DUE TO DEFECTIVE TIRES HONDA WAS STATIONARY WHEN ALL AIR LEAKED OUT. REGULAR AIR WAS PUT IN ALL TIRES AND CHECKED BY MECHANICS NO NAILS, SLASHES OR ANY PUNCTURES. VEHICLE LOOSES ALL AIR WHEN STATIONED.",
        "vin": "3HGGK5H72HM"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097965,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ROOF PAINT CLEAR COAT SEVERALLY PEELING AND FLAKING. COLOR IS BLUE.",
        "vin": "JHMGE8G22AS"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2018",
        "dateOfIncident": "02/14/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073971,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS BRAND NEW $17K CAR IN AUGUST. I HAVE REPLACED SEVEN TIRES. ALL DIFF WHEELS. ALL DIFFERENT CONTINENTAL TIRES 185/60 15. .BREAKDOWNS ON MY COMMUTE HOME AFTER MIDNIGHT. FINALLY MY 7TH BREAKDOWN WAS BROADCAST AS I WAS TRYING TO CROSS THE GEORGE WASHINGTON BRIDGE AT 1 AM ON VALENTINES DAY AND WITH HONDA ROADSIDE ASSISTANCE AND MY INSURANCE CO ROADSIDE ASSISTANCE, NO ONE CAME TO MY AID. I WAS BLOCKINTG TRAFFIC, AS I TRIED MYSELF TO CHANGE THE TIRE AFTER TWO HOURS OF FEAR THAT MY CAR OR I WOULD BE HIT BY A TRACTOR TRAILOR, AND THAT WOULD BE THE END OF ME. THE ELECTRICAL PROBLEM, ALL LIGHTS ON DASHBOARD ON BEGAN AFTER THE SECOND TIRE MALFUNCTION, AND CANNOT BE RESET. I NEED TO GO TO DEALER AND RENT A CAR FOR THEM TO FIGURE THIS ALL OUT. MEANWHILE, MY GAS MILEAGE HAS MAJOR ISSUES. I REFUEL EVER OTHER DAY. SAME COMMUTE FOR 6 YEARS. WHEN I DROVE MY MINI COOPER, I FILLED UP ONCE A WEEK. BUT THREE OR FOUR TIMES A WEEK? SOMETHING IS WRONG WITH MY CAR AT 10,000 MILES. IT FEELS LIKE A CLUNKER. I AM GOING TO GET RID OF IT. LOOK INTO MY STATES LEMON LAW AND RID MYSELF OF THIS HUNK OF JUNK.  I AM ALSO WRITING TO HONDA. BUT THIS TIRE ISSUE HAS COST ME OVER $1500 DOLLARS IN SIX MONTHS AND TIME/SAFETY  ISSUES. ONE BUYS A NEW CAR FOR FREEDOM FROM PROBLEMS. THIS IS UNACCEPTABLE CUSTOMER SERVICE AT THE DEALERSHIP, (ESPECIALLY SINCE THEY KNEW OF THIS \"TIRE\" ISSUE.",
        "vin": "3HGGK5G50HM"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "12/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054370,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2017 HONDA FIT EX ON AUGUST 9. ON DECEMBER 9, ALL OF THE WARNING LIGHTS WENT ON AND WHEN I TOOK IT TO THE DEALER THEY INFORMED ME THAT RATS HAD CHEWED THROUGH THE ENGINE WIRING AND THAT THE REPAIR, WHICH IS NOT COVERED BY WARRANTY, WOULD BE $1000. HONDA IS CLEARLY AWARE OF THE ISSUE OF RODENTS AFFINITY FOR THEIR SOY BASED WIRE COATING, AS THEY'VE DEVELOPED CAPSAICIN TAPE SPECIFICALLY DESIGNED TO COMBAT THE ISSUE. I'M NOT SURE WHY I SHOULD HAVE TO PAY FOR THIS PRODUCT, OR APPLY IT MYSELF TO WIRING THAT I CANNOT PHYSICALLY ACCESS. I PARKED MY 2003 VOLKSWAGEN IN THE SAME SPOT FOR YEARS WITH NO ISSUE, NOR HAS MY HUSBAND HAD ANY RODENT PROBLEMS WITH HIS 2003 MITSUBISHI.",
        "vin": "JA3AJ26E13U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/26/2017",
        "dateOfIncident": "11/26/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048538,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "FIT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PANEL UNDER THE OIL PAN FELL OFF. THE FASTENING CLIPS ARE MISSING AND THIS DESIGN IS FLAWED. MANY OTHER CONSUMERS ALSO COMPLAINED ABOUT LOSING FASTENERS ON THIS PANEL.",
        "vin": "3HGGK5G71HM"
    }
]