[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2022",
        "dateOfIncident": "10/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456179,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Hyundai Sonata Hybrid. The contact stated while her husband was driving 65 MPH, the vehicle began to shake and lost motive power. The contact stated that her husband pulled off the highway safely. The driver then attempted to re-enter the highway, there was a loud bang from the engine that shook the vehicle. The vehicle stalled. The contact stated no warning light was illuminated. The vehicle was towed to a dealer and diagnosed. The dealer service manager informed the contact that the failure was related to NHTSA Campaign Number: 21V727000 (Engine) for which the VIN was included. The vehicle was not repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 75,000.",
        "vin": "KMHE24L1XHA"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/29/2021",
        "dateOfIncident": "11/29/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441966,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Hyundai Sonata Hybrid. The contact received a recall notification for NHTSA Campaign Number: 21V749000 (Exterior Lighting, Electrical System) however, the dealer informed the contact that they would be able to perform the recall repair in approximately five months. The manufacturer was notified of the issue and advised the contact that they could assist with scheduling an earlier appointment with another dealer who was 40 miles away from the contact's residence. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "KMHE34L32HA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386502,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HYUNDAI SONATA HYBRID. THE CONTACT STATED WHILE DRIVING 55 MPH, THERE WAS A LOUD KNOCKING SOUND COMING FROM THE ENGINE WHILE DEPRESSING THE ACCELERATOR PEDAL. THE CONTACT STATED THAT THE VEHICLE FAILED TO RESPOND AS DESIGNED. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS DRIVEN TO THE RESIDENCE. THE VEHICLE WAS THEN TAKEN TO POWAY HYUNDAI (13910 POWAY RD, POWAY, CA 92064) TO BE DIAGNOSED. THE CONTACT WAS INFORMED OF THE CONNECTING ROD BEARING FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "KMHE24L18HA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233915,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS 65000 MILES AND THE STEERING WOULD FREEZE UP WHILE DRIVING ON A LOCAL STREET AND ALMOST HAD A COLLISSION.  FIRST TIME I NOTICED THE PROBLEM WAS WHEN MY VEHICLE HAD 55000 MILEA AND IT WAS UNDER WARRANTY.  THEY REPLACED A PART AT THAT TIME AND NOW JUST 2 MONTHS LATER I HAVE THE SAME PROBLEM BUT THE DEALERSHIP REFUSE TO FIX THE PROBLEM.  IT IS A SAFETY ISSUE AND IT STARTED WHILE UNDER WARRANTY.  CAN YOU PLEASE HELP ME WITH THIS MATTER.",
        "vin": "KMHE24L39HA"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/19/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202562,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR DOES NOT HAVE ANY WARNING SIGN OR SOUND WHEN AN ADULT PASSENGER DOES NOT HAVE THE SEAT BELT ON. I BOUGHT THE CAR AS NEW JAN LAST YEAR AND I DO NOT RECALL THAT THIS EVER WORKED. I DOUBLE CHECKED THE EXISTENCE OF THE PROBLEM DRIVING SLOWLY WITHIN THE CUL-DE-SAC. I HAVE AN APPOINTMENT WITH THE DEALERSHIP TOMORROW TO CHECK THE ISSUE. IT IS POSSIBLE THAT MANY OTHER CARS LIKE MINE HAVE THIS PROBLEM AND THIS MIGHT BE A CASE FOR A RECALL.",
        "vin": "KMHE34L33HA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183267,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STOPPING AT A REST AREA ON 2 SEPARATE OCCASIONS, THE CAR REFUSED TO START AND A MESSAGE WAS DISPLAYED TO CHECK HEV SYSTEM. AFTER REPEATED TRIES TO START IT THE MESSAGE DISAPPEARED AND THE CHECK ENGINE LIGHT CAME ON.  EVENTUALLY, THE CHECK ENGINE LIGHT WENT OFF, THE CAR SEEMED TO BE WORKING PROPERLY AND WE RESUMED OUR TRIP. WE TOOK THE CAR TO THE DEALER AND THEY CHECKED FOR ERRORS AND FOUND NONE. WE ARE RELUCTANT TO PUT THE CAR ON ANY MORE TRIPS OUT OF TOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2018",
        "dateOfIncident": "11/16/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152307,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A HYUNDAI SONATA HYBRID 2017. THE BRAKING SYSTEM CREATES A HOWLING SOUND WHEN THE BRAKE IS APPLIED. IT HAPPENED INTERMITTENTLY.  I SENT MY CAR TO THE HYUNDAI DEALER NEAR ME THREE TIMES. THE PROBLEM WAS NOT RESOLVED.  ACCORDING TO THE DEALER TECHNICIANS, THEY WERE INFORMED BY HYUNDAI, THE MANUFACTURER THAT THE SOUND WAS NORMAL.   I AM CONCERNED ABOUT THE SAFETY OF DRIVING THE CAR. I HOPE NHTSA  CAN HELP ME TO RESOLVE THIS ISSUE. THANK YOU.",
        "vin": "KMHE24L11HA"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143355,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HEV WARNING LIGHT CAME ON WHEN I STARTED THE CAR IN THE MORNING. I HEARD SOME GRINDING AND A BELT SLIPPING. DIAGNOSED AS GENERATOR PULLEY GRINDING, ALIGNMENT MARKS NOT ALIGNED. IT TOOK FROM 08/31/18 TILL 09/07/18 FOR THE REPAIR TO BE COMPLETED.",
        "vin": "KMHE24L11HA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143359,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HEV WARNING LIGHT CAME ON WHEN I STARTED MY CAR. I HEARD A SUCKING AIR SOUND AT WHICH TIME I TURNED OFF THE CAR. I THEN RESTARTED AND NO WARNING LIGHTS WERE ON. LATER THAT DAY WHILE DRIVING HOME THE WARNING LIGHT CAME BACK ON. I PULLED THE CODES AND IT SHOWED P0105 AND P0107.  DEALER INSPECTED AND FOUND THE EGR PIPE(C) SEPARATED FROM FLANGE CAUSING UNMETERED AIR LEAK. REPAIRS TOOK FROM 09/26/18-10/02/18",
        "vin": "KMHE24L11HA"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124591,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THIS PAST LABOR DAY, WHICH WAS 9/3/2018, I PULLED INTO A GAS STATION TO REFUEL MY CAR.  SHUT OFF CAR AND HAD KEY FOB WITH ME.  PUMPED THE FUEL AND GOT BACK IN THE CAR.  NOTHING.  CAR WAS INOPERABLE.  PRESSED THE START BUTTON, PRESSED THE BRAKES, SHIFTED FROM DRIVE TO NEUTRAL AND BACK, PRESSED THE BRAKE AND THE START BUTTON AGAIN AND NOTHING.  DASHBOARD LIT UP LIKE A CHRISTMAS TREE WITH THE KEY FOB LIGHT ON, THE CHECK ENGINE LIGHT ON, ETC.  CALLED BLUELINK.  THEY TRANSFERRED ME TO A \"PHONE PROMPT\" SWITCHBOARD.  PROBLEM IS THE PHONE SCREEN WOULD NOT OPERATE AS IT WAS FROZEN AS WELL.  CALLED AGAIN, LADY STAYED ON THE PHONE WITH ME AND TRANSFERRED ME. THEN WHEN TRANSFERRED SHE WAS ABOUT TO HANG UP WITH THE MESSAGE READ THEY WERE CLOSED.  WTF?  I AM SUPPOSED TO HAVE ROADSIDE ASSISTANCE.  REP FROM BLUELINK TOLD ME TO TOW THE CAR.  THERE WAS NOTHING SHE COULD DO AS IT WAS A HOLIDAY.  HONESTLY, I WAS FURIOUS.  I EXITED THE CAR AGAIN AND SHUT THE DOOR.  HAD THE FOB WITH ME.  GOT BACK IN AND AGAIN, NOTHING.  COULD NOT EVEN TURN THE STEERING WHEEL.  GOT OUT AGAIN AND THIS TIME CHECKED FUSES, AND TURNED SWITCH OFF THEN ON FOR ALL FUSES.  NOTHING AGAIN.  REPEATED THE STEPS AS TYPED EARLIER, AND NOTHING.  ABOUT 20 MINUTES LATER I TRIED IT AGAIN AND IT STARTED.     I HAVE HAD MY COMMUNICATIONS CENTER REPLACED ONCE ALREADY.  ANDROID AUTO WORKED WHEN IT FELT LIKE IT.  MY SENSORS FOR BLIND SPOTS TURN OFF AT WILL.  MY REAR VIEW CAMERA WORKS BUT THE SENSORS DON'T ALWAYS PICK UP ONCOMING CARS OR PEDESTRIANS.    THE CAR IS GOING BACK TOMORROW YET AGAIN.  THIS TIME I AM PUSHING FOR LEMON LAW.  THE ELECTRICAL SYSTEM IS CRITICAL TO THE FUNCTIONALITY OF THE CAR.  I LOVE THE MILEAGE I GET FROM THIS CAR AND EVERYTHING ELSE IS GREAT, BUT I AM NOT RUNNING THE RISK OF DRIVING ON THE INTERSTATE AND THE ELECTRONIC SYSTEM JUST DECIDES TO GO ON A VACATION!",
        "vin": "KMHE34L11HA"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "07/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111841,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INFORMED BY AN AUTO MECHANIC THAT HYBRID VEHICLES INVOLVED IN A COLLISION COULD EXPLODE WHEN THE CAR DOOR IS OPENED. HAVE YOU HEARD ANYTHING ABOUT THIS? COULD IT BE TRUE?  [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *PM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11094148,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ABRUPT AND TOTAL LOSS OF ACCELERATION AT FULL THROTTLE AT OR NEAR HIGH RPM SHIFT POINTS. THIS BEHAVIOR CAN BE RELIABLY REPRODUCED BY \"FLOORING IT\" (ALL THE WAY, INCLUDING KICKDOWN) AND NOT LETTING GO - AS IF ONE IS EXECUTING A PASSING MANEUVER. THE POWER LOSS WILL OCCUR AT THE NEXT SHIFT POINT AFTER KICK DOWN, AND WILL NOT BE CLEARED UNTIL THE ACCELERATOR PEDAL IS RELEASED AND RE-APPLIED - OR AFTER APPROXIMATELY 15 TO 20 SECONDS AFTER THE OCCURRENCE IF THE DRIVER DOES NOT RELEASE THE PEDAL. IN CASES WHERE THE PEDAL IS NOT RELEASED AFTER THE POWER LOSS, THE VEHICLE WILL SURGE SUDDENLY AFTER THE CONDITION HAS CLEARED AND REPEAT THE BEHAVIOR DESCRIBED ABOVE. THIS BEHAVIOR CAN BE REPRODUCED IN ANY DRIVE PROGRAM MODE (ECO, NORMAL, SPORT, ) AND IN BOTH AUTOMATIC AND MANUAL SHIFT SELECTION MODES, AND IS ESPECIALLY PREVALENT AT SPEEDS ABOVE 45 MPH WHERE SUDDEN FULL THROTTLE COMMAND CAUSES KICKDOWN. THE DRIVETRAIN SHOULD RESPOND RELIABLY WHEN IT IS COMMANDED FULL-THROTTLE. A SUDDEN POWER LOSS AT A SHIFT POINT DURING A FULL THROTTLE MANEUVER IS UNSAFE: (1) IT DISORIENTATES THE DRIVER AND; (2) CAUSES UN-COMMANDED, UNEXPECTED, AND RAPID CHANGES IN DRIVING FORCE, WEIGHT DISTRIBUTION, FRICTION, AND REACTION FORCES WHICH COULD LEAD TO A LOSS OF CONTROL.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "07/12/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089955,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HYUNDAI SONATA HYBRID. WHILE DRIVING APPROXIMATELY 20 MPH, THE FRONT SIDE COLLISION WARNING SYSTEM FAILED TO FUNCTION. THE VEHICLE WAS TAKEN TO STEVENS CREEK HYUNDAI (4425 STEVENS CREEK BLVD, SANTA CLARA, CA 95051), BUT THE FAILURE WAS UNABLE TO BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED. THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 13,000.",
        "vin": "KMHE54L29HA"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067273,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "1: AT THE BEGINNING OF OCTOBER 210, WHEN THE MOTORWAY EXITS FROM EAST TO WEST, SUDDENLY THE ENGINE DOES NOT WORK (PICTURED) AND THE CAR DECELERATES DIRECTLY FROM 70 MILES TO 30 MILES. THE BRAKES CAN NOT WORK FULLY. STEP ON THE GAS PEDAL MUST STEP ON MULTIPLE STEPS TO RELAX THE THROTTLE, DEPRESS THE ACCELERATOR AGAIN, FROM THE SECOND MOVE TO MOST OF THE MOST OUTSIDE HIGH-SPEED, DO NOT KNOW DO NOT KNOW ABOUT THE CRASH ABOVE THE SPEED. SUCH A HIGH SPEED, I GO HOME, STOP THE FLAME, AND THEN OPEN EVERYTHING IS NORMAL. LATER, DEALER REPAIR CAN NOT FIND THE PROBLEM, UNTIL NOW THERE ARE THREE TOTAL FAILURES, MANUFACTURERS REPAIR IS NOT GOOD, DO NOT SOLVE THE PROBLEM, IT HAS BEEN DRAGGING",
        "vin": "KMHE24L13HA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "01/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063312,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS 10000 MILES. CAME TO A STOPLIGHT AND THE CAR DIED. RADIO WAS ON, DASH WAS DARK. TRIED TO RESTART, NO RESPONSE. TRIED 5 TIMES, ON THE 6TH TIME, ENGINE CAME TO LIFE. CAR HAS BEEN AT THE DEALER FOR THE LAST WEEK; NO FAULT CODE DETECTED ACCORDING TO DEALER. THEY ARE IN TOUCH WITH HYUNDAI.",
        "vin": "KMHE24L35HA"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039502,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A 4 LANE STREET THE CAR SUDDENLY GAVE A MESSAGE 'CHECK HYBRID SYSTEM SHUT OFF ENGINE'.  I WAS STOPPED AT A RED LIGHT SO I TURNED OFF THE ENGINE.  WHEN I TRIED TO RESTART THE CAR IT WOULD NOT START.  IT TOOK 4 TRIED TO GET THE CAR RESTARTED.  LATER THAT NIGHT THE CAR WOULD NOT START AT ALL AND I HAD TO HAVE IT TOWED TO THE DEALERSHIP THE NEXT DAY.  THE DEALERSHIP COULD NOT FIND A PROBLEM AND I RETURNED TO GET THE CAR.  ON THE WAY HOME FROM THE DEALERSHIP I HAD SHUT OFF THE CAR TO RETRIEVE SOME ITEMS AND UPON RETURNING TO THE CAR AGAIN IT WOULD NOT START.  ALL OF THE INDICATOR LIGHTS ON THE DISPLAY PANEL WERE LIT BUT THE CAR WOULD NOT DRIVE AND THE SHIFT LEVER WAS LOCKED.  RETURNED THE CAR TO THE DEALERSHIP AND THEY REPLACED THE HPCU MODULE.  I GOT THE CAR BACK AT THE BEGINNING OF SEPTEMBER AND TWICE IT HAS FAILED TO START.  EACH TIME THE DASHBOARD INDICATOR LIGHTS WILL LIGHT UP BUT THE ENGINE WILL NOT START.",
        "vin": "KMHE24L1XHA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "06/03/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993312,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA HYBRID",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE FREEWAY AT APX. 65MPH, THE CAR LOST ENGINE POWER AND DISPLAYED A\"STOP VEHICLE AND CHECK BRAKES\" MESSAGE. I HAD NO POWER TO THE WHEELS, SO COULD NOT SAFELY MOVE OUT OF TRAFFIC AND WAS STUCK IN THE ACTIVE FREEWAY LANE WITH CARS ZIPPING BY. AFTER THE CAR COASTED TO A STOP, I TURNED IF OFF AND BACK ON. POWER RETURNED AND I WAS ABLE TO DRIVE NORMALLY. THE ESC, ABS, AND AUTO HOLD LIGHTS WERE ON, BUT WENT OFF AFTER APX. 15 MINUTES OF DRIVING. THE DEALER COULD NOT FIND ANY PROBLEM NOR WERE ANY ERROR CODES RECORDED IN THE VEHICLE. THIS IS A VERY SERIOUS SAFETY ISSUE - I AM VERY FORTUNATE NOT TO HAVE BEEN STRUCK AND KILLED IN THAT SITUATION.",
        "vin": "KMHE34L11HA"
    }
]