[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "09/08/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121231,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "GENESIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 06/10/2017  WE PURCHASED A G90 GENESIS FROM SOUTH CHARLOTTE HYUNDAI AT 8525 SOUTH BLVD CHARLOTTE NC. THE TEAM WAS VERY CONVINCING ABOUT THE QUALITY OF THE VEHICLE & THE 10-YEAR WARRANTY. THE CAR WAS A VERY EXPENSIVE CAR COSTING $74,678.47, BUT WE WERE ASSURED IT WAS THE BEST CAR & WARRANTY IN THE BUSINESS.   WE STARTING TO HAVE CRASH SENSORS GOING OFF EVEN AT TIMES WHEN NO OTHER CARS WERE EVEN NEAR THE CAR. THEY INDICATED THAT THEY FIXED THE PROBLEM, BUT THE 'FALSE' CRASH WARNING PERSISTED & EVEN EXPERIENCED THE CAR AUTO STOPPING IN AN INTERSECTION WHEN IN FACT IT WAS A FALSE SENSOR AS NO CAR WAS EVEN IN FRONT OF THE VEHICLE. THIS BECAME LIFE THREATENING & SERIOUS.   SOUTH CHARLOTTE HYUNDAI HAD THE CAR IN THE SHOP YET AGAIN & THEN INDICATED THEY COULD NOT FIND THE PROBLEM NOR COULD THEY RECREATE IT. SO, THEY COULD NOT FIND THE PROBLEM & THEY HAD DONE ALL THEY COULD. BECAUSE THE CRASH SENSORS STAY ON FOR AN EXTENDED TIME ONCE THEY GO OFF, WE WERE ABLE TO RECORD A VIDEO OF WHAT WAS GOING. THIS WAS SHARED WITH THEM & EVEN AFTER THE VIDEO THEY INDICATED THEY COULD NOT FIND THE PROBLEM EVEN BROUGHT IN 'FACTORY EXPERTS' & SO WE SHOULD BE GOOD. WE EXPERIENCED OTHER CRASH LOCKUPS & AT ONE POINT GOING DOWN THE INTERSTATE WITH NO CARS AROUND THEY CRASH SENSORS WENT AWRY.   OVER THE COURSE OF THE PAST YEAR THE CAR HAS BEEN IN THE SHOP MORE THAN 5 TIMES. I AM ATTACHING THE LATEST ONE WHERE THE CAR WAS IN THEIR POSSESSION FOR OVER 14 DAY & THE ORDER SHOWS THEY REPLACED SENSORS. UNFORTUNATELY, WE JUST RECORDED ANOTHER FALSE CRASH EVENT. THERE SEEMS TO BE THE POSSIBILITY THAT THERE IS EITHER AN ISSUE WITH SOUTH CHARLOTTE HYUNDAI OR PERHAPS A BROADER ISSUE WITH THE SENSORS IN THE GENESIS LINE OF VEHICLES. WE HAVE BEEN TOLD THAT HYUNDAI IS AWARE OF OUR SITUATION & SEEMS TO BE NON-RESPONSIVE WHICH MAKES US THINK THERE IS MORE TO THE FALSE CRASH WARNINGS & ABRUPT STOPS.",
        "vin": "KMHG54JH8HU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/24/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001366,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "GENESIS",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HYUNDAI GENESIS. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 35 MPH, THERE WAS AN ABNORMALLY LOUD NOISE FROM THE AREA OF THE SUN ROOF, THE SUN ROOF FRACTURED WITH GLASS EMITTING ON THE OUT SIDE AND INNER AREA OF THE VEHICLE WHEN THE FAILURE HAPPENED. THE VEHICLE WAS TO BE SCHEDULED FOR AN APPOINTMENT WITH (TIPTON HYUNDAI, 450 MORRISON RD, BROWNSVILLE, TX 78526, (956) 243-8810 ). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE TO DETERMINE THEIR RECOMMENDED SOLUTION TO REPLACE THE PART AND TO DETERMINE IF A DEALER COULD DIAGNOSE WHAT CAUSED THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 2,400.",
        "vin": ""
    }
]