[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/16/2021",
        "dateOfIncident": "09/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433182,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Car was hit in the front right broadside hard enough to break the axle, but the airbag did not deploy.",
        "vin": "Kmhct4ae7hu"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2021",
        "dateOfIncident": "08/11/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432100,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My car is making a weird sound, and feel like the brakes are dragging something. But I have no lights on the dash board and keep up with the maintenance. I Also received a new transmission for city world hyundai before all of this.",
        "vin": "KMHCT4AE7HU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "07/02/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428283,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Randomly have the passenger side airbag light go off on dashboard then an warning light in gage cluster for air bag issues will come on.",
        "vin": "KMHCT4AE3HU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2021",
        "dateOfIncident": "08/08/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428268,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The airbag warning light comes on and won’t go off. According to the Hyundai dealership it’s just a faulty mat on the passenger side but they are claiming it’s a $1400 fix.",
        "vin": "KMHCT4AE1HU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/23/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422167,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle made a large “pop” sound, lost power and a fire started at the engine. After the “pop” was heard, the check engine flashed on, then the car died. Noticed a smoke smell, jumped out of car and saw flames. Entire car was engulfed in minutes. No issues to the car prior to incident.",
        "vin": "Kmhct4ae1hu"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2021",
        "dateOfIncident": "05/29/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418998,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving, the electrical system glitches, all of the lights on the dashboard flash on and off as if the car is shutting off then the trip miles return to 0.0. I bought the car September 2020. This happened January 20, 2021 and again on May 29, 2021.",
        "vin": "KMHCT4AE4HU"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2021",
        "dateOfIncident": "06/12/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402609,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY ON VACATION COMING FROM FLORIDA, THE CAR LOST POWER FOR 3 SECONDS AND CAME BACK ON AGAIN. WEIRD IT HAPPENED. HASNT HAPPENED SINCE BUT SCARY TO COMPLETELY SHUTDOWN THEN START UP AGAIN. THE MOTOR CONTINUE TO RUN BUT LIGHTS AND EVERYTHG ELSE SHUT. IT WAS WEIRD. THIS HAPPEN SUMMER 2020. WAS NOT RAINING AND WAS ON STRAIGHT HIGHWAY.",
        "vin": "KMHCT4AE1HU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/06/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386746,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT IT USED WITH 63,000 MILES AROUND 11/8/20, EVERYTHING WAS GOING GOOD, AND ONE DAY I NOTICED THE AIRBAG LIGHT WAS ON. OVER A THE NEXT COUPLE OF DAYS, THE LIGHT WOULD STAY ON & IF I TURNED MY CAR OFF AND ON AGAIN, IT WOULD TURN OFF BUT COME BACK ON A COUPLE MINUTES LATER. I LOOKED IT UP, AND IT TALKED ABOUT A POSSIBLE ISSUE WITH THE AIRBAG SYSTEM OR THE AIRBAG SENSOR. I ALSO NOTICED THAT A LOT OF PEOPLE HAD THE AIRBAG LIGHT ISSUE WITH THEIR HYUNDAI VEHICLES, MOSTLY THE ACCENT MODELS.",
        "vin": "KMHCT5AE2HU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385235,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WEN U LET OFF GAS N PUT BRAKE ON WHILE DRIVING N YOU GO TO PUSH BACK ON GAS PETAL IT DON'T DO ANYTHING U HAVE TO LET OFF GAS PETAL N DO IT AGAIN IT'S DANGEROUS ON FREEWAY THE SERVICE MANAGER SAID JUST PUNCH IT IT SHOULD THEN .WHAT SO I HIT CARS IN FRONT OF ME N NOW IT'S STARTING TO DO IT WEN I TURN CORNERS",
        "vin": "KMHCT5AE0HU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384727,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 HYUNDAI ACCENT. THE CONTACT STATED WHILE DRIVING 30 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED AND THERE WAS AN ABNORMAL KNOCKING SOUND COMING FROM THE ENGINE. THE CONTACT STATED THAT THE VEHICLE SHUDDERED AND STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC BUT WAS NOT DIAGNOSED NOR REPAIRED. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 118,000.",
        "vin": "KMHCT4AE4HU"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11378211,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN OCTOBER OF 2020 THE CAR HAD AN OIL CHANGE. ABOUT A MONTH LATER WHILE DRIVING DOWN THE HIGHWAY I STARTED TO HEAR A TICKING NOISE. WHEN I GOT TO MY HOUSE WE STARTED TO INVESTIGATE WHAT WAS GOING ON. FIRST WE CHECKED THE OIL WHICH WAS NOTHING BUT FUMES BUT THE OIL LIGHT NEVER CAME ON.  CONFUSED AS TO WHY THERE WAS NO OIL WE KEPT INVESTIGATING BECAUSE AS STATED BEFORE THE CAR HAD AN OIL CHANGE THE MONTH PRIOR.  WE REPLACED THE OIL YET AGAIN AND CONTINUED TO DRIVE THE CAR TO SEE WHAT WAS GOING ON. THE TICKING KEPT GETTING LOUDER EVEN WITH OIL BEING CHECKED DAILY. THIS CAR ONLY HAS 80,000 MILES ON IT. I FINALLY TOOK IT TO A MECHANIC WHO TOLD BE IT WAS MY ROD BERINGS I WAS GIVEN A QUOTE TO FIX IT IN WHICH WE AGREED I COULD FIX IT BUT IT WOULD TAKE SOME TIME FOR ME TO GET THE MONEY. ON SATURDAY DECEMBER 6TH I WENT TO PICK MY CAR UP FROM THE MECHANIC UNTIL I WAS ABLE TO GET THE MONEY TO FIX IT. WHILE DRIVING IT HOME I KEPT SMELLING A BURNING SCENT BUT WAS UNABLE TO ACCESS IT ON THE ROAD. I TURNED OFF ALL EXTRAS IN THE CAR (HEATER , RADIO EVERYTHING THAT WASN'T CRITICAL TO DRIVING AT THE MOMENT ). I CONTINUED TO DRIVE THE CAR HOME TAKING IT AS A EASY SPEED AND NOT TRYING TO OVERDO IT. WHEN I REACHED THE 4 WAY STOP RIGHT BY HOUSE THE CAR WAS STILL TICKING AND I SAT AT THE SIGN BEHIND SOME CARS, THE MINUTE IT WAS MY TURN TO GO FROM THE SIGN THE CAR STALLED OUT IN THE MIDDLE OF THE ROAD. THANKFULLY I WASN'T ON A MAJOR ROAD AND HAD ENOUGH TIME TO HIT MY EMERGENCY LIGHTS.  THE CAR HAD TO BE TOWED TO MY HOUSE. I TRULY  BELIEVE THE 2017 HYUNDAI ACCENT IS HAVING THE SAME RECALL AS SOME OF THE OTHER BUT THE CAR ISN'T LISTED. THIS PROBLEM WAS REPORTED AT THE START TO HYUNDAI CORPORATE OFFICE THEY TOOK MY NAME AND COMPLAINT BUT NO ONE HAS EVER FOLLOWED UP ON THE PROBLEM.",
        "vin": "KMHCT4AE3HU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/14/2020",
        "dateOfIncident": "11/13/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374624,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WOW ENTERING THE HIGHWAY MY CAR STALLED OUT IN THE MIDDLE OF TRAFFIC THE NEVER CUT OUT JUST WILL NOT DRIVE MORE THAN ABOUT 5 MILES AN HOUR EVEN WITH PUTTING MY FOOT ALL THE WAY DOWN ON THE PEDAL TURN IT OFF FOR 30 MINUTES STARTED BACK UP STARTED DRIVING START OUT AGAIN ALMOST CAUSING ME TO WRECK MULTIPLE TIMES NO WARNING LIGHTS OR ANYTHING POPPED UP I STILL HAVE NO LIGHTS ON MY DASH AND IT IS STILL NOT DRIVABLE HAD TO GET IT TOWED BY AAA I DON'T UNDERSTAND HOW DID YOU RECORD THAT IS 3 YEARS OLD IS HAVING THIS ISSUE WITH NO WARNING I'M VERY BLESSED THAT MY CHILDREN WEREN'T IN THE CAR CONSIDERING THE DIESELS COMING BEHIND ME WHY ARE THE HIGHWAYS WITH THIS HAPPENING ALL OF THE SUDDEN THE CAR DOES NOT SHUT DOWN IT JUST LOSES POWER FAR AS DRIVING ACCELERATING",
        "vin": "KMHCT4AE0HU"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348518,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 22,000 MILES MY 2017 ACCENT'S BRAKE LIGHTS WOULD NO LONGER WORK. MY TAIL LIGHTS ARE ON BUT MY BRAKE LIGHTS THAT ILLUMINATE BRIGHTER WHILE BRAKING WILL NOT WORK. I HAVE ATTEMPTED TO CHANGE THE FUSE WITH AN IDENTICAL ONE, BOUGHT NEW LIGHT BULBS, AND WILL NOW BE TAKING IT INTO A DEALERSHIP. I BELIEVE IT IS THE BRAKE SWITCH THAT IS FAULTY BUT I AM UNSURE. UT THEY ARE BOOKED FOR WEEKS AND THIS IS A HUGE SAFETY/LEGAL ISSUE.   RECALL NUMBER 131",
        "vin": "KMHCT4AE1HU"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/11/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11348519,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOT EXACTLY SURE WHEN BUT MY 'PASSENGER AIRBAG OFF' LIGHT STARTED TO RANDOMLY APPEAR AND NEVER TURNS OFF DESPITE THERE BEING A PASSENGER. ALSO MY BACK SEATS WOULD NOT LATCH CLOSED, CREATING AN UNSAFE RIDING TIME FOR A CHILD IN A BOOSTER SEAT. WHICH IS A HUGE CONCERN BECAUSE I FREQUENTLY PROVIDE RIDES FOR TWO YOUNG CHILDREN   MY AIR CONDITIONING UNIT BECOMES SO HOT THAT MY FEET ARE LITERALLY BURNING ME. I END UP TAKING MY SOCKS AND SHOES OFF DUE TO HOW HOT IT GETS. THE MOTOR FOR THE ENGINE IS INCREDIBLY LOUD DESPITE THE SMALL AMOUNT OF MILES. I HAVE ISSUES WITH ACCELERATING FROM STOP",
        "vin": "KMHCT4AE1HU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "07/21/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340692,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCUPANT CLASSIFICATION SYSTEM DEFECT. MY CAR WAS ONLY 2,000 MILES OUT OF WARRANTY AND HYUNDAI WILL NOT COVER THIS DEFECT. RIGHT PASSENGER SEAT AIR BAG SENSOR MAT IS FAULTY CAUSING THE AIR BAG LIGHT TO COME ON. I'VE DONE MY RESEARCH ONLINE AND THIS IS PRETTY COMMON. IT SHOULD BE A RECALL AND I SHOULDN'T BE HAVING TO SPEND $1,400 TO GET IT FIXED.",
        "vin": "KMHCT4AE0HU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316488,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKING SYSTEM IS DEFECTIVE IN MY 2017 HYUNDAI ACCENT.   I HAVE HAD IT TO THE HEADQUARTER HYUNDAI DEALERSHIP ON 3 SEPARATE OCCASIONS TO HAVE THE DANGEROUS PROBLEM FIXED.  AFTER THE 3RD TIME I EXPERIENCED THE PROBLEM, I TOOK IT AGAIN BACK TO THE DEALERSHIP. THE CAR IS UNDER FACTORY WARRANTY. THE PROBLEM IS THE BRAKE PEDAL GOES ALL THE WAY TO THE FLOOR BOARD AS MY BRAKES LOCK UP CAUSING THE FRONT TIRES TO LOCK UP THUS CAUSING MY CAR TO CONTINUE FORWARD WITHOUT ANY ABS SYSTEM BEING USED BY THE CAR BRAKING SYSTEM TO KEEP THE FRONT TIRES FROM LOCKING UP. ON THE THIRD TIME I BROUGHT THE CAR INTO THE SERVICE DEPARTMENT THE SERVICE MANAGER WAS ABLE TO DUPLICATE THE PROBLEM 9 OUT OF 10 TIMES.) NOT AT HIGH SPEEDS. IN FACT HE SAID HE COULD MAKE THE WHEELS LOCK UP GOING LESS THAN 3 MPH.) HOWEVER HE STATED BECAUSE THE COMPUTER ANALYSIS REPORTED NO ISSUES, HE COULD NOT REPLACE THE DEFECTIVE PART. AND I QUOTE HE SAID \" BECAUSE IT WOULD CAUSE A NATIONAL RECALL OF ALL THE HYUNDAI ELANTRA, ACCENT, SONATA AND GENESIS YRS 2017 THRU 2019. \". I HOPE TO DEAR GOD SOMEONE TAKES SOME ACTION ON THIS ISSUE. I AM GOING TO CONTACT A LARGE LAW FIRM TO START A CLASS ACTION SUIT TO PROTECT ALL DRIVERS OF THESE CARS AND THE INNOCENT DRIVERS ON THE ROAD THAT COULD BE INJURED OR KILLED BY THIS NEGLIGENT  RESPONSE TO A LIFE AND DEATH BRAKING SYSTEM DEFECT.  I EVEN LOOKED UP ON A GOOGLE SEARCH AND FOUND THIS BRAKING PROBLEM ON ALL OF THE ABOVE MENTIONED CARS. PLEASE TAKE SOME ACTION ON THIS PROBLEM.!!!!!!!!",
        "vin": "KMHCT4AE5HU"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278567,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY WHEN YOU ACCELERATE IT HESITATES AND DOES NOT RESPOND.  IT HAS BEEN TAKEN TO A MECHANIC AND A DEALER AND THEY CANNOT FIND THE PROBLEM BUT IT DOES HAPPEN.  IT IS DANGEROUS ESPECIALLY WHEN PULLING OUT ONTO A VERY BUSY ROAD WHERE I LIVE  THIS IS A SIDE STREET ENTERING A VERY BUSY HIGHWAY OR MOST ANYTIME.  IT IS RANDOM   IT HAPPENS EVER SINCE CAR WAS PURCHASED CAN'T GIVE EXACT DATE",
        "vin": "KMHCT4AE7HU"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/05/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266450,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING I HEAR A LOUD CRUNCHING SOUND SOMETIMES AND THE BRAKE PEDAL JERKS BACK. CAUSED A SLIGHT ACCIDENT WITH BUMPER DAMAGE.",
        "vin": "KMHCT5AE2HU"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254543,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING LIGHT CAME ON (AND STAYS ON) FOR NO APPARENT REASON WHEN CAR WAS STARTED.  THE CAR HAS NOT SUSTAINED ANY IMPACT OR ANY DAMAGE.  IT APPEARS A SENSOR HAS FAILED.  THE CAR HAS LESS THAN 42K MILES AND IS IN PERFECT SHAPE.",
        "vin": "KMHCT4AE2HU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "08/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245416,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I START DRIVING THE DRIVER SIDE AIRBAG LIGHT TURNS ON AND WON'T TURN OFF UNTIL I TURN THE CAR OFF AND THEN BACK ON AND IT STILL TURNS BACK ON WHEN I START MOVING.",
        "vin": "KMHCT4AEXHU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/25/2019",
        "dateOfIncident": "07/25/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234947,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN ROAD AND TRUCK HIT ME ON PASSENGER SIDE AND AIR BAGS DIDN'T DEPLOY",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/22/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222267,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NORTHWEST FIRE DISTRICT, FIRE INVESTIGATOR [XXX],  VEHICLE FIRE ON 6/22/2019  CAR PARKED AT APPROXIMATELY 11:30 PM. 6/21/2019  OWNER AWAKENED BY DOG AT APPROXIMATELY 1:30 AM  6/22/219 TO FIND CAR INVOLVED IN FIRE.  INVESTIGATION INDICATED FIRE STARTED IN ENGINE COMPARTMENT. UNKNOWN FAILURE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).   *TR",
        "vin": "KMHCT4AE1HU"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/23/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209557,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 5/22/19 THE LEFT TIRE BLEW OUT AND ON THE5/23/2019 THE REAR BUMPER FELL OFF THE INTERSTATE. I JUST LEASED THIS USED CAR ON THE 4/15/19. I WENT BACK TO THE DEALER AND THEY REFUSED TO HELP. DEALER STATED IT'S WEAR AND TEAR. IT'S ONLY BEEN A MONTH.",
        "vin": "KMHCT5AE6HU"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/14/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208600,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH LIGHTS; BRAKE, ABS, AND TRACTION CONTROL LIGHTS COME ON. THE SPEEDOMETER ALSO DOES NOT WORK WHILE DRIVING.  THE GAS GAUGE IS GOING UP AND DOWN AND NOT SHOWING THE CORRECT GAS.  THE ELECTRICAL APPEARS TO BE MALFUNCTIONING, BUT THE DEALER HAS YET TO RECREATE THE ISSUE. THIS HAS HAPPENED TWICE IN A SPAN OF A WEEK. VIDEOS WERE TAKEN BOTH TIMES IT OCCURRED ON 5/14/19 AND 5/20/19, BUT ARE TOO LARGE TO UPLOAD.",
        "vin": "KMHCT5AE2HU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "03/27/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195646,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPING ABRUPTLY, GOING AT 15-20MPH ON A MAIN STREET IN STOP AND GO TRAFFIC, NO SNOW OR RAIN, THE BRAKE PEDAL  PUSHES BACK AS IF SOMETHING IS STOPPING THE PEDAL FROM GOING DOWN, IT MAKES A LOUD GRINDING NOISE, AND DOESN'T STOP THE CAR LET ALONE SLOW IT DOWN. THIS HAS HAPPENED TO ME 3 TIMES ALREADY, ONE RESULTING IN AN ACCIDENT! I'VE ONLY HAD THIS CAR FOR MAYBE 4 MONTHS AND I DON'T FEEL SAFE AT ALL.",
        "vin": "KMHCT4AE1HU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/10/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179807,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 HYUNDAI ACCENT. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT'S VEHICLE WAS REAR ENDED AND PUSHED OVER THE MEDIAN. AS A RESULT, THE CONTACT CRASHED HEAD ON INTO ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO WARNING INDICATORS ILLUMINATED. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOTALED AND TOWED TO A TOW YARD. THE CONTACT CALLED STEVENS CREEK HYUNDAI AT 408-249-1200 (LOCATED AT 4425 STEVENS CREEK BLVD, SANTA CLARA, CA 95051) AND WAS REFERRED TO THE MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STARTED AN INVESTIGATION. THE FAILURE MILEAGE WAS 35,500.",
        "vin": "KMHCT5AE4HU"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170244,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING HAS BEEN HAVING ISSUES THE STEERING WHEEL TIGHTENS  UP AT TIME . AND WORKS AGAINST YOU.WHILE DRIVING AT ROAD SPEED FROM MAYBE 35-55",
        "vin": "KMHCT5AE1HU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "02/17/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162294,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I TRY TO PRESS ON BRAKES ON A HILL OR GRAVEL MY CAR SKIDS WHILE DRIVING AND I FEEL MY CAR SKID AND STRUGGLE TO BRAKE ON A DRY DAY WITH NO RAIN WHAT SO EVER. MY 2017 HYUNDAI ACCENT BRAND NEW AND IM THE ONLY OWNER. THIS HAS BEEN HAPPENING SINCE I PURCHASED THE CAR.",
        "vin": "KMHCT4AE7HU"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/18/2018",
        "dateOfIncident": "04/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11096678,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON EASTER SUNDAY 04/01/2018 I WAS IN AN ACCIDENT THAT CAUSED ,$ 10,800.00   IN FRONT END COLLISION DAMAGE , NO AIRBAGS DEPLOYED. THE RESULTING COLLISION CAUSED MY SEATBELT ON BREAK 3 OF MY LEFT RIBS . I HAD ACCIDENTALLY DROPPED A CLOSED WATER BOTTLE BETWEEN MY LEGS , SAID BOTTLE THEN ROLLED UP UNDER BRAKE PEDAL , AFTER I LOOKED DOWN TO SEE WHERE IT WENT I LOOKED UP TO MY HORROR DISCOVERED A RED ISHTAR WITH A CAR STOPPED IF FRONT OF ME . I SLAM ON WHAT BRAKE I HAD AVAILABLE CUT SHELL HARD RIGHT AND COLLIDED LEFT FRONT OF MY CAR INTO RIGHT REAR OF BUMPER IN FRONT OF ME , I THEN RICOCHET INTO GUARD RAIL THUS DESERT HE OTHER FRONT SIDE OF MY VEHICLE .   AGAIN NEITHER FRONT OR SIDE AIRBAGS DEPLOYED.",
        "vin": "KMHCT5AE1HU"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/08/2018",
        "dateOfIncident": "03/22/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083863,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CAME ON. GOT IT DIAGNOSIED AND APPEARED CODE B1490 (OCCUPENT  CLASSIFICATION)",
        "vin": "KMHCT5AEXHU"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "03/03/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076487,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED INTO A PARKING SPOT.WHEN BRAKING FOOT HIT THE GAS PEDAL ALSO.CAR KEPT GOING.IVE BEEN DRIVING OVER 50 YEARS NEVER RAN INTO THIS TYPE OF PROBLEM.TO ME THE GAS PEDAL AND BRAKE PEDAL ARE TO CLOSE.IT COULD CAUSE   A VERY BAD ACCIDENT.",
        "vin": "KMHCT4AE9HU"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2018",
        "dateOfIncident": "02/18/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073511,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE WHERE IT SNOWS. WHEN DRIVING DOWN THE ROAD, THE SNOW ACCUMULATES AROUND THE FRONT TIRES AND ON FRONT BUMPER.  THE ACCUMULATION OF SNOW ON MY FRONT BUMPER IS PUSHING THE BUMPER OFF. ON BOTH PASSENGER AND DRIVER SIDE OF BUMPER ARE SLOWLY BEING PUSHED OFF CAR BY SNOW. THE SIDE OF BUMPER IS NOT BOLTED TO CAR. IT IS BEING HELD BY PLASTIC CLASPS ALONG TOP OF BUMPER. I AM AFRAID TO DRIVE TO WORK BECAUSE BUMPER MIGHT FALL OFF WHILE DRIVING. DUE TO ICY ROADS, MY SPEED IS 35 TO 40 MI.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2018",
        "dateOfIncident": "02/17/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073412,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UNDER CARRIAGE IS NOT STABLE. THE UNDERCARRIAGE COVER FALLS OFF WHENEVER SOMETHING SCRAPES THE BOTTOM OF CAR...ON THE PASSENGER AIDE ONLY. THE SCREWS AND BOLTS VECOME BENT AND THE NUTS FALL OFF, FORCING UNDER CARRIAGE COVER TO FALL AND SCRAPE ON GROUND.   THE CAR WAS IN MOTION ABOUT 1 BLOCK FROM MY HOUSE WHEN THIS HAPPENED.",
        "vin": "KMHCT4AE6HU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/07/2017",
        "dateOfIncident": "08/22/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11022080,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 HYUNDAI ACCENT. WHILE DRIVING 74 MPH, THE AIR BAGS FAILED TO DEPLOY IN THE CONTACT'S VEHICLE AFTER BEING STRUCK ON THE FRONT PASSENGER SIDE QUARTER PANEL. THE VEHICLE TRAVELED  OVER THE MEDIAN, STRUCK AN EMBANKMENT, ROLLED OVER, AND LANDED ON ITS ROOF. THERE WERE NO WARNING INDICATORS ILLUMINATED PRIOR TO THE FAILURE. THAT CONTACT SUSTAINED A CONCUSSION, HEAD LACERATION, AND A FRACTURED COLLAR BONE THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW LOT AND DEEMED DESTROYED. THE VEHICLE WAS NOT TOWED TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND WAS SENDING AN INSPECTOR TO DETERMINE THE CAUSE OF THE AIR BAG DEPLOYMENT FAILURE. THE FAILURE MILEAGE WAS 841. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "06/17/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000563,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIVE IN LAS VEGAS NEVADA, THIS VEHICLE OVERHEATS AND SHUTS THE AIR CONDITIONER OFF WHEN IT REACHES  75% ON THE TEMPERATURE GAGE. ANYTIME THE OUTSIDE TEMPERATURE IS ABOVE 100+ DEGREES THE CAR WILL REACH 75%  WHILE DRIVING IN ABOUT 30 MINUTES, IF THE CAR IS STATIONARY IT'LL GET THERE IN ABOUT 10 TO 15 MINUTES. HYUNDAI MANUFACTURING HAS SAID THAT THIS IS DUE TO A SMALL RADIATOR AND A SMALL  COOLING FAN BUT WILL CURRENTLY NOT REPAIR THESE ISSUES. MOST HYUNDAI DEALERSHIPS WILL CLAIM THAT THIS IS NOT A PROBLEM OR THAT THE CAR DOES NOT HAVE A PROBLEM. THE PHOTOGRAPHS DEPICT THE TEMPERATURE RISING WHILE DRIVING THE CAR. THE ONLY TIME THE TEMPERATURE WENT DOWN WAS WHEN I MANUALLY SHUT THE AC OFF.",
        "vin": "KMHCT4AE4HU"
    }
]