[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "11/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On 10/27/2020, I financed a Jeep Patriot with 43K miles from Quality Chevrolet. Exactly 6 days later 11/02/2020, while I was on the way home from work in the evening; three sensor lights came on causing the vehicle to jolt / jerk / accelerate and become unsafe to drive. There were cars behind me, I turned on the hazard lights and my car went from 25 MPH to 2 MPH instantly. The lights were ABS, Traction and check engine. I immediately contacted the dealership since I had the Jeep for less than a week. I had to take the risk of driving the car in this condition for 6 miles on a highway back to the dealership, stopping every few minutes to shut off the Jeep and restart to try to reset the sensors, which seemed to work 2 minutes at a time. A drive that would normally take about 15 minutes took over an hour. My Jeep was being paid for weekly and still being serviced at the dealership- On 11/17/2020, I received a call from the dealership that they cleaned out the throttle body as recommended by Jeep and since that was the only sensor active at the time; they told me that no other lights were on so they were driving the Jeep to try to activate them.  I was told by Quality Chevrolet that Jeep recommended to clean out the throttle and return to me, if the lights come back on, to go back to the dealer and replace the part. After weeks at Quality Chevrolet, my jeep was returned to me, however 5 days later on 12/07/2020 the same sensors came on in the middle of a highway when I was going about 55 MPH and it was raining I had to find a way to get my vehicle to safety and this caused a lot of anxiety as my kids were in the Jeep this time. I did not get into an accident by a miracle but now I was stranded on the highway. Til this day, Quality Chevrolet nor the 3 other places I have been to have been able to properly diagnose this problem that continues to happen without warning. My jeep will not go over 20 MPH, RPM stays on 2 and all sensors are active.",
        "vin": "1C4NJRBB6HD"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/16/2021",
        "dateOfIncident": "08/29/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11440714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Patriot. The contact stated that while driving at 25-30 MPH and approaching a stoplight, the brake pedal was depressed but failed to respond and stuck on the floorboard. The contact stated that the vehicle inadvertently accelerated and crashed into the rear of another vehicle. There were no warning lights illuminated. The air bags failed to deploy. The contact was knocked unconscious. The contact stated that his girlfriend sustained knee injuries and his mother sustained a laceration on the face, but none of them sought medical assistance. A police report was filed. The vehicle was towed to a tow lot, then it was towed to an independent mechanic. An unknown dealer was notified of the failure and did not provide any assistance. The manufacturer was not notified of the failure. The vehicle was not diagnosed or repaired. The approximate failure mileage was 50,000.",
        "vin": "1C4NJRFB3HD"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405924,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKS FROM THE MAP LIGHTS WHEN IT RAINS. THIS IS VERY DISTRACTING AND ALSO CAUSES DAMAGE TO THE LIGHT, SUNROOF CONTROLS AND THE CONTROL PANEL BELOW IT (RADIO AND EVERYTHING ELSE). THIS OCCURS WHILE THE VEHICLE IS IN MOTION, AND MORE OFTEN WHEN TURNING AND DRIVING AT HIGHER SPEEDS.",
        "vin": "1C4NJPFA7HD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2021",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404366,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT CITY SPEEDS, THE TRANSMISSION JERKS 2 TO 6 TIMES AT DIFFERENT SPEEDS, TEMPERATURE, WEATHER, TIME OF DAY. THIS ON A 2017 JEEP PATRIOT 2.4L. THIS HAS BEEN HAPPENING SINCE WE BOUGHT IT IN MARCH OF 2020.",
        "vin": "1C4NJRFB2HD"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/17/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD REST ON THE PASSENGER SIDE WAS DEACTIVATED WITH OUT A REASON AND COULD NOT BE PLACE BACK TO ITS ORIGINAL SETTING. THIS HAPPED WHILE DRIVING IN HIGHWAY. LUCKILY THERE WAS NO ONE SEATING AT THE SEAT THAT TIME.",
        "vin": "1C4NJPBBXHD"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11400296,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT WORK IN A 2017 JEEP PATRIOT COMPANY VEHICLE. I AM A FIELD WORKER AND WAS TRAVELING NORTH ON SCHAEFER HWY TO A CLIENTS HOME. I WAS T-BONED AT THE CROSS SECTION OF SCHAEFER AND SCHOOLCRAFT  WHEN ANOTHER VEHICLE DRIVING EAST ON SCHOOLCRAFT  RAN A RED LIGHT- HITTING ME IN THE DRIVER DOOR, AFTER HITTING THE DRIVER DOOR, TURNING HIS/HER WHEELS AND DIGGING INTO THE VEHICLE BY MY FEET, BREAKING THE LEFT FRONT WHEEL OFF THE JEEP. THE SEAT BELT SEEMED TO TIGHTEN TO THE POINT I COULD NOT BREATHE, I FELT A FLUSHING IN MY RIB CAGE, RUPTURING RIGHT IMPLANT, TEARING BOTH SHOULDERS AND NECK, LOW LEFT BACK  EXCRUCIATING PAIN- L5 ANGULAR TEAR, CERVICAL SPINE COMPROMISED EVERY DISC SAME WITH LUMBAR AND THORACIC SPINE SI JOINT NEEDED SURGERY, AND RIGHT HIP HIT DRIVING LOG SO HARD CLIP BOARD WAS BROKE IN HALF, BROKE RIGHT HEEL 2A FRACTURE HEAD TO TALUS AND COMPLETE FULL TEAR OF LIGAMENT, RIGHT KNEE PAIN HANDS LOCKING UP. THE INTERN IN THE VEHICLE STATED SHE WAS NOT INJURED. NO AIR BAGS WENT OFF. MY LEFT FOOT WAS STUCK UP THE BRAKE AND MY RIGHT WAS BROKE FROM HITTING THE COUNSEL. THE DRIVE WHO RAN THE RED LIGHT LEFT THE SCENE. I HAVE LOST MY JOB.  I AM SITTING IN THE VEHICLE WHILE THE INTERN TOOK PICTURES.",
        "vin": "1C4NJPFA7HD"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2020",
        "dateOfIncident": "12/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383954,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOGGLE BODY WAS REPLACED. MY HUSBAND HAD THE EXACT SAME THING REPLACED. SAME MODEL YEAR, BOUGHT A COUPLE OF MONTHS APART. SUDDENLY LOST ACCELERATION ABILITY. COULD NOT KEEP DRIVING, AS THERE WAS NO POWER TO KEEP MOVING ALONG. MALFUNCTION LIGHT AND BOTH SKID/TRACTION LIGHTS CAME ON. WE BOTH MADE IT HOME, TOWED TO DEALERSHIP AS A PRECAUTION. DIDN'T WANT TO CHANCE DRIVING ANY LONGER.",
        "vin": "1C4NJRBB1HD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360838,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S A STANDARD TRANSMISSION AND THE CLUTCH JUST WENT OUT. IT HAS LOW MILES ON IT AND IS USED TO GET TO WORK AND BACK, AROUND 10 MILES OR LESS ONE WAY. MECHANIC DIDN'T UNDERSTAND WHY IT WOULD GO OUT SO QUICKLY ON A VEHICLE WITH SUCH LITTLE MILEAGE ON IT. IT'S AROUND 46,000 MILES. IT WAS BEING DRIVEN WHEN THE CLUTCH JUST WOULDN'T GO INTO GEAR ANYMORE AND HAD TO BE TOWED.",
        "vin": "1C4NJPBA0HD"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2020",
        "dateOfIncident": "06/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330458,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION OVERHEAT LIGHT TRIGGERS ONLY IN HEAT AT EXTENDED PERIODS OF HIGHWAY SPEED. HAS HAPPENED 5 TIMES. CAR LOOSES POWER AT HIGHWAY SPEEDS QUICKLY. MUST PULL OVER AND WAIT FOR IT TO COOL.  DEALER SAID THEY COULDN'T GET IT TO SHOW UP SO THEY WOULDN'T DO ANYTHING ABOUT IT.  *TR",
        "vin": "1C4NJRBB1HD"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321882,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 02/20/2020 THE FRONT BRAKES MAKING SCRICHING NOISE WHICH HAPPENS WHEN L BRAKE @ 35 MILES AN HR OR WORSE NOISE WHEN L BRAKE @ 45 MILES PER HOUR DRIVING STRAIT OR MAKING A RIGHT TURN..  ON 2/20/2020 TOOK TO JEEP DEALER FOR REPAIR AND THIS IS WHEN L TOOK JEEP PATRIOT 2017  THE FIRST TIME FOR SERVICE. THE SERVICE REPORT SHOWS THE FOLLOWING WORK WAS DONE: INSTALLED 2AMV3494AB PAD KIT:FRONT DISK BRAKE INSTALLED 5512:BRAKE KIT. INSTALLED 6502738: NUT; WHEEL AFTER INSP FRONT BRAKE 3 TO 2 MM REAR, 5 MM RESURFACE FRONT ROTORS AND FRONT PAFS. PERFORM BRAKE FLUID EXCHANGE CAUSE BY RECOMMENDED. INSTALLED DOT364: BRAKE FLUSH DOT 3 PERFORMED SERVICE. THEN ON  3/17/2020 ( APROX 4 WEEKS LATER) THE SAME FRONT  BRAKES MAKING A WORSE NOISE; TOOK BACK TO JEEP DEALER TO RE-CHECK. DEALER SERVICE AND DEALER SERVICE FOUND THAT NOTHING WAS WRONG OR HEARD ANY BRAKE SCRITCHIN NOISE. THE WORK AND EVERYTHING WAS OK: DEALER REPORT SHOWS MY JEEP PATRIOT 2017 CHECK FOR  ABS CODE AND  NOTHING FOUND, EVERYTHING OK.  4/07/2020 BRAKE NOISE BACK AGAIN IN MY FRONT BRAKES AND MORE NOISE WHEN L BRAKE AT 30-45 TOOK VEHICLE TO JEEP DEALER FOR THIRD TIME; THIS TIME THEY HEARD THE NOISE, CLEAN/ SAND PADS AND ROTORS,LUBE HARDWARE, PERFORM TEST DROVE BY DEALER SERVICE, VEHICLE NOISE NOT PRESENT. VEHICLE BRAKES AS DESIRED.  NOW AGAIN ON 4/20/2020 THE NOISE IS BACK AGAIN, BUT NOT ON BOTH FRONT BRAKES, BUT IT APPEARS IT'S ON THE LEFT FRONT BRAKES..HAVE APPT WITH JEEP DEALER SERVICE TODAY 4/22/2020 TO HAVE THAT NOISE CHECK.",
        "vin": "1C4NJRBB1HD"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/25/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319285,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SITTING STILL AT RED LIGHT ALL AT ONCE CAR ROLL FORWARD  PUSH DOWN ON BRAKE CAR GO FAST  WITH FEET ON BRAKE CAR STILL GO FAST HIT   CAR IN THE BACK END    ON HIGHWAY",
        "vin": "1C4NJRFB0HD"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/08/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307925,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DAY 3 OF DRIVING ON HIGHWAYS FOR A LONG DISTANCE VACATION TRIP, THE FRONT END STARTED MAKING NOISES; COULDN'T PINPOINT LOCATION OF NOISE.  SUSPECTED WHEEL CALIPER ON FRONT DRIVERS' SIDE, OR SOMETHING IN THAT AREA.  DAY 4, I KNEW I HAD TO DO SOMETHING.  NOISE WAS STILL THERE; NOISE WOULD SLOW DOWN AND DISAPPEAR WHEN APPLYING BRAKES, YET WAS STILL THERE AT SLOW SPEEDS. DROVE TO A PEPBOYS; NOISE BECAME WORSE, AND I HAD DIFFICULTY TURNING  TIGHT CORNERS TO PULL INTO THEIR PARKING SPACE.  WAS TOTALLY AFRAID TO DRIVE THE CAR ANY FURTHER.  PEPBOYS DID SOME ROAD TESTING, AND PUT CAR UP ON LIFT.  MY FRONT CONTROL ARMS HAD RUSTED AND TORN BUSHINGS.  PEPBOYS REPLACED THE CONTROL ARMS AND I HAVE NOT HAD ANY PROBLEMS SINCE (INCLUDING RETURN 3-DAY HIGHWAY DRIVING TRIP).  I CONTACTED JEEP TO SEE IF THEY WOULD REIMBURSE ME THE COST OF THE CONTROL ARMS SINCE MY CAR WAS STILL UNDER WARRANTY; THEY WOULD NOT.  CAR WAS PURCHASED NEW ON 2/16/2017.  MILEAGE IN AT PEPBOYS WAS 28,936.  I HAVE BOTH CONTROL ARMS; ATTACHED PICTURES ARE OF THE BUSHINGS.  CAN TAKE MORE PICTURES IF NECESSARY.",
        "vin": "1C4NJRFB1HD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306679,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2017 JEEP PATRIOT IN FEB 2017 FROM LEE AUTO MALL IN APRIL 2018 THE MOTOR BLEW WITH 48,000 MILES ON IT WHILE I WAS DRIVING OUT OF WORK ON A CITY STREET.  IT WAS REPLACED UNDER THE MANUFACTURE WARRANTY APRIL 2018.   MY CHECK ENGINE LIGHT CAME ON AGAIN JANUARY 2019 MAKING A KNOCKING NOISE.  BROUGHT  THE TRUCK IN TO THE CHRYSLER SHOP TO HAVE IT LOOKED AT.  I WAS AGAIN TOLD MY MOTOR THEY REPLACED NOT EVEN A YEAR AGO WAS BLOWN.  THE PISTON AND RODS WERE BAD AND WAS NO LONGER UNDER WARRANTY AND IT WOULD COST ME 7,000 TO REPLACE THE MOTOR.  THIS IS A 2017 JEEP PATRIOT THAT IS NOW ON ITS 3RD ENGINE IN LESS THAN 3 YEARS.  CHRYSLER NOR CHARLIES MOTOR MALL JEEP WILL NOT HELP ME IN ANY WAY AND SAY THAT I NEED TO PAY 7,000 DOLLARS TO HAVE A NEW ENGINE PUT IN.  THE FIRST ENGINE ONLY HAS 48,000 MILES ON IT WHEN IT BLEW AND THE SECOND ENGINE THEY PUT IN ONLY HAD 55,000 MILES ON IT WHEN I WAS TOLD IT NEEDS TO BE REPLACED AGAIN.",
        "vin": "1C4NJRBB7HD"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "01/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302759,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY, JAN 26, 2020, I WAS DRIVING  FROM EAGLE RIVER, AK TO JOINT BASE ELMENDORF-RICHARDSON ON THE GLENN HIGHWAY. I NOTICED THAT THE HOOD OF MY 2017 JEEP PATRIOT WAS BOUNCING. I REDUCED MY SPEED AND MOVED INTO THE FAR RIGHT LANE UNTIL I WAS ABLE TO EXIT THE HIGHWAY SAFELY. WHEN I PULLED INTO THE PARKING LOT ON BASE, I FOUND THAT THE HOOD RELEASE HAD  POPPED, BUT THE SAFETY LATCH WAS STILL ENGAGED. I RELEASED THE SAFETY LOCK, RAISED THE HOOD AND THEN CLOSED IT.. I THEN TOOK MY PATRIOT TO THE JEEP DEALER IN ANCHORAGE AND THEY CHECKED IT OUT AND TOLD ME THAT IT WAS SAFE TO DRIVE MY JEEP.",
        "vin": "1C4NJRBBXHD"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/08/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWER MOTOR FOR HVAC FAILS WITHOUT NOTICE ON ALL SPEEDS.   RESULTS IN \"FOGGY\" WINDSHIELD AND LACK OF DEFROST FEATURE AND DE-ICE FEATURES.    THIS CAN RESULT IN THE VEHICLE RESTRICTING VISION WHILE DRIVING OR CAUSE THE DRIVER TO BEGIN A TRIP ONLY TO REALIZE THAT THEY CAN'T SEE.    IN RAPIDLY CHANGING CLIMATES - THE FAILURE OF THE BLOWER MOTOR MAY RESULT IN SUDDEN AND UNPLANNED RESTRICTED VISION.    ISSUE APPEARS TO BE RELATED TO BLOWER MOTOR RESISTOR AS A TESTED FAILURE POINT.       IT SHOULD BE NOTED THAT MANY OTHER OWNERS WITHIN THE JEEP COMMUNITY HAVE EXPERIENCED SIMILAR FAILURES ACROSS MANY MODELS OF JEEP PRODUCTS BASED ON RESEARCH.  *TR",
        "vin": "1C4NJRBBXHD"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291821,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN A PERSON SITS DOWN AND BUCKLES UP ON THE FRONT PASSENGER SEAT THE SEAT BELT SENSOR CHIMES. IT DOESN'T MATTER IF THE ENGINE IS OFF/ON OR  IN MOTION WHEN THE SEAT BELT IS BUCKLED THE SEAT BELT CHIME WILL GO ACTIVATE.    THE PASSENGER SEAT BELT SENSOR IS MALFUNCTIONING. THE SEAT BELT SIGNAL GOES OFF RANDOMLY WHEN A PASSENGER IS RIDING WHILE WEARING THE SEAT BELT.",
        "vin": "1C4NJPBB8HD"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289886,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHAT HAPPENED: WHILE DRIVING AT 20 MPH I HEARD A LOUD BANG AND SWERVING OF THE VEHILCE WHICH I THOUGHT WAS A FLAT TIRE. I FOUND THAT THE LEFT REAR WHEEL FELL OFF CAUSING LOSS OF CONTROL OF THE VEHICLE WHICH I WAS ABLE TO STOP WITHOUT CRASHING DUE TO MY EMERGENCY VEHICLE DRIVING WITH THE STATE PATROL. WHEN STOPPED SAW THAT THE WHEEL HAD FALLEN OFF AND THE CONTROL ARM BROKEN. (PHOTO)  DIAGNOSIS: NORTH BEND CHEV REPAIRED THE VEHICLE AND FOUND THAT THE LEFT REAR CONTROL ARM HAD SEVERED (PHOTOS) IN HALF DAMAGING THE AXLE. THE THREADS ON THE INSIDE OF THE CONTROL ARM APPEAR TO BE WORN AWAY. THE DEFECTIVE CONTROL ARM WAS REPLACED WITH A NEW ONE WHICH IS A SINGLE PIECE WITHOUT A DETACHABLE THREADED PART AND THIS PROBLEM SHOULD HAVE BEEN KNOWN BY JEEP.  REPAIRS: COST $1392 (BILL ATTACHED). THE RIGHT CONTROL ARM WAS INSPECTED BUT NOT REPLACED WITH THE IMPROVED PART.  MY CONCERNS: MINUTES PRIOR TO THIS INCIDENT I HAD DRIVEN DOWN A STEEP CURVING SECONDARY ROAD WHERE THIS WOULD HAVE RESULTED IN COMPLETE LOSS OF CONTROL AND CRASHING AS WELL AS POSSIBLY A COLLISION WITH ONCOMING TRRAFFIC. A MINUTE LATER I WOULD HAVE ENTERED THE INTERDATE AT 60-870 MPH AND A CATASTROPHINC CRASH WOULD HAVE RESULTED, POSSIBLY INVOLVING MULTIPLE VEHICLES. IF THE BROKEN CONTROL ARRM COULD NOT BE IDENTIFIED AS THE CAUSE OF THE CRASH IT WOULD HAVE BEEN CALLED THE RESULT OF AN 84 YEAR OLD MAN DRIVING HAVING A POSSIBLE HEART ATTACK/MEDICAL PROBLEM RATHER THAN A VEHICLE FAILURE.   I CONSIDER MYSELF VERY LUCKY THAT THIS HAPPENED AT A SLOW SPEED AT THE PLACE IT HAPPENED.  REMEDY:  I FEEL THAT THIS IS AN UNDETECTED FAILURE OF THE CONTROL ARM WHICH WOULD NEVER HAVE BEEN DETECTED DURING NORMAL VEHICLE MAINTENANCE INSPECTIONS. I CAN HAPPEN TO ANYONE DRIVING THIS MODEL VEHICLE AND SHOULD BE INVESTIGATED FOR A POSSIBLE RECALL BEFORE SOMEONE'S LIFE IS JEOPARDIZED.",
        "vin": "1C4NJRBB6HD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "09/26/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277373,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 75 MPH, THE TRANSMISSION STARTS MAKING A WHINING NOISE, AND THE TRANSMISSION WARNING INDICATOR ILLUMINATES, THE VEHICLE DECELERATES AND LOSES POWER. WE COAST THE VEHICLE OVER TO THE ROAD SHOULDER, WAIT AWHILE AND THE WARNING LIGHT GOES OFF.  THIS HAPPENED FOUR TIMES IN SUCCESSION ON OUR LAST TRIP OF 240 MILES. IT HAS HAPPENED AT THE VERY LEAST 10 TIMES ON THE SAME TRIP TO WEST VIRGINIA. THE VEHICLE WAS TAKEN TO JOHNSON FAMILY CHRYSLER DODGE JEEP RAM, FLOYD, VIRGINIA, ALSO MOTOR MILE CHRYSLER DODGE JEEP RAM CHRISTIANSBURG, VIRGINIA, AND MILLER'S CHRYSLER DODGE JEEP RAM MARTINSBURG, WEST VIRGINIA. AS OF OCTOBER 31ST 2019 JOHNSON FAMILY HAS NOT BEEN ABLE TO REPLICATE THE PROBLEM. THEY HAVE HAD THE CAR FOR 27 DAYS! VIN #[XXX] WITH APPROXIMATELY 24,000 MILES.    HERE IS AN EXACT REPLICA OF WHAT HAPPENS:    HTTPS://YOUTU.BE/37P1X0YMPZE  HTTPS://YOUTU.BE/-STUUH2MMEO    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1C4NJRBB2HD"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "10/04/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266184,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 80 MPH, THE TRANSMISSION WARNING INDICATOR ILLUMINATED, AND THE VEHICLE DECELERATED AND LOST POWER. THE CONTACT COASTED THE VEHICLE OVER TO THE ROAD SHOULDER, WAITED AWHILE, RESTARTED THE ENGINE, AND WAS ABLE TO DRIVE SAFELY.",
        "vin": "1C4NJRBB2HD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219733,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP PATRIOT. WHILE DRIVING 75 MPH,  THE TRANSMISSION WARNING INDICATOR ILLUMINATED, AND THE VEHICLE DECELERATED AND LOST POWER. THE CONTACT COASTED THE VEHICLE OVER TO THE ROAD SHOULDER, WAITED AWHILE, RESTARTED THE ENGINE, AND WAS ABLE TO DRIVE SAFELY. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER TO BE DIAGNOSED, BUT THE FAILURE COULD NOT BE REPLICATED. THE VEHICLE WAS THEN TAKEN TO YOUNG BLOOD CHRYSLER DODGE JEEP (3525 S. CAMBLE, SPRINGFIELD, MO 65807, 417-882-3838) WHERE IT WAS DETERMINED THAT IF THE VEHICLE WAS DRIVEN OVER 75 MPH, THE TRANSMISSION WOULD OVERHEAT. FLUIDS WERE PLACED IN THE TRANSMISSION ALONG WITH A FOAMING GEL FOR THE POWER TRAIN. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 36,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "05/28/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218444,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND HEARD A NOISE I TOOK MY VEHICLE TO THE DEALERSHIP THEY SERVICED IT AND THREE DAYS LATER THE NOISE CAME BACK A WHINING NOISE.  ALL OF A SUDDEN IT DIDN'T WANT TO MOVE FORWARD THE WHINING INCREASED, THEN THE OVERHEATED WARNING LIGHT CAME ON, THEN INABILITY TO ACCELERATE. FINALLY THE TRANSMISSION LIGHT CAME ON. I TOOK IT BACK TO THE DEALERSHIP THEY CALLED THE WARRANTY PEOPLE AND I WAS TOLD BECAUSE I DIDN'T DO EVERY MAINTENANCE SUGGESTIONS THEY WILL NOT HONOR THE LIFETIME WARRANTY ON THE PART. THIS HAPPENED WITH NO PRIOR WARNING FROM THE SERVICE OF THE VEHICLE OR PERFORMANCE OF THE VEHICLE. I FEEL THIS WARRANTY SITUATION IS A SCAM AND THEY SHOULD BE HELD LIABLE!",
        "vin": "1C4NJPBA4HD"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217141,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP PATRIOT. THE CONTACT STATED THAT THE VEHICLE FAILED TO START OCCASIONALLY AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO NAPLETON NORTHLAKE CHRYSLER DODGE JEEP RAM (3701 NORTHLAKE BLVD, LAKE PARK, FL 33403, (888) 520-8157) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE DEALER REPAIRED THE IGNITION SWITCH AND REPLACED THE BATTERY, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE FAILURE MILEAGE WAS 22,000. THE VIN WAS INVALID.",
        "vin": "1C4NJPBA6HD"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216962,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING TO PENNSYLVANIA FROM GEORGIA, WHEELS LOCKED AND ABS, TRACTION AND 4 WHEEL DRIVE LIGHT CAME ON. SPEED LIMIT WAS 70, MY CAR JUST LOCKED THE WHEELS. WENT TO A DEALER GOT PROBLEM FIXED. THEN COMING BACK FROM FLORIDA ON 5/ 25/2019. SAME THING HAPPEN AGAIN. THIS TIME THE WHEELS LOCKED AND I SLID UNTIL THE CAR STOPPED. I'M A DISABLED VETERAN, HAVE SEEN UNSAFE THINGS. THIS IS GOING TO KILL SOMEONE. THE MECHANICS TELL ME JEEP KNOWS THIS IS HAPPENING. GOD HELP US THAT DRIVE THESE VECHILES. TO POOR TO BUY A NEW ONE",
        "vin": "1C4NJRBB0HD"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "01/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A TENDENCY TO NOT START WHEN IT'S SUPPOSE TO. IT WAS CHECKED AND STILL HAVE THE PROBLEM. THE VEHICLE ALSO HAS NOISE COMING FROM THE REAR END OF THE CAR WAS SENT TO FIX AND THE NOISE STILL PERSIST BECAUSE OF THE PART THAT THE COMPANY ORDERED IS NOT LUBING. THE VEHICLE ALSO HAVE A NOISE COMING FROM THE FRONT WHEN YOU TURN THE STEERING WHEEL ALL THE WAY TO THE RIGHT. THIS VEHICLE HAS BEEN GIVING ME PROBLEMS EVER SINCE MY 30DAY MARK WAS UP TO RETURN IT. HOWEVER WHEN I RETURN THE DEALER WITH THE ISSUE ITS LIKE HE FELT LIKE I WAS LYING SO I CAN GET A BETTER VEHICLE. THIS VEHICLE IS STILL GIVING ME PROBLEMS UP TO THIS DAY. I EVEN WENT TO GET HELP FOR THEN TO ACTUALLY FIX THE CAR AND MY CASE WAS THROWN OUT THE WINDOW LIKE IT DID NOT MATTER. I AM STILL PAYING FOR THIS VEHICLE MONTHLY AND I FEEL LIKE I DID NOT GET TO ENJOY MY VEHICLE BEFORE IT STARTED TO GIVE PROBLEMS.",
        "vin": "1C4NJRBB2HD"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2019",
        "dateOfIncident": "05/28/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210590,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING COOLER LINE FAILING AND LEAKING ON EXHAUST AND CATCHING FIRE. WE ARE A LEASING COMPANY AND HAVE 13 OF THESE. ONE HAS ALREADY BURNT TO THE GROUND AND ANOTHER CAUGHT FIRE TODAY BUT WAS ABLE TO BE PUT OUT. WE ARE GROUNDING THE REST OF THESE UNTIL WE FIGURE SOMETHING OUT. *DT  *TR",
        "vin": "1C4NJRFB8HD"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "02/23/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173607,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP PATRIOT. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED AND ALL THE WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO HANCOCK COUNTY CHRYSLER, DODGE, JEEP, RAM (845 WASHINGTON ST, NEWELL, WV 26050, (304) 387-3100) TO BE DIAGNOSED, BUT NO FAILURE CODES WERE LOCATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 23,255. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/16/2018",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161848,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE BRAND NEW FROM A JEEP DEALER IN 2017. I NOTICED LESS THAN TWO WEEKS AFTER PURCHASE THAT THE PASSENGER SEAT BELT SENSOR WAS MALFUNCTIONING. THE SEAT BELT SIGNAL GOES OFF RANDOMLY WHEN A PASSENGER IS RIDING WHILE WEARING THE SEAT BELT. MY 19 YEAR OLD DAUGHTER HAS INTELLECTUAL DISABILITY AS WELL AS A FEAR OF ALARMS OF MANY TYPES, INCLUDING THE SEAT BELT SIGNAL. IT IS MORE THAN AN INCONVENIENCE, IT'S AN ONGOING ANNOYANCE.",
        "vin": "1C4NJRBB9HD"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "09/24/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11132893,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REAR ENDED WHILE STOPPED IN HEAVY TRAFFIC ON A MAJOR HIGHWAY. I WAS SITTING ON THE DRIVERS SEAT. MY CAR SEAT HAD A SEAT BACK FAILURE AS SOON AS THE AT FAULT CAR IMPACTED ME. MEANING INSTEAD OF HOLDING ME IN PLACE IT JUST FLIPPED BACK WITH MY HEAD AND SHOULDERS ENDING ON BACKSEAT. I WAS PUSHED INTO THE CAR IN FRONT AND THE AIRBAG DIDN'T DEPLOY BUT THE HEADRESTS DID. I SUSTAINED HEAD BACK AND NECK INJURIES AS WELL AS BRUISES ON THE BACK OF MY CALVES FROM HITTING THE REAR/FORWARD BAR ON BOTTOM OF SEAT. AS THE CAR IMPACTED ME MY PELVIC AREA WAS TRUST SLIGHTLY BECAUSE THE SEATBELT IN PLACE DIDN'T HOLD ME AS I BASICALLY SLID A BIT OF IT WHEN BENDING BACKWARDS ON MY SEAT. THE VEHICLE WAS STATIONARY ON DRIVE BUT MY FOOT FIRMLY PLANTED ON BRAKE. THE DRIVER WHO HIT ME PUSHED ME INTO THE FRONT SEAT BUT BY THE TIME I HIT IT I WAS ALREADY ON MY BACK, SO CAR SEAT FAILURE HAPPENED ON REAR IMPACT, BEFORE I HIT CAR IN FRONT. SINCE WE WHERE IN THE MIDDLE OF THE HIGHWAY I HAD TO MOVE THE CAR TO THE RIGHT SHOULDER AND WHILE DAZED PULLED UP SIDE LEVER TO BRING CAR SEAT BACK, AND IT DID. SO THIS DEFECT IS BASICALLY INVISIBLE UNLESS YOU ACTUALLY EXPERIENCE IT.",
        "vin": "1C4NJPBA0HD"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "07/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112124,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING UP TO A RED LIGHT, STOPPED AND THE ENGINE STARTED TO REVVE UP ALL BY ITSELF. I PROCEEDED THROUGH THE GREEN LIGHT WITH MY FOOT ON THE GAS THE VEHICLE DID NOT WANT TO ACCELERATE ,I  PULLED INTO A PARKING LOT, PUT IN PARK AND SHUT THE VEHICLE OFF. THIS HAPPENED AFTER MY FIRST OIL CHANGE AROUND 5000 MILES. I RESTARTED THE VEHICLE ABOUT 10 MINUTES LATER AND IT DROVE FINE. I DROVE TO THE DEALERSHIP WHERE I HAD THE OIL CHANGED. THE ATTENDANT HOOKED THE VEHICLE UP TO A COMPUTER CHECK AND NOTHING SHOWED UP. I DROVE WITHOUT ANY ISSUES UNTIL AFTER MY LAST OIL CHANGE, I DROVE FROM PHOENIX TO PRESCOTT AZ. I TOOK THE EXIT TO PRESCOTT AND SLOWED DOWN TO 35 WHEN I GOT TO MAYER AZ, I STEPPED ON THE GAS AFTER GOING THROUGH TOWN TO ACCELERATE, IT WOULD ONLY ACCELERATE TO 40 MPH WITH MY FOOT PRESSED ALL THE WAY DOWN ON THE GAS PEDAL. I PULLED OVER AND PUT IT IN PARK. I LET IT SIT AND STEPPED ON THE ACCELERATOR THE VEHICLE WENT AGAIN, I CAME UP TO A STOP LIGHT AND WHEN I PROCEEDED TO GO IT STARTED REVVING AGAIN. I MADE IT THROUGH THE STOP LIGHT AND PULLED OVER AND TURNED THE VEHICLE OFF. SINCE I RESTARTED IT AND AM BACK IN PHOENIX I HAVE NOT HAD ANY ISSUES YET. THERE IS SOMETHING SERIOUSLY WRONG WITH THIS VEHICLE. I AM TAKING IT BACK TO THE DEALERSHIP AGAIN. I LOOKED ONLINE AND FOUND THIS HAS BEEN A PROBLEM WITH JEEPS FROM PREVIOUS YEARS, NEEDS TO BE RESOLVED. THANK YOU",
        "vin": "1C4NJRFBXHD"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "04/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084293,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TWO NON VERBAL AUTSTIC BOYS, I HEARD MY SON GASPING I PULLED OVER AND THE REAR SEAT BELT HAD RETRACTED UNDER HIS RIB CAGE, I KICKED OUT THE BOOSTER SEAT AND LIFTED HIM INTO MY LEG HIGHER TO ATTEMPT TO PULL THE BELT, HE COULD NOT BREATH, IT ONLY GOT TIGHTER AND THE TENSION WAS SO TIGHT THE LAP LOCK WOULD NOT RELEASE, I CALLED 911, THEY HAD NO CHOICE BUT TO CUT THE BELT. IT ONLY GOT TIGHTER. THE DEALERSHIP GUY CHECKED THE OTHER BELT AND SAID IT ONLY LOCKS ALSO WHEN IT WANTS, AND REMEMBER ME COMPLAINING TO HIM THE DAY I BOUGHT IT. AT THIS TIME IT'S IN SHOTTENKIRK AT MOUNT PLEASANT IOWA I'M IN A LOANER, CHRYSLER ASSIGNED A CASE MANAGER AND I'VE HEARD NOTHING, THE SALES GUY SAID REPORT IT BECAUSE CHRYSLER WILL SWEEP IT UNDER THE RUG, MY AUTISTIC CHILD NOW HAS TO BE RE TAUGHT TO GET BACK INTO A CAR, HE IS TERRIFIED, I DID GET HIM TO HIS DOCTOR.",
        "vin": "1C4NJPBB7HD"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/04/2018",
        "dateOfIncident": "01/17/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11066883,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WOK IN A JEEP PATRIOT 2017 ON A CITY STREET  THE BRAKES WOULD NOT  WORK SUDDENLY AND THE SPEED INCREASED RAPIDLY UNCONTROLLABLY. TWO VEHICLES HIT ME GOING THRU AN INTERSECTION AND THE JEEP PATRIOT VEHICLE RAN INTO A WAREHOUSE GOING  THRU 2 METAL DOORS AND A BRICK WALL WITHOUT ANY AIR BAGS DEPLOYING. THE JEEP PATRIOT COMPLETELY WENT INTO THE WAREHOUSE AND WAS STOPPED BY HITTING A LARGE PILLAR.",
        "vin": "1C4NJRBB4HD"
    },
    {
        "components": "STEERING,SUSPENSION,EXTERIOR LIGHTING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "07/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP PATRIOT. WHILE DRIVING 65 MPH, THE STEERING WHEEL VIBRATED AND THE VEHICLE PULLED TO THE RIGHT AFTER A STOP. ALSO, THE TIRE PRESSURE WARNING INDICATOR WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO KUNES COUNTRY CHRYSLER DODGE JEEP RAM OF OREGON, 601 GALE STREET, OREGON, IL 61061) WHERE IT WAS DIAGNOSED WITH A BENT RIM. THE EXACT RIM WAS UNKNOWN; HOWEVER, IT WAS REPLACED. THE CONTACT STATED THAT THE FAILURE PERSISTED AND THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER SIDE LOWER CONTROL ARM WAS BENT. THE CONTROL ARM AND AXLE SHAFT WERE REPLACED; HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN BACK TO THE DEALER A THIRD TIME AND WAS AWAITING DIAGNOSES. THE CONTACT MENTIONED THAT THE HEADLIGHTS WERE ALSO TURNED TOWARDS THE GROUND AND THE DEALER ADJUSTED THE DIRECTION AND REPLACED THE PASSENGER SIDE HEAD LAMP. THE CONTACT ALSO STATED THAT SHE WAS INFORMED BY THE DEALER OF A BLOWN TIRE BELT THAT WAS REPLACED, BUT WAS UNAWARE OF WHICH TIRE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 3,300.",
        "vin": "1C4NJPBA3HD"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/23/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025131,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE SEATBELT ALARM, WILL SOUND CONTINUOUSLY WHEN SOMEONE IS SEATED IN IT.",
        "vin": "1C4NJPBA5HD"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/15/2017",
        "dateOfIncident": "09/14/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023639,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "PATRIOT",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FROST WAS ON WINDSHIELD AND BACK WINDOW. I TURNED ON THE REAR WINDOW DEFROSTER TO CLEAR WINDOW. THE REAR WINDOW HAS AN EMBEDDED WIPER.     AFTER DRIVING APPROXIMATELY 10 MILES WE PARKED THE VEHICLE. JUST AFTER EXITING THE REAR WINDOW EXPLODED LIKE A GUNSHOT. THE CENTER OF THE WINDOW HAD DISINTEGRATED LEAVING A ROUGHLY RECTANGULAR SHAPE. THE BOTTOM OF THE MISSING GLASS RECTANGLE WENT DOWN TO THE IMBEDDED WIPER.    THE JEEP PATRIOT WAS RENTED FROM ENTERPRISE CAR RENTALS. LICENSE NUMBER HMJ3405 UNIT NUMBER 7N3MKQ",
        "vin": ""
    }
]