[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/31/2022",
        "dateOfIncident": "03/29/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459084,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Grand Cherokee. The contact stated while driving 20 MPH on a local street, the vehicle shifted abnormally hard and the transmission made a loud banging sound. The contact stated that the check engine warning light was illuminated. The contact pulled over and took the vehicle to an independent mechanic, where it was determined that several transmission clutches needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 110,000.",
        "vin": "1c4rjeag5hc"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2022",
        "dateOfIncident": "03/30/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458946,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I have a 2017 Jeep GC Limited with 55K miles that had the \"Service Shifter\" warning light come on. Vehicle ran fine no issues. Made appt. with local Jeep Dealership and drove the Jeep in yesterday (03/29/22). Ran just fine, I just wanted the light cause diagnosed and fixed. Dealership ran a diagnostic on it and informed me it needed an updated software flash. Conducted the Flash. NOW... the vehicle is inoperable without a complete Electronic Shift Module (ESM) replacement. They could not even reverse what they did so I could drive home. What they did was IRREVERSIBLE and I would have to leave the car there until they could find a NEW ESM and install it for $900! I had to take a Uber home and have no vehicle. This is not right for a vehicle with only 55K miles that was running just fine into the Jeep dealership. This is a very common problem on JEEP Cherokees. If ESM is known defective part by JEEP and is a Safety risk since many owners have the shifter lock up while driving the vehicle and cannot shift without shutting down the vehicle several times in the middle of traffic. Please help!",
        "vin": "1C4RJFBG6HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "02/21/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457767,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Warranty ended on 2/7/22. Car has 58,300 miles. Experienced white smoke coming from the engine on 2/21/22. Took to the dealership right away and diagnosed a warped cylinder head, leaking water pump, and bad starter motor. Never saw the temperature high on the car. The white smoke was experienced after sitting overnight. Also Catalytic converter may have issues. Called Jeep customer service and could not extend “good will” coverage to pay for the repairs.",
        "vin": "1C4RJEAG5HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "01/14/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453354,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Started my 2017 Jeep Grand Cherokee after a heavy snow fall the next day drove about 10 minutes and horn started going off lights exterior and interior started flashing, faults came across the screen to service every imaginable function from transmission to power steering and everything in between and truck just completely failed on the road. Waited roughly 30 minutes truck fired back up drove about 200 feet to a gas station while waiting for a tow truck. Brought to the dealership and they flashed 9 different modules. All seemed fine until another month. Remote started Jeep went to get in dash cluster screen black. Turned off and back on cluster came back but was delayed along with heck engine light. Drove back to dealership and was told they wouldn’t be able to look at it for 3 weeks. About a week after the cluster incident I go to leave my house, make it about 30 feet out of my driveway and truck stalls again exactly like how it did the first time. At a different mechanic now for it to get diagnosed. With the history of poorly made tipms in Chrysler products this seems to be a reoccurring theme.",
        "vin": "1c4rjfag7hc"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "02/12/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451761,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle had a complete shutdown while being driven.  While driving on the highway, several dashboard warning lights began to appear. Within seconds afterwards, the headlights went out, along with the dashboard lights and radio.  The vehicle became difficult to steer and then the vehicle lost all power, and could not be restarted.  The vehicle was picked up from the dealership the day prior to this occurrence, and the PCM had just been replaced. The vehicle had been towed to the dealership just short of two weeks earlier, after it wouldn't start, having replaced the battery, and experiencing the passenger front window to randomly go down.  This incident fortunately did not result in any crash or injury, however, it is only a matter of time if it isn't correctly diagnosed and fixed, as this problem results in an extremely hazardous condition.",
        "vin": "1C4RJFJT6HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449202,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver side headlamp assembly highbeam function inoperative, lens shutter does not activate.  Vehicle operator is unable to safely see road, hazards and surrounding area in front of the vehicle when function is commanded to on. This puts other the vehicle operator, other vehicle operators and bystanders in the area at high risk of death or severe injury.  The condition has been replicated by 3 certified technicians  No other symptoms",
        "vin": "1C4RJFLG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "10/25/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446641,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Beginning two months ago my passenger side front window began rolling down on its own and the dash board lights would continually flash on and off. When at a stop sign or red light the vehicle idles down as low as 9. The battery was checked by the dealership and I was told it did not require replacement. The tachometer drops to zero while the vehicle is in motion and on two of those occasions the vehicle just shut off. When these incidences occur, which has been regularly for the past two weeks, upon exiting the vehicle I receive several palpable electric shocks. The car is now parked because I am afraid the car will  set afire. I have been told by several dealerships that they can't get me in for a week or more to check the issue. I am very concerned for my safety due to this electrical issue, especially receiving the shocks.",
        "vin": "1c4rjfbg5hc"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/17/2021",
        "dateOfIncident": "10/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444099,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Battery vent tube disconnected from the battery causing toxic gas to leak into the passenger compartment. Driver had been experiencing worsening feeling of suffocation for several months prior to discovery of the issue, which was found when replacing the original battery. Vent tube was reconnected and symptoms resolved completely within 72 hours. Approximately 6 weeks later, driver began experiencing the same symptoms, checked the battery vent tube and found that it was once again disconnected. Retaining feature does not appear sufficiently to retain the vent tube throughout vehicle life. Vehicle has less than 40,000 miles.",
        "vin": "1C4RJFBG2HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/14/2021",
        "dateOfIncident": "11/13/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on highway and the stop safely your car about to turn off popped up then my lights started flashing and the whole car shut down. I couldn't steer or brake so I had to shift into neutral and hope for the best. It scared me to death. My children were in the car. I just replaced the alternator, both batteries and had the vehicle reprogrammed and 2 days later that happened.",
        "vin": "1C4RJFBG7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2021",
        "dateOfIncident": "10/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437469,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "We were driving up I95 and our Jeep made a weird noise. We thought we had hit something, but we had not. When we tried to put the car into gear it would not and we could not drive it.  Jeep does not have a recall of this vehicle, but doing a simple search online I have found multiple sites that note 2017 Jeeps having the same issues with transmission.  This is a costly repair that should be covered by the company because it is a well known issue. Here are some of the articles I found with their web addresses:  Jeep RecallIn the middle of 2020, Jeep was forced to recall almost 100,000 Jeep Cherokees due to transmission problems. Fiat Chrysler promised to install and update the new software into the specific model so that the malfunctions will not occur again – and if they do, the driver will immediately be alerted to the ongoing problem.The affected Cherokee cars had a transmission concern that could potentially lead to a loss of power while driving, causing an increased risk of a crash and safety issues. The company issued a statement at the time of the recall, addressing the potential transmission slipping, loss of propulsion, and lack of transmission engagement.The Jeep Cherokees in the recall were produced between the 2014 and 2017 model years, with the affected models having an extremely high Jeep transmission repair cost and safety concerns. The models are almost exclusively all-wheel-drive options between 2014-2-17, with a two-speed Power Transfer Unit. https://www.cashcarsbuyer.com/jeep-transmission-repair-cost/ While the 2015 transmission receives a lot of notice, there are other vehicles in the Jeep Grand Cherokee lineup that have also had problems reported by consumers. One key complaint is repeated in the 2016 and 2017 model years.In these vehicles, the driver notes the vehicle lurches forward when the gas pedal is depressed, specifically when making a turn. This can increase the risk of an accident.Others report that while they are driving the vehicle",
        "vin": "1C4RJFBGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2021",
        "dateOfIncident": "06/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436451,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Hello, I was driving my 2018 jeep grand Cherokee about 2 months ago when out of no where the car turned off as I came to a hill , the radio volume increased all the way and I couldn't control it , the main break locked, the wheel locked and my shifter lock, I started to roll back down the hill and I had to use my e-break. the car acted like it was turned off but it just died , the radio never turned back down until the tow company did something.  i took it to jeep and they were super unhelpful , they said it was a starter , so i paid 2000 to replace the starter to no avail. Now the AC/Heat goes on by itself or just doesn't work, the radio will go all the way up and i cant control it. however jeep in Englewood Colorado said there is nothing wrong with the car.. I think there is a safety issue with the start stop /eco mode. I think once the car turns off to save gas its not turning back on and there is no safe system. i have contracted jeep multiple times to no avail, the car has died on the highway 3 times now once while i was traveling 65 mph . I have paid for 6000 worth of fixes and its still happening.",
        "vin": "1C4RJFAG9HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435240,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "On October 02, 2021, While driving at highway speeds the engine stopped running and the tachometer went to zero RPM.  I was able to shift to neutral and cruise downhill until I could safely pull to the side of the road.  I was able to shift back to park.  The vehicle would not restart for approximately 20 minutes.  During this time the electric windows would not roll up or down, the electric tailgate would not open but the electric drivers seat would work.  After about 20 minutes the car restarted as if nothing had happened.  The same thing happened 3 more times on the way home that same day.   The same thing had happened 3 times over an 18 month period in 2018-2019.  At that time, the jeep dealer could find no problems.",
        "vin": "1C4RJFAG7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434600,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The check engine light and a (A)! light with \"service auto/start stop\" came on at the same time with no symptom of any issue being immediately noticeable. The Parking break \"BRAKE\" light on the dash light up for half a second. Then the transmission was stuck in 7th gear and would not downshift on its own. When pulling on the wheel's paddles a \"shift denied\" message was deplayed despite the fact i was going 10mph in 7th gear.  Check engine light code was P076F and U0001 and U1199. Upon driving the vehicle again Car this time transmission got into 8th gear and stated \"shift denied\" and wouldn't downshift from 8th gear for any reason. I parked it for a couple days.  When trying to take it to the dealership (A)! came back on about 5 min into my drive and stayed on for the remaining 25 min. Fault Log as of showing P076F (though car shifted fine through all gears except for that one day), U0001, P00FD, U0447, U1199, P02D1.  The following things happened on the drive to the dealership 1) While driving the phrase \"Service Shifter\" showed up for less than 1 second and went away. 2) Then randomly the gauge clusters parking \"BRAKE\" light turn 3) The vehicle got stick in 3rd gear.  The dealership provided a flash update to the transmission stating it was a \"known issue\" which is why there was already a software update, but this costed me over $200 to pay for a known issue that necessitate going to a dealership as the only way to get the known software update uploaded.  It happened again 3 weeks already which almost resulted in a crash due to the vehicle being stuck in 7th gear even at low speeds (less than 10 MPH). The dealership \"Roger Williams Jeep in Weatherford Texas\" looked at it again and stated. They did't know what the problem was and that Jeep does not allow them to service the transmissions and they cannot explain any of the lights and sticking on other gears but the \"service manual and jeep\" would only allow a replacement of the transmission for $8,100.",
        "vin": "1C4RJEAG0HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433650,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Transmission went out in Kingman AZ, we live in WI. Warning light came on, luckily enough we got to a dealership. Truck is still in AZ waiting for a new transmission, as it is under warranty, apparently their on NONE available in the US. We are on special order list and have no idea how long it will take. Dealership says 2 days later another vehicle came in with the exact same problem. Jeep knows this is a problem and are hiding it.",
        "vin": "1C4RJFCT6HC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2021",
        "dateOfIncident": "08/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429702,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Midway through a 2.5hr. drive, I approached a stop sign to make a right hand turn. When I came to a stop to check for oncoming traffic, the Jeep completely shut off on me. The cluster panel displayed “Shift to P to start” and the cluster panel was flashing all the warning lights. (vehicle was still in the ON position) I had then shifted the vehicle to Park, shut off the ignition and then restarted the Jeep. A very scary situation to happen during a normal drive.   I have done some browsing and see that I’m not the only one who has encountered this problem. Due to the extreme safety issues at hand, I truly believe Chrysler should be investigating this underlying issue.  (I’ve read some people have experienced this while driving on the main road with traffic. I’ve also read that one person experienced this and it ended in a vehicle accident.)  This is a serious issue.",
        "vin": "1C4RJFAG3HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428559,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Grand Cherokee. The contact stated while driving at approximately 35 mph, the vehicle was idling while the check engine warning light and the auto stop warning light illuminated. The vehicle was towed to the dealer where it was diagnosed that the second cylinder head needed to be replaced. The vehicle was repaired. The manufacturer was notified of the failure. The approximate failure mileage was 62,937.",
        "vin": "1c4rjfbg4hc"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/06/2021",
        "dateOfIncident": "07/07/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428002,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Both right and left rear passenger seat belts (female end) stopped holding the buckle in and is no longer working, both stopped working at the same time. Jeep is not covering this and I am spending money to replace. The Jeep has 45,000 miles on it. This seems like a defect and a major safety issue.",
        "vin": "1C4RJFCG6HC"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423730,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Thule, Inc.",
                "productMake": "THULE",
                "productModel": "HULL-A-PORT PRO KAYAKRACK",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Grand Cherokee equipped with a Thule removable roof rack. The model name was not provided. The contact stated while driving at 55 mph, the J-bar, kayak, and the rack holder detached from the vehicle and flew onto the highway. A police report was filed. The manufacturer was notified of the failure by voicemail. The contact was awaiting a callback. The Vin was unavailable.  Consumer stated while driving on the Interstate (I-990) Highway…. everything that was strapped on the roof of the SUV blew off and shattered (items involved: Thule Roof Rack, Foldable J-Bar (2Pairs), & (2) Kayaks) into 3-Lane Highway. Prior to this, (@ approx 1211p) consumer called 9-1-1 to report the incident to Amherst Police, incident no.: [XXX], 07/05/2021, 12:16p).  It has also caused Post Traumatic Stress Symptoms (PTSD) for the consumer.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).\"",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2021",
        "dateOfIncident": "05/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422861,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "One morning when I turned on my Jeep Grand Cherokee the PRNDL did not light up and the car said \"Service Shifter\" but the warning would go away after a few seconds. I took the car to a Jeep dealership and after 6 hours they told me the PRNDL needed to be replaced but the car was perfectly safe to drive. I waited 3 weeks for the part to arrive, and was told they'd replace the PRNDL and it would be covered by my extended warranty. I waited 5 hours at the dealership to be told once they replaced the part that the car would not move out of park. I then got a call telling me the entire shifter would need to be replaced and would not be covered under warranty. There was no actual issue with my vehicle before I dropped it off at the dealership. The car was shifting between park, drive, neutral, reverse without any issues. They also told me they would try to put the old part back on to see if it was a faulty part. They quoted me $617 for a part that before today I did not need. This is absolutely ridiculous as there are multiple forums and feeds online about Jeep Grand Cherokees having this issue. This needs to be a recall and covered by the Jeep dealership.",
        "vin": "1C4RJEBG6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420010,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My car's shifter is not lighting up and the car says \"service shifter\"   The car is not even 5 years old. This should not be an issue.",
        "vin": "1C4RJEBG6HC"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/12/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416347,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOOPED AT A RED LIGHT ON A HILL  WHEN THE LIGHT TURNED GREEN  ALL LIGHTS IN CAR TURNED ON THE BRAKES WENT OUT AND THE STEERING WHEEL LOCKED. I WAS ON A HILL AND ALMOST CRASHED INTO A WALL. I HAD NO CONTROL OVER THE CAR. DON'T KNOW HOW THIS HAPPENED. I WAS ABLE TO MANGE AND PULL TO THE SIDE OF THE CURVE. I TURNED THE CAR ON AND OFF A FEW TIMES AND THE CAR WENT BACK TO NORMAL. I WAS VERY LUCKY I DIDN'T CRASH INTO THE WALL OR ANOTHER CAR. THIS WAS AT A BUSY INTERSECTION AND I COULD HAVE KIILED MYSELF OR AND SOMEONE ELSE. I HAVE NOT DRIVEN THE CAR SINCE ONLY MY HUSBAND BECAUSE IM VERY SCARED. TODAY THE MALFUNCTION LIGHT COME ON AND WE DON'T KNOW IF THIS IS RELATED. WE CALLED CHRYSLER AND EXPLAINED THE SITUATION BUT THEY CAN ONLY SCHEDULE AN APPOINTMENT  TO SEE THE CAR  ON  5/17/2021 .  THIS IS A VERY SERIOUS ISSUE AND IM SURPRISED THEY WONT SEE THE CAR RIGHT AWAY. AND TOLD US TO WAIT ANOTHER 5 DAYS. I DON'T TRUST THIS CAR UNTIL IT GETS CHECKED .",
        "vin": "1C4RJFBG7HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "04/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JEEP IS HAVE A PROBLEM WITH A (START/STOP) FUNCTION. THE LIGHTS IS ON IN THE DASH AND THE SYSTEM IS NOT FUNCTION. I TAKE MY JEEP TO THE DEALER AUTHORITY AND DIAGNOSIS IS REPLACE THE 2 BATTERIES. I SPEND $165.00 FOR DIAGNOSTIC AND $495.00 FOR REPLACE BOTH BATTERIES AND THE PROBLEM CONTINUE. THE ISSUE IS WHEN I DRIVE AND I STOP MY JEEP IS SHUT OFF THE ENGINE WHEN PRESS A STOP PEDAL. WHEN RELEASE THE PEDAL MY JEEP IS NOT START AUTOMATIC. IN THE DASH HAVE A MESSAGE (PUT THE TRANSMISSION Y PARK AND START THE VEHICLE)",
        "vin": "1C4RJEBG3HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "04/18/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413324,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE DRIVING ON HIGHWAY BYPASS AT 55 MPH. NO OTHER TRAFFIC ON THE ROAD. CLEAR DAY. NO BIRDS IN AREA. SMOOTH ROAD SURFACE.",
        "vin": "1C4RJFCG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2021",
        "dateOfIncident": "04/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407810,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ENTIRE DASHBOARD WENT BLACK. IT COMES BACK ON OCCASIONALLY AFTER RE-STARTING, BUT CONTINUALLY SHUTS OFF AT RANDOM TIMES. I CAN'T VIEW MY SPEED, RPM, AND GAUGES, OR GAS LEVELS. BLINKERS WILL WORK SOMETIMES OTHER TIMES THEY WON'T.",
        "vin": "1C4RJFAGXHC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11405747,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED A 2017 JEEP FOR ONLY 45 DAYS BEFORE THE THROTTLE STUCK WIDE OPEN AND IT WAS TOTALED! I AM VERY FORTUNATE THAT NOBODY ELSE WAS INJURED BECAUSE MY JEEP SPED ACROSS THE CHURCH PARKING LOT, RAN OVER 3 TELEPHONE POLE (LYING ON THE GROUND AT THE EDGE OF THE PARKING LOT) AND CRASHED INTO THE FENCING OF MY CHURCH'S SOFTBALL FIELD. I PUSHED THE IGNITION BUTTON AND THE ENGINE WOULD NOT TURN OFF. I PUSHED THE BREAKS AND IT WOULD NOT STOP!    EVENTUALLY THE JEEP WAS STOPPED BY THE FENCE WHILE ALL 4 WHEELS CONTINUED SPINNING OUT OF CONTROL. I DO NOT UNDERSTAND HOW IT FINALLY SHUT OFF AS EVERYTHING I TRIED HAD NO EFFECT!    I WILL NEVER TRUST A JEEP AGAIN IN MY LIFE!!!! THIS WAS VERY SCARY AND UNACCEPTABLE!!!!*DT",
        "vin": "1C4RJFBT3HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "12/22/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404547,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DEC 2020: IN A PARKING LOT, THE ENGINE WOULD TURN OVER BUT NOT START. MY MECHANIC BYPASSED THE BUILT-IN FUEL PUMP RELAY IN THE TIPM BUT THE ENGINE WOULD NOT START. TOWED TO CAMPBELL JEEP, BENTON AR & THEY DIAGNOSED THAT BOTH FUEL PUMPS WERE BAD. DEALER COULD NOT GIVE REASON BOTH PUMPS WENT OUT BUT I SUSPECT THAT STATEMENT IS UNTRUE GIVEN THAT MY RESEARCH SHOWS THAT THE TIPMS HAVE BEEN A KNOWN PROBLEM SINCE 2010. COST OF THE REPAIR WAS $1,871.96    3/23/21: AT HOME, THE JEEP WOULD TURN OVER BUT NOT START AS BEFORE IN DEC 2020. SAT THREE HOURS THEN STARTED. CONTINUES TO START BUT AFTER RESEARCH I SUSPECT THAT THE BUILT-IN FUEL RELAY IN THE TIPM IS BAD BUT ALLOWS FOR INTERMITTENT STARTING. I CORRESPONDED WITH AN ENGINEER IN MARYLAND THAT HAS DEVISED FUEL RELAY BYPASSES FOR CHRYSLER'S DEFECTIVE TIPMS. I AM PURCHASING A BYPASS FROM HIM FOR $36. WERE THE FUEL PUMPS BAD IN DEC 2020 OR WOULD THIS $36 PART HAVE REPAIRED IT?     IN MY RESEARCH, IT HAS ALSO BEEN REPORTED THAT THE DEFECTIVE TIPM MAY CAUSE THE FUEL PUMPS TO CONTINUE RUNNING AFTER THE ENGINE IS TURNED OFF. DID THE FUEL PUMPS OVERHEAT BECAUSE OF THAT OR DID THE DEALERSHIP MISDIAGNOSE BAD FUEL PUMPS AND CHARGE ME FOR WORK THAT DID NOT NEED TO BE DONE?    I SUSPECT THAT CHRYSLER'S KNOWN DEFECTIVE TIPMS HAVE CAUSED CHRYSLER VEHICLE OWNERS A GREAT DEAL OF MONEY. I ALSO SUSPECT THAT CHRYSLER'S CONTINUED USE OF THE KNOWN DEFECTIVE TIPMS ALSO POSE A POTENTIAL PHYSICAL DANGER TO THE DRIVER & PASSENGERS IF & WHEN THE ENGINE STOPS IN TRAFFIC OR WHEN THEY ARE STRANDED.",
        "vin": "1C4RJFLG8HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2021",
        "dateOfIncident": "03/06/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399518,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GEAR SHIFT SERVICE ENGINE LIGHT CAME ON AND WOULD LET MY CAR SHIFT OUT OF MY PARK. THE LIGHTS IN THE GEAR AREA DIDN'T ILLUMINATE.",
        "vin": "1C4RJFBG6HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399001,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED WHILE PULLING INTO HER DRIVEWAY, THE VEHICLE WAS UNABLE TO BE SHIFTED INTO PARK. THE CONTACT STATED SHE NOTICED THE CHECK ENGINE LIGHT WAS ILLUMINATED. THE CONTACT STATED THAT THE INSTRUMENT PANEL SHOWED THAT THE VEHICLE WAS IN DRIVE NOT IN THE SELECTED GEAR. THE CONTACT STATED SHE WAS UNABLE TO SHUT-OFF THE VEHICLE BY PRESSING THE ON/OFF BUTTON. THE CONTACT SHIFTED THE GEAR TO NEUTRAL AND THE ENGINE TURNED OFF. AT THAT MOMENT, SEVERAL WARNING LIGHTS ILLUMINATED. THE INDOOR LIGHT AND HEADLIGHTS REMAINED ON FOR THREE AND A HALF HOURS UNTIL THE BATTERY WAS DRAINED. THE CONTACT CHECKED THE BATTERY AND NOTICED THAT THE POSITIVE TERMINAL WAS NOT CONNECTED TO THE BATTERY. THE VEHICLE WAS TOWED TO JIM SHORKEY CHRYSLER DODGE JEEP RAM FIAT (13230 ROUTE NORTH HUNTINGDON, PA 15642) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE MAIN FUSE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 37,300.",
        "vin": "1C4RJFAGXHC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/26/2021",
        "dateOfIncident": "02/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398003,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY MET WITH AN ACCIDENT ON MY JEEP GRAND CHEROKEE. POLICE REPORT #21-001506.     AIRBAGS DIDN'T GET DEPLOYED.",
        "vin": "1C4RJEBG6HC"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397236,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE AUTO START AND STOP FUNCTION WARNING THEN A VOLTAGE WARNING TELLING ME VEHICLE WAS GOING TO TURN OFF,  WHILE I WAS IN MOTION, IT SHUT OFF ALMOST IMMEDIATELY LEAVING ME WITH NO STEERING OR BRAKES AND THE VEHICLE WAS IN THE MIDDLE OF THE DRIVING LANE.  NO POWER TO SEATS, TRUNK, ETC   SHIFTER IS IN DRIVE BUT VEHICLE WILL NOT MOVE OR TURN ON.",
        "vin": "1C4RJFBG8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390064,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PLACED CAR IN PARK, LEFT RUNNING, GOT OUT OF VEHICLE AND THE JEEP STARTED MOVING.  PARK DID NOT FULLY ENGAGE CAUSING TO GO FORWARD HITTING A TREE.  TRYING TO FIND OUT IF OTHER JEEP GRAND CHEROKEE HAD NOT ENGAGED FULLY IN PARK WHEN LEFT RUNNING",
        "vin": "1C4RJFAG4HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389038,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LLEAKING WATER PUMP GASKET",
        "vin": "1C4RJEBGXHC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11388613,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING 25MPH ON HWY95 TURNING RIGHT EXITING THE HWY THE FRONT PASSENGER HEAD REST POOPED OPEN STRIKING MY 16 TEEN YEAR OLD DAUGHTER IN THE HEAD WITH FRIGHTENING FORCE WHICH HAS CAUSED HEADACHES SINCE THE INCIDENT.*DT    CONSUMER STATED CASE NUMBER FROM FDA IS [XXX].     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "1C4RJFBGXHC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387350,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAVING ISSUES STARTING UP. ON MULTIPLE OCCASION THE VEHICLE WILL NOT TURN OVER. IT IS A PUSH BUTTON START. I PURCHASED THIS CAR BRAND NEW WITH ONLY 52 MILES ON IT AND LESS THAN 4  YEARS LATER ITS HAVING ISSUES COMING ONE. I HAVE FOUND SEVERAL COMPLAINTS ABOUT THE SAME ISSUE. WHEN THIS HAPPENED IN ALL CASES THE VEHICLE HAD BEEN PARKED. ONCE OVER NIGHT, ONCE ONLY FOR A COUPLE HOURS.",
        "vin": "1C4RJEAG3HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/04/2021",
        "dateOfIncident": "12/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386349,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I I WAS DRIVING IN MY MOMS 2017 JEEP GRAND CHEROKEE AND IN MOTION ON A CITY STREET AND I WAS NOT AWARE OF THE SEAT SETTING BUTTON ON THE DRIVERS SIDE PANEL DOOR ITS POSITIONED IN A TERRIBLE PLACE FOR PEOPLE WITH LONGER LEGS, I HAD DROPPED A MILK SHAKE AFTER PICKING IT UP OUT OF THE CUP HOLDER AND IT SLIPPED OUT OF MY HAND AND BETWEEN MY LEGS ROLLING BEHIND THE BRAKE, IT HAD A LID ON IT SO I WASN'T WORRIED ABOUT IT SPILLING OR MAKING A MESS.  I JUST CASULLY TRIED TO PICK IT UP BY SPRESDING MY LEGS AND REACHING DOWN TO PICK IT UP WHILE KEEPING MY EYES ON THE ROAD. BUT, THAT ENDED UP BEING THE WRONG THING TO DO ,MY KNEE HIT THE S BUTTON FOR THE DRIVERS 1 AND 2 MEMORY. THE SEAT STARTED GOING FORWARD AND I COULDN'T STOP IT. I HAD MY LEGS SPREAD TO PICK UP THE SHAKE I HAD NO TIME TO DO ANYTHING WITH THEM THE NEXT THING I KNEW I WAS PINNED BETWEEN THE STEERING WHEEL AND THE CAR SEAT MY LKNEES AND LEGS WERE SCRUNCHED. I COULDN'T STEER,I COULDN'T HIT THE BRAKES,I WAS, PINNED VERY TIGHT AGAINST THE STEERING WHEEL. IM A BIG GU, IT WAS TIGHT,I COULDN'T BRAKE BECAUSE MY LEGS WERE PINNED AS WELL, I WAS HELPLESS., I WRECKED INTO A CAR AND THEN HITTING A BRIDGE BEING SO CLOSE TTO THE STEERING WHEEL THE AIR BAGS ALL WENT OFF  ALL I REMEMBER WAS THE SEAT GOING DOWN AFTER GOING ALL THE WAY TO FRONT AND THEN DROPPING DOWN AND STAYING THERE I WAS DROPPING DOWN WHEN THE BAGS HIT ME .  I KNEW THAT THE SEAT CONTROLS WERE DOWN ON THE LEFT SIDE OF ME. TRIED TO MAKE IT STOP, SO I COULD.  IM WONDERING IF ANYONE ELSE HAS EVER HIT THIS BUTTON BY ACCIDENT AND THE SEATS STARTED DOING THE SAME THING TO THENM AS IT DID TO ME. IS THIS IS AN ELECTRICAL DEFEACT OR IT WAS JUST A FLUKE? AND WHY DOES THE SEAT DO THAT WHEN THE CAR IS MOVING. I THINK IT SHOULD BE AUTOMATICALLY TURNED OFF WHILE MOVING. IF THE BUTTON IS GOING TO BE THERE. IM SO SORRYFOR THE FAMILY. WE ALL SHOULDN'T HAVE HAD TO GO THROUGH THIS.",
        "vin": "1C4RJFBG4HC"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384339,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SITTING IN MY DRIVEWAY WAITING FOR MY DAUGHTER, VEHICLE WAS IN PARK ON A VERY, VERY SMALL INCLINE - ALMOST FLAT.  WITHIN A MINUTE OF SITTING THERE, IT STARTED TO COAST/MOVE BACKWARDS.  I HAD TO PUT MY FOOT ON THE BRAKE TO STOP IT FROM GOING ONTO THE ROAD.",
        "vin": "1C4RJFBG2HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/19/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384191,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2017 GRAND CHEROKEE LIMITED 5 MONTHS AGO.  IT HAS 17,000 MILES ON IT,  WENT TO BACK OUT OF MY DRIVE- SCREEN FLASHED SERVICE SHIFTER.  SHIFTER LOCKED UP AND COULD NOT PUT BACK IN PARK.  I WAS ABLE TO SHIFT AFTER SEVERAL MINUTES OF IT BEING LOCKED,",
        "vin": "1C4RJFBG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2020",
        "dateOfIncident": "11/25/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376899,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CHECK ENGINE LIGHT TURNED ON REQUESTING THAT THE SHIFTER BE SERVICED.",
        "vin": "1C4RJEAG5HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/21/2020",
        "dateOfIncident": "11/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375694,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TAKING OFF AND SOMETIMES WHILE DRIVING, THE RPM'S REB WAY UP, ENGINE SLOWS DOWN, EATS GAS LIKE CRAZY.  HAVE TO STOP, TURN ENGINE OFF, AND START AGAIN.  IN HEAVY TRAFFIC ON EXPRESS WAY, VERY DIFFICULT TO STOP AND START AGAIN. REPAIRMAN CANNOT FIND PROBLEM. HAPPENS AT DIFFERENT TIMES AND TO OFTEN FOR ME. NOV 10TH WAS THE LAST TIME.",
        "vin": "1C4RJEBG4HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374579,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT THE DRIVER'S SIDE HEADLIGHT WAS INOPERABLE. THE VEHICLE WAS TAKEN TO JAMIESON MOTORS INC (115 US-2, CHINOOK, MT 59523), AND WAS DIAGNOSED THAT THE HEADLIGHT ASSEMBLY NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE PART WAS NOT AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER.  THE FAILURE MILEAGE WAS APPROXIMATELY 25,000.",
        "vin": "1C4RJFBG4HC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/12/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374398,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE JEEP ON THE CITY STREET, I SMELLED SOMETHING BURNING. I FELT THE DRIVERS SEAT WARMER GET  REALLY HOT, FELT IT WITH MY HAND AND GOT SHOCKED. I RIGHT AWAY TURNED OFF THE SEAT WARMER. ONCE I GOT HOME, I NOTICED THERE WAS A HOLE IN THE SEAT AND PART OF MY SWEATER GOT BURNED.",
        "vin": "1C4RJFAG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373174,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SHIFTER LIGHT CAME ON DASHBOARD DISPLAY AND THE ORANGE INDICATOR LIGHT ON THE P/D/N DISPLAY WENT OUT.  JEEP WAS SERVICED AT JEEP DEALER AND DIAGNOSTICS DIAGNOSED SHIFTER BEZEL REPAIR NEEDED.  PART ORDERED AND RETURNED FOR SERVICE AND SUBSEQUENTLY COULD NOT DRIVE OUT OF THE JEEP GARAGE! NOW A NEW SHIFTER UNIT IS NEEDED.  THE JEEP LOCKED ITSELF IN PARK. THE TECH BROUGHT THE CAR OUT AFTER SERVICE AND WHEN I STARTED IT, THE CHECK ENGINE LIGHT WAS ON.  I NOTIFIED THE TECH AND THEN HE COULD NOT GET THE JEEP OUT OF PARK.  THEY PUT IT IN NEUTRAL TO PUSH IT BACK INTO GARAGE.  CHECKED CARGURUS AND MANY, MANY COMPLAINTS FILED ABOUT THIS SAME ISSUE.  MY 2015 JEEP HAD A SHIFTER RECALL.  MAYBE STILL AN ISSUE JEEP????",
        "vin": "1C4RJFBG3HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365353,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH WHEN SUDDENLY THE INSTRUMENT PANEL HAD ILLUMINATED. THE VEHICLE'S WARNING LIGHTS INDICATING THAT THEY NEEDED TO RESET FUEL SYSTEM, THE AIR BAG DEPLOYED, THE PARKING SYSTEM NEEDED TO BE RESET AND THE HORN WOULD UNINTENTIONALLY SOUND OFF. THE CONTACT PULLED OVER AND PLACED THE VEHICLE IN PARK. THE FAILURE CONTINUED FOR AN ADDITIONAL 3 TO 4 MINUTES. THE START BUTTON WAS STUCK ON RUN THE CONTACT HAD THE VEHICLE TOWED. THE CONTACT TOOK THE VEHICLE TO THE DEALER (CHRYSLER DODGE JEEP RAM SOUTHAMPTON  691 COUNTY ROAD 39A, SOUTHAMPTON, NY 11968;  (631) 283-1600) WHO HAD NOT DIAGNOISINED THE VEHICLE AS OF YET. THE VEHICLE HAS NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 27,000.",
        "vin": "1C4RJFBG5HC"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361143,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COMPRESSOR FOR THE AIR SUSPENSION OVERHEATS CAUSING A CLUNKING NOISE FROM THE LEFT DRIVER SIDE OF THE ENGINE COMPARTMENT AND IS THE SUSPENSION TO NOT WORK AT ALL LEAVING YOU IN PARK MODE EXIT/ENTER AND  YOU GET A FLASH CODE OF SERVICE AIR SUSPENSION IMMEDIATELY .THIS IS VERY SIMILAR TO SOME OF THE  PROBLEMS THEY HAD WITH 2011 AND 2012 MODELS OF JEEP GRAND CHEROKEE  THEY NEED TO OFFER A STANDARD CONVERSION  KIT FIX TO FIX THESE JEEP BECAUSE THE AIR SUSPENSION IS NOT PERFECTED AND VERY DANGEROUS",
        "vin": "1C4RJFLT3HC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/21/2020",
        "dateOfIncident": "09/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360240,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE FRONT SEAT HAD THE ACTIVE HEAD REST PLASTIC BREAK AROUND THE RETAINING PIN. NOW THE HEADREST IS DEPLOYED FORWARD AND THE LATCH IS STILL IN CLOSED POSITION WITH THE METAL PIN STILL IN PLACE. JUST POPPED FORWARD ON IT'S OWN. CAR WAS PARKED AND NOT MOVING.",
        "vin": "1C4RJEBG8HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354583,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WON'T START WHEN PUSHING START BUTTON AND APPLYING BRAKE PEDAL.  2017 JEEP GRAND CHEROKEE 3.6L V-6 ENGINE, 44K MILES.  AFTER TURNING OFF VEHICLE, IT WILL NOT RE-START WHEN APPLYING PRESSURE TO BRAKE PEDAL AND PUSHING START BUTTON.  REPLACED BOTH MAIN AND AUXILIARY BATTERIES, BUT SAME PROBLEM CONTINUES.  ARE THERE RECALLS OR SUGGESTIONS TO FIX THIS?   I READ THAT SEVERAL VEHICLE HAVE THIS PROBLEM  WHAT'S THE RESOLUTION?",
        "vin": "1C4RJFBG6HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "11/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354408,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL WARNING SENSORS WENT OFF ON THE DASH, MY BRAKES LOCKED, LUCKILY AT LOW SPEEDS EITHER WHILE PARKED OR PULLING INTO A PARKING SPOT. IT HAD TO BE TOWED 3 TIMES, ONE TIME WE HAD A LITTLE SMOKE COMING FROM UNDER THE HOOD WHICH TURNED OUT BEING THE CORRODED HARNESS. MY BRAKE LIGHTS WERE ALL STUCK ON. JEEP SAYS IT WAS THE WHEEL SPEED SENSOR, 2 OUT OF 4 HAVE BEEN REPLACED. I'VE ALSO HAD TO HAVE MY WIRING HARNESS REPLACED TWICE (WITHIN 6 MONTHS) DUE TO CORROSION. ALL OF THIS HAPPENED AT THE SAME TIME.",
        "vin": "1C4RJFLG8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353708,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SHIFTER COMES ON NOW AND MY FRIENDS CAR DID THIS WHILE DRIVING LOCKED UP HER WHEELS LOST CONTROL AND WAS LUCKY NOT TO GET INTO A DEADLY WRECK 2017 JEEP06 GRAND CHEROKEE",
        "vin": "1C4RJEAG7HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352704,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3 RECENT OCCASIONS MY BREAKS HAVE LOST ALL PRESSURE WHILE REVERSING EITHER INTO A PARKING SPOT OR BACKING OUT OF ONE, SO FORTUNATELY I WAS NOT TRAVELING VERY FAST. I HAD TO FORCE THE PEDAL ALL THE WAY DOWN TO BE ABLE TO STOP AND IT  MADE A VERY LOUD GRINDING NOISE. ONLY IN 1/3 TIMES THE PAVEMENT WAS WET FROM RECENT RAIN.",
        "vin": "1C4RJFAG9HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352706,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS (AT DIFFERENT GAS STATIONS) HAS THE GAS NOZZLE AUTO STOP BEEN ACTIVATED UNNECESSARILY DUE TO THE ANGLE OF THE TANK CAUSING GAS TO ONLY COME OUT FOR ABOUT 5 SECONDS AT A TIME, WHICH MAKES IT DIFFICULT TO TELL IF THE TANK IS FULL AND INCREASES RISK OF OVERFILL. CURRENTLY, ON 2 OCCASIONS (AT DIFFERENT GAS STATIONS) HAS THE GAS NOZZLE FAILED TO STOP, WHICH CAUSE GAS TO SPRAY OUT ONTO MYSELF AND THE GROUND.",
        "vin": "1C4RJFAG9HC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "08/31/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352563,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT AFTER ENTERING THE VEHICLE, IT WAS DISCOVERED THAT FRONT PASSENGER'S SIDE HEAD REST HAD DEPLOYED. THERE WAS NO ONE PRESENT INSIDE THE VEHICLE NOR WAS THE VEHICLE TURNED ON. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. NEITHER THE MANUFACTURER NOR THE LOCAL DEALER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 84,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2020",
        "dateOfIncident": "08/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352329,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP GRAND CHEROKEE LIMITED 131,000 MILES PURCHASED USED  LESS THEN 24 HOURS LATER ON 8/20/2020, ENGINE SHUTS OFF WHILE MOVING, APPROX 20 MPH, FIVE LANE ROAD.HAD TO PUT IN PARK, FOOT ON BRAKE AND USE  PUSH TO START BUTTON NOTHING HAPPENED. NO WARNINGS  STARTED ON THE THIRD TRY.  REPORTED PROBLEM TO SALESPERSON  HE DOESN'T CARE BECAUSE ITS ALREADY SOLD. NO PROBLEM FOR TEN DAYS.  YESTERDAY, 8/30/2020 IT SHUT DOWN FOUR TIMES WHILE IN MOTION   STRANDED MY WIFE   WOULD NOT START AFTER MULTIPLE ATTEMPTS.  I BROUGHT ANOTHER KEY FOB TO THE SCENE   AFTER SEVERAL TRIES, IT STARTED.    I THEN DROVE IT AROUND WITH MY KEY FOB AND WITH THE AUTOMATIC STOP/START SAVE FUEL BUTTON TURNED OFF  BUT ENGINE STILL STOPPED WHILE CAR WAS IN MOTION. THERE WERE NO CHECK ENGINE LIGHTS OR ANY OTHER CODES",
        "vin": "1C4RJEBG7HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2020",
        "dateOfIncident": "08/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352020,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER TO THE ENGINE COMES TO SLOW MOTION WITH NO POWER TO ACCELERATE .  IT IS LIKE THE TRANSMISSION HAS NO POWER, BUT NO NOISE.  THIS OCCURRED WHEN TURNING OR STOPPING.  AT A STREET LIGHT.",
        "vin": "1C4RJEBG2HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/14/2020",
        "dateOfIncident": "08/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349184,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TURNED ON AND STATIONARY AT MY PRIVATE RESIDENCE, PLACED IN PARK (NO PARKING BREAK) FOR ME TO HOOK UP A CHAIN TO TOW A COMPACT TRACTOR (WITHIN THE TOWING SPECIFICATION OF THE VEHICLE). WHEN I WAS BEHIND THE VEHICLE I HEARD A LOUD THUNK AND THE VEHICLE COMPLETELY ROLLED BACK (WHEELS WERE ROTATING) AND SMASHED INTO THE COMPACT TRACTOR CAUSING SIGNIFICANT DAMAGE TO THE TRUNK AND SIDE OF THE VEHICLE.",
        "vin": "1C4RJFCG9HC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/13/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349134,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JEEP SHAKES DURING DIFFERENT SPEED LEVELS I CHANGED THE TIRE DIDN'T HELP I DID AN ALIGNMENT DIDN'T HELP THEY PUT IT ON THE MACHINE FOUND NOTHING WRONG WITH THE ENGINE NOTHING WRONG WITH THE RODE CV JOINT EVERYTHING LOOKS FINE NO ONE CAN TELL ME WHY MY JEEP IS SHAKING AND I CONCERN WHEN I'M DRIVING ESPECIALLY WITH MY KIDS",
        "vin": "1C4RJEAG5HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/07/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343819,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AC EVAPORATOR CORE FAILED IN MY JEEP GRAND CHEROKEE WHICH IS ONLY THREE YEARS OLD.  THE CORE IS UNDER THE DASH BOARD AND USES THE R-1234YF FREON WHICH IS A DANGEROUS GAS THAT LEAK OUT IN MY CABIN OF MY SUV.  THE EVAPORATOR CORE SHOULD BE REDESIGNED NOT TO FAIL AND LEAK THE DANGEROUS GAS IN MY VEHICLE.  THE R-1234YF FREON GAS IS EXPENSIVE AND THE EVAPORATOR CORE IS DESIGNED TO FAIL.. MOST CARS EVAPORATOR CORE WILL LAST ON CARS WAY OVER 6 YEARS OR MORE.  THIS IS GAS LEAKING IS A SAFETY HAZARD TO THE DRIVER AND THE EVAPORATOR CORE SHOULD BE RECALLED DO TO ITS DEFECTIVENESS.  I'M WAITING FOR THE DEALERSHIP TO ORDER AND REPLACE THE EVAPORATOR CORE AND RELOAD THE FREON AT $1900.00 COST.  THIS SHOULD BE ON THE RECALL LIST MAY PEOPLE CAN BE EFFECTED ON THIS PLUS THIS FREON CAN EXPLODE IF THE CAR IS IN A ACCIDENT.",
        "vin": "1C4RJEBGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11342287,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT JUMP POST HAS MELTED CAUSING FIRE HAZARD AND MAJOR SAFETY ISSUE. CAR WILL NOT START BECAUSE OF THIS ISSUE. THE CAR WAS IN MOTION AND CUT OFF AT A TRAFFIC LIGHT.",
        "vin": "1C4RJEBG7HC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341737,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL ISSUES WITH THIS LEMON. NOT HAPPY WITH MY 2017 JEEP GRAND CHEROKEE    -ENGINE MOUNT REPLACED AT 46,000 MILES...(REPLACED OCT 2019) SERIOUSLY???!!!! THIS EARLY IN THE VEHICLE'S LIFE??!!!     -AC CONDENSER (REPLACED MAY 2020)  -CRACKED RADIATOR-(REPLACED JULY 2020)  -NEW BATTERY- (REPLACED JULY 2020)  -EVAP PURGE HOSE -(REPLACED JULY 2020)  -EVAP PURGE SOLENOID-( REPLACED MARCH 2020)      WILL HAPPILY PROVIDE DOCUMENTATION IF REQUESTED.",
        "vin": "1C4RJFLG9HC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337632,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TURN THE CAR OFF. IT AUTOMATICALLY STARTS UP. IT DOES THIS PERIODICALLY. THIS OCCURS WHEN THE VEHICLE IS STATION AND PARKED.",
        "vin": "1C4RJFAG2HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/06/2020",
        "dateOfIncident": "07/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337758,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE LAREDO. THE CONTACT STATED THAT UPON HIS WIFE EXITING THE VEHICLE TO GRAB AN ITEM OUT OF THE HOUSE, THE VEHICLE HAD INDEPENDENTLY ACCELERATED FORWARD AND BARRELED INTO HIS GARAGE DOOR. THE CONTACT STATED THAT HIS WIFE WAS UNCERTAIN IF THE VEHICLE HAD BEEN PLACED IN DRIVE OR PARK UPON EXITING THE VEHICLE. THE CONTACT STATED THAT HIS WIFE HAD DISENGAGED THE KEY FOB UPON EXITING THE VEHICLE AND THAT ALL FOUR DOORS WERE SHUT. THE DEALER BRANDYWINE CHRYSLER JEEP DODGE RAM (3807 KIRKWOOD HWY, WILMINGTON, DE 19808) WAS NOTIFIED OF THE FAILURE AND INFORMED HIM THAT WHETHER OR NOT THE VEHICLE WAS PLACED IN PARK OR DRIVE, THE VEHICLE SHOULD HAVE RESET ITSELF INTO THE PARK POSITION ONCE THE KEY FOB WAS REMOVED AND ALL FOUR DOORS WHERE SHUT. THE MANUFACTURER WAS ALSO NOTIFIED OF THE FAILURE AND A CLAIM WAS FILED. THE VEHICLE HAD BEEN PLACED UNDER NHTSA RECALL NUMBER18V332000 (ELECTRICAL SYSTEM, VEHICLE SPEED CONTROL) AND HAD YET TO BE REPAIRED; THE CONTACT NEVER RECEIVED A NOTIFICATION REGARDING THE RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000.*DT*JB",
        "vin": "1C4RJFAG5HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/29/2020",
        "dateOfIncident": "06/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2017 JEEP, I RECEIVED A WARNING ON THE DASH WITH A DING THAT SAID SERVICE SHIFTER. MY VEHICLE HAD APPROXIMATELY 31,000 MILES. IT WOULD NOT SHIFT OUT OF DRIVE AND INTO PARK. I WAS ABLE TO DRIVE IT BUT IT WAS CONSTANTLY DINGING WITH THE SERVICE SHIFTER ERRED.WHEN I STOPPED I COULD NOT MOVE THE SHIFTER. I HAD TO STOP KILL THE ENGINE AND WAIT SEVERAL MINUTES BEFORE THE ERROR CLEARED AND I WAS ABLE TO  SHIFT THE VEHICLE. I TOOK IT TO OUR JEEP DEALER TO BE REPAIRED. HE REPLACED THE SHIFTER HARNESS. I HAVE READ MANY JEEP OWNERS HAVE HAD THIS PROBLEM AND HAVE HAD THE  SHIFTER REPLACED ONLY  TO HAVE IT OCCUR AGAIN. IT COST OVER $500 TO REPLACE.",
        "vin": "1C4RJFBG4HC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/24/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331031,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC SHUT OFF WAS ENGAGED AT A RED LIGHT. RED LIGHT TURNED GREEN IN WHICH I PUT MY FOOT ON GAS TO ACCELERATE. VEHICLE WOULD NOT MOVE AND MESSAGE APPEARED ON DASH TO 'SHIFT VEHICLE INTO PARK'. I SHIFTED THE VEHICLE INTO PARK WHEN THE VEHICLE BECAME LOCKED IN PARK AND WOULD NOT SHIFT GEARS. ENGINE COMPLETELY SHUT OFF AND WOULD NOT RE START, LEAVING MY STRANDED IN THE MIDDLE OF THE ROAD. AFTER SITTING IN THE ROAD FOR ABOUT 15 MINUTES AND MULTIPLE ATTEMPTS TO RE START, THE VEHICLE FINALLY RE STARTED. I TOOK THE VEHICLE INTO THE SHOP TO GET LOOKED AT, NO CODES ARE SHOWING ON THE COMPUTER AND ISSUE COULD NOT BE RE DUPLICATED. I HAVE SEEN SIMILAR ISSUES HAVE BEEN HAPPENING TO OTHERS. I CALLED JEEP CORPORATE WHERE THE GENTLEMAN TOLD ME TO 'RECORD EXACTLY WHAT HAPPENS NEXT TIME AS IT'S HAPPENING'.  THAT'S A WONDERFUL SUGGESTION AND ALL BY MY BIGGEST CONCERN WHEN THIS HAPPENS IS TO GET OUT OF THE ROAD AND NOT VIDEO WHAT IS HAPPENING, TERRIBLE CUSTOMER SERVICE! I AM SCARED TO DRIVE THIS VEHICLE FOR FEAR OF IT HAPPENING AGAIN AND POTENTIALLY CAUSING AN ACCIDENT.  *TR",
        "vin": "1C4RJFBG3HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/15/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329734,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT BUBBLING UP ON HOOD.  *TR",
        "vin": "1C4RJFAG8HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2020",
        "dateOfIncident": "05/09/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324035,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2017 JGC LIMITED 2 WEEKS AGO. IT HAS 31,500 MILES. THIS WEEKEND, THE 'SERVICE SHIFTER' WARNING CAME ON, THE ENGINE WOULD NOT START, THE IGNITION STAYED ON AND  WOULD NOT TURN OFF THOUGH THE ENGINE WASN'T RUNNING. THE SHIFTER LIGHTS FLASHED CONTINUOUSLY, THE WARNING SCREEN FLASHED THROUGH SEVERAL WARNINGS CONTINUOUSLY ALL NIGHT. THE BATTERY WAS DEAD THE NEXT MORNING. THE BACK DOORS WILL NOT OPEN, DISALLOWING ME ACCESS TO THE BATTERY (UNDER THE PASSENGER SEAT). THE CAR WOULD BUCK AT INTERSECTIONS WHEN I WAS DRIVING IT LAST WEEK. THE ELECTRONICS ARE POORLY ENGINEERED AND TESTED. REMINDS ME OF THE ENGLISH RANGE ROVER. I DON'T KNOW WHAT TO DO NOW AS THE CAR IS STUCK ON MY DRIVEWAY.  *TR",
        "vin": "1C4RJFBG7HC"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/06/2020",
        "dateOfIncident": "04/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323527,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HI! I WROTE IN APRIL 26, 2020 EXPLAIN MY SITUATION AND I DON'T RECEIVE ANSWER FROM US.  *TR",
        "vin": "1C4RJEBG3HC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322882,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE, 2017 JEEP GRAND CHEROKEE, WAS PARKED (NOT RUNNING & NO OCCUPANTS) UNDER OUR CAR PORT. AN EXTREMELY LOUD POP/EXPLOSION WAS HEARD AND MY SPOUSE SAW THE JEEP ROCKING FROM SIDE TO SIDE (NO ONE WAS NEAR IT). I WENT TO MOVE IT INTO OUR GARAGE AND THE 'SERVICE AIR SUSPENSION SYSTEM IMMEDIATELY' WARNING CAME ON. THE REAR END OF THE VEHICLE IS VERY LOW WITH THE WHEEL WELLS BARELY ABOVE THE LOW PROFILE TIRES.",
        "vin": "1C4RJFCT6HC"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/26/2020",
        "dateOfIncident": "04/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322323,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUV IS STATIONARY IN CITY STREET. I PUT THE IGNITION IN ACCESSORIES AND I START TO CLEAN WITH A DRY CLOTH THE PASSENGER SEAT AND PASS A CLOTH FOR THE HEAD OF SEAT, IS ACTIVATE THE HEAD RESTRAINT. MY SUV NEVER HAVE A CRASH. I GO IN 23 APRIL 2020 TO AUTOCENTRO SERVICE CENTER DODGE, JEEP AND CHRYSLER IN CAGUAS, PUERTO RICO AND EXPLAIN MY SITUATION AND THEN TELL ME I HAVE TO PAID THE PARTS (ACTIVE HEAD RESTRAINT) AND THE COST IS $994.00 AND LABOR IS $140.00 BECAUSE THE WARRANTY OF MY SUV IS EXPIRE. I REFUSE TO PAID THAT BECAUSE I THINK IS DEFECT OF MANUFACTURE BECAUSE MY SUV I DON'T HAVE ANY CRASH. PLEASE LET ME KNOW HOW THIS SITUATION CAN BE RESOLVED. THANKS",
        "vin": "1C4RJEBG3HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317527,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A YEAR AGO I WAS NO LONGER ABLE TO PUT GAS IN MY CAR UNLESS I INVERTED THE HANDLE OF THE PUMP.  I FINALLY TOOK IT TO DODGE TO GET IT FIXED.  I HAD A PREVIOUS DODGE VEHICLE THAT HAD A SIMILAR ISSUE WITH THE FILLER NECK AND IT WAS FIXED ON A RECALL.  I WAS EXPECTING THIS TO BE THE SAME, BUT THE DEALER TOLD ME IT WAS A BAD GAS TANK AND NEEDED REPLACING FOR SEVERAL THOUSAND DOLLARS.  THEY REPLACED THE GAS TANK AND IT DID NOT FIX THE PROBLEM!  NOW THEY ARE SAYING CHRYSLER IS BLAMING THE GAS PUMPS, AND THEY HAVE NO SOLUTION TO THE PROBLEM, AFTER CHARGING ME FOR A NEW GAS TANK!  THEY NEED TO DETERMINE THE CAUSE OF THIS PROBLEM WITH THEIR DESIGN, AND FIX IT VIA RECALL, AND REIMBURSE ME FOR UNNECESSARY REPAIRS WHICH DID NOT FIX THE PROBLEM.  I HAVE BEEN ADVISED THAT MANY CARS ARE COMING IN WITH THIS PROBLEM INCLUDING DURANGOS.  I ALSO HAVE A 2020 JEEP I JUST BOUGHT AND THAT VEHICLE HAS HAD THIS SAME ISSUE A FEW TIMES.",
        "vin": "1C4RJEBG1HC"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "02/28/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316835,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ELECTRONIC STABILITY CONTROL TURNED OFF AND WON'T TURN ON, MY FCW FRONT COLLISION WARNING IS OFF A WON'T TURN ON BUT THE SENSORS IN THE FRONT WORK FINE AND DETECT OBJECTS NEAR THE BUMPER",
        "vin": "1C4RJFLTXHC"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2020",
        "dateOfIncident": "03/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316597,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CRANKS BUT WILL NOT START!!",
        "vin": "1C4RJEAG9HC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311567,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A STOP LIGHT ON A BUSY 4 LANE HIGHWAY WHEN MY 2017 JEEP GRAND CHEROKEE STALLED AND WOULD NOT RE-START.  THE ENGINE LIGHT CAME ON, I COULD NOT PUSH THE BREAK PEDAL IN.  I CALLED U-CONNECT ROADSIDE AND THEY SENT A TOW TRUCK.",
        "vin": "1C4RJFAG5HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311605,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A POOL OF OIL COLLECTING IN A CHANNEL LOCATED ON THE ENGINE BLOCK. MY FIRST THOUGHT WAS THIS COULD BE A FIRE HAZARD UNDER THE RIGHT CONDITIONS. I HAVE LESS THAN 12,000 MILES ON THE 2017 VEHICLE. FIRST, I SAW THE OIL LEAK IN MY DRIVEWAY, CHECKED MY OIL AND WAS A QUART LOW. I TOOK IT INTO THE DEALER WHO IDENTIFIED THE LEAK COMING FROM THE OIL FILTER HOUSING UNIT. I WANT TO DOCUMENT THIS WITH NHSTA . THERE ARE A GROWING NUMBER OF OTHER OWNERS OF THIS VEHICLE WHO BELIEVE THERE SHOULD BE A RECALL ON THIS PART, OUT OF SAFETY CONCERNS.",
        "vin": "1C4RJFBG4HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "02/06/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309362,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION STOPPED WORKING WHILE DRIVING.  THE CAR STALLED IN THE MIDDLE OF A BUSY INTERSECTION.   THE JEEP HAS 57,067 MILES AND NOW IT DOES NOT DRIVE.",
        "vin": "1C4RJEBG0HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "12/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309202,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A FEW MINUTES WHEN THE CAR IS PARKED AND STATIONARY ON AN INCLINE IN OUR DRIVEWAY, IT WILL ROLL ABOUT 3-4 FEET AND THEN STOP ON ITS OWN, ALL WHILE VEHICLE IS IN PARK.  THIS DOES NOT HAPPEN EVERY TIME IT IS PARKED ON AN INCLINE, SEEMS TO HAPPEN RANDOMLY.",
        "vin": "1C4RJFJT3HC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "01/30/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306730,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SEAT WAS ADJUSTED ALL WAY BACKWARDS AND STOPPED WORKING.    CAN NOT ADJUST SEAT TO DRIVE IT CORRECTLY.THE VEHICLE WAS SITTING STILL IN A PARKING LOT.",
        "vin": "1C4RJECG4HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "01/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302275,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO FUEL OUR VEHICLE THE HANDLE CONSTANTLY STOPS, THINKING IT IS FULL.  HOWEVER, MY WORK AROUND IS TO TURN THE HANDLE TO 3'OCLOCK AND ITS ABLE TO FILL THE VEHICLE WITHOUT INCIDENT, HOWEVER, YOU HAVE TO HOLD THE HANDLE IN THAT POSITION THE ENTIRE TIME.  I HAVE SEEN OTHER PEOPLE POST ABOUT THIS TOO.  NEVER HAD THIS ISSUE WITH MY 2015 JEEP.  PLEASE NOT THAT THIS HAS BEEN HAPPENING EVERY SINCE WE PURCHASED THIS VEHICLE IN MAY OF 2019.",
        "vin": "1C4RJFBG5HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/27/2020",
        "dateOfIncident": "09/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302374,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE MOTOR STARTS RACING AND THE RPM'S GO WAY UP. MOST TIMES IT DOES IT WHEN YOU FIRST TAKE OFF.  YOU HAVE TO COME TO A STOP, TURN THE MOTOR OFF AND START ALL OVER. OCCASIONALLY, THIS MAY NOT WORK.  THE REPAIRMAN CANNOT FIND OUT WHY BECAUSE IT IS NOT DOING IT WHEN YOU TAKE IT BACK TO THE DEALER. NOT EASY TO DEAL WITH WHEN IN TRAFFIC AND IT IS BURNING GAS LIKE CRAZY. IT FIRST DID IT COMING BACK TO NC FROM FLA ON 95 AFTER THE HURRICANE. I DON'T KNOW THE EXACT DAY.  MY GIRLFRIEND FOLLOWED ME FROM S.C. TO JACKSONVILLE, N C TO MAKE SURE I GOT HOME WITH IT.  HAS DONE IT SEVERAL TIMES RIGHT AFTER I TAKE OFF WITH IT.",
        "vin": "1C4RJEBG4HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300751,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GETTING MY OIL CHANGED THE MECHANIC TOLD ME THAT I HAD AN ANTIFREEZE LEAK. HE COULD SMELL IT AND SAW FLUID AROUND THE RADIATOR. ALSO THAT I MAY NEED A NEW RADIATOR AND SHOULD HAVE THE DEALERSHIP CHECK IT OUT. I BROUGHT MY 2 YEAR OLD 2017 JEEP GRAND CHEROKEE TO THE DEALERSHIP AND WAS TOLD I DID INDEED NEED A NEW RADIATOR. THE CAR WAS BOUGHT NEW BY ME AND HAS 45000 MILES ON IT. I ASKED THE MECHANIC IF THIS WAS COMMON? WAS THERE ANY INDICATION OF GETTING HIT BY A ROCK ETC? I WAS TOLD THAT IT WAS A MANUFACTURERS' DEFECT. THAT THE RADIATOR WAS LEAKING AT THE SEAMS AND NEEDED TO BE REPLACED. I BROUGHT IT TO A SECOND MECHANIC AT A LOCAL AUTO BODY SHOP AND HE CONFIRMED THAT IT WAS A MANUFACTURER'S DEFECT AND THE RADIATOR NEEDED REPLACING. I THINK THIS IS MORE COMMON THAN IT SHOULD BE FOR A NEW VEHICLE WITH LOW MILEAGE. BOTH MECHANICS AT THE DEALERSHIP AND THE AUTOBODY SHOP SAID THEY HAD REPLACED SEVERAL OF THESE RECENTLY. IN FACT IT HAS BEEN ENOUGH OF A PROBLEM THAT THEY ARE KEEPING EXTRA RADIATORS IN STOCK. I BELIEVE JEEP SHOULD RECALL THESE RADIATORS AND PAY FOR THE COST OF REPLACING MINE.",
        "vin": "1C4RJFBG1HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "01/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296822,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "YOUR WEB SITE DOES NOT RECOGNIZE THIS VIN NUMBER. I CONTACTED CHRYSLER WHO DID RECOGNIZED THIS VIN AND COULD NOT SAY WHY YOUR WEB SITE DID NOT. PLEASE ADVISE.",
        "vin": "1C4RJFLT9HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296961,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. WHILE DRIVING 65 MPH, THE VEHICLE RANDOMLY JERKED AND STALLED SEVERAL TIMES. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO LITHIA CHRYSLER JEEP DODGE RAM OF CORPUS CHRISTI (4313 S STAPLES ST, CORPUS CHRISTI, TX 78411, (361) 992-8000), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 18,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "01/02/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292533,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2017 GRAND JEEP CHEROKEE DID NOT START THIS MORNING.  THE BRAKE WOULD NOT SOFTEN SO WE KNEW THERE WAS AN ISSUE.  WHEN WE PUT OUR FOOT ON THE BRAKE AND PRESSED THE START BUTTON NOTHING TURNED OVER BUT ALL THE LIGHTS WENT ON.  THIS HAPPENED ABOUT 6 MONTHS AGO AND JEEP REPLACED THE BATTERY.   OBVIOUSLY IT IS SOMETHING ELSE.  IT APPEARS THERE IS A FUEL INJECTION RECALL BUT NO PARTS ARE AVAILABLE YET.  WHEN IS THE ETA FOR THESE PARTS?  WE BOUGHT TWO JEEPS BECAUSE WE THOUGHT THEY WERE SAFE.  AFTER FOUR TRIES, THE CAR STARTED FROM REMOTE START.",
        "vin": "1C4RJFBG2HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "11/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289994,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON THE FREEWAY AND REGULAR STREET, AND GOING UPHILL, MY JEEP'S ENGINE WILL STOP RUNNING, THE \"D\" ON THE DASHBOARD BLINKS AND THE CENTER OF THE DASHBOARD SAYS \"SHIFT TO PARK\". TO GET THE JEEP'S ENGINE TO START UP AGAIN, I HAVE TO PUT IT IN PARK AND RESTART IT. BEING THAT THE JEEP DOES NOT RUN WHEN THIS HAPPENS I AM OFTEN STUCK ON THE FREEWAY OR IN THE MIDDLE OF TRAFFIC AND CAN NOT PULL OVER. THIS IS EXTREMELY DANGEROUS AND I HAVE COME CLOSE TO MULTIPLE ACCIDENTS. THE JEEP DOES NOT ALWAYS START AGAIN. IT WILL STUTTER AND SHUT OFF MULTIPLE TIMES. THIS HAS BEEN HAPPENING FOR MONTHS. DEALERSHIP CAN NOT FIND ANY CODES. THEY PUT A DATA RECORDER IN THE VEHICLE, THE JEEP'S ENGINE SHUT DOWN THE SAME DAY I PICKED IT UP. WHEN THIS HAPPENED I PRESSED THE RECORDER BUTTON. IT SHUT DOWN MULTIPLE TIMES IN TRAFFIC WITH THE RECORDER IN AND I PRESSED THE BUTTON TO RECORD AS DIRECTED. WHEN I BROUGHT THE JEEP BACK INTO THE BOB BAKER DEALERSHIP, THEY SAID THE DATA RECORDER SAID EVERYTHING WAS NORMAL. THE JEEP SHUTTING DOWN WHILE IN MOTION AND NOT TURNING BACK ON, IS NOT NORMAL AND IS DANGEROUS. I HAVE BEEN WITHOUT MY JEEP FOR 2 MONTHS WITH NO SOLUTION IN SIGHT. THIS IS A MAJOR SAFETY PROBLEM THAT I HAVE BEEN FIGHTING TO GET FIXED WITH NO RESOLUTION. I HAVE BEEN WORKING WITH FCA AND THEY ARE NOT RETURNING MY CALLS AND HAVE NO SOLUTIONS. I AM SO DISAPPOINTED AND WISH I NEVER BOUGHT THIS JEEP. I HAVE LOST ALL CONFIDENCE IN THIS VEHICLE. I CAPTURED THE PROBLEM HAPPENING ON VIDEO AND NO ONE CAN EXPLAIN WHAT IS HAPPENING NOR FIX IT. THIS HAS BEEN HAPPENING SINCE AUGUST 2019. THE LAST TIME IT HAPPENED WAS THE DAY I PICKED IT UP WITH THE DATA RECORDER IN IT ON NOVEMBER 22, 2019",
        "vin": "1C4RJFBG2HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "08/26/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288313,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A MILITARY SERVICE MEMBER SERVING IN EUROPE. I BROUGHT MY 2017 JEEP GRAND CHEROKEE WITH ME TO EUROPE IN 2018. THE VEHICLE HAS BEEN METICULOUSLY MAINTAINED ACCORDING TO MANUFACTURE SPECIFICATIONS. EARLIER THIS YEAR (2019) WITH APPROXIMATELY 98K MILES ON THE ODOMETER AND WHILE CRUISING ON A GERMAN HIGHWAY AT APPROXIMATELY 85MPH, THE CHECK ENGINE LIGHT CAME ON AND THE CAR SUDDENLY AND RAPIDLY LOST POWER. I COORDINATED FOR TOWING OF THE VEHICLE TO THE NEAREST JEEP/CHRYSLER/DODGE REPAIR SHOP. THE VEHICLE HAS NOW BEEN IN THE REPAIR SHOP FOR ALMOST FOUR MONTHS AND THE LOGISTICAL AND TECHNICAL NETWORK AVAILABLE IN THIS MEDIUM SIZED GERMAN CITY HAS PROVEN UNABLE, AT LEAST UP UNTIL THIS POINT, TO SUCCESSFULLY REPAIR THE VEHICLE. THE DIAGNOSIS WAS COMPLETE VALVE TRAIN FAILURE. I'M SHARING THE DETAILS OF THE EVENT AND THE LOCATION FOR THREE PURPOSES. 1. THE SUDDEN LOSS OF POWER COULD PROVE DANGEROUS NO MATTER WHERE IT OCCURS  2. SERVICE MEMBERS SERVING OVERSEAS SHOULD BE AWARE THAT THE FIAT CHRYSLER NETWORK IN EUROPE IS NOT ADEQUATELY PREPARED TO ADDRESS OTHER THAN ROUTINE MAINTENANCE FOR U.S, SPECIFICATION VEHICLES AND YOU COULD EASILY FIND YOURSELF IN A VERY UNCOMFORTABLE SITUATION IF YOU BRING YOUR U.S. SPECIFICATION JEEP WITH YOU OVERSEAS. 3. EVEN THOUGH THE VEHICLE WAS PAST IT'S WARRANTY BASED ON MILEAGE; COMPLETE VALVE TRAIN FAILURE OF A METICULOUSLY MAINTAINED 2017 JEEP WITH LESS THAN 100K MILES IS MORE LIKELY THAN NOT A MANUFACTURING AND OR ENGINEERING DEFECT VERSUS ANYTHING THAT COULD BE CONSIDERED NORMAL WEAR AND TEAR.",
        "vin": "1C4RJEAG9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/05/2019",
        "dateOfIncident": "11/26/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287265,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SHIFTING ISSUES FOR THE FIRST 49,000 MILES. NOW, AT 50K MILES, THE VEHICLE SHIFTS HARD IN ALL GEARS, BUT MOSTLY IN 6TH, 7TH, AND 8TH.  THE HARD SHIFT SOMETIMES FEELS LIKE A 5 LBS HAMMER SLAMMING INTO THE METAL FRAME OF THE VEHICLE.  NOT ALL SHIFTS ARE HARD. MOST HARD SHIFTS ARE WHEN HOLDING THE THROTTLE STEADY AND THE VEHICLE SLOWLY APPROACHES A SHIFT POINT.  IN 8TH GEAR YOU CAN HOLD 5% THROTTLE TO MAINTAIN HIGHWAY SPEED, THEN GIVE 10% MORE THROTTLE FOR AN UPHILL AND THE TRANSMISSION WILL STAY IN 8TH GEAR, BUT BRIEFLY SHUTTER FOLLOWED BY AN OBVIOUS BANG OR JERK OF THE VEHICLE.  SOME BAD SHIFTS ARE REPETITIVE WITH FOUR OR FIVE HESITATIONS AND POPS OR BANGS OF THE TRANSMISSION.  THESE HARD CLUNKS HAPPEN AT 30-45 MPH, OR AT HIGHWAY SPEEDS OF 75-80 MPH.  SOME FEEL LIKE BUMPS IN THE ROAD, WHILE OTHERS FEEL LIKE VIOLENT BANGS.  THE ISSUE DOES NOT HAPPEN WHEN GIVING THE VEHICLE 80% OR MORE THROTTLE.  ISSUES ARE USUALLY AT 5% TO 35% THROTTLE.  IT HAPPENS MOST OFTEN WHEN ACCELERATING TOWARDS A NORMAL SHIFT POINT SLOWLY.  BEFORE THE NORMAL SHIFT, THE TRANSMISSION WILL SLIP AND BANG.  ON A TWENTY-MINUTE DRIVE OF MIXED HIGHWAY AND CITY, IT MAY BANG 5 TO 10 TIMES OR MORE.  VIOLENT BANGS ARE ONCE OR TWICE PER WEEK, BUT SOMETIMES TWICE A DAY.  THE DRIVING SITUATION IS WHAT INCREASES THE LIKELIHOOD OF FEELING A BAD KICK OR BANG.  NOT ALL BANGS RESULT IN A SHIFT. SOME BANGS HAPPEN BUT THE VEHICLE STAYS IN THE SAME GEAR AS IF IT JUST SLIPPED AND THEN CAUGHT THE SAME GEAR AGAIN.",
        "vin": "1C4RJFCG6HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/18/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281105,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPS AND STALLS DURING, IT CAN HAPPEN AT AN INTERSECTION WHEN DRIVING. CAR ASKS YOU TO PUT INTO PARK WHILE DRIVING-- THE SHIFTER LOCKS AND THEN IT SAYS PUT IN DRIVE AND DOESN'T RESPOND SO YOU SIT THERE FOR A MINUTE THEN YOUR ABLE TO TURN THE CAR OFF.!! HUGE SAFTEY CONCERN! I DO NOT FEEL SAFE IN MY CAR SCARED TO DEATH TO DRIVE THIS.",
        "vin": "1C4RJEBG9HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276912,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED THIS VEHICLE AND UPON GOING TO THE GAS STATION TO FILL UP, WHEN YOU PUT THE PUMP HANDLE INTO THE CAP LESS TANK, THE GAS PUMP DOES NOT ALLOW THE GAS TO FLOW INTO THE TANK WITHOUT HOLDING THE PUMP HANDLE AT HALF PRESSURE.  IN LOOKING ONLINE THERE IS AN ISSUE WITH THE FILL NECK OF THE GAS TANK.  I HAVE TRIED THIS AT MULTIPLE GAS STATIONS ORIGINALLY THINKING IT WAS THE PUMP ITSELF, NOT THE VEHICLE.  FROM MY UNDERSTANDING THIS IS A KNOWN ISSUE WITH JEEP AS SOMETHING BEING WRONG WITH THE EVAP VALVE IN THE FILL NECK.",
        "vin": "1C4RJFAG0HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269141,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TRANSMISSION LOCKED UP IN THE MIDDLE OF A PARKING LOT COULD NOT MOVE THE CAR FORWARD OR BACKWARD NOR COULD I MOVE THE GEAR SHIFTER FROM DRIVE TO PARK OR NEUTRAL... I WAS ALSO UNABLE TO GET THE VEHICLE TO SHUT OFF WHICH IN ITSELF COULD BE A SAFETY ISSUE IF I WAS IN MY GARAGE. THE VEHICLE NEEDED TO BE TOWED BACK TO THE DEALERSHIP.    DASHBOARD READ: SERVICE SHIFTER - STOP SAFELY, SHUT OFF ENGINE TO ENGAGE PARK -- PLEASE NOTE THAT WE FOLLOWED THE INSTRUCTIONS AND WE WERE UNABLE TO TURN THE VEHICLE OFF AND/OR GET IT INTO PARK.",
        "vin": "1C4RJFJG7HC"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267001,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOUCH SCREEN NOT WORKING. IT IS ON BUT WHEN YOU TRY TO DO SOMETHING DOES NOT RESPOND TO TOUCH.",
        "vin": "1C4RJFJT1HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "09/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257637,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. WHILE DRIVING AND DECELERATING, THE VEHICLE SUDDENLY SHUT OFF AND WOULD NOT IMMEDIATELY RESTART. AFTER FOUR ATTEMPTS, THE VEHICLE RESTARTED AND RESUMED NORMAL OPERATION. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND VPROVIDED CASE NUMBER: [XXX]. THE FAILURE MILEAGE WAS 15,000.*PM     THE CONSUMER STATED THE *WAS A VISUAL INSPECTION AND 5 MIN ROAD TEST PERFORMED. *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1C4RJFBG6HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257383,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT THE REAR SIDE PANELS WERE POPPING OUT OF THE GASKET. THE VEHICLE WAS TAKEN TO FEDERICO CHRYSLER DODGE JEEP RAM (618-421-4180, LOCATED AT 1875 E EDWARDSVILLE RD, WOOD RIVER, IL 62095) WHERE THE PANELS WERE TAKEN OUT AND REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE PANELS WERE REPAIRED AGAIN, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE CASE WOULD BE CLOSED IF THE DEALER WAS UNABLE TO REPAIR THE FAILURE. THE MANUFACTURER REJECTED THE CONTACT'S REQUEST FOR AN EXTENDED WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000.",
        "vin": "1C4RJFBG1HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/13/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255301,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 GRAND CHEROKEE 'SERVICE SHIFTER' PROBLEM.  I GET THE MESSAGE POPPING UP IN THE DRIVER INFORMATION AREA, ALONG WITH THE VEHICLE SHIFTING DIFFERENTLY THAN NORMAL.  THIS SEEMS TO BE A COMMON PROBLEM WITH NO DEFINITIVE SOLUTION.",
        "vin": "1C4RJFLG7HC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "09/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254100,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A HIGHWAY AT 60 MPH MY VEHICLE STARTED FLASHING EVERY POSSIBLE WARNING LIGHT. AIRBAGS, ABS, SLIP CONTROL, CRUISE CONTROL ... EVERYTHING. MOST CONCERNING WAS THE 'SERVICE SHIFTER' ALERT; THE PRND LIGHTS ON MY SHIFTER PANEL ALL STARTED FLASHING AND THE CAR (AUTO TRANSMISSION) WAS STUCK IN ONE GEAR AND WOULD NOT SHIFT. PULLING OVER AND RESTARTING THE VEHICLE WOULD 'FIX IT' FOR 10-15 MINUTES UNTIL IT ALL HAPPENED AGAIN. ENGINE WAS MAKING AN AWFUL LOUD NOISE SO I PULLED OVER AGAIN. THIS TIME AFTER TURNING IT OFF THE VEHICLE WOULD NOT START AT ALL. AFTER 30 MINUTES IT STARTED AND I WAS ABLE TO DRIVE TO A TOWN FOR THE NIGHT. THE NEXT MORNING I WAS ABLE TO START IT AND DRIVE IT IN 1ST GEAR (WHERE IT WAS STUCK) TO A JEEP DEALER. THERE IT SITS AS I TYPE. I HAVE SEEN MANY IDENTICAL ISSUES REPORTED BY JEEP OWNERS ON INTERNET FORUMS AND MOST WORRYINGLY, JEEP DEALERS DON'T SEEM TO HAVE A CLEAR ANSWER. THEY'RE COMMONLY REPLACING THE SHIFTER WIRING HARNESS BUT THE PROBLEM RETURNS FOR NEARLY EVERYONE. THIS INCIDENT STRANDED ME IN THE MIDDLE OF THE NIGHT, IN THE MIDDLE OF NOWHERE, AND LEFT ME VERY WORRIED ABOUT MY SAFETY. WHATEVER IS WRONG WITH THE VEHICLE HAS CASCADING ERRORS THAT AFFECT HEADLIGHT OPERATION (MY HIGH BEAMS WOULD NOW WORK), SLIP CONTROL (IT BECAME NON FUNCTIONAL EVEN IF I OVERRODE IT), WIPERS (IN MY CASE THEY CAME ON WITHOUT ANY RAIN AND I COULD NOT TURN THEM OFF...THEY COULD JUST AS EASILY HAVE NOT FUNCTIONED IN A DOWNPOUR CREATING A SAFETY HAZARD), AND BRAKING (THE BRAKE PEDAL WAS ROCK SOLID AND NOT WORKING PROPERLY).",
        "vin": "1C4RJFLG3HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2019",
        "dateOfIncident": "09/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254018,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPT 3, 2019 I WAS DRIVING AT 45 MPH WHEN THE ENGINE STALLED AND I COASTED TO A STOP. ENGINE RESTARTED AFTER MANY ATTEMPTS, DROVE ABOUT 50 FEET WHEN ENGINE STALLED AGAIN. OVERCOME BY A STRONG SMELL OF GAS I EXITED THE CAR AND SAW FUEL COMING OUT FROM UNDER THE ENGINE.  AS THE CAR SAT THE FUEL LEAK SUBSIDED. TOWED TO THE DEALER WE BOUGHT THE CAR FROM (ZEIGLER OF DOWNERS GROVE) TOW TRUCK DRIVER STATED I WAS LUCKY IT DIDN'T START ON FIRE.  WHEN THE CAR WAS UP ON THE BACK OF THE TOW TRUCK BED DEALER TRIED TO START THE CAR TO GET INTO NEUTRAL AND WE WERE ABLE TO SEE THE FUEL POURING OUT FROM UNDER THE CAR. PICKED UP CAR THE NEXT DAY AND I WAS ASSURED THIS CAR WAS FIXED. I VOICED MY CONCERN ON THE DANGERS OF DRIVING A CAR WITH GAS POURING OUT OF IT. REPAIR ORDER SHOWS \"REPLACED BROKEN FUEL CLIP TESTED VEHICLE AND VEHICLE IS NOW OPERATING AS DESIGNED\". 5 DAYS LATER (9/8/19) HAD TO HAVE THE CAR TOWED 30 MILES BACK TO THE DEALERSHIP BECAUSE THE CAR IS AGAIN LEAKING GASOLINE. NOT FEELING VERY SAFE IN MY 2017 JEEP GRAND CHEROKEE",
        "vin": "1C4RJFCGXHC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "08/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252296,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE, (XXXXX), WAS DRIVING THIS VEHICLE.  SHE WAS IN A DRIVE-THRU, MOVING AT LOW SPEEDS WHEN THE BRAKES STOPPED WORKING.  ROBIN WAS ABLE TO ROLL TO A STOP IN THE PARKING LOT.  I RESPONDED TO THE SCENE TO INSPECT THE VEHICLE AND OBSERVED THAT THE BRAKE PEDAL ASSEMBLY HAD BECOME DISCONNECTED FROM THE BRAKE BOOSTER PLUNGER ROD, COMPLETELY DISABLING THE BRAKES.  UPON FURTHER INSPECTION, IT WAS DETERMINED THAT THERE IS A RETAINER CLIP WHICH HOLDS THE PLUNGER ROD TO THE BRAKE PEDAL.  THIS RETAINER CLIP WAS NOT INSTALLED AND WAS NOT FOUND ANYWHERE IN THE AREA TO INDICATE IT HAD FALLEN OFF.  THERE HAS NEVER BEEN ANY WORK DONE TO THE VEHICLE AROUND THE BRAKE PEDAL ASSEMBLY.  IT IS MY BELIEF THAT THE FACTORY DID NOT INSTALL THE RETAINER CLIP, OR DID NOT INSTALL ONE CORRECTLY.  THANKFULLY, THIS HAPPENED IN A PARKING LOT AND NO LIVES WERE LOST OR HURT.    REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1C4RJEAG2HC"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11251989,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT THE VEHICLE DECELERATED WHILE DRIVING WITHOUT WARNING. ON ANOTHER OCCASION, WHEN THE CONTACT ENTERED THE VEHICLE AND SHIFTED OUT OF PARK, THE VEHICLE LUNGED FORWARD. THE CONTACT ALSO STATED THAT SOMETIMES, WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE \"CAR IN PARK\" AND \"TRUCK NOT IN P GO TO GEAR\" MESSAGES APPEARED ON THE INSTRUMENT PANEL. THE VEHICLE WAS DRIVEN TO MAC HAIK CHRYSLER (12111 KATY FWY, HOUSTON, TX 77079, (832) 430-6816), BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RETURNED THE VEHICLE TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 13,580. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11251999,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT THE VEHICLE DECELERATED WHILE DRIVING WITHOUT WARNING. ON ANOTHER OCCASION, WHEN THE CONTACT ENTERED THE VEHICLE AND SHIFTED OUT OF PARK, THE VEHICLE LUNGED FORWARD. THE CONTACT ALSO STATED THAT SOMETIMES, WHEN THE ACCELERATOR PEDAL WAS DEPRESSED, THE \"CAR IN PARK\" AND \"TRUCK NOT IN P GO TO GEAR\" MESSAGES APPEARED ON THE INSTRUMENT PANEL. THE VEHICLE WAS DRIVEN TO MAC HAIK CHRYSLER (12111 KATY FWY, HOUSTON, TX 77079, (832) 430-6816), BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RETURNED THE VEHICLE TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 13,580.",
        "vin": "1C4RJEAG0HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245979,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE DEVELOPS \"DEATH WOBBLE\" WHEN BEING FLAT TOWED BEHIND A MOTORHOME. I HAVE PERSONALLY EXPERIENCED THIS SITUATION AND HAVE INTENTIONALLY CAUSED THE \"WOBBLE\" TO CONFIRM IT'S POTENTIAL. A CORRECTIVE WIRING HARNESS IS AVAILABLE FOR THE JEEP CHEROKEE. HOWEVER, NO CORRECTIVE SYSTEM IS AVAILABLE FOR THE JEEP  \"GRAND\" CHEROKEE. IT SHOULD BE NOTED THAT THE CHEROKEE AND \"GRAND\" CHEROKEE HAVE THE SAME ELECTROHYDRAULIC POWER STEERING SYSTEM. EVERY JEEP DEALERSHIP I HAVE CONTACTED CLAIMS DENIAL OF THE PROBLEM WITH THE \"GRAND\" CHEROKEE WHILE ADMITTING THAT THERE IS A PROBLEM WITH THE SAME YEAR AND MODEL JEEP CHEROKEE. THE POTENTIAL OF DEVELOPING A \"DEATH WOBBLE\" WHILE TRAVELING AT A HIGH RATE OF SPEED AND HITTING A POTHOLE, CONSTRUCTION SITE OR RR TRACKS IS REAL. HOWEVER, I HAVE HAD NO LUCK WITH SECURING ANY CORRECTIVE ACTION BY ANY JEEP DEALERSHIP IN UTAH.",
        "vin": "1C4RJFLG7HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "01/07/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246102,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. WHILE DRIVING AT NIGHT, THE HID HEADLAMPS BURNED THE PLASTIC LENSES. THE FAILURE CREATED A SHADOW EFFECT ON THE PLASTIC LENSES AND THE CONTACT WAS UNABLE TO VIEW THE ROAD. THE VEHICLE WAS TAKEN TO LADD-HANFORD DODGE CHRYSLER JEEP RAM (2247 CUMBERLAND ST, LEBANON, PA 17042, (717) 273-4585) WHERE IT WAS DIAGNOSED THAT THE HEADLAMP BULBS WERE TOO HOT FOR THE LENSES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED SEVERAL TIMES AND STATED THAT THE VEHICLE WAS NOT COVERED UNDER WARRANTY. NO ASSISTANCE WAS PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 26,000. THE VIN WAS INVALID.",
        "vin": "1C4RKFLG8HC"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/22/2019",
        "dateOfIncident": "08/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245789,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADREST-ACTIVE HEAD RESTRAINTS - MOPAR (6LR08PS4AA)  THE FRONT PASSENGER SEAT HEADREST 'EXPLODED' DUE TO WHAT APPEARS TO BE FAULTY MATERIAL.  I GOT THE PART NUMBER FROM THE DEALER USING THE VIN NUMBER.   A PLASTIC COMPONENT SIMPLY BROKE FOR NO APPARENT REASON.  THIS SPECIFIC FAILURE APPEARS TO BE THE PLASTIC THAT HOLDS A PIN IN PLACE.  DEALER INDICATES THIS IS NOT COVERED BY WARRANTY.  I BELIEVE IT SHOULD BE BECAUSE IT IS A SAFETY COMPONENT.  A FAILURE WHILE DRIVING COULD EASILY CAUSE AN ACCIDENT.  SOMEONE COULD BE SERIOUSLY INJURED EITHER BY THE IMPACT OR IN AN ACCIDENT.    WHEN THIS FAILED IT FORCED THE HEADREST TO MOVE FORWARD SEVERAL INCHES.   OURS SELF DESTRUCTED WHILE IT WAS PARKED, THANK GOODNESS.  NO ONE WAS IN THE CAR.  HOWEVER IF WE HAD BEEN TRAVELING AT 70 MPH ON A BUSY FREEWAY, THIS COULD BE A DISASTER, ESPECIALLY IF IT WAS THE DRIVERS SIDE.",
        "vin": "1C4RJEJG3HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245196,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS IN ECO MODE. THE CAR WAS DRIVING ON A RESIDENTIAL STREET AND WAS STOPPED FOR A TRAIN CROSSING. WHEN THE GAS PEDAL WAS USED TO GO FORWARD THE ENGINE RACED QUICKLY TO 4500 RPMS AND WOULD NOT SLOW DOWN UNTIL MANUALLY PLACED IN NEUTRAL FOR SEVERAL SECONDS. AFTER DRIVING ON INTERSTATE 135 AND COMING TO A STOP AT AN EXIT, THE CAR WENT INTO ECO MODE, WHEN THE GAS PEDAL WAS USED TO PUT THE CAR INTO MOTION THE ENGINE RACED TO 6000 RPMS AND WAS TRYING TO ACCELERATE TO AN UNSAFE SPEED. THE ENGINE WOULD NOT SLOW DOWN. THIS HAS HAPPENED 4 TIMES IN THE LAST 3 WEEKS. THE DEALERSHIP WAS NOTIFIED. ATTEMPTS WE WERE TOLD WERE TO DIAGNOSE THIS PROBLEM, BUT THE ISSUE HAS NOT BEEN RESOLVED. AN UPDATE ON SOFTWARE WAS DONE AFTER THE FIRST TWO ISSUES OF THE UNINITIATED ACCELERATED RPMS OF THE ENGINE OCCURRED. AFTER SOFTWARE WAS UPDATED THERE HAVE BEEN TWO UNINITIATED ACCELERATIONS OF THE RPMS. WE WERE CONCERNED FOR UNCONTROLLED ACCELERATIONS OF THE VEHICLE. THE DEALERSHIP HAS BEEN NOTIFIED OF OUR CONCERNS, HOWEVER A RESOLUTION HASN'T BEEN DONE. WE ARE CONCERNED FOR SAFETY. THIS HAS HAPPENED ON AUGUST7 (TWICE), AUGUST 10, AUGUST 20.",
        "vin": "1C4RJFAG3HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243466,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUNROOF EXPLODED WHILE DRIVING ON HIGHWAY. THERE WAS NO DEBRIS ON THE ROAD AND I AM SURE I WAS NOT HIT BY ANYTHING. SOUNDED LIKE A TIRE BLEW AND BEFORE I KNEW IT GLASS WAS FALLING ALL OVER ME AND MY CAR.",
        "vin": "1C4RJFAG9HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SOUTHBOUND ON I-75 NEAR THE JOSLYN ROAD EXIT, MY SUNROOF GLASS EXPLODED FOR NO APPARENT REASON. THERE IS NO OVERPASS AND THERE WERE NO VEHICLES IN FRONT OF ME. LUCKILY MY SUNROOF SHADE WAS CLOSED SO THE BROKEN GLASS ALL FLEW OUTSIDE BUT THE EXPLOSION WAS EXTREMELY LOUD AND COULD HAVE CAUSED INJURY TO MYSELF OR OTHER DRIVERS.",
        "vin": "1C4RJFAG6HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234503,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. AFTER THE CONTACT'S WIFE PARKED THE VEHICLE IN THE DRIVEWAY, SHE LEANED OVER TO GET HER PURSE AND STEPPED ON THE ACCELERATOR PEDAL. THE GEAR WAS IN PARK; HOWEVER, THE VEHICLE SPED OFF AND CRASHED INTO THE WALL OF THE GARAGE. THE VEHICLE WAS SCHEDULED TO BE REPAIRED AT THE LOCAL MECHANIC. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 26,000.",
        "vin": "1C4RJFAG8HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233728,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FLASHING  D  ON DASHBOARD   CAR TURNS OFF   HAS HAPPENED TWICE   DEALSHIP CAN NOT CORRECT BECAUSE I HAVE NO CODES",
        "vin": "1C4RJFBG0HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11223036,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED WHILE ATTEMPTING TO PARK, THE VEHICLE UNINTENDEDLY ACCELERATED AS THE ENGINE RPMS INCREASED. THE BRAKE PEDAL WAS DEPRESSED AND FAILED TO ENGAGE. AS A RESULT, THE VEHICLE CRASHED INTO MULTIPLE TREES AND BUSHES. THE VEHICLE EVENTUALLY CAME TO A STOP. THE CONTACT STATED MULTIPLE UNKNOWN WARNING LIGHTS WERE ILLUMINATED. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUSTAINED MINOR INJURIES AND WAS TAKEN BY AMBULANCE TO THE HOSPITAL. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DRIVABLE AND WAS TOWED TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED AS OF YET.  A DEALER WAS NOT CONTACTED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 17,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221804,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ROLL-AWAY RECALL JUST AS IN CALIFORNIA IN 2016  VEHICLE WAS IN PARK AND TURNED OFF, I GET OUT TO GET AROUND TO THE OTHER SIDE OF THE CAR TO GET MY SON OUT OF THE CAR SEAT. THE CAR JUST STARTS ROLLING AWAY. THE VEHICLE STOPPED AFTER HITTING THE EXTERIOR OF MY HOME CAUSING DAMAGE. ONCE I GOT IN THE CAR, THE VEHICLE WAS ON ( EVEN THOUGH I TURNED IT OFF).",
        "vin": "1C4RJFBG7HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/19/2019",
        "dateOfIncident": "06/18/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221168,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BEING TOWED BEHIND MY MOTORHOME, THE JEEP GRAND CHEROKEE WILL GO INTO AN EXTREME \"WOBBLE\" DURING A SLOW SPEED, SHARP TURN TO THE LEFT OR RIGHT, EITHER FROM A COMPLETE STOP OR NEAR STOP ON THE ROAD THAT THE TURN ORIGINATES FROM. IF EITHER STEERING TIRE ON THE JEEP HITS AN IRREGULARITY IN THE ROAD SURFACE (I.E. A BUMP, MANHOLE COVER, POTHOLE), THE STEERING WHEELS ON THE JEEP BEGIN RAPIDLY TURNING FROM LEFT TO RIGHT AND BACK AGAIN. THIS ACTION VIOLENTLY SHAKES NOT ONLY THE JEEP BUT THE ENTIRE MOTORHOME TOWING IT. THE ONLY WAY TO STOP THE OSCILLATING WHEELS IS TO BRAKE HARD AND NEARLY COME TO A COMPLETE STOP. THE BRAKING SYSTEM ON THE JEEP WHEN IT IS BEING TOWED IS OPERATED BY THE AIR BRAKES ON THE MOTORHOME THROUGH A SYSTEM THAT APPLIES THE BRAKES AS NEEDED (THE TOW BRAKING SYSTEM IS MANUFACTURED BY SMI AND CALLED THE AIR FORCE ONE SYSTEM). OF THE FOUR TIMES IT HAS HAPPENED TO ME OVER THE PAST YEAR, ONE WAS WHILE TURNING LEFT ONTO A FOUR-LANE DIVIDED HIGHWAY. I PULLED INTO THE LEFT (PASSING) LANE TO ACCELERATE BUT HAD TO NEARLY STOP TO GET THE JEEP TO STOP WOBBLING. A SEMI TRUCK IN THE RIGHT LANE HAD TO SLOW DOWN BECAUSE HE SAW ME STOPPING AND NEEDED TO TAKE PRECAUTIONARY ACTION IN CASE I VEERED RIGHT. IT WAS A SCARY MOMENT.    THIS PROBLEM IS BEING TALKED ABOUT EXTENSIVELY IN RV FORUMS (SEE HTTP://WWW.IRV2.COM/FORUMS/F85/JEEP-GRAND-CHEROKEE-DEATH-WOBBLE-339594.HTML) AND THE PROBLEMS ARE IDENTICAL FOR ALL THE OWNERS OF 2016 OR LATER JEEP GRAND CHEROKEES. THIS PROBLEM HAS BEEN REPORTED TO THE NHTSA BY OTHERS (SEE NHTSA TRACKING NUMBER 11186936 FOR ANOTHER COMPLAINT ON THIS ISSUE). THIS PROBLEM APPEARS TO BE SIMILAR TO THE JEEP CHEROKEE TOWED VEHICLE WHEEL WOBBLE ISSUE THAT FCA CREATED A FIX FOR. PLEASE GET FCA TO RESOLVE THE ISSUE QUICKLY BEFORE SOMEONE IS KILLED OR SEVERELY INJURED.",
        "vin": "1C4RJFCG4HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2019",
        "dateOfIncident": "06/12/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220709,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "D   AND  R  ON TRANSMISSION   BLINKS     THEN STALLS. WHILE ON REVERSE, DOES NOT REVERSE.  WHILE ON D,  STALLS, HAVE TO PUT IT BACK  TO PARK AND RE-START ENGINE. TOOK TO DEALER,  THEY CAN NOT FIND ANYTHING,  FOR ME TO WAIT TILL MAL   SIGNAL COMES ON  IN ORDER FOR THEM TO FIND CODE.  DANGEROUS, AS I ALREADY WAS STUCK TWICE IN TRAFFIC. ONLY HAS 24000 MILES.",
        "vin": "1C4RJFBG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2019",
        "dateOfIncident": "01/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE COMES TO A STOP AND ACTIVATES AUTO STOP/START. WHEN LIFTING FOOT OF BRAKE TO PROCEED TO A TURN, THE ENGINE TURNS ON, VEHICLE MOVES, THEN TURNS OFF DISPLAYING, 'AUTO STOP/START NOT AVAILABLE', FOR APPROXIMATELY TWO AND A HALF MINUTES, I WAS STUCK IN THE MIDDLE OF AN INTERSECTION TRYING TO TURN OVER THE CAR. EVENTUALLY AFTER PUTTING THE VEHICLE IN PARK, RELEASING THE BRAKE AND TURNING OFF THE VEHICLE COMPLETELY, I PRESSED THE BRAKE AND TURNED ON THE VEHICLE SUCCESSFULLY. NUMEROUS OCCASIONS OF THIS VERY SAME INCIDENT HAVE OCCURRED IN RANDOM. RANDOM ENGINE SHUT OFFS WHILE IN MOTION HAVE OCCURRED AS WELL REQUIRING THE SAME STEPS LISTED ABOVE. VEHICLE IS EQUIPPED WITH THIS 'ECO TECHNOLOGY' 100% OF THE TIME UNLESS, A BUTTON IS PRESSED TO DEACTIVATE TEMPORARILY. (NO WAY TO PERMANENTLY SHUTOFF THIS FEATURE, NO SOLUTION FROM DEALERSHIP.)",
        "vin": "1C4RJFBG3HC"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/26/2019",
        "dateOfIncident": "05/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210039,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON PARKING LOT ON REVERSE BRAKES COMPLETELY SHOT DOWN FILLS LAKE YOUR HIT ON OBJECT AND FILLS LOW DOWN HOW SAVE IS THIS?",
        "vin": "1C4RJFBG1HC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/22/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209341,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE SIDE IMPACT FROM ANOTHER VEHICLE AND THE SIDE-CURTAIN AIRBAG DID NOT DEPLOY ON DRIVER SIDE.    DRIVING ON A CITY STREET WB, WHEN ANOTHER VEHICLE TRAVELING NM RAN A STOP SIGN AND PLOWED INTO THE FRONT AND SIDE OF OUR VEHICLE.",
        "vin": "1C4RJEAG5HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208878,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR CONTINUES TO STALL AND SHUT DOWN WHILE IN MOTION. EXTREMELY DANGEROUS AND TERRIFYING WHEN YOU'RE ON A BUSY ROAD AND TRAVELING AT 30-35MPH AND YOU LOSE ALL POWER AND YOUR CAR STALLS OUT. I HAVE GOOGLED THIS ISSUE AND THERE ARE TONS OF COMPLAINTS ABOUT THIS HAPPENING TO MANY OTHER PEOPLE. SOME WHILE ON HIGHWAYS. SOME WHILE AT STOP SIGNS. WE CONTACTED OUR DEALERSHIP YESTERDAY AND WERE TOLD THEY CAN'T SEE IT FOR 2.5 WEEKS, IN THE MEANTIME JUST DRIVE IT. I DON'T THINK SO. IT IS A DEATHTRAP. I HAVE A 17 YEAR OLD DAUGHTER THAT I DO NOT FEEL SAFE PUTTING BEHIND THE WHEEL OF THIS CAR, NOR MYSELF. MY HUSBAND AND I DECIDED WE WOULD JUST DRIVE IT TO THE DEALERSHIP ANYWAY AND WE STALLED OUT 7 TIMES IN LESS THAN A 1/4 OF A MILE. IT WAS TOO DANGEROUS AT THAT POINT TO DRIVE THE DISTANCE TO THE DEALERSHIP SO WE TURNED AROUND AND GOT IT BACK HOME. FROM WHAT IT LOOKS LIKE BASED ON OTHER COMPLAINTS, PEOPLE ARE BEING TOLD THEY NEEDED OIL. WE KNOW FOR A FACT OURS DOES NOT. IT'S COMING UP ON AN OIL CHANGE DUE DATE BUT MY HUSBAND CHECKED THE OIL STATUS AND WE ARE NOT LOW, SO THAT IS NOT THE ISSUE. WE TOLD THE DEALERSHIP IT IS UNSAFE TO DRIVE AND WE NEED A LOANER. HE EXPLAINED TO US THEY DON'T GIVE OUT LOANERS UNTIL THEY CAN RUN THE DIAGNOSTICS, IN 2 WEEKS! I AM TERRIFIED TO DRIVE THIS CAR. I STALLED OUT 4 TIMES THE DAY BEFORE IN TRAFFIC, IN MOTION AND AT AN INTERSECTION, WITH MY CHILDREN IN THE CAR! I HAVE BEEN STOPPED AT A RED LIGHT. I WAS CROSSING A BRIDGE. I WAS IN MIDDLE OF MAKING A BEND. ALL OF THESE INSTANCES, MY CAR JUST SHUT DOWN. THE STEERING LOCKS AND I LOSE TOTAL POWER. AFTER SEVERAL ATTEMPTS OF TRYING TO TURN THE CAR BACK ON, IT WILL EVENTUALLY GO, FOR NOW.",
        "vin": "1C4RJFBG8HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/15/2019",
        "dateOfIncident": "03/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207702,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE SHIFTER COMES ON WHEN I START THE ENGINE. TOOK TO THE DEALERSHIP AND THEY HAVE TRIED REPLACING THE MODULE TWICE WITH NO LUCK. THE DEALERSHIP TOLD ME THAT I NEED THE FLOOR SHIFTER REPLACED. WELL I DID THAT AND IT STILL DOESN'T WORK. THE SERVICE SHIFTER ERROR STILL COMES ON. I HAVE NOT HAD ANY ISSUES DRIVING IT, YET. FORUMS ARE FULL OF JEEP OWNERS WITH THIS SAME ISSUE. SOME HAS BEEN WHILE THEY ARE DRIVING DOWN THE HIGHWAY AND THE CAR WILL JUST DIE.",
        "vin": "1C4RJFAG6HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206945,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG A RURAL HIGHWAY @ 65 MPH & HEARD A LOUD EXPLOSION ABOVE MY HEAD. IT SOUNDED LIKE A GUNSHOT. I ACTUALLY DUCKED DOWN IN MY SEAT LOOKING INTO MY REAR & SIDEVIEW MIRRORS. THERE WAS NO ONE AROUND ME. IT WAS PARTLY CLOUDY & 60 DEGREES. I BEGAN HEARING WIND IN THE VEHICLE. I DECIDED TO STOP & CHECK THINGS OUT. LOOKING ON TOP OF THE ROOF I NOTICED A LARGE HOLE IN THE SUNROOF W/BROKEN GLASS LYING ON THE SHADE GUARD. I TURNED AROUND & HEADED TOWARDS THE LOCAL DEALERSHIP SEEKING THE ADVISE OF THE SERVICE MANAGER. HE & HIS STAFF WERE QUESTIONED ABOUT ANY KNOWLEDGE OF EXPLODING SUNROOFS & THEIR REPLY WAS NO. THEY DIDN'T SEEM TO BE TOO CONCERNED W/MY SAFETY EITHER! ACCORDING TO CONSUMER REPORTS.ORG THE ISSUE IS WELL KNOWN WITHIN THE AUTO INDUSTRY & GOVERNMENT REGULATORS. ACCORDING TO INVESTIGATIONS AUTO MAKERS ARE NOT ACKNOWLEDGING OR MAKING AN ATTEMPT TO RESOLVING THIS ISSUE. SAFETY STANDARDS & REGULATORY OVERSIGHT OF SUNROOFS HAVE NOT KEPT PACE W/DRAMATIC SIZE & DESIGN CHANGES. MORE NEEDS TO BE DONE TO GUARANTEE THEY ARE SAFE. THE BIGGER THE EXPANSE OF GLASS, THE HARDER TO ENSURE IT WON'T SHATTER. WHY SHATTERING UNDER NORMAL USE? THE VEHICLE/GLASS IS JUST TWO YEARS OLD. I HAD NO IDEA THERE WERE ANY ISSUES W/SUNROOFS SHATTERING. I WOULDN'T PURPOSELY JEOPARDIZE MY SAFETY NOR THAT OF MY PASSENGERS. THERE NEEDS TO BE A GREATER PUBLIC AWARENESS. TRANSPARENCY PLEASE",
        "vin": "1C4RJFCG1HC"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/21/2019",
        "dateOfIncident": "04/18/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202762,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED THE VEHICLE, I WAS TOLD IT WAS FLAT TOWABLE BEHIND A MOTORHOME.  AFTER PURCHASE I THEN HAD TO SPEND $500 TO HAVE A WIRING HARNESS INSTALLED TO PREVENT DEATH WOBBLE OF FRONT STEERING/WHEELS.  THE SECOND TIME I TOWED THE VEHICLE, THE BACK BRAKES LOCKED UP DESTROYING TIRES, RIMS, AND OTHER UNKNOWN ITEMS AT THISW TIME.",
        "vin": "1C4PJMBS3HW"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "10/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195807,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JEEP STARTED WITH RADIO FADING IN/OUT, LIGHTS ON THE CONSOLE FADING IN/OUT, DASHBOARD GOES OUT COMPLETELY AND THEN BACK ON AND THE PASSENGER WINDOW GOES DOWN ON IT'S OWN(EVEN WITH THE WINDOW LOCK ON) ALSO ONCE SO FAR MY JEEP DIDN'T TURN OFF WHEN I PUSHED THE SHUT OFF. I HAD TO DISCONNECT THE POSITIVE ON THE BATTERY(DEALERSHIP TOLD ME TO DO) AND HOOK IT BACK UP, IT SHOWED NO CODES WHEN I GOT TO THE DEALERSHIP. BEEN TO TWO DEALERSHIPS PAUL BAILEY WAS USELESS, BALD HILL WAS ABLE TO REPRODUCE AND WE ARE WAITING ON JEEP TO TELL THEM HOW TO FIX. ALSO IT IS HARD TO PUMP GAS, IT SHUTS OFF, YOU HAVE TO TURN THE GAS HANDLE UPSIDE DOWN TO PUMP.",
        "vin": "1C4RJFBG2HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194220,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP GRAND CHEROKEE LIMITED 4X4 SAYS \"SERVICE TRANSMISSION\". THIS IS A NEW VEHICLE AND ALREADY IS HAVING ISSUES WITH TRANSMISSION!! THIS APPEARED WHILE DRIVING",
        "vin": "1C4RJFBG4HC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192549,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT IN VEHICLE TO LEAVE SCHOOL AND DASH BOARD LIGHTS LIT UP LIKE A XMAS TREE BUT CAR WOULD NOT START. AFTER 20 MINS OF TRYING IF FINALLY STARTED BUT POWER STEERING WAS OUT. TOOK CAR TO DEALERSHIP, THEY DROVE IT FOR A WEEK BEFORE PROBLEM REPLICATED AND DIED TWICE ON THE ROAD. THEY HAVE HAD IT 2 WEEKS NOW THINKING IT MIGHT BE A PINCHED WIRE.  SOMEWHERE LIKELY IN THE DRIVERS SIDE DOOR. WILL GET BACK TO ME MONDAY, APRIL 1, 2019",
        "vin": "1C4RJEAG8HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "09/17/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186936,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BEING TOWED BY AN RV, THE JEEP STARTED VIOLENTLY WOBBLING WHICH SHOOK MY 40,000 # RV PRETTY HARD.  THIS STARTED AFTER A SLOW (ABOUT 5MPH) RIGHT TURN AND THE JEEP WENT OVER A 4 TO 5' HIGH CURB.  THE WOBBLING DID NOT STOP UNTIL COMPLETELY STOPPING THE RV.  THIS HAS ONLY HAPPENED ONCE IN 5,000 MILES OF BEING TOWED.  HAS NEVER HAPPENED WHILE DRIVING THE JEEP ABOUT 6,000 MILES",
        "vin": "1C4RJFJG7HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "09/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185729,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE BEEN HAVING ISSUES FILLING UP MY TANK ALMOST SINCE THE BEGINNING OF MY PURCHASE OF MY 2017 GRAND CHEROKEE. I AM LOOKING FOR ANSWERS AS TO WHY IT IS SO HARD TO FILL MY VEHICLE WITH GAS....",
        "vin": "1C4RJFBG7HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "02/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184537,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE START/STOP SYSTEM ON THESE VEHICLES IS AN ACCIDENT WAITING TO HAPPEN.  IF I FORGET TO SHUT IT OFF AND PULL OUT INTO TRAFFIC AFTER A STOP, THE ENGINE DELAYS ACCELERATING CAUSING ME TO NOT GET UP TO SPEED QUICK ENOUGH TO MERGE PROPERLY INTO THE LANE.  THE START/STOP FUNCTION IS GOOD FOR CITY DRIVING AND SHOULD BE AN OPTION THAT IS DEFAULTED OFF AND SELECTED TO ON WHEN THE DRIVER SO DESIRES.  THIS CONSTANT TURNING THE SYSTEM OFF EVERY TIME THE VEHICLE IS STARTED IS A SAFETY HAZARD IN MY OPINION.",
        "vin": "1C4RJEBGHXC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183116,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP IS A 2017 WITH 64,000 BARELY OUT OF WARRANTY. JEEP KEPT STALLING OUT AT STOPS WHILE DRIVING AND EXTREMELY ROUGH IDLE. TOOK IT TO DEALERSHIP, CONTACTED CHRYSLER CUSTOMER SERVICE ABOUT THE KNOWN ISSUE AND NOTHING THEY CAN DO. EXTREMELY DANGEROUS AND DO NOT FEEL SAFE DRIVING THIS PRODUCT.",
        "vin": "1C4RJEBGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/24/2019",
        "dateOfIncident": "11/21/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182176,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 JEEP GRAND CHEROKEE IT'S HAVING ELECTRICAL PROBLEM FOR ALMOST 2 YEARS NOW AND THEY CAN FOUND WHAT'S GOING ON I ALMOST GOT KILL OUT OF NO WHERE MY CAR STOPS ALL THIS MESSAGES COME UP IN THE DASHBOARD IT'S CRAZY I CAN'T DRIVE THE JEEP FOR MORE THAN 1 HOUR BECAUSE I STAR HAVING PROBLEMS PASSENGER SIDE WINDOW STAR GOING DOWN BY ITSELF",
        "vin": "1C4RJFJT1HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175290,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP CHEROKEE LATITUDE. CONSUMER WRITES IN REGARDS TO ALARM ISSUES. *LD  *TR",
        "vin": "1C4PJMCS8HW"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173493,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE DRIVER'S AND PASSENGER WINDOWS SHATTERING - WALKED TO CAR PARKED OUTSIDE. OPENED DRIVER DOOR, SAT DOWN AND CLOSED THE DOOR. UPON IMPACT OF CLOSING THE DOOR THE ENTIRE PASSENGER SIDE WINDOW SHATTERED INSIDE THE CAR. I HAVE READ ONLINE THAT THIS HAS HAPPENED TO OTHER GRAND CHEROKEE DRIVERS.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/30/2019",
        "dateOfIncident": "01/30/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173188,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR RIDE SUSPENSION SUSPENDED WARNING  VEHICLE WAS JUST STARTED.  TURNED OFF RESTARTED THEN VEHICLE ENGAGED 4LOW AND AGAIN INDICATED SUSPENSION SYSTEM SUSPENDED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/29/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172723,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 GRAND CHEROKEE TRAILHAWK GOING IN FOR THIRD TIME TO TRY TO FIX AIRBAG LIGHT COMING ON. TAKEN TO 2 DIFFERENT JEEP DEALERS AND STILL AIRBAG LIGHT COMING ON , ALSO SHOWS IN VEHICLE HEALTH REPORTS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2019",
        "dateOfIncident": "01/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172862,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S AUTOMATIC TRANSMISSION HAS HAD 6 INCIDENTS WHERE IT HAS NOT SHIFTED PROPERLY:    3 TIMES IT HAS BEEN STUCK IN 1ST GEAR AND NOT AUTOMATICALLY SHIFTED TO HIGHER GEARS. EACH TIME THIS HAPPENED WHEN PROCEEDING FROM A FULL STOP WHEN THE TRAFFIC LIGHT CHANGED INTO AN INTERSECTION, WITH THE GEAR SELECTOR IN D. EACH TIME I HAD TO QUICKLY PUT THE GEAR SELECTOR IN N AND BACK INTO D TO REMEDY THIS.    2 TIMES, WHILE AGAIN STOPPED AT A TRAFFIC LIGHT WITH THE GEAR SELECTOR IN D, I STEPPED ON THE ACCELERATOR WHEN THE LIGHT CHANGED,  BUT THE VEHICLE JUST REVVED AND DID NOT MOVE. I CHECKED THE GEAR SELECTOR AND IT WAS STILL IN D, BUT WOULD STILL ONLY REV AND NOT MOVE. AGAIN, AS ABOVE, I PUT THE GEAR SELECTOR IN N AND BACK INTO D. ONLY THEN WOULD THE VEHICLE DRIVE.    JUST LAST WEEK, I WAS ATTEMPTING TO PARALLEL PARK ON THE STREET. I PUT THE GEAR SELECTOR IN R TO BACK INTO THE EMPTY SPACE. NO VEHICLES WERE BEHIND MINE, NOR ANY ON MY LEFT. I STEPPED ON THE ACCELERATOR, BUT THE ENGINE JUST REVVED, THE VEHICLE DIDN'T MOVE. I TRIED AGAIN AND AGAIN, BUT IT JUST REVVED. I PUT THE GEAR SELECTOR IN D, WENT A LITTLE FORWARD, THEN PUT THE SELECTOR IN R. THIS TIME THE VEHICLE DID MOVE IN REVERSE.    THESE INCIDENTS HAPPENED OVER THE PAST 2 YEARS. THE VEHICLE IS CURRENTLY IN THE SERVICE DEPARTMENT AT MCKEVITT CHRYSLER JEEP DODGE IN BERKELEY, CA TO DIAGNOSE AND REPAIR THIS RECURRING ISSUE. THIS IS THE 3RD TIME I HAVE BROUGHT THE VEHICLE TO THIS DEALERSHIP FOR THIS SAME ISSUE. THE PREVIOUS TWO TIMES, THEY WERE UNABLE TO FIND THE CAUSE OF THE PROBLEM.    I HAVE FOUND THAT 20 OTHER OWNERS OF 2017 JEEP GRAND CHEROKEES HAVE REPORTED SIMILAR COMPLAINTS ON THE CAR REPAIRS.COM WEBSITE:    HTTP://M.CARCOMPLAINTS.COM/JEEP/GRAND_CHEROKEE/2017/TRANSMISSION/",
        "vin": "1C4RJFLG7HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171883,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VISITED OFFICIAL JEEP DEALERSHIP FOR AN OIL-CHANGE ON JAN 19, 2019. DEALERSHIP DID NOT RECOGNIZE A RECALL ON THIS VERY VEHICLE WAS INCOMPLETE AND DID NOT INFORM ME NOR FIX THE ISSUE.",
        "vin": "1C4RJFAG9HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165830,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2017 GRAND CHEROKEE IN DRIVE MODE IN A INTERSECTION TURNING LEFT, THE DASHBOARD SHOWED A MESSAGE OF 'SHIFT INTO PARK' AND WAS PUT INTO A NEATURAL MODE BY ITSELF DISABLING DRIVE MODE OPTIONS BUT STILL IN A 'DRIVE' STATUS NOT ALLOWING ME TO PRESS ON THE GAS TO CONTINUING TURNING LEFT, THE ONLY WAY TO CHANGE THIS STATUS THE VEHICLE HAD TO BE COMPLETELY TURNED OFF AND TURNED BACK ON AGAIN. THIS WAS A VERY SCARY INCIDENT AND APPEARS TO BE A MALFUNCTION WITH THE VEHICLE.",
        "vin": "1C4RJEAG9HC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/14/2018",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161319,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MICHELIN TIRES-285X60XR18 NEEDED TO BE REPLACED AT 16,000 MILES. THE WEAR BARS WERE ALREADY SHOWING. I TOOK TO JEEP DEALERSHIP IN LANSING, MICHIGAN AND WAS ACCUSED OF DRIVING WRONG, NOT ROTATING AND BALANCING (I AM METICULOUS ABOUT SERVICE-SO YES, DID), DRIVING ON TOO MANY DIRT ROADS (LIVE IN THE CITY, CITY DRIVING ONLY-SO NO) AND OFFERED NO DISCOUNT ON NEW TIRES.  DISCOUNT TIRE TOLD ME THAT JEEP IS NOTORIOUS ABOUT PUTTING ON CHEAP TIRES TO BRING DOWN COST OF CAR.   SERIOUSLY 16,000 MILES OF CITY DRIVING!  I BOUGHT THE CAR NEW WITH 30ISH MILES ON IT...THE TIRES SHOULD LAST MORE THAN 6 MONTHS.  SOMETHING IS WRONG WITH THESE TIRES OR THE CAR!",
        "vin": "1C4RJFBG4HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/27/2018",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154167,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "RATTLE NOISE HEARD ON COLD START LASTING 2-3 SECONDS. NOISE NOTED AFTER INITIAL OIL CHANGE. THE NOISE WAS HEARD 5/2017. TAKEN TO DEALERAHIP SEVERAL TIMES IN 2017 AND 2018 AND THEY STATED  IT WAS THE STARTER. LEFT VEHICLE OVER NIGHT SO DEALERSHIP COULD HEAR NOISE AND THEY DID HEAR RATTLE. THEY SAID IT WAS THE STARTER AND REPLACED STARTER. THIS DEALER EVEN SUGGESTED THAT THE NOISE WAS COMING FROM THE LIFTERS. NO SUGGESTION AS TO HOW THAT COULD BE CORRECTED. OTHER THAN THAT NO RESOLUTION. NOISE CONTINUES DEALERSHIP SAID OTHER VECHICLES LIKE MY VEHICLE MAKES THE SAME NOISE. MY VEHICLE WAS MADE A STAR CASE BY CHRYSLER NO RESOLUTION. STATED ISSUE ON JEEP FORUM A JEEP CARES SPECIALIST NOTED COMPLAINT AND SUGGESTED I GO TO ANOTHER DEALERSHIP. TOOK VEHICLE TO ANOTHER JEEP DEALERSHIP ONLY TO HEAR THAT IT WAS THE STARTER AND OTHER VEHICLES LIKE MY VEHICLE DOES THE SAME THING. NO RESOLUTION. THE VEHICLE IS ALWAYS PARKED, WEATHER CAN BE HOT OR COLD AND VEHICLE IS PARKED 6 MORE HOURS. NOISE CONTINUES. I'M HEADED INTO SECOND YEAR OWNING THIS VEHICLE THAT CONTINUES WITH THIS NOISE. IF IT IS THE LIFTERS WILL THEY EVENTUALLY WEAR OUT AND CAUSE THE VEHICLE TO STOP RUNNING? IF IT IS THE STARTER WILL THAT WEAR OUT AND PREVENT RESTART? BOTH QUESTIONS A VERY SERIOUS. I HOPE THEIR COMPLAINT CAN BE INVESTIGATED AND RESOLVED. IF THERE ARE OTHERS WITH THIS ISSUE PLEASE FILE A COMPLAINT. NEED RESOLUTION.",
        "vin": "1C4RJEAG5HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2018",
        "dateOfIncident": "11/16/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152063,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS EXPERIENCING WHAT IS REFERRED TO AS THE 'DEATH WOBBLE' WHEN FLAT TOWED BEHIND MY MOTORHOME AND MAKING A TURN AT LOW SPEED. THIS PROBLEM ALSO OCCURRED IN JEEP CHEROKEE AND JEEP CAME OUT WITH A FIX. THE PROBLEM WAS TRACED BACK TO THE THE ELECTRIC POWER STEERING WHICH WAS NEW TO THE JEEP CHEROKEE AND ALSO GRAND CHEROKEE IN 2017. THIS PROBLEM CAN BE VERY DANGEROUS IF PULLING INTO A ROAD AND HAVING TO STOP BECAUSE OF A RISK OF LOOSING CONTROL OF THE JEEP VEHICLE. THE ONLY WAY STOP THE SIDE TO SIDE 'DEATH WOBBLE' IS TO COME TO A COMPLETE STOP. ON COMING TRAFFIC FROM THE REAR  WOULD NOT REALIZE YOU HAVE PROBLEM AND REAR ENDING ACCIDENT IS EMINATE.",
        "vin": "1C4RJFLG4HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150280,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL UPON DRIVING MT JEEP GC ON THE HIGHWAY THIS MORNING, EVERYTHING WAS GOING FINE, I EXITED THE HIGHWAY AT STOP LIGHT AND AS USUAL, THE STOP/START ENGAGED, WHEN THE LIGHT TURNED GREEN A LIFTED MY FOOT OF THE BRAKE SO THE CAR WILL START AGAIN BUT IT DIDNT. SO I TURNED OFF THE RADIO AND AUTO LIGHT AND FORCED THE CAR TO NATURAL AND PRESSED THE START BUTTON AND CAR STARTED. ON GUAGE DISPLAY A RED BATTERY LIGHT CAME ON AND A MESSAGE THAT SAID \" PARK CAR, VEHICLE WILL SHUT DOWN SOON\", SO I DROVE AROUND 15MIN'S TO FIND A SAFE PARKING SPOT AND STOPPED IN SUPERMARKET PARKING LOT.. 2MIN LATER THE CAR SHUT DOWN.  I CARRY WITH ME PORTABLE JUMPER SO I OPENED THE HOOD AND CONNECTED IT BUT NO POWER WAS REACHING. SO I LIFTED THE PASSENGER SEAT AND GAINED ACCESS TO THE MAIN BATTERY AND CONNECTED THE JUMPER DIRECTLY TO THE TERMINALS BUT STILL, NO POWER WAS CIRCULATING. SO I CONNECTED IT TO THE AUXILIARY BATTERY AND POWER WAS THERE. AND THE CAR STARTED. PUT NOT SAFE TO DRIVE.    I PICKED UP MY JEEP FOUR DAYS AGO NEW FROM THE DEALER, SO WHEN THIS HAPPENED MY CAR HAD 250MILES ON IT.",
        "vin": "1C4RJFAG9HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "10/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142681,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/12/18 I WAS GETTING READY TO GO TO WORK HOWEVER WHEN I TRIED TO OPEN MY CAR IT WOULD NOT OPEN MY CAR WAS PARKING THE PARKING LOT OF WHERE I LIVE I CALLED NIELSEN DODGE AND THEY HELP ME TO OPEN THE CAR MANUALLY AND SILENCE THE ALARM BUT THE CAR WAS NOT TURNING ON AND NEITHER THE DEALER NOR THE PEOPLE FROM UCCONECT COULD REMOTELY START MY JEEP, MY CAR WAS TOWED TO NIELSEN DODGE IN RT 10 AND IT HAS BEEN THERE FOR TWO WEEKS NOW AND THEY STILL CANNOT GIVE ME AN ESTIMATE AS TO WHEN MY CAR WILL BE FIXED OR IF IT WILL BE FIXED. ON 10/24/18 CHRYSLER SENT OUT AN ENGINEER TO LOOK AT MY JEEP AND I WENT IN TODAY FOR A FOLLOW UP AND THE TOLD THEY HAVE TO ORDER A PART BUT THEY DO NOT KNOW HOW WILL IT TAKE FOR THE PART TO ARRIVE, MY CASE NUMBER WITH CHRYSLER IS 57198050. I READ ONLINE AND SEE OTHER PEOPLE HAVING SIMILAR ISSUES WITH 2017 JEEP GRAND CHEROKEE NOT TURNING ON PLEASE HELP ME WITH THIS MATTER AS IT IS NOW BEEN 2 WEEKS AND I JUST NEED TO KNOW IF OR WHEN THE CAR WILL BE FIXED.",
        "vin": "1C4RJFBG6HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP ROLL AWAY WHILE IN PARK. ORIGINAL DRIVER PUT CAR IN PARK AND LET THE CAR SETTLE ON PAWL. AFTER POSITIVE STOP IN PARK, DRIVER APPLIED PARKING BRAKE AND LEFT THE VEHICLE TAKING KEY FOB WITH HER, AND CLOSED DOOR. CAR WAS STILL RUNNING. NEW DRIVER OPENED THE DOOR, ENTERED AND CLOSED DOOR. DRIVER REMOVED PARKING BRAKE AND ATTEMPTED TO MOVE CAR INTO DRIVE. WITHOUT KEY FOB, THIS IS NOT POSSIBLE. CAR REPORTED KEY FOB HAD LEFT THE VEHICLE, AT WHICH TIME THE 2ND DRIVER LEFT THE VEHICLE TO RETRIEVE THE KEY. ONCE LEAVING THE VEHICLE, THE CAR BEGAN TO ROLL BACKWARDS WITHOUT THE DRIVER AND WITH A SOMEONE IN THE PASSENGER SEAT. WHILE ROLLING PASSENGER TRIED TO MOVE SHIFTER INTO PARK, BUT HANDLE WAS FIRMLY IN THE PARK POSITION. CAR ROLLED APPROXIMATELY 300 FEET BEFORE HITTING A HOUSE. POLICE REPORT INDICATES CAR WAS IN PARK AND WITHOUT KEY FOB.",
        "vin": "1C4RJFLG3HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "10/13/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140176,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE SECOND TIME, I WAS PULLED OVER BY THE STATE POLICE BECAUSE MY TAIL LIGHTS WERE NOT ON AT NIGHT.  IN BOTH CASES, IT IS LIKELY THAT WHEN I GOT OUT OF MY JEEP MY KNEE BRUSHED THE DIAL THAT CONTROLS THE HEADLIGHTS AND MOVED IT FROM \"A\" TO \"O\" (AUTO TO OFF).  BOTH TIMES IT WAS AFTER DARK AND BECAUSE OF THE DAYTIME RUNNING LIGHTS, IT WAS NOT IMMEDIATELY CLEAR TO ME THAT THE HEADLIGHTS (AND TAILLIGHTS) WERE NOT ON. IN BOTH CASES, THE TROOPER LET ME OFF, BUT THIS SEEMS LIKE A DESIGN FLAW THAT COULD CREATE A MAJOR PROBLEM IF A CAR WERE FOLLOWING ME AND DID NOT SEE ME.",
        "vin": "1CRJFBG5HC8"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133589,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER FOR 10 MONTHS.  SEVERAL TIMES OVER THE LAST TEN MONTHS, WHEN STOPPED AND THEN DEPRESSING THE GAS PEDAL FULLY WITHOUT CRUISE CONTROL OR LAUNCH CONTROL ENGAGED, THE THROTTLE CONTINUES TO ACCELERATE EVEN THOUGH MY FOOT IS REMOVED FULLY FROM THE GAS PEDAL.  IT FORCES YOU TO PUT THE CAR IN NEUTRAL AND BRAKE UNTIL THE THROTTLE BECOMES \"UNSTUCK\" AND THE RPMS OF THE ENGINE COME BACK DOWN.  I AM MECHANICALLY INCLINED AND HAVE CHECKED TO SEE IF THE FLOOR MAT OR SOMETHING AROUND THE PEDAL OR PEDAL MECHANISM WAS CAUSING THE PEDAL TO BE STUCK BUT THERE ARE NO INDICATIONS OF ANY MECHANICAL INTERFERENCE.  I HAVE READ FROM OTHER OWNERS WHO HAVE HAD A SIMILAR ISSUE WITH THE HIGH PERFORMANCE TRIMS (SRT AND TRACKHAWK) OF THE GRAND CHEROKEE.  AGAIN CRUISE CONTROL AND LAUNCH CONTROL WERE NOT ACTIVATED IN ANY WAY.  I KNOW THERE WAS A CRUISE CONTROL RECALL FOR THROTTLE STICKING BUT THIS IS NOT BEING OBSERVED WITH THE CRUISE CONTROL SET OR ON.  IS THIS PERHAPS A RELATED ISSUE ??",
        "vin": "1C4RJFDJ3HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "09/10/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133390,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE RESPONSE HESITATES FROM 1.5 TO 2 FULL SECONDS DURING ACCELERATION IN INTERSECTIONS AND STOP AND GO SITUATIONS. THIS IS DEFINITELY A COLLISION WAITING TO HAPPEN SITUATION. THE PROBLEM IS ESPECIALLY ANNOYING IN 4X4 LOW RANGE SITUATIONS. THE ENGINE OVER ACCELERATES WHEN THROTTLE RESPONSE FINALLY KICKS-IN CAUSING VEHICLE TO JUMP FORWARD. THIS SUDDEN ACCELERATION OFTEN JOLTS THE TRANSMISSION AND DRIVETRAIN STARTLING THE DRIVER. DEALERSHIP HAS INVESTIGATED SAYING IT IS A NORMAL DELAY IN THE COMPUTER OPERATED THROTTLE. THAT IS BS. ANY DELAY IN THROTTLE RESPONSE WITH SUBSEQUENT OVER ACCELERATION IS A SAFETY CONCERN THAT NEEDS TO BE ADDRESSED!",
        "vin": "1C4RJFLG7HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133188,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE GOODYEAR FORTERA TIRES ON A \"TRAIL RATED\" JEEP GRAND CHEROKEE  PURCHASED NEW WITH THE VEHICLE. CURRENTLY, SLIGHTLY MORE THAT 33,000 MILES ON THE TIRES. VEHICLE PURCHASED NEW DECEMBER 2016. WE HAVE HAD 4 FLAT TIRES ON 3 TIRES. TWO OF THE INCIDENTS OCCURRED WITHIN 2 DAYS OF EACH OTHER. EACH RESULTING FROM A SMALL ROCK PENETRATING THE RUBBER. VEHICLE WAS IN MOTION. I HAVE CALLED JEEP CORPORATE AND THE DEALER. NEITHER WILL LISTEN TO OUR CONCERNS. I CALLED GOODYEAR WHO STATED THAT FOR THIS VEHICLE, LT TIRES AREN RECOMMENDED BUT WAS NOT CONCERNED THAT THE VEHICLE WAS SOLD WITH THESE TIRES AND IN LESS THAN 2 YEARS WE HAVE 4 FLAT TIRES DUE TO THE SAME ISSUE. TIRES ARE THE  MOST IMPORTANT SAFETY FEATURE OF A VEHICLE.  IS THERE AN ISSUE WITH THE RUBBER OF THE TIRE. GOODYEAR FORTERA TIRES HAVE HAD AT LEAST ONE OTHER RECALL IN THE RECENT PAST.",
        "vin": "1C4RJFAG3HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130965,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER WAS PULLING INTO A PARKING SPOT DOING APPROX 2 MILES PER HOUR. ALL OF A SUDDEN THE CAR PROPELLED FORWARD, JUMPED THE CEMENT PARKING BLOCK AND HIT THE BUILDING THAT THE PARKING SPOT WAS IN FRONT OF.  DRIVER WAS GOING TOO SLOW AND HAD FOOT OVER BRAKE THE ENTIRE TIME SO HOW DID THE CAR JUST PROPEL FORWARD? 1 MONTH OR SO AFTER ACCIDENT RECEIVED A LETTER THAT THERE WAS A RECALL ON THE CRUISE CONTROL SYSTEM. TOOK CAR INTO THE JEEP DEALER WHO SAID THAT WHAT THE JEEP DID COULD TOTALLY HAVE BEEN A RESULT OF THE RECALL????!!!!!!!",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "11/24/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131078,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP GRAND CHEROKEE LAREDO SHUTS OFF WHILE DRIVING. FIRST NOTICED ABOUT A MONTH AFTER DRIVING IT. APPROX. MILEAGE ABOUT 5,000 ON INITIAL COMPLAINT; CURRENT MILEAGE ABOUT 23,000. VEHICLE WILL BEEP AT YOU AND DASH WILL STATE \"VEHICLE NOT IN PARK\". FIRST TIME IT OCCURRED AT NIGHT AND I LOST ALL EXTERIOR LIGHTS. OTHER TIMES WHEN ENGINE SHUTS OFF IT KEEPS RADIO AND INTERIOR DASH LIGHTS ON. MULTIPLE DEALERSHIPS STATE THAT THEY CANNOT RECREATE THE ISSUE AND THAT NO CODES ARE BEING STORED. CHRYSLER HOOKED UP A DATA RECORDER TO THE VEHICLE AND STATED NOTHING OUT OF THE ORDINARY SHOWED UP ONCE IT HAPPENED. WAS ALSO TOLD THAT IF VEHICLE LOST ALL POWER DURING THE INCIDENT, THAT THE DATA RECORDER WOULD NOT REFLECT THOSE CONDITIONS. THE COMPANY WILL NOT REPLACE, REPAIR, OR BUY BACK WITHOUT A DIAGNOSIS. HUGE SAFETY CONCERN FOR NOT ONLY THE PASSENGERS AND DRIVER, BUT ALSO OTHERS ON THE ROAD. IF ON A BUSY STREET IT SHUTS OFF WITH NO LIGHTS,  THERE WILL BE GREATER RISK OF CAUSING AN ACCIDENT AT SPEED. ACCORDING TO DEALERSHIP REPS, LOOKED INTO PUSH BUTTON CONTROLLER AND RECEIVER, AUTO START/STOP FEATURE, KEY FOBS, AND ENGINE FUEL SYSTEM. ALL OPEN RECALLS HAVE BEEN PERFORMED ON MY JEEP. ALL RECOMMENDED FACTORY MAINTENANCE HAS BEEN PERFORMED AT THE DEALERSHIP. THIS IS NOT THE ONLY ISSUE RECORDED, BUT IS THE MOST SERIOUS DUE TO LIFE SAFETY CONCERNS.",
        "vin": "1C4RJFAG1HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2018",
        "dateOfIncident": "08/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122688,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FIVE SEPARATE OCCASIONS, THE TAILGATE OF THE VEHICLE HAS OPENED ON ITS OWN. IT HAS HAPPENED DURING VARIOUS HOURS OF THE DAY, BOTH DAYTIME AND OVERNIGHT. AND ON THREE OF THOSE OCCASIONS THE HOME LINK SYSTEM HAS ALSO BEEN ACTIVATED WHICH THEN OPENED THE GARAGE DOOR CAUSING DAMAGE TO THE REAR OF THE TAILGATE. ALSO, SINCE THE ONSET OF THIS ISSUE THE HOME LINK BUTTON DOES NOT ALWAYS WORK EVEN IN CLOSE PROXIMITY TO THE GARAGE DOOR ITSELF.",
        "vin": "1C4RJEAG4JC"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121532,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR ACCELERATION PEDAL WOULD NOT WORK AND THE CAR WOULD PROMPT ME TO GO TO PARK TO RESTART, WHILE I WAS DRIVING IT. IT WOULD QUICKLY DECELERATE AND WAS A DANGER TO ME AND MY FAMILY. PROBLEM WOULD NOT PRODUCE A CODE AND COULD NOT BE REPLICATED SO THEY RETURNED THE CAR BACK TO ME TO BE DRIVEN BY MY FAMILY. THE CAUSE OF THE PROBLEM IS UNKNOWN NO SOLUTION WAS EVER GIVEN. WE GOT RID OF THE VEHICLE DUE TO THE HUGE SAFETY CONCERN TO OUR FAMILY. NO ONE SHOULD HAVE TO GO THROUGH THIS. I DID A GOOGLE SEARCH AND THIS IS A PROBLEM THAT JEEP KNOWS ABOUT AND IS NOT FIXING. THEY ARE INTENTIONALLY PUTTING PEOPLE AT RISK FOR THEIR OWN MONITARY GAIN.",
        "vin": "1C4RJEAG8HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "08/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121428,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP GRAND CHEROKEE. CONSUMER WRITES IN REGARDS TO VEHICLE ACCELERATING FULL THROTTLE WHILE VEHICLE IS SET TO CRUISE CONTROL. *LD  *JS",
        "vin": "1C4RJFJG0HC"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "08/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11120565,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MY JEEP GRAND CHEROKEE LAREDO 2017 WAS BEING DRIVEN ON HIGHWAY 52 IN JUANA DIAZ PUERTO RICO. AT THE TIME IT HAD STARTED RAINING AND THE VEHICLE WAS GOING BETWEEN 55-60MPH. THE \"SERVICE ELECTRONIC STABILITY CONTROL\" MESSAGE CAME ON DURING THE WEEK TWICE BUT THEN IT NEVER CAME UP AGAIN, ON THIS DAY THE MESSAGE DID NOT SHOW UP AT ALL AND WHILE DRIVING THE VEHICLE PULLED TOWARDS THE DRIVER SIDE (LEFT) AND CRASHED INTO THE SECURITY SECURITY FENCE, AFTER THIS CONTROL OF THE VEHICLE WAS LOST AND THE BRAKES STOPPED RESPONDING WHICH LEAD TO A SECOND CRASH WITH THE PASSENGER SIDE (RIGHT) SECURITY FENCE. THE VEHICLE CAME TO A COMPLETE AND ABRUPT HALT BECAUSE THE ENTIRE FRONT TRAIN WAS DESTROYED, THE FRONT WHEELS LITERALLY FELL OFF THE SUV BECAUSE THE IRON SEEMED LIKE IT HAD BEEN CUT THROUGH WITH A KNIFE. WHAT IS COMPLETELY SURPRISING IS THE FACT THAT AFTER TWO MAJOR COLLISIONS THE AIRBAGS DIDN'T DEPLOY AT ALL WHICH LEAD THE PASSENGER TO RECEIVE A BLOW TO HEAD AND THE DRIVER A BLOW TO THE HIP AND LEFT KNEE (THANKFULLY THEY WERE CLEARED OF MAJOR INJURIES BY DOCTORS), ALL OF THIS HAPPENED WITH BOTH VICTIMS OF THE CRASH USING THEIR SEATBELTS IN THE CORRECT MANNER. FORTUNATELY NO OTHER CARS WERE INVOLVED IN THE ACCIDENT BECAUSE TRAFFIC WAS VERY LIGHT AT THE TIME (APPROXIMATELY 11:15AM).",
        "vin": "1C4RJEAG2HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/10/2018",
        "dateOfIncident": "08/09/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119027,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. WHILE THE CONTACT WAS ATTEMPTING TO PARK ON AN INCLINED DRIVEWAY, THE VEHICLE ROLLED BACKWARDS WHILE ENGAGED IN DRIVE. THE VEHICLE WAS TAKEN TO THE DEALER (GILLMAN CHRYSLER JEEP RAM DODGE, 10585 W SAM HOUSTON PARKWAY S, HOUSTON, TX 77099) WHERE THE CONTACT WAS INFORMED THAT ALL THE VEHICLES MANUFACTURED OF THE SAME YEAR AND MODEL WERE DESIGNED IN THAT MANNER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2018",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115695,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. WAS DRIVING WITH KIDS AND WIFE I BEGAN COMING TO A STOP AND WAS GOING ABOUT 10 TO 15 MPH WHEN THE CAR STALLED OUT. IT SHUT OFF AND THE STEERING WHEEL LOCKED UP ALONG WITH THE BREAK PEDAL WAS NONOE FUNCTIONAL AS WELL AS THE GAS PEDAL AND THE GEAR SHIFT. THE CAR WOULD NOT GO BACK INTO PARK AND LEFT ME IN THE MIDDLE OF THE ROAD FOR ABOUT 4 MINUTES. I FINALLY GOT IT INTO PARK AND THEN IT WOULDN'T START FOR A FEW MINUTES. THIS ALL HAPPENED ON A MAJOR HIGHWAY IN MY AREA. IT FINALLY STARTED AND WE TOOK IT TO THE DEALERSHIP AS IT IS PRETTY MUCH BRAND NEW. (33K) ON THE VEHICLE. THE DEALERSHIP HAS RAN TEST AND HAS TOLD ME THAT THERE IS A 2018 JEEP IN THE SAME PLACE DOING THE SAME THING. WE HAVE HAD THE CAR THERE FOR ABOUT A MONTH AND THEY SAY THERE IS NOTHING WRONG WITH IT AND NOW WE HAVE TO COME PIC IT UP. SOMETHING IS DEFINITELY WRONG WITH THE JEEP AS WE WAS IN MOTION, COMING TO A STOP AND WAS NOT TURNING. I WOULD SAY IT'S A LIFE OR DEATH SITUATION.",
        "vin": "1C4RJFAG1HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114792,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER HAS TRIED TO FIX ELECTRICAL PROBLEMS 4 TIMES  7/30/18 WE HAD NO HEADLIGHTS,NO TAILLIGHTS,NO TURN SIGNALS,NO BRAKE LIGHTS,AND NO WAY OF KNOWING THEY DIDN'T WORK.  TODAY 7/31/2018 WENT TO START CAR LOCKED INTO RUN BUT WASN'T RUNNING COULDN'T MOVE OUT OF PARK WON'T START AGAIN",
        "vin": "1C4RJFAG6HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112564,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE INTERSTATE IN WY, 70-75MPH, ROLLING TRRAIN, CRUISE CONTROL ON. ALL OF THE SUDDEN THE VEHICLE DE-ACELERATED. THE TRANSMISSION WAS IN AUTOMATIC WHEN THIS OCCURED. BOTH OF MY HANDS ON THE WHEEL WHEN THIS HAPPENED. TRIED TO RE-ACELERATE, BUT THE VEHICLE WAS VERY SLUGGISH. THE GEAR WAS STUCK IN HIGH GEAR, WHICH WOULD NOT CHANGE UNTIL I PULLED OVER, PUT THE GEAR IN PARK, AND THEN IN DRIVE. NO INJURIES, NO DAMAGE, BUT I DON'T WANT THIS TO HAPPEN AGAIN. COULD HAVE BEEN A BADPROBLEM IF I WAS IN HEAVIER TRAFFIC. WHEN I GOT HOME I RECIEVED THE RECALL NOTICE FOR UDDEN ACCELERATION WITH THE CRUISE ON.",
        "vin": "1C4RJFBG1HC"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112737,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2017 JEEP GRAND CHEROKEE, SUMMIT, DOWN THE HIGHWAY AT 65MPH, THE POWER STEERING AND LAND SENSE SUDDENLY BECAME UNAVAILABLE.  THE JEEP VEERED TO THE RIGHT HARD, NEARLY HITTING THE CAR NEXT TO ME, AND  OFF THE ROAD WITHOUT POWER STEERING.  2 WARNINGS IMMEDIATELY DISPLAYED \"POWER STEERING UNAVAILABLE SERVICE REQUIRED AND LANDSENSE UNAVAILABLE SERVICE REQUIRED.\" THIS VEHICLE HAS 23,395MILES ON IT. NOTE****  THIS OCCURRED THE DAY AFTER IT WAS IN THE DEALERSHIP FOR THE CRUISE CONTROL SAFETY RECALL U65 REPAIR.  THE JEEP WAS TOWED TO THE DEALERSHIP AND THE TOW TRUCK DRIVER EXPERIENCED NO POWER STEERING WHILE LOADING AND UNLOADING THE JEEP.  THE SERVICE TECH HOWEVER; HAD NO PROBLEM AND DID NOT WITNESS THE LACK OF POWER STEERING.  THERE WERE NO REPAIRS DONE AND I WAS TOLD \" IT WAS A COMPUTER GLITCH\"  I AM TERRIFIED TO DRIVE THIS VEHICLE!",
        "vin": "1C4RJFJT6HC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/15/2018",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111450,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE PADS AND ROTORS REQUIRED REPLACING AT 23,000 WITHOUT WARNING. AN INSPECTION AT 17,000 MILES WAS NORMAL. TIRE WEAR IS NORMAL AND AT 30,000 VEHICLE IS STILL ON ITS ORIGINAL TIRES. THE VEHICLE HAS NO WARNING SYSTEM OF BRAKE PAD WEAR",
        "vin": "1C4RJFDJ6HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/21/2018",
        "dateOfIncident": "06/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11102951,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT LEASED A 2017 JEEP GRAND CHEROKEE. WHILE ATTEMPTING TO REVERSE INTO A PARKING SPACE, THE VEHICLE JERKED VIOLENTLY AND THE CONTACT LOST CONTROL OF THE VEHICLE. AS A RESULT, THE CONTACT CRASHED INTO TWO PARKED AND UNOCCUPIED VEHICLES. THE VEHICLE CAME TO A STOP WHEN IT CRASHED INTO SOME BUSHES. ANOTHER DRIVER ASSISTED THE CONTACT BY ATTEMPTING TO REVERSE THE VEHICLE OUT OF THE BUSHES; HOWEVER, THE VEHICLE CONTINUED TO JERK. THE VEHICLE WAS TOWED TO STERLING HEIGHTS DODGE CHRYSLER JEEP (40111 VANDYKE AVENUE, STERLING HEIGHTS, MICHIGAN 48313, (586)-939-3900) WHERE IT WAS AWAITING DIAGNOSTIC TESTING AND REPAIRS. A POLICE REPORT WAS FILED. THE CONTACT'S HEAD STRUCK THE HEADREST AND STEERING WHEEL, WHICH DID NOT REQUIRE MEDICAL ATTENTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 8,000. *TT",
        "vin": "1C4RJFAG1HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102502,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW 2017 JEEP GRAND CHEROKEE IN FEBRUARY 2017.  VEHICLE COMPLETELY BROKE DOWN AT A MAIN STREET INTERSECTION ON APRIL 2017  AND WOULD NOT MOVE.  TOWED TO DEALERSHIP.  DEALERSHIP REPLACED THE TRANSMISSION.  2 WEEKS LATER VEHICLE JUST TURN OFF ON MAJOR FREEWAY.  AGAIN RETURNED TO DEALERSHIP.   JUNE 2018 ENTERING MAJOR HIGHWAY TRANSMISSION CHANGED GEARS AND WOULD NOT ACCELERATE.  PER DEALERSHIP SOFTWARE UPDATE FIXED PROBLEM.  2 DAYS LATER DROVE FOR OVER AN HOUR AND WHILE STOPPED AT INTERSECTION VEHICLE WOULD NOT MOVE..NOT ACCELERATING.  CURRENTLY VEHICLE BACK AT DEALERSHIP AND INFORMED TRANSMISSION NEEDS TO BE REPLACED.   PER SERVICE REP TRANSMISSION ON BACK ORDER AND NO ETA ON WHEN VEHICLE TRANSMISSION WILL BE REPLACED.  THIS IS MY PRIMARY VEHICLE AND I AM GO HONESTLY SCARED TO DRIVE THIS VEHICLE.",
        "vin": "1C4RJEAG0HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "09/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101526,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE DAY I PURCHASED THE VEHICLE, EVERY TIME I START MY CAR, THE RADIO IS ON NEARLY AT FULL VOLUME.  THE CAR PLAYS THE SAME STATION AT THE SAME HIGH VOLUME.  IT DOES NOT MATTER IF WHEN I SHUT OFF THE VEHICLE, THE RADIO IS OFF, OR THE RADIO IS ON.  IT ALSO DOES NOT MATTER IF I REMOTELY START THE VEHICLE OR START WHILE I'M IN THE CAR.  THE SYSTEM SHOULD BE DESIGNED SO THAT THE RADIO IS ALWAYS OFF WHEN THE VEHICLE IS FIRST STARTED.  POOR DESIGN.  SHOULD I EXPECT A TESLA LIKE RESPONSE BY EXPECTING CHRYSLER TO SEND A SOFTWARE PATCH VIA SATELLITE DIRECTLY TO MY VEHICLE TO UPDATE THIS ISSUE?  BTW, THE DEALER TOLD ME THIS IS EXPECTED BEHAVIOR.",
        "vin": "1C4RJFB0GC3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "09/12/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101527,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NO INDICATOR OR ALARM IS PROVIDED WHEN THE TAILGATE IS OPEN AND THE VEHICLE IS PUT INTO REVERSE!!!!  WHEN I FIRST PURCHASED THE VEHICLE, I WAS IN A PARKING GARAGE IN CHICAGO.  I LOADED MY BAGGAGE IN THE TRUNK AND HIT THE BUTTON ON THE INSIDE OF THE TRUNK TO CLOSE THE LIFT GATE.  I THEN SAT IN THE DRIVERS SEAT AND STARTED TO BACK-UP.  WHEN I BACKED UP, I HEARD A LOUD NOISE AND FOUND THAT THE LIFT GATE HAD RETURNED TO IT'S OPEN POSITION AND SCRAPPED ALONG THE CEILING OF THE GARAGE.  IT COULD HAVE BEEN MUCH WORSE.      WHEN I WAS LOOKING IN MY REAR VIEW MIRROR TO BACK-UP, EVERYTHING LOOKED CLEAR.  I DID NOT SEE FROM THE REAR VIEW MIRROR THAT THE LIFT GATE WAS OPEN.  I DID SAY THIS OCCURRED WITHIN THE FIRST COUPLE OF DAYS WHEN I RECEIVED THE VEHICLE.      I TOOK IT TO THE DEALERSHIP TO CHECK ON THE LACK OF AN ALERT AND ALSO ASKED THEM TO REPAINT THE SCRATCH THAT WAS LEFT ON THE LIFT GATE FROM CONTACT WITH HE CEILING.  THEY ASKED ME TO CONTACT CHRYSLER.  I CONTACTED CHRYSLER CUSTOMER SERVICE AND THEY TOLD ME THAT IT WAS THE DESIGN INTENT BECAUSE DRIVERS LIKE TO DRIVE THEIR JEEPS WITH THE LIFT GATE OPEN.  I SAID, IN REVERSE????  A DRIVERS ALERT SHOULD BE MANDATORY - A LOUD CHIME IS EXPECTED  IT IS A SAFETY ISSUE.",
        "vin": "1CRJFBG0GC3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101529,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IT APPEARS THAT THERE IS A BUG IN THE PROGRAMMING OF THE VEHICLE.  WHEN I EITHER USE THE REMOTE, OR THE BUTTON IN THE TRUNK AREA TO CLOSE THE LIFT GATE, AS I WALK TO THE FRONT OF THE VEHICLE AND OPEN THE DOOR, THE LIFTGATE STOPS CLOSING AND RETURNS TO OPEN.  IT DOESN'T HAPPEN 100% OF THE TIME BUT GREATER THAN 75% THE LIFTGATE WILL STOP CLOSING WHEN I OPEN THE FRONT DOOR.",
        "vin": "1C4RJFBG0GC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/11/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101286,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY AT 60 MPH AND SLOWING FOR A TURNING CAR AHEAD, THE CARS EMERGENCY BRAKING TURNED ON AND TRIED TO STOP THE CAR.  THIS HAS OCCURRED TWICE THIS WEEK.",
        "vin": "1C4R3FCG7HC"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2018",
        "dateOfIncident": "05/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098758,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE WHILE IN MOTION, AFTER MAKING A TURN AND SLOWING FROM 35 TO ABOUT 14 MPH, THE ENGINE STALLED. ONCE IN DEC 2017, NEXT IN MAY 2018, I HAD TO COME TO A COMPLETE STOP IN BOTH CASES IN ORDER TO START THE ENGINE. FORTUNATELY NO ONE WAS BEHIND ME.",
        "vin": "1C4RJEAG4HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097273,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ENGINE START STOP FEATURE IS ACTIVATED THE  CAR ENGINE SHUTS OFF WHEN IDLING AT STOP LIGHTS, THE PROBLEM OCCURS WHEN YOU TAKE FOOT OFF BRAKE AND THE ENGINE RESTARTS IT EITHER LUNGES THE CAR FORWARD FORCIBLY  OR THE CAR LUNGES BACKWARDS AS IF THE TRANSMISSION CLUTCH DIDNT PROPERLY ENGAGE TO MOVE THE CAR FORWARD, MY CAR HAS AUTOMATIC TRANSMISSION.    WHEN CAR IS OFF AND YOU TOUCH HANDLE TO OPEN DOOR IT SOMETIMES CAUSES ELECTRICAL SHOCK.    WE NOTICED THESE ISSUES DURING THE FIRST WEEK OF DRIVING  CAR MAY 2017",
        "vin": "1C4RJEAG9HC"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/27/2018",
        "dateOfIncident": "12/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11090433,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: 2017 JEEP GRAND CHEROKEE IMPACT W/DEER FRONT CENTER/RIGHT AND RIGHT FRONT QUARTER PANEL. ON A STATE HIGHWAY MY VEHICLE WAS IN MOTION COMING DOWNHILL DOING 55MPH AND BRAKED HARD - PUMPED ONCE TO TRY TO AVOID IMPACT WHEN I SAW DEER. HAVE NOT ACQUIRED SRS DATA. THE AIRBAGS DID NOT DEPLOY ON EITHER DRIVERS OR PASSENGER SIDE. DEER GOT AIRBORNE AS MY VEHICLE WAS STILL IN MOTION. THE DEER WENT OVER THE FRONT PASSENGER SIDE OF WINDOW.  THOUGHT HER HOOF WAS COMING THROUGH THE WINDSHIELD. FELT IT UNSAFE THAT THE AIRBAGS DID NOT DEPLOY. I TOOK IT IN TO BODY SHOP AND THE ESTIMATED $2,000 TURNED INTO OVER $6,000 BECAUSE THE FINS ON THE RADIATOR WERE BENT. THOUGHT THE SENSORS SHOULD HAVE DETECTED THE SPEED AND FORCE OF IMPACT BUT PERHAPS THE INERTIA AND MOVEMENT OF MY VEHICLE NOT STOPPING IMMEDIATELY AND ATTEMPTED BRAKING DID NOT WARRANT A \"SEVERE\" IMPACT?!",
        "vin": "1C4RJFAG7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090341,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT THE GEAR SHIFTER COULD NOT BE MOVED OUT OF THE PARK POSITION. THE CONTACT ENGAGED THE GEAR SHIFTER WITH FORCE INTO PARK AND THE VEHICLE JOLTED AGGRESSIVELY. AS A RESULT, THE VEHICLE DROVE OVER A LARGE ROCK THAT CAUSED DAMAGE TO THE UNDERCARRIAGE. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER WHERE IT WAS DIAGNOSED THAT THE DRIVE TRAIN NEEDED TO BE REPLACED. THE DEALER REPLACED THE DRIVE TRAIN, BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "1C4RJEAG3HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2018",
        "dateOfIncident": "04/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089275,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WAITING FOR MY WIFE AT THE TRAIN STATION AND PLAYING WITH THE QUATRA SUSPENSION BUTTONS TO THE RIGHT OF THE SHIFT. I KEPT PLAYING, PUSHING TO SEE WHAT LIGHTS GO ON.  AND WHEN I SAW HER I PLACED THE CAR IN DRIVE AND IT TOOK OFF LIKE A SHOT ACCELERATING UNTIL I WAS ABLE TO HIT THE BRAKE HARD AND THREW IT INTO NETURAL. THIS HAS NEVER HAPPENED BEFORE. I NEVER TOUCHED THE GAS PETAL OR ACCIDENTALLY TOUCHED ANYTHING ELSE.IT WAS SO FRIGHTENING.WHAT WAS SO FRIGHTENING WAS THE INTENSITY OF THE ACCELERATION. IF ANYONE WAS IN FRONT OF ME THEY WOULD HAVE BEEN KILLED",
        "vin": "41"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089182,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WAITING FOR MY WIFE AT THE TRAIN STATION AND WHEN I SAW HER I PLACED THE CAR IN DRIVE AND IT TOOK OFF LIKE A SHOT ACCELERATING UNTIL I WAS ABLE TO HIT THE BRAKE HARD AND THREW IT INTO NETURAL. THIS HAS NEVER HAPPENED BEFORE. I NEVER TOUCHED THE GAS PETAL OR ACCIDENTALLY TOUCHED ANYTHING ELSE.IT WAS SO FRIGHTENING.WHAT WAS SO FRIGHTENING WAS THE INTENSITY OF THE ACCELERATION. IF ANYONE WAS IN FRONT OF ME THEY WOULD HAVE BEEN KILLED",
        "vin": "1C4RJFJG8HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,TIRES,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "05/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079308,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP GRAND CHEROKEE. CONSUMER WRITES IN REGARDS TO PROBLEMS WITH THE IGNITION, ANALOG SPEEDOMETER AND TIRE PRESSURE. *LD    THE CONSUMER STATED SHE WAS INVOLVED IN A CAR ACCIDENT IN WHICH THE BRAKES FAILED. *TR",
        "vin": "1C4RJEBG5HC"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "03/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080069,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS STOP/START SYSTEM SO WHEN I PUT MY BRAKES ON TO STOP THE VEHICLE IT CUTS OFF THE ENGINE AND WHEN I TAKE MY FOOT OFF THE BRAKE IT AUTOMATICALLY RESTARTS THE ENGINE. VERY RECENTLY WHEN I HAD STOPPED AT A TRAFFIC RED LIGHT, AND A TRAFFIC JAM, ENGINE SHUT DOWN WITH BRAKING AND DID NOT RESTART. I COULD NOT RESTART THE CAR EITHER, AND THE GEAR WAS LOCKED ON PARK. COULD NOT PUT THE CAR ON NEUTRAL GEAR TO MOVE IT OUT OF MAIN ROAD. THERE WERE ABOUT 10 CARS BEHIND ME. VERY SCARY AND DANGEROUS SITUATION. IT FINALLY RESTARTED AFTER SEVERAL TRIALS, MAY BE 10 OR 12 TRIALS WHILE I WAS WAITING TOR THE TOW TRUCK TO ARRIVE. I WAS ALSO WORRIED THAT THE CAR COULD NOT BE TOWED WITHOUT PUTTING IT IN TO NEUTRAL GEAR. THIS HAPPENED ON FOUR DIFFERENT TIMES. I TOOK IT TO A DEALER SERVICE CENTER THREE DIFFERENT TIMES FOR THIS SAME PROBLEM. THEY FIRST CHANGED AUXILIARY BATTERY AND TOLD ME TO DRIVE THE CAR. THE VERY NEXT DAY CAR STARTED STOPPING AGAIN. THEY THEN CHANGED THE 2ND (MAIN) BATTERY. PROBLEM REMAINED. THEN FINALLY THEY FOUND THAT ONE OF THE BATTERY WIRES WAS NOT SECURELY CONNECTED TO THE STARTER VIA A CONNECTOR. THEY HAVE PUT A NEW CONNECTOR. IT IS A SCARY SITUATION, AND CAN LEAD TO LOSS OF LIFE ON ROAD. IF IT KNOCKS OFF THE ENGINE BEHIND A TRAFFIC JAM AND DOES NOT START BACK IT MAY LEAD TO SERIOUS ACCIDENT AND EVEN DEATH. IT IS ONLY 6 MONTH OLD BRAND NEW CAR AND I DID NOT EXPECT THIS PROBLEM. IT CAN NOT BE EASILY PUT IN NEUTRAL GEAR IF ENGINE CAN NOT BE STARTED WHICH IS A MAJOR TRAFFIC HAZARD. THIS NEEDS TO BE THOROUGHLY INVESTIGATED AND RECALLED. THEY HAVE PROVIDED AN OPTION TO OVERRIDE PARK GEAR IN TO NEUTRAL BUT IT IS NOT VERY EASY FOR A PERSON TO LOCATE AND FIND THE OVERRIDE OPTION. I THINK THIS PROBLEM IS A MAJOR TRAFFIC SAFETY HAZARD. I REQUEST YOU TO KINDLY INVESTIGATE THIS PROBLEM WITH JEEP GRAND CHEROKEE. THANK YOU VERY MUCH.",
        "vin": "1C4RJFJG9HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "03/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079543,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE DAY I PURCHASED THE CAR, THE CAR DOES NOT EASILY ACCEPT FUEL.  IT CUTS ME OFF.  IT CAN TAKE 30 MINUTES TO FILL THE TANK, AN OUNCE AT A TIME.",
        "vin": "1C4RJFBGXHC"
    },
    {
        "components": "SUSPENSION,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079465,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT MY 2017 JEEP GRAND CHEROKEE TRAILHAWK USED WITH 10,600 MILES ON IT.      GAS ISSUES FROM THE GET GO:  WHEN GETTING GAS, THE GAS PUMP SHUTS OFF EVER FEW SECONDS LIKE THE GAS TANK IS FULL ONLY ALLOWING A FEW CENTS WORTH OF GAS TO ACTUALLY GO IN THE VEHICLE.  I HAVE BEEN TO MULTIPLE GAS STATIONS AND THE SAME ISSUE OCCURS AT ALL OF THEM, TRIED TURNING THE NOZZLE TO DIFFERENT ANGLES AND ALMOST HOLDING IT ALL THE WAY OUT OF AND IN THE TANK, IT DOES NOT MATTER THOUGH.    AIR SUSPENSION:  AFTER OWNING THE JEEP FOR 3 MONTHS, ONE MONDAY MORNING WHEN I TURNED IT ON TO GO TO WORK A MESSAGE POPPED UP SAYING \"SERVICE AIR SUSPENSION SYSTEM IMMEDIATELY\", MILEAGE WAS AT 14,990.  I TURNED THE VEHICLE OFF AND ONE TWO MORE TIMES BEFORE DRIVING IT, DROVE TO WORK AND RESTARTED IT AFTER I PARKED, EACH TIME THE SAME MESSAGE CAME ON IMMEDIATELY.  I CALLED THE CLOSEST JEEP DEALERSHIP, THEY SAID IT WAS OK TO DRIVE AND COULD NOT SEE THE JEEP UNTIL THE FOLLOWING MONDAY.  DROPPED THE JEEP OFF, THEIR SYSTEM SAID THE MODULE WAS BAD, THEY REPLACED IT, THIS DID NOT WORK.  THEY CONTACTED CHRYSLER, NO FIX HAS OCCURED, MULTIPLE ATTEMPTS BUT NOTHING HAS WORKED.  3.5 WEEKS AND STILL COUNTING WITHOUT MY JEEP.  THE JEEP GARAGE SAID THEY DO NOT KNOW HOW MUCH LONGER BC THEY DO NOT KNOW THE SOLUTION AND ARE WAITING ON JEEP ENGINEERS TO TELL THEM WHAT TO TRY NEXT.  SOUNDS LIKE THE ENGINEERS ARE JUST TRYING EXPERIMENTS TO SEE WHAT WILL WORK.    WHEN WAITING ON THE MODULE TO COME IN THE FIRST WEEK I ASKED IF I COULD DRIVE IT UNTIL THE PIECE CAME AND WAS TOLD IT WAS NOT SAFE TO DRIVE.  VERY UNPLEASED.",
        "vin": "1C4RJFLG3HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076730,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS 3500 MILE ON IT. MY CAR WAS STATIONARY HOWEVER IT WAS IN GEAR, I WAS AT A STOP LIGHT, AND HAD TAKEN MY FOOT OFF THE BRAKE AND PUT MY FOOT ON THE GAS PEDAL WHEN THE LIGHT CHANGED TO GREEN. IT LURCHED AND THEN ALL OF A SUDDEN CAME UP WITH A MESSAGE SAYING \"PLACE CAR IN PARK THEN SELECT GEAR\" WHILE LIGHTS WERE FLASHING AT THE GEAR SHIFTER AT THE D WHERE IT WAS AT AND ON THE DASHBOARD INDICATOR WHERE INDICATING THAT MY CAR WAS IN \"DRIVE\"   I HAD TO PUT THE CAR IN PARK IN THE MIDDLE OF THE ROAD WITH A GREEN LIGHT AND THEN PUT IT BACK INTO DRIVE AND LUCKILY IT DID ENGAGE.   I HAVE READ THAT OTHER PEOPLE HAVE HAD THIS HAPPEN TO THEM WHILE MOVING AND ON THE FREEWAY, WHICH SCARES ME BECAUSE I WAS ABOUT A MILE FROM GETTING ONTO THE FREEWAY MYSELF. THE CAR WOULD NOT LET ME DO ANYTHING UNTIL I PUT IT INTO DRIVE, SO IF THIS HAD HAPPENED WHILE GOING 65 MILES AN HOUR IT COULD HAVE BEEN VERY HAZARDOUS.",
        "vin": "1C4RJFAG1HC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075612,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE STEERING WHEEL LOCKS AND CAN NOT BE TURNED. THIS HAS HAPPENED A DOZEN TIMES AND EACH TIME WE WERE ONLY NARROWLY ABLE TO AVOID AN ACCIDENT. THIS HAS HAPPENED WHILE DRIVING IN A PARKING GARAGE, ONE SIDE ROADS, MAIN ROADS AND ON THE HIGHWAY. I BELIEVE THIS HAS SOMETHING TO DO WITH THE LANE DEPARTURE SENSOR. THE CAR HAS APPROXIMATELY 14K MILES ON IT AND IT HAS BEEN RETURNED TO THE DEALER FOR REPAIR 5 TIMES. THE DEALER HAS BEEN UNABLE TO RESOLVE THE ISSUE. THERE ARE PAGES OF ERROR CODES THAT HAVE BEEN GENERATED BUT NONE HAVE BEEN HELPFUL IN RESOLVING THE ISSUE. THE VEHICLE IS UNSAFE TO DRIVE.",
        "vin": "1C4RJFCT2HC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "01/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065561,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING THE SUV IN CRUISE CONTROL, IT WAS NECESSARY TO BRAKE AND RE-ACCELERATE WHILE DRIVING ON THE INTERSTATE. HOWEVER, UPON  PUSHING THE PEDAL TO INCREASE SPEED, IT TOOK BETWEEN 10 TO 20 SECONDS TO INCREASE THE SPEED FROM JUST 60 MPH TO 70 MPH. THIS HAPPENED REPEATEDLY OVER A PERIOD OF 30 MILES. IT WAS VERY CONCERNING AS I WAS NOT ABLE TO CLEAR TRAFFIC PROPERLY. I STOPPED AT A REST STOP AND TRIED TO DO THE SAME ACCELERATION FROM 0 MPG.  THIS TIME HOWEVER, THE CAR 'HUNG' AT 5500 RPM'S WHEN I REACHED 75 MPH. I HAD TO MOVE THE GEARSHIFT INTO MANUAL MODE AND BACK TO AND UNHANG IT. I REPORTED THIS TO NATIONAL RENT-A-CAR UPON MY RETURN. I WANT TO MAKE SURE THIS IS REPORTED.  I FELT UNSAFE.",
        "vin": "1C4RJFBG9HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063170,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING IN DRIVE AT VARIOUS SPEEDS, THE TRANSMISSION SPONTANEOUSLY GOES INTO NEUTRAL, BUT THE GEAR SHIFTER REMAINS IN DRIVE. THE GEAR SHIFTER HAS TO BE MOVED TO NEUTRAL AND THEN BACK INTO DRIVE TO RE-ENGAGE THE TRANSMISSION. THIS HAS HAPPENED FOUR TIMES IN THE ONE YEAR SINCE I BEGAN LEASING THE VEHICLE, THE FIRST TIME ON JULY 4, 2017. THE VEHICLE HAD ABOUT 2,500 MILES ON IT.",
        "vin": "1C4RJFAG1HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "01/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060727,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS 4000 MILES, STALLED OUT WHILE I WAS DRIVING. STARTED RIGHT UP, MULTIPLE CODES STORED.",
        "vin": "1GNKVHKDXGJ"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/23/2017",
        "dateOfIncident": "12/22/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056190,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONARY, TRANSMISSION WAS PLACED IN PARK AND POWER WAS COMPLETELY OFF WHEN IT BEGAN ROLLING DOWNHILL WHILE UNATTENDED. EMERGENCY BRAKE WAS NOT SET. VEHICLE WAS PARKED ON A SLIGHT INCLINE.",
        "vin": "1C4RJFCT4HC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055533,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH LESS THAN 2,000 MILES, TIRE PRESSURE SENSORS CONFLICT WITH PSI MANUAL PRESSURE GAUGE.  THE SERVICE DEPARTMENT HAS INFLATED THE TIRES TO 36 PSI WHICH DOES NOT REGISTER AS SUCH, BUT LOWER BY 2-3 PSI.  THE PRESSURE GAUGE SENSORS IS INCORRECT UNDER ALL DRIVINGS MODES. IT REMAINS UNRESOLVED.",
        "vin": "1C4RJFBG1HC"
    },
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": true,
        "dateComplaintFiled": "12/15/2017",
        "dateOfIncident": "03/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11054974,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE CAR FOR ABOUT 35 DAYS. I WAS DRIVING HOME FROM WORK ON A SIDE STREET AND MY BRAKES FAILED. I APPLIED THE BRAKES AS I WAS COMING UPON A 3 WAY STOP SIGN. MY BREAKS JAMMED,AND FAILED TO STOP. I HIT ANOTHER CAR AND WE BOTH WALKED AWAY WITH MINOR INJURIES. MY JEEP WAS TOTALED.  ALL AIRBAGS DEPLOYED AND I HAD ALL FRONT END DAMAGE. I FEEL THEIR IS EITHER A PROBLEM WITH THE BREAK MODULATOR, OR THE AUTO STOP FEATURE WHEN YOU APPLY YOUR BREAKS TO STOP. I WAS ALMOST KILLED. I WILL NEVER BUY ANOTHER CAR WITH THIS AUTO FEATURE AGAIN. OF COURSE NOTHING WAS FOUND.",
        "vin": "1C4RJFAG5HC"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/14/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054664,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I SPECIFICALLY PURCHASED A 2017 JEEP GRAND CHEROKEE 4X4 TO COPE WITH WINTERS IN DETROIT, MICHIGAN. HOWEVER, AFTER ONLY TWO SNOWFALLS THE VEHICLE HAS SLID FOUR TIMES ON CITY STREETS AND MORE SIGNIFICANTLY FISH TAILED ON AN I-75 OFF RAMP. IN NO INSTANCES DID THE 4X4 SYSTEM TRY TO CORRECT THROUGH OR NOTIFY THE OPERATOR. IN ONE INSTANCE THE ABS WAS ABLE TO SAFELY BRING ME TO A STOP OVER THE LINE AT A FOUR WAY STOP INTERSECTION. THIS IS BEHAVIOR IS UNSAFE FOR EVERYDAY EXPECTED DRIVING SCENARIOS. MORE SHOULD BE EXPECTED OF A MODEL YEAR 2017 4X4 VEHICLE SOLD IN MICHIGAN. UNSAFE. I NOW NEED TO SPEND $900-$1000 TO REMEDIATE THE SITUATION BY BUYING BETTER TIRES THAN THOSE PROVIDED BY THE OEM.",
        "vin": "1C4RJFBG8HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2017",
        "dateOfIncident": "11/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048506,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING REOCCURRING ISSUE WITH FILLING MY TANK UP WITH GAS. I'VE TRIED ON SEVERAL DIFFERENT PUMPS BUT IT WILL NOT PUMP AND SPILLS OUT EVEN THOUGH I'VE JUST STARTED AND MY TANK IS ONLY ABOUT A QUARTER FILLED. NOT SURE HOW TO FIX IT AS I HAVE TO SPENT 20 MINUTES AT A TIME TO FILL THE TANK. EVERY $0.20 THE PUMP STOPS. NOT SURE IF THE ISSUE IS THE SAME AS THE RENAGADE OR NOT BUT THERE IS AN ISSUE WITH THE GAS CAP SENSOR.",
        "vin": "1C4RJFAGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2017",
        "dateOfIncident": "09/04/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044382,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A BRAND NEW 2017 JEEP GRAND CHEROKEE ALTITUDE 4X4. FROM ROUTE 1 JEEP IN LAWRENCEVILLE.  IMMEDIATELY EXPERIENCED TICKING FROM THE ENGINE, FAULTY COMPUTER EQUIPMENT, AND FAULTY FUEL PROPOSITION. THE SOUND WAS DUPLICATED AND I WAS TOLD SERVICE WOULD NEED MY CAR INDEFINELTY UNTIL THE DIAGNOSIS WAS INDENTIFIEF AND A REPAIR WAS DETERMINED. ALSO EXPERIENCE PRE-MATURE STOPPING AT FUEL PUMPS. MEANING THE PUMP WILL SHUT OFF AS IF THE TANK IS FILLED WHEN IT'S NOT, HAVING TO MANIPULATE THE GAS PUMP NOZZLE UNTIL IT ALLOWS ME TO FILL. ALSO EXPERIENCE INTERNITANT ISSUES WITH THE SPEEDO AND ITS DISPLAY. SOME TIMES THE DISPLAY DOESN'T WORK AT ALL. KEEP CUSTOMER SERVICE HAS BEEN NOTHING BUT AN OBSTACLE TO GETTING THIS RESOLVED. AND EVERY DEALER WE GO TO IS \"OVERWHELMED AND UNDERSTAFFED\" BY THEIR OWN ADMISSION. LITERALLY 5 DIFFERENT DEALERSHIPS IN A 50 MILE RADIUS GAVE US THE SAME FEEDBACK. I'M AM BEYOND FRUSTRATED , HURT , AND DISGUSTED AFTER SPENDING 40K+ ON MY 1ST BRAND NEW SUV. WAS HOPEFUL AND WANTED TO PURCHASE AMERICAN , BUT ARE WE REALLY BUYING AMERICAN WHEN THE PARTS AND CAR ITSELF ARE BEING MANUFACTURED IN MEXICO??",
        "vin": "1C4RJFAG3HC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043895,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS FUELING UP TODAY AND THE PUMP  WAS TURNING OFF LIKE I WAS TOPPED OFF BUT MY GAGE WAS ON 'E'. THEN WITH ME HOLDING THE PUMP GAS STARTED SHOOTING OUT ONTO ME AND MY SUV. I HAD GAS ALL OVER THE SIDE OF MY CAR AND AFTER I PAID I HAD A LARGE PUDDLE UNDER MY CAR ALSO. I ONLY FILL UP AT MEIJER AND NORMALLY GET 22 GALLONS IN MY TANK. I WAS ONLY ABLE TO GET 11 GALLONS IN. MY SUV ONLY HAS 4600 MILES ON IT. SOMETHING IS WRONG HERE",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031352,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MOST NEWER CARDS THE DASHBOARD IS DIGITAL AND BACK-LIT.  SOME OF THESE CARS ALSO HAVE VERY BRIGHT DAYTIME RUNNING LIGHTS.  WHAT I HAVE SEEN IS THAT SOME OWNERS INADVERTENTLY TURN OFF THE AUTO LIGHTS, AND THINK THEY HAVE LIGHTS ON BECAUSE THEY CAN SEE WHERE THEY ARE GOING, BUT THEY LACK ANY REAR LIGHTS BECAUSE THE LIGHTS ARE NOT TECHNICALLY ON.  I'VE SEEN THIS IN JEEP VEHICLES AS AN EXAMPLE.    THE ONLY WAY TO KNOW YOUR LIGHTS ARE ON IN A JEEP FOR EXAMPLE IS A LITTLE GREEN HEADLIGHT ICON, THAT IS EASILY IGNORED.  SOMETHING MORE NEEDS TO BE ON THE DASH WHEN LIGHTS ARE IN THE OFF POSITION AT NIGHT.",
        "vin": "UNKNOWN"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030458,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WOULD NOT BACK UP WITH MY BOAT ATTACHED, HAS A REAR STOP FEATURE THAT WAS ENGAGING, WENT TO MY SYSTEM SETUP SCREEN TO DEFEAT THE FEATURE, IT WOULD NOT LET ME, I WOULD REMOVE THE CHECK AND IT WOULD COME RIGHT BACK ON. THE DEALER KNEW THERE WAS A REFLASH FOR THIS CONDITION, BUT IT WAS A YELLOW ARROW, SO THEY WERE NOT ALLOWED TO FIX IT UNLESS I COMPLAINED ABOUT THAT PARTICULAR SYSTEM, HE SAID FCA HAD RECENTLY SAID NO MORE REFLASHS THAT WERE NOT A RED BOLT UNLESS CUSTOMER COMPLAINED ABOUT A COMPONENT ISSUE THE REFLASH COULD FIX.  THIS DEALER TOM WHITESIDE (740-869-2296) SAID THERE WERE MORE REFLASHS, BUT COULD NOT DO. SAID THEY ENCOURAGE THEM TO DO ALL IN THE PAST, EVEN PROMOTED IT AS A WAY TO SELL HIM A HAND HELD COMPUTER. DO I SUE CHRYSLER OR THE DEALER WHEN THEY BOTH KNOW AND WON'T BE PRE-EMPTIVE? I WOULD NOT KNOW THIS DIDN'T WORK TILL I NEEDED IT TO WORK.",
        "vin": "1C4RJFBG4HC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024603,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED A POOL OF GREEN LIQUID UNDERNEATH THE VEHICLE. THE VEHICLE WAS TAKEN TO ROUTE 1 CHRYSLER DODGE JEEP DEALER (2700 BRUNSWICK PIKE, LAWRENCE TOWNSHIP, NJ 08648, PHONE NUMBER: (609) 882-1000) WHERE IT WAS DIAGNOSED THAT THE OIL LEAK WAS CAUSED BY DEBRIS IN THE ENGINE BLOCK. THE DEALER STOPPED THE LEAK AND CONTACTED THE MANUFACTURER WHO STATED THAT THE ENGINE NEEDED TO REPLACED. THE MANUFACTURER DECLINED THE REPLACEMENT OF THE NEW ENGINE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 2,867.",
        "vin": "1C4RJFAGXHC"
    },
    {
        "components": "STRUCTURE,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2017",
        "dateOfIncident": "08/25/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021358,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE SOLD A RUSTED BRAND NEW CAR BY HUFFINES JEEP DEALERSHIP IN LEWISVILLE, TX. WE IDENTIFIED THE RUST IN THE CAR WITHIN 3 WEEKS ( AND LESS THAN 700 MILES)  AND TOOK IT BACK TO THE DEALERSHIP AND THEY DENIED HELPING US OUT AND REFUSED TO REPLACE THE CAR FOR US AND THE ONLY OPTION THEY PROVIDED US WAS \" WE WILL FIX THE CAR AND YOU TAKE IT BACK\" . WE HAVE ESCALATED THE CASE TO \"FCA NORTH AMERICA\" AND THEY ARE CURRENTLY INVESTIGATING THE CASE . HOWEVER WE ARE AFRAID THAT SINCE THE DEALERSHIPS HAVE A RAPO ESTABLISHED WITH THE COMPANY THEY MIGHT OVERLOOK THIS CASE AND SINCE WE ARE ONE CUSTOMER VS THE DEALERSHIP THERE ARE MORE CHANCES THAT WE MIGHT HAVE TO SUFFER AND TAKE THE CONTINUOUS THREATS FROM THE DEALERSHIP. WE WOULD LIKE TO APPROACH NHTSA TO PROVIDE US A RECOMMENDATION ON THIS AND HELP US RECEIVE JUSTICE ON THIS CASE . OUR CASE NUMBER WITH JEEP IS [XXX] . THIS IS OUR FIRST BRAND NEW VEHICLE AND WE HAVE HAD ISSUES FROM DAY ONE ON THE VEHICLE AND WITH DEALERSHIP TREATING US IN AN EXTREMELY DISRESPECTFUL WAY AND LITERALLY THREATENING US WE DONT KNOW HOW TO PROCEED IN THIS CASE .  WE DID NOT REALIZE IT TILL OUR DAUGHTER DROPPED STUFF UNDER THE SEATS  AND CAME OUT FEW TIMES WITH RUSTED HANDS . SHE HAS BEEN TRAVELLING AND BREATHING IN THE RUSTED CAR FOR FEW DAYS AND THIS HAS BEEN A HUGE HEALTH HAZARD FOR THE KID.  WE ARE CONFUSED AT THIS POINT AND FEEL HELPLESS . DO WE JUST WAIT FOR FCA TO COME BACK TO US OR DO WE FILE A COMPLAINT IN THE LOCAL COURT AND FIGHT A CASE AGAINST THE DEALER SHIP ? PLEASE ADVISE.  [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1C4RJFBG6HC"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/26/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019825,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE MEMORY SYSTEM IS NOT WORKING AT ALL, WE BOUGHT IN 12/2016 AND SOMEWHERE IN 6/2017 IT STOPPED WORKING, IF YOU KNOW ANYTHING ABOUT CARS THE MEMORY SYSTEM CONTROLS MANY ASPECTS OF THE VEHICLE THAT DO NOT HAVE ANYTHING TO DO WITH THE SEAT, STEERING WHEEL, MIORROR'S, AND RDS, IT ALSO CONTROLS ENGINE FUNCTIONS AND SAFETY SYSTEMS, AIR BAGS, SEATBELTS, BRAKES., WHY THE VEHICLE LEARNS YOUR DRIVING HABITS AND WHEN YOU USE DIFFERENT SETTINGS FOR DIFFERENT DRIVERS, NOW IT HAS CONTROL OVER YOUR VEHICLE AND DRIVING HABITS OR ANOTHER DRIVERS HABITS. (I HAD A 15 OVERLAND THAT WOULDN'T SYNC THE REMOTES TO THE MEMORY SETTINGS AFTER MULTIPLE ATEMTS, I ALSO HAVE A 14 RAM LIMITED THAT WORKS JUST FINE.)  SO THIS IS AN ONGOING ISSUE FOR THE GRANDELAY CHEROKEE LINEUP.  PER SAY THE SYSTEM BE LIVES IT IS WORKING BUT HASN'T MOVED YOUR SEAT OR THINKS YOUR SEAT IS IN AN ALTERNATIVE POSITION AND YOU GET IN TO AN ACCIDENT, AND THE SAFETY SYSTEM OVER OR UNDER REACTS TO PROTECT ITS OCUPANTS DUE TO SYSTEM ERRORS, EQUIPMENT MALFUNCTIONING, AND VEHICLE COPONENTS NOT COMMUNICATING PROPERLY.  THIS COULD END IN A CATASTROPHE AND POTENTIALLY INJURIES, DEATH, AND DESTRUCTION OF PRIVATE PROPERTY.  SHORTLY AFTER I BOUGHT THE SUMMIT I WAS AT THE DEALERSHIP WITH MY RAM (REGARDING SURVICE),  A ELDERLY GENTLEMAN BROUGHT HIS 17 GC INTO THE SERVICE DEPTH COMPLAIN ABOUT THE MEMORY SYSTEM NOT OPERATING, I DIDN'T THINK ANYTHING ABOUT IT \"BUT THIS OLD MAN CAN'T KEEP UP WITH TECHNOLOGY AND JUST NEEDED ASSISTANCE\"  I HAVE ALSO SPOKEN TO MULTIPLE GC OWNERS AT GAS STATION'S, PARKING LOTS, AND RANDOM SHOPS AND ALMOST EVERY 2017 STARTS MALFUNCTIONING AFTER ABOUT 1 TO 6 MONTHS AND DOES NOT FIX/DEFAULT ON ITS OWN, I HAD RDS ISSUES ON MY 14 GC REMEDY HOLD BOTH VOLUME AND TUNER AT THE SAME TIME TO RESET THE SYSTEM, THIS DIDN'T HELPMY 17, I HAVE A A POINT MENTIONED TO HAVE IT LOOKED AT BY THE DEALERSHIP.",
        "vin": "1C4RJFJT9HC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016430,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED NUMEROUS INSTANCES OF THE VEHICLE REMAINING IN RUN MODE AFTER I PUSH THE STOP BUTTON TO SHUT IT DOWN.  THIS ONLY OCCURS WHEN THE ESS (ENGINE STOP/START) IS ENABLED.  MY INITIAL BELIEF WAS THAT THE ESS WAS RESTARTING THE VEHICLE.  UPON FURTHER OBSERVATION, I NOW BELIEVE THAT THE VEHICLE IS IGNORING THE STOP BUTTON INPUT.   I REALIZED THAT THIS IS A SAFETY ISSUE WHEN THE VEHICLE FAILED TO SHUT DOWN AT A GAS STATION AND I REFUELED WITH THE ENGINE RUNNING.  I FAILED TO REALIZE THAT THE VEHICLE HAD NOT SHUT DOWN DUE TO EXCESSIVE NOISE IN THE AREA.    THE VEHICLE FAILS TO SHUT DOWN UNDER THESE CONDITIONS:  1.THE VEHICLE IS RUNNING AND THE ESS IS ENABLED.  2.I PULL INTO A PARKING POSITION AND HOLD THE BRAKE LONG ENOUGH FOR THE ESS TO BEGIN THE STOP ENGINE SEQUENCE.  3.I PUSH THE SHIFTER INTO PARK AS THE ESS IS IN THE STOP ENGINE SEQUENCE.  4.I IMMEDIATELY DEPRESS AND HOLD THE STOP BUTTON.  5.THE VEHICLE FAILS TO SHUT DOWN.  THE VEHICLE WILL NOT SHUT DOWN UNTIL THE STOP BUTTON IS RELEASED AND PUSHED A SECOND.  I ESTIMATE THAT THIS HAPPENS TO ME APPROXIMATELY 20% OF THE TIME I ATTEMPT TO SHUT DOWN THE VEHICLE WITH THE ESS ENABLED. THIS NEVER HAPPENS WHEN THE ESS IS DISABLED.  I HAVE TAKEN MY GRAND CHEROKEE TO THE DEALER AND A STAR CASE WAS CREATED AT FCA.  THIS FAILURE TO SHUT DOWN WAS DEMONSTRATED TO THE MECHANIC ON MY VEHICLE AND ON ANOTHER GRAND CHEROKEE FROM THEIR LOT.   FCA ACKNOWLEDGED THAT THE FAILURE TO SHUT DOWN SITUATION DOES OCCUR AS I DESCRIBED.  HOWEVER, FCA HAS NOT INDICATED THEY ARE TAKING ANY STEPS TO CORRECT THE PROBLEM.   FCA SEEMS TO BE INDICATING TO ME THAT THE SOLUTION TO THE PROBLEM IS THAT I NEED TO BE MORE CAREFUL.  I DO NOT FIND THIS TO BE AN ACCEPTABLE ANSWER. I BELIEVE THAT THE ESS UNDER ENGINEERED, UNDER DEVELOPED AND LACKS THE SOPHISTICATION NEEDED TO BE SAFELY USED.",
        "vin": "1C4RJFAGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "08/08/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014274,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER  READS 70 MPH WHEN I AM GOING 25 AND IT WILL READ 80MPH WHEN I AM DOING 40. HAS ANY ONE BESIDE MY SELF HAD THIS PROBLEM??",
        "vin": "1C4RJFBG7HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "07/13/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011093,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CAUTION LIGHT CAME ON WHILE DRIVING ON THE INTERSTATE 5, CALLED DEALERSHIP FOR GUIDANCE I WAS INFORMED THAT AS LONG AS THE ENGINE WARNING LIGHT DOES NOT BLINK IT WILL BE OKAY TO DRIVE.  I SCHEDULED AN APPOINTMENT FOR A WEEK LATER. WITHIN THE WEEK THE CAR WOULD NOT STAY IN REVERSE AND LATER IT KEPT ON POPPING OUT OF REVERSE.  I ALSO NOTICE THAT THE GEAR WAS NOT CHANGING PROPERLY AND SEEMS TO STRAIN TO DRIVE.  I TOOK THE VEHICLE IN FOR A LOOK AT AND INFORMED THE SERVICE SUPERVISOR OF THE REVERSE CONDITION AND THAT THE \"R\" IN THE SHIFTER KEPT ON BLINKING.",
        "vin": "1C4RJFBT7HC"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/26/2017",
        "dateOfIncident": "07/25/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010848,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW JEEP GRAND CHEROKEE WITH LESS THAN 500 MILES, ON A CLEAR DAY WHILE DRIVING APPROXIMATELY 50 MILES PER HOUR, THE FRONT PORTION OF PANORAMIC SUNROOF SPONTANEOUSLY SHATTERED. SOUNDED LIKE A GUNSHOT. TO ADD INSULT TO INJURY, CAR MANUFACTURER CLAIMS THEY ARE NOT LIABLE UNDER WARRANTY BECAUSE I CANNOT PROVE THE GLASS AND/OR DESIGN WERE DEFECTIVE. THE MANUFACTURERS NEED TO STOP MAKING PANORAMIC ROOFS OR ELSE COVER THEM UNDER THE WARRANTY.",
        "vin": "1C4RJFCGXHC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2017",
        "dateOfIncident": "07/16/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010147,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING APPROXIMATELY 15 MILES TO WORK I NOTICED A WHIRRING SOUND LIKE A BEARING GOING BAD IN THE WATER PUMP, ALTERNATOR, ETC.  JUST BEFORE I ARRIVED THE \"CHECK BATTERY\" LIGHT CAME ON. AFTER MY SHIFT, THE VEHICLE STARTED WITH NO PROBLEM, THE SOUND WAS GONE AND THE \"CHECK BATTERY\" LIGHT DID NOT COME ON. AFTER DRIVING APPROXIMATELY 2 MILES, THE WHIRRING SOUND STARTED AGAIN AND I SMELLED SMOKE. I IMMEDIATELY PULLED TO THE SIDE OF THE ROAD. WHEN I OPENED THE HOOD, SMOKE AND FLAMES WERE COMING OUT OF THE ALTERNATOR (I HAVE VIDEO OF THE SMOKE IN MOV FORMAT WHICH THIS SITE DOESN'T ALLOW). THE FIRE BURNED ITSELF OUT. HOWEVER, THE VEHICLE'S ELECTRONIC SYSTEM WAS DEAD - NO LIGHTS, WINDOW, RADIO, ETC. THIS ISSUE HAS THE EXACT SAME CHARACTERISTICS AS MOPAR'S RECALL P60 CAMPAIGN # 14V634000 ELECTRICAL / ALTERNATOR / GENERATOR - ALTERNATOR MAY FAIL WITHOUT WARNING. HOWEVER, THIS VEHICLE HAS A 180 AMP ALTERNATOR RATHER THAN A 160 AMP. THIS IS EXTREMELY DANGEROUS, ESPECIALLY IN THE DC - NORTHERN VIRGINIA AREA, AS YOU HAVE MINIMAL TIME TO RESPOND TO SOMETHING THAT CAUSES THE VEHICLE TO IGNITE AND SHUTS DOWN ALL OF THE ELECTRICAL SYSTEMS.",
        "vin": "1C4RJFBG4DC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002488,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION DOWNSHIFTS TOO HARD. EVERY TIME THEY FIX THE PROBLEM AND RETURN THE JEEP BACK TO ME, IT HAPPENS AT A DIFFERENT MPH. IT HAS BEEN AROUND 25 MPH, THEN AT 5 MPH AND NOW CURRENTLY AT 30 MPH. THE MOST RECENT TIME THEY ATTEMPTED TO FIX IT (THE 4TH TIME) THEY REPLACED A VALVE BODY, AND IT MADE THE PROBLEM WORSE, SO THEY ARE ORDERING ME A TRANSMISSION, WHICH THEY SAY ARE ON BACK ORDER, AND DO NOT HAVE AN ETA FOR ME. SINCE JUNE 5TH MY VEHICLE HAS BEEN IN THE SHOP FOR 12 DAYS AND COUNTING SINCE I CALLED AGAIN TODAY AND THEY STILL HAVE NO CLUE WHEN THEY CAN GET A NEW TRANSMISSION.",
        "vin": "1C4RJFLT5HC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2017",
        "dateOfIncident": "06/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995144,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 GRAND CHEROKEE SUMMIT HAS A \"GREMLIN\" IN THAT THE POWER PASSENGER REAR WINDOW, AND POWER LIFTGATE WILL OPEN ON THEIR OWN AND ONE DOESN'T KNOW WHEN IT WILL HAPPEN, AND THIS HAS HAPPENED MORE THAN ONCE WITH REAR WINDOW.  ALSO, LANE ASSIST IS NOW MALFUNCTIONING.  DEALER CAN NOT VERIFY PROBLEMS EVEN WITH ASSISTANCE FROM JEEP ENGINEERING,",
        "vin": "1C4RJFJGOHC"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2017",
        "dateOfIncident": "05/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990771,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DOESN'T SHIFT GEARS PROPERLY WHEN MOVING.   IT MOSTLY HAPPENS ON A REGULAR STREETS IN DAY-TO-DAY DRIVING I'VE NOT NOTICED IT AT HIGHER SPEEDS. THE RPMS GO UP REALLY REALLY HIGH AND YESTERDAY WHEN I WAS GETTING ONTO A SMALLER HIGHWAY FROM A MAIN HIGHWAY IT'S SLID INTO ALMOST A NEUTRAL STATE,  IT DIDN'T STALL BUT DIDN'T ACCELERATE EITHER ON THE TURN COMING OFF LIGHT .   THIS IS HAPPENS FREQUENTLY SINCE I GOT THE CAR IN FEBRUARY AND I BROUGHT IT TO THE DEALER A FEW WEEKS AGO  AND THEY SAID THEY UPDATED SOME KIND OF SOFTWARE.   IT HASN'T HELPED -THE ONLY WAY I GET TO ENGAGE THE TRANSMISSION PROPERLY IS IF I MOVE STICK INTO MANUAL AND DROP IT INTO THE + THEN GO BACK TO AUTOMATIC  BUT THAT'S NOT REALLY AN APPROPRIATE ANSWER AND I WORRY ABOUT MY TEENAGERS USING THE CAR.   I CAN'T STAND THE FUEL SAVING ON OFF SWITCH BECAUSE IT'S NOT RESPONSIVE ENOUGH AND I WONDER IF THAT'S PART OF IT, MAYBE THIS FUEL LIMITING PROVISION  IS NOT FUNCTIONING PROPERLY AND FUEL ISN'T PROVIDED FAST ENOUGH TO HANDLE THE ACCELERATION SO THE CAR JUST KIND OF RUNS OUT OF GAS MID TASK.   I'M PROVIDING THE RECEIPT FROM A LOCAL DEALER BUT THIS IS NOT THE DEALER I BOUGHT THE CAR FROM, THEY WEREN'T  HELPFUL AS I THEY CAN BE.",
        "vin": "1C4RJFAG4HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "04/08/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10978964,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JEEP WAS ON A BLUFF IN PARK BUT RUNNING! I GOT OUT TO TAKE PICTURES I WALKED ABOUT 15 FEET IN FRONT OF MY CAR! SUDDENLY I HEARD A NOISE AND MY JEEP WAS ROLLING RIGHT TOWARDS ME! I HAD TO LEAP OUT OF THE WAY OR IT WOULD HAVE RUN ME DOWN! LUCKILY A BOULDER STOPPED IT FROM GOING OVER THE BLUFF! I HAD TO LEAP OUT OF THE WAY AND SUFFERED INJURIES TO MY WRIST, BACK, HIP, AND LEG! WHEN I GOT UP MY TWO FRONT TIRES WERE ABOUT 3 INCHES OFF OF THE GROUND! I GOT IN AND PUT IT IN LOW 4 WHEEL DRIVE! IT DIDN'T COME OFF OF THE ROCK! I TRIED AGAIN AND PUT IT ALSO IN SNOW MODE AND WAS ABLE TO GET IT OFF! I HAVE NEVER BEEN SO TERRIFIED IN MY LIFE! BEING IN THE BOUNDARY WATERS THER WAS NO CELL PHONE SERVICE AND HAD TO THINK FAST! I LOVE MY JEEP AND HAVE DRIVEN THEM FOR YEARS BUT WOULD HATE TO HAVE THIS HAPPEN TO ANYONE ELSE! MY JEEP NOW HAS A BAD BUMPER AND GRILL! I HAVEN'T HAD TO MAKE A CLAIM TO MY INSURANCE FOR MANY YEARS! JEEP NEEDS TO FIX THIS PROBLEM BEFORE PEOPLE ARE KILLED LIKE BEFORE! I WOULD LOVE A REPLY ON WHAT JEEP WILL DO! IT'S HARD TO TRUST MY CAR NOW! I WENT THE NEXT DAY WITH A FRIEND  AND TOOK PICTURES OF HOW FAR THE ROCK WAS MOVED WHICH WAS OVER A YARD! IT WAS A VERY TERRIFYING EXPERIENCE!",
        "vin": "1C4RJFBGXHC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "02/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972309,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP GRAND CHEROKEE. THE CONTACT STATED THAT THE GEAR SHIFTER DROPPED FROM DRIVE INTO NEUTRAL INDEPENDENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE DIAGNOSTIC RESULTS WERE UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 843.",
        "vin": "1C4RJFAGXHC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2017",
        "dateOfIncident": "03/23/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968288,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TRANSMISSION DIES ON LEFT TURNS IN TRAFFIC.OCCURRS IN  TRAFFIC.  ON STREETS , AND HIGHWAYS.TAKATA INFLATORS",
        "vin": "1CAPJMBS5HW"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/06/2017",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958797,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "18 DAYS AFTER PURCHASING MY GRAND CHEROKEE THE CAR SUDDENLY FELT LIKE IT WAS DRAGGING SOMETHING AND HAVING A DIFFICULT TIME MOVING.  IT FELT LIKE THE EMERGENCY BRAKE WAS ON, BUT THE WAS NOT LIGHT INDICATOR.    WHEN WE PULLED OVER THE WHEELS WERE RED HOT AND WHEN WE DROPPED WATER ON IT TO SEE HOW HOT IT WAS THE WATER SIZZLED. WE ENGAGED AND THEN DISENGAGED THE PARKING BRAKE JUST TO MAKE SURE IT WASN'T ON FOR SOME REASON.  WE HAD THE CAR PUT ON A FLATBED AND TAKEN TO THE DEALERSHIP.  A WEEK LATER THEY SAID IT WAS FIXED, WE PICKED IT UP DROVE IT THE 23 MILES HOME AND PARKED IT. THE NEXT MORNING ON THE WAY TO WORK IT DID THE SAME THING. A FLATBED CAME AND TOOK IT TO THE DEALERSHIP AGAIN.  THE DEALERSHIP DROVE IT AND THEY EXPERIENCED THE SAME PROBLEM AND HAD TO HAVE A FLATBED COME PICK IT UP. WE WERE TOLD THAT THE BRAKES WERE ENGAGING WITHOUT WARNING AND IT WOULD BE FIXED.  THE REPLACED EVERYTHING IN THE REAR BRAKES AND WE WAITED A MONTH FOR A MODULE TO BE INSTALLED.  THE DEALERSHIP CALLED AND SAID IT WAS FIXED.  AGAIN, WE PICKED UP THE CAR, DROVE THE 23 MILES HOME AND PARKED THE CAR FOR THE EVENING.  THE NEXT MORNING ON THE WAY TO WORK THE BRAKES ENGAGED AGAIN AND WE HAD TO HAVE THE CAR PUT ON A FLATBED ONCE AGAIN. EVERY TIME THIS HAPPENED IT WAS ON A DIFFERENT TYPE OF ROAD, GOING DIFFERENT SPEEDS AND FOR NO PARTICULAR REASON. THERE WASN'T ANY HARD BRAKING HAPPENING TO MAKE THE BRAKES ENGAGE. IT WAS IN THE MIDDLE OF DRIVING THIS WOULD HAPPEN.  IN THE 9 WEEKS OF OWNERSHIP, WE HAVE ONLY HAD POSSESSION OF THE CAR FOR 20 DAYS!!!  WE ARE BEING TOLD THE CAR IS FIXED AND WE CAN COME GET THE VEHICLE.  I NO LONGER FEEL SAFE IN THIS VEHICLE AND DO NOT WANT IT BACK.  I'M LOOKING TO HAVE THE CAR TAKEN BACK UNDER THE RIGHTS OF THE LEMON LAW AND WILL BE INVOLVING A THIRD PARTY TO HELP MAKE THIS HAPPEN.",
        "vin": "1C4RJFBG0HC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/27/2017",
        "dateOfIncident": "02/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957301,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN THE NE AFTER THE HIGHWAY DEPT. SPREAD THE SLURRY TO COMBAT ICE MY BRAND NEW JEEP GRAND CHEROKEE 2017, COLOR IVORY, STAINED.  THE TRUCK WAS DRIVEN ON THE HIGHWAY AS WELL AS SECONDARY ROUDS. AFTER WASHING THE VEHICLE I DISCOVERED THE WHEEL WELL AND ITS SIDES STAINED FROM THE SLURRY.  BROUGHT IT TO MEADOWLANDS OF CARMEL WHERE IT WAS PURCHASED. THEY INDICATED THEY HAD SEEN THIS BEFORE HOWEVER CHRYSLER WILL NOT COVER CHEMICAL REACTION.  THIS TELLS ME THEY ARE AWARE OF THE ISSUE AND HAVE PRODUCED A PRODUCT THAT CANNOT HANDLE NORMAL USE. THIS IN REALITY IS A DEFECT IN THE PAINT. CHRYSLER CASE NUMBER 31176230",
        "vin": "1C4RJFCG1HC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949989,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I STOPPED ON MY DRIVEWAY WHICH IS AT ABOUT A 20 DEGREE ANGLE. PLACED THE VEHICLE IN PARK AND LEFT THE ENGINE RUNNING. I DID NOT APPLY THE PARKING BRAKE. I EXITED THE VEHICLE IN ORDER TO CHANGE DRIVERS AND LEFT THE DOOR OPEN. THE VEHICLE STARTED TO ROLL BACKWARDS SLOWLY. I JUMPED IN AND HIT THE BRAKES. I CONFIRMED VEHICLE SHIFT SELECTOR WAS IN PARK. I REPEATED THE  SAME THING THE NEXT DAY TO TEST THIS BUT OF COURSE I STAYED IN THE VEHICLE WITH THE DOOR SHUT AND THE SAME THING HAPPENED. I PULLED UP TO THE SAME SPOT, WITH THE ENGINE RUNNING AND PUT THE VEHICLE IN PARK AND I STARTED ROLLING BACK AGAIN. I HIT THE BRAKES AND IT STOPPED. I TESTED THIS BACKING OUT OF MY GARAGE AND COULD NOT MAKE THIS OCCUR THAT WAY. I TRIED IT SEVERAL TIMES AGAIN BOTH WAYS AND COULD NOT DUPLICATE THE PROBLEM. I KNOW THE VEHICLE WAS IN PARK WHEN THIS HAPPENED. THE VEHICLE IS BRAND NEW WITH LESS THAN 700 MILES ON IT. I HAVE STOPPED AT THAT SPOT HUNDREDS OF TIMES OVER THE YEARS WITH VARIOUS VEHICLES, INCLUDING  OTHER MODEL YEAR JEEP GRAND CHEROKEES AND THIS HAS NEVER HAPPENED.",
        "vin": "1C4RJFBG1HC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937966,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE JEEP GRAND CHEROKEE HAS A \"SAFETY\" FEATURE CALLED AUTOMATIC HIGH-BEAMS, A FEATURE THEY CHARGE AN ADDITIONAL FEE FOR.    THE FEATURE ITSELF CAN BE TURNED ON/OFF ONLY THROUGH THE UCONNECT SYSTEM OF SETTINGS, WHILE THE VEHICLE IS STOPPED. THE ACTUAL FEATURE ONCE TURNED ON CAN BE ENABLED AND DISABLED THROUGH THE TURN SIGNAL STALK (PUSHING FORWARD TO ENABLE, BACK TO DISABLE)    ONCE THE FEATURE IS TURNED ON VIA UCONNECT, THERE IS NO WAY TO MANUALLY TURN ON YOUR HIGH-BEAMS EXCEPT BY PULLING BACK ON THE TURN SIGNAL STALK TO ENABLE YOUR FLASH-TO-PASS HIGH-BEAMS.     THIS ALLOWS THE HIGH-BEAMS TO TURN ON FOR APPROXIMATELY 6 SECONDS BEFORE THEY AUTOMATICALLY TURN OFF, EVEN IF YOU ARE STILL HOLDING THE STALK BACK TOWARDS YOU.    THE REASON THIS IS A SAFETY ISSUE IS THAT THE UCONNECT SYSTEM AUTOMATICALLY DISABLES AUTOMATIC HIGH-BEAMS AT SPEEDS OF 15MPH OR LESS. ONCE THIS FEATURE IS AUTOMATICALLY DISABLED, IT CANNOT BE RE-ENABLED UNTIL YOU HIT A SPEED OF 23MPH, AT THIS POINT THE AUTOMATIC HIGH-BEAMS IS RE-ENABLED BY THE UCONNECT SYSTEM.    WHERE THIS BECOMES AN INCREASED SAFETY ISSUE IS ON RESIDENTIAL STREETS WITH SPEED LIMITS OF 20MPH.    THERE IS NO WAY TO TURN ON YOUR HIGH BEAMS ON RESIDENTIAL ROADS, UNLESS YOU ARE ABLE TO TURN ONTO THE RESIDENTIAL ROAD WHERE THE LIGHTS WERE PREVIOUSLY AUTOMATICALLY ENABLED (IE DRIVING ABOVE 23MPH) AND YOU KEEP YOUR VEHICLE SPEED ABOVE 15MPH.     THE ONLY WAY TO TURN ON YOUR HIGH BEAMS IN THIS SITUATION IS TO DO ONE OF THE FOLLOWING:  1- BREAK THE SPEED LIMIT TO REACH 23 MPH THEN DROP BACK DOWN TO THE LEGAL SPEED LIMIT (SO NOT AN OPTION).  2- DRIVE WITH 1 HAND ON THE WHEEL, WHILE HOLDING BACK THE TURN-SIGNAL STALK TO ENABLE FLASH TO PASS HIGH-BEAMS, AND EVERY 6 SECONDS RESETTING THE STALK AFTER THEY TURN OFF.  3- STOP YOUR VEHICLE, ENTER THE UCONNECT SYSTEM ON THE RADIO, CHANGE THE SETTINGS TO TURN OFF THE AUTOMATIC HIGH-BEAM FEATURE.  *TR",
        "vin": "1C4RJFBG4HC"
    }
]