[
    {
        "components": "SERVICE BRAKES,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "04/04/2022",
        "dateOfIncident": "03/10/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459622,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DTCs for left AND right rear wheel sensors. wiring was open on sensors and caused the speed sensors to not read properly at times 3.00. the sensors were replaced at Mac Haik. 3 other jeeps had the same issue the same day. ABS and traction control lights on dash came on before the sensors were replaced and applying gas did nothing. my jeep was automatically applying my breaks even when I went 5 mph.",
        "vin": "1c4bjwdg3hl"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458451,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear view camera failure. 2017 -2022 Jeep Wrangler JK, JKU, JL, JLU, and Gladiators have become infamous for back-up camera failures. Mine failed at 12,000 miles. Hundreds have failed with less then 1,000 miles. Others during pre-purchase test drives. As this equipment is a required safety device as of 2018, this has become a major safety recall issue. Go to any Jeep forum and type in “Back-up Camera failure” and you will find 100’s and 100’s of reports. Jeep is not properly addressing the issue as there are dozens of reports of multiple failures. There are indications that the failures may be related to MOPAR’s wireless software upgrade program, but no one knows for sure.   As well, Jeep’s near silence on the issue is concerning.  When returned to a dealership the reaction is usually one of surprise and astonishment that the problem has occurred followed by a hefty repair cost if the vehicle is out of warranty. This is a serious defect in a federally mandated safety device and needs to be addressed. I appreciate it if you would look into this issue as it is affecting thousands of Jeeps. Thank you.",
        "vin": "1C4BJWCG3HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/24/2022",
        "dateOfIncident": "02/24/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458155,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "We took our car to Rairdon's Dodge Chrysler Jeep of Kirkland for oil change and checking the brake on February 12th because the rare brake had been making some noises and might need a replacement soon. The estimate for the services that we requested plus the additional services that they claimed to be critical was over $2,000. We did not question the amount because safety first and we trusted them to do a good job. We picked up the car on February 15th and paid $2,863.68. We drove home and did not use it until a week later. While driving on a highway, the brake was very loose and there was a huge sound when driving over a speed bump. We checked the car and noticed that a part came off and hanging from the base of the car. We had our car towed back to the shop on March 7th and the staffed confirmed that the caliper had fell off. The service director said they did not touch the caliper when they performed the initial service. Therefore, she was not sure what happened to the car. This is a serious safety issue because we could have get into a car accident or hit other people in the street.",
        "vin": "1C4BJWEG1HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/21/2022",
        "dateOfIncident": "03/13/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457607,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Both front calipers froze at 48,663 miles causing excessive smoke and brake damage. Only symptom was shaking of steering wheel during normal use. Stopped immediately. Vehicle towed, cost to repair $1200.00",
        "vin": "1C4BJWEG1HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2022",
        "dateOfIncident": "02/15/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Oil Filter Assembly failure.  This issue has been consistent in respective Chrysler engines since 2014 without resolve or re-design.  I have been without vehicle since the 24th (today is 3/3) and renting a car out-of-pocket.  The parts are backordered as I've been told there are restrictions by Chrysler on these discontinued replacement parts.  Repairs cost upwards of $1,000 depending on the dealer and situation (if oil hasn't damaged other surrounding parts).    All forums are consistent in that there has been no recourse by any representative from Chrysler or, in my case, Jeep.  The anticipated costs in my situation are likely to exceed $2,500 given the schedule of the repair and any secondary damages by the leaking oil.",
        "vin": "1C4HJWEG2HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/14/2022",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452278,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "My jeep was on the rode approximately 5-10 minutes. Stopped at a light. Loud screech and instrument panel went haywire blinking. Before the traffic light could turn green smoke poured through the dashboard and vehicle was on fire. I was able to unlock the car doors and get out before the electrical shut down and locked me in. The car was towed to my mechanic were I was told it was an electrical fire probably manufactures defect. Car is now being towed to the dealership. I have contacted the dealership and corporate Jeep. I was told they were sending an investigator but when I called on 2/16/2022 to get a rental, that I am entitled to with my  car , I was told the case was closed.  I am not getting a lot of cooperation. The car is available to be inspected. There were no warning lights prior to the screech and smoke. Car was purchased 12/2020 for $35k. Battery is shot so I can not see mileage but my guess is around 40-45,000. Car was not moving it was stopped at a light.",
        "vin": "1C4HJWDG5HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/10/2022",
        "dateOfIncident": "02/09/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451362,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Multiple dealerships are unable to diagnose my vehicle with anything wrong. I experience my vehicle stalling to turn on. It has now escalated to stalling and turning on but shutting down as soon as it turns on then I restart it but it stalls then turns on. The last time this occurred was yesterday 2/9/22 and it was right at entrance of freeway. II am lucky the vehicle did not shut down on the freeway with my two children inside of it and cause a collision. We could have been killed or caused a disastrous crash. This issue has been going on since I purchased the vehicle in 2019. There are no warning lamps to indicate something is wrong but there is documentation I have taken to two dealerships to fix issue but they cannot determine what is wrong with it. I have called Jeep and my extended warranty (Fidelity) and they both said they can’t do anything for me until my car shows a return on computer that says something is wrong with it. I see a recall online (recall # 18V524000) from 08/08/2018 on cars.com that describes the issue I am experiencing. I have videos I recorded of my car stalling before turning on since I have been reporting the issue. I contacted Jeep customer service (Case # 81910661) and they told me nothing can be done until something “happens” with my vehicle. I asked if I am supposed to get into a car accident before something is done. I asked for issue to be escalated and she said it cannot be escalated to legal team until something “happens” with vehicle.  Please help me. Something is wrong with the vehicle. It is currently at the dealership once again so they can “monitor it” turning it off and on daily. Last time it was at dealer just sitting there for 2 weeks and they were not able to find out the issue or experience the stall",
        "vin": "1C4HJWEG2HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2022",
        "dateOfIncident": "01/19/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451205,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Wrangler. The contact stated that the check engine warning lights was illuminated. The vehicle was taken to a local mechanic where it was diagnosed with needing cylinder number 2 replaced. The vehicle was not repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 79,000.",
        "vin": "1C4BJWDG5HL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2022",
        "dateOfIncident": "02/03/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11450614,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Over the past few months, whenever I started up my 2017 Jeep Wrangler, I smelled a strong odor of gas fumes/exhaust. Then, two days ago my \"Malfunction Warning Light\" (check engine light) came in my dashboard and remained illuminated after an oil change and gas fill. I took my Jeep to the local Crystler/Jeep/Dodge/Ram dealership where they told me the code for the problem was a \"Evap System Small Leak,\" but they could not take my car in for another week to look into the issue further. This concerned me, so I then took my Jeep to a Midas where they ran many tests to find that I had a \"small fracture where the FPS inserts to the tank.\" Midas told me that although it is just the leak detection and purge valve that need a minor repair, this part cannot be purchased separately and I would need to pay to replace the whole gas tank for $2700. The technician told me he had seen this a few times before with Jeep Wranglers around the same year as mine before the 2018 models came out with a new tank, and that I couldn't have done anything to cause it because it is just a substandard part that was put in Jeeps of my model/year.   I was told that if this issue is not corrected soon, it is unsafe to drive. A larger crack could grow and cause fuel to leak, which then becomes a fire safety hazard. The current fuel emissions/vapors escaping are harmful to breathe in, and to the environment. I was told my Jeep wouldn't pass smog inspection in it's current state.   I have found a Crystler recall for faulty 2017 Jeep Wrangler fuel tanks, Recall no. 16V849000 (Crystler Recall no. S90) that applies exactly to my situation. However, although it is the exact problem I am experiencing, the dealership told me there are no open recalls for my specific 2017 Jeep Wrangler.    I now have an open appointment to have the dealership take a closer look, but I don't believe I should need to pay for this large repair since it was a clear recall and common issue with 2017 Jeep Wranglers just like mine.",
        "vin": "1C4BJWDG9HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "10/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449220,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Wrangler. The contact stated that while driving at various speeds, the vehicle stalled without warning. The vehicle was restarted however, the failure recurred ten miles later. The vehicle was taken to an independent mechanic however, the failure was undetermined. The vehicle was not taken to the dealer. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 17,712.",
        "vin": "1c4bjwfg5hl"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "01/17/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11449240,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owned a 2017 Jeep Wrangler. The contact stated that while her granddaughter was driving her vehicle at approximately 30 MPH, through an intersection another vehicle crashed into the driver's side door. The contact stated that her vehicle was lifted about 10 FT off of the ground which caused the vehicle to land on the passenger side. The air bags did not deploy. The contact stated that in order for her granddaughter to exit, she had to climb through the roof of the vehicle. The contact stated that a police report was filed and the ambulance was called to the scene. The contact stated that her granddaughter did sustain injuries to her back and whiplash. The contact stated that she was unsure about the injuries sustained by the other vehicle involved in the crash. The contact stated the vehicle was totaled and towed to a scrapyard. The contact stated that she contacted the dealer, and was advised that they would go out and inspect the vehicle at the scrapyard. The contact stated she had not yet contacted the manufacturer at this time. The failure mileage was 23,000.",
        "vin": "1C4BJWDG9HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2022",
        "dateOfIncident": "06/30/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448870,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The Oil Filter Assembly is defective. It leaks oil. Yes it’s available for inspection. Oil leaks onto engine and eventually to exhaust system.This will result in smoking and fire. This has been identified by an independent service center and numerous social media sites. Has not been inspected by those listed above. No warning lamps, messages or other symptoms prior to a scheduled oil change wherein the defect was discovered. This first appeared 6 months ago.",
        "vin": "1C4HJWDG8HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2022",
        "dateOfIncident": "01/20/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448234,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 wrangler, ~39k miles. leaking oil - oil visible below car (in pools on ground and on components in engine and under car when I went under it). no electronic reporting of low oil or low oil pressure. no oil visible on dipstick. see attached pic of leaking from oil filter housing - oil pooled below filter housing cap.",
        "vin": "1c4bjwegxhl"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447105,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I am the original owner of a 2017 RHD Jeep Wrangler with 15,538 miles on the odometer. While under normal driving conditions, the trackbar bracket on the frame side broke away from the frame. Upon inspection by the dealership, it was noted that only one side of the bracket had been welded at the factory. Jeep will not accept fault and since my vehicle exceeds the 36 month warranty they state that I am responsible for all repair costs.  Prior to this issue, I noticed over the previous year a slight shimmy in the front end thinking my tires were out of balance even when I had them rebalanced and had them rotated.  I have been speaking to Jeep who has been unresponsive and evasive. I recently heard about other such incidences online and from JK forum which was recently validated by my insurance company who has rejected my claim for repairs because it is classified as a known fault.",
        "vin": "1C4BJWKGXHL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446527,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Wrangler. The contact stated that while driving at an undisclosed speed, the check engine warning light illuminated. The vehicle was taken to an independent mechanic and initially diagnosed with cylinder #3 misfire. Additionally, there was an abnormal antifreeze odor detected. The engine code was reset. After getting the vehicle back from the mechanic, there was lots of white smoke coming from the exhaust pipe. The vehicle was taken back to the independent mechanic and diagnosed with a cracked cylinder head. The vehicle was not repaired and remained with the mechanic. The manufacturer was made aware of the failure and referred the contact to file a complaint with NHTSA. The failure mileage was approximately 84,000.",
        "vin": "1c4hjwfg3hl"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/19/2021",
        "dateOfIncident": "12/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444342,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI LOCK BRAKING SYSTEM AND TRACTION CONTROL ACTIVATE AT LOW SPEEDS - AT 5-10 MPH. IT APPLIES THE BRAKES WITHOUT WARNING AND CUTS POWER TO THE ENGINE.",
        "vin": "1C4BJWEG2HL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "07/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440556,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I had already had to replace 2 rear seat belts in my wrangler over a year ago.  Both seat belts tore completely in half.  The cost for the seat belts alone was 500.  A year later, I had another seat belt rip in half.  One that was already replaced ripped right in half again. I only occasionally have had anyone in the back seat.  Possibly once a week.  Now, I cannot put anyone, especially children in the back seat of my 4 door, so called 5 passenger jeep because it is not safe.  the seat belts fray and rip.",
        "vin": "1C4BJWEG3HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440085,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving all dashboard warning lights came on and the headlights and directional lights stopped functioning causing a dangerous driving condition in the dark. I immediately pulled over the 2017 wrangler and attempted to turn off the vehicle to reset the computer system. The Jeep would not turn off with ignition turned off and the key removed. The Jeep began overheating. I disconnected the battery terminals and the Jeep still would not shut off. Finally I was able to find a large fuse to remove which shut off the Jeep.",
        "vin": "1C4BJWDG9HL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Windshield wiper motor was making a grinding noise, then today, stopped working. It was raining/foggy, couldn't see to drive.",
        "vin": "1c4hjweg5hl"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2021",
        "dateOfIncident": "09/03/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Jeep has been randomly just shutting off- whether I have been driving for an hour, or the following day- when I go to start it, all lights show up but it will not turn on. I get out of the car with the key and find that my remote start always works. I have taken my car to the dealership, they said I need a new battery? I got the battery checked two weeks ago and all was fine. Several times that my car does not turn on the electrial light shows up on my dash. I have found many people have had this same issue- however MOPAR has not recalled it. Recall Number 18V524000, Report Data Aug 9, 2018- Electrical System- Wiring, front underhood. __The powertrain control module may be equipped with a voltage regulator chip in the circuit board that may fail, causing a stall or a no start condition. I have seen the electrical light on my dashboard, however this is always random. The dealership says to replace the battery, which when they sent over the results they didnt even show what it mesaured. This seems to an issue with fellow Jeep owners and should be recalled and added to the MOPAR website.",
        "vin": "1C4BJWEG9HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "06/28/2021",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425156,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2017 Jeep Wrangler. The contact stated while driving 55 mph, the contact saw smoke coming from the engine compartment. The contact stated that the clutch disintegrated causing the clutch to catch on fire. There was no crash nor injuries due to the fire. The air bags did not deploy. The fire department was not contacted. A police report was not filed. The contact stated no warning light was illuminated. The vehicle was towed to the local dealer where it was diagnosed with the clutch needing to be replaced. The vehicle was repaired. The contact was relating the failure to NHTSA campaign number: 21V028000 (Power Train). The manufacturer had been informed of the failure and informed the contact that the Vin was not under recall. The failure mileage was approximately 33,000.",
        "vin": "1C4BJWEG2HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "07/09/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424069,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Both Front Doors Seals are leaking after four years old.  Repair cost is $500+ - Had a 2007 4 door for ten years; no leaks.  They did a redesign - not a good design!",
        "vin": "1C4BJWEG8HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2021",
        "dateOfIncident": "06/16/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422227,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "Steering wheel controls started working intermittently than quit. Vehicle is RHD and used on a rural mail route. Why weren't all RHD JKU vehicles included in NHTSA recall 16V-288 when this is a documented recall for 2007 to 2016 RHD Jeep JKUs? This problem occurred around June 16 2021. Went to dealer and asked about problem and was told my extended warranty does not cover this.",
        "vin": "1C4BJWKG3HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2021",
        "dateOfIncident": "05/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421762,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 jeep Wrangler sport JKU all stock, normal road tires from the dealership, rear and front driver side break caliper is sticking and causing break drag at 32,000. due to this causing the rear break pads to prematurely wear bi-lateral and damaging the rotor on the affected side, causing the vehicle to operate at higher RPMS as the breaks are dragging. due to the heat the caliper boot was damaged as well. Excessive dust on rim and burning break smell with excessive friction heat along with the vehicle pulls to affected side when you let go of the wheel at residential speeds. the heat causes a dangerous break lag and the break pedal is harder to depress as what i believe is fluid not making it back to the master cylinder. when the vehicle is in drive you let your foot off the break on level ground the vehicle dose not move as it should when the transmission is in drive at idle, no gas given, the breaks squeak and jump grip as the jeep tries to move when gas is given, the break is stuck on the rotor. rear breaks where replaced bilaterally cleaned with new calipers, high temp silicone grease , rotors and ceramic pads is hopes to fix the problem. after that is when the front driver caliper was noticeably showing the same signs as the rear did. to have a non dealership mechanic do the job is 970.00.vehicle drives as if the emergency break is on but was inspected and is not touching the inner drum. vehicle is not heavily uses ether 1.)no lights or check break lights luminated its all feel. no accidents due to the break lag but is very dangerous if you need to stop suddenly.  2.)issue confirmed by a independent service center mechanic 3.) at 15,000 miles vehicle was taken back to the dealership for a break groaning sound and squeak when backing up or when driving, dealer stated it was just dust on the pads, inspection found no issues. after the visit the sound would still periodically kept reoccurring but was kept being told \"dust\" not sure if that was a early sign",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414411,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE FRONT AND REAR BRAKE CALIPERS FAILED. 31765 MILES ON VEHICLE. SMELLED SOMETHING BURNING AND ROUGH RIDE. TOOK VEHICLE TO JEEP DEALER. TOLD $2,100 TO REPAIR AND CAUSED BY MY ONLY DRIVING VEHICLE 31000 MILES IN 4 YEARS. TOLD DEALER I BELIEVED THIS WAS SAFETY ISSUE AND I WAS FILING NHTSA COMPLAINT. FCA PROVIDED REPLACEMENT BRAKE CALIPERS FOR ALL 4 WHEELS AND FAILED BRAKE HOSE AT NO CHARGE. DEALER REPAIRED AT $965 COST TO ME FOR DAMAGE CAUSED BY FAILED BRAKE CALIPERS.",
        "vin": "1C4AJWBG6HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405938,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR REAR WINDOW EXPLODED WHILE SITTING STILL BELIEVE DUE TO REAR DEFROSTER MALFUNCTION BUT DEALER IS SAYING NO. NO OTHER EXPLANATION COULD HAVE DONE IT NO OUTSIDE INTERFERENCE RUNNING IN A RESIDENTI DRIVEWAY CLEAR COOL DAY WINDOWS DOWN NO INSIDE PRESSURE",
        "vin": "1C4BJWKG5HL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "03/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404976,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V734000 (AIR BAGS) HOWEVER, THE VEHICLE HAD EXPERIENCED THE FAILURE STATED IN THE RECALL. THE CONTACT STATED THE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO MALL OF GEORGIA CHRYSLER DODGE JEEP (4345 BUFORD DR, BUFORD, GA 30518) WHO DIAGNOSED THE VEHICLE AND STATED THAT THE FRONT IMPACT SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE CONTACT WAS INFORMED THAT THE REPAIRED HAD TO BE PAID FOR OUT OF POCKET. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND CONFIRMED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 52,000.",
        "vin": "1C4BJWDG9HL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/13/2021",
        "dateOfIncident": "03/05/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402793,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HIGHWAY SPEED OF 63 MPH ABS AND TRACTION CONTROL LIGHTS ILLUMINATED JEEP LOST SPEED IMMEDIATELY. FELT LIKE THE BRAKES WERE STUCK SMELLED A TERRIBLE BURNING SMELL",
        "vin": "1C4BJWDG6HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2021",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400214,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT WHILE AT THE LOCAL DEALER LEE CHRYSLER JEEP (765 CENTER ST, AUBURN, ME 04210) FOR ROUTINE MAINTENANCE, IT WAS DISCOVERED THAT THE OIL FILTER ADAPTER HAD CRACKED CAUSING OIL TO LEAK FROM THE ENGINE COMPARTMENT. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 67,000.",
        "vin": "1C4BJWDG4HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "03/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399960,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OIL COOLER. CRACKS CAUSING MASSIVE ENGINE OIL LEAKS. MY JEEP WAS PARKED IN THE GARAGE. I NOTICED THE OIL ON THE FLOOR. I FOLLOWED IT UP BOTH SIDES OF THE ENGINE TO THE COOLER. I HAVE NOT CHANGED THE OIL IN MONTHS. IT WAS BELOW ZERO HERE FOR 3 DAYS IN NORTH TEXAS. THE COOLER IS MADE FROM PLASTIC. IT GETS HOT THEN COLD THEN HOT AGAIN AND IT CRACKS. THIS IS A SERIOUS ISSUE AND IS A MASSIVE ISSUE AS WELL. JEEP/CHRYSLER KNOWS THIS, HOW DO I KNOW? BECAUSE THEY HAVE NO MORE PARTS, THEY RAN OUT FOR REAL GONE NO COOLERS. NHTSA WAS MADE FOR THIS. EVERY JEEP HAS THIS ISSUE! MY JEEP IS AT AUTONATION IN KELLER TEXAS WAITING FOR PARTS THEY TELL ME IT COULD BE MONTHS!!! I NOTICED THE OIL ON THE 1ST OF MARCH THE JEEP HAD BEEN PARKED SINCE FEB.20TH NO HISTORY OF ANY LEAKS. JEEP HAS 66000MILES ON IT 1 OWNER ME.",
        "vin": "1C4BJWEG0HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "03/04/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11400009,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY POWER DOOR LOCKS WOULD WORK SOMETIMES AND OTHER TIMES MY DOOR WOULD REMAIN LOCKED AND I COULDN'T EVEN UNLOCK IT MANUALLY I WOULD HAVE TO CRAWL ACROSS CONSOLE AND USE OTHER DOOR",
        "vin": "1C4BJWKG0HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2021",
        "dateOfIncident": "12/26/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398165,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMMITTENT STALLING WHEN PUT IN REVERSE. HAPPENS MORE FREQUENTLY IN COLD WEATHER. HAS SHUTTERED SEVERAL TIMES AND ONE STALL WHEN PUT IN DRIVE BUT HAPPENS MOSTLY WHEN REVERSING. THIS HAS BEEN GOING ON SINCE WINTER 2019 WITH NO RESOLUTION AFTER DEALERSHIP CHECKED IT OUT. HARD TO DIAGNOSE BECAUSE IT DOESN'T HAPPEN EVERY TIME.",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "01/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397720,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE OIL FILTER HOUSING WAS CRACKED, CAUSING OIL TO LEAK FROM THE VEHICLE, WITHOUT WARNING. THE CONTACT HAD TAKEN THE VEHICLE TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THE FAILURE AND INFORMED HIM THAT THE REPLACEMENT PART WAS ON BACKORDER. THE MANUFACTURER HAD BEEN NOTIFIED OF THE FAILURE AND INFORMED HIM THAT THE PART WOULD NOT BE AVAILABLE FOR ANOTHER TWO TO THREE MONTHS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 52,000.",
        "vin": "1C4BJWDG1HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/19/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397274,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT NOTICED THAT THE OIL FILTER HOUSING WAS LEAKING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS INFORMED THAT THE OIL FILTER HOUSING FRACTURED AND NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE VEHICLE WAS NOT REPAIRED SINCE THE PART WAS ON A NATIONAL BACK ORDER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 72,000.",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397302,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL SPILLAGE ON DRIVEWAY. STARTED AFTER COLD WEATHER MOVED INTO AREA. NOW COSTING 1500.00 TO FIX PROBLEMS. HAVE NOTICED OF SEVERAL COMPLAINTS OF SAME AREA BREAKAGE ON MULTIPLE OTHER SAME YEAR AND STYLE VEHICLES VIA INTERNET SOCIAL NETWORKING SITES.",
        "vin": "1C4BJWFG1HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/22/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397396,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE VEHICLE NEW IN 2017, AND IN MID-2018, HAD A SYNCHRONIZING ARM REPAIRED, AS THE TRANSMISSION WAS SLIPPING OUT OF REVERSE.  IN 2019, HAD IT LOOKED AT AGAIN BECAUSE IT WAS SLIPPING OUT OF 4TH GEAR, AND NOTHING WAS FOUND.  IN LATE 2020, HAD IT IN TO CHECK A CREAKING NOISE WHEN DEPRESSING THE CLUTCH (LOCAL TRANSMISSION REPAIR SHOP), AND IT WAS FULL OF RUST, THEY SAID IT NEEDED REPLACED SOMETIME SOON.  SO WE TOOK IT IN NOW (FEB. 2021) AND THEY SUGGESTED THAT THE TRANSMISSION NEEDED REPLACED AS WELL BECAUSE IT SLIPPED OUT OF 4TH FOR THEM WHEN THEY DROVE IT.  CALLED THE DEALERSHIP, THEY RECOMMENDED CALLING CHRYSLER, WHO OPENED A CASE, AND NOW I'M TAKING IT IN TO HAVE IT DIAGNOSED AT THE DEALERSHIP AND FOLLOWED UP THROUGH THE CASE AT CHRYSLER.  THIS SEEMS TO BE AN ISSUE, AS I'VE READ SEVERAL COMPLAINTS ABOUT THE SAME PROBLEMS AND FIXES.",
        "vin": "1C4BJWDGXHL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2021",
        "dateOfIncident": "02/17/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396664,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAKS FROM THE OIL COOLER HOUSING AT 34000 MILES",
        "vin": "1C4HJWDG6HL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "11/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394563,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT REAR SEAT BELT SHOULDER STRAP BECAME UNATTACHED AS MY 9 YEAR OLD, 50 POUND GRANDSON WAS ATTEMPTING TO STRAP HIMSELF IN.  A WEEK LATER ON THE RIGHT SIDE OF THE BACK SEAT, THAT SEATBELT WAS DISCOVERED TO HAVE A TEAR MORE THAN HALF WAY ACROSS.  I HAVE ONLY THE MIDDLE SEAT THAT IS SAFE FOR MY GRANDSON TO SIT IN.  THIS IS ONLY A 3 YEAR OLD JEEP, THE PARTS WITHOUT LABOR IS 500.  TO HAVE THE SEAT BELTS REPLACED.  IT WILL MOST LIKELY COST ME 1000. TO HAVE TWO SEAT BELTS REPLACED.  THESE ARE DEFINITELY FAULTY UNSAFE SEAT BELTS.",
        "vin": "1C4BJWEG3HL"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390972,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED OIL LEAK SMELL, TOOK TO MECHANIC AND DIAGNOSIS SHOWS THE OIL HOUSING UNIT,  PLASTIC COVER ON THE COOLER IS CRACKED AND LEAKING.  VEHICLE IS NOT DRIVEN OFF ROAD AND IS COMPLETELY STOCK.",
        "vin": "1C4BJWFG0HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2021",
        "dateOfIncident": "01/14/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389434,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAK COMING FROM THE OIL HOUSING UNIT, PLASTIC COVER ON THE OIL COOLER WAS CRACKED AND THE LEAK SHOWS SYMPTOMS OF A REAR MAIN SEAL LEAKING WHEN IN FACT IT IS NOT. VEHICLE WAS DRIVEN UNDER NORMAL CONDITIONS. COMPLETELY STOCK AT THIS TIME.",
        "vin": "1C4HJWDG8HL"
    },
    {
        "components": "SERVICE BRAKES,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387614,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE HEAT WAS TURNED ON A BURNING SMELL WAS DETECTED. VEHICLE WAS TAKING TO THE DEALER FOR AN OIL CHANGE AND AN ANALYZE FOR THE BURNING ODOR, THIS VEHICLE IS AT 52000 MILES.   RESULT:  MAJOR LEAK TO THE OIL FILTER HOUSING AND THE FRONT DRIVE SHAFT IS ALSO LEAKING GREASE. THIS VEHICLE IS NOT BEING USING FOR OFF-ROADING OR 4WD   DEALER STATED THAT THE OIL FILTER HOUSING WAS FIXED AND THE VEHICLE CAN BE DRIVEN WHILE WAITING ON THE OTHER PARTS. I CONTINUE TO DETECT THE BURNING ODOR. THE VEHICLE CONTINUES TO LEAK OIL. ON FURTHER INSPECTION THE COOLANT AND THE RADIATOR IS EMPTY.  DEALER MECHANIC STATED THAT THE RADIATOR IS LEAKING AND THIS IS A COMMON ISSUE.  I AM NOT THE ONLY CUSTOMER THAT IS HAVING THIS ISSUE; WHEN INQUIRED ABOUT A RECALL, I WAS TOLD THAT CURRENTLY THE MANUFACTURE DOES NOT HAVE ONE IN PLACE.   I WAS TOLD THAT THE MANUFACTURE IS AWARE OF THE ISSUE BUT WILL NOT ACKNOWLEDGE IT AND ONCE THE VEHICLE REACHES 50,000 MILES AND OUT OF WARRANTY, IT IS NOW THE CUSTOMER PROBLEM.",
        "vin": "1C4BJWDG9HL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "12/24/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387285,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE IS IN MOTION WHILE AT SPEEDS OF 65 TO 80 WHEN YOU HIT A BUMP THERE IS SEVERE STEERING WHEEL WOBBLE THAT CAUSES THE VEHICLE TO SHAKE.  IT FEELS LIKE THE ENTIRE FRONT END IS GOING TO FALL APART.  I HAVE READ OTHER COMPLAINTS ON 2018 JEEP WRANGLERS AS WELL CITING A STEERING DAMPENER ISSUE.",
        "vin": "1C4HJXEG1JW"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2021",
        "dateOfIncident": "12/12/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11386127,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ADAPTER ENEGINE OIL FILTER .WIRING K1-2 WAY.",
        "vin": "1C4BJWDG8HL"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2020",
        "dateOfIncident": "11/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377294,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS BROUGHT TO THE DEALER FOR THE SAME REPAIR 3 TIMES IN THE LAST THREE MONTHS. IT WAS NEVER CORRECTED PROPERLY. CHECK ENGINE LIGHT DASHBOARD WAS ON (WHILE IN MOTION AND STATIONARY ON ROADS AND HIGHWAYS)BECAUSE THERE WAS A ENGINE CALIBER MISFIRE. BRAKES WERE SQUEAKING AFTER BEING REPLACED.   BROUGHT MY CAR BACK TO THE DEALER ON FRIDAY, NOVEMBER 27, DEMANDING THIS REPAIR BE DONE PROPERLY. NAME OF THE DEALERSHIP IS EMPIRE JEEP DODGE LOCATED ON SUNRISE HIGHWAY IN WEST ISLIP NEW YORK.  MY VEHICLE IS STILL AT THE DEALERSHIP - BEING WORKED ON. PER THE CONVERSATION WITH THEIR ASSOCIATE TODAY, MY CAR SHOULD BE READY BY TODAY 12/1 OR TOMORROW 12/2.  THE DEALERSHIP IS AWARE THAT WHEN I BROUGHT MY CAR IN ON FRIDAY, NOVEMBER 27 THAT I NEED TO HAVE THE INSPECTION DONE BY NOVEMBER 30. PLEASE LET ME KNOW IF YOU NEED FURTHER DETAILS.",
        "vin": "1C4BJWDGXHL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377124,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING HIGH WINDS THE HOOD WAS FLUTTERING.  ON 11/23/2020, DURING HIGH WINDS, ON A STATE HIGHWAY AT ABOUT 65 MPH, WE PASSED A LARGE TRUCK AND THE DRIVER'S SIDE HOOD LATCH SHEERED OFF IN THE WIND.  WE REPLACED THAT LATCH AND NOTICED THE FLUTTERING WAS REDUCED ON THE DRIVER'S SIDE BUT NOT ON THE PASSENGER SIDE, SO WE REPLACED THE PASSENGER SIDE AS WELL.  WE HAD TO OBTAIN PARTS FROM TWO DEALERSHIPS, AS NEITHER DEALERSHIP HAD TWO PARTS.  BOTH DEALERSHIPS INDICATED THIS WAS A KNOWN PROBLEM AND THEY HAVE BEEN UNABLE TO STOCK ENOUGH PARTS.",
        "vin": "1C4BJWFG3HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2020",
        "dateOfIncident": "11/08/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376071,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND SMELLED A BURNING SMELL.. THOUGHT THAT THERE WAS A LITTLE OIL ON ENGINE DUE TO OIL CHANGE 2 DAYS BEFORE.  DECIDED TO PULL OVER, BRAKES WERE GONE. ROLLED TO STOP JUST IN TIME TO GET OUT. BURNED UNTIL ALL WAS SMOLDERING..",
        "vin": "1C4AJWAG3HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2020",
        "dateOfIncident": "10/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374109,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY 8000 MILES AND AIR CONDITIONING NOT COOLING.  TOLD 2100 DOLLARS TO REPAIR!!",
        "vin": "1C4AJWAG3HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "03/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366511,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THE DASH BOARD LIGHTS GO OUT & THE RADIO. MANY ATTEMPTS TO FIX THE PROBLEM. IT'S NOT GETTING FIX THE PROBLEM.",
        "vin": "1C4HJWEG8HL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/02/2020",
        "dateOfIncident": "09/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362449,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HIS FIANC WHO OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE AIR BAG WARING LIGHT WAS FLASHING. THE CONTACT TOOK THE VEHICLE TO TANNER MOTORS (620 W. WASHINGTON ST, BRAINERD, MN 56401; (218) 829-3597) WHO STATED THAT THE CLOCKSPRING NEEDED TO REPLACED DUE TO THE VEHICLE BEING TURNED TO THE LEFT AND RIGHT TOO MANY TIMES. THE CONTACT WAS UNSURE IF THE MANUFACTURER WAS CONTACTED HOWEVER, THE DEALER CONTACTED PERSONS WITH CHRYSLER REGARDING THE FAILURE. THE CONTACT STATED THAT THE FAILURE WAS RELATED TO NHTSA CAMPAIGN NUMBER: 16V290000 (AIR BAGS) HOWEVER, THE VIN WAS NOT INCLUDED. THE APPROXIMATE FAILURE MILEAGE WAS 109,000.",
        "vin": "1C4BJWKGXHL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/26/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361460,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS AGO, I GOT IN MY CAR AND TURNED THE KEY AND THE CAR WOULD NOT START. ALL LIGHTS CAME ON, BUT NO POWER. LET IT SIT ABOUT 5 MIN, TRIED AGAIN AND IT MAGICALLY STARTED. IT DID THIS 3 OR 4 TIMES IN A FEW DAYS TIME OVER THE SUMMER (2020) AND THEN STOPPED. ON 9/26/20, IT STARTED DOING THIS AGAIN. IT LEFT ME AND MY MOTHER STRANDED FOR 20 MIN AT A TIME DOING THE EXACT THING, BEFORE FINALLY STARTING. I LOOKED UP RECALLS AND ON MY MAKE AND MODEL, THERE IS A RECALL ABOUT A CHIP IN THE KEY FOB NOT CONNECTING WITH A MODULE IN THE JEEP COMPUTER CORRECTLY. CALLED THE DEALERSHIP, THEY SAID SINCE MY SPECIFIC VIN WAS NOT MENTIONED IN THE RECALL, IT WOULD BE $75 FOR THEM TO LOOK AT IT AND IT WOULD BE 4 DAYS BEFORE THEY WOULD GET ME IN. I AM 6 MONTHS PREGNANT AND HIGH RISK WITH GESTATIONAL DIABETES AFTER LOSING 2 BABIES. I AM LIVID THAT I CAN'T GET ANY HELP ON A LEASED VEHICLE SINCE THE MILEAGE IS OUTSIDE OF MY WARRANTY. I HAVE CRIED ALL MORNING TERRIFIED THAT ME, MY DAUGHTER AND UNBORN BABY WILL BE STUCK SOMEWHERE AT A DOCTOR APPT IN A BAD AREA WITH NO TRANSPORTATION.",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361100,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE PARKED, WITH MOTOR RUNNING AND GOT A SLIGHT WHIFF OF THE SWEET ANTI FREEZE SCENT. TOOK IT TO A SHOP WHO SAID WE HAD A VERY SMALL HOLE NEAR THE TOP OF THE RADIATOR. AFTER RESEARCH, WE SEE THIS IS A HIGHLY REPORTED PROBLEM. ON A 3 YEAR OLD VEHICLE? WE HAVE A 15 YEAR OLD VW BUG CONVERTIBLE AND A 20 YEAR OLD FORD F150 AN HAVE NEVER HAD ISSUES WITH THE RADIATORS. SO DISAPPOINTED IN THIS!",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/18/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN DRIVING ABOUT 2 HOURS WHEN I NOTICED A SMELL. I STOPPED THE VEHICLE AND GOT OUT TO TAKE A LOOK. I FIRST WALKED TO THE BACK OF THE VEHICLE AND FOUND NOTHING. I TURNED AROUND AND STARTED FOR THE FRONT OF THE VEHICLE WHEN I NOTICED SMOKE COMING OUT OF THE HOOD. I LEANED IN THE TO DRIVERS SIDE TO TURN OFF THE ENGINE AND SAW FLAMES. THERE WAS NO INDICATION OF ANY ISSUES, NO LIGHTS, NO PERFORMANCE ISSUES, ETC. EVERYTHING WAS STILL WORKING FINE WHEN I SHUT THE ENGINE OFF.*DT    THE CONSUMER PROVIDED PHOTOS. *TR",
        "vin": "1C4HJWFG6HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "03/27/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360556,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY RADIATOR HAD TO BE REPLACED.  THE VEHICLE HAS ALWAYS MAINTAINED REGULAR MAINTENANCE AND NEVER HAD ACCIDENTS OR ISSUES.  THE TEMP STARTED OVERHEATING AND UPON INSPECTION THE MECHANIC STATED THE RADIATOR WAS CAUSING IT.  MY RESEARCH ONLINE SHOWS MANY OTHERS HAVE EXPERIENCED THIS ISSUE.  THIS SHOULD NOT HAPPEN ON A CAR THAT IS ONLY 3 YEARS OLD!",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360558,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY BLEND DOOR ACTUATOR HAD TO BE REPLACED.  THE HEATER WOULD BLOW AIR BUT IT WOULD NOT GET HOT.  UPON INSPECTION THE MECHANIC FOUND THE CHEAPLY MADE PART HAD FAILED AND NEEDED TO BE REPLACED.  MY RESEARCH ONLINE HAS FOUND SEVERAL PEOPLE COMPLAINING ABOUT THE SAME PROBLEM IN NEWER MODEL JEEP WRANGLERS.  THIS PART SHOULD NOT BE FAILING ON A CAR THAT IS ONLY 3 YEARS OLD!!",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359796,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH KEEPS LOOSING POWER AND WHEN IT DOES I HAVE NO BREAKS OR LIGHTS. EVERYTHING DROPS TO ZERO AND THEN IT WILL JUST JUMP BACK UP AGAIN. MY ABSOLUTE, BRAKES,BATTERY, SEATBELT SENSORS KEEP GOING ON AND OFF. THIS HAPPENS MOVING AND IN PARK. OCCASIONALLY IT WON'T START EITHER. I HAVE HAD THE BATTERY, ALTERNATOR AND STARTER TESTED. I WAS TOLD THERE WAS A RECALL WHEN GETTING IT CHECKED AND INSPECTION BUT UPON CALLING THE READERSHIP I WAS TOLD NO.",
        "vin": "1C4BJWDG8HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353347,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO START VEHICLE, ALL LIGHTS ARE ON AND CAR CRANKS BUT WONT TURN OVER. TRIED BOTH KEYS. AFTER NUMEROUS ATTEMPTS, 10-15, THE VEHICLE WILL FINALLY START. BATTERY IS FINE. STARTER IS FINE. IT TAKES NUMEROUS TRIES TO GET THE VEHICLE STARTED. THERE ARE ONLY 16000 MILES ON THIS VEHICLE.",
        "vin": "1C4HJWEG4HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352497,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS AND TRACTION SENSORS COME ON WHEN TURNING LEFT.  ABS SOMETIMES DEPLOYS WHEN THESE LIGHTS ARE ON WHEN BRAKING.  SHOULDN'T BE HAPPENING IN A VEHICLE THAT IS 3 YEARS OLD. I AM HEARING THAT THIS IS A COMMON PROBLEM IN JEEP WRANGLERS FROM THIS TIME PERIOD.",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/25/2020",
        "dateOfIncident": "08/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351174,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEED SENSOR WENT OUT ON PASSENGER SIDE REAR TIRE AT 8000 MILES, NEARLY GOT IN ACCIDENT ON INTERSTATE AS VEHICLE IN THE MIDDLE OF DRIVING PRACTICALLY STOPPED TO 10 MILES AN HOUR. SECOND SENSOR DRIVER SIDE REAR WENT OUT AT 40, 000 MILES JUST OUTSIDE WARRANTY AND THE SAME THING HAPPENED ON THE INTERSTATE TO MY WIFE. SHE IS NOW SCARED TO DRIVE VEHICLE. CALLED JEEP AND THEY DID NOTHING. I PAID FOR REPAIR, BUT CAN'T REPAIR MY WIFE'S SYCHE. I EXPECT A RECALL, IT IS NOT SAFE FOR THE SENSORS TO GO OUT LIKE THAT. THERE ARE MANY JEEP MESSAGE BOARDS THAT DEPICT SAME ISSUES. IT IS MY INTENT TO CONTACT AN ATTORNEY FOR FURTHER REPRODUCTION CONSIDERATIONS",
        "vin": "1C4AJWBG1HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2020",
        "dateOfIncident": "07/29/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349648,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CALIPERS LOCK UP FOR NO REASON CAUSING A SAFETY ISSUE AS WELL AS DAMAGING THE BRAKE PADS AND ROTORS.",
        "vin": "1C4BJWFG3HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/22/2020",
        "dateOfIncident": "07/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340959,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT BRAKE ON '17 WRANGLER (CALIPER) FROZE SHUT WHILE IN MOTION ON HIGHWAY MOVING APPROXIMATELY 45 MPH. SMOKE WAS VISIBLE ABOVE FRONT RIGHT WHEEL, VEHICLE SHOOK WHILE IN MOTION. VEHICLE HAS 19,000 MILES, ZERO INDICATION OF LOW BRAKE PADS WHICH SHOULD LAST WELL OVER 45,000 MILES, AND ONLY THE RIGHT BRAKE PAD WORE DOWN. DEALERSHIP CLAIMS LOW BRAKE PAD CAUSED ISSUE, THEREFORE WEAR & TEAR. DUE TO NO PRIOR BRAKE ISSUES/SLOW BRAKING/ SQUEAKING, AND CURRENT MILEAGE, I'M OF THE OPINION THAT BRAKES LOCKED DUE TO DESIGN OR MECHANICAL ISSUES RATHER THAN LACK OF MAINTENANCE.",
        "vin": "1C48JWDG5HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2020",
        "dateOfIncident": "01/17/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339716,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE CONTACT ATTEMPTED TO ACTIVATE THE HORN HOWEVER, THERE WAS A DELAY IN RESPONSE. THE VEHICLE WAS TAKEN TO TWIN CITY CHRYSLER DODGE JEEP RAM FIAT LOCATED AT 650 SAGAMORE PKWY S, LAFAYETTE, IN 47905, AND THE CONTACT WAS INFORMED THAT THE VEHICLE PERFORMED AS DESIGNED. THE VEHICLE HAD NOT BEEN DIAGNOSED NOR REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 18,000.",
        "vin": "1C4AJWAG8HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "04/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339360,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE JERKED AND CAME TO AN ABRUPT STOP WITHOUT WARNING. THE VEHICLE WAS TURNED OFF AND RESTARTED AND OPERATED AS INTENDED. THE VEHICLE WAS TAKEN TO CHRYSLER DODGE JEEP RAM FIAT CRESTVIEW (5200 S FERDON BLVD, CRESTVIEW, FL 32536) WHERE SHE WAS INFORMED THAT THE DRIVER'S AND PASSENGER'S SIDE REAR BRAKE SENSORS MALFUNCTIONED. THE VEHICLE WAS REPAIRED UNDER WARRANTY HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE REPAIR PART WAS NOT AVAILABLE. NO FURTHER ASSISTANCE WAS PROVIDED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "1C4BJWDG5HL"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "07/05/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337827,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI LOCK BRAKING SYSTEM AND TRACTION CONTROL ACTIVATE AT LOW SPEEDS - AT 5-10 MPH.  IT APPLIES THE BRAKES WITHOUT WARNING.",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL CAP LITE ON AND CHECK ENGINE LITE ON REPLACED GAS CAP. 2 TIMES STILL THE SAME",
        "vin": "1C4BJWDG1HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2020",
        "dateOfIncident": "05/22/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326190,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING IT ON HIGHWAY FOR ABOUT AN HOUR PULLED INTO MY DRIVEWAY AND TEMP FLASHED ON AND I SHUT IT OFF AND THEN IT STARTED SMOKING AND CAUGHT FIRE.   *TR",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "05/18/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325103,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT TURN ON AFTER PUTTING KEY IN THE IGNITION MORE THAN 5-10 TIMES. THE VEHICLES STARTS AFTER MULTIPLE FAILED ATTEMPTS.  *TR",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2020",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321822,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED AND REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 19V018000 (AIR BAGS). THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 20,000. *LN*JB",
        "vin": "1C4BJWEG1HL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317220,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL TIMES, AT LEAST 100 MY STABILITY CONTROL HAS ACTIVATED ON CLEAR DRY ROADS. WHEN THIS HAPPENS AT HIGHWAY SPEED THE VEHICLE TWITCHES SEVERELY AND IT CAN BE DIFFICULT TO STAY IN YOUR LANE ON A DRY ROAD. IF YOU WERE ON A SLIPPERY ROAD IT WOULD LIKELY CAUSE A SLIDE. ALSO WHEN THIS HAPPENS THE VEHICLE SLOWS. I'VE HAD THE STABILITY CONTROL ACTIVATE WHEN MERGING ON THE FREEWAY, MY CAR SLOWED SO MUCH AND SUDDENLY THE CAR BEHIND ME HAD TO BRAKE AND HONKED THEIR HORN. I'VE HAD MY VEHICLE SERVICED AT, AT LEAST 2 DIFFERENT CHRYSLER JEEP DEALERSHIPS 5 DIFFERENT TIMES SO FAR, IT'S STILL NOT FIXED. CURRENTLY, MY VEHICLE IS IN THE SHOP AND IT'S BEEN THERE OVER A WEEK THIS TIME. STILL, NO IDEA WHAT'S CAUSING THE PROBLEM. WHEN THE PROBLEM IS HAPPENING THE WARNING LIGHT ON THE DASH ACTIVES BUT IT DOESN'T STAY ON SO THERE'S NO CODE FOR THE DEALER TO VIEW.",
        "vin": "1C4BJWFG1HL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "02/23/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311321,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IF YOU HIT A BUMP OR POTHOLE THE FRONT END SHAKES VIOLENTLY.",
        "vin": "1C4BJWDG5HL"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/17/2020",
        "dateOfIncident": "12/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309647,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER PARTIALLY WORKING DUE TO CASTING SAND IN ENGINE",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306828,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 17300 MILES THE ABS AND TRACTION CONTROL LIGHTS OF MY CAR TURNED ON, ON MY DASHBOARD.",
        "vin": "1C4BJWDG8HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306200,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF HEAT DUE TO HEATER CORE CLOGGED WITH CASTING SAND FROM ENGINE MANUFACTURER",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW 2017 JEEP WRANGLER MANUAL TRANSMISSION.  THE CAR WILL POP OUT OF REVERSE AND WILL GRIND THE GEARS UNTIL I PUT THE CLUTCH IN OR TAKE IT OUT OF GEAR.  THE DEALER SAID IT WAS THE SHIFTER.  THEY SAID IT HAS BEEN CONFIRMED THAT IS THE ISSUE AND THEY ARE REPLACING UNDER WARRANTY.",
        "vin": "1C4AJWBGXHL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "01/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299768,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED WHILE DRIVING AT APPROXIMATELY 40 MPH, THE BRAKE PEDAL WAS DEPRESSED AND THERE WAS AN ABNORMAL SOUND COMING FROM THE BRAKES. THERE WAS NO WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC TO BE DIAGNOSED. THE CONTACT IS REFERENCED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 18V098000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THIS ISSUE. THE FAILURE MILEAGE WAS 58,000",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/01/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299067,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE MORNING WHEN PUTTING IT INTO REVERSE THE VEHICLE IMMEDIATELY STALLS",
        "vin": "1C4BJWDG4HL"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "01/07/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299108,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S TRACTION CONTROL LIGHT ALARMED AND AUTOMATICALLY APPLIED BRAKES HEAVILY RESULTING IN A NEAR MISS REAR END COLLISION. THE VEHICLE HINDERED THE GAS PEDAL AND I WAS FORCED TO A STOP ON THE MIDDLE OF A HEAVILY TRAVEL ROADWAY.     THE VEHICLE IS STILL UNDER FACTORY WARRANTY. I CALLED CHRYSLER AND MADE AN APPOINTMENT. AFTER 4 DAYS, I WAS TOLD NOTHING IS WRONG WITH MY VEHICLE.",
        "vin": "1C4BJWDG6HL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298283,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 JEEP WRANGLER NEEDS A NEW CLOCKSPRING. BOTH MY 2008 AND 2012 JEEP WRANGLER HAD RECALLS ON THE CLOCKSPRING. WHY IS THERE NOT A RECALL ON THE 2017?",
        "vin": "1C4BJWKG5HL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/04/2020",
        "dateOfIncident": "01/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON INSPECTION OF LEAKING TIRE, IT WAS DISCOVERED THAT THE STEEL RE-ENFORCEMENT WAS PROTRUDING IN TWO (2) LOCATIONS, APPROXIMATELY 8-10\" APART INSIDE TIRE AND OUTSIDE TIRE. TIRE WAS REPLACED WITH SPARE TIRE FOR NOW. GOOD YEAR WRANGLER SR-A 255/75 R17, MANUFACTURED 2017, ORIGINAL TIRE ON 2017 JEEP WRANGLER UNLIMITED, 13,200 MILES. VEHICLE WAS AT DODGE/JEEP DEALER FOR SERVICE ON 02 JAN 2019 WITH TIRE ROTATION - NO MENTIONING OF TIRE ISSUE FROM DEALER. TIRE CHANGED NEXT MORNING IN OUR DRIVE WAY.",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292560,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE JEEP STALLS WHEN I PUT IT IN REVERSE WHEN I FIRST TRY TO MOVE THE VEHICLE IN THE MORNING.",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "08/19/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11291001,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "GEARS POP OUT WHILE IN REVERSE AND GRIND WHEN IN REVERSE  MY JEEP IS COVERED IN RUST AND SOUNDS LIKE IT'S ABOUT TO FALL APART   THE DEALERSHIP ACTUALLY SOLD ME A BRAND NEW RUSTY JEEP THAT THEY REFUSED TO REPLACE  EVEN CHRYSLER IS GIVING ME A HARD TIME. I HAD SEVERAL LEAKS AROUND THE DOORS WINDOW AND THE TOP AND STILL THEY REFUSE AS WELL AS ME AND MY GRANDSON HAVE CUT OUT HANDS ON SHARP EDGES ON ALL THE SEATS AND TWO OF THE REAR SEAT THE SEAT BELTS DON'T WORK",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2019",
        "dateOfIncident": "11/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282597,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HUGE AMOUNT OF OIL LEAKING FROM UNDER VEHICLE.  OIL POOLED WHERE OIL FILTER HOUSING IS LOCATED AND RAN DOWN BACK OF ENGINE ONTO EXHAUST AND TRANSMISSION HOUSING.  THIS IS A FIRE HAZARD TO HAVE HOT OIL LEAKING INTO HOT EXHAUST PIPES.  THIS APPARENTLY IS A KNOWN ISSUE WITH JEEP WRANGLERS AS THE PART IS MADE OF PLASTIC AND CRACKS.  THIS NEEDS TO BE RECALLED.",
        "vin": "1C4BJWDGXHL"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281906,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SURGING. TRIES TO STALL. LOSS OF POWER.",
        "vin": "1C4AJWBG5HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281085,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN JUST STOPS WORKING, IT BASICALLY WORKS WHENEVER IT WANTS TOO. THIS IS THE 3RD HORN I HAVE HAD INSTALLED",
        "vin": "1C4BJWKGXHL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "07/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268292,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR SON WAS DRIVING ON 287 SOUTH IN NEW JERSEY AROUND ON 7-21-2019.  IT WAS A HOT DAY.  HE HAD BEEN DRIVING HOME FROM THE  ADIRONDACK MOUNTAINS FOR ABOUT 3 HOURS AND 15 MINUTES.  HIS SPEED WAS JUST UNDER 70 MPH IN THE MIDDLE LANE WHEN SUDDENLY THE CAR WOULDN'T MAINTAIN ITS SPEED.  THE CAR SLOWED DOWN AND WOULD NOT ACCELERATE, EVEN THOUGH THE ENGINE MADE A SOUND LIKE IT WAS TRYING TO ACCELERATE. THE RED THROTTLE WARNING LIGHT APPEARED ON THE DASHBOARD.  HE  PULLED OVER SAFELY AND STOPPED AND TURNED THE CAR OFF.  HE WAITED ABOUT 10 MINUTES TO START IT AGAIN... WHEN HE TURNED THE ENGINE BACK ON THE RED LIGHT WAS OFF AND HE DROVE HOME SLOWLY IN THE RIGHT LANE WITHOUT INCIDENT.  THE NEXT DAY WE TOOK IT TO THE JEEP SERVICE DEPARTMENT.  THEY TRIED THE VEHICLE SEVERAL TIMES AND COULD NOT IDENTIFY THE PROBLEM, AND WE TOOK IT HOME.  WE ARE SCARED, HOWEVER, TO DRIVE IT ON THE HIGHWAY NOW!",
        "vin": "1C4HJWDG5HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2019",
        "dateOfIncident": "09/24/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267020,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 90KM/H SMOKE CAME FROM UNDER HOOD NEAR WINDSCREEN, ENGINE LIGHT CAME ON, ENGINE RAN ROUGH AND STALLED, PULLED OVER TO HARD SHOULDER, TRIED TO RESTART SEVERAL TIMES, WOULD START AFTER A WHILE BUT WOULD STALL. GOT OUT, WAS ABOUT TO OPEN HOOD WHEN THERE WAS AN EXPLOSION/ FIRE BALL FROM THE ENGINE COMPARTMENT (PRIMARILY UNDER VEHICLE AND FROM WHEEL WELLS.  THE ENGINE COMPARTMENT CAUGHT FIRE, VEHICLE COMPLETELY BURNT OUT.",
        "vin": "1C4HJWEG4HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266119,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHEN THE KEY WAS INSERTED INTO THE IGNITION SWITCH, THE VEHICLE DID NOT START. THE CONTACT PULLED THE KEY OUT OF THE IGNITION SWITCH APPROXIMATELY 20 TIMES BEFORE THE VEHICLE FINALLY STARTED. THE CONTACT STATED THAT THE FAILURE OCCURRED SINCE THE BEGINNING OF AUGUST 2019. THE VEHICLE WAS TAKEN TWICE TO BAYSIDE CHRYSLER JEEP (212-19 NORTHERN BLVD, BAYSIDE, NY 11361) WHERE IT WAS DETERMINED THAT THERE WAS LOW VOLTAGE BATTERY. THE BATTERY WAS RECHARGED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V524000 (ELECTRICAL SYSTEM). THE CONTACT WAS INFORMED TO CALL NHTSA AND FILE A COMPLAINT. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "1C4BJWDG4HL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/27/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265712,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "7 EPISODES OF VIOLENT SHAKING OF THE STEERING WHEEL AND FRONT OF THE CAR WHEN DRIVING ON A HIGHWAY. SLOWING DOWN AND STOPPING THE CAR  WERE THE ONLY SOLUTIONS TO RESOLVE IT. EPISODE #7 WAS SO STRONG THAT THE CAR SHIFTED FROM THE MIDDLE LINE TO THE RIGHT LANE. THE CAR WAS INSPECTED FOR THIS PROBLEM AT JEEP SERVICE IN GLENDALE,CA BUT NO PROBLEMS WITH THE CAR WERE FOUND.",
        "vin": "1C4AJWAG7HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265777,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OVERHEATS HAD TO TAKE IT TO DEALERSHIP UNDER WARRANTY, PROBLEM THEY SAID WAS INTERNAL ENGINE FAILURE, THEY WANT TO REPLACE WITH SAME ENGINE BUT ARE NOT OFFERING WARRANTY IF INCIDENT HAPPENS AGAIN ONLY THE ORIGINAL WARRANTY",
        "vin": "1C4BJWDG8HL"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257542,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DELAYS WHEN STARTING AT TIMES.  NOT ALWAYS.  TURN THE KEY AND WAIT ABOUT 2 SECONDS THEN IT WILL CRANK.      RADIO GOES BLANK AT TIMES.  AFTER POWERING VEHICLE OFF AND ON IT COMES BACK ON.    BIGGEST CONCERN IS THE STEERING AND THE HOOD.  HOOD HAS COME UP ENOUGH TWICE TO BREAK THE BLACK STRAPS THAT HOLD IT DOWN.  AFTER THE 1ST TIME I REPLACED WITH JEEP SUPPLIED REPLACEMENT PARTS BUT IT STILL HAPPENED AGAIN.   LOCAL DEALER WHERE I WENT TO GET PARTS CLAIMS IT'S A REGULAR PROBLEM AND JEEP OWNERS NEED TO JUST DEAL WITH IT.      WHEN DRIVING ABOVE 55MPH FEELS LIKE THE JEEP IS GOING TO JUST COME APART.  GETS VERY LOOSE AND I SLOW BACK TO UNDER 55.  TOOK IT TO MY LOCAL DEALER, NOT WHERE I BOUGHT IT AND THEY CLAIM EVERYTHING LOOKS NORMAL.  SOMETHING IS WRONG, I BROUGHT IT TO ANOTHER DEALER, A TOYOTA DEALER, THEY PLACED IT ON THE RACK AND CLAIM THERE IS TOO MUCH PLAY WITHIN THE STEERING.  THEY DID NOT MAKE ANY CORRECTIONS AS THE RECOMMEND JEEP FIX IT UNDER WARRANTY.  WENT BACK TO JEEP DEALER AND THEY INSPECTED AND CLAIM ALL IS FINE.  TRUTH IS IT IS NOT FINE, IT IS A MAJOR SAFETY CONCERN.  I HAVE DRIVEN MANY JEEPS AND NONE DROVE LIKE THIS ONE.   I REACHED OUT TO A JEEP FORUM AND IT TURNS OUT THIS IS A MAJOR PROBLEM A LOT OF PEOPLE MENTIONED BUT HAVE NOT BEEN ABLE TO GET JEEP TO CORRECT.  MOST PEOPLE CLAIM THEY HAD TO PAY FOR OUT OF POCKET TO GET A BETTER SWAY BAR.  MOST SAY THEY STILL HAVE FACTORY WHEELS AND SUSPENSION, NO ADDED LIFTS.",
        "vin": "1C4BJWDG5HL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/21/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257071,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING MY VEHICLE TO GO AROUND A PARKED CAR APPROACHING A STOP SIGN, I HEARD A SNAP AND FELT SOMETHING BUT I DID NOT KNOW WHAT IT WAS. I LEFT THE STOP SIGN AND AT THE NEXT CURVE, THE STEERING DID NOT WORK PROPERLY, THE TRACTION CONTROL TURNED ON, AND IT FELT LIKE I HAD A FLAT TIRE.  I PULLED OVER AND CHECKED THE VEHICLE, FINDING THAT THE WELD BETWEEN THE TRACK BAR BRACKET AND FRAME HAD BROKEN.  MY VEHICLE IS A STOCK WRANGLER WITH THE STOCK TIRES AND WHEELS, AND IT HAS NOT BEEN OFF ROADING.  I AM THANKFUL THAT I WAS ALONE IN THE VEHICLE AND TRAVELING VERY SLOWLY WHEN THE WELD FAILED.  HAD I BEEN AT HIGHWAY SPEEDS THE RESULTS WOULD HAVE BEEN CATASTROPHIC.  IT DID NOT APPEAR THAT THE WELD HAD MADE PENETRATION INTO THE FRAME, AND THAT IT WAS LIKE THAT FROM THE FACTORY.  I AM AWARE OF THE CURRENT PROBLEMS WITH THE JL WRANGLERS AND THIS WELD, BUT I HAVE NOT SEEN ANYTHING ABOUT 2017 JK VEHICLES.  CHRYSLER HAS WELDED A BRACKET BACK ONTO THE FRAME, BUT I QUESTION THE OTHER WELDS ON THE REST OF VEHICLE AND THE OVERALL QUALITY CONTROL.  I DO NOT FEEL COMFORTABLE WITH DRIVING THE VEHICLE, OR PUTTING MY FAMILY IN IT.  I WORRY ABOUT EVERY BUMP OR TWIST WHEN I AM DRIVING IN THIS JEEP.  I PURCHASED THE VEHICLE NEW AND HAVE LOST CONFIDENCE IN CHRYSLER PRODUCTS.*DT *DT*JB",
        "vin": "1C4BJWDG5HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256323,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE TRACTION CONTROL WARNING INDICATOR ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED FOR THE SAME FAILURE AT CROWN DODGE CHRYSLER JEEP RAM FIAT (2707 SHORTCUT RD, PASCAGOULA, MS 39567, (228) 769-1660), HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 67,000.",
        "vin": "1C4BJWFG5HL"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11255065,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE SWAY BAR AND J-LINK SEPARATED WHILE DRIVING 40 MPH. AS A RESULT, THE VEHICLE VEERED OUT OF CONTROL AND STRUCK A MAIL BOX, FENCE, AND CONCRETE WALL, WHICH CAUSED THE REAR DIFFERENTIAL COVER TO SEPARATE AND LEAK FLUID. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED AND THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD AND FAILED TO STOP THE VEHICLE. THE VEHICLE CAME TO A STOP WHEN IT STRUCK A METER AT A PROPANE DISTRIBUTION CENTER, CAUSING A PROPANE LEAK. POLICE REPORT NUMBER: 201901663 WAS FILED. THE CONTACT SUFFERED INJURIES TO THE FACE AND NOSE, WHICH DID NOT REQUIRE MEDICAL ATTENTION. THE FOLLOWING DAY, THE VEHICLE WAS TOWED HOME, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 11,328. *JS",
        "vin": "1C4BJWCG0HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "08/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254252,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A BRAND NEW 2017 JEEP WRANGLER MANUAL TRANSMISSION 4 WEEKS AGO. THE CAR POPS OUT OF REVERSE AND GRINDS TERRIBLY. WE TOOK IT TO THE DEALER. THEY, AT FIRST, SAID FOR SURE, SOMETHING WAS WRONG. THEN TRIED TO TELL US THAT THAT WAS 'NORMAL' FOR 2017 MODELS. WE DISAGREED AND MADE THEM KEEP DIGGING. AFTER LOOKING AT NUMEROUS COMPLAINTS ON FORUMS ABOUT THE 2017 TRANSMISSIONS POPPING OUT OF REVERSE, THEY FINALLY AGREED SOMETHING IS WRONG. NOW THEY HAVE HAD MY CAR 5 DAYS AND THEY ARE DRIVING IT AND NOW STATE THE PROBLEM IS GETTING WORSE. THE SERVICE DEPARTMENT IS STARING THAT THIS IS A TREND WITH 2017 TRANSMISSIONS. THEY STILL DON'T KNOW WHAT TO DO WITH MY BRAND NEW CAR. I DON'T WANT A NEW TRANSMISSION BECAUSE THE 2017 ARE HAVING THIS ISSUE AND MY BRAND NEW CAR SHOULDN'T HAVE A REBUILT TRANSMISSION IN EITHER. JEEP NEEDS TO DO SOMETHING ABOUT THIS.",
        "vin": "1C4BJWEG4HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2019",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246303,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED A 2015 JEEP WRANGLER AND NOW A 2017 JEEP WRANGLER BOTH OF THEM HAVE HAD RADIATORS THAT LEAK IN THE SAME PLACE ON THE DRIVERS SIDE. THIS IS NOT A CONSIDENCE THERE IS A FACTORY PROBLEM THAT CAUSES THIS.",
        "vin": "1C4BJWDG8HL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "08/22/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246012,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS PARKING IN MY APARTMENT COMPLEX PARKING SPACE,  THE CAR ACCELERATED ITSELF SO DRASTICALLY WHILE I WAS NOT TOUCHING THE GAS PEDAL. I HIT THE BREAK SEVERAL TIMES AND COULD NOT STOP THE ACCELERATION.   THE CAR STOPPED ACCELERATING WHEN I TURNED IT OFF.    THIS WAS A VERY SCARY  EXPERIENCE AS NO ONE EXPECT THE CAR TO ACCELERATE ITSELF.     JUST BY LOOKING AT THE PICTURE YOU CAN NOTICE HOW FAR THE CAR WENT, HOW MUCH DAMAGE IT CAUSED BY THIS STRANGE ACCELERATION AND YOU CAN IMAGINE HOW FAST THE CAR ACCELERATED.",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/17/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244589,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WENT IN FOR A ROUTINE OIL CHANGE IN MARCH OF THIS YEAR. SINCE THEN MY ENGINE LIGHT HAS CONTRIBUTED TO COME ON. I HAVE TAKEN MY VEHICLE TO THE DEALERSHIP I PURCHASED THE NEW VEHICLE FROM TO FIGURE OUT THE ISSUE FIVE TIMES OVER THE COURSE OF THIS SUMMER. THEY HAVE CLAIMED TO REPAIR COMPONENTS OF THE VEHICLE, YET THE LIGHT IS STILL ON. I DO NOT FEEL SAFE DRIVING IN A VEHICLE THAT A SERVICE DEPARTMENT CAN NOT FIGURE OUT WHAT'S GOING ON.",
        "vin": "1C4BJWEG0HL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/17/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244628,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BACKING UP MY JEEP AND PLACING IT IN DRIVE I NOTICED MY STABILITY CONTROL LIGHT CAME ON AND MY JEEP STOPS.",
        "vin": "1C4BJWEGXHL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244469,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY VEHICLE TO GET AN OIL CHANGE AND THE DEALERSHIP RETURNED MY VEHICLE BACK WITH OUT 2 TIRE BOLTS IN THE FRONT LEFT TIRE",
        "vin": "1C4AJWAGXHL"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240537,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: AIRBAGS DIDN'T DEPLOY IN FRONT IN ACCIDENT. FRONT DIVERS SIDE, ENOUGH DAMAGE TO BREAK TIE ROD INHALF BUT AIR BAGS DIDN'T DEPLOY.",
        "vin": "1C4AJWAG9HL"
    },
    {
        "components": "VEHICLE SPEED CONTROL,TRACTION CONTROL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/18/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING APPROXIMATELY 50 MPH, THE ABS AND TRACTION CONTROL ICONS ILLUMINATED ON THE INSTRUMENT PANEL AND THE VEHICLE STARTED TO LOSE SPEED. THE BRAKE PEDAL WAS DEPRESSED AND TRAVELED ALL THE WAY TO THE FLOORBOARD. THE CONTACT CONTINUED DRIVING TO THEIR DESTINATION. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING; HOWEVER, AN APPOINTMENT WAS SCHEDULED WITH TRONCALLI CHRYSLER JEEP (818A ATLANTA RD, CUMMING, GA 30040). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 43,000.",
        "vin": "1C4AJWAG5HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231772,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING NORTHBOUND ON A 2 LANE HIGHWAY GOING 60MPH. AN 18 WHEELER PASSED ME GOING THE OPPOSITE DIRECTION. THE RESULTING BLAST OF WIND FORCED MY HOOD OPEN WHICH SLAMMED BACK INTO MY WINDSHIELD CAUSING A SERIOUS INCIDENT. THE LEFT RUBBER STRAP BROKE IN HALF. THE CENTER LATCH FAILED TO SECURE THE HOOD. THE RIGHT STRAP BROKE WHERE IT ATTACHES TO THE JEEP FENDER. *DT *BF*JB",
        "vin": "1C4BJWCG6HL"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/08/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11230028,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING APPROXIMATELY 40 MPH, THE FRONT END OF THE VEHICLE SUDDENLY STARTED TO DRIFT AND CAUSED THE DRIVER TO LOSE CONTROL OF THE STEERING. AS A RESULT, THE CONTACT CRASHED INTO A METAL FENCE POST. THE STEERING BECAME INOPERABLE AFTER THE CRASH AND THE AIR BAGS DID NOT DEPLOY. THE DRIVER AND FACIAL CONTUSIONS. MEDICAL ATTENTION WAS NOT RECEIVED. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO COTTAGE GROVE CHRYSLER (2800 ROW RIVER RD, COTTAGE GROVE, OR 97424) TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 11,324.  *BF  *TR",
        "vin": "1C4BJWCG0HL"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/30/2019",
        "dateOfIncident": "06/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228487,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS THE TRACTION CONTROL SYSTEM, ANTI-SKID BRAKING SYSTEM, AND OR THE COMBINED OPERATION OF THESE SYSTEMS FOR STABILITY CONTROL, ENGAGED INTERMITTENTLY AND UNEVENLY CAUSING THE VEHICLE TO PULL TO ONE SIDE OR THE OTHER.  THIS HAS OCCURRED APPROXIMATELY FIVE TIMES UNDER THREE DIFFERENT DRIVERS ALL AT NORMAL HIGHWAY SPEED AND UNDER DRY ROAD CONDITIONS.  WHEN THIS HAPPENED, THERE WAS AN AUDIBLE NOISE (LIKE A VIBRATION SOUND) OF THE BRAKES BEING AUTOMATICALLY APPLIED AND A PULSING IN THE BRAKE PULL.  THE SYSTEM HAS ENGAGED ITSELF WHILE THE GAS PEDAL WAS BEING APPLIED AT HIGHWAY SPEED ON DRY PAVEMENT.  IMMEDIATELY UPON THE SYSTEM'S APPLICATION I MOVED MY GAS PEDAL FOOT TO THE BRAKE WHERE AS I APPLIED THE BRAKES I COULD FEEL THE PULSING IN THE PEDAL.    THIS SITUATION IS AN EXTREME SAFETY HAZARD.  WHEN IT OCCURS IT BOTH STARTLES THE DRIVER AND CAUSES THE VEHICLE TO SWERVE TO ONE SIDE OR THE OTHER.  THE SYSTEM IS DEFINITELY APPLYING UNEVEN BRAKING TO THE WHEELS TO CAUSE THE SWERVING.  WE HAVE DISENGAGED THE TRACTION CONTROL SYSTEM IN ORDER TO DRIVE THE JEEP IN A SAFE MANNER.  HOWEVER, IT REQUIRES THE DRIVER TO DISENGAGE EVERY TIME YOU START THE VEHICLE.  AT PRESENT EACH DEALER HAS BEEN NONRESPONSIVE IN TAKING ACTION TO CORRECT THIS VEHICLE PROBLEM, THE VEHICLE IS STILL UNDER WARRANTY.  EACH TIME THEY SAY THAT THEIR DIAGNOSTIC SYSTEM IS NOT INDICATING ANY PROBLEMS.",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "05/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222960,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP WRANGLER SAHARA UNLIMITED SMOKY MOUNTAIN 27000 BAD DRIVESHAFT. NO REPLACEMENT PART FOUND JEEP HAS BEEN AT THE DEALERSHIP FOR 35 DAYS AND NOONE CAN TELL ME WHEN THE PART IS GOING TO BE IN.",
        "vin": "1C4BJWEG9HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/22/2019",
        "dateOfIncident": "06/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221866,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PIN HOLDING THE BRAKE PEDDLE TO THE FIREWALL CAME LOOSE AFTER A ECLIP ON ONE END OF PIN FELL OUT. THIS HAPPED WHILE I WAS PULLING INTO A PARKING SPOT.",
        "vin": "1C4BJWDG9HL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219744,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 2 YEARS, THERE IS AN OIL LEAK AROUND THE OIL PUMP WHICH POSES A FIRE HAZARD.",
        "vin": "1C4BJWDG7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2019",
        "dateOfIncident": "05/09/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218494,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, WITH KEY IN THE IGNITION BUT NOT STARTED, A FIRE STARTED UNDERNEATH THE FRONT PASSENGER'S SEAT. THE FIRE DEPARTMENT WAS CONTACTED AND WAS ABLE TO EXTINGUISH THE FIRE. A FIRE REPORT WAS NOT FILED. ADDITIONALLY, THERE WERE TWO OTHER SEPARATE OCCASIONS WHERE THERE WERE FIRES INDEPENDENTLY STARTED IN THE CABIN OF THE VEHICLE. THE SECOND AND THIRD FIRES STARTED UNDER THE REAR PASSENGER SEAT AND BEHIND THE GLOVE BOX RESPECTIVELY. THE FIRE DEPARTMENT WAS AGAIN CONTACTED AND WAS ABLE TO EXTINGUISH THE FIRES HOWEVER, THE MATTER WAS TURNED OVER TO THE POLICE DEPARTMENT TO BE INVESTIGATED AS A POSSIBLE INSURANCE FRAUD CLAIM. THE INSURANCE COMPANY ALSO HIRED A THIRD PARTY INVESTIGATOR TO DETERMINE WHETHER OR NOT THE FIRES WERE BEING SET DELIBERATELY. THE BATTERY TERMINALS WERE DISCONNECTED AFTER THE SECOND FIRE. INCIDENTALLY, WHILE THE FIRES WERE BEING INVESTIGATED AT THE INDEPENDENT MECHANIC FACILITY, THE INVESTIGATOR ALONG WITH THE ADJUSTER FROM STATE FARM INSURANCE EXPERIENCED THE FIRE UNDER THE GLOVE BOX SEVERAL SECONDS AFTER THE BATTERY TERMINALS WERE RECONNECTED. THE MECHANIC WAS ABLE TO EXTINGUISH THE FIRE. THE VEHICLE WAS NOT REPAIRED. THOMAS GARAGE LOCATED AT 67791 MALL RD, ST CLAIRSVILLE, OH 43950, (740) 480-1138, WAS CONTACTED BY PHONE AND NOTIFIED OF THE INCIDENT OF THE FIRST FIRE. THE MANUFACTURER WAS NOTIFIED BY THE THIRD PARTY INVESTIGATOR OF THE FAILURES IN THE VEHICLE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.  SEE ALSO 11210791. *DSY",
        "vin": "1C4AJWAG4HL"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217330,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M UNABLE TO GET MY JEEP IN REVERSE A LOT OF THE TIME AND THE GEARS ARE CONSTANTLY GRINDING BEING THAT I PAID AN ADDITIONAL IN UPGRADED TRACK. MISREPRESENTATION FROM THE DEALERSHIP( GWINNETT DODGE JEEP RAM) THEY ALTERED MY PAPERWORK AND COMMITTED FRAUD.  MY JEEP I PURCHASED BRAND NEW IS COVERED IN RUST AND I'VE SUBMITTED  WARRANTY TWICE. THEY KEEP DELETING  ACTUAL INFORMATION FROM OTHER DEALERSHIPS THAT HAVE  REPORTED THE RUST OXIDATION PROBLEM.   THIS JEEP IS DANGEROUS I'VE CUT MY HAND SEVER TIMES ON THIS JEEPS SEATS BECAUSE OF THE ROUGH EDGES FROM FACTORY WHERE THEY CUT TO FIT IN MY JEEP. SO ROUGH THAT MY GRANDSON GRABBED HIS BALL AND THE SEAT GASHED HIS HAND AS WELL. THIS JEEP SHAKES SO MUCH WHEN DRIVING OVER 50 AT TIMES. AS WELL IT IS VERY LOUD WHEN ON THE HWY. THE SOFT TOP ON MY JEEP SEEMS LIKE IT MAY BE TO BIG AND THE EXTREME SHAKING IS VERY LOUD SCARY WHEN DRIVING ON HWY. MY GRANDSON AND I ARE MOSTLY IN THIS JEEP AND WE GET HURT FROM THE DESIGN OF THE SEATS.  THIS IS COVERED IN EXCESSIVE RUST.  THE GEARS ARE NOT SAFE AND NEVER ABLE TO GO INTO REVERSE.  THIS JEEP IS NOT SAFE TO HAVE. IF YOU REACH UNDER THE SEAT YOU WILL DEFINITELY GASH YOUR HANDS OPEN. THE ACTUAL DEAL SHIP IS FRAUD.  THE ENGINE ON MY JEEP AND THE SPEAKERS INSTALLED IN MY JEEP ARE NOT THAT OF WHAT IS ON THE WINDOW STICKER AND I DO HAVE MY ORIGINAL WINDOW STICK STILL. . EVERYTHING I'VE DONE IT GETS BLOCKED SOMEHOW AND CHRYSLER WILL NOT DO ANYTHING. EVERYTHING IS EITHER BEEN DELETED FROM THEIR SYSTEM. I'VE REPORTED THIS ISSUE WHEN DISCOVERING IT AS WELL AS IN THE ROOF OF MY JEEP ALONE NEW AT THAT FINDING ABOUT 10 LEAKS OVER A YEAR AGO. I HAVE NO CARPET AND MY JEEP SMELLS LIKE THE SWAMP. THEY WILL EVENTUALLY HEAR MY STORY BECAUSE I WILL NEVER GIVE THIS UP AND ACCEPT THIS.   MY GRANDSON IS ONLY 3AND HE HAS HURT HIMSELF ON THIS JEEP A FEW TIMES AS WELL",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "05/10/2019",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210791,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER WAS DRIVING THE VEHICLE WHEN SMOKE EMANATED FROM FRONT PASSENGER SEAT.  SHE PULLED OVER AND CALLED 911.  UPON EXTINGUISHING FIRE, IT WAS DISCOVERED THAT FIRE WAS CAUSED BY THE WIRING TO THE AIR BAG SEAT SENSOR.  FCAU PUT ON NOTICE, SEE ALSO ODI 11218494.  *DSY*JB *DT*JB *DT  CONSUMER STATED TO HIS KNOWLEDGE, VEHICLE WAS NOT REPAIRED.    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "1C4AJWAG4HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2019",
        "dateOfIncident": "03/25/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194860,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE VEHICLE FAILED TO START ON MULTIPLE OCCASIONS. THE VEHICLE WAS TAKEN TO GETTEL CHRYSLER DODGE JEEP RAM (2323 TAMIAMI TRAIL, PUNTA GORDA, FL 33950), BUT THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 18V524000 (ELECTRICAL SYSTEM). THE APPROXIMATE FAILURE MILEAGE WAS 10,300.",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194278,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DOES NOT START AT TIMES. ALL ELECTRICAL COMES ON BUT THE CAR DOES NOT START,CLICK OR TURNOVER AT ALL. HAPPENS INTERMITTENTLY",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193765,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE SHOOK VIOLENTLY AND FAILED TO SHIFT INTO REVERSE. ADDITIONALLY, THE DRIVER'S SIDE DOOR WAS RUSTED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO GWINNETT CHRYSLER DODGE JEEP RAM (5054 GA-78, STONE MOUNTAIN, GA 30087, (404) 492-6831) WHERE IT WAS DIAGNOSED THAT THE VEHICLE WAS RUSTED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO MIKE PATTON CHRYSLER DODGE JEEP RAM (1408 LAFAYETTE PKWY, LAGRANGE, GA 30241, (706) 882-0600) WHERE IT WAS DIAGNOSED THAT THERE WAS OXIDATION IN THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TAKEN TO LANDMARK DODGE CHRYSLER JEEP RAM (6850 MT ZION BLVD, MORROW, GA 30260, (770) 968-4900) WHERE IT WAS DIAGNOSED THAT THERE WAS CORROSION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 16,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "12/27/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192850,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING WRONG WITH MY VEHICLE, THIS IS THE ONLY WAY I SAW TO FILE A COMPLAINT. PLEASE DO SOMETHING ABOUT THE LED HEADLIGHTS BEING USED IN SO MANY VEHICLES TODAY.  AS YOU CAN SEE, I DRIVE A HIGH PROFILE VEHICLE, SO IT HAS NOTHING TO DO WITH VEHICLES SITTING HIGHER THAN MINE.  THE LIGHTS ARE MUCH MORE DANGEROUS TO ONCOMING TRAFFIC THAN THE \"BLUE\" LIGHTS THAT WERE BANNED SEVERAL YEARS AGO.  THE GLARE FROM THESE LIGHTS IS EXTREMELY DANGEROUS ESPECIALLY ON SMALL, RURAL ROADS WHICH MAKE UP THE MAJORITY OF THE ROADS WHERE I LIVE AND TRAVEL.  NHTSA IS REALLY DROPPING THE BALL ON SAFETY IF YOU LET THESE TYPES OF LIGHTS CONTINUE TO BE USED IN THE CONFIGURATION THEY ARE TODAY.  THESE LIGHTS ARE GOING TO LEAD TO NUMEROUS ACCIDENTS, AND MANY WILL BE FATAL, IF THEY HAVEN'T ALREADY.  DOES SOMETHING CATASTROPHIC HAVE TO HAPPEN BEFORE SOMETHING IS DONE TO CORRECT THIS PROBLEM?",
        "vin": "1C4BJWDG1HL"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193256,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTANTLY POPS A CHECK ENGINE LIGHT AND TRACTION CONTROL LIGHT COMES ON GOES INTO LIMP MODE. STALLS NO LIGHT. SAME EXACT PROBLEM WE HAD WITH 2015 WRANGLER. IF WE TAKE IT TO THE DEALER THEY CANT GET IT TO REPLICATE PROBLEM. GARBAGE",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "02/21/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192329,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN DRIVE AND MY FOOT ON THE BRAKE IN TRAFFIC ON THE HIGHWAY, MY VEHICLE BEGAN CREEPING FORWARD. I PRESSED FIRMLY ON THE BREAK AND THERE WAS NO CHANGE IN MOVEMENT. THE VEHICLE KEPT ROLLING FORWARD. I PUT IT IN PARK AND NO CHANGE. I TURNED OFF THE VEHICLE AND TURNED IT BACK ON. THE VEHICLE THEN STOPPED, ALMOST HITTING THE CAR IN FRONT.",
        "vin": "1C4BJWDG6HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2019",
        "dateOfIncident": "03/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190927,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING OUT OF DRIVEWAY AND JEEP SHUT COMPLETELY DOWN.  I RESTARTED IT, CONTINUED BACKING UP AND JEEP SHUT OFF AGAIN.  PUT IT IN DRIVE AND DROVE 20 MILES.  ARRIVED AT MY DESTINATION, IN PARKING GARAGE, AND JEEP SHUT COMPLETELY DOWN FOR THE THIRD TIME AND THIS TIME IN DRIVE.  I HAD IT TOWED TO THE DEALERSHIP WHO ARE UNABLE TO REENACT IT AND AREN'T GETTING ANY CODES.",
        "vin": "1C4BJWEG5HL"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186030,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE BODY OF THE JEEP HAS RUST CORROSION INSIDE AND OUT  THE GEARS ALWAYS GRIND ESPECIALLY IN REVERSE   SEATBELTS ARE NOT WORKING IN REAR SEATS  DEALSHIP SAYS THEY CAN'T HELP ME FIX THE ISSUE. THEY DID A LEAK TEST AND FOUND SEVERAL LEAKS THROUGHOUT THE JEEP.   I CURRENTLY HAVE NO CARPET DUE TO THE OFF AND ON LEAK ISSUES. AND THE SMELL IS SO BAD I CAN'T DRIVE THE JEEP.   I HAVE A THREE YEAR OLD GRANDSON AND I'M SCARED TO TAKE A TRIP WITH HIM. I FEEL THIS PARTICULAR JEEP IS UNSAFE IN SEVERAL WAYS.",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/11/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11185898,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELTS WERE DAMAGED BY SEAT ADJUSTING ENOUGH AT 20K MILES TO WARRANT REPLACEMENT BY JEEP. NOW, AFTER 1 YEAR, THE PASSENGER BACK SEAT IS FRAYED AT LEAST 1.6 CM INTO THE BELT, CAUSED BY THE SAME THING. EVEN THOUGH VEHICLE WAS PURCHASED WITH THE DAMAGED SEAT BELT A MONTH AGO, JEEP WILL NOT REPLACE THE DAMAGED BELT.",
        "vin": "1C4BJWFG4HL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/26/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 11182545,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2017 JEEP WRANGLER. WHILE DRIVING APPROXIMATELY 40 MPH, THE CONTACT'S VEHICLE CRASHED INTO ANOTHER VEHICLE THAT MADE A WRONG TURN. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT AND THREE PASSENGERS IN THE CONTACT'S VEHICLE SUSTAINED INJURIES THAT REQUIRED MEDICAL ATTENTION. THE CONTACT'S VEHICLE WAS TOTALED AND TOWED AWAY. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS APPROXIMATELY 11,000. *DT *JB *DT",
        "vin": "1C4BJWDG1HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/19/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181716,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2017 JEEP WRANGLER WOULD RANDOMLY SHUT OFF, AFTER SEVERAL DAYS AT THE SHOP THEY DETERMINED FROM THE NATIONAL DATABASE MY TRANSMISSION IS SHOT !!",
        "vin": "1C4BJWDG4HL"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "08/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181400,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS PRE OWNED VEHICLE AND IT HAS BEEN A SAFETY ISSUE. IT HAS ABRUPTLY STOPPED IN THE MIDDLE OF AN INTERSECTION AND HIGHWAY 4 TIMES SINCE PURCHASE DATE. IT IS A LIFE THREATENING, HAZARDOUS VEHICLE AND I'M TERRIFIED FOR MY SAFETY.*DT",
        "vin": "1C4BJWEG9HL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181446,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I HIT A BUMP (RANGING FROM SMALL POT HOLE TO LARGER POT HOLE) ON THE HIGHWAY GOING 60+ MPH, MY CRUISE CONTROL WILL SHUT OFF BY ITSELF. SPEED DECELERATES VERY QUICKLY AND I HAVE TO GET IT UP TO SPEED QUICKLY TO AVOID GETTING REAR ENDED. THIS HAS BEEN HAPPENING FOR JUST OVER A YEAR AND IT HAPPENS EVERY TIME I HIT ANY KIND OF SMALL BUMP AT AN ACCELERATED SPEED. STARTED HAPPENING AROUND 5000 MILES ON JEEP AND STILL DOES IT AT 17000 MILES.",
        "vin": "1C4BJWDG0HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180284,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BRIEFLY LOSES POWER AND ENGINE TEMPORARILY TURNS OFF WHILE DRIVING. SOMETIMES THIS OCCURS WITHIN 1 SECOND TOTAL, AND IS BARELY NOTICED. HOWEVER, TODAY IT OCCURRED FOR NEARLY 5-10 SECONDS, AND I WAS ALMOST REAR-ENDED IN TRAFFIC DUE TO IT. VEHICLE WAS IN MOTION, IN THE CITY, ON A MAJOR STREET, DRIVING STRAIGHT WITHOUT ANY HAZARDS OR EXTREME WEATHER CONDITIONS. HAS OCCURRED OVER 20 TIMES SINCE PURCHASING VEHICLE APPROXIMATELY ONE YEAR AGO. VEHICLE WAS PURCHASED NEW.",
        "vin": "1C4BJWDG4HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/11/2019",
        "dateOfIncident": "02/03/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11176409,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP WAS PARKED IN MY DRIVEWAY AND WHEN WE HAD A STORM ON FEB 1 THRU FEB 3, 2019 AND I ENTER MY JEEP AFTER THE 3 DAY STORM THE DRIVER SIDE FLOOR WAS IN 3 INCHES OF WATER AND TOTALLY FLOODED. I GOT TOWELS AND  SOAKED THE WATER UP. THEN WE HAD ANOTHER STORM TO COME IN ON FEB 4 AND 5, 2019 AND I PARK MY CAR FACING THE OTHER WAY IN DRIVE WAY AND AGAIN AFTER THE 2 DAY STORM MY JEEP WAS FLOODED AGAIN ON DRIVER FRONT FLOOR ABOUT 2 INCHES. WHEN I TOOK MY CAR TO DEALERSHIP WORKER AND RENTAL EMPLOYEE WHO I WAS TELLING THE STORY TOO SAID OH YOU MUST DRIVE A  WRANGLER . THAT IT HAPPENS ALL THE TIME. MY BIG CONCERN IS THAT I COULD SMELL MODE. WHEN I WENT BACK A FEW DAYS LATER A SERVICE REP WAS ON THE PHONE WITH ANOTHER  CUSTOMER WHO WAS SETTING UP AN APPOINTMENT FOR THE SAME ISSUE. THEY ARE FIXING THE RUBBER AROUND THE DOOR FOR DEFECTS AND CHANGING CARPET. BUT I FEEL THEY SHOULD BE RECALLING THE  VEHICLE I ONLY HAVE HAD IT FOR 19 MONTHS.",
        "vin": "1C4BJWDG8HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2019",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173796,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST START OF THE DAY. WEATHER COLD. UPON SHIFTING INTO REVERSE THE ENGINE SPEED DROPS DRAMATICALLY TO THE POINT OF STUMBLING / STALLING. STALLING OCCURS APPROXIMATELY 20% OF THE TIME.",
        "vin": "1C4GJWAG8HL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/18/2019",
        "dateOfIncident": "01/16/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11170716,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A VEHICLE THAT CROSSED IN FRONT OF ME. MY DRIVER FRONT BUMPER HIT THEIR PASSENGER FRONT BUMPER. MY AIR BAG DID NOT INFLATE. MY SPEED WAS APPX. 45 MPH. *DSY *DT*JB",
        "vin": "1C4AJWBG0HL"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "04/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166395,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 04/28/2018 I WENT OFF ROADING TO MY FAVORITE TRAIL. THE JEEP WAS STATIONARY UNTILTHE CAR STARTD TO SLOWLY MOVE WHILE IT WAS ON PARK. IN AN ATTEMPT TO BREAKS AND STEER AWAY FROM THE WATER THE TRUCK STEERING AND BREAK  WASN'T RESPONDING TO EITHER DIRECTION. TOOK POLICE ENFORCEMENT A WHILE TO RESPOND AND AS THEY ARRIVE THE TIDE TOOK THE VEHICLE AND SUBMERGED ALL THE WAY TO THE FLOOR BOARD",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2019",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165164,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON EXTENDED HIGHWAY DRIVING JEEP LOOSES POWER SUDDENLY AND SLOWS TO A STOP.  ONCE STOPPED, THE VEHICLE MUST KEYED ON/OFF SEVERAL TIMES TO RESUME NORMAL DRIVING.  THIS HAS HAPPENED THREE TIMES, AND EACH TIME IT HAS BEEN ON EXTENDED INTERSTATE TRIPS OVER 3+ HRS.    NO CEL CODES HAVE BEEN THROWN SO THE DEALER HAS NOT TAKEN THE PROBLEM SERIOUSLY.   I'M NOT EVEN SURE THE DEALERSHIP HAS EVEN DISCUSSED THE PROBLEM WITH JEEP TECHNICAL SUPPORT.  WE ARE UNSURE WHAT TO DO WITH THE VEHICLE AS WE DO NOT TRUST TO TAKE IT FOR ANY TYPE OF TRIP.  IT HAS BEEN TO THE DEALER FOR MANY OTHER ISSUES UNDER WARRANTY AND I WONDER IF THEY ARE ALL RELATED SOMEHOW VIA AN ISSUE WITH THE ENGINE COMPUTER OR ELECTRICAL SYSTEM.",
        "vin": "1C4BJWFG6HL"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "12/04/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165364,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AC COMPRESSOR FAILURE AND BAD TRANSMISSION. LEAKING ANTIFREEZE",
        "vin": "1C4BJWDG8HL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11164740,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STRUCK ON FRONT PASSENGER SIDE DOOR BY VEHICLE THAT RAN A RED LIGHT. NO AIRBAGS DEPLOYED, HOWEVER MAJOR DAMAGE WAS DONE TO VEHICLE, POSSIBLY TOTALED. DRIVER WAS ALSO INJURED IN CHEST AREA. *DT  *TR",
        "vin": "1C4BJWDG6HL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/25/2018",
        "dateOfIncident": "12/25/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163373,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKED IN DRIVEWAY, SHORTLY AFTER STARTING THE JEEP, IT BARN TO SMOKE FROM UNDER THE VEHICLE AND FUEL BEGAN TO LEAK ON DRIVEWAY.",
        "vin": "1C4BJWFG1HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "05/18/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156532,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING APPROXIMATELY 60 MPH, A LOUD BANGING AND WRENCHING NOISE SUDDENLY OCCURRED AND THE VEHICLE BEGAN TO SHAKE VIOLENTLY FROM SIDE TO SIDE. THE DRIVER COULD ALSO FEEL HEAT COMING FROM THE FLOOR OF THE VEHICLE. AFTER STOPPING THE VEHICLE, A TOW TRUCK WAS CALLED TO THE SCENE. UPON INSPECTION, IT WAS DISCOVERED THAT THE DRIVESHAFT HAD SEVERED, SEPARATED FROM THE STEEL ENCASEMENT, AND EXPLODED THROUGH THE FLOOR OF THE VEHICLE. THE FAILURE CAUSED A HOLE IN THE FLOORBOARD. THE VEHICLE WAS TOWED TO TEXAN CHRYSLER DODGE JEEP RAM (18555 HWY 59 N., HUMBLE, TX 77338). THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 17,700.",
        "vin": "1C4BJWFG7HL"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/05/2018",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156428,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING HOME FROM LUBBOCK AT POSTED SPEEDS OF 70 AND 75 MPH MY HOOD STARTED TO FLUTTER AND JUMP.  I WAS ON 2 LANE ROADS AND IF A TRACTOR TRAILER PASSED ME THE HOOD WOULD ACTUALLY RAISE UP.  I PULLED OVER AT A CONVENIENCE STORE AND CHECKED TO ENSURE MY HOOD STRAPS WERE ON AND THAT THE HOOD WAS CLOSED AND IT WAS.  I TOOK MY JEEP TO THE DEALERSHIP AND THEY SAID THAT THE HOOD IS WAY OUT OF ALIGNMENT, WAY OUT OF FACTORY SPECS HOWEVER THEY CANNOT FIX IT BECAUSE THEY DON'T HAVE A FRAME STRAIGHTENER (MY TERM NOT THEIRS).  THE DEALERSHIP ALSO TRIED TO BLAME IT ON A FENDER BENDER WHERE THE FRONT PLASTIC BUMPER GUARD IS DENTED IN AND I TOLD THEM THAT HAPPENED IN THE PROCESS OF PARKING AND BELOW 10 MPH.    THE DEALERSHIP ALSO FOUND MY DRIVER'S SIDE DOOR OUT OF ALIGNMENT WHICH WAS LEAKING ALONG WITH THE PASSENGER SIDE DOOR, FRONT WINDOW AND ROOF HOWEVER THESE WERE LEAKING BEFORE THE FENDER BENDER.  THERE IS ALSO A RATTLE IN MY DRIVER'S SIDE BACK DOOR THAT THE DEALERSHIP CANNOT SEEM TO HEAR THEREFORE CANNOT FIX.  I PULL OUT OF THE DEALERSHIP AND HEAR IT RIGHT AWAY!",
        "vin": "1C4BJWDG1HL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/30/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154890,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OEM LED HEADLIGHTS ARE USELESS WHIL DRIVING AT NIGHT DURING A SNOW STORM. IF I HAD NOT HAD ADDITIONAL HALOGEN LIGHTS I COULD NOT HAVE GONE ANYWHERE SAFELY. IN THE ATTACHED PHOTOS THE HEADLIGHTS ARE ON HIGH-BEAM AND HAD BEEN DURING MY 10 MILE DRIVE HOME FROM WORK.",
        "vin": "1C4HJWCGXHL"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/06/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149738,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. THE CONTACT STATED THAT THE REAR WINDSHIELD WIPER NOZZLE WAS FRACTURED AND ALLOWED WATER TO BE SQUIRTED INSIDE THE VEHICLE. AS A RESULT, THE REAR WINDSHIELD WIPER DID NOT CLEAR THE WINDSHIELD. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 47,000.",
        "vin": "1C4BJWFG9HL"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "10/23/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142441,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2017 JEEP RUBICON OFF ROAD, IN THE MIDDLE OF AN OBSTACLE, THE STEERING WHEEL BECOMES FROZEN.  WITH ALL MY MIGHT I CAN NOT TURN THE STEERING WHEEL.  I WAS SLOWLY ROLLING BACK DOWN OFF AN OBSTACLE,  THE FRONT AND REAR AXLES WERE LOCKED.  AS I BACKED UP THE DRIVERS SIDE FRONT WHEEL STARTED TO GET LIGHT SO I WAS TRYING TO STEER SO THE JEEP LEVELED BACK OUT, BUT WITH ALL MY MIGHT THE STEERING WHEEL WOULD NOT MOVE AND BEFORE I NEW IT THE JEEP WAS LAYING ON ITS PASSENGER SIDE.   THE STEERING LOCKING IN THIS MANNER HAS HAPPEN THREE TIMES IN MY NEW RUBICON AND ALSO HAPPENED IN MY 2003 RUBICON.  I UNDER STAND THE STEERING BEING HARD OR BEING ERRATIC WITH THE FRONT BEING LOCKED, BUT TO NOT BE ABLE TO MOVE THE STEERING WHEEL AT ALL EVEN WHEN THE TIRES ARE ROLLING DOES NOT SEEM RIGHT.  IS THIS A FACTORY DEFECT OR BAD ENGINEERING ON JEEPS BEHAVE?",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2018",
        "dateOfIncident": "10/06/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138894,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PURCHASED USED 09-09-18  1ST STALL 09-25-18 DEALER SERVICED AND ONLY FOUND A COMPUTER UPDATE WAS NEEDED.  CAR PICKED UP FROM DEALER AFTER 1ST REPAIR ON 10-05-18.    WE PICKED UP THE CAR ON 10-05-18 & DROVE IT HOME AND IT WASN'T UNTIL THE NEXT DAY WHEN THE 2ND STALL OCCURRED. SAME EXACT THING BUT THIS TIME WE WERE ON A BUSY STREET AND COULD HAVE BEEN IN AN ACCIDENT.    2ND STALL INCIDENT WAS ON 10-06-18 EARLY AFTERNOON I WAS ON WAS DRIVING THE VEHICLE AND IT STARTED TO MAKE THIS WEIRD NOSE LUCKILY I WAS ALMOST HOME SO I CAME TO STOP TO MAKE A LEFT TURN AND WAITED FOR TRAFFIC TO CLEAR AS I LET GO OF THE BRAKE AND PRESSED THE GAS TO ACCLERATE THE CAR STALLED WOULDNT MOVE OR GO FORWARD. I THEN TRIED TO SEE IF IT WOULD GO IN REVERSE AND CHANGED GEARS BUT IT WOULDN'T THIS TIME THERE WAS NO ERROR OF \"VEHICLE NOT IN PARK\" THE VEHICLE JUST WOULDNT MOVE, GO FORWARD EVEN THOUGH IT WAS IN DRIVE AND I WAS STUCK ON A BUSY STREET WAITING FOR TRAFFIC TO CLEAR TO MAKE A LEFT TURN.  I THANK GOD IT DIDNT GO FORWARD JUST A LITTLE CAUSE IT COULD HAVE BEEN FATAL. I THEN TRIED SHUTTING OFF THE CAR TO SEE IF I COULD BE GET IT TO MOVE AND PUT IT BACK TO DRIVE AND IT STILL WOULDN'T ACCELERATE. I HAD TO SHUT IT OFF A COUPLE OF TIMES BEFORE I WAS ABLE TO DRIVE. THERE WAS A RECALL ON OTHER 2017 VEHICLES FOR AN ELECTRICAL SYSTEM:WIRING:FRONT UNDERHOOD WHERE THE POWERTRAIN CONTROL MODULE MAY BE EQUIPPED WITH A VOLTAGE REGULATOR CHIP IN THE CIRCUIT BOARD THAT MAY FAIL, CAUSING A STALL OR A NO START CONDITION. CAN YOU PLEASE CHECK IF THIS IS SIMILAR BECAUSE WE JUST PICKED UP THE VEHICLE ON 10-05-18 AFTER NOTHING WAS FOUND WRONG AND ONLY A COMPUTER UPDATE WAS DONE. WE HAD THE CAR FOR A DAY AND IT IS ON ITS WAY BACK TO ONTARIO JEEP TO SEE IF THEY CAN FIND OUT WHATS WRONG. PLEASE ADVISE WHAT COULD BE DONE.",
        "vin": "1C4BJWDG6HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11133265,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSISTENTLY \"SPONGY BRAKES\" HAVING CONTINUED DECREASED STOPPING ABILITY FOR 6 MONTHS AFTER PURCHASE.  ON 06/05/2018 HAD BRAKES INSPECTED BY DEALERSHIP AND TOLD THEY WERE FINE.  ON 06/14/2018 VEHICLE WAS AT A COMPLETE STOP AT DRIVE-THRU RESTAURANT WITH BRAKE PEDAL COMPLETELY ENGAGED AND VEHICLE MOVED AND ROLLED FORWARD INTO THE VEHICLE IN FRONT, CAUSING DAMAGE.  UNAWARE OF A PROBLEM THINKING IT WAS DRIVER ERROR EVEN THOUGH DRIVER STATED \"FOOT WAS ON BRAKE THE WHOLE TIME\" THE VEHICLE SUSTAINED MINIMAL DAMAGE AND WAS CONTINUED TO BE DRIVEN.  ON JULY 7, 2018, WITH DIFFERENT DRIVER, BRAKE FULLY ENGAGED AT STOP LIGHT AND ON CITY ROAD AND VEHICLE \"ROLLED FORWARD\" AND HIT VEHICLE IN FRONT.  ON JULY 9, 2018 VEHICLE WAS DELIVERED TO DEALERSHIP WITH THIRD DRIVER AND BRAKES FAILED TO STOP AT STOP SIGN GOING  INTO TRAFFIC ON CITY ROAD WITH BRAKE BEING ENGAGED AND THEN GOING TO THE \"FLOOR\" OF VEHICLE.  ON JULY 17, 2018 DEALERSHIP STATE MASTER CYLINDER HAS INTERNAL FAILURE AND IT WAS READY TO BE PICKED UP.  UPON TEST DRIVING, BRAKES CONTINUED TO \"GO TO THE FLOOR\" AFTER BRAKING AND STOPPING. DEALERSHIP KEPT VEHICLE AND \"FOUND INTERNAL LEAK AT THE BRAKE MASTER CYLINDER THAT LEAKED INTO BRAKE BOOSTER AND HCU NOT RESPONDING AND FOUND INTERNAL FAILURE INT HE HCU.  VEHICLE WAS PICKED UP AUGUST 15, 2018.  VEHICLE APPEARED TO BE OPERATING EFFICIENTLY; BUT, SEEMED TO STILL HAVE \"PLAY\" IN THE BRAKES.  HAD FOURTH DRIVER TEST DRIVE, THAT IS EXPERIENCE IN CAR/MOTORCYCLE REPAIR AND STATED THAT BRAKES STOPPED VEHICLE; BUT, WHEN SLAMMED TO \"LOCK\" THEY NEVER LOCKED BEFORE ABS KICKED IN.  ALL 3 DRIVERS OF JEEP NOTICED BRAKES STARTING TO DEVELOP THE SAME ISSUE AS PREVIOUSLY EXPERIENCED.  TRADED JEEP IN ON NEW VEHICLE AS 17 YR. OLD DRIVER WAS MAIN DRIVER ON VEHICLE AND FELT TOO DANGEROUS TO RISK THIS ISSUE AGAIN.",
        "vin": "1C4BJWEG6HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132903,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "17 WRANGLER WITH LESS THAN 50000 MILES. THE RADIATOR STARTED LEAKING COOLANT. NOT UNDER WARRANTY. DOING SOME RESEARCH THIS IS A PRETTY COMMON THING. DEALER REFUSED TO FULLY COVER THIS. TRYING TO GET THE WORD OUT",
        "vin": "1C4AJWAG3HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "07/27/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131002,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ATTEMPTED TO SCHEDULE SAFETY RECALL REPAIRED AT OSMOOR CHRYSLER DODGE JEEP RAM IN LOUISVILLE KY IN JULY.  THEY SCHEDULED AN APPOINTMENT FOR SEPTEMBER 7TH.  WHEN ARRIVING FOR THE APPOINTMENT, WAS NOTIFIED THAT THE PART REQUIRED WAS NOT AVAILABLE.  ATTEMTED TO SCHEDULE THE RECALL THE SECOND TIME, AND WAS TOLD THAT THE NEXT APPROINTMENT WAS OCTOBER 15TH.  COULD NOT GET THE DEALERSHIP I PURCHASED THE VEHICLE FROM TO REPAIR A SAFETY RECALL ITEM FROM JULY THROUGH OCTOBER.",
        "vin": "1C4AJWAG0HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2018",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED BY ITSELF WHILE PARKED. THE IGNITION HAD BEEN TURNED OFF AND KEYS REMOVED FOR SEVERAL HOURS. THIS HAS HAPPENED TWICE. I DISCOVERED THE VEHICLE RUNNING, DOORS LOCKED AND IGNITION IN THE OFF POSITION. TO TURN OFF THE ENGINEI INSERTED THE KEY, TURNED IT TO THE ON POSITION AND THEN OFF. THIS OCCURRED ONCE IN MY GARAGE, CAUSING CARBON MONOXIDE EXHAUST TO ENTER THE LIVING QUARTERS. IT HAPPENED A SECOND TIME WHILE PARKED AWAY FROM HOME, WITH THE KEYS REMOVED. THE VEHICLE WAS STATIONARY, BECAUSE IT WAS PLACED IN PARK WHEN THE ENGINE WAS TURNED OFF.",
        "vin": "1C4BJWEG9HL"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139789,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 4,433 MILES, MY PASSENGER COMPLAINED THAT THE FRONT PASSENGER SEAT WOULD NOT RECLINE. I INSPECTED BOTH DRIVER AND PASSENGER FRONT RECLINERS, AND FOUND BROKEN PLASTIC PIECES UNDERNEATH BOTH THE DRIVER AND PASSENGER INBOARD RECLINERS. THE DEALERSHIP INSPECTED AND REPLACED BOTH DRIVER AND PASSENGER SEATBACKS. AT ABOUT 8,052 MILES, THE PASSENGER SEAT INBOARD RECLINER FAILED AGAIN. THE DEALERSHIP INSPECTED AND REPLACED THE PASSENGER SEATBACK. AT ABOUT 20,000 MILES, THE DRIVER INBOARD RECLINER FAILED AGAIN. TO DATE, THE DEALERSHIP HAS NOT REPLACED THE FOURTH FAILED RECLINER. I HAVE PROVIDED FCA WRITTEN NOTICE OF THESE FAILURES. SINCE FOUR SEAT RECLINERS HAVE FAILED WITHIN THE FIRST 20,000 MILES, I AM CONCERNED THAT A DESIGN, MATERIAL, OR WORKMANSHIP DEFECT EXISTS. I AM ALSO VERY CONCERNED HOW THESE FAILED SEAT RECLINERS WILL PERFORM IN A CRASH. UPON RESEARCH, IT APPEARS THAT OTHERS HAVE HAD MULTIPLE FAILURES WITH THESE SPECIFIC MODEL YEAR SEAT RECLINERS AS WELL. SEE NHTSA ID NUMBER 11074326.",
        "vin": "1C4BJWCG1HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/07/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128169,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY THE HOOD LIFTS UP AND SHAKES VIOLENTLY WHILE DRIVING AT HIGHWAY SPEED, TYPICALLY WHEN AN ON ONCOMING SEMI TRUCK PASSES. I'M CONCERNED THE RUBBER HOOD STRAPS ARE GOING TO BREAK AND THE HOOD FLY OPEN AT HIGHWAY SPEEDS.",
        "vin": "1C4BJWFG5HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "11/26/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123119,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IN QUESTION CAUGHT FIRE WITH IT STARTING ON THE PASSANGER SIDE OF THE ENGINE BAY. THE CAUSE WAS DEEMED 'UNCLEAR' BY AN INSPECTOR. I WAS DRIVING THE VEHICLE WHEN IT CAUGHT FIRE AND IT WAS ON A CITY STREET.",
        "vin": "1C4DJWDG3HL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120992,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP WRANGLER SPORT : WHILE TRAVELING AT HIGHWAY SPEED A CAR PULLED OUT IN FRONT OF ME. I CHANGED LANES BUT STILL HIT THE CAR IN THE RIGHT REAR AND MY JEEP IN FRONT LEFT SIDE. JEEP ROLLED SEVERAL TIMES AND HAS BEEN TOTALED. ( AIR BAG DID NOT DEPLOY)",
        "vin": "1C4AJWAG4HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2018",
        "dateOfIncident": "06/25/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115724,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN HIGH WINDS OR PASSED BY APPROACHING LARGE VEHICLES THE HOOD FLUTTERS DANGEROUSLY.  I HAD TO INSTALL AFTER MARKET HOOD HOLD DOWN LATCHES TO CORRECT THE PROBLEM. $100 TO CORRECT THE HOOD FLUTTER.  IT HAPPENED MORE THAN ONCE.",
        "vin": "1C4BJWFG3HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "05/04/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "HOOD FLUTTER. WHILE DRIVING DOWN THE HIGHWAY AT POSTED SPEEDS, IF WINDS ARE HIGH OR PASSING AN ONCOMING LARGE TRUCK, THE HOOD WILL FLUTTER DUE TO THE LACK OF SUPPORT FROM THE WEAK RUBBER LATCHES THAT SECURE THE HOOD. THIS HAS HAPPENED SEVERAL TIMES NOW. RESEARCH CLEARLY INDICATES THIS IS A WIDE SPREAD PROBLEM AND THE MANUFACTURER HAS REFUSED TO ADDRESS THIS ISSUE. IN SOME REPORTS I HAVE READ, THE LATCHES CAN BREAK AND CAUSE MASSIVE DAMAGE TO THE VEHICLE AND PUT THE DRIVER AND PASSENGER IN HARMS WAY.",
        "vin": "1C4AJWAG2HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "06/25/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111265,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE SEEN HOOD FLUTTER NUMEROUS TIMES WHEN PASSING SEMI TRAILERS ON INTERSTATES. THE FLUTTER WAS WORRISOME SO I REPLACED ORIGINAL HOLDING STRAPS WITH STRONGER THIRD PARTY STRAPS. SINCE REPLACEMENT OF STRAPS THE FLUTTERING HAS CEASED.",
        "vin": "1C4BJWCG5HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/23/2018",
        "dateOfIncident": "06/22/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE POSTED HIGHWAY SPEED LIMIT, 55 OR 65 MPH THE HOOD ON MY JEEP WRANGER JKU, VIBRATES, SHAKES, LIFTS FROM ITS SEAT POSITION AS IF IT IS GOING TO BREAK LOSE AND FLY BACK TOWARDS THE WINDSHIELD. THE CONDITION IS MADE WORSE BY LARGE VEHICLES PASSING BY AT POSTED OR EXCESSIVE SPEED. CONDITION IS DANGEROUS. RUBBER HOOD LATCHES STRETCHED TO LIMIT CONSTANTLY.",
        "vin": "1C4HJWEG7HL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/20/2018",
        "dateOfIncident": "05/17/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102749,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS (70 MPH) I ENCOUNTERED SOME STRONG CROSS WINDS CAUSING A LIFTING ACTION OF THE HOOD. THE LIFTING ACTION OF THE HOOD (ABOUT 1/2\") GAVE ME ENOUGH CONCERN TO SLOW DOWN UNTIL THE LIFTING ACTION STOPPED. IT APPEARS THAT THE HOOD LATCHES ON EITHER SIDE OF THE HOOD, BEING MADE OF RUBBER, ARE NOT STRONG ENOUGH TO PREVENT THE HOOD FROM LIFTING. THE CENTER RELEASE DID NOT HOLD THE CENTER DOWN, ALLOWING FOR THE MOVEMENT.",
        "vin": "1C4BJWFG0HL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100083,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "2017 JEEP WRANGLER PULLS TO THE RIGHT WHILE LOW AND HIGH SPEEDS. INSPECTED AT 2 DIFFERENT JEEP SERVICE DEALERS AND BOTH STATE NO ISSUES FOUND. 2ND DEALER STATES NOTICES ISSUE BUT ALL WRANGLERS PULL TO THE RIGHT. NEEDS TO BE RECALLED SAFETY ISSUE",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "05/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096451,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HOOD OF MY JEEP WRANGLER DOESN'T APPEAR TO BE SECURE WHEN DRIVING AT HIGHWAY SPEEDS, PARTICULARLY WHEN IT'S WINDY OR I'M PASSING AN ON-COMING SEMI TRUCK.  THE HOOD BOUNCES AND FLUTTERS.",
        "vin": "1C4BJWEG1HL"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "04/03/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091077,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING 60 MPH, THE VEHICLE'S HOOD FLEW UP AND SHATTERED THE WINDSHIELD AND WINDSHIELD FRAME. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD AND HAD IT TOWED TO HUNTER CHRYSLER DODGE JEEP RAM (1130 AUTO MALL DR., LANCASTER, CA 93534, (661) 948-8411). THE VEHICLE WAS DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 24,754. *BF*JB  *BF  *AS    CONSUMER STATED YOUR TEAM IS WELCOME TO INSPECT MY REPAIRED VEHICLE AT ANY TIME WHICH CONTINUES TO HAVE SIGNIFICANT HOOD FLUTTER ISSUES. I HAVE NO ISSUES PAYING FOR MY OWN RENTAL CAR AT MY EXPENSE WHILE YOU CHECK OUT MY VEHICLE. YOU HAVE MY PERMISSION AND WISHES TO SHARE MY CONTACT INFORMATION, STORY, AND EVERYTHING ELSE WITH CHRYSLER.  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *JB *TR*JB",
        "vin": "1C4HJWFG0HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "03/29/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090279,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CAUGHT ON FIRE WHILE DRIVING",
        "vin": "1C4BJWDG5HL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "03/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11089615,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING APPROXIMATELY 25 MPH, ANOTHER VEHICLE DROVE THROUGH A STOP LIGHT AND COLLIDED WITH THE FRONT END AND FRONT PASSENGER SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUSTAINED INJURIES TO THE SHOULDERS, NECK, BACK, HIPS, AND LEGS THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE DEALER (JACKSONVILLE CHRYSLER, JEEP, DODGE AND RAM, 11101 NURSERYFIELDS DR., JACKSONVILLE, FL 32256, (904) 493-0000). THE VEHICLE HAD BEEN WAITING TO BE DIAGNOSED FOR OVER A MONTH. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE CONTACT WAS ALSO AWAITING ON THEIR RESPONSE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V734000 (AIR BAGS). THE CONTACT MENTIONED THAT THE INSURANCE COMPANY REFUSED TO DEEM THE VEHICLE AS A TOTAL LOSS. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "12/05/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084692,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "REVERSE WOULD JUMP OUT OF GEAR AND GRIND WHILE DRIVING IN GEAR EVERY TIME. THIS REQUIRED MANUALLY HOLDING IT DOWN TO REMAIN IN GEAR AND PROPERLY DRIVE IN THE REVERSE GEAR. FIELDS CJDR IN SANFORD, FL SAID I WOULD HAVE TO AGREE TO PAY +$1000 IN LABOR FOR THEM TO DIAGNOSE THIS IF IT TURNED OUT NOT TO BE A VALID WARRANTY ISSUE. I DECLINED AND ACCEPTED LIVING WITH IT.    ON 12/05/2017, DURING NORMAL DRIVING SUDDENLY THE GEARSHIFT COULD NOT BE PUT INTO ANY GEAR AND THE TRANSMISSION COMPLETELY FAILED. MY BRAND NEW WRANGLER WITH 5000 MILES SAT AT THE DEALER FOR SERVICE FOR **115 DAYS** WAITING ON TWO PARTS:     - PART: GEAR-REVERSE IDLER 5134496AA  - PART: SYNCH-REVERSE 5134498AA    FCA FAILED TO RETURN THE VEHICLE TO ME UNTIL 03/30/2018. FOUR MONTHS. NOT ONLY IS THAT UNACCEPTABLE, I WAS TREATED LIKE GARBAGE THROUGHOUT THE WAIT BY BOTH FCA AND THE DEALERSHIP SERVICE DEPARTMENT.    I HAVE FILED A LEMON LAW CLAIM REQUESTING ARBITRATION WITH THE STATE OF FLORIDA ATTORNEY GENERAL'S OFFICE AND WILL SEE A FULL REFUND FOR THIS ORDEAL AS ENTITLED. REALLY LOOKING FORWARD TO CASTIGATING FCA AT THE HEARING.",
        "vin": "1C4AJWAG1HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2018",
        "dateOfIncident": "03/11/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080884,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP WRANGLER HARD ROCK 2017 ON FIRE 4 DAYS AFTER SERVICE! MY 2 YEARS OLD AND I WERE IN THE CAR. ONCE I PARKED THE CAR IN FRONT OF MY HOUSE, SMOKE CAME FROM THE ENGINE, WE WENT OUT AND JEEP CAUGHT ON FIRE AFTER FEW MINUTES. WE USED 3 BIG FIRE EXTINGUISHERS STILL CAN'T PUT OUT THE FIRE. JEEP BURNT FOR 15 MINS UNTIL FIREMEN PUT THAT OUT. ALL FOAM WENT INTO OUR FISH POND AND KILLED ALL THE FISH! BRAND NEW CAR WE BOUGHT LAST YEAR, UNDER 10,000 MILES, PASSED SERVICE FROM DEALER 4 DAYS BEFORE THE FIRE. NEITHER THE POLICE NOR INSURANCE COMPANY NOR JEEP DEALERSHIP CAN TELL YOU WHY. CAR NEVER WRECKED AND TOTALLY NO SIGNALS POPPED UP BEFORE THE FIRE.",
        "vin": "1C4BJWFG2HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "02/16/2018",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079727,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR BRAND NEW 2017 JEEP WRANGLER UNLIMITED SAHARA ON DEC 16, 17. ON JAN 6, 18, THE HEATED SEATS ON THE DRIVERS AND PASSENGER SIDE WENT OUT. ON 19 JAN, 18 THE JEEP DEALERSHIP REPLACED THE ICP AND BLOWN FUSE. ON FEB 16, 18, THE JEEP WAS PARKED IN A PARKING LOT, NOT TURNED ON, AND CAUGHT FIRE SOMEWHERE IN THE DASHBOARD. THE FIRE AND HEAT DAMAGED THE ENTIRE SIDE OF THE DRIVER SIDE DASHBOARD, MAKING THE VEHICLE INOPERABLE. *BF *TT",
        "vin": "1C4BJWEG9HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078843,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 6 SPEED MANUAL TRANSMISSION HAS A \"REVERSE SYNCHRONIZER \" THAT IS FAULTY. CHRYSLER JEEP HAS THE PARTS ON BACKORDER FOR MORE THAN 6 MONTHS AND THEY CAN NOT HONOR THEIR FACTORY WARRANTY.  I'M BEING TOLD TO KEEP DRIVING MY BRAND NEW JEEP THAT GRINDS GOING INTO AND POPS OUT OF REVERSE WHILE DRIVING. THEY ARE DOWN PLAYING THIS PROBLEM IN AN ATTEMPT TO DECEIVE CUSTOMERS.",
        "vin": "1C4AJWAG7HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11076258,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AN ACCIDENT 01/30/2018. HIT VEHICLE THAT RAN A RED LIGHT IN DRIVER'S SIDE AT SOMEWHERE BETWEN 30-40 MPH WITH THE FRONT OF MY VEHICLE. THE OTHER VEHICLE FLIPPED OVER ON IT'S TOP. IT WAS A FULL SIZE PICK-UP WITH LOADED SERVICE BODY. THE IMPACT STOPPED MY VEHICLE. MY VEHICLE WAS A 2017 JEEP WRANGLER WITH 7500 MILES ON IT. AS A RESULT OF THE DAMAGED MY VEHICLE WAS A TOTAL LOSS.",
        "vin": "1C4AJWAG1HL"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "09/09/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074326,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE THE VEHICLE WAS STATIONARY, THE CONTACT NOTICED THAT THE DRIVER'S SEAT WAS CROOKED. THE VEHICLE WAS TAKEN TO HENDRICKS CHRYSLER DODGE JEEP RAM IN CONCORD, NORTH CAROLINA WHERE THE REAR FRAME OF THE SEAT WAS REPLACED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED THE CONTACT WITH CASE NUMBER: 32473211. THE FAILURE MILEAGE WAS 800.  *TR",
        "vin": "1C4AJWAG1HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "02/08/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073325,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION WAS REPLACED AT  2262 MILES ON 2/7/17.  AT 7056 MILES I RETURNED THE JEEP TO THE DEALER ON 12/27/18  BECAUSE OF A AUDIBLE KNOCKING SOUND FROM THE TRANSMISSION WHEN COLD.",
        "vin": "1C4AJWAG8HL"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/14/2018",
        "dateOfIncident": "01/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062733,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A TRAFFIC LIGHT FOOT WAS ON BRAKE, AND THE CAR ACCELERATED FORWARD AND RPMS WENT UP WHILE FOOT WAS ON BRAKE CAR WENT INTO ANOTHER CAR.  ONLY STOPPED WHEN PLACED IN NEUTRAL",
        "vin": "1C4BJWDG6HL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "12/16/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055947,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE NEW IN AUGUST OF 2017. THE VEHICLE IS THE WRANGLER UNLIMITED (4 DOOR) SAHARA PACKAGE.  THIS PACKAGE INCLUDES LED HEADLIGHTS.  ON DECEMBER 16TH I DROVE THE VEHICLE THROUGH FALLING SNOW AT NIGHT.  I WAS ON A HIGHWAY IN A REMOTE AREA TRAVELING WITH TRAFFIC AT REDUCED SPEEDS, APPROXIMATELY 20 MPH.  AFTER APPROXIMATELY 30 MINUTES I NOTICED MY VISIBILITY DIMINISHING.  THE WINDSHIELD WAS CLEAR OF SNOW.  HOWEVER, OBJECTS IN FRONT OF ME WERE BECOMING HARDER TO SEE.  I TURNED THE LIGHTS ON AND OFF TO SEE IF IT MADE A DIFFERENCE.  IT DID NOT.  I FELT I COULD SAFELY FOLLOW THE VEHICLE IN FRONT OF ME UNTIL I COULD FIND A SAFE AREA TO PULL OVER.  WE WERE APPROACHING A SMALL CITY WITH STREET LIGHTS WHICH MADE TRAVELING SAFER.  I PULLED OFF AN EXIT TO ASSESS THE HEADLIGHT ISSUE.  BOTH HEADLIGHTS WERE COVERED IN SNOW.  SINCE THE JEEPS LIGHTS ARE RECESSES A BIT, THE SNOW FILLED THE POCKETS COMPLETELY. THIS IS THE FIRST TIME DRIVING (SINCE 1984) THAT I HAD TO CLEAR SNOW FROM THE HEADLIGHTS WHILE DRIVING.  I LIVE IN NORTHERN NEW ENGLAND SO SNOW IN THE WINTER IS A COMMON EVENT.  WHAT I DEDUCED WAS THAT THE LED LIGHTS WERE NOT GENERATING ANY HEAT.  THIS WAS THE LIKELY REASON FOR THE SNOW BUILD UP.   THIS FLAW IS EXCEPTIONALLY DANGEROUS.  WHEN I NEEDED THE LIGHTS TO WORK THEIR BEST, THEY FAILED.  COLD WEATHER AND DARKNESS ARE PREVALENT THIS TIME OF YEAR.  IT SEEMS I CAN ANTICIPATE MANY INSTANCES OF DRIVING AS MY LIGHTS BECOME LESS AND LESS USEFUL AND THERE'S AN INCREASE IN THE DANGER ASSOCIATED WITH DRIVING.  I FIND THIS COMPLETELY UNACCEPTABLE.  THIS SITUATION WAS FORESEEABLE AND PREVENTABLE.  I HAVE SINCE LEARNED THAT AFTERMARKET HEATED LED LIGHTS ARE AVAILABLE FOR THIS VEHICLE.  SO, THIS IS A KNOWN ISSUE WITH THE JEEP.  I FEEL THIS VEHICLE SHOULD NOT HAVE BEEN SOLD WITH LED HEADLIGHTS THAT PERFORM AS THESE DID.  THE JEEP IS ADVERTISED AS A WINTER VEHICLE.",
        "vin": "1C4BJWEG6HL"
    },
    {
        "components": "STRUCTURE,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045407,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK ON OLD COUNTRY ROAD IN PLAINVIEW GOIN ABOUT 40 MPH, THE REAR WHEELS OF THE JEEP COMPLETELY LOCKED UP WHILE MOVING,  CAUSING THE CAR TO COME TO A VIOLENT STOP, NEARLY CAUSING AN ACCIDENT.  THE VEHICLE WAS UN-DRIVABLE AND NEEDED TO BE TOWED TO THE DEALERSHIP WHERE IT WAS PURCHASED.  SECURITY DODGE IN AMITYVILLE FOUND LEAKING FLUID FROM THE REAR OF THE VEHICLE, A HOLE IN THE REAR AXEL HOUSING, FURTHER INSPECTION FOUND PINION FAILURE CAUSING DAMAGE TO REAR END AND AXEL SHAFT.  THE DEALERSHIP REFUSED TO OFFER ANY TYPE OF BUYOUT OR LEASE TERMINATION OPTION, I MADE IT CLEAR TO THEM THAT I DIDN'T FEEL SAFE GETTING BACK INTO THIS VEHICLE, THEY TOLD ME THAT THE RENTAL CAR THAT WAS GIVEN TO ME DURING THE REPAIR TIME WAS DUE BACK OR IT WOULD BE REPORTED AS STOLEN, FURTHERMORE THEY TOLD ME OF THE JEEP WAS NOT REMOVED FROM THE PROPERTY, THEY WOULD CHARGE ME STORAGE FEES.  THEY OFFERED NO EXPLANATION FRO WHY THIS SAFETY DEFECT OCCURRED, WHAT CAUSED IT AND WHETHER OR NOT IT COULD HAPPEN AGAIN.  I DO NOT FEEL SAFE DRIVING THIS VEHICLE AND THIS WAS NOT HANDLED PROFESSIONALLY BY THE DEALERSHIP NOR THE JEEP MANUFACTURER",
        "vin": "1C4HJWEG4HL"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/12/2017",
        "dateOfIncident": "11/11/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045511,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK 2016 JEEP WRANGLER UNLIMITED RUBICON HARD ROCK EDITION IN FOR A RECALL REPAIR OF THE AIRBAG DEPLOYMENT SENSOR. DEALERSHIP WANTED $50 TO DO THE WORK BECAUSE I HAD A WINCH INSTALLED. MY JEEP HARD ROCK EDITION WAS DESIGNED AT THE FACTORY TO RECEIVE THIS SPECIFIC BRAND AND MODEL OF WINCH SO I REFUSED TO PAY. I CONTACTED JEEP BY PHONE AND ASKED THEM TO INTERVENE. THEY REFUSED. I TOLD THE DEALER I WAS LEAVING WITHOUT HAVING IT FIXED AND MY ESTATE WOULD SUE THEM IF I WAS KILLED IN AN ACCIDENT AND THEN HE AGREED TO FIX IT FREE. THEY CLAIMED THEY FIXED IT BUT WHEN I DROVE OFF I IMMEDIATELY SAW A WARNING MESSAGE SAYING THE RIGHT FRONT TURN SIGNAL LAMP WAS OUT. I MADE U TURN AND WENT RIGHT BACK.THEY SAID THEY NEEDED TO ORDER A PART. I LEFT. THEN MY BATTERY DRAINED DOWN. I CONTACTED JEEP AND ASKED THEM TO INTERVENE. WHEN I CALLED TO MAKE ANOTHER APPOINTMENT TO GET THE RECALL DONE RIGHT THE DEALERSHIP CLAIMED THEY NEEDED TO ORDER A PART. I FOUND OUT THEY DID THE RECALL REPAIR BY SOLDERING WIRES. 2+ HOURS LATER THEY SAID ALL IT NEEDED WAS A BULB. I ASKED IF THEY HAD TO ORDER BULBS. THEY SAID THEY STOCK THEM AND DENIED EVER TELLING ME THEY NEEDED TO ORDER A PART. THEY ADMITTED THERE WAS STILL AN ELECTRICAL PROBLEM BUT SAID THAT COULD HAVE BEEN THE RESULT OF ELECTRICAL MODIFICATIONS I HAD MADE AND WANTED ME TO PAY THEM TO TROUBLESHOOT IT. THE WINCH WAS THE ONLY ELECTRICAL MODIFICATION AND IT WAS INSTALLED ALMOST 1 YEAR BEFORE I TOOK THE JEEP IN  AND I NEVER HAD ANY PROBLEMS BEFORE THEY DID THE RECALL WORK NOR DID THEY HAVE ANY TROUBLE STARTING IT OR SEE ANY WARNING MESSAGES WHEN I TOOK IT IN FIR THE RECALL IN LATE AUGUST. WITHIN 2 MILES OF DRIVING I NOTICED THE HEADLIGHTS FLICKERING. WITHIN 3 MILES ALL THE WARNING LIGHTS ON THE DASH STARTED WILDLY GOING OFF AN ON RANDOMLY AND SPEEDOMETER WAS GOING BACK AND FORTH. THEY DID NOT PROPERLY MAKE THE AIRBAG SENSOR REPAIR.",
        "vin": "1C4BJWFG1GL"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": true,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11043775,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DID NOT DEPLOY AND SEAT BELT DID NOT PREVENT FACE FROM HITTING STEERING WHEEL AFTER BEING REAR ENDED VERY HARD. DRIVER SEATBACK WAS FORCED AND BROKEN BACKWARDS INTO A 45 DEGREE RECLINED POSITION.",
        "vin": "1C4BJWDGXHL"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/16/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040478,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE POLICE REPORT AND ATTACHED PICTURES.  DRIVING SLOW ON A BACKSTREET AT LESS THAN 25 MILES P\\H. BRAND NEW 2017 STOCK JEEP WRANGLER SPORT. LESS THAN 6,000 MILES. I AM NOW A HORRIFIED WOMAN THAT KNOWS NOTHING ABOUT WHY MY NEW JEEP WRANGLER CATCHES ON FIRE OUT OF NO WHERE WHILE IN MOTION! ONCE WE SAW FIRE FLAMES, SMOKE AND RED OIL ON FIRE COMING OUT FROM ENGINE AREA AND BELOW THE VEHICLE DRIVERS SIDE, WE QUICKLY STOPPED ON RESIDENTIAL STREET. ME, MY 70 YEAR OLD MOTHER WHO IS SICK AND MY 24 YEAR OLD AUTISTIC DAUGHTER HAD TO JUMP OUT OF THIS FIRE TRAP VEHICLE SCREAMING AND CRYING!!!   THIS WAS AN UNEXPLAINED AND SPONTANEOUS FIRE!!! WHY? NO REASON BEHIND IT AND NOTHING THAT I DID TO CAUSE IT. THE FIRE WAS LUCKILY AND QUICKLY EXTINGUISHED BY GOOD SAMARITANS AND CITY WORKERS NEAR BY. THE FIRE DEPARTMENT WAS CALLED AND SHOWED UP ALONG WITH POLICE OFFICER. FIRE DEPARTMENT TOLD ME TO WRITE A COMPLAINT ON THESE VEHICLES BECAUSE THEY HAVE HAD TO RESPOND TO MANY JEEP WRANGLER FIRES IN THE LAST 10 YEARS. I WAS SHOCKED AND HORRIFIED, HOW CAN THIS BE???  HOW BAD THIS COULD HAVE TURN OUT TO BE IF CITY WORKERS WHERE NOT NEAR BY WITH A FIRE EXTINGUISHER?.   JEEP NEEDS TO BE INVESTIGATED. PLEASE PROTECT THE CONSUMERS AND JEEP WRANGLER OWNERS WHO ARE UNAWARE OF THESE FIRE TRAPS. THIS IS SERIOUS AND DANGEROUS FIRE ISSUES ON JEEP WRANGLERS. I PRAY YOU START AN INSTIGATION AND RECALL SO THAT NOBODY ELSE HAS TO GO THROUGH THIS HORRIFIC EXPERIENCE! *BF  UPDATED 8/3/18*JB",
        "vin": "1C4BJWDG2HL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "10/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034803,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON HIGHWAY AT 55MPH. PASSENGER SIDE REAR TIRE BLEW JEEP AND TIRES HAVE 4500 MILES ON THEM. BRIDGESTONE 18'",
        "vin": "1C4-BJWEG8H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2017",
        "dateOfIncident": "08/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024765,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION ON 2017 JEEP WRANGLER UNLIMITED FAILED AFTER 4000 MILES. DEALERSHIP/FCA REPLACED THROTTLE BODY, ENTIRE TRANSMISSION, TORQ CONVERTER, AS WELL AS TRANSCOOLER SYSTEM. NO EXPLAINATION AS TO FAILURE. VEHICLE PRIOR TO LOSS BEING USED FOR DAILY COMMUTE. OUTSIDE OF SIMPLY REPLACING MAJOR PARTS ON BRAND NEW VEHICLE THERE HAS BEEN LITTLE IF ANY SUPPORT ON DEALERSHIP/FCA SIDE.",
        "vin": "1C4BJWEG3HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "07/21/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012328,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING HOME FROM COLLEGE WHEN HE AND HIS GIRLFRIEND SMELLED SOMETHING FUNNY. THEY PULLED OVER TO THE SIDE OF THE ROAD AND FLAMES WHERE COMING FROM UNDER THE CAR AND THE WHOLE FRONT OF THE CAR WAS ENGULFED IN FLAMES WITHIN SECONDS. OTHERS PULLED OFF THE ROAD AND HELPED GET HIM, HIS DOG AND GIRLFRIEND TO SAFETY.  THE INSURANCE COMPANY SAID IT WAS DUE TO A FAULTY CONTROL MODULE AND THE TRUCK WAS TOTALED. INSURANCE COMPANY IS GOING AFTER JEEP DUE TO FIRE INSPECTORS FINDINGS",
        "vin": "1C4BJWDG3HL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK OVERFLOWED AND GAS SPILLS OUT FROM THE FILLER TUBE AT EVERY FILL UP.",
        "vin": "1C4AJWAGXHL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2017",
        "dateOfIncident": "06/29/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002445,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VEHICLE WITH SYMPTOMS OF EXCESSIVE/SEVERE SHAKING OF SHIFTER WHEN TRAVELING OVER A ROUGH ROAD.  THE LEFT SIDE OF THE TRANSMISSION MOUNT WAS NOT FUNCTIONING CORRECTLY ALLOWING EXCESSIVE MOVEMENT OF DRIVE TRAIN.",
        "vin": "1C4BJWDG1HL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/17/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986261,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP WRANGLER'S MANUAL TRANSMISSION DOES NOT HAVE A REVERSE LOCKOUT AND POP'S OUT OF REVERSE ROUTINELY WHEN POWER IS APPLIED OR YOU PUMP THE CLUTCH AFTER ALREADY SUCCESSFULLY ENTERING REVERSE. THE VEHICLE OPERATOR MUST MANUALLY HOLD THE GEAR SHIFT LEVER IN THE REVERSE POSITION TO MAINTAIN REVERSE. THIS HAS MANIFESTED AT AROUND THE 500 MILE MARK AND PROGRESSIVELY WORSENED MY CURRENT ODOMETER READING IS 1656. ADDITIONALLY THE LACK OF A REVERSE LOCKOUT OR SPECIAL PROCEDURE TO ENTER REVERSE IS MISSING MAKING IT POSSIBLE FOR THE OPERATOR TO MISTAKENLY GRIND THE REVERSE GEARS AT HIGHWAY SPEEDS WHEN TRANSITIONING FROM 5TH TO 6TH GEAR.",
        "vin": "1C4AJWAGXHL"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/14/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985671,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING UNDER NORMAL CONDITIONS, I'LL HEAR A SINGLE AUDIBLE 'DING' AND THEN SEE THE AIRBAG AND ESP LIGHT ILLUMINATE ON DASH ALONG WITH THE SPEED ODOMETER DROP FROM THE SPEED TRAVELING TO 0 BEFORE NORMAL OPERATION.  THIS HAPPENS MUCH MORE OFTEN WHEN THE CRUISE CONTROL IN ENGAGED.  IT HAPPENED 5/14/2017 WHILE TRAVELING INTERSTATE 65 TO SUCH AN EXTENT THAT NOT ONLY DID I HAVE TO CANCEL CRUISE CONTROL, I ACTUALLY HAD TO TURN IF OFF TO STOP THE DINGING AND FLASHING OF THE AIRBAG AND ESP LIGHT.  I HAD TO FINISH THE LAST 2.5 HOURS OF INTERSTATE TRAVEL WITHOUT CRUISE CONTROL.",
        "vin": "1C4BJWDG4DL"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980045,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ALIGNMENT KEEPS GOING OUT AND I KEEP PARKING AT A ANGLE NO ONE CAN FIGURE IT OUT FOR ME.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "03/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970968,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE INDEPEDENTLY VEERED TO THE LEFT WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER ON TWO SEPARATE OCCASIONS AND A WHEEL ALIGNMENT WAS PERFORMED BOTH TIMES, BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 22.",
        "vin": "1C4HJWDG1HL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954174,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL INSIDE THE VEHICLE IS VERY LOW, UNUSUALLY LOWER THAN THE BRAKE PEDAL, IT IS VERY UNCOMFORTABLE TO DRIVE AND VERY DIFFICULT TO REACH.  THE SEAT HAS BEEN ADJUSTED TO IT'S MAX AND IT IS STRAINING TO TRY AND REACH THE GAS PEDAL WHILE DRIVING, IT CAN CAUSE AN ACCIDENT IN THE FUTURE, FOR A LEG CRAMP ALREADY HAPPENED WHILE DRIVING TO ACCELERATE, AND I AM SCARED THAT LATER I WILL CAUSE AN ACCIDENT, BY STRAINING SO MUCH.  I JUST CANNOT SEEM TO REACH THE GAS PEDAL COMFORTABLY, AND I DON'T FEEL THAT I SHOULD BE DEALING WITH THIS AND NOT BE ABLE TO HAVE A NICE DRIVING EXPERIENCE THAT DOES NOT CAUSE ME TO STRAIN AND STRETCH ABNORMALLY.",
        "vin": "1C4AJWBG7HL"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "01/26/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950321,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MODEL YEAR WRANGLER IS FITTED WITH LED HEADLIGHTS.  ON 1/26/17 AND 2/7/2017 THEY HAVE FROZEN OVER DURING MISTY OR FOGGY WEATHER IN MINNESOTA. BOTH TIMES IT HAPPENED I WAS DRIVING AT ABOUT 6:30AM, BEFORE THE SUN CAME UP.   THE FIRST OCCASION THE TEMP WAS 29, NEXT TIME IT WAS 31.  PLEASE SEE ATTACHED PHOTOS.  WHEN THIS HAPPENS THE HEADLIGHTS DO NOT WORK VERY WELL MAKING IT VERY HARD TO SEE.  I FEEL THIS IS A DANGER TO ME AND THOSE AROUND ME AND SHOULD BE CORRECTED.    I HAVE CONTACTED BOTH A DEALER AND JEEPCARES ABOUT THE ISSUE AND THEY WILL DO NOTHING TO CORRECT IT.      HIGH QUALITY AFTERMARKET LED HEADLIGHTS ARE AVAILABLE WITH OR WITHOUT AN AUTOMATIC HEATER ELEMENT TO PREVENT THEM FROM ICING OVER.  TRUCKLITE IS ONE BRAND THAT OFFERS THEM.",
        "vin": "1C4HJWFG3HL"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/02/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10949168,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS IN MAJOR FRONT ACCIDENT AIR AS NOR TENSIONER WORKED JEEP WAS TOTALED. VIN WAS NOT ON RECALL LIST HOWEVER HEAD LAMP CAME OUT AND NOTHING HAPPENED THIS VEHICLE NEEDS TO BE CHECKED FURTHER.  *TR",
        "vin": "1C4BJWEG9HL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2016",
        "dateOfIncident": "09/01/2016",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928993,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 JEEP WRANGLER. WHILE DRIVING APPROXIMATELY 65 MPH, AN ABNORMAL BURNING ODOR EMITTED FROM THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 3,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    }
]