[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2020",
        "dateOfIncident": "03/23/2019",
        "fire": false,
        "manufacturer": "Jayco, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11311399,
        "products": [
            {
                "manufacturer": "Jayco, Inc.",
                "productMake": "JAYCO",
                "productModel": "JAY FEATHER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "LED LIGHTING OVERHEATS AND THEN FLICKERS",
        "vin": "1UJBJ0BP5H1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/19/2019",
        "fire": false,
        "manufacturer": "Jayco, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208861,
        "products": [
            {
                "manufacturer": "Jayco, Inc.",
                "productMake": "JAYCO",
                "productModel": "JAY FEATHER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING HOME PULLING ARE 2017 JAYCO JAY FLIGHT SLX 264BHW AT 65 MPH ON I 10 WEST ON ARE WAY HOME. A TRUCKER HAD PASSED US AND I HAD NOTICED SOME DEBRIS FLYING OUT FROM THE BACK OF MY TRAILER HITTING CARS BEHIND ME I SLOWED DOWN AND EXITED THE FREEWAY. I STARTED TO LOOK AROUND THE TRAILER AND FOUND THAT THE UNDER SIDE OF THE TRAILER HAD COME LOOSE AND WHEN IT HIT THE GROUND IT EXPLODED AND THE PIECES OF  THE DEBRIS I HAD SEEN WERE THE PLASTIC BELLY COMING OFF AND THE INSULATION  THIS COULD BE A DANGER TO CAR FOLLOWING TO CLOSE.",
        "vin": "1UJBJ0BN7H7"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "05/02/2018",
        "fire": false,
        "manufacturer": "Jayco, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091718,
        "products": [
            {
                "manufacturer": "Jayco, Inc.",
                "productMake": "JAYCO",
                "productModel": "JAY FEATHER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "AN APPOINTMENT WAS MADE FOR MAY 4, 2018 WITH  THE DEALERSHIP TO REPACK LIGHTING PER CAMPAIGN 17V-290. THE DEALER IS ALBANY RV, 48 RENSSELAER AVE., LATHAM, NY 12110.  ON MAY 2, AFTER TRYING TO CONFIRM THE APPOINTMENT, I WAS ADVISED THAT I DIDN'T HAVE AN APPOINTMENT BECAUSE IT WAS MADE BY A TERMINATED EMPLOYEE. THIS RESERVATION WAS MADE ABOUT 5 MONTHS AGO. THE BOTTOM LINE, MY TIME IS LIMITED, I HAVE TO SCHEDULE TIME OFF FAR IN ADVANCE. BELIEVING THAT  ALBANY RV WAS A REPUTABLE COMPANY I LEARNED IT HAS A BLATANT DISREGARD FOR CUSTOMER SAFETY OR THEIR CUSTOMERS  WELL BEING.  I DID CALL THE JAYCO HEADQUARTERS WHO TRIED TO INTERVENE BUT HAD NO SUCCESS. APPARENTLY THEY'VE RECEIVED MANY COMPLAINTS. MY CONTACT AT ALBANY WAS [XXX], HER SUPERVISOR WAS [XXX] WHO NEVER RESPONDED TO DIRECT REQUESTS THAT HE SPEAK WITH ME. PLEASE SEE THE ATTACHED PDF. MY NAME IS [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1UJBJHBK3H1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Jayco, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012678,
        "products": [
            {
                "manufacturer": "Jayco, Inc.",
                "productMake": "JAYCO",
                "productModel": "JAY FEATHER",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2017 JAYCO 23BHM JAY FEATHER TT BACK IN JAN 2017.  OVERALL I'M SATISFIED WITH THE QUALITY AND THE DESIGN OF THIS UNIT. I DO HAVE ONE SAFETY CONCERN OVER THE DECISION BE IT AT THE FACTORY PRODUCTION LEVEL OR BACK AT THE BEGINNING OF THE DESIGN STAGE. MY 2 ENTRY DOOR UNIT HAS A 3 STEP STAIR SET AT THE FRONT BUT ONLY A 2 STEP STAIR AT THE REAR DOOR. I WAS NOT TOLD THIS NOR DID I NOTICE IT UNTIL AFTER I PURCHASED THE TRAILER. THIS IS VERY UNSAFE FOR THOSE WHO ENTER MY UNIT FROM THE FRONT AND FOR WHAT EVER REASON EXIT OUT THE REAR DOOR NOT KNOWING THE DIFFERENCE IN THE NUMBER OF STEPS UNTIL THEY ARE TAKING THEIR LAST STEP. I'VE HAD A FEW FELLOW CAMPERS ALREADY ASK ME WHY JAYCO WOULD DO SUCH A THING ON THEIR TRAVEL TRAILERS. I CAN'T GIVE THEM A GOOD ANSWER OTHER THAN A SUPPOSED COST SAVINGS. I SEE THIS AS COST OVER SAFETY. ONLY THIS DECISION CAN END UP BEING VERY COSTLY THROUGH AN UNEXPECTED FALL AND POSSIBLE INJURY NOT TO MENTION THE LEGAL END OF THINGS. I'VE NOTICED THAT THE 2018 MODEL OF THIS UNIT HAS CORRECTED THIS SAFETY PROBLEM. I ASKED JAYCO WHAT THEY RECOMMEND I DO SHORT OF WARNING EVERYONE TO NOT USE THE BACK DOOR OF MY TRAILER? NO RESPONSE OTHER THAN AN EMAIL TO MY CONCERN TELLING ME THIS IS THE WAY THESE UNIT ARE AND DESIGNS CHANGE FROM TIME TO TIME.  I STILL VIEW THIS AS A VERY UNSAFE PRODUCTION CHOICE AND AN ACCIDENT READY TO HAPPEN NOT ONLY FOR ME BUT FOR ALL WHO HAVE THIS TYPE OF FRONT AND REAR STEP MIS-MATCH.  PLEASE ADVISE.  THANK YOU.",
        "vin": "1UJBJ0BM7H1"
    }
]