[
    {
        "components": "FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "05/13/2021",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11416436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2017 LEXUS GX460. THE CONTACT STATED THAT THE CRUISE CONTROL FAILED TO OPERATE CORRECTLY. WHILE DRIVING WITH THE CRUISE CONTROL SET AT 65 MPH, THE AUTOMATIC EMERGENCY BRAKING SYSTEM ENGAGED INDEPENDENTLY AND BROUGHT THE VEHICLE TO A SUDDEN STOP. THE FAILURE WAS EXPERIENCED ON NUMEROUS OCCASIONS. THE CONTACT STATED THAT ON ONE OCCASION THE CONTACT AVOIDED A NEAR COLLISION WITH A SEMI TRUCK. THE CONTACT ALSO STATED THAT ON SEVERAL OCCASIONS WHILE DRIVING WITH THE CRUISE CONTROL ACTIVATED, WITH A VEHICLE IN THE RIGHT LANE, THE EMERGENCY AUTOMATIC BRAKING SYSTEM ACTIVATED. THE VEHICLE WAS TAKEN TO SHEEHY LEXUS OF ANNAPOLIS (121 FERGUSON RD, ANNAPOLIS, MD 21409, (410) 266-3330) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ISSUE WAS A KNOWN ISSUE HOWEVER, THERE WAS NO AVAILABLE FIX FOR THE ISSUE. THE DEALER REPLACED THE BRAKES WHICH FAILED TO FIX THE ISSUE. THE VEHICLE WAS NOT YET REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 54,000.",
        "vin": "JTJJM7FX1H5"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/26/2020",
        "dateOfIncident": "10/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366484,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PULLING INTO PARKING SPOT, COMING TO A STOP, WHEN ACCELERATOR STUCK AND CAR DROVE THROUGH BRICK WALL WHILE DRIVER WAS TRYING TO BRAKE",
        "vin": "JTJBM7FXXH5"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/19/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329799,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNROOF GLASS SPONTANEOUSLY SHATTERED WHILE DRIVING ON THE HIGHWAY AT 70 MPH. THERE WAS NO PROJECTILE WHICH CAUSED THE GLASS TO SHATTER. WE WERE NOT NEAR AN OVERPASS, THERE WERE NO OTHER CARS NEARBY, AND THERE WAS FARMLAND ON ALL SIDES. *TR",
        "vin": "JTJBM7FX2H5"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/02/2019",
        "dateOfIncident": "04/30/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205153,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN ACCIDENT AND MY AIRBAGS DID NOT DEPLOY.  I WAS TRAVELING ON A MAIN ROAD AND SOMEONE CUT ME OFF.  I HIT THE OTHER CAR DIRECTLY.  THE FIRE AND POLICE OFFICERS AT THE SCENE SAID THEY THOUGHT THEY SHOULD HAVE DEPLOYED GIVEN THE EXTENT OF THE ACCIDENT.  I'M FINE AND AM ACTUALLY THANKFUL THEY DIDN'T GO OFF BUT THEY SUGGESTED THAT I SUBMIT IT FOR INVESTIGATION.",
        "vin": "JTJBM7FX4H5"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11152425,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ARRIVED AT A WAREHOUSE TO UNLOAD BOXES FROM THE TRUNK OF CAR. HAD 2 PASSENGERS IN VEHICLE. BACKED INTO UNLOADING ZONE AND PARKED CLOSE TO THE DOOR. OPENED THE DRIVER'S DOOR LEAVING IT OPEN. PASSENGERS GOT OUT OF THE VEHICLE LEAVING THE PASSENGERS DOOR OPEN. AFTER SPEAKING WITH THE WAREHOUSE MANAGER, DRIVER AND PASSENGER STARTED TO UNLOAD THE VEHICLE FROM THE TRUNK. ALL PASSENGERS WERE OUT OF THE VEHICLE FOR SEVERAL MINUTES. THE CAR STARTED ROLLING BACKWARDS WHEN DRIVER WAS BEHIND UNLOADING BOXES. DRIVER GOT PINNED BY THE CAR AGAINST THE GARAGE WALL AND WAS PINNED BY THE LEFT BUMPER AND TAILLIGHT. . HEAD CRUSHING INJURY, BROKEN SHOULDER. BROKEN WRIST.  ONE OF THE OTHER PEOPLE WERE ABLE TO STOP THE CAR AND PULL FORWARD. DRIVER SURVIVED BUT SUSTAINED SIGNIFICANT INJURIES. 10 PIECES OF GLASS IN SIDE OF FACE AND SKULL WHICH WERE REMOVED FROM HOSPITAL.",
        "vin": "JTJBM7FX1H5"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/10/2018",
        "dateOfIncident": "03/05/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078451,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AROUND 40 MPH AND WAS HIT IN THE SIDE BY A DRIVER WHO RAN A STOP SIGN AT A SCREECHING HALT AND HIT MY PASSENGER SIDE FRONT AND REAR. I FLIPPED 2.5 TIMES AND LANDED UPSIDE DOWN. I WAS ABLE TO EXIT THE VEHICLE THROUGH THE REAR WINDOWS MY CHILD. THE CAR KEPT ME SAFE AS FAR AS AIRBAGS AND SEATBELT. WE HAD SOME INJURIES BUT NO BROKEN BONES. AFTER RESEARCHING, I FIND THE GX IS KNOWN TO HAVE A STABILITY ISSUE AND FLIP FROM EVEN SMALL IMPACTS FROM THE SIDE. THIS ACCIDENT COULD HAVE BEEN WAY WORSE AS MY CAR WAS TOTALED AND ALL AIRBAGS DEPLOYED EXCEPT FOR FRONT STEERING AND DASH.THEY NEED TO FIX THIS ISSUE. AS FAR AS HOLDING UP IN THE ROLLOVER, THE CABIN AREA WAS INTACT MOSTLY. BUT THE CAR SHOULD NOT HAVE ROLLED OVER AND IF I WAS ON THE INTERSTATE OR HAD OTHER CARS COMING AT ME, IT MAY HAVE BEEN WORSE. THE STABILITY ISSUE NEEDS TO BE FIXED.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/30/2018",
        "dateOfIncident": "01/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065851,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING LEFT INTO NEIGHBORHOOD AND STRUCK REAR PASSENGER SIDE PANEL BEHIND THE TIRE (BUMPER AREA).  I WAS GOING APPROX 10-15 MPH, OTHER VEHICLE (CAMRY) WAS GOING 40 MPH.  CAR ROLLED TWICE.  I BELIEVE THIS IS DUE TO A KNOWN ISSUE WITH THIS MODEL LEANING TO THE RIGHT, WHICH CAUSES AN INCREASED ROLLOVER RISK ON LEFT HAND TURNS.  IT SEEMS THAT LEXUS IS AWARE, BUT HAS NOT ADDRESSED THE ISSUE.  HAPPY TO PROVIDE PHOTOS OR ADDITIONAL DOCUMENTATION IF NEEDED.",
        "vin": "JTJBM7FX1H5"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "08/18/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062757,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE LEANS TO THE RIGHT (PASSENGER SIDE) ABOUT 1 1/4 COMPARED TO LEFT SIDE SINCE DAY 1 AFTER PURCHASE. I CONTACTED 3 LEXUS DEALERS AND WAS TOLD \"IT IS WITHIN SPECS\". THIS IS A KNOWN ISSUE ON GX 460 MODELS BUT LEXUS REFUSES TO ADMIT IT. THEY REFUSE TO REPAIR IT. THE VEHICLE HAS EXTREME BODY ROLL TO THE RIGHT DURING LEFT TURNS AND FEELS A LOT MORE STABLE DURING RIGHT TURNS. THIS IS A MAJOR SAFETY CONCERN. I CONTACTED THE LEXUS CORPORATE OFFICE AND WAS TOLD THAT THIS IS A \"CHARACTERISTIC OF THE VEHICLE\" AND THEY WILL NOT REPAIR IT. I WAS LIED BY A SERVICE FOREMAN THAT THE VEHICLE WAS DESIGNED THIS WAY. I DID A LOT OF RESEARCH ON THIS ISSUE AND BASED ON SEVERAL TECHNICAL DOCUMENTS IT IS CAUSED BY IMBALANCE BETWEEN THE 2 CYLINDERS ON THE KDSS. PROPER PROCEDURE IS TO BLEED AND RE-FILL THE KDSS SYSTEM BUT LEXUS REFUSES TO DO IT. I WAS TOLD BY A SERVICE MANAGER THAT THIS IS AN EXPENSIVE AND LENGTHY PROCEDURE AND DEALERS AVOID DOING IT. THE VEHICLE HAS ABOUT 10,000 MILES NOT AND IT FEELS EXTREMELY UNSAFE TO DRIVE. I SEE AT LEAST 1 LEXUS GX460 EVERY 1-2 DAYS ON THE ROAD THAT LEANS TO THE RIGHT. I TALKED WITH MULTIPLE OWNERS WHO DIDN'T EVEN NOTICE IT BUT TOTALLY AGREED THAT THEIR VEHICLE WAS LEANING AND FEELS DIFFERENT DURING LEFT TURNS COMPARED TO RIGHT TURNS. THIS IS A MAJOR ISSUE ON MANY TOYOTA VEHICLES EQUIPPED WITH KDSS. THE GX 460 IS SOLD IN THE REST OF THE WORLD AS THE TOYOTA LANDCRUISER PRADO AND THEY ALSO HAVE THE SAME ISSUE. IS IS AN ONGOING PROBLEM SINCE 2007 WHEN THE KDSS WAS INTRODUCED ON THE LEXUS GX 470 AND LATER INSTALLED IN THE 4RUNNERS AND TOYOTA LANDCRUISERS 200. WORST PART IS THAT LEXUS IN NOT WILLING TO HELP AND MOST DEALERS DON'T EVEN KNOW HOW TO REPAIR IT. THEY SIMPLY SAY: \"YOUR VEHICLE IS WITHIN SPECS\". THIS IS A MAJOR, MAJOR SAFETY ISSUE. FOR A VEHICLE WITH SUCH HIGH CENTER OF GRAVITY, LEANING ON ONE SIDE CAN CAUSE THE VEHICLE TO ROLL OVER !",
        "vin": "JTJBM7FX8H5"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/10/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062065,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX460",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS TRAVELING AT ABOUT 60 MILES PER HOUR ON A FLAT ROAD AT 5:30 PM WHEN A LOUD BANG WAS HEARD. WE NOTICED THAT THE SUNROOF HAS COMPLETELY SHATTERED, BUT STAYED INTACT. SMALL SHARDS OF  OF GLASS FELL INSIDE. THE TEMPERATURE WAS 55 DEGREES FAHRENHEIT OUTSIDE AND 69 INSIDE. WE CLOSED THE COVER SO NO GLASS WOULD FALL INSIDE. THE SUNROOF DOES NOT LOOK LIKE ANYTHING HIT IT AND THE VEHICLE IS STORED IN THE GARAGE.",
        "vin": "JTJBM7FX3H5"
    }
]